{"month": "10", "state": "TX", "station": "KUT", "content": "And it was is of building experience as an actor\nAnd he was at the house wasn't trying to use [laughter] ... and then if I have to hear one law Kurtis Blow some okay [laughter]\nI I was I was and did you really put a ban on your car driving around Los Angeles\nI sure [laughter] I I mean it is still on their\nIf their loan it I don't know home and take it off after voter ... keep it on and do we find out I don't know if the\n... what is it like now that you all been nominated can you all go out and be normal people now or has gotten a little bit of health and skilled\nNow it's been completely normal you know I Am able to go out and go to the grocery store and run errands and do everything that I Need to do\n... going and going to go\nSee thing happened in the other day it was kind of\nBlew my mind about my wife is pumpkin or something [laughter] we left the upper or at the party open beer for for a drink at all and the guy he wants to be said about what kind of your autograph I'm like okay sure this guy had like five of my headset criminal eight by man fucking paper I was like blown away I was like they\nHave to do with this because this really happening so it was really really humbling experience and to to be in the realm of like I said they're happening all the time with other celebrities but I don't put myself in that category I don't like people like one of my autograph\nBut it's still a very rewarding experience who has been widely appreciate your work the way they are waiting outside of venue for you to come and tell all of that\n... on this and you do much law firm Boies said\nYes [laughter] yeah [laughter]\nWhen you look at ... when you look at you and all journey those from what has has kept you on on the straight and narrow\nEach other in God\nAnd man on the same ... and so in Detroit what are you doing are you are you on a performing or or what\nI actually have a film that are producing I Am in coffee somebody and we're having a permit for it on Sunday itself the mall so we're definitely because I was ... um radio interview TV interview just to kind of\nPromoting it brings together in support\nDo understand that you gotta you have an entertainment company I receive some newer urban vision in urban vision and to tell us about that\nYeah everybody's entertainment something are created when I was about Eighteen or Nineteen and it was just something that I wanted to to represent where I come from that is urban which is in a sense of I wanted\nTo be something that I could get caught up in as a young kid\nI wanted to go and managed artist I wanted to make a difference in my community so that was for me was ... is what I I saw I didn't want to just to be it would be in the urban community but\nWorldwide and it was just something that I came up with in that point on I've just been kind of developing ... getting into the point where they actually can be a big name company at some point\nI've been asking all my guests since last week since the queen of soul regional Franklin passed away in the last ... urine Detroit's boneless elected to go first of Kelly ... Franklin moment\nYou know I did not have the opportunity to meet her in person by\nSome tuna listening to music\nYeah absolutely respect and I think was that was the hit for me me and now I'm In I remember the episodes of fresh print swear Tatiana Ali performed a song and it was just fight yes that's what I Want all the SPCA T\nFind out what it means to me and at that that's one of my biggest like hot yes reach a\nThat was the moment no do you ever read the regular moment Chely took mine\n[laughter] so I'm going to have the same thing same say nothing [laughter]\nWas someone wants to answering your you awesome freshman what advice would you give them\nThe crash studying what it is that you want to do and understand that it may not be in front of the camera where your best to make the on the camera or is that there isn't always have to be\nDirectly in the industry ... the entertainment lawyer if someone who'd actually hoping someone get to the next level and I did understand have to know\nEverything about this and if you don't learn as much as they can and then also know that if you want to do is do you still have to be so hot cocky and you have to be so on and it you have to appreciate your so on somebody else getting\nOn the sink Kelly\nYeah I think also just be clear on what it is that you want from\nThis industry if you are in it for the same notoriety money e clear and understand what comes with that I think for me I did not began to truly see success until I stopped focusing on the attention and started focusing on the assignment that guy had\n... for me and so my prayer is always with whatever audition if there's an assignment that you have for me to for sale or something for me to receive on descent and that's where I Want to be and if not I don't and so I think just being very clear\nOn what your purpose is and wanting to be in this industry will help to guide you one\nFinal question what movie you're working on in Oakland\nI'm working on a film called all day and night which is written and directed by jello Biafra call he is being co writer of Black Panther and it is dying Jeffrey White and Ashton Sanders Regina Taylor and also in it and it's an amazing found already where it's\nShooting it but I already know that it's going to be amazing\n... what did you see on Netflix ... what do you have coming up next\nWhat I have coming up is I'm working on a domestic violence documentary called the butler along the victim where I'm pretty much just be helping women I'm sure their voice to lift stories and bring awareness to the\nEpidemic that's been happening in men being a part of that problem I Want it to be part of the solution\nAny final comments\nThank you thank you for having it ... when you do not take this were granted at all\nThank you often representing and you know we got our fingers crossed\nAbsolutely oh right absolutely\nGary engine red in Melbourne Jackson junior the first African American couple enemy nominees\nHave you have questions comments or suggestions as to a future in black America programs email us ... in black America ed K. U. T. dot ORG also let us know would radio station you heard is over remember July 'cause on Facebook and the follow us on Twitter\nThe views and opinions expressed on this program I'm not necessarily those are the station or of the University of Texas at Austin\nYou been in previous programs on line and tell you to doubt ORG until we have the opportunity again for ten years ago where there was a day with our is I'm John their own hands and junior thank you for joining us today please join us again next week CD copies of this program\nAre available and may be purchased by writing in black America CD K. U. T. radio\n... Austin, Texas Seventy seven one team\nThat seemed like America the dean K. U. T. radio\nThree hundred with the heat in\nAustin, Texas seven eight seven one to\nThis has been a production of K. U. T. radio\nMcKay U. T. public media studios you're listening to K. U. T. K. U. T. H.\nD. went off in central Texas home for NPR and the BBC\nSupport comes from camp contemporary October twenty it transforming Laguna Gloria into a creative camp for adults aren't making campfires campus fire fair cocktails music including locker Lukens and more tickets at the contemporary often dot org slash camp\nThe K U G for membership Dr officially starts in less than a week but you can support the news and information programs you depend on right now go to U. T. dot O. R. G. and contribute after ten dollars a month or above level and we will say a big thank you with a K. U. T. public radio ... T shirt\nAnd two of our cool new plastic pine glasses donate today donate right now I K. U. T. dot ORG\nAnd banks and thanks for listening to K U T Ninety point five Austin's NPR station have a great night [noise]\n[noise] [noise]\n\nIt's all going to get a lot of them are very good morning to you all can use it on the BBC ... suffers a coffee shop on me all of\nHis income now says if the Saudi crown prince Mohammed bin Salman had nothing to do with the killing of disappearance of Janis ...\nAlso Iranians are beginning to feel the impact of the leaves just sunk chimps just got to see the real has plunged other countries running out of a lot to\nCanada which has one of the highest rate the candidates say uses in the world has become only the second country and the well to legalize the use of cannabis\nFound ahead of the U.S midterm elections to find out why it's liberal established democracies are losing out can you come up as one of the progressive wing of the boxes with lots of the largest business was for his for your own music to believe he's [noise]\nA credible a believable\nAnd to some positive ... who used to be the U.S ambassador to Yemen [noise]\nThat would you miss mid term elections ... Democrats are hoping to ride and be way then regained control of one or both houses of Congress\nIn primary interactions to determine turn to several establish Democrats lost down to new companies on the progressive wing of the Palestinian even in some of those ... pounds of the country\nSame economic sounding if in one of those cases Nebraska I [noise]\n[noise] Hi how are ya my entire life and I think you're doing\nNothing can be a dangerous tissue for inspiring member of\nCongress that by saying this little tiny white guy\nHanging in this woman and her I tend to have been that me and leading on my hand and I didn't want her to see any of that house he only had half Coleman and health care important to her and I didn't want to look into\nThe candidate with the ... the price of commitment is ... Eastman social support publicly funded universal healthcare system policy known as many cancel\nPitch long considered too left wing out here in the great plains help to defeat them more centrist ex congressman to become the party's candidate and it's a message that seems to resonate\nAnd they'd be able to count on your hands parity and man I I mean\nHe's been tell me why health care is not motivated to run for Congress\nMy mom was diagnosed with cancer for the time and prescribed a town that weighs twenty five hundred dollars and we one pill one town and that was something she was going to have to take monthly\nAnd I remember saying to her on the phone how can a penalty twenty five hundred dollars and you know Medicare of course it would be covered and she said it wasn't and that that was in addition to the eight hundred dollars a month she was already paying in prescriptions\nAnd I didn't realize that the issue of pharmaceutical hot than our country was so out of control\nOf the way\nShe drives around the neighborhood with a campaign stop its policies but punk rock which dominates conversation something else that makes him an unconventional confidence in the language the conservative state\nPresident of the United states and Iran\nContra Eastman husband is the lead singer of a band a ban which the ... green day these music he's blasting from the ... [noise]\nYou really out of the punk rock candidate family's funny because the band that I was in some way and that was already formed an end to the time and I have and that had to call her name and said that he asked\nMe the night when a labs are using the right of it says pieces of\nCar evening radical sisters moving in college\nAnd this is not radio attack ad frames context against the ministry veteran\nWell these men were dropping bombs gum and bacon was serving in the air force a liberal radical American\nPatriot Hey Don bacon I had a dog well that's all right we're going to have a good guard dog\nAlso braving the neighborhood dogs had decidedly known punk Republican opponent don't bacon is a one term congressman and ... to mid ... general\nOffices here that everything is not very highly posts are speaking out there but anyway uh well yeah the name I notice he made the bacon jak they do every time [laughter]\nI said when he saw making is even better if you take a hard Santa Washington you will take the heat that's why I don't like breaking of viewing get our economy moving let her health care for the cars ever wanted to read those that you throw the baking is even better what are you getting my flyer okay and he ...\nHe says that he's turning up the heat on his opponent\nI'm pro union I don't have any issues or say one\nGetting inducement from traditionally democratic supporting unions feel uneasy with the policies moved to the next\nI Know in this district they want to Nebraska conservative represented a lot on on Bernie Sanders democratic socialist a net and that's the choice in this race\nOn your support on November ... All right you might find a couple more questions All right\nAs young bacon campaign volunteers campus votes we get the view of the wise old man of the Republican Party how do full Tim congressman and to tell the mayor of Omaha he says the bacon Eastman contest has national implications\nThe ... race for the house seat here as a bellwether indicator seems to me that have done bacon the Republican nominee winds here that will be a signal that the composition of the voter is still leaning objectively moderately to the right\nAnd that was how do the ending that report by Jamie ...\nYou're listening to music six ten minutes up to four o'clock in the long been\nAn olive cars to deal with comedy show no top story because the Trump sees the world should know condemn so delete doesn't do all the fuss of known above the disappearance of the Saudi journalist ... shall do\nAlso the U.S government is trying to prevent the citizens joining a large number of Latin America microbes trying to reach the United states and kind of the of legalized the so called some some of kind of history expect\nTo speak to someone to show some perspective on Dutch with a few minutes to to see if you go\nThat's got this one is that what comes\nNext coming from sort of step closer to qualify for next year's ... nations league finals the first woman to if it's kind of debating Germany in Paris on Tuesday night\nThe world champions came from a go down to ... to one and lead guy in the Ukraine be Czech Republic one Neal they're promoted from group one will be the Republican line them one meal to go ... group full\nMadagascar qualified for the effort to a couple of nations for the first time\nMaybe Ecuadorian guinea one meal to clinch their place in next juice finals and Cameroon\nAnd there'll be joined by sending gold who also qualified from group payoff for one new between Sudan and by Tunisia and Egypt both qualified from group J Tunisia one to one in Asia each one to nearly as sweat teeny\nAnd yet me game of the new NBA season Boston ... Philadelphia or a hundred and five to eighty seven and a major League Baseball's Boston big Houston eight to in game three of their American League championship series it too and I know in the best of seven series withdrawing qualify for the world series ...\nThank you now to Canada which has just become the second only country\nIn the world to legalize recreational nylon Eddie historic moment happened just that he managed to go in the east in most parts of the country and stroke of midnight let's go now live to Newfoundland and the provincial capital since ... and talk to the Canadian\nBoth corporations Chris O'Neal gates creates it sounds pretty busy that ad tennis tennis what are you saying\nAll night there was all lined up around the corner outside of the trade marijuana shops and uh it's just a steady stream of people coming in\nCounters that people are laughing\nOf marijuana from those that are on clay and I know that\nYou're British law\nCouple of not in the u._k. there is one flavor\nWhich is labeled about morals\nState\nRight now so surprised about the Canadian the royal family now but there and they've got the rations went in the household had received and ... and then you know detailing stuck on the new ... and and and they were public and win a campaign says well tell us about that\nYeah there were like awareness campaign sent me to move to legalize pattern that was back\nYou know forty years Justin Trudeau prime minister made it happened but for ... years ago in Nineteen Seventy eight his father\nMinister wanted to do the same thing\nHas been a fair amount of education it is a federal initiative for all the provinces of territory the data that have to get ready as it was quite an echo that period of\nThe legalized safe and how it unfolded in various ...\nPublic safety police patrol how they would in a case of someone having too much alcohol there's no way\nHave to come up with a way of testing whether somebody with a under the influence our\nCandidates behind the wheel so how do they test that because that that's just intriguing how will they passed if someone has drug impaired driving\nA machine that they use that it doesn't hurt the mouth [noise]\nFun way to tell him to take someone to a hospital and have a blood test so you can imagine some of the police force\nBasically saying you know this is onerous on our website of learning\nSeveral senior executives from European and American banks and corporations are most withdrawn from the conference since ... disappearance\nThough on June government desserts citizens not to join a migrant kind of I'm headed towards the U.S border seeing it is a political ploy to destabilize the country earlier President Trump said he'd\nCut aid to the impoverished Central American country if it didn't stop the illegal migrants street is\nReconsidering an offer from New Zealand recent one hundred and fifty refugees a year from St Louis offshore detention centers Congress rejected the off for five years ago she would give asylum seekers about do roots into history Leah ...\nKind of is can be legally sued in stores in Canada for him to be making second country after you to ... to legalize the sale of the substance for recreational use ... was a campaign promise of the prime minister Justin Trudeau who said the measure is aimed at stopping massive profits we've organized crime [noise]\nNew research into life expectancy around the world suggests that China will move up the rankings was the average lifespan increasing by six more years to eighty two by twenty forty ... in Japan\nAnd scientists them from the the dogs accompany the first farmers to migrate outside the middle east nine thousand years ago\n[noise] BBC News [noise]\nIf you don't know where you think this is coming to us from London numbered wanting to come to show up on me all the cars you\nIn a moment to do a gun he's really think that politicians\nAre us from New York streaming refugees to become shove [noise]\nOf Egypt in primaries to be a murder has named a new cabinet and ... the ministers are women you said we would help them to fight against corruption of the the the rumble on us ...\nWould be used for the most real has spoken to call ... ... you know tall who is from big show them how to of course for him to be in a suburb of of the question was what the rules will be given to his room and\nGiving cues from the whole ... the ... defense who's going to be headed by a woman made by some ... going to be the first time in the country or another key ministries position to be hit by a woman needed a new portfolio diminish ...\nPiece is going to be overseeing the country's security and intelligence operatives you've got to be a very ...\nAnd position which is going to be headed by a comedian who are used to be the speaker of the parliament until today\nAnd can you tell us a bit more about a ... a Tamil keys\nShe is widely seen as a key member of a prime minister out of hand the reformist young we can get the ruling party the PR beers hush of being in various positions before\nNow the ministry itself is one that he's quite curious to many people it's called the ministry of peace tell us a bit more about\nThis finding an eerie irony in each named them any peace and uh the the country's intelligence and security up on it to stop it's expected to operate the the chicken security apparatus has been ... for the past\nTwenty some years they've gone so a fear that it's a Monday it's beauty might be a little over a hundred or one of the members of the parliamentary election he raised the issue wings\nDiminished day's game to be involved they is it not she's going to be in charge of trying to contain some of the ethnic divisions that has been a large fixture on a large part of a Ethiopian psyche for many years this\nIs one concern that other people are raising kids she experienced enough to lead this ministry and try to sell the trick is is that in ... in fictions and conflicts that we're seeing some in Ethiopia\nOne body which has been campaigning for yes for this kind of piracy is the fifty fifty campaign group in Sierra Leone and all that much ... is the founder of that country's successive than national leaders have promised more roles in positions for women that have not filled filled that promises so\nFast wants her reaction to what's happening in Ethiopia\nI Am and I got the women are very happy to hear it because what we're we may not be looking for it and that was partly\nBecause the focus on New York and then when\nWe both work when it came from the fact that we we man I spoke to the kitchen and that you're not supposed to be in there\nAnd we're trying to say I don't know where you need it or they had ... million from work against those what we've got to have because you could\nLook at it for them or that type of thing that's missing that when women we still put them back home so that she had been in\nThat is ... ... who's the founder of the fifty fifty campaign group in Sierra Leone [noise]\nOf gum his son will be holding much delayed parliamentary elections this weekend the main focus is of course security if voting puzzle peacefully to boost hopes that next year's presidential election will be able to bring people to do the fighting to the government to the Taliban is far from the only challenge pretty soon become tree\nWhich is one of the poorest of loose developed in the world\nAnd many of comedies are growing increasingly disillusioned with politicians can among who sent us this report from\nRussia that they\nEvery day five year old ... helped collect water from this manual pump but his family\nDid the cube behind him about the young children in Paris full waking within the buckets in Jerry cans that poor neighborhood in the outskirts of Iraq isn't directly affected by the fighting elsewhere in the country but hardly anyone here\nHas hiked water electricity only run for around four hours a day\n... imaging\n... father ... diem a shopkeeper says he will vote in the upcoming elections but he doesn't have much faith politicians will improve life for his family is very off when I was on a hot\nIn Afghanistan no one who has been in power has ever done anything for the country they are just corrupt more people have nothing\nDespite billions of dollars of aid Afghanistan is a country still facing huge challenges outside the United nations office in Iraq [noise] some of around a hundred thousand\nPeople recently displaced from around the provinces by drought many seems desperate\nThere was no watering at all and no food to eat all the screens and who has dried up now we have [noise]\nLast year around the cost for the entire off on population crisis levels of food insecurity here because of the drought that bigger will be even higher country has a long way to go before I can address people take me\nTo say let me get it I see\nSome of what she of course been some progress over the costs Seventy years since the U.S led invasion\nAs a woman the heat for we wouldn't have been allowed outside Malone and understand the bond rule now she's an MP ms on the campaign trail fighting for reelection we are\nExperiencing at the new in all all politics\nAccording to the money that came\nTo improve the situation and\nThe humans I actually are not satisfied and I think part of this money went to the corruption into the pockets of the people that they really didn't have the willingness\nTo keep the cross I've gone to some I've been covered in posted the candidates but internationally these elections are seen as a dry run for the more important presidential election scheduled for next year\nWith enough people feel safe enough to vote\nWith the results be marred by food\nOf\nThe bus station in Iraq the many young men on waiting to find out they're leaving the country as refugees and migrants\nOne in Minnesota\nI really can't tell the difference between the government the Taliban and criminals so I'm going to Iran and then on to go to this new money you know jobs nothing to do its thing here is like committing suicide\nIt's maybe three am in the morning and the buses heading towards the uranium Buddha a full one official tells me around five hundred people leave the country from here every night\nShouldn't be allowed inside temples\nBy the Supreme Court has been pretty clear in his judgment and it says quote the social exclusion of women based on ... the the the fall of liberty or just on a car to go through some values\nAbout religious groups have argued about the court shouldn't be Saturday and religious smarter about the protests against the ...\nOf these so I I've been reading up on the story and the times of India and she has one of the women actually protesting against is when you also say protest what shape and form will this taken care of a camera no\nThat's right dark on Easter religious groups have said that they are some men and women are have tried to end up they will live on the ground in the hundreds to prevent and drew from it will be a threat than do cardio lost sight\nBoom and enter the complex the police and said administer ... all taking no chances I mean just before we came and be a local media is reported that several people have been arrested on the Denver side\nSeparate them and I've reported that they are being stopped some ... ... ... should the temple site and many others and said to be well off to descend bought from Boston that led to the side so a lot of drama unfolding as we speak\nOr in or near the temperate complex endeavor like army\nWhat's the result from the government then there was also the government\nSo the government has been pretty clear it says that it will go ahead and implement the court order as bone to do because remember if anybody was wants to disobey or induced Supreme Court which was ... off of the line or was it was this will be a quarter that would amount to condemn the porch\nSo from way you are ... well how do you see the situation and what what do you think will happen next you know a bunny I think\nThis is exposed a fault line but a much in modern Indian society today on the one hand there are all women's groups I'm ... in India who bashing down the ... tradition exact yucky posted on that one of the one side you know made by you know the laws that have been made up centuries ago most perfect but\nOn the other hand India to main street deeply rooted in tradition as the size of many religious customs following strictly for them in many of the country so this really seems to be a wall between some people who are looking into the future and other law upbringing rooted in the bottle\nAnd sadly India's or seem to be having to judge on who's on the right side of history and yeah so in a ... complex are\nSaying but they voted off the Supreme Court to review its decision taken a few weeks ago\nOkay the whole jumping to kind of freelance journalist and filmmaker in Mumbai that thank you very much\nFor being a roof do come be a real during among the most often from opposed the loan it's difficult building a new life unfit to me and put new culture\nNow a New York based companies employing women just from Syria Iraq kind of gone to ... to ... to ... ... ... ... is owned and run by classically trained chef entrepreneur you hung a bold bowed\nOut she's based in New York\nSo I think after the two thousand sixteen as the ... election um I like most of the people I knew um we're looking for ways to get more critically involved and to do more and disorder to speak out against the direction that the national conversation was headed in\nAnd um because of my back on and cooking I had always traveled\nTo eat and learn traditional foods I'm Still often from women um that\nWorking like a refugee she felt like a natural fit for me in a way for me to be involved um that and I knew that there was a lot going on in New York and you know around the world with refugees and should do to touch unnatural wage break down barriers between cultures and to help people build community\nUm and so in the spring of two thousand Seventeen restarted hosting dinners um and I engaged with the refugee resettlement agencies here in the city taught them about their project and they start to win that I was looking for and I'm\nNot just on their luck most of the women who found I wanted to you about abuse chefs or are they just come\nOn if you know for the most part that just really talented home cooks um when I talk with the resettlement agencies about what I was looking for it was a woman who is always bringing food to the office you know whose eyes light up when she talks about food you know not someone who just because it's a daily responsibility but who really loves food\nYou know that's what I found them talking about some of those stories will be telling you\nSure so right now we work with the Dina I'm and her daughter has a ... a day is eighty occurred and they fled Aleppo um seven years ago and came by a\nTurkey and they arrived in the U.S two years ago\nUm ... comes from Baghdad um chicken to Jordan she still separated from her\nHusband who remains in Jordan with some of some of their children to share with some some another three of their salaries [noise] um the and this scene from ... um came here after her husband went missing on believed\nKilled by the Taliban he was working with the U.S army and seeking try a Pakistan with her six children\nAnd I wonder if not environment that you know provides a speech to interrupt fruit juice with different stories different backgrounds who can because I Wonder if that offers some sort of therapy to them\nI think it absolutely does you know and with our\nDinners we really tried to highlight on each if they win and separately and feature they're they're ... on and they they get a chance to to interact with our guest and I think for them to be able to see the pleasure that people are taking in their food you know people's curiosity people's ... really\nYeah I Hope it gets in the sense of grounding and and uh\nAnd and the feeling that they're contributing and building a new life here\nSo Sunni rocky of Gandhi food maternal do which is impossible [laughter] no\nThere is so different I think that for me you know I had at least when I began this project or a a\nA familiarity with Syrian food which is wonderful and varied and I love it I'm Iraqi and Afghan food has been much more a voyage of discovery and the flavors are so different and I think at least here in the U. S. that they're much less well known so it's been exciting for me to learn about it myself and then to be able to share that\nWas a gold but a voyage of discovery does it mean but she doesn't like it very much for all the\nThings she likes it a lot of my favorite what's your liver\nAnd I'm going to have to say something and they say take makes everything I Love it and Jennifer I designed Mm but who do who makes it better made you into Kenyans\nA dozen lots I couldn't make the law was do there's a big argument in Kenya what I'm saying I'm going to the other five going on it's been long stomach but I'll tell you what\nSo I Know\nNobody quicker you gunned them [laughter]\nYou have to go\nOff and then you can listen to the\nMix and we want to go on that and when\n\nYou tuned into K. U. T. N. K. U. T. she went on\nWe our community supported public radio and we are you're central Texas on NPR and the BBC I'm Jerry count on and so having a clock makes there's been some time with\nThe U. T. ball memory of Dr officially starts in one week you can afford the news and information programs do you depend on right now\nAnd go to UT dot O. R. G. contributed to ten dollars a month or above level and we'll say thank you with the gay you see public radio in our T shirt and you've are cool new plastic behind glass donate right now at K. U. T. dot ORG and Thanks This is again the Ninety point five\nBut for hours GMT ... with the news or even from the b._b._c. World Service Canada becomes only the second country in the world to legalize recreational cannabis\nIt is obviously a sea change they drug has been a legal criminalized in Canada for almost a hundred years\nAs President Trump seeks to defend Saudi Arabia for the disappearance of Saudi journalist anger against the kingdom builds\nPeople don't go around killing and coughing up in this day and age ... if they do everybody in the house and my\nSon is will have the world's longest lifespan by twenty four so you are taking Japan according to a major study ... an Irish also when Samantha ... prize for novels set in the troubles\nSo I'm hoping I fit in it in such a way that it would come across says um representative of any society living under similar strict effect consensus a Netflix boost its customer base by millions\nResponse over the last few days and Mr ... says that it's his assessment from various meetings that there is a serious commitment to determine all the facts and ensure accountability he says including accountability for Saudi Arabia's senior leaders or senior officials\nAnd we've heard from the president appearing to give Saudi Arabia the benefits of the doubt\nYes this was an interview he gave to the Associated Press criticizing the mounting global condemnation of Saudi Arabia and he says blaming the kingdom before all the ... represents another case of guilty until proven innocent and he's referencing then\nThe judge Brett Kavanaugh case no justice on the Supreme Court the ... over his confirmation which involved sex insult comic oceans that whenever proven\nPresident Trump linking these two very different cases as he seems to all intents and purposes to be sticking to this learned that he believes the Saudi leadership is telling him\nWhen I was ... she was a contributing columnist for the Washington Post who'd been critical of the Saudi leadership and in fact has not been lost on many us politicians who convinced of Saudi Arabia is complicity in his death includes the leading Republican Senator Lindsey Graham oh\nVery\nSomebody shows up\nSeveral it impacts and do you think ... piece is going to have on how Washington acts now well\nLindsey Graham is very influential into a staunch supporter of these days of President Trump especially during the ... you know hearing on this kind of pressure may affect the president perhaps most significantly could strengthen the resolve of\nThose in Congress to make sure that as they see it Washington deals with this in a way that preserves America's integrity you could say it's moral authority on mothers' like this and it's something that many in Congress\nAre very concerned about President Trump really is looking rather more isolated is every day goes on\nA piece of buddies that will pressure from the international business community so sudden mounting on the Saudi Government more companies have pulled out of an investment conference in Saudi Arabia next week in the past couple of hours Christine ... of the IMF has said she went okay\nAnd Richard Branson ... pulled out last week he's now been expanding why\nWe're still waiting to come out with a how am I I'm not going to have to come out with a very good explanation in a way to change our lives are going to have [noise]\nPeople don't go around telling passing out I'm a stay an age and and I think every everybody how and why we have to make a [noise]\n[noise] well we do know that politicians such as the U.S treasury secretary Steven ... and the u._k. straight secretary the talks all stood on course to attend the conference up business editor Simon jak has more\nSome of the biggest ... of international business I sat there not going the boss of HSBC Jamie time in the ... thing from black crow it's a very long list of people who don't like the glass that this episode has pushed Henri ad and decided to show them that spotlight now one company from the u._k. who definitely will be making the trip\nIs be a systems the defense contract to no real surprise it sells one six of everything it makes to Saudi Arabia and six thousand employees in the kingdom so they will definitely be getting a call ... it'd be a relationship with Saudi Arabia has been one of the most loyal if you like and one of his controversial ever lost as he is\nBut was Simon jak speaking that\nHe research into life expectancy around the world suggests that China will move up the rankings with the average lifespan increasing by six more years to eighty two\nBy twenty forty it says those living the don't gets to be in Spain which she's going to take Japan dumped Raphael ... from the Institute for health metrics and evaluation at the University of Washington in Seattle has been involved in this study\nFor testing these ... no one has like a magic bullet to say this is going to happen so this is calling me from the signs and week out try to use a base awards scenarios\nUsing some crazy does like a racetrack doors or ISI the debacle article whole diet or it'll game show and I mean come on we can modify the musical dollars\nThat are going through these ... ... more like China or go to a degree in ... states\nWhy Spain in particular has done so well ... Fox has led you to your conclusions\nIn some ways ... life is like the G ... brakes measurement done taking go see that Asia and\nScenes and happening to the health system but also out titled than social that their rooms so state has a good system but also you know we're really shows when we pulled emphasizing the Indy ... meant Spain doing better than than others\nAnd is this is the ... one of the facts just opposite to the Spanish uh a very healthy\nReach from just are ... countries in general on Spain is in the in the good old old so we kind of goes you may get Ryan diets we can't go junior different style of life will do they're going through\nDumped to Rafael as owner that from the University of Washington must tell you about the ... and duchess of subjects continuing that trip to Australia Prince Harry\nAnd his wife making them in the town of ... in New South Wales set to our correspondent ... traveling with the role a couple of other chew how also just tell us what they're doing and debris festival\nOn June governments desserts citizens not to join a migrant caravans headed towards the U.S border saying it's a political ploy to destabilize the country earlier President Trump says he cut aid to the country if it didn't stop the illegal migrants\nAustralia's reconsidering an offer from New Zealand to resettle one hundred and fifty refugees a year from St Louis offshore detention centers Congress rejected zeal for five years ago seeing given asylum seekers about two and two ... be a New Zealand\n[noise] he's really ministry says it's counting at airstrikes on Gaza in response to the rocket fire from the Palestinian territory earlier tonight a rocket fired from Gaza landed near ... and the Israeli city of ...\n... can be legally sold in stores in Canada from today making it the second country after you to lie to legalize the seal of the substance for recreational use\nThe legalization was a campaign promise of the prime minister Justin Trudeau who said the measure is aimed at stopping massive profits going to organized crime\nAnd you research into life expectancy around the world suggests that China will move up the rankings with the average lifespan increasing by six more years to eighty two by twenty forty those who lived long this will be in Spain\nAnd Japan [noise] BBC News [noise]\nOf all I'm ... and this is Africa Speaks lumps will be on the BBC will southern [noise]\nSome of the richest people have been giving away billions of dollars in the name of global development\n[noise]\nGates and now that idea of giving that they give me half\nThat wealth away that would add up to about six hundred billion dollars\nI'm exploring how this big giving affects lives in Africa how it plays into debates about the role of international aid and read the philanthropy can help solve some of the world's biggest challenges\nFor security is a big issue in the African continent and a lot of the African countries don't grow their own food\nZimbabwean philanthropist an entrepreneur to fuel\nAnd they'll tell them that put just food are producing very limited variety of food the quality of food that then becomes available to the greater population\nIs not as Davis and is not as rich and is not really as nutritional is one would want you to be for a whole host of reasons from point investment in research patterns of climate changing also people keep going the same things that don't work anymore\nIn order to tackle some of these problems some big philanthropists of been pushing lots of money into developing a group called Jones' according to them\nReally our mission is to feed and write the proclamation of agriculture across the continent\nManaging director of the Rockefeller Foundation Africa mum or do we tell ya\nOur resources are who's got the dog we invest in research in finding new solutions that have the potential off with a lot because of the same thing things and helping these farmers close to use the ...\nGenetically production that's got to look on the short of security but also generate the ...\nBetween the Nineteen forties under nine two seven to the so called green revolution was headed by the Rockefeller Foundation in parts of locked in America and Asia large scale agriculture was promoted to taco farming and the curies\nBecause of the girls not everyone agreed with the high intensity scientific methods which goes declared by others a success story\nThere was a green revolution based on news the panic raise nutrition levels that reduced poverty and it was one of the great breakthroughs of all time that we need to bring that in van ... Africa\nIn two thousand and six [noise] we have to stop ... and ... minutes to get far bishop the lives for the green but we'll do something and not for\nJoins us now my green revolution [noise]\nTo see was husband tries is going to outgrow popular topic fund that Global Initiative which aims to make fun of me more productive\nI think the investment that is going into institutions like ugly is so critical to ensuring that we don't end up with these huge population growth that is dependent on importation of basic food\nChief executive officer of the bill and Melinda Gates foundation sue does want to help but\n... has funded the production of seven hundred and thirty four thousand tons and improved seats for African farmers it's provided scholarships to six hundred and eighty three PHD and master students to learn better agricultural technology\nAnd it's helped by point four million farmers learn about better farming methods those are the kinds of things with higher yielding crop varieties that are seen better understanding about soils\nThat African farmers need to cope with climate change\nThose are very specific investments that we at the foundation think are extremely important poorer small holder farmers so that they can feed their families and have some economic productivity as well [noise]\n... and its partners walk with ... produces a distribution of countries like kinda agriculture is integral told me to food but also a social economic and political issue [noise]\nReal walking through much across town which of course was the biggest city if you're still getting a skirt busy actually a little should it be happening here it'll be interesting to hear what they make all of the\nCulture of a group of business and how much influence does flip it up on the lives of farmers here\nAre some ... runs a small shopping much uncles suddenly got ...\n... if you buy the specific facts and food to the polls your microbes so much for me\nBy my from my job was going to do without owns yeah but what sort of problems with a faceless problem was when they come to see you\nUp that invest that my insect or all wrong guy\nOn W. from the ... the demand is growing more foremost coming to\nYou and your mind is growing because when we open ... yourself you're from a company\nBut now we can get many former every the economy would also do these shows and they were able to help them with a throwback to be how [noise]\nYou know country with some places don't see rain for up to three is under the face of serious problems like Crohn's disease scientific solutions like that the seeds ... as a pest control sort of like a welcome solution but not all ... will be the opposite pressure to change the centuries old\n[noise] the future of Moscow from us and then just because of the elements or control\nThis condition will produce the seats because you're through their chemicals control we're up north\nBecause you couldn't just small scale for most for justice lobby is king advocate of traditional organic farming and there he and others are worried about the procedure but we'll new technology being pushed or farmers\n... to ... almost ... percent that's more skill from us and does that is a huge market for waivers burdening a product\nAnd today referring to that day because of chemicals ... seeds you also get a better return and these chemicals that come with the killing will be dealing with a better place and in fact our picks for the ...\nAnd we also need to protect our biodiversity like you know ... we're producing off whatever it is\nA lot of parts of Kenya like eastern Kenya where we are the moments can barely feed themselves up as a result it would be important for us to increase productivity to increase out towards so that there is more food for everybody\nIn this area I hate to say this but combined which is ... is famous for struggling to feed itself for people here go hungry so what's wrong with making sure the interventions which could help feed those people are introduced like drugs is two seats\nIn the area as not seeing rating for three years is a policy ... ... is going to be to ... but sort of brought\nOne big field for some people is the prospect of genetically modified seeds Bill Gates has expressed support for ... in the fight against ... nutrition would have gone from South Africa most other countries on the continent of so far resisted adage remains any ...\nOr ... ... is very important we would have much to protect those but it is over I was from ... by ... because\n... ... ... what does that efficient it was a sustainable as the world begins to demand more food as people grow as families growing size as the need for more food production increases that it's sustainable to retain those traditional modes of practice\nWritten about six TV does by about Fifteen to ... to ... to ... ... the chicken and also spoke sprint being\n... and when\nMy home about ...\nTo dump looks at the top the funds to Cancun to walking for many years as a pilot\nI'm going to be chicken you have a whole host of that was underneath six tells them each and how many did you have been totally\n... most of it to ... yeah this is an example of a self sufficient homegrown from which survive without sort of becomes offensive or there's proof of what's possible but he does have its challenges\nThe hardest things about this farming is not having enough funds to expand as we'd like to see because the challenges will be getting money to buy their sights seeds you know feed for the chicken\nOr the opens you tune philanthropists who can come and go for you all those things and also with us from a welcome philanthropists of ...\nDifferent too much do you see the one equal flipped lead full of yesterday the justice of the company they have the buddy you don't\nHave the ... the ... got my nephew again\nBut in a situation where they have the money you don't have the money\nIf somebody has something to settle in Illinois for the money I'm sure that one equal equal level\nLook at your pharmacy successful over forty thousand chickens big supplies to big customers is but that's the same for many ... is\nThis more skilled Hama you must know the details about the whole thing\nWhat you what do you divorce because there's something hit and then somebody is should be free to be played on a\nSmall scale ... may well come on benefit from philanthropy but they're not really equal partners as some people question the belief that business models base to market forces on with tons of investments are really the best approach to the lumps will be\nThe American billionaire Warren Buffett one of the richest men in the world has been giving away a lot of his money to charge ... says\nPeter buffet I'm the co chair and co president of the Nobel Foundation the Nobel Foundation was created in two thousand six after my dad I call it the big bang he famously gave all his money away and my siblings in either three of us all received billion dollar foundations\nPizza buffets sets up his own charge to before they should but he's also wary of the beep beep this mentality jumps up philanthropists\nFlaps big comes generally from well it always comes from having a little bit of excess money and sometimes a lot so you get into a business mindset in terms of finding solutions at the solutions worked in business you carry those in the fall I have to be\nMy biggest criticism is that it's not looking deeply enough at its own behavior within the system and structures that it resides in when you just look at the resource extraction from Africa in general it I mean any where there's a lot of money moving back and forth\nSomebody's either extracting or trying to make up for it I think in a lot of ways\nAnd this is certainly not to disparage anybody's behavior or work because I think everybody's doing their best within the frame of what they know but what is at the root of it really is it really there to solve issues\nThat our current system is created\nOr is it there as part of that system\nI've heard that conversation around to capitalism and some of the consequences of capitalism and issues with the system does wouldn't helmet\nAnd questioning the role of philanthropy and whether or not till entropy just enhances that system here's the way I look at it I think there's something incredibly valuable and important that someone who's had wealth\nDoes when they decide that some of that wealth should be given back how one get his back and how one challenges some of the systemic issues that could enhance poverty\nI think is a really important public dialogue but I also think there's so many positive things about private industry we want that passion that talent that case that private industry has to be able to help with the things we're working on we look at where there's a market failures\nAnd say how can we use philanthropy to create potentially new markets where now companies that would never go to those markets can actually see some new customers\nDoesn't seem to to say about do send me shoes that global corporations might actually make him to Africa or used to watch very carefully you through philanthropy and that many of them will just simply extra resources for the call into the\nI don't worry about it but I actually think that just like philanthropy it private sector has to be accountable\nAnother small scale farm in Kenya has a mix of crops on bees are they helpful\nNo they're not um\nYou've asked Ivan schooling for ... [noise] so that you can see over do okay I was the other thing I saw this little gardening Miami's most envy auto Edward ... on that this is my little farm Abreu gives her eyes of vibe back a lot but we utilize all over the ... mixed farming\nOkay so let's just creates a well the weather is an opportunity for you to vote for philanthropy international philosophy yes or international philosophy no ... she and justice loving choose if it goes up to them\nOr international ...\nWhat about yourself oh did you vote\nNo ... [laughter] what because they don't have anybody sees a scheme of getting me so that they can report all from Africa but they're trying to do go to the money to do that that's what you said they also want their money to stay they went to sustain that a big myth that number one number two nuts over\nHaving the biggest money who don't really think that they're doing it for more reasons I don't know I'm just there for the game that why does that are\nJust as the richest people they wanted to control it so that they say the richest\nGlobal agricultural corporations are already investing in on developing muted motives with the Clinton a bunch of philanthropy really of this bumbling seemed to think ... ... ... ... people and resources much do we tell ya\nI don't believe in that I haven't seen it\nIn my work I have and being in a space where we have been talking about how can we\nExploit this quantum bit or how can we favor a particular company or not and I think that if that was the case you've got the call it for them to and I believe that other sister philanthropies or ... I'm ... ... be a fused of\nDucks my strong belief duct my strong point of view as an actor in this space\nIs not only wealthy Americans will giving money away some of the richest Africans are also joined in the wrong so bleak philanthropy so next time I asked whether the future of giving in Africa could be homegrown\nWe can be on ... Boston is no one is going after the challenges of this continent developed this ... what Africans themselves [noise]\nI'm calling because Joe announce it goes beep philanthropies produced by Joel ... so just read your production for the BBC well suffers\nK. U. T. N. K. U. P. H. D. one oh we're community support in public radio and we are you're central Texas home for NPR and the heat and you can always my news online and K. U. T. dot O. R. G. I'm sure it's midnight\nK. U. T. fall membership Dr officially starting last one we were you can support the news and information programs and on right now\nBut hey you feed on our gang contribute at ten dollars a month or above level and we will say thank\nYou I think Haiti public radio ... two of our core new plastic hind glasses donate today ... who are in jeans and thank you for supporting community support in public radio in Eugene Ninety point five [noise]\n[noise] it's six o'clock here in London hello and well continues down the b._b._c. World Service will aren't a lot in China [noise]\nCanada is legalizing cannabis we hear from the first policy outside the first show up to sell the first packs of legal kind of a ... it's a first because you can tell\nWe give an update on Brexit negotiations as a crucial some of the deadline arise today why there talk of needing more facts Rob Watson is here to explain full\nSo special report from a correspondent who's going to the size of the rockets attacking Yemen that killed ... two children\nTheir family and\nYour family [noise]\nWas that I read I was on\nThat side sounded the headmaster reading outlet niners one after another older gr and will be reporting from northern Yemen in twenty minutes time also ... will\nDo a ... or you will be here explaining opens he needs to know\nThe big sticking point is the status of the border between Northern Ireland and the republic of Ireland Britain's only land border with Europe\nEuropean leaders have said they need new fact so how likely is that well luckily\nAt the BBC's British affairs correspondent Rob Watson is here to help us understand it all and Rob you know what the first thing I thought when I read that story and me knowing that we were talking about as I only had a deadline which deadline another deadline can we start by explaining the deadline and what decisions were meant to happen today\nWell obviously the deadline is months twenty ninth right because that's one moral leaving the euro land grabs the big line ... by the way\nThey are they on the the idea was to go to an agreement no the today and all of a sort of a proper proper agreements proper summit celebrates a deal in November\nAnd the reason that was the ... you couldn't get it all costs through the European parliament's on the British parliament's and plenty of time for us much\n[noise] so so the ... technically what the paperwork things on paper were supposed to be agreed to date but that's not happening\nSo what was supposed to happen to the principal's was supposed to be agreed so they thought right we're really really close we might as well hold a special summit to sign off on the whole thing next month amongst all gonna\nAccept it yet either you it's not going to happen because there is a sticking point to that I was saying earlier the backstop at the center of this problem explain that to our listener was ...\nYou know what Robert I'm and I will but run and gun some massive deep so the real reason why I was looking at agreements today is because the u._k. governments are still negotiating with itself I mean if you like that is the soul to the secret yes\nOf ... and there is really off into a whiff of kale snow around the government's the British government's handling of it and I think it is in danger\nOf looking like a sort of international shambles if I wasn't happening already in the eyes of the world\nSo that the specific issue of the ... ... ... so the idea is you know both Britain and the ... really wants to have committed to avoid a hard border between ... between ... and they are public because they said that could be a target for permits actress\nBut the question is how do you do it and basically the sort of options that are being tried\nYou know even on a console to stay in the ... the cut up the whole of the u._k. console to stay in a you I mean obviously\nThe real hope on both sides somehow off to ... there'll be such a close free trade deal between the u._k. and the European Union that that wouldn't be a problem they always have a backstop has what you do just in case you don't get that kind of a deal\nBut is it something that the Europeans should be worrying about or is it more if you can't turn a problem\nOr when it's both [laughter] sorry it's it's both I mean I guess put crudely the the ...\nAnd crashing out to the ... without a deal as absolutely ... for the u._k. whatever any enthusiastic Brexit is might say but it's not great for the European Union either so I don't think there's any doubt that both sides are anxious to get to do is just how you get it to the ... the Europeans\nBut also acceptable to Britain's just incredibly divided political process I mean the reason why I often say shy of Britain is in a in a political crisis\nMany ordinary people might not feel it here yet is because it's politicians are there's no consensus on the most important issue of the day and palm and that is how it as Britain got out of the EU and then have a workable relationship with it off though it's\nRob many banks are British affairs correspondent Rob Watson [noise]\nUh this is news today from the BBC a very warm welcome at the top headlines a quick reminder\nUm actually my computer come fund the top headline so I'm afraid this surprise always come uh the Honduran government just trying to prevent it citizens joining a large number of Latin American migrants trying to reach the United states Canada\nHas legalized the sale on consumption of kind of is\nI'm going back to the ... story is well President Trump has been talking about the question of the disappeared dissident\nA dissident journalist as well he says that to\nA world leaders should not condemn Saudi Arabia until all the facts were known about the disappearance of ... ... know jump to judgment ah we've been hearing about this issue from the former U.S ambassador to a Gerald Michael Feinstein\nThe situation is still very tense years I think that most people believe that the Saudi Government the Saudi authorities need to explain\nWhat happened there were rumors here or as recently as yesterday that the Saudi authorities were about to release to save and acknowledging that responsibility for his death although whereas a exploration\nToday we saved or backtracked and uh they're getting the same debate denying it so I I think that most people here continue to expectations of demand that the Saudi authorities or come up with a better explanation of what exactly happened\nNow speaking to us a little you know that's a former U.S ambassador General Michael Feinstein now of the middle East Institute in Washington\nNow the video streaming service Netflix continues to take viewers from traditional broadcasters because of programs like this one [noise]\nI'm from [noise]\nFrom a\nClip from the grounds and if like me you are addicted and that was Netflix's drama about the British royal family you can see why these numbers are growing Netflix has revealed it has added millions of new subscribers are business at present or Rob young is here how many\nYeah Netflix added nearly seven million new customers in just three months and that brings its title for more than a hundred and fifty seven million worldwide and video streaming services which Netflix is the largest all taking on\nTraditional broadcast just like the BBC by having huge sums of money into original programming like the crown that with us is Richard Brooks in ... and ... analysis Hi Richard a limit to Netflix's ...\nWell this is definitely going to be a limit but it hasn't reached yet I'm Sorry ... sudden these athletes I protections for their school so uh and continues to shape by strong growth internationally around in his domestic market\nNetflix is spending huge sums of money on original drama and documentaries how can it a food it given its Betty making any money\nI'm One of us rights I say the the the actual answers the spending ahead of that means at the moment site or if you look at them on the on the ... by suicide look normally profitable\nBut actually when you look at the cash on them while they're spending up from some programming is racing ahead to fast subscribe to ... and the revenue say that's why they need to keep growing to sustain that spent and come\nRight so is it sustainable and does does it get to a point when say it does raise that natural limits of people who are willing to pay\nSeveral dollars a month for extra programming and have good broadband that that means they can watch and decent quality doesn't then begin to make money ... was that when the traditional broadcasters laps he's a sigh of relief because that takes the house isn't the big threat they\nThought [noise] I'm On an for me for the big broadcast is it likely as the big threat say what Netflix is likely to continue to doing as soon as growth begins to drop off in a subscriber base it would begin to increase it crosses a lick to compensate for that and it's cash\nA man that will mean that it can ah can begin to look ... and by the cash and paying the price\nSo the broadcast as a lot of the BBC and others they they should be a little larger that yes it is good news [laughter] All right thank you Richard Richard Brooks enough from ...\nIn the meantime I'm going to watch the crown again now that this cliff [laughter] probably many thanks more business news coming up on a nice day and you're listening to and you say China and Lawrence what'd you this morning ... Ross is here with the sports\nI Am forget the crown let's see if we can get ... called highlights from yesterday because of the big story\nHas had lined in Madagascar express newspaper is simply the but rye or go down and have three of the night thing attempt to qualify for the Africa Cup of nations they have books a spot at next year told him and and Cameron\nWith a well no home when over ... guinea cynical Egypt engine is the apple so qualified from that groups with to match is still to play well Madagascar football's at its highest Germany's is arguably at its lowest fall on from\nThis ... World Cup they've lost to one in front of the overwhelming favorite to be relegated\nFrom leak hey all the new nation's league told them it ... two goals\nI mean from only need one point from that last match against the ... to guarantee they will qualify for the final stages\nGoverning body of world athletics has agreed to spy on bringing in rules on testosterone I miss a female athletes until march not Spiderman it's been a great way to South Africa and Olympic champion cats I said man you're the second half fight against that rule to the court of arbitration for sport\nI mean it'd be champions Golden State warriors are being pushed hard in the opening game of the new safe and that they were handed that championship brings to fall that match against the Oklahoma City thunder\nOut many hangs right this is like Twenty one minutes past the ... let's go to India now until about the case of the uh somebody ... temple in the Indian state of Quetta which opens its doors to women of all ages today for the first time off for a ruling\nBy the Supreme Court in the country until now only women who are under ten or older than fifty ... able to enter the issue is ... being of reproductive age\nThe United states citizen tends to begin negotiations on three separate treaty agreements with Japan Christian and the easy in a few months time President Trump's preference for bilateral deals as part of a more protectionist trade policy\nHe's kind of done since taking office kind of is can be ... in stores in Canada from today making it the second country after your guide to legalize the seals substance for recreational use prime minister Justin Trudeau hopes it will stop massive profits going to organized crime\nAustralia is reconsidering an offer from New Zealand ... all one hundred and fifty refugees a year from St Louis is offshore detention centers Congress rejected the over five years ago saying give asylum seekers a backdoor route into Australia\n[noise] he's really ministry says is carrying out airstrikes on Gaza in response to rocket fire and the Palestinian territory earlier in the night to rockets from Gaza landed in the Israeli city of beer she though\nA new research into life expectancy around the world to just that China will move up the rankings was the average lifespan increasing by six more years to eighty two by twenty forty losing his longest will be in Spain and Japan BBC News\n[noise]\nBut he thinks indeed for the latest on the way all women as corrupt than men in Ethiopia this\nTalking politics has ever won then we're talking about the rates of population growth around the world to college in Africa the population of blue shift huge eased the chefs on the refugees in New York we hear about a catering company here from the suburbs catering company who offers catering made for you in New York\nBy refugee chefs remarkable stories from around the world coming together in New York pool left\nAnd of course we have to talk about ... foot boat trial ... coming up\nWe start in Ethiopia and half the ministers in the country's new cabinet now are women including ministers of defense minister piece it's just the latest big change brought about by the reformers prime minister I'll be asked matchmaking the announcement on TV he praised women for being less corrupt than men\nAt maybe ... is from our BBC um hiring service in Nairobi and I spoke to her earlier\nOr the Penn State downsize than its fan of his them twenty two twenty a and leach ministry such as governmental a combination of his uh his way dissolved\nA and the reason he gave as close minimization\nTo an institution to ... and also to get the rest of the ... and when it comes to government institutions but I don't think the shoveling the carbonate and downsizing the ministry of this this is nothing new thing\nAnd then you find them in a is a half of the minister said women including a that key positions so such ... appointed us the minister of defense and she's the first woman to who does such position and the country's history\nAnd ... who served as the speaker of parliament for the past five months as well ... piece it's a new port a portfolio\nHow are you a whole portfolio and I understand that cheese in the hierarchy in the grand scheme of things she's right after the prime minister\nYeah you shouldn't be overseeing the countries and not only she's not only the this minister but should be overseeing the country's intelligence and security apparatus and also including the federal police commission so it's it's\nIt's very powerful ... like you said it's a within the country is ... after the prime minister and the prime minister made\nReally interesting comments about well how about why he chose and half of his cabinet or to be women what did he say\nA so basically what she said is a woman or let's go to Rob and they'd respect their jobs ah yeah and also to break a conspiracy politics which dominated the county that in the past uh\nUh uh dictates a so when he that's why he actually uh both women into\nPower it's interesting though because it's an interesting generalization ... because he's trying to say I'm bringing along because they work hard and the and they're not corrupt and while some women might find that flattering others might say well actually you know men and women can can be corrupt what's been the reaction to this comment\nSo I was actually monitoring social media and there were discussions among than start\nA saying are being cut not putting a gender a somewhat criticizing his speech or using a stereotype and pizza these I mean it's a because if the notion that women are let's go now to stick their jobs\nBut they're also parts of the system and the I think it's ... I'm a that's a ... effect to swear saying but also a an addition to that some men who are saying yeah\nLet's see also a women holding this positions\nAh ah yeah [laughter] oh maybe things might be different\nI mentioned it to know what the reaction has been to the women holding the ski positions as you say the minister of defense minister piece basically responsible for ... intelligence and police what has been the reaction to their employment ... people generally been positive or questioning their qualifications for these positions\nI mean so far people are delighted about this intimate but with the uh with the ministry of defense suspicion that people are raising the question of a good ... and her performance\nI think this is sort of a double standard because this get to the question when not raised with the former minister of defense or say that's where the guy who did not have any ... uh a background\nThey Selassie take apple there from our BBC America service on that reached shuffle and half of the minister ministers in Ethiopia's new cabinet now are women [noise]\nI was very important meeting of the world Health Organization it's experts are they going to decide all the committee responsible\nThere's got to decide something that might sound a bit technical ... with us we will try to explain\nWhether or not the lights just above the outbreak in the Democratic Republic of Congo constitutes\nA public health emergency of international concern now in W H A language basically that means it is an extraordinary event and uh the suspicion is that there is a danger that the disease mice spread across borders and requires a vigorous international response to\nThe center of the government's response to the current outbreak is the ... goes health minister ... who joins us now minister first off\nOn the conditions on the ground\nCan you tell us or what is the latest that you are hearing in terms of casualties on whether you feel it is a situation which is still escalating\nGood morning America and we have\nA two hundred and six hundred and fifty seven just sort of survivors sole fall so far I think that the situation is it started in August and we\nAre working in a tool to go so far as I think the Russians are under control\nOkay in ... when it comes to the W. H. O. deciding whether they should call it as a public health emergency do you would you recommend that they should do that and what difference would it make on the ground\nSo from my point of view on international trade and frustration but I wouldn't feel my\nGenes we've been working on that because it's all your work it's a great it's great responsible and it's quite figured that China is\nGoing to go to Michael ... job and you can you imagine you're on TALK often but they've been able to monitor ... virus in it and\nLive and for weeks and despite all the rage virus inscribed in neighboring countries or never encourage All right I think that\nThe people doing it rich pardon or returning to the heavens and this is a bunch of Richard ... is called secret because we have a beginning\nFor short periods of resistance but even though it's much horrific\nWell there's both community resistance and also the armed groups operating in the area as well um\nBut when the old neighbors be happy to hear you say that as far as I'm concerned it's under control because they will be extremely worried about it crossing borders of a satisfied with with your uh your assurances\nThat from the beginning the host spreading it for the record or country up in your research will go there seems to be able to come\nIn and we have to have the turning point ... trees so I think people are really going to\nLie I'm sure I'm sure I'm sure a great deal is being done Minnesota but I I just need to to ask you pure and simple do you want the W. H. O. to cold it's a public health emergency will not\nI'm very proud of them\nBy the first of all sides windfall matches what made the movie but it was all the LA Dodgers at the world series that currently playing on the side of the mind\nOf the NBA seasons on the way the Golden State warriors received that championship brings the full that one hundred and eight to one hundred win over the city thunder Boston Celtics the season off with a comfortable I paint point victory over the Philadelphia Seventy Sixers\n\nI ... I was speaking about the Africa combinations here is what it means in Madagascar\n\nOf a national bulging if I'm the first time I've come by beach in Ecuador you'll give me a ... job now is a ...\nThat's what made you said on the side of the bottom line is that it never happened in the ... the ...\nI don't know how to read it but it's really think it's quite a bit domain\nRice so Youssef is reported to the uh ... when the whistle when uh what was it like\nIt was incredible you could tell that\nThe players were\nBy the outcome and when they were very happy about the results and there was that we think we are the fun\nBy drinkers clue ... that we heard earlier on and also took selfies with us from each other so that would ban thing it was a really big moment in in a moment of joy\nOf was sort of a historical moment and also as you say relief as much as joy ... what big stars should we look out for I mean the goal scorer plays abroad plays in Thailand ... or any other people we should be looking out for the tournament in ...\nIt's it's difficult to tell you because you're a manager\nInsists that he has a really good doesn't really\nTalk about the ... it's really that being said you can watch out for the kept in a in a front and yet\nHe also called go against Equatorial Guinea ... such as much and also in select the players coming from the island of ...\nWhich is a French department located the Indian Ocean island and recently how players such as William ... and ... yeah and that just recently in the center and\nThey will get cynical and\nUpdate it true in September and also you can watch out for your knees and come in from young enough to know\nWhy is the nickname by ... can you explain that\nA a I'm not sure I can say it probably is some type of capital like\nOh okay that's on the bench as well listen to it is a it's a bowl between the homes of a cow so that's the that's the ... in a way is is\nIt exactly you actually have\nIt must go drink that much you hug it guy dressed up as they see\nA garden encouraging the great thing yeah [laughter]\nWell that is something to look forward to think he writes I was going to ask the pronunciation gods as well to some of the\nUh the names of I speed up the speed that they are a commentator like Matthew a Kenyan has to do a could cause some problems so frankly unfortunate that as well science dressed up as cows and Matthews pronunciation sign que ... usa\nThat noise ... we're talking about refugees will so chefs or when you have to leave your country you will see after leaving behind its a wrench ah but refugees kind of take the cuisine traditions with them\nA New York based companies employing women chefs from Syria Iraq and Afghanistan to cater for dinner parties and corporate events it's called ... and it's owned and run by a chef an entrepreneur Honda Goldberg\nI think after the two thousand sixteen presidential election I like most of the people I Know we're looking for ways to be more politically involved\nUm you know to express our general dismay with the direction that our national conversation seemed to be taking 'em and I having worked at ... odd always traveled to eat and learn about different cultures through their foods for me\nAnd aligning myself with a refugee costs about like a very natural stent um and I knew that there were a lot of things going on you know worldwide but also in New York City\nI'm Around refugees and food which I mean just made all the sense in the world has you know because if the way it brings us together and emphasizes our commonality\nUm and so I just felt like it was a place where my skills that could really be a value on and so I started ... at first just fundraising dinners for various um Syrian refugee related causes in my home\nAnd I started discussing that project with the various resettlement agencies around the city ... when I was looking for and I'm over the course of the spring and summer of two thousand Seventeen we filter team\nI'm well how does your team where would you do you you put on meals I mean you as you mentioned it begins with meals in your home how's it expanded kind of things you ...\nSure so um we continue to do our potluck dinners but we also there was a refugee food in art festival put on during the U.N General assembly week last year\nAnd we started headlines that and participated in that and you know we're going to real community so people you know their birthday parties for their Christmas parties for for any sort of ... and a half or fundraisers I'm\nNow down ... catering and I'm so we've done that as well and then also last winter we added cooking classes\nSo you offer ... do you kind of so you can say one at a time yes yeah so tell me how you find the women of the rule refugees they're all based in New York and presumably they will have to have just skills\nFor the most part they're just really talented home cook you know when I went around to the agencies and kind of described what I was looking for I said you know it's it's the woman who\nIt's light up when she talks about food you know not just them you've put dinner on the table because\nIt's part of her responsibility to do that for a family that women were really excited about it you know and immediately the context of the agencies would smile you know oh yeah I Know exactly what you should talk to you there's always someone who's bringing food into the office you could just can't stop herself from you know putting putting putting something delicious in your mouth\nAnd what kind of conversations do have I mean is there a language barrier still a an does food get around that\nYeah absolutely um you know it depends some of the woman with whom I work or are more fluent than others um you know with the woman I work with for Syria ...\nRemains pretty pretty limited and so we always work with her daughter who so lovely who lack does that help her in a translator with us\nAnd with like my uh cook from Iraq six pretty excellent English and is a huge personality and I'm a woman a for Afghanistan you're English has evolved oh much in the last year and a half feet down here it's really\nI mean there's certainly a language barrier and I certainly learned how to say salt and cut them down and you know in the Arabic and Kurdish and dirty\nAnd there was only one product to they can't find a New York which is a ton of Afghans\nGarlic a that was how ... book of ...\n[noise]\n[noise]\nYou are listening to community for public radio U. T. C. H. D. one off we are you're central Texas on NPR BBC I'm Jerry count on having a great one thanks for general\n\nA lot to me to start up she their conference takes place Saturday are over twenty of Eugene McCarthy small business\nRose ages nine to Eighteen and learn how to solve social issues with innovative ideas information and registration start of Chico dot com [noise] and if you are part of a nonprofit organization that offers regular volunteer opportunities let us know about it [noise] email your information to us and happy or say\n... who are G T Ninety point five [noise]\n\nWelcome to everyday Americans on the b._b._c. World Series of flying the wall documentaries about how one daily newspaper in Louisville, Kentucky is covering America's opioid crisis\nIs all I was reading in the hills of your body thousands of them you know the whole town wasn't not blood and wasn't allowed\nMiss is the issue of our time is what it's like\nThere's days that are ... ... on the days that I Am saying they show them\nAnd they're over do\nI'm going to deliver with my stuff amazingly powerful stories told of new ways to make a difference in the lives of our readers\nThat's everyday Americans after the news\nYeah and the same time yeah we\nBoth got a name and this town of selling drugs and committing crimes\nAre you going to the chief of police about us right now I'm here to tell you\nKnow they're they're doing a lot better than what it was\n... again\n... January fist ... sixteen is is\nTwo days before Thanksgiving\nToo does put too\nSo how is your recovery been going\nGood and um and I mean there's days that are struggle you know but on the days that I struggle\nHe helps me and then the day is a shovel or help them but he's not wrong and um is you know I mean are you back with your child or as I see grown\nHe's sixteen and he's at that age that most not cool so I'm [laughter] Bernays\nAh he lives with his dad\nIt weighs on may heavy because he's already started smoking pot\nIs on intervene he's going to go down that road because he's got two parents that are addicts and I've tried and tried and tried to talk to my son about that I'm like look at what your mom's vent or you know look at what you've been through which your mom\nAnd he's like mom\nI Would never do this I usually say the same thing I swore I Want to do this one does that and oh it was the band depressed and my friends saying you know or in this version saying this and then I was using it you know and so yeah I'm\nI'm really having an issue what's what to do and how to go about doing that you know maybe that being in Austin\nIs a problem yeah\nI mean I Know that is everywhere\nBut there's nothing to do and all that and I think that plays a lot because we never had nothing to do growing up you know I mean the thing there's not just for these kids to do you know I mean\nYou get bored Mm Mm\nMm well\nUm yeah it's great that they are helping each other than recovery [noise] and uh\nWhen she was talking about or can you know as a mom you can't help thinking about what that means and how the kid is dealing with all of this\nI mean we're going to be looking at different ways that the city is recovering and trying to find homes and I think their story fits into that just as\nPeople who are in recovery and kind of trying to help each other but still really struggling and facing a hearing and the place where they used which is ...\n... ...\n... ... ... oh\n\nOr are\nA crime is abusing or animal that can be a crime jail time\nAm I see a man called metro animal\nToday is a Tuesday August twenty eighth my name is Terri lips out some of the digital director of the Courier Journal what we're looking at is in real time who's on our website what stories are they reading the top story right\nNow is opioid crisis pet owners abusing their animals to get drugs\nIt's doing exceptionally well you know we we like to see stories get a minimum of about five thousand page you\nMake up about twenty five thousand page you yesterday today it's picked up close to another twenty five thousand so fifty thousand page views it's good because you're building potential audience fix it maybe once it comes you previously no use a source and we've been seeing this with some regularity with some of the coverage on opioids\n\nToday is Wednesday [noise]\nAugust twenty nine [noise]\nWe're heading to lunch with a couple I first started writing about two years ago\nPretty good very good\nOkay I'm Brenda can only pray Carl clearly I was reading the newspaper and I ran an article that she had done so I called in\nBecause Sally sit their numbers at the end of the article how we started talking ...\nAnd it's the first time that we actually made our life public and I was born in July twenty eighth Nineteen eighty nine\nAround Seventeen years old we started seeing signs that he was getting into things that shouldn't marijuana and alcohol and we thought he was just going through a young thing that we've all been dirt but by the time he graduated and started working at UPS and he was taken a\nUnited States citizen tends to begin negotiations on three separate trade agreements with Japan Britain and the ... in a few months time President Trump's preference for bilateral deals as part of a moot protectionist trade policy he's calmed down since taking office [noise]\nThe first shops ... kind of us and Canada have open today millions of people formed outside ... open to meet you see after midnight twin the little this relaxed Canada is the second country off the euro glide to allow the sale of marijuana for recreational purposes\nThat Israel is weak considering an offer from New Zealand to east central one hundred and fifty refugees a year from Australia's offshore detention centers Congress rejected the all for five years ago saying it would give asylum seekers the back door route into his ...\nThe Israeli military says it's coming out airstrikes on Gaza in response to rocket fire from the Palestinian territory earlier in the night to rocket from Gaza landed in the Israeli city of ...\nAnd the Afghan officials say a bomb explosion has killed a candidate for Saturday's parliamentary elections the bomb had been hidden in the office of up to ... a month in ... city in the southern province of Helmand seven others were injured the Taliban have claimed responsibility\nAnd that's the latest from BBC News\n...\n... ... ...\n... ... ...\n... welcome back to everyday American chronicled following the opioid crisis but the Courier Journal news organization in Louisville, Kentucky I'm Laura ... an investigative reporter and part of a team of journalists dedicated to covering addiction issues\n[noise] agree journal crude herbal dot com\nIt's late August and were gathered around the speaker phone reports river worked for both the kids trying to raise our editor rate green how're you doing guys\nWell let me throw something out there to our friends at the BBC this is what's really important for us we've covered this story from almost every conceivable angle starting off as a public health crisis\nDoing all the criminal justice in public safety angle\nWe follow the waves were these drugs during our communities the dumps this they're those people who are addicted to it what we're trying to do with this story is focused in a heartbeat bill manager of a community that is trying to not only wreaking dignity regain optimism\nBut hopefully also be a model may be a beacon of hope brother communities that have just been absolutely no because the rock because of this when\nWe're planning a big series on a town we visited earlier in the program called Austin, Indiana scene of rural America's largest drug field HIV outbreak\nWas one that I Know you know well Laura I Know the rest of the team gone in and diverse and so very quickly\nWe got to go in and be able to use this as a template for success in other jobs where they just absolutely consumed by that is this fair and hopefully I was astonished as we can tell the story how often Indiana is being able to emerge it'd be a place\nThat's what I Want to be thinking about driving striving for the rest of Europe absolutely\nGoes through so everybody don't catch up with your money for you later today thank you have a great weekend\nOh\nToday is friday August thirty first that to head out to Austin, Indiana which kind of has become my second home in the last several weeks [noise]\nWe're headed to march plan to mark overdose awareness day\nOften city hall pretty small it's a\nKind of a whitish brick building\nSeveral people out with her umbrella half\nA time when I was writing about Dr\nYeah I hadn't been selling ... how\nCourier Journal colonel yeah I like that and you want them down their drug overdose death we thought by now with all that we've been doing in the country with me on the down swing and they actually are still on the rise on the Centers for Disease Control gesture release the data from twenty Seventeen and unfortunately\nOverdoses continue to rise\nAbout a hundred and Ninety seven Americans now die every day from overdose\nDrug overdose deaths of bike drastically for three years in a row and they kill Seventy two thousand American in twenty Seventeen\nAlone the most ever had in a single year my dad\nFact was on coming out with a rare here and we know there is one way to be safe from these overdoses and I know a man that can save us each and every one of us and as late as Jesus Christ of latter\nAnd they're over do as Oprah glory and if that turns me off the hook up with his name and that was the first or a ... a man\n\nWhy am I on here well my wife drags being\nBut I'm kind of the reason for her to recovery myself\nFrom opiate and alcohol addiction\nI got sober back and found some important\nThough before all the\nThey say in recovery that\nIf you're not working on your recovery you're working on your reelection\nBringing a message carry the message to other folks\nWhen the emergency department over do\nI don't necessarily\nGive my leader tell my entire story but\nWhere there are\nSometimes all it takes a few key phrases that they'll remember later on I had\nSeveral people come up to me how many years after\nAnd see Laura ... broken\nAre you getting ahead he didn't need to get in front of a good picture Ken it's interesting 'cause I'm seeing people that I Know [noise]\nA couple of people that I interviewed\nLast week we're marching up here and they\nProdded me and said hello\nAll right I'm going to raise the other hand I can get some more of them coming from or where\nI Love my family has been cut by Dixon because it's a family disease if he's got one person in the family struggling with an addiction to drugs or alcohol and all the other families the part of this disease as well and also needs to get help [noise]\nGet rid of the drug problem we're going to have to shut down or somehow the China\nKnows where it is bringing these drugs they\nYou see the rainbow I\nHadn't been every day right now earlier than since ...\nLet me get round the corner I said look there it is you know I Am from\nShe has a Chihuahua\nShe's done they get now [noise]\nHer name is Laura Laura Laura\nHow're you doing good how are you remain Jay Joe how are you doing a ... there's also Nicky and a round so actually I Would love to meet with you like a week at the\nFort Paine okay at church or at\nThe church or wherever and they're all done now I'm actually a there's got to be in the past there sometimes they're not going to reach a real a week now great but yeah anything did oh that's awesome and I hear you're getting married yet though this is a wretch like me I Am here on on your\nOwn life to me you\nFor these people together in a positive way now all these people\nPhoto it looks like in front of the church of the covenant and now and then they're going to go in and have some good\nWe decided to give him than they do name Casey because our families used Casey law not only once but twice to send us back to treatment we both have a lot of respect for that well we believe that\nThat was what got us over and gave us a life that we had today so we felt like that was something small that we can do you know to not only on her Charlotte wedding tend you you know founded that law but definitely\nHis name is Matthew Matthew Casey was his middle name as well who case he's well originated from so we thought that would be neat\nHas just a little snow can appreciate and for the life that we have today for sure ... ...\n...\n... ...\nI've been a member of my church for over Thirty years and some of the families it's walk down those files that I Would have thought it was the most all American family in the world they had the kids at the time this that we ran into him at treatment\nPeople in school people in church people work\nAlmost everybody in this area knows somebody that she either had the problem or his dog and the problem so that tells you how many people's minister\n... ... ... ...\n... ... ... ...\n... or your party was so awesome oh I'm so glad that you let me know about it\nThis is one of my editors beat him organic clean\nAnd I thought maybe like I but I knew he was cooking a lot so I'm like OK Our houses like super clean and cocaine you knew\nI'm trying to decide between the breakfast tacos and um what\nMedication only will just send each other and email hey wanna do breakfast club and we just chat and support each other with where it can\nBe challenged more you know what we do some counseling session for exactly [laughter] I was thinking about when we first started getting involved with the coverage yeah and I was thinking of twenty let it was it\nWasn't funny men really has started came out in ...\nThe title I remember going over and over trying to come up with the title and what are we settle a prescription for tragedy because Shepard trashy\nI think it definitely seems like the story that would not go away with a cat once they get more bang it changed\nOnce we put the emphasis on\nThe pill mills and our coverage\nThat made it difficult you know\nPeople start turning the other way to get a high end heroin all the lenient for a day to\nThing I remember um if he meant like how we talk about it has changed a lot and I remember the first story if we didn't ever use the word opioid mhm [noise] no no one knew it was and I ride for having the climate story yeah now I mean literally if everyone would know what you're talking\nAbout at this point the latest thing that really got me\nIs what you're saying I don't know with people\nUp early in the morning going to get their high getting there where you just have people passed\nBut there are in there yeah\nOf my kids have been covered cars all over where there's you know one of the day but\nLike a point now to where\nI agree is so prevalent prevalent yeah so prevalent\nOff in their mind or the school yup they're different kids who are selling\n... on that's the thing that\nConcerns me too is that\nWe don't do enough\nWe don't want our kids and in the situation that would write about right\nA kind of why I Want to stay with it you know because I feel like we really have\nQuite a difference with the subject in this community yeah\nThat is why we have\nIt's like a mission yes it is like on this and that's a great way to put it in a sense [noise]\nYeah\nI'll be here and told me in the dictionary [laughter] [laughter] [noise]\nIt's hard to cope doing these stories all the time because there's a lot of sadness in grief in them and I mean I'm only human so yeah I've cried writing to me his story\nBut I feel like it's an awesome responsibility and an honor that people are telling us their most vulnerable interests things that have happened to them and they are trusting us to\nDelicately tell it until it to other people so I feel like it's a positive in that way and then doing stories like the ... baby where there's a baby and there's a happy ending really recharge my batteries\nAnd then I also just the most elite person anybody can tell you all crack jokes that are so bad sometimes I'm the only one laughing newsroom so I think I'm just being silly helps me to escape the gravity at the speed\nDrink a couple of bottles and a couple of\n\nMy name is Scott and her back I'm the\nDirector of starving the Courier Journal when we're out here to dissolve the wall\nHaving a good time watching all the garbage\nUp and all these\n... adult\nA lot of being carried around a lot of jobs that\nSays there's Monday's paper so there'll be a gallery of bottom line from I\nWe're going to be twenty thousand people here to nine and six are you know there's going to be a matter of hours and have some sort of addiction\nTo opioids are do\nHave a lot of ... going to start with civil management\nThat's always been something\nWay more tragic tragic but\nThis is a little over the top zombie like that like\nWrenching zombie touch the\nMostly people will think all this off tonight\nOh\nThe K U T public media studios you're listening to K. U. T. N. K. U. T. H.\nD. one often we're you're central Texas home for NPR and the BBC I'm Jerry ... thanks for being here and [noise]\n[noise]\n\nCity theater present down a parable on stage now through November fourth set against the backdrop of Nineteen sixties America doubt brings a gripping storm of suspicion and scandal where no simple truth or answers\nExist tickets and information at city theater Austin dot O. R. G. and if you were part of a nonprofit organization that offers regular volunteer opportunities let us know about it you know your information to us at ... at K. U. T. dot O. R. G. and things [noise]\nThis is a K U T Ninety point five [noise]\n[noise]\n[noise] [noise]\n[noise] hello welcome to science news from the b._b._c. World Service for a long shot [noise]\nGreat have you with us today Canada has become the second country to legalize recreational marijuana allies are now on candidate to see how the experiment will go down\nAnother key for Brexit is the British prime minister it's up for the youth summit to Austin Europe to give ground on the issue the Irish vote or the Europeans are saying uh it's up to you or we get a lawyer to explain to you should force have\nBig hydro electric project in the Democratic Republic of Congo it will make the country had big power exporter to the rest of Africa has found\nA report that says by twenty fifty that will have one point three billion more people are we have the story of one woman in Kenya was about to take control over ... over reproductive\nTriple a reproductive rights business ... you're on your side [noise]\nThen the you say if the u._k. has cuts them that's for particular goods\nWhich we might have to do if there is going to be as free trade deal with the United states because the U.S will only have a trade deal with us if we elected us agricultural products in particular the infamous terminated chicken and genetically modified organisms GMOs\nThen those things at the moment and not committed in the ... says that fall down each ... voted to check the lower east coming in I'm not carrying these\nOr else the Boulder becomes a sort of a ... which has left open to the world there's good of\nThe ... if there is no future deal which deals with the problem of knows it on the nose on board the\nNose and on and that itself will stay in the EU customs union and said to us from is this might now that would be comfortable Oregon legally binding on a future government exactly because it will be in the withdrawal agreement not failed coup\nFifty divorce agreement and that's what the u._k. will have signed up to assuming that the u._k. government can agree to it\nCosts for bombs on boulders buck stops and ... professor of EU law at Cambridge University\nThere will be one point three billion more people in twenty fifty and that half of them will come from sub Saharan Africa that's according to the un population fund or we're going speak to their ... executive\nDirector but first let's hear from Sheryl ... a young woman and a mother living in Nairobi\nMy mother had six children sequel they do get that off and I have friends that I have children but they can't speak to whether they can take them to\nJust because they have no job and they have enough money [noise] I like to see how many children is leading to any bucked off and not getting a ... not getting enough food they know what ... the mother is dressed men I'm not I don't want us to see that children so it doesn't need but we made\nThat ... their ... she's a young mother living in Nairobi the executive director of the un population fund is Natalia ... an earlier she joined us in the studio\nThe report that you want to be a presents today makes it very clear of sorrow story makes very clear that choice is in short supply\nWomen shouldn't be at the center of deciding wants to be a mother how many children they want how to space them and adolescent girls often our mothers to serve the question of choice affects every country there is no country on the globe where we can really say that reproductive choice about fertility is operating today\nAnd tell us more about about family planning and Congress contraception that concept of choice let's hear from shower again\nYou know like listen to mine and my mother both of them they don't believe in using family planning for I think they can\nTry and do some blending we call we had like me for example me my ... well I did not ... that was the quality no one will tell me how to use it but I think it will not use that ... that that but it's on any of these fights yet and I'm not that I got my nature to feed them [noise]\nThat was Sheryl again and Italian it's interesting you mentioned choice but what sure I think is also talking about is the culture is the information as well is that getting through\nThis is exactly the point that\nThe decision about when to have a baby is one of the most intimate decisions and many people are making this decision without preparation without access\nThere are over two hundred million women who would like to have the ability to plan their family as sorrow decided to do but do they have access in the clinic or they welcomed a is the young girl in particular protected from having a baby to serve\nAll of this implies that choice could change a life that could change the family and sharing your story shows us the benefits of being able to plan your family\nThe benefits of having I Would say uh all the supports including things like childcare including the ability for girls to finish her education and the health system must be equipped to help women all over the world to make these decisions what\nWhat then what is the un populations on proposing needs to happen what changed needs to happen in those coming years to be able to contain this\nAs you said we're predicting an additional one point three billion people by the year twenty fifty if women cannot take the reins of their own fertility control whether when them how often that they want to have a baby\nThe policies of governments the nurses in the clinic everybody who uh deals with the question of wanting to delay pregnancy wanting to have safe sex these are things that we need to talk about more and we also have to deliver the services at the point where the woman can reach ah\nServices ... however uh what what you're talking about often you know sharing speaking but there are countries where women\nDon't have the choice don't have the control over their bodies they don't have control over when to marry one to have a child there there's still a great deal of gender discrimination of depriving many women of the power of that choice\nThe heart of the matter is exactly the men and women are equal but women are the ones that are disadvantage when choices taken out of their hands\nNot only the information but the services and the expectation that a girl should be able to fulfill her potential this is what the report is showing very clearly\nWere falling back and we can't sit back and relax and things and things the job is done in that regard we need to bring\nContraception services understanding to young people in particular they're the ones who are not going to be able to reach the job market they're the ones who are not going to be able to fully participate in the economies of building up their country\nAnd Natalia ... in their chief executive of at the un fund\nA quick reminder of the top stories British prime minister Theresa May preparing to appeal to European leaders for more flexibility of the terms under which the u._k. withdrawals from the EU next year and a kind of a has legalized societal consumption of kind of is a second country to do shipped off to Europe why a sport and I'll I'll\nRoss thank you Lawrence ... says his side won't to the mall and just make up the numbers and Cameron next year off they qualified for the Africa Cup of stations up all night taint attempt in the history with the ... when over ... newspaper headline simply\nThe but I uh go down in history so the goal Egypt to news ya\nBut also qualified from that groups with too much but he says yeah too much they still to play\nA role model and football is at its peak Germany's is arguably at its lowest ... home from a dismal World Cup I've lost to Walker in France now now overwhelming favorites to be relegated from leak hey all the new nation's league told him and on the wrong reasons to Gulf meaning from now only need the one point\nFor bed last match against the ... to guarantee they will qualify for the final stages\nGoverning body of world us Hicks has agreed to postpone bringing in rules on testosterone them is a female athletes until march ... been agreed with African Olympic champion cost us a menu who's taking the fight against that new rules to the cause of arbitration for sport\nI mean NBA champion Golden State warriors happened push taught in the opening game all the new season the Honda the championship rings for last season before that one hundred nights of one hundred win over the Oklahoma City thunder\nOf how many times and the the L Ross with the ...\nNow to the world of video games and you may have heard of one called for night it's a big global hit with online gamers with tens of millions of players across the world now for the initiated Fortnite is a collaborative shoot 'em up survival game essentially\nIt's also a big money generator and now the creators ethic hang on just throwing one player Brandon Lucas who was posted videos on line on how to cheat while playing the game\nSo how big of a problem is that when the online video get within the online video game industry let speech Ellie gets in video games journalist who joins us in the studio great to have you with us Ellie\nJust before we get into the the the problem with Brandon Lucas [noise] we we say that it's a it's a huge game Fortnite I don't play but I've heard of it how was it a global and a big money generator you don't you don't make any money playing it do you make any money buying it to play it\nWell you have to ... to pay any money to play the game will dominate the game and hang on one of the reasons it's been so successful you know it's really accessible to lots of people if you want you can buy a thing called a season policy about maybe ten dollars and that gives you access to a cooler weapons and guns and outfits and that sort of thing\nAnd but yeah it's not really a a money generating gave in the sense you have to pay a subscription or anything like that but obviously lots of people have secrets the game and waiting to find that season ... and that's how the company generates money\nAnd now if someone is in trouble tell us about the videos posted on line there and why the company at the games is suing that play a brand\nAnd Lucas so yes it brand new cars is accused of making these tax to the game and sending them\nAnd these are enable players to cheat basic cake so he's maybe ... ... does is it makes it much easier to kid enemies 'cause you don't have to aim at them for you to ...\nSo he's been sending these moments to the game on nine and a upwards of two hundred pounds in some cases wow and yeah and people are buying those people are buying them yes because again it's a hugely popular game and and some people have got the money to access these kinds of things\nThe candidates in Afghanistan's parliamentary elections has been killed trouble was planted on to his office chair the Taliban said it carried out the attack on up to about ... in ... city in the southern province of Helmand a Taliban stronghold\n... Canada have opened with people killing at ... midnight when the law was relaxed Canada is the second country after ... some shops to sell marijuana for recreational purposes to stop massive profits going to organized crime [noise]\nThe British prime minister Theresa May will are joining the European Union leaders to give ground on the issue is the only the ... when she addresses cemetery summit in Brussels lay said today ... talks said deadlocked over the border but the ... says it's up to the u._k. tipping new ideas to the table [noise]\nUnited States has said it intends to begin negotiations on the separate trade agreements with Japan Britain and the and a few months time\nTrump's preference for bilateral deals as part of a more protectionist trade policy he's kind of get since taking office because ... with person would start once it has left the IV in March next year\nBBC News\nHello and welcome to industry do from the b._b._c. World Service the CDs that meet some of the world's most creative people unfold Islam has the work on things [noise]\nSmartphones have changed our planet and continue to redefine how we interact with one another [noise]\nThey've also opened up a whole new world of mobile gaming or one top of a screen can open up that all those players to compete in digital playgrounds games that come complete with musical ...\nDesigned for in your headphones and tiny smartphones\nMost of the pieces that aren't ... finally ... speakers\nInstead of little fine muscle [noise]\n... and I'm a film and TV composer\nIf you've seen during to Nabil you'll have heard my work [noise] my job is to greet musical scores that will bring to life for audiences see owns\nHow does composing for film and TV compare with composing for ... games\nOn what goes into bringing digital world to life using certain\nOver the next thirty minutes so be it\nIn the studio with you on homes from who is senior composer uncertain designer at the social games development company king ... joining him as he composes the musical ... consigned designed for new morals white who's [noise] this is in the studio when the b._b._c. World Service [noise]\nTrying this [noise]\nI've traveled from London to mom to visit king\nIs here where you are on greeted the music for games including Candy Crush pet rescue on farm heroes [noise]\nHey hey on yeah very pleased to meet you where you finally finally yeah\nWhen I joined jewel hon in his day in the digital tank he was working on the music for a new release in the Candy Crush CDs cold jelly saga\nI have three screens and on the sides I have often like suffer since uh my digital instruments\nI was expecting the space age mixing days can futuristic audio system but I wasn't expecting to see so many analog instruments\nToy ... which is already quite intriguing several on a low key boards of beautiful we can find the roads or lets her\nOr after getting settled with the shooting on the electric piano I asked you on hobbies career began\nWell I actually said to me and sing in Los Angeles Ninety to Ninety three and then I really focus on fuck this guy called cat gray with my teacher and mentor and he toured and play with the prince and stuff like that and then I went to Berkeley in in Boston and I continue with the funk and soul and a lot of gospel as well\nBut before Johan moved to America for these studies he started a bond with these friends back home and Sweden cold the family tree\nWhile I was in Boston we've got a record deal so I had to you know just what I Want to do so I went out and we went on tour here in Sweden in India and you're and landmark known just like Sweden Denmark\nOr and then I got fed up and touring and started thinking ... how can I make a living being a musician\nBeing in a studio which is my favorite place on earth and a happy accident this guy and knew he reached out out of the blue hey didn't want to do some music for computer game yeah [laughter] a\nLittle bit Johan knew that this introduction to the work of composing for computer games would lead to his music being heritage all over the world\nCandy Crush saga is obviously a huge\nMassive yeah in fact I'll go written down here one point seven billion dining loads so far it's a lot of people that's a lot of people yeah so you're probably the most played composer in the world at the moment could be\nNot by choice though [laughter] I just happen to be there\nWhat you're eating some of my work from time to Nabil\nA TV show that as being brought constant two hundred and twenty countries and watched by an estimated audience of a hundred and twenty million people the potential audience for humans work as many times not a staggering number of people can accept she's music at the top of a screen and I couldn't wait to hear more about his ... to\n... but first I wanted to understand more about how you and worked alongside the rest of the development\nOf the game has sometimes more than one producer that you know their main focus is to make sure it's a great game yeah but when we talk about me recording studio whatever I'm the executive producer regarding\nThe music the music itself yeah yeah yeah yeah yeah who who ultimately decides this is the music we're going to use\nWell the one of the producers is my main contact that's the same procedure for every game and as soon as we establish some sort of\nHappiness if if I could you know if they're concerned with the material there get it from me I always want to have the final say always want to feel free so I'd say you're going to get something like this right but it's going to be better\nSo you basically they they all old Ki ay direction and then you're free to yeah to go with it I mean that's very that's the law freedom\nIt is and I'm not sure that's like normal procedure but that's how I've done it and I haven't asked any questions\nMusic such a difficult thing to talk about it or if you're not a musician I knew or juice or or a director and you meet somebody that you can create a language that they can both understand by music yeah then\nYou're rocket really and that's what that's like really really tough yes some producers game producers know\nSome about music some have a big interest and are very interested in no you know they might even play guitar or something and you know the vocabulary\nBut some have no clue whatsoever and I said send me a Spotify YouTube link to something similar your you know you're imagining my products going to sound like\nI joined us on a few days after he received his brief for jelly Saigon and he was a ... just aren't in the first time he'd spoken to the game producer\nAnd he was looking for inspiration for me starting off every job is a\nBit of a nightmare the blank sheet of blank page with nothing\nOn I live in ... yeah the yeah surely you must at times spend a day writing and never come up with anything I always hear the music in my head and I follow that thing that I hear [noise]\nSit back and you know listen to it\nKnow that was it do you have a routine to kind of get into that dot dot moved\nA lot can sometimes need to take a break just go out for a walk\nSo we did just thought you on that I went for strolls\nSo there are quite a few people here I've noticed carrying I poured some\nHeadphones and listening to things do you ever see that I listen to a lot you know at home a lot when I turned on Syria to music or [noise] normally in the car and on walks and if a bicycle I normally listen to folk or somehow right but I Am of do or\nListen to certain compose this or musicians to you know get inspiration [noise] I guess not trying to steal anything or so but I like movies have at least\nOne of my favorites yeah regarding the audience ration than yeah and stuff you find you go through phases of outgoing listening to different people yeah and again going yeah yeah yeah I I get like yeah\nI get stuck with one\nAnd the trumpets to our that yeah yeah I think it changed that as well actually [noise]\nLooks like you're about to start crying [laughter] [noise]\nYeah and that's just the ... you can't I Can't live\nWith that [noise] next I Want you to understand how he treated the same designed for the game the ... and the bleeps that bring these digital play Grimes to like [noise] you got to have a\nGreat imagination I guess okay yeah it made me laugh make you laugh and that's I actually you never get into school I couldn't get his description like that I guess the well something funny but it's not so many [noise]\nOkay something funny he's\nJust top yeah\nLet's go with the Marines\nAnd something else what happens why is that funny or what what happens I somebody slipped\nSlipped ah let's see if I can find that one I'll use like a bass drum [noise]\nAnd then a well a\nLittle symbol [noise]\nStrong and of course you will need a whistle up some source if it's supposed to be funny [noise]\nI mean something like this [noise]\nAscending [noise]\nAnd then we can always end with the [laughter] yeah [noise] [noise]\n[noise] [noise]\nMy time with Johan was nearly all but before I left it was time for the big moment a chance to play the game for myself so you want to have him do want to try the game\nI mean are you gonna often I Am I yeah I mean but it's gonna be so embarrassing actually including just there or do\nYou want you want to live with that [noise] so when it gets the voters together [noise] or should or should it Orioles yes [noise] do you want to do so and the jelly believe because [noise]\nYeah [noise] um [noise] the [noise] the next but [laughter] I was\nAround ... well I Would think of it is [noise]\n[noise] so we're still getting together where you get more than ... like some of our age they [noise] they get\nThat a a finally there was one thing I've been wanting to ask you one since I don't write something that had been playing on my mind since our first find direct I was heading into the studio with a minute ... music for some of the biggest ... games in the world\nIf you press the mute button on dying to not be I don't think you would enjoy it as much as I music dialogue or same defects you'd struggle to understand the drama but you can ... Boston or new ones work and still understand and enjoy the game\nSo having just played the game myself I we noticed that uh\nThat there's actually a mute button for the sign for the whole game but there's also a mute button just for the music so you can have the the side effects I D id you feel about that do you feel about was necessary for them to Putin was that your idea\nNo not at all [laughter] and I don't know how it came to be but I'm I understand if you're on a\nBus or something you don't want to bother people so it's it's inevitably alone process from you know from conception to birth so to speak a\nGive hides a brief you\nEnded up going to be passed you've recorded a orchestra you've recorded on Oprah choir\nSo Lewis ...\nYou'd makes several different versions of it you've done a hundred and fifty sign to fix\nOn yet after all a lot people might still tons of musicals how do you feel [noise]\nYeah I mean I'm I Can't do anything about it I'm fine with it but hearing you mean when you put it that way it feels like a ...\nTotally I did have the music and but I Would\nThink that anyway but ah yeah that's I've put down some effort to it I guess and uh yeah I Would hope they appreciate the music\nDoesn't upset you that people will occasionally switch the musicals\nNo I mean it's their\nDecision has their own loss that experience as a whole is\nDale and audio and they have the whole so that [noise]\nUm but I don't get upset\nI get it presumably I mean people switch off not necessarily because they don't like music\nSizes within which they're playing the game yeah I think that\nI tell myself but it's sad that they [noise]\nBut I I'd say hey you know you have to be honest I mean if you play the game and I've I've got so much nice you know nice\nComments from people from all over the world loving the music and then that that really warms my heart but\nYou got to be honest and if you have the same three minute three thirty whatever it is music and you play that game for let's say hundred\nTwo or three out three hundred hours or so you will end up getting that other there's no way avoiding it yeah but you you know I I Try my best to\nMake you feel good as long as possible\nTo have this cools studio as [noise]\nYou know I have to you know ... sometimes I entered this real this is my office\nAnd it's cool [laughter]\nI like being here are still I like the freedom this job crates I mean I [noise]\nIt's it's a ... as you know very nice\nSometimes yeah I go out get creativity from nature or whatever and I feel I've I've got ... do they do that here or no one bothers me or complaints as long as I deliver\n'em some quite content I Hope that will stay here I could say for the rest of my life\nBut as long as I work I Would love to be here\nI Can't imagine\nSomething better than this it's so creative and I get to do what I Love which is work with music [noise]\nYou've been listening to in the studio with you on homes from\nI'm drawing the line and this has been an audio all was production by Chelsea Dickinson ... Morgan for the b._b._c. world so\n[noise]\n\nYou're listening to the port in public radio U. T. T. H. D. one on [noise] [noise] we're you're central Texas on NPR BBC I'm Jerry count on having a great one thanks for June and [noise]\n\nA lot of need that started she got conference takes place Saturday October twenty of Eugene McCarthy small business\nRose ages nine to Eighteen and learn how to solve social issues with innovative ideas information and registration start of ... dot com [noise] and if you are part of a nonprofit organization that offers regular volunteer opportunities let us know about it [noise] email your information to us map PSA Kikuyu T. dot O. R. G.\nT. Ninety point five [noise]\n\nThe news on the BBC well service it's hard to talk with me even sack of Dr among sort of posturing for valor casing the brick and game is on the way this is the week the u._k. government and the you twenty seven year marked for\nAgreeing a deal on the divorce and outlining\nA future close relationship but on the eve of another ... years science there is still talk of an impasse and it focuses on the Irish border with north in Ireland all ... states has pushed bricks it my guest today is Marie McGinnis Irish I may be\nAnd vice president of the European Parliament\nThey incomplete parts are around and northern out and what has told them to me I have to say that normally when we go ca start at a new level papers produced I don't like what's on your paper for example but I'm going to propose changes I guess one you won't agree with all of them but you take someone board that has not happened in these negotiations\nThat snow raid McGinnis on all talk after the news\nWe did like that yeah there are a tree and you're not having\nTo you to the people are in in the north of are the majority of that it's not a red herring is a fact however we have to respect the day the collective you have those some of the ... and and I know this industry weighed about who voted to leave or not coming to me saying\nMake sure that my lines can still they sell it into France and make sure that the milk I produce a steady European Union milk so\nThere isn't that I'm a tear of people are not understanding walked the votes did to the relationship with the European Union I also would say that within unionism there's also the desire not to have a hard border what's lacking is an understanding of where there's no deal or whether there is a bad day if we don't respect for him to the store to blame a twitch\nFrankie and this is I think what's missing and the understanding\nNo one wants to use the ... but we need it at that\nInsurance policy we hope that if the ... and it's interesting mocks come the ... and I regret that but then you can leave and then we have a transition where we come to this a future relationship on trade on standards which is so ... if you'd like to listen to effect of the ... is\nNot only are those are very ... woods but he yeah awesome somewhat less ... was from Boris Johnson two reasons I mean he's not in companies and now to live I mean he I mean I can\nSay this and I let you go out I mean I have to fill up Mr Johnson he was a journalist and I was one as well but when I became a politician I left my journalism behind I'm afraid he's still acting as a journalist not as a responsible politician he has been very very emotional and some of the language used around our land and indeed very on\nHow you got to you as you did earlier in his interview you'd like to take some of the heat houses of the conversation on just focus on what's achievable than perhaps what you've just said is truly do\nNot want to go see Asia's not in the\n... you know but he's still got an important role to play in the ruling conservative party it was a primary and it'll tell him what he said if I may because what is important and you need to respond to an idea the EU\nHas pushed us around for too long treating us with me could contempt they presented with a choice between the breakup of this country all the subjugation of this country it is a choice between two exquisitely embarrassing humiliation\nNow that's Boris Johnson's position it's the position of very many influential voices inside of the conservative party possibly voices that are sufficient the number to dictate what Theresa May has to do in the future\nDo you need to show some empathy for the feelings they have particularly on this issue of Northern Ireland\nI mean in terms of apathy I get them to be a great day but when when you say to me that Boris Johnson who's from a very large member said and this is what's troubling to me about breakfast from the get go I'm from the phone country we know our size and we also ...\nI've been very surprised that the United kingdom for all its size and greatness he's so if you're like a ... threat that if you are pushing it about\nI mean that is an extraordinary statement for bars jumped to make the European Union for all its flaws works on the basis that around the table I remember I come from the small number said we do have RG biology\nBut we respect each other's positions we know we need to compromise and we have to move forward what I Would like to see from those who am I Am the virus jumps and a team and I'm not so sure the phone numbers but you'd have the facts on that is what do they propose other than to walk away and when you walk away nothing is it changed\nIt might have had a fight that innate give somebody a kid\nBut it doesn't actually solve the problem for Bush business for supply\nChain and the food and those that are going to happen in a moment but but if I may\nJust just to continue to about ... passion as it was interested in that very reason newspaper called him what he is getting at is that\nFor his policy which after all just couldn't pull the conservative and union is policy there is something fundamental at state which is\nEnsuring that continued unity of the United kingdom and they look at what comes out of your own country Ireland when it comes to an analysis of wherever it tradition they listen to statements like the one from your prime minister EU leaders are popularly over to the other day wasted our job as an Irish Government is to look out for the interests of the entire\nIsland of Ireland Denise breakfast negotiations you should we all the policy of Europe\nAnd we all the night to Ireland parking and it sounds to some conservative and unions politicians is what you have an agenda and your politics and indeed in your country which is to see what's happening in bricks it as a prelude to Irish unification\nBut breakfast has nothing to do with all of that the reason why our land and ... leader has a role to play in relation to the north of Arlen is because of the good friday agreement I mean all governments have a role to play and that's because no they're not it is a unique entity we've had\nViolence so I mentioned to my own childhood we have peace for Twenty years we have tried to build bridges between communities that in a way we're very divided and sadly because of Brexit there those divisions are beginning again be very fair I'm just on the United states are into that can only happen with the will of the people of northern\nIreland is actually one of the island do harm to remind me come get is not on\nThe agenda now what so ever\nAnd I think to make it um and I've\nLived here during the game the conservative in ... the little is being put on the agenda and on and let me quote you Mary Lou McDonald yesterday the leader of shouldn't be saying she said that if there is a no deal Britain's it\nAs far as she concern is concerned the damage will be ... ... people of Ireland we will not stand idly by they will have to be a board across the board a poll on unification it doesn't matter what they are urging it\nDoesn't matter what the lead oceans and says the truth and the reality of voting poll that has to be caused by ... states in the north of odd that nobody else can do that and the sad part about today's politics in the north of on it as there is no government that ... out of the dean you pay ... the way to sit down and have a golden\nThe candidates in Afghanistan's parliamentary elections is being killed by a thong punted on to his office chair the Taliban said it kind of doubt the attack on Abdul Jalil kind of Miami ... city in Helmand Province stronghold of the most in\nPakistan has executed the man convicted of the virtual rape and killing of the six year old girl they met on Saturday in January the body was discovered ... in the city of cars sewer she'd be missing cosigned days they connect Enron and he was hanged at a prison in the horn\nUs defense secretary James Mattis has visited the Vietnamese airfield contaminated with Agent Orange toxic chemical deployed by the Americans during the Vietnam War it's huge sled ... can't say it's not just said he wanted to see the sun for himself\n... candidates and Canada have opened making Canada the second country after you know climb to learn some stores to sell marijuana for recreational purposes and if the Ames is still massive profits going to organized crime\nAnd Britain's prime minister Theresa May ... European Union leaders to give ground on the issue is the only the Florida and she addresses the ... summit in Brussels later today makes it talks a deadlocked over the border\nBBC News\n\n[noise] [noise]\nHello I'm at ... and welcome to business daily from the BBC coming up is it true where we really be boarding flying taxis and the next few years we're\nSeeing a lot of interest in cities like Delhi Mumbai bank car we all find ourselves in the cities where there's really valuable to to get up and over the traffic\nNASA flying cars are off seeing today drones carrying the wealthy and the film is among us up on the way but all we ready for this flying revolution\nWe are the fate of football and we need to get used to I did and so once we seem\nTo be part of our everyday lives [noise]\nPeople will accept and that's the common business say from the BBC\nSo we really on the brink of a new friends for\nBack [laughter] [laughter] yeah\nI Would we be about potential in line cause cause to various around big cities of the world above minimum wage for all of my marriage ... the reason is we now have dreamed technology company already calling my managed to play with recent trip to the Nevada desert dish that [laughter]\n[noise]\nHey we are in the middle of it slightly windy quite cold that's it and it's also the little dragging ... buzzing around us head what the appeal I think they're an amazing tool it started as a hobby\nFor me I spent many years as a producer at CNN and when I saw what you could do from the air it really just gave a whole new dimension to the production that I was trying to do and then I actually went out on my own and started this business now everything from industrial surveying and mapping to fire fighting and law enforcement film and television you can really do it all\nAt the same equipment can I have a guy absolutely this is from the BBC and she wants to fly drones okay there's got to do that right now [noise]\nOn the screen here what we're able to see is the actual image from the camera but what we're able to do is tap zoomed to a certain point out that picture is neither I Am actually goes all the way back out and now I can show that housing is like a ... ... doesn't\nThat yeah the remote itself is very capable if I said oh well yeah I it just out she flies when it's coming on to not to include I see yeah oh yeah they're all ... All right yeah\nThe time and they were meant slowed CEO of ... driven group called the light weight airborne toys may be good for all kinds of stuff like delivering smoke ... aerial photography but they haven't been able to carry heavier payload yet but I could be about to change\nWe're making a a single person aircraft that can take off and land vertically they can also Dr the side of a building it really is a sports car but the sky we want to make the sexy and the fast vehicle that's really cool and fun to fly\nThat Steve tidbits cc you all dizzy but every one of the dozens of starts off ... around the world using ... technology to polygamy flying lightweight vehicles he plans to have his first prototype everyone in about a year\nInitially it'll be the early adopters and the you know people who have a lot of disposable income and somebody that might have previously bottle Lamborghini now they can have one of our zero vehicles and fly with it how much would it cost a hundred and forty thousand dollars is estimated in Mississippi\nThat's a lot of money but it's not a lot of money compared to a helicopter I guess\nUh it's about the same as a fully loaded ... so there you go there both electric vehicles so\nThis is great I guess if you live on a raunchy and you want to get up to the top of the hill and maybe come down again it's not great if you want to go from your suburban home to the office because\nYou're not allowed to do that now with one of these machines\nThat is true but we think both of the air traffic control and the technology and the regulations will catch up to the developments that you know the the regulations always lag technical development so we think that that will eventually catch up and there'll be guidelines and rules that will allow people to fly urban urban environment [noise]\nUnderway very few only cause leaks test pilots on the whole of had the opportunity to experience this type of man travel [noise]\nSounds like an ... but still the BBC's Dave Lee did get his chunks recently on another pressure times [noise]\nFavorite people while I'm sitting in it right now sprint race simply had just two controls one for altitude months with the direction of where they can go around me you'll say there are ten ... ten most is that keep this thing in the ... century I guess you can say is just\nBasically a big driving that a human being can fix it right now they limit the space around six miles an hour\nThe battery life will keep it going for around twenty minute when improving five I certainly make our foster right now but just to be cautious\nBut keeping it around six small for our was shipping and many people think it's a good for the future they say that goal is to eliminate traffic and I also don't think many of us get behind whether it will be in one of Vegas that remains the same but it's certainly\nA very very interesting a futurist\nInteresting futuristic\nTerrifying I think what do you reckon the early prototypes are likely to be part of the teachers but pretty soon they could actually be flying soda automated still flying\nWould you be willing to commit to one of those and fly over a city official certification to vehicles like these in cities has not yet been granted but it could be sued I off the bright he's associate professor in aerospace engineering at the University of West Wing\nI'm at some of the current obstacles holding back the regulators\nSay well in the case of high technology is the things that look ... and the things the ... say the law for a senior high rise environment that's not too bad that's not too much for the ... in fact they've pretty ... pretty good\nThe biggest problem we go in a in a hammock ... can we cram into a box [laughter]\nSay we engineer as we've been spoiled rotten for the last hundred and fifty is by the ...\n... and ... and feel there's a huge amounts of energy enough that give us a huge in here and in other ways we can fly for several hours\nThat the ... set of technology we've got ... the ... and it's probably any good for about half an hour oh sweet cool the now so that doesn't give us the safety margins that we've been somebody within the past\nSo in other words they performance that we say is excellent the issue is trying to make that happen for a long period of time in gear and some rain just she\nProfessor Steve right will pioneers in the industry say these limitations could yet be fixed a new generation of batteries in the next year or two\nCould double latte flying time all the same some of those involved in driving than you tack like engineer ... ... ... era uh playing it safe and now using hybrid technology to power that threatens\nWorking on both battery based solutions because we've got a lot of expertise with batteries but we're also very focused on hybrid electric solutions where you've got an onboard generator and the reason for that is really to allow our customers who are the aircraft manufacturers\nTo not have to design for the batteries of now but rather designed for the batteries that we may have ten or Twenty years from now\nAnd then use the hybrid system as a bit of a proxy for what that battery will be and what that allows us to do is really get these aircraft into surface safely and reliably right now or as soon as possible and then upgrade to batteries as soon as the battery technology is there\nA letter written by a young students to his parents in Nineteen Seventy\nIt shows the ideals and political climates that's motivated the collection of students and liberal professionals to move to a remote region close to ... wire river in the south of the state of Nevada one of them was ...\nIt for shell shock factor\nI arrived there in ... in Nineteen sixty nine ... the government had brought in a new law which I'm honest all individual rights in Brazil there was no free them at home I had been prosecuted twice so there was no other option for me it was either that or going into exile\nCan you may have you on me that was twenty two years old when she arrived in ...\nThere she joined come rates from the they said to be a model released offshoot of the Brazilian Communist Party they were scattered around a large area living in very poor villages running small businesses farming and also helping to improve local health and education\nThat won't make yeah gee\nI ran a shop which so things like salt kerosene and the feeling medical items I also farmed with ... corn beans rice stumped Ken and I walked voluntarily as a health work and the community since I had studied to become a nurse other people with the teachers\nLike cheerful well and I ... thought\nBut our main aim was to be able to resist the dictatorship\nAfter the new law wasn't possible to oppose the government in any peaceful way there was no dialogue no debate the number of people in jail was huge so we prepared to south from ministry combat the pocket believe that the only way to oppose the dictatorship was with armed struggle\nI looked at my\nTen of the militants from ... to be had spent a year in China receiving training and get rid of warfare one of them was ...\nNot an issue that\nWe learn survival is also a ball things like how to load of gun but the guns we had in the under wire were hunting rifles cue animals\nAnd I think\nOur military preparation was basically learning how to survive in the jungle we learned how to shoot now was only one way of getting me and that was killing animals\nWe were taught about fruits and plants we could eat\nStep and then of course you don't think I mean\nThere are three things you have to learn to survive in a jungle ... environment\nFirst how to seep through the ... second how to speak low without making any noise in third how to get food you needed to find an animal or small bird or a fish many times I eat tortoises\nThey aren't easy to catch because they are slow or armadillos would you had to grab from their holes in the ground pointing their sales or ... feet\nBut I also had sweet sour leaves to survive or roast the green ...\nEarly on me or any ...\nBrazil's military government was alert to any possible ... activity Indiana's and\nEver since the Cuban Revolution the scenario of an uprising instigated by left wing groups in the jungle was something they wanted to avoid at all costs they hadn't former money towards political activities in universities in unions and we're willing to use a very effective to torture\nSo when two members of the why of gr relapse fled because they didn't want to live in the jungle anymore the group knew that he was only a matter of time before the army appeared on their doorstep\nDie in\nAnd they arrived in April Nineteen Seventy two we had already left for the jungle because we'd been mourned by a neighbor a group of around twelve men wearing civilian clothes arrived at his house asking for us pretending to be a friend\nThat neighbor became suspicious they had boots new clothes and were armed so he invited them to leave that will avoid spending the night in the jungle and he sent his son next morning to buy coffee that\nBoy came plus hid described those friends and we knew they were military coming for us so we left from the jungle\nLast one and my mom in the jungle we had hiding places where we had stocked medicine and I mean nation was easy to hide there at the time it was very dense jungle all the time there were helicopters flying low over it was a very tense situation\nAt the end so natural ...\nBut the most tense moments what's still to come can Emanuel made there was pregnant when they had to hide in the jungle in August when she wasn't her fault mountains it was decided she has to be taken to safety a job for the best jungle guides they heads ... has the omega\nThey spent days walking through the jungle until the final and most dangerous part the crossing of the river ...\nOr ...\nI took us two days and nights\nWe spent one day or observing the movements in the river and decided\nTo swim at night we attach dry leaves over ... much read to the body so that we could float when we were too tired to swim and we've covered\nOurselves with vegetation many times there were multiple ... very close but nobody noticed us we had to stop on a small island because of the strong current\nSo we had to spend a day hiding on that island there were so many mosquitoes I had to dig a hole in the ground so that she could stay there with some protection from the mosquitoes on the next night finally\nWe cross the river I took her to a safe place from where she could travel to some ... or ... or so well\nCan you may have you on me the arrived in some Baldwin September Nineteen Seventy two but in December she was arrested she was taken to ... where the army was interrogating suspects connected to the ...\nLike it is that like\nI was almost eight months pregnant but I was still don't watch it I was beaten and electrocuted they had doctors assisting them I heard the doctor and army uniform saying that because of my pregnancy I could only receive shocks in my hands and feet\nAnd could be beaten in the head but never in the abdominal region\n... pretty may some was born in the army hospital in ...\nWell before you love the delivery was torture I didn't get any pain killers even for the cost of the at the sea all to me\nThey took my son away they didn't let me see him and even he was mistreated when he was born he weighed three kilos and a hundred and fifty grams fifty two days later when he was given to relatives his weight with two kilos and seven hundred\nCould you mayor me Shay us and the few militants who had been arrested or had left the ... region earlier were the only ones to survive the conflict\nBy Nineteen Seventy four the army had sent ten thousand soldiers into the jungle and find them be wiped out the ... y ...\nSeventeen militants from the ... were killed or executed in the jungle in two thousand and ten the inter American human rights coats older to the president governments to investigate and punish the military involved in those executions but no one has ever been prosecuted\nThat sits from this additional witness with me ... [noise]\nThe K U T public media studios you're listening to K. U. T. M. K. U. T. H. D.\nOne off than we are you're central Texas home for NPR and the BBC I'm Jerry ... thanks for being here and [noise]\n[noise]\n\nCity theater present down a parable on stage now through November forward\nThat against the backdrop of Nineteen sixties America down brings a gripping storm of suspicion and scandal where no simple truth or answers exist tickets and information at city theater Austin dot O. R. G. and if you are part of a nonprofit organization that offers regular volunteer opportunities\nLet us know about it you know your information to us at\nP. S. A. N. K. U. T. dot O. R. G. and things [noise]\nThis is a K U T Ninety point five [noise]\n[noise]\n[noise]\n[noise] and I am in London five AM in Washington midday in Nairobi this is them they've been at the BBC\nPrime minister Theresa May preparing to appeal to the European leaders for more flexibility over the terms under which the u._k. withdrawals from the EU next year will it be enough to get a deal\nAnd going through a prime minister my whether she has spoken for both of them how to break the emphasis on the cusp of us can determine if a race with us in\nThe store in some Jones Newfoundland has made a little bit of Canadian history [noise]\nHave\nThe legal risk the\nCandidate becoming the second country to legalize possession and use of recreational cannabis those stories\nOff to the news [noise]\n\nIs three are preparing for that ... that that is a no deal and that means that are very real made a\nTop dollar loss information OJ systems\nAre there is plenty of or that a lot of the European Commission but also members fetch for the second issue but I still have a call for that because I heard about a prime minister Theresa May frighten secretary\nJerry ... that was a British chauffeur said\nThat's all right though for our national or living and working and right when I heard that whatever the outcome of the negotiations they knocked out their status is not going to be affected that's quite a big issue for us here in there\nAs you'd sit around the table without the foreign ministers what what's the answer to huge to Britain's negotiating the way that they're trying to work out how to for example do but this Irish border issue what ... what does that seem to for\nYou and the other ministers [noise] same a rare thing 'cause I mean if there's ... there's about ah the issue that we are discussing is first of all\nThey need to think about the future of hearing 'em to\nLay the oh you're right they serve an easy marketable Andre also understand that relate to support ... friends because ah in case they have any kind of program like heroin as a country that we caught on to support of the time they\nAre six European member states having said that it is and our interests are there are many countries around the table I Would say actually all of countries that that has a degree but they're saying that we want to have a future relationship is there and I came to that is as close as possible\nI Believe that straight security the forwarding and defense policies are those are areas where they can really for it I Would say ready to go to\nA long standing relationship but of course before they do their future that we need to settle the boss\nThe foreign minister of not agreeing image thank you very much indeed um Clinton just quickly I wanted to make a point or this Buddha issue on the Irish island\nIs not just politics is there a recollections today of the time the IRA blew up our customs posed and killed Laurie drivers and customs people in ... paradox died as well I mean it's it means something\nHe's he's only ... motion and symbolism and that's why any form of food uh who'd actually undermined the peace process and for the union is any soldier of Boulder\nThe Northern Ireland and Great Britain would undermine this sense of the union so you're trying to deal with an emotional problem with technical fixes and that's why I think it's incredibly difficult\nContent view from Chatham House the international fasting ... indeed\nA candidate in Afghanistan's parliamentary elections been killed by a bump lots of under his office chair the Taliban claimed responsibility fighting between the government and the Taliban is far from the only challenge facing the country and the run up to elections coming this weekend\nIt's one of the poorest of news developed countries in the world many Afghans are growing increasingly disillusioned with politicians succumb to come on the reports from head out\nFor us to the\nEvery day five year old ... help connect water from the manual pump that his family\nDoes it cued behind him about the young children in that Paris full waiting with empty buckets in Jerry cans that poor neighborhood in the outskirts of Iraq isn't directly affected by the fighting elsewhere in the country but hardly anyone here\nHas hiked water and electricity and he runs around four hours a day\nMore than you can imagine how do we should all go and I'll go ahead and ...\nIt's ... father ... diem a shopkeeper said he will vote in the upcoming elections but he doesn't have much faith in politicians would improve life for his family maybe I don't know how I got\nIn Afghanistan no one who has been in power has ever done anything for the country they are just ... ... people have nothing\n[noise] despite billions of dollars of aid Afghanistan is a country still facing huge challenges\nOutside the United nations all fits in Iraq as some of the round hundred thousand people reach any displaced from surrounding provinces by drought many seems desperate\nThere was no one can act on it and no food to eat on screen right now we have [noise]\nNot around the court for the entire off gone what can I can try this level of the food insecurity they because of the drought that big I will be even higher the country has a long way to go before I can address people they\nGet it as fast\nAs of course been some progress over to pause Seventeen years since\nThe U.S led invasion and the woman the heat for we wouldn't have been allowed outside ... rule now she's an MP is on the campaign trail fighting the reelection\n... our experience who are dating new in all all politics\nTo be many decades [noise]\nTo improve the situation of\nThe human side and the activity and not just by and I think part of this little meant to the craft show today in pockets of the people that they didn't didn't have to be reading [noise]\nSixty the cross Afghanistan I think covered in posted the candidate but internationally these elections seen it a dry run for the more important presidential election scheduled for next year\nWith enough people feel safe enough to vote\nWith the results be marred by ... [noise]\nAt the bus station in Iraq the many young men on waiting to find out they're leaving the country as refugees and migrants\nRunning\nI really can't tell the difference between the government the Taliban and criminals let me so I'm going to Iran and then on to go to this new money you know jobs nothing to do staying here is like committing suicide [noise]\nIt's maybe three am in the morning and the buses heading towards the Iranian Buddha a full\nOne official tells me around five hundred people leave the country from here every night to\nAfghanistan is a young democracy but it will ready people's faith in it needs reviving [noise]\nAs to conduct Khamenei reporting from Iraq on friday here on world update will be providing extra coverage of the Afghan election will be talking to those who've been trying to bring peace in that country for a number of years including the form of diplomats Michael Semple who\nIs a real expert who lived there speak the language and we'll be speaking to the ambassador as well the Afghan on buses or to the u._k. that's our coverage of the upcoming Afghan election here among will duct tape [noise]\n\nComing up later on our program the BBC's had exclusive access to the scene of an attack which killed fifty three civilians in the northern province of Yemen in August ... local officials say that that included forty two school boys on the ...\nIs a ... area even if the fall of my shell trying\nTo civilians in this area was already in there\nSomewhere on the air strike was a war crime [noise]\nWonderful day promote a guaranteed coming soon headlines at the moment the U.S secretary of state Mike Pompeo is meeting\nSenior officials in Turkey by the Saudi journalist your mouth 'cause she'll be is believed to have been murdered inside the side of the country lives and the Taliban has killed a prominent candidates in Afghanistan's parliamentary elections with a bum wanted under his office chess those headlines this is the b._b._c. [noise]\n\nIt's just entertainment in London Israel says it says carried off air raids on twenty targets in Gaza in response to rocket fire from the Palestinian territory Palestinian health officials say one mine was killed in the strikes and five others wounded James rentals reporting for us\nFrom Jerusalem James the situation and gossip for the people who lived there we'll talk about the ... side of the moment but it's become increasingly difficult ... I think both the entry and exit points now closed\n[noise] uh yes Israel has a close or two of its main crossings are into Gaza including the air as crossing a and uh it has to space has narrowed the area which fisherman can fish I needed to last week suspended the transfer of fuel\nOr so is your other coast as it still is the occupying power and international law has the ability to control the pace of life in Gaza to control what surprised come in and out fair amount of course there is another border land border with Egypt\nThe candidates in Afghanistan's parliamentary elections has been killed by phone punted on to his office chair the Taliban said it carried out the attack on up to chapel kind of mine in ... city in Helmand Province stone\nOf the miners too nice in the Indian states have kept trying to break up angry protests to the open to women of one of Hindu and since most sacred sites\nTo some ... ... women off to the Supreme Court overturned a centuries old ban on women ... teenage condition is designed to stop them is\nThe U.S defense secretary James Mattis his sister to the Vietnamese airfield contaminated with Agent Orange toxic chemical deployed by the Americans during the Vietnam War it's useless to buy the think since ...\nCanada has become only the second country in the world after you're lying to allow candidates to be an equally sold insurance ... big profits going to organized crime\n... investigation the dance of fifty eight see any penguins since I was in southern Syria most appear to being killed in that don't get any penguins have the world's smallest species of England going just for the sentences and only send in ... I'm using the\nBBC News\nWho you are listening to well don't tell you from the BBC\nIn London and the system diamond and ... in just a wild why some women are stopping other women getting into a temple in India that's coming up first the\nUs to go to Mike Pompeo's in Turkey today for talks with foreign minister ... told you about the missing Saudi journalist ... ...\nHe was a critic of the Saudi leadership was last seen alive entering the Saudi consulate in Istanbul on the second of October Saudi Arabia denies killing him initially said he left the building a back door Mr ... spent yesterday discussing that with Saudi crown prince Mohammed bin ... in Riyadh\nAnd ... speaking to journalists earlier today as he was leaving for turkey Mr Pompeo said he believed the subtleties of major U.S ally also wanted to establish the facts\nYesterday I had a chance to have a number of medical center meetings with\nSome on a there from friends\nAre out of the foreign minister to those meetings\nI stress the importance of\nConducting a complete investigation the disappearance of democracy\nAnd they made a commitment to do that but that it would be a thorough quite\nTransparent investigation will all see there was also that that made a commitment that they would show the entire world the results of their investigation\nThey also indicated they would get this done quickly I don't know the precise time lined with I indicated that they understood the importance of getting that done in a timely rapid fashion so that they could begin to answer questions\nBut Donald Trump cautioned against rushing rushing to blame Saudi Arabia over the disappearance of demos cars so gee he said the three I was being treated as guilty until proven innocent\nBut how credible with any possible investigation be speaking on Tuesday evening last evening the United nations special ... on torture and it was ... says international involvement might be necessary\nYou know solution can be found in conducting credible an objective investigation ... level than perhaps it's important to traditional mechanisms would get involved I think we're a little bit early in the process to come to the conclusion there obviously this is a very delicate issue\nAnd I think we should have been will splits time under scrutiny to come to a conclusion of how they want to address this problem\n[noise] well let's be knocked among our correspondent in Turkey a mock despite the changing nature of\nThe Saudi version of events so there is some reporting which identify some of those who the Turks said arrived in two planes into is stumbled airport um some of those apparently approach normally of a mom had been sold ... security detail and they've been named\nThe Washington Post a obtained ... photos and copies of possible page of the Fifteen individuals who have been identified by turkey is being positive what was the Saudi hit squads dime sent here\nAt to perform an operation on Jamal jumped Josh laundry to kill him as says say the tax to interrogate him say the Saudis\nAnd the new times has peace to get their identities as they say that one of the people was a frequent companion of crown prince Mohammed bin Salman within a ... a plane with him in a ... a Paris who system and Boston\nThree others were linked to the crown prince of security detail or they have named the forensic dogs and they believe 'em to be a tipping among the the group that he was part of the Saudi general Security Department who had given an interview saying as some some time I go to a a an Arab paper based in London\nSaying that he can perform a post ... seven minutes in a mobile clinic\nUm the new time says that they have found that at least nine of the Fifteen suspects identified by ... he's worked for the Saudi security ...\nMinute treat other government ministries a bit of a few days ago we had confirmation that one of the Fifteen wasn't as a colonel in Saudi intelligence based at the Saudi embassy in London so ... taken together\nA would seem to suggest that these people have direct links to the top leadership in Saudi Arabia and\nUh it seems very very difficult to believe that these rogue individuals' unauthorized officials who waxing without the consent approval or knowledge of the top ranks of the Saudi Government as seems to be the case that Donald Trump is building with the argument that he is making to support the Saudi Government\nBunk thank you about blowing a correspondent into it we can speak to the Senate ... who is a Bloomberg reporter because the effects of this is the future investment initiative circled Davos in the desert that was supposed to bring together investors and high profile people in banking and in business\nIn to the kingdom of Saudi Arabia well that is generally falling apart sign up who's not going\nWell and it seems like all the big names that we know are are not going now it's\nVery very much so from business interests to finance later to get to the ah the guy\nWho was the last ... said that she is faring had checked this out yet it without getting any then but we know that in mounting pressure on the U.S government to stop that that sex ed notion that second emissions from going for the contract so far at\nThe U.S government said that by friday it wouldn't make a decision on that\nBusiness neither it's from Jamie diamond and to check back then I have that now they are pulling out so far out of the way that bad calm and all that that that aid or it won't be there\nAt this low for that yet I have yeah which has been trying for the past two years to build an image of itself as a country planning to modernize country looking drove away from its reliance on oil and\nWants investment for creating histories some defense too many ... you name it they want the creative side yet it yeah and they've been trying to and from all over the world from China India that us and Europe to come they just had yet it yes step up to and and that's all\nPart of that they can to try to deal with that big problem is that you had any idea what kids on employment\nOfficials take our say then aren't there around twelve right now I'm driving and from then then you know and employment 'cause I think that that's not much higher ed but this is a big issue that prompted for now with fight it what\nIs in effect from us and they just indeed I'm trying to diversify the Saudi economy away from reliance on oil and thank you for that information but Steve ... the U.S treasury secretary may make an announcement by friday you're listening to wilt up\nA new film showing priests getting drunk and sexually abusing children has become a smash hit in ... with the issues of course but don't leave Roman Catholic country it's been breaking box office records the film called kill all clergy and English deals with the problem of child sex abuse in the Catholic Church\nIs an issue that's not been widely investigated in Poland unlike other countries like Ireland\nTrying to end the U.S the ... refusing to come in some cities though have banned the film and some church one of those on the political rights say it's just portraying priest only in negative stereotypes reporting from also Adam eastern [noise]\nI'm sending more sort of just picked up some of the newspapers and that\nThis story is dominating the headlines the front page of the cars that they bought a newspaper read several polish bishops have already apologized for the citizens of that priest a substantial number of priests don't want to see the problem of Pete Ophelia\nThen it says that more than two and a half million people have watched the film clergy Mickey dishes most watched film\nYou have um show he's a I Would like to people to leave to send them off the scene to some and look at a priest as a person that's not at the same one who's accountable if he commits a crime as soon as many address to Catholics I Want them to reflect whether they are responsible for what they have just seen on the screen\nIn other words the Spanish diet you know the Mediterranean diet just includes a lot of good healthy choices ... says his family and the ...\nWell he knows don't really obsessed about fad diets are exercise trends\nWe lose this but I don't think we explicitly thing about every little thing that we'd all like just exercise whenever you can eat\nWhatever is there and a diverse diet and it\nSounds easy span of course is rich in olive oil which other studies appointed to as a key to the benefits of the Mediterranean diet ... admits he uses a lot of it I Love\nThat is true like I when I Lived in the lens ... used to tell you yeah I mean like your blood these all these oil goes yeah every time I don't know I just I eat a lot of Hollywood with every meal and sometimes just why do you like I ... I did some bread\nAnd when I go ... even more than my mom my mom used to cook but I use even more it's good for everything you make\nYes so true graduate student at our focus group of one ... in Barcelona wishing him a long road ahead to the age of at least eighty six\nIn Bolivia as in Spain there are not a lot of processed pre packaged foods and the diet there is also a move back towards local indigenous crops and at the front of that movement are women\nAs a recent article in several magazine puts it women hold the keys to Bolivia's food system the article was written by Leslie pottery so after a trip to la Paz probably so it was back in New York when we spoke we also reached out by Skype to one of the women profiled in her article Marci ... she's the head chef at the la pause restaurant goose do\nWhen we all got together was the first time they'd spoken since the article came out\nAgain and come back later years because of the ... the it's like Superman oh I'm so glad you're happy with it I mean you guys are such a ... good I people liking it yes yes I Love\nWomen like Marcia ... are making Bolivia an international food destination but don't take my word for word here's Lesley power so again\nWomen in Bolivia as far as the guys are everywhere\nAt walking to the markets walking the streets when you see food carts and said stand women are running than they are the people who are making the food they are serving the food\nThey're they're running the business as behind that said\nThere's one market woman in your story ... ... who said that men don't know how to sell a I Am curious to know what role men do play in the market\nAt they eat at the market at least as far as I sat there were ... you know little boys who are helping their minds out washing dishes and then perhaps running food at the most part what I thought that the men were at the men were there to sort of enjoy the women were making\nThere is some crossover between what sold at the market and what you serve at goose to Marcia tell us about your restaurant because it's kind of put Bolivia on the map as a food destination ... describe goes too\nSo we are at risk I haven't got restaurants like we may\nBased on the hundred percent believe them product we make mostly the station menu so you have like for example twenty Carson\nFixing well you know yeah well you will get like in every single dish and you'll get some like algae to believe yeah some products ... she used to read\nBut it's not like a ... D beyond traditional food is not like each other every and we basically do like techniques of the world you know the world and we use them within eight to ...\nYeah I mean you're doing avant garde kind of high end cooking with local produce do you feel a connection to the women in the market\nDefinitely definitely I think very connected\nI actually watched fell into you like being down\nWe women are like ... like a stronger the church or out the one who raised a struggling to torture and believe me I\nI Do most were drunk the kitchen ... even though like if like last each in any for ... kitchen you search treats with teaching the woman is gonna be the old ways to welcome she'd grown up and so forth I feel I Love\nI Love like it to find with them and I know she's tired of them as well because they're they have to actually go shop no\nYeah [noise] so Leslie probably so I'm Marcia has helped put a pause on the map as a foodie destination of sorts women run the market in la Paz after your trip there and your reporting where do you see this kind of trend going if we can call it that is it just about women and food\n[noise] Bolivia it's fascinating for so many reasons one of which is that it's incredibly by a diverse it doesn't have a coastline and so I think a lot of times if maybe overlooked because there isn't necessarily that started\nA typical beach destination aspect to it or\nA port even to add to bringing their products which is actually a boon in some way as it's been self protected by it's really sort of wild topography so I think that in terms of trans Bolivia as a food destination is is on the rise\nAnd that these women are going to I start to be\nRecognized around the world you know good feeling sound anyway as has pioneered\nA kind of food in Bolivia a you know a school of thought of using Bolivian products and there's so much in Bolivia that people haven't necessarily seen yet and having recognized and that women are are powering that is incredibly motivating an energizing\nLeslie power so wrote higher ground about Bolivian women in the food industry there it's in the latest issue a server and ... is head chef at goose do him a pause Marcia unless we thank you so much for being with us\nThanking America thank you for the Haitian\nWe ask Marcia to send us a recipe ever does she serves that goes to one not too time consuming are complex she sent us a keen with dish made with different colored king but to get this one step requires the coach mushrooms to let stand for three months in a dry environment\nAnyway you can make the call before you start fermenting the recipe is that the world dot O. R. G. from ... studios that W GBH here in Boston I Marco women back with you tomorrow [noise]\nThe world is a co production of the b._b._c. World Service we are I N WG VHS supported by the John Dean Katherine Tiedemann harsher foundation committed to building a more just virgin peaceful world\nMac found out of work PR I twenty twenty donors including the watcher more child family who supports Public Radio's dedication to fairness and objectivity news report and Marjory steed Hoffman who values journalism and storytelling to reach across our devices to create a more informed as to\nWhy the WG VH one for environmental reporter who's donors include the grandson foundation for the protection\nOf environment supporting a cooperative approach to solving critical environmental problems while we still can buy the lives family fun and that can be toughened furthering the values that contribute to help the planet\nSupport comes from UT Lady Bird Johnson wildflowers center with ball classes and programs for all ages including native plant gardening nature art foraging birding and more registration act wildflower dot org\nSupport comes from the Academy of thought in industry uh non traditional high school focused on personal academic and professional excellence for teens who want to excel on their own terms more at thought an industry dot com\nI got to get a dollar raise\nGo get yourself a little ... yourself as a paper and you are often numbers that they call it\nThe rat or maybe I'll go and you win money [noise]\nName is are the cola and you're listening to K. U. T. Austin Matty\nWell\nWelcome to use the average live from the BP well so it was in London onto Franks a day of development say with the suspected murder the Saudi journalist your mouth ... grew some new details of the police searches and top level diplomacy President Trump continues to hug Saudi Arabia pledge\nSaudi Arabia they're an ally of their tremendous purchaser of not only military equipment what I went there they committed to purchase four hundred and fifty million dollars worth of things\nBut also a mass shooting at at college and Russia annexed Crimea a centuries old ban is lifting um women entering a Hindu temple in India the women still can't get in on bricks it talks approached the toughest phase yes\nWe are desperate Europeans to avoid the catastrophe of no deal then let my mother's delusions\nTo avoid it and if you have to buy some more time to come up to the news\nBut I haven't seen any polls that show interest beyond Washington there's feverish interest here not only from politicians but also from lobby group sent from think tanks and\nHave people who are engaged with the with the Saudi relations but I I haven't seen a great deal of evidence for interests beyond it\nAffects Russia in Washington DC thank you very much while the political ... industry continues to just the Turkish prime even to exactly what happened in Istanbul watching for is that our correspondent motion patients\nWhat we're seeing today he's Turkish investigations moving into the council's residents now they've been trying to get into that building for days on main Turkish officials say the show gene was killed in the side of the ... and then it's believed this ball was moved to the second building\nThey moved in there they're carrying out as a examinations we know for example in the first building according to the Turkish president of the ... which are being tarnished they've he also suggested that part's over ... have been ...\nI think you have to ask the question Turkish investigators are going into drawing seen two weeks after it happened\nThat's quite a long time and I think most people will find any effort since ... perhaps we'll be included away\nBut nonetheless what we are getting uh some particularly grizzly accounts of what may have happened to Mr ... through the Turkish media what can you tell us about that\nWas very interesting won't we're seeing is a two track approach to this with the Turkish president asking questions off the song these walls half but he hasn't specifically pointing the finger accusing the Saudis\nOf more during the journalist Luo we are seeing the easily in the Turkish ... homeless out in the state sanctioned\nBy the media here is very carefully controlled by the government and we go pretty gruesome details that we can verify suggesting that perhaps Mr for so she was still alive when he was a fire being ...\nNo I don't think his tools who coincidence that those details ... as the U.S secretary of state walls in town and I think it's all designed\nTo the pressure on my own Americans but the ... says well\nWhat do you think ... ... the Turks in that case are hoping to come out of this\nIn drafting the Americans seem to be trying to create some regular and um when that occurs the Turks seemed to have you back with more allegations bought\nThe Turkish president has left open the door he hasn't directly accused the Saudis are killing Mr ... show she therefore he may be open to some kind of deal now do we do know for example the relations between Saudi Arabia interactive and fractious in recent years the Turkish economy is suffering perhaps\nYou might want some economic supports um we do know\nThat he's full to Mike Pompeo above a shoe off Syria America Saudi Arabia have talked here are all involved in that country\nPerhaps turkey would want concessions on that front so I think there was a big public debate going on it's being played laws but clearly there's talks going on behind closed doors and we simply aren't privy to these kind of\n... patients a speech me from assemble let's get another view on what the Turkish government might be one thing from the developing scandal at least hoping maybe the outcome ... to ... jump ties director of the Turkish research program at the Washington Institute for Near East policy\nYou sequels also the author of a book called the news so some one and the crisis of ... to ...\nWhat is going on at this stage is turkey is completely isolated in the middle east with the exception of Qataris has no friends and allies and although the alleged murder of ... is of course for the Turks a slight and for it on a personal insult because ...\nIs someone who is known to have had close ties to people in the administration I don't think I heard on wants to necessarily have a rupture with the Saudis at this stage Turkey's economy has not yet emerged from the crisis it's so very brittle\nThe Saudis and their rich Gulf allies of financial instruments with which they can hurt turkey by taking money out of the Turkish markets\nSo instead what Turkish president Erdogan is doing is trying to secure support of Washington and I think this is one reason why Iran decided to make up with Trump last friday by releasing American pastor Andrew Brunson or been in jail and\nReset on hope would align Trump more closely with them that is not exactly happened and I think that's part of the Turkish frustration\nI Would say turkey went on what I call it tactical pause in terms of releasing evidence to substantiate that this murder that took place at the Saudi consulate on friday the day of the idol on Trump reset and seeing that Trump is not aligning with Turkish position turkey ended its tactical pause and started releasing evidence again\nIn terms of some of the concessions though perhaps the Turks might want from the U.S if they feel that President Trump is very team ... to damage relations with the Saudis and not to make a fuss perhaps about what ... did go on if we ever find out in Saudi competition and stumbled do you think that\nThere may be a desire to extract to click concessions to meet us for example the extradition of the pirate for to to do them or in terms of us support for Kurdish rebels in Syria\nAnd Iran is someone who thrives on his image\nAs a strongman president he can't walk away from this incident without his image being tarnished if he does not extract something that the concession in the form of a deep apology from the Saudis and that concession would be that the Saudis would throw someone really important under the bus and that should be good enough for ...\nRussian investigators say an Eighteen year old student carried out a gun and bomb attack at a college in Crimea which killed at least Nineteen people rushed investigators say the killer detonated a bum before shooting his victims\nTwitter has publicly released old ten million tweets it believes are linked to Russian and Iranian state backed accounts that were trying to influence political opinion abroad some date back to two thousand nine\nAbout Garry men suspected of raping and muttering about Garry in television present has been extradited from Germany to his homeland prosecutors say the Severin because he made up of attacked says he rode Victoria ... while she was joking around a poke\nThe world Health Organization lumps the U.N Security council to give more resources to the international peacekeeping mission in the Democratic Republic of Congo where health workers of tackling an outbreak of Ebola virus insecurity due to armed groups and mistrust from the local community of Hindu medical ... as\nThe president of Guatemala Jimmy Morales says he won't accept conditions imposed by the United states\nOn foreign aid of illegal migration on Tuesday President Trump said he would cut off aid to Guatemala and Honduras if they didn't stop a caravan of mold in two thousand migrants traveling to boards the U.S border BBC News\nNext on the news hour we'll be hearing about the British from just a tough sell in the e you first start to look at business do you use in Canada has become\nA need a second country in the world to you're going to allow cannabis to be sold legally in show ... to ... the single kind of show today in the western province of British Columbia\nWell I'm an cantaloupes British Columbia and this is a site as the only legal currently legal store in the province of British Columbia is known for its candidates culture here\nSo that's why we're here to market and the store opened that ten minutes ago there cheering them in the store opened a and there's still a long line up there maybe not a hundred a hundred and fifty people who've been lining up all over the last couple of hours to get you to be part of the state to legalize stationed in cat\nRights and why are they saying that they all that I mean clearly they want to buy some marijuana but are they saying a loss will be able to do it safely and legally or is it just they want to be able to say we were that\nThey want to say we were there\nTo be honest theory that robots black or gray market in Canada who had been getting their hands on candidates the floor and that's one of the reasons why the Canadian government decided to go through with legalization they think prohibition get people who are already using candidates so they were saying look if it fails system let's try and replace it with what we think\nWill be more effective system\nDesigned to keep the drug that hasn't miners for example profit that at the hands of organized crime and potentially reduce health and social harms related to the drugs that their justification in their reasoning for bringing in this legal framework\nAnd in terms of what they've learned perhaps from us states that have legalized a year ago I the only other country to legalize what are they taking what are they going to try and avoid doing\nThere was definitely a lot of confrontation with those jurisdictions around the world you have already had legalization one of the things when I spoke to some of the officials in the government is\nTo be that strict at least it first showed the regulations are strong there they're stronger for example that regulations around alcohol they'd rather start with stricter than they say that something that they learn from other jurisdictions\nHow far as concerned being expressed in movies often the argument that is used about any type of a legalization will decriminalization of narcotics is that it could lead to the drug misuse abuse\nAnd there's a lot of concerns certainly related to public health\nDuring the public health campaign in Canada actually that is rolling out talking about concerns for example around mental health concerns around pregnancies and candidates concerns around me they forgot to say that ... can is that people have you\nFeel that they they become dependent on it as a sign that said there are concerns around that that have been expressed by the government there saying we're doing this to help address and prevent those concerns openly\nI mentioned other groups who are saying they're not sure that they will actually work and they're not sure it perhaps at tennis fully ready to deal with issues\nThe BCS Jessica Murphy she uh was speaking from one kind of does newly opened legal kind of bishops justice recreational use of the drug has been made legal across Canada from ... [noise]\nThis is a long way from the BBC in London onto Frank's [noise]\nThat was the price of the last the European Union summit meeting which appeared telling suddenly symbolic he was of the British prime minister Theresa May in a red jacket looking at a lunch group of Mayo you leaders clad in black apparently voting on her own mass\nToday Mrs may will be hoping that the optics some more some substance of the latest ... will be rubble positively portrayed among thing everyone whichever side they're on agree and that is the time is running out of ... on the eve to hammer out some agreements\nFor the terms the withdrawal from a cup of you're in March next year the hopes to cool is that what's called the black stole the insurance scheme that he wants to be in place in case\nThere are difficulties ever agreeing subsequent free trade deal the ... have been long and intrusive customs checks among the ease of land border with the u._k. which is between the Irish republican Northern Ireland\nPolitical sensitivities Thirty years of sectarian conflict I mean there is great wariness about pretending to any such hard border\nThat he wants to back up to me that until a few new trade agreement to suited out no than either would remain the customs union single market for the rest of the you you got a government county says that within ... it's a union of moving on with the rest of the United kingdom\nWants to drift in coming after the ... chief negotiator Michel ... is that a transition period between breakfast and then you free trade agreement could be extended beyond its count Twenty one month period to an hour long ago for a solution to be found to the northern border [noise]\nWhen they were very senior driven member of parliament makes us back to the moment but first within the last Arnold so the president of the European Parliament to be in these meetings today I'm telling you to ... he said he did nothing new thoughts\nThe atmosphere was better than last month rather tense some it\nI Want to be up to ... because of the political message of Mrs may is a positive message you want to achieve an agreement on the on the\nNews about the body language was more positive than in the\nPast ... than all the ... in the club of Europe or Memphis sites have a voice but some of the louder because of the size and plowed\nI'm One of those uh with the loudest voice is Germany the chairman of the German parliament thrown affairs committees ... he's a close ally the chance I'm going to medical what does he make the idea of extending this transition period between British withdrawal next march\nAnd the deadline for new food trade agreements in December twenty twenty\nThat is a deliberation and the proposal in order to get more time but it's ...\nIs it clear that it is not a replacement the substitute\nFor the solution post see so I Would very much for her\nTo find that the Lucian in the time left I think there is one mom left and there is only more or less one sticking point I think we are able to find a solution within about a month or if not and this is demonstrated by\nThe proposed love me said about gay we are desperate as Europeans\nTo avoid the catastrophe of no deal then let's find some other solutions to avoid that and if it is to buy some more time\nThe issue I guess as far as the British Government is concerned is that the facts do pool remain the unacceptable fooled by can so the more time isn't going to mean that they will be any necessarily any shift from the European Union which is what they want\nYou are absolutely right more time does not mean that you find disillusioned in the more time if you have gained so I ... my preference\nTo hurry up and find a solution\nBecause all the odd man out there and they have yet to be some more creativity in order to find a solution or one final aspect we seem to have agreed on that temporary customs union which would so many problems that will be mutual interest\nAnd now we have to find how to transition from this temporary arrangement to find the rain I I Would very much prefer to have this LBJ within\nThe next month who is responsible for that creativity as you put it is it all on the British side who do you think the European Union a side the other the twenty seven member states compared to the movies well\n... there's always a with negotiations and particularly among friends both sides should consider themselves responsible and in charge of creativity to find a solution which is in mutual interest I think this is what on both sides has to be done", "year": "2018", "show_name": "BBC World Service", "city": "Austin", "day": "17"}