{"month": "10", "state": "TX", "station": "KUT", "content": "Lip and blurred the car windows like does the mirrors I found him in the study in the back of his house\nHead bent beard and a book excuse me rabbi and I talk to you he looked up from the book his beard keeping the place\n[noise] he smiled what are you doing here on a Sunday the day you should be resting and I should be coming to turn on the air\nI smiled back but I came for advice or you're not hot enough you one my hot air to okay\nGood said that he waved and patiently at the Warren chairs you make me nervous standing like a soldier\nI sat in my chair a feather jumped out of the Christian with a little sigh my hands were sweating those brown eyes the same as leaders were beaming at me from\nThe photo or did they love math\nAnd set a rabbi\nI'm In love with a Jewish girl\nShe's from a very pious phone so I'm sure her family will be upset\nI don't want to hurt them but I Love her\nWhat do you think I should do the rabbis face showed nothing\nThe girl she feels the same\nYes rabbi\nHow can you know it's love\nBecause from the moment I saw her I felt sick all the time no that's not what I mean\nI waved my hands as if to a race that line than some back in my chair\nI don't know how I Know it's a mystery he didn't speak but his fingers in his lips moved a little tapping the book\nChewing his beard his eyes focused on the space above my head as if the troops were there and a cartoon bubble suddenly he leaped up and came around the desk I thought he was going to hit me with that with their little\nBody and those soft white hands that would have been like a child growing up just full of rose petals at me but\nStill would not have been able to beret\nAnd said he sat on the other chair which gasped and then exhaled\nDeeply let's talk turkey he said we're in Los Angeles here\nJust not Minsk thank God if she goes with you I Can't stop her\nHe shrugs\nThis one I could never control anyway she's wild like her mother was\nWhen you you think you can do\nBetter\nHow would you support her how long do you think she'll be happy living on the air she's a princess race to be a queen no offense but she stronger than you are believe me she'll crush you [noise] it's true I said she's the queen\nLike a mother he said again I said nothing\nWe both looked down at the moment passed there between us why don't you convert the rabbi said mildly\nAs suggesting fish for lunch [noise]\nWatch\nI looked up to see if he was smiling but he wasn't become a Jew he told me calmly become a Jew and I'll give you my blessing then I'll help you with the money\nI'll send you to study to become a Ravi\nMe why not you\nKnow when I met you that God had said you to me for some reason\nMaybe this was it who can understand God we can only follow the path\nThat he has written in our hearts no I think I can see what are you voting yours become a Jew [noise] Mary Leah\nMatt I thought most ridiculous thing in my whole ridiculous life lead and want a rabbi\nShe didn't even want a Jew [noise] she wanted me and how can I be a rabbi if I didn't believe\nBut if I some chance God did exist and how can I refused to play the hand he tell me what's at stake so high how could I not bet my life\nAnd if there was nothing\nIt was true I did not believe in God but I was beginning to believe in miracles miracles and whatever the opposite of miracles terrible wonders yes this life is a whirlwind and what can guide us through it not our eyes\nNot our ears on our brain what\nDifference does it make what we believe\nOkay and so [noise]\nI'll do it [noise] he stood in grass my hand\nGuiding me to my feet his eyes were set wet blazing heat squeezed my shoulders my son is said and he kissed me right on the mouth\nI felt his beard on my lips\nNo go he said go to her run Iran\nI didn't go back around the block I ran out the door and across the street and cut through the neighbor's yard I jumped over their bushes I stopped for a second\nTo like a flower a big orange flour the best one out of a ground roots and all\nA car honked and someone yelled and the dog started barking in Iran pass them across the alley\nAnd over the wall back to where my wild bride lay sleeping [noise]\n\nMichael your event I gentile by David going I'm hoped Davis thanks for joining me for selected showing\nSelected choice is produced by Jennifer Brannon Iranian producer is Sarah ... Maxine love is aren't literary consultant\nThe readings I recorded by ... Smith I programs presented at the Getty Center in Los Angeles or recorded by filthy rich and our hosts are record isn't Argo studios in New York City hound mix engineering Stanford on Mars theme music and David Peterson's that's the deal performed by the geared towards peace or some kind\nSupport for selected choice is provided by the ... foundation sponsor of the rain or worn a short story seedlings foundation Henry nice foundation and he acts Hampton foundation\nAdditional support is provided by ... hockey coach publishers of the best American short story edited and twenty seven teams I make one\nSelected choices also supported in part by an award from the national endowment for the arts\nProgram is also made possible by the New York state council on the arts which is a point of governor Andrew Cuomo and the New York state legislature\nHave ice dot com it's a proud sponsor of selected shorts ... dot com delivers New York original toasting bagels\nCoffee smoked salmon Bob ... him on your lap hefty state Puerto Rico and the Virgin Islands them on the Web at ... dot com slash showings additional support for this program comes from the station in public radio international stations nationwide\nSelected shorts it's produced by symphony space and it's distributed by NPR public radio international [noise]\n\nGood evening I'm Tracey ... you're listening to Austin's NPR station K. U. T. N. K. U. T. H. D. one Austin and on line I K. U. T. dot O. R. G. community supported public radio in the below center at UT Austin\nThank you so much for listening by the way the K U T fall membership Dr start officially tomorrow but we have a special instead of if you want to support the news and information program see depend on by going right now to K. U. T. dot O. R. G. there is a great ten dollar a month level and cool\nGifts that you can get you can see all that more right now at K. U. T. dot O. R. G. here in Austin to sixty eight degrees there is a flash flood watch in effect for Kamron well not well unless the\nKennedy counties through Monday morning at ten am uh for here in Austin directly we have a Seventy percent chance of showers going it tonight\nWith the showers in the forecast through Thursday so be prepared as you get ready to head out for your work week come tomorrow morning have those Brelo is ready and give yourself extra time\nIt's ten o'clock it's time for the BBC to carry us through [noise]\n... to talk to you thank you very much for your time today Peter Peter ... could you survive of child sex abuse by Catholic priests jumps lecture\nAnd many spam Theo Britain France and Germany have denounced the killing of the ... the ... ... inside Saudi Arabians comes in techie\nDream statement comes days after Saudi or forward to the me too that he'd been killed inside the building of this month saying he died you know fistfights the Saudi foreign minister bill of ... I've been speaking to Fox News about the killing which he called murder\nObviously was tremendous mistake made with mounted them as they leave them to try to cover up that is on the government [laughter] things unfortunately we haven't been very clear that even though some of them are in the relationship is huge for them to do [laughter]\nI Believe that when he was over [laughter] you\nKnow who's responsible and see those individuals being punished procedures in place in this from happening at the center for whether this\nLemon these students has ... to fool the bulk news websites I also what was known about Saudi Arabian campaigned silence on line voices of sound he does and\nThen you had a stray that came out yesterday that basically that did not see first uprising that Saudi\nArabian government was sort of organizing Mitt army if people on Twitter to sign a dissident credit but what a lot of it so interesting about this new show to compound and\nIt seems the Saudi Government\nTo groomed an engineer within Twitter to get him to sort of buy or look into certain people to count and they fired him and twenty Fifteen and then this component that isn't that McKinsey and company which is a consultancy they've reduced to report around twenty Fifteen\nAbout some sort of issues with and announcing that the government had made about economic changes that they were making and then became the report flags at three different Twitter users in the report and after the report\nSurfaced somehow maybe got and they had the Saudi Government one of the man behind the counter was arrested another one hadn't had computers ... until his brothers were arrested and the third account which is not um it\nWas the lead adds to the question is what was McKinsey during who hire them and were they involved in it now but it hasn't put out a public comment McKinsey is that they're horrified that happened they obviously have raised a lot question\nYeah on about the motor is so full access to I'm not even\n... I think a lot it's done now we're hearing sort of like the Saudi Government now thing has happened that they just really a minute on friday that there was a murder at all or something happened you know there's still a lot that's unknown and I think from the United\nStates has died two we're still trying to figure out how our government plan to\nRespond to President Trump has been pretty slow to pull the trigger on anything on this at first you're saying you know well they deny it now has admitted that there's some deception but obviously we don't know what that our government will take here\nSome nice to you as a reporter for the books news website\nNow listening to music coming to live from London my name is ... I'm a poll Hawkins I'm Lucas points news you on the ball well\nLewis said he's said these teams go that strategy wrong of us in the Americas gave me writing and was the one of the United states has grown pre Texas' fast race victory in more than five years how often times Sundays plus he's trying to Sebastian Becker was full\nSo it means that the purchase Trump afterwards a little longer before you can go about trying to clean ... home in the world championship in\n... English Premier League amateur moved into the top off the table is called a couple of goes in the last three minutes of the game that'd be critical Polly Sunil Espanol have gum second in Spain's leading into Milan got to stop his time when a basic message ... AC Milan in the Italian League\nAnd tennis on the brink of action of the round Robin stage of a WTO you find those in Singapore defending champion Caroline most knock you off to opening group came to ... please come a long suffering trust in the other group to waste on today with Japan's us I've been champion Naomi Osaka facing the American blasts Sloan Stevens\nCourse I'll thank you Andy a mold for Monday and twenty five minutes or there's just an average day eat the food dabble in the density is due to stomach the big\nInvestment conference in Saudi Arabia that's been overshadowed by the cunning and Sandy ... showed me the question is who still going on and you would is that business presented this morning Andrew there being some a high profile put out some that\nYeah it's actually in some ways is easiest to say who isn't going then who is going because the website like previously have lists of the delegates are and so on each still has a list\nSome of the strategic partners the swamps as like Credit Suisse and HSBC in most account\nBut we don't actually know who will be going at the moment um we've heard reports that to a lot of more of a Russian a mid level executives will be attending um but over the weekend you head for example the highest profile withdrawal over the past couple of days was steep and Lucian the U.S treasury secretary\nI mean that was quite a quite late before he was drew which I think perhaps shows how the uh uh the American government has been a relative or will not completely sure how to how to deal with this but as I say these these people are pulling out on this conference happens every year I Do know there's going to happen next she will\nI think at the moment I mean she's on the number two last year it was very successful because it was the chance to Saudi Arabia\nAre and taking them at home and done someone to a ... the ah the country was trying to do to modernize and so on but I think kept well he's Ali al ... should go fast\nAnd he believed to the summit may never recover it sent his reputation\nDevil is in the desert is really important it shows a Saudi Arabia has the key investments\nEnvironment in the middle east there were drawing of the American and British or the presented as a dish and too many famous needing a business leaders\nAre really hurts this this idea you know this could be the last time that this this event has has because it's now seen as a way for other countries to damage to influence the the business in the bottom is in Saudi Arabia\nAround that was on the island I mean it's all the or the use of go fast\nI mean obviously the or the ... to ... to kill other journalists who was killed a\nHas a shot at this but just to remind you Saudi Arabia um has a very weird economy is not actually that the ... is a big producer of oil and the only dear of this vision twenty thirty ... was supposed to promote\nIncludes things like trying to get the private sector to increase from forty percent of GDP to sixty five percent of GDP\nAt the moment you know a Saudi Arabia is a very state dominated economy UCLA's donation in particular by the uh the giant oil company aramco plans to privatize that's where it leads to sell off many of the ... as a last year that those plans have since been abandoned\nOr anything country that type of ... percent is Monique Andrew would [noise] drilled them food plunged into these off to a result belonged to Israel the agreed on ... ... of the Nineteen Ninety four peace treaty between the two countries blond he's only about ten Columbus was ... but\nThe symbolism of of this which is a ... of relations between the two neighbors of good some perspective from Sarah ... who ... who is the assistant professor in other studies of northwestern\nUniversity in Chicago and joins us now good to have you on what has happened yeah\nWell and like on China's a relationship of Hong Kong Jordan editing and it costs\nTo the peace agreement in the Nineteen Ninety to me to parcel of land Israel for a twenty five year period\nAre that at least now called you and Jordan has no intention not to renew the least for the foreseeable future causing consternation within Israel and celebration with in Jordan\nRight why Israel need to lose something long [noise]\nBut I didn't really need to lease that land it was just part\nThe closet Nineteen Ninety four peace agreement however Israel today I usually this last for a variety of purposes for by the agreement that they can use it for private land development the parcel out in the door\nI'm about eight five square kilometer and piece of real is actually known in the Iowa piece tourist attraction I doubt on how to use ... they have four mile square kilometer parcel of land is used primarily it's agricultural\nUm ground on and and I\nFor about thirty far or is in the south of Israel\nAnd your reading of this situation wide use in Jordan of decided not to renew the lease\nTornadoes responding to a series of domestic pressures and there are\nSeveral clashes with any\nIsrael especially in the old city in Jerusalem that have involved are Jordanian on\nThe Jordanian and national and that had been disturbing for joining as well as a general and\nSaudi Arabia has king Solomon and crown prince Mohammed offend the son of the magic journalist ... ... to also that condoning says it comes after the Saudis reverse that policy of denial to admit missed a crush of gee was murdered inside the consulate in Istanbul three weeks ago\nPresident Trump says all assets being made to stop what he called the ... the legal aliens that's a caravan of about two thousand Honduran migrants marches towards the United states\nIs the Trump tweeted that they would be turned away if they did not apply for asylum in Mexico fest [noise] and he reports since the world is losing the war on drugs and that the United nations should abandoned the dream of a drug free world\nInternational drugs policy consortium sense un targets to reduce cultivation and smuggling I'll be missed and drug use and deaths from drugs ... up\nThe Norwegian Resistance I tell ya a king ruined bag sabotage the Nazi need care program in the second World War has died at the age of Ninety nine ... right on the heavy water times was most allies in the film heroes on ... and that's the latest from BBC News\n[noise]\nThings maybe not a good morning and welcome in his knee say from the b._b._c. world says who may pull ... and ... said that I saw fall will be talking about the Somali queen ... a man who's built a team for himself and his three wives and the nicest business these and\nIn ... Louis Hamilton still waiting for another for me to want to talk a little while to come in the next ... [noise]\nBut we saw the ... where the government has signed a peace deal with the O. N. L. F. rebel group to a more than three decades of conflict in the ... region of intellect stands for longer than national liberation front they used to be classified as a terrorist group fighting for the right to self determination in a positive Ethiopia that's rich in oil and gas\nTook the hummus well to marry him grew up in Ethiopia and is now an associate professor of international relations at Fort Lewis college in the U.S I asked him how significant the signing of this peace deal was\nIt's very significant and it's one of the many agreements that the new Ethiopian prime minister Abby has concluded it was a rebel groups in the in\nAnd the country who all the other than national liberation front has been about them\nLearn to struggling for cessation because somebody legion ... this is the ... and in Eastern Europe yeah as of Nineteen eighty four as you mentioned the new news clip the group has been money's your standard list until recently when\nThey have done parliament removed three opposition rebel groups like though and less than a patriotic ... seven and oh and that left ... of them is the last describes to some of the national liberation organization\nStruggles with the right so there's so many people in the ... and uh its claims to be independent of the a multifaceted conflict that exists in\nThe country that we know has Somalia\nDo they fight do they have um\nOh of course they had to do is put example one of the most significant things they did was\nIn two thousand seven when they ah came to a region where the Chinese would extracting natural gas and oil\nAnd killed about seven Chinese in Seventy four other people so that you say that wage an item to struggle kind of a low intensity inside and see\nWhat happens to than beads for self determination in the region now with the space tail\nWill they still say that they are dedicated to their sons because I'm an Asian but now that they're going to achieve this through peaceful means I think the conditions for this agreement or facilitated by the appointment of ... who is this for money\nAnd a technocrat who lived in exile until recently\nBut who is now ... the acting president of the region replacing the notorious previous return on President I'd be Mohammed Omar ... DNA who is currently in prison\nAnd who had committed atrocities against Somali civilians under the pretext that the uh they were sympathetic to the ah oh and that last\nBeauty not changing ... you think is Bruce about speech to\nWell you know where that it's going to be a real peace still remains to be seen but at least you know it's a it's a progress in the right direction and as prime minister of hobby is putting out fires in one region that seems like there was a fire in another region\nSo is there is still not out of the woods but\nIt's one step in the right direction\nThe Yemenis will marry him they grew up in ... and now an associate professor of international relations at Fort Lewis college giving us his now isn't that the students on between Ethiopia and the O L\nF rebel groups from the horn of Africa to southern Africa ... national um cultural ... on day\nLast them deal with some people on November ... bumper lumped commission says the odor to last us help farmers can be used to improve productivity of economic development lumped ... jump on something by by the ... the\n... of them she says that the public ... interest to you know on the shore under use London on land with multiple locations\n... you from ... from all of the problem I've done some house and he was in the country three years ago three weeks ago sort of\nBased it's an investigation to find out what is the actual situation probably land currently in terms of who actually own the land how productive is it and if questions of security\nWhen you're just jumped on your would you know people ... ... titles others would use a lung dozens of these little\nUm some people do have a land title is I Do not so they've ... they've been around that they've been issues around to land Texas two thousand seven but they've been questions about how fair that land tax standing\nWater in getting the attention they contestation between white ... got\nSome of us will be above the ... on a little bit of humans both sides\nBut I'd want to make is that the racial and they show you the conversation between the white farmers\nAnd they the government is only a small pot why to land issue but as we all know in the two of them there was a land redistribution of five thousand wife fell in love with the time\nI think it's now down to about two thousand [noise] well there's actually been a process of engagement between the government and the life so it's not his motive of it was a few years ago but the government has said that they're not willing to compensate I'm white fondness\nFor improvement for the show late to that land which was taken from them\nThe life some of the thing that doesn't go far enough because they want 'em to St Paul having lost that fall in the first place and for whatever improvements Fisher is an ongoing dialogue now the positive thought about it is that\nBoth government and the white farmers have acknowledged that they need each other they knew minister of of agriculture the former Marshall and ... the state of extra is just a couple of weeks ago that commercial farmers union I either life on the central part of of agriculture\nBut if we brought them to do something a little bit more vigilant ordered goes beyond that you should be raised by the ... of the other issues of government hopes to achieve or ... or by conducting unloaded life was\nThat one really wants to turn the page on Zimbabwe's tested land legacy\nIssues around corruption multiple ownership they are also technical question about irrigation they've been disputes about water right for some people who have that down his share their water you know things like that there is a number\nOf issues about the most essential part is to find out who actually is on the land and how productive is that because\nThey've been a number of land order which I looked at over the years but none of them ever really done anything so if this land or it actually does what it says on the table and if they carry out what they think they will this is actually a very important initiative falls in love with agriculture a former well below\nI think for most people what people really want to see is farms which on to your to let it can only buy ruling elite\nUm across party lines I think what people would really like to see those redistributed to people can actually make them\n... from the Africa program a chunk of house\nWhen the minutes to the ... the new ... of a Nigerian next communal violence in the state to have to do now has killed more than fifty people in the last few days\nMy shirt sleeves\nWhen they're ... so some people say that she was from a family as I say my father was\nWar and he didn't come back to ... her husband so she was with the child\nAnd she then so again like the fact that all of the clients were having constant war and the men would die and also there was no one to kind of till the line and and do all the the rules that with all this is a ... job\nAnd that's where you had a lot of women who basically were dying annex it showed the cause of the lack of support that they there was like oh that's not my role it in my in society I have a role to stay at home\nAnd have domestic Charlie she was like no that's that's not you want to survive do this you're going to have to go out there and do the jobs that your husband your brothers your sons are supposed to do\nA whole a whole ...\nWhen it comes to that somebody community she has quite different responses out of people some people are like oh hey\nI'll clean out a well like you know no way to a woman champion of equality and other ones like shame on you know she was the one who\nWas on the men and she gave women all these crazy thoughts and so you see for example some some money mothers or and women would call other women and\nUh well it's not like a child who is quite how these outspoken known her mind on the other hand you will find that many men are like oh darn well and you know you're so hard headed\nHuh huh when you log in\n... people in my family who are very on T R well and they really don't like car they think like she is the anti Christ other people in my family are like very supportive of the fact I'm doing a play\nAbout well I'm going oh my God\nSo you can see the contracts within the females as well who is so much huh ooh\nAgain\nWho's ... huh\nLook I'm a young directs house looking for a new project on sugary approach me saying that she's got this idea is a story that needs to be told it's a really controversial story\nAnd she thought that there might be a good way of telling the stories from the people in a very accessible way also and exciting when it\nGoes a little ...\nWell before we even started talking the script we just really try to pick the characters we went off topic we talked about what it was like to be a young woman in London today to be a young woman with family background ... not from the u._k.\nLike the role of women in the house like you know who are your role models going up so your mom your grandma I lost like ... shopping and just developments trying to see how than we can use real life to kind of fuel the story so that it can resonate with our audience\nHa ha ha ha ha ha\nBut I feel like that so mining nature has so much to offer especially with the story then\nYou've got so many things that in the somebody culture that is kind of being lost or that could be taken advantage of I like in in in terms of showing contributing to the arts in London or even in the u._k.\nAnd they have all these different songs don't just singing and bought like poetry and different beats that go with friends like that something that we can share as\nA community and with the wind and kind of like forced the about understanding and a more\nThorough somebody ... somebody called\nHats\n\nYou lie during my love or that is a ... a brain founder of clean shaven producer our weather or even a year with the plays a\nDirect a puppy cliff it cost you a question go for it or leave a football where you'll be up to the yes every day well we'll just told me about the moment\nIn the meantime though I'm Twenty one below me as a result of over ... region which is ... tons of media Harlem up on this already built himself up his one two three one two is that the digital herbalist a host of the building probably grave about eight years ago\nWants to be remembered well after his death for being different from what she's community because he just to know you have to be ... ... ... ... ... [noise]\nFrom the outside construction site appears to be the mocking so with like the unusual but something surprising lies and if I told them to do to be on to them on the ... and his three wives permanent residents know enough to their deaths ... you need to\nKnow any of these ... one section has been to achievement\nOver lifelong dream number\nOf them yeah let me was how your toes I'm yeah a lot for new\nI've decided to build a scrape because I don't want to be for Gulf in providing that have done a lot of things but tens of millions\nAnd it's the thing that I can manage to do so will be used for me and my wife is has almost one Hector it's twelve meet down this is very crucial to me because it coming generations will know who I was to his family\nI suppose the wishes when to let me and he's the way she would be body can these grave windy bus which book ... his wife ... ...\nNo none of his more funding for them I think it's very poor and he has done something nice he's making his own place after death as one of his wife it's a case for me we're happy because we will be buried together\nWe still don't let me see ... to ... below us into the project which will take four more years to complete by the costs liposuction of these ... in the village studies but what you can have not gone unnoticed\n... mixed reaction to the ... which has surprised many in lived others on such short\nWhile ... to ... to ... to come on the call I\nThough I think I'm okay with it because since he started is traditional herbalists practice he said he wanted to make history uninsured that his life will never be forgotten\nThe outcome by we are supposed to\nMake a big bang they'll go well when you and your ... your Jake day\nIt's something very weird for me I've never seen some building his own grave it's such a cool somewhat I think this could be acceptable for our leaders ... the founder of our nation nearly as a place for his memory but I'm very surprised that this local them building such a huge grave\nAnd the tomb is not the only thing that has a truck that goes on in these times in in town missed some of these are the ... that he's Bodie be mommy fight in Port on a display has also raised I ...\nIn a culture where making such a legion diversions for this can because he doesn't look too short to drew attention for many years to come [noise]\nThose David and Charles ... yes um would you make about what we'll divvy thought about what you want to be buried if indeed you want to be very detailed and I'm a book about this really wanted\nTo know bought a warming up to commercial noodle\nBooming of cremation Las Vegas I'm going to be something [noise]\n[noise]\n[noise]\n... chief public media studios you're listening to the G. H. D. one often we're community supported public radio and you're central Texas on NPR and I'm sure there'll be a great night to live in a car\nDid you hear about the recent boom in paleontologist inspired by a famous film\nThe dress the generation is one hundred percent of things\nOr what about the couple that propose to each other simultaneously\nI'm Ari Shapiro the world is full of all kinds of news and when you support NPR you help us report the good the bad strange and joyful\n[noise]\nA hundred hours GMT welcome to the news room to the b._b._c. World Service I'm Janette Judeo the Australian prime minister apologizes to thousands of victims of child sex abuse it would let down by the state\nBut it was very very moving from a surfer made guy made a lot of comfort\nAre actually said to a couple of victims here\nUm at least we lived long enough to hear it\nBut other survivors say woods I'm not enough Saudi Arabia denies the crown prince was involved in the middle of the journalist your mouth shut Jay an office his condolences to his son and\nThere was no hiding the joy of these migrants those tough like sick of police thousands\nOf Honduran migrants macho on to the U.S that despite warnings from President Trump that they will be granted asylum plus we look back at the heroism of the ... region resistance fighter who has died at the age of Ninety nine that's coming up on the news and\nTo try to cover that is unacceptable government these things unfortunately happen we want to make sure that those who are the ones who are punished\nSaudi state news says the crown prince and the Saudi king Salman I've spoken to Mr ... son to express their condolences following\nThe death of his father but the Saudi version of events has been met with deep skepticism with even President Trump accusing the kingdom of deception and lies a Washington correspondent is Chris Tucker\nI don't think there's any surprise and the fact that they'll lose your bad decided that he was going to go on Fox News all the American networks\nIn order to speak to the American public but perhaps more specifically to speak to the American president because Donald Trump regularly sits and watches folks used we know that sometimes his tweets or even influenced by what he's just seen on Fox News so I think this was an attempt to send a message from Saudi Arabia\nBut they are very concerned about what has happened they try to try and take us away from the crown prince Mohammed bin Salman because they want to try and say that this was a road project suggesting that the security team acted\n... they had been asked to do on even suggesting that they had to the tempted to cover it up\nThe ruby in these really serious questions and if you listen to some within the Republican Party they are still demanding answers I'm Still suggesting that Saudi Arabia is not telling the whole story\nSo it doesn't appear as this effort to show the crown prince has worked at least as far as some senior Republicans are consent and this makes it very tricky for President Trump\nYeah if you listen to Bob Corker for example who is a senior Republican he's a pretty influential Republican and he's also a member of the Senate Foreign Relations Committee which means that he has received some briefings when the gas\nAnd he has been on the un I Want to wall saying that as far as he's concerned he believes that the Saudi crown prince was in some way in bold does what he was pretty blunt decide\nDo I think he did it yes I think he did\nNot President Trump has to be much more ... language not does give you a sense but he's trying to protect that relationship with Riyadh which comes down to\nEconomic reasons influential reasons even going to the simple fact of oil but\nOf course we do expect more information this week suggestion that turkey is going to release more details of what they know about this killing inside the conflict and the fact that Saudi Arabia themselves and are referring to this other criminal locked holiness merger\nIt all leaves the country in a position where there needs to be an international response of some sort\nOf course the fact that Donald Trump says every effort is being made to hold the progress of thousands of Hondurans who are marching towards the U.S food at\nThe migrants managed to cross into Mexico despite threats Mr Trump to cut aid to the region and to close the U.S Mexican border if they went stopped that progress is being monitored by police helicopters and dozens of offices\nOf correspondent ... who is traveling within sent this report\n[laughter]\nThere was no hiding the joy of these\nMigrants Mexican police arduous journey to America [noise]\nWe are now by the way they were\n\nPretty soon it started to become clear just how many people have made it across the border from Guatemala [noise]\nWeek Donald Trump's been demanding that Mexico stops the migrants for awhile further down the road it looked like riot police would try and sell them form lines and hold up the comb\nBoy [laughter] time passing tests\nBut nobody here seem to think it was the end of the journey to the U.S [noise]\nBut we feel energized says this man he kept going all the way to the u._s._a. and suddenly in a scene that will go down well the White House that I Would I'm On the\nMexican police were given the order to stand down return to the buses and allow the many hundreds of migrants to pass\n[noise]\nRecanted have looked like the Mexican border might be possible with the gates closed all the migrants stuck on the bridge from watching them all on the scale of this convoy\nHaving been revealed after coming so far getting stuck there was the breaking point for many he took up office from Guatemala ministry we\nBust back home [noise] and that's\nWhere we witness just how so many others avoided the authorities that determination an obese desperation to escape the lives they left behind in Honduras compelling them to take ... to cross the border\nBy ... the ... were looking for luck in another country because in our country we haven't done this man tells us despite all the warnings and threats more migrants are still making their way here into Mexico to join the rest of this unwavering comb boy\nAnd the ... poll on Americans to talk with a is on the hunt to find a couple who you physically after the romantic moment a few days ago Matthew ... one of the country's national parks the man is on one knee appearing to propose to the woman at the top of the cliff\nNow hundreds of thousands of people have seen the picture and social media and not trying to help find them in newsrooms I suppose that takes up the story you send me the national park in California has these really dramatic faces sort of towering as a forest wants a full of\nThe ... became very popular with the ... I'll tell us a test for Adam ... he's famous black and white pictures of the puck\nNow this particular spot it's cool to have to point it's almost eight hundred meters high and if you go on ...\nThe right to presidential front runner in Brazil I had both scenario has threatened to ban the left wing workers policy if he defeated candidates and undo a dad in next Sunday's election BBC Brazil correspondents has missed develops an hour as rhetoric is causing deep concern\nAnd country with recent memories of ministry dictatorship\nSaudi Arabia says king Solomon and crown prince Mohammed have phoned the son of the ... ... ... ... to offer that condoning says it comes after the Saudis reverse that policy of denial to admit this to shove Jay was much ado inside that comes she lives in Istanbul three weeks ago\nPresident Trump says every effort is being made to stop what he called the ... of the legal aliens as a caravan of about two thousand Honduran migrants ... towards the United states is the Trump tweet shit that they will be turned away if they did not apply for asylum in Mexico fest [noise]\nAnd the report says the world is losing the war on drugs and the United nations should abandoned the dream of a drug free weld the international drug policy consortium says un targets to reduce cultivation and smuggling\nOf they missed and drug use and deaths from drugs are up and the Norwegian Resistance Herrera your key ruined bag to sabotage the Nazi nuclear program and the second World War\nHas died at the age of Ninety nine you standing right on the heavy ... was in most civilized and the film heroes of ten o'clock BBC News\n\n[noise] you're listening to off the crash on the b._b._c. World Service with me you know golden [noise]\nI'm an economist impressive globalization and development at the University of Oxford previously I was had a policy for the world bank and before that economic advisor to president Montana and chief executive of the development bank of southern Africa [noise]\nHaving worked all my life as an economist it's not easy to miss it but I think the financial crash of two thousand and it reflects the crisis in economics met my profession as a great deal on it for [noise]\nI was working in Washington in the run up to the crisis and neither I Know my colleagues knew that many thousands of others in the central banks finance ministry\nSome commercial banks soared coming what should've been a moment of triumph with economist preventing a crisis turned into a spectacular public failure but where economists to blame for not stopping the crisis here's the highly regarded lead economics commentator the Financial Times must move\nI Do think that economics sitcoms folded and ... influence policymaking bad substantial responsibility for what went wrong\nSo what we're calling them is meant to be doing economists people like me welcome all kinds of things economist in finance\nAdvised bankers and their clients how to make money and understand risks those working for government in central banks in finance ministries have a particular responsibility to ensure that financial stability\nThe Nineteen nineties and only two thousands were good times where economist for keeping things running smoothly they were rewarded with money and kudos\nMost of the public would barely aware of them as economies apparently took too long nicely on they watch until suddenly these experts proved to be totally incompetent and able to see the crisis coming and to stoppage\nProfessor mixed on President of the u._k. Israel economic society thinks the reason that economists struck the goal was that there's some things with load\nIf not easy to have a really slick pat I'm such a wide they didn't see it coming but one way of looking at it is that those people who are managing financial institutions\nAnd asking whether they found all not tend to look at them one by one and what we know that financial crises is that there's a domino effect and the way one bank notes down another bank is that they lend to each other and I'm very into was and why did they build\nModels not one dumbing down notes down enough of them now they build models actually that if that wasn't bad [noise]\nWatch all these models exactly the ways of trying to predict what will happen if you're just one thing they've prices interest rates unemployment\n[noise]\nOriginally there were actual mechanical model is still one on display New Zealand that uses water to demonstrate how money would float around the economy as computing power has grown so to as the complexity of the models which should call them is try to capture\nThe key relationships in the sense of clever equations what professor Nick stone is saying that the models economists were using to predict the future assumed\nThat if one bank failed it would bounce back and also affect others but why would preventing models assume that the crush couldn't happen when economists note the economic crisis occurred with disturbing regularity\nPolitics that story of assuming away those things that were dangerous\nWas because economics had had quite a lot of success so if you look back at the ten years before the financial crisis also that what you call it a great moderation\nAnd what that meant was the boom and bust didn't seem to be with us so we this is really how long a cheerful way down the river a reasonable state and things are going OK\nPoliticians believe this to reassuring people that they finally found a way to keep prosperity going forever here's the venue ... big circa Gordon Brown speaking in two thousand seven\n[noise] we will not return to the old boom and bust [noise]\nEconomists so happy to blame the models they made for being an adequate but is this enough was the deeper problem with economics the bank of England's chief economist and they held and has no doubt that economists were in deep trouble\nI think we should take some of the black as an economist is and was what my whole life in economics truth be told our coast model\nOf how the economy function of how our system and um that will call smuggled fail at the first time in the crisis it could not make sense of what was happening around us\nSo of course that was the fattening we can and we should have happened after the Nineteen thirties go back and reform written branch seems crazy now to think we somehow lost sight\nOf the importance of finance and money in banking and extending the ... and the economy\nWasn't the economists who are folks who the discipline of economics at so\nMy own view is that some economics\nBut the economists have come to dominate the discipline\nThat having a helpful obsession with perfect mock ignoring the costs of economics which do not adhere to their ideas including the central insights of John Maynard Keynes incredibly these high priest of the new economics\nSimply assumed to weigh the risks associated with crises as well as many other fate is such as environmental damage will collusion which one forensic to market economies [noise]\n\nWilling bouncer the former chief economist at one of the biggest us banks Citibank believes that it's not a failure to see the crisis coming which condemns economists but rather the fact that we were captivated by new fashions which left us ill equipped to do anything about it\nNobody showed me seeing a crisis coming not doing that\nSo true particularly bad about not seeing it's coming it's not that uncommon right my doctor doesn't see my diseases coming either\nBut my doctor can prescribe at least I Hope so the rise meds once that disease has been diagnosed but much of the fashionable economics of the Iraq had ... nothing to say about how to handle the crisis\nIt took us far too long to diagnose disease and responses appropriately\nThat was the school of economics that actually that is how to handle the crash was old fashioned games in economics and the number of people made that point but then people recommended fiscal stimulus in the face off a deep recession they weren't\nUsing frontier economics with a guy that gets stolen graduate schools\nThey have a using stuff that if they do remember it from the undergraduate days yeah so he can under the searches that rather better than the economy of the eighties and nineties and the early ... says\nThe financial crisis I like to the extent to which was being tortured universities was increasingly irrelevant\nWhen do you call them was head of graduate studies at University College London top rated economics departments she saw how unhappy whose students were with a mismatch between what they were learning in close ... there was seeing on the news as first banks and then the whole financial system began crushing down\nWe're all watching this and in some sense struggling trying to understand what was going on there were similar a sense of students thing very complex\nAnd what they would come and say is can you help us understand what's going on we're not learning to enact classes and they were right they were not getting in their economics classes a set of tools that was helping them to understand the day by day\nDimensions of the crisis and Christmas was a good sort of catalyst because\nAt Christmas people have thrown together with their relatives and one typical question is well your studying economics you can tell us about the global financial crisis and the students having to say well we're actually not covering that knocked off is\nAlong the same lines they tend to produce that group's thinking if you have a room which is more diverse which includes both genders different origins cultures by ground\nYou have ... the diversity in and of itself produces more critical thinking than among only take so much any us thinking produced by one single group without diversity\nEconomics profession needs to get beyond the white men in suits stereotype to genuinely reflect a wider range of experiences and best represent the ... we're living on and goes your country Waller is a former finance minister much area and managing director of the world bank\nShe says it's not that these diverse voices on out there it's just that they don't necessarily actually being listened to by those in power\nI Do think the way that knowledge is sauce ... economics professor and she knows this change\nI Believe we're not diversified enough and I think you do not find economists some African countries ... they can\nAnd walk it back to the way we're trying to change the profession and I'm I really like to see that happen you look at published they pass you don't find many and money to support\nEconomic thing canine changes that go to developing countries as much as it does to think tanks and other places\nNeeded that's the case of ... developed wild so if we want to get that kind\nOf a sudden you weigh and new paradigms and you will thinking in that profession then we have to diversify the sources of knowledge\nShould we continue depending on the same old so see\nSo I think we should try to get more women Moffett conveyed and most people from low income countries that developing countries and tried to\nKill their thinking on how economics needs to approach issues of poverty and inequality\nWendy college degrees have important change can be driven by ensuring the economics includes a wider range of voices with different perspectives\nWe need ... much more diverse group of\nResearchers in economics and teaches and mental is more diversity will shift the balance of the topics that are chosen for research it will give us much more talent to make it very plain\nAnd I think there's every reason to think that the subject will become even more vibrant even more\nPromising as a way of taxing the really big problems that we face\n\nSince the financial crisis there's been a healthy soul searching in economics a growing number of people in organizations have been pointing out the obvious froze and developing alternative views to better understand and improve the way the economy's work\nHas this actually have an impact with matches country must so says there's some evidence that it's not just lip service that change really is taking place\nWe had the global successive somebody like to ... with his inequality critique\nWe've had you know tell some governments looking into different ways of measuring GDP we've had the big institutions that's probably the biggest change like the IMF and be able to see if they if you look at what they used to say before the crash and what they say now\nIt's it's very very different take the ending the date that recommendations or recipes for how to\nCreate more jobs in the economy and they and the Ninety say was all divides deregulating and it was back there in Texas and it was a bad set of making the labor market more flexible in a in a certain way and now we feed them now it's the talk about the importance of\nUnions and the importance of having a relatively high wages send it ... it really has changed and I do definitely think that's the consequences of the crisis end of the discussions that we've had in the last ten yes\nHaving worked with the obesity the organization for economic cooperation and development I can vouch for this progress which is also reflected in the IMF work on an equality\nAnd it's and the bank of England's welcome climate change\nI've seen firsthand how much economics has changed since two thousand image new perspectives different ways of teaching and far more of a move towards understanding how crushes come about\nThe good news is that there's been some progress the bad news is that this is not filtered through what he's done in the financial sector impacted on policy makers\nI Believe that the best way to make sure those in power over hold their ideas about economics is for us all to get involved\nThis is saying economics is too important to be left to the economists all more confident that economics is a master of our daily bread wrong and something belonging to men in suits we will be better able to smell Iraq when something\nGood to be true such as being offered a mortgage when we can't afford to pay its\nBut many people think of economics as very complex and the wrong the remote subject how can we come back and encourage people to get stuck in to improve our economic literacy\nJust like the statistics will politics picking up a basic knowledge of economics however we learn it means we can better understand the world around us and we'd be better informed and more able to speak out about the national decisions such as regarding migration and trade\nWhen do you call them as citizens across the whole range of jobs especially journalists need to take more interested in economics rather than leaving it to the experts\nA better understanding of how the economy works a better understanding of economic history and a better understanding of how different countries operate\nIs going to provide much rule the basis of understanding so that when something new chance up like the threat of trade was\nThen the kind of resonance the idea that somehow that they had been tried before that they hadn't had serious economic consequences in the Nineteen thirties that can have a residence with people with a broader public\n[noise]\nMy hope is a great economic literacy will make our government's more accountable for the economic decisions they take which impact on our lives\nImproving economics will only make a difference if those in power take notice of rule it's not as if nobody saw the two thousand crushed coming\nMany economists alone economist so the housing boom in the U.S was unsustainable\nThe politicians were not prepared to trick the bubble [noise]\nIn the u._k. economics professor was virtually unanimous in saying that bricks that would be bad for the British economy but that do not stop the majority of votes is supporting us [noise]\nMore recently President Trump has ignored a growing chorus of economists saying that the trade war would cause great harm to the U.S and the world economy [noise]\nIt's easy to be wise off the event but how did we lose enough to stop the next financial crisis joined me next week when the b._b._c. World Service for the last program of the series we will discuss what's next [noise]\n\nFrom the K U T public media studios you're listening to K. U. T. N. K. U. T. H. D. one often we are online at K. U. T. dot O. R. G.\nBut everybody's talking about Hamilton the same kind of an Austen into that at home in may so we're going to take me to mention him turned off on them should have tried\nTo Haiti Rwanda Hamilton some that's ten bucks and that will keep you connected to the world trade independent Cade the NPR and BBC journalist you trust and depend on set up a ten dollar amounts to sending membership and Katie will automatically charger credit or debit card just like other ... the charges you take care of that\nAnd your generous skipped the Hamilton among will continue as long as you're not getting ten dollars a month have spring everyone smart journalism and you can chat you become a sustaining member of Austin's NPR station safely and securely right now at ... dot org\nAll five one to four seven one six to nine wind and thanks\n[noise] [noise]\n[noise] hello and welcome to ... on the b._b._c. was service lowest pulled out and James ... [noise]\nStrong emotions in the Australian parliament prime minister sky marshal apologizes to victims of child sex abuse going back decades as a nation we found them [noise]\nAnd that was always very shy [noise]\nPlus we have from the migrant caravan crossing Mexico in hopes of getting the United states\nOr were these so called Islamic state on the verge of losing territory in Syria next for the country on the medicines captured in the fighting\nAnd the physical ... of I guess in this country does not mean the end of the ideology [noise]\nWhy Mikhail Gorbachev his back in the news with a warning phone arms control most of it is coming up to his own you say this but it seems like this will be [noise]\nMake McKenzie on that story from Australia that the prime minister has made a national apology to the victims of child sexual abuse\nA letter in the program we'll be hearing from one victim whose they're listening to the apology as well as ... minutes possibly uh hello this is news that with James Lawrenceville business on the way the ...\nOf the first we go to Mexico where caravan as it's being cold basically walking group of thousands of mostly Honduran migrants a continuing the march they hope to the United states they crossed into Mexico over the weekend and then walked for several hours before arriving in the Mexican city of Chula\nA multitude alone that way by mixing them police officers but they haven't been any attempts to stop the molten them back\nA meanwhile the American president Donald Trump has declared them unwelcome and said that they would be turned away if they go to Mexico's northern border with the U.S as the b._b._c. window correspondent on a debris allowed at all ... has been walking with the migrants spoke to ... not long ago and asked\nIf they were talking and thinking much about what happens to them once they get to that northern border\nThat among them I I mean some of them you know really paying a you know like they say you get a good job what they really want some of them are like you know where where\nAre we reading that and they have they have to go a\nGuideline that says that ... you're not the shaded that I've been on them like that and I think I Love as other men you know let them fight show without health problems\nI'm On a you know strong of helping each other and with you know some medical then so that that that\nThe field and they they know it\nAnd what what was the attitude of the Mexicans I'm ... pass by do they do they get support they get help they go\nYou know what I Know enough I look at social media that some\nSome facts does that make it I think you know like taking the stand up or the President Trump in the U.S saying you know they might be cream you know they might you know wind still come the Mexican food and some\nThailand but you know Mexican people have seen a underway today they live a happy they what what I mean they had them they were giving them food what hang on we're happy and we hope we made it through they you\nKnow they were told when they're that they won't be able to they wouldn't be able to get in to Mexico they did get into Mexico [noise]\nDo they have hopes that despite being told than not going to get across the U.S border something will turn up these are people traveling in hope ...\nThat's the case\nYou know they definitely they pay like now we made it that way you go to Mexico so that\nEverybody Leslie one may cats and now we are here so now we know we make it today they us so you know they have nothing and actually because you know they left the country because it's like\nYou know a lot of violence I let her father's knee so they say that is not harmed by now that the timing us and hopefully er I mean what they hope to get a better life that\nPrevious experience has shown is very difficult to get across the border do they do they know that they must have followed the news of the previous caravan which uh ended up not being able to get across a for the most part not being able to get across the border\nUm so how realistic or their expectations how well prepared law they for example how to push their appeal for asylum\nIn mind that you know the day\nOff that you know that it might not be possible like leaving that even when they pick up that they have\nFor example the president of the U.S has some just saying you know they're\nA ... a\nFine line Ali and you know that you need that\nAgain so that they know that they then they have nothing\nNothing to do is uh\nYou know they they are really angry with the government\nAnd that really well they have nothing you can see that happening like not as bad on the way the wind the change of clothes and that\nPeople with nothing to lose on the approach them on a ... Rojas the b._b._c. window correspond that she's a in southern Mexico has to kind of on mostly Hondurans um makes its way and it tends to make its way across Mexico up to the border with the U.S\nNow from a Soviet leader Mikhail Gorbachev is back in the headlines as big as he described his decision taken by President Trump is showing a lack of wisdom that reaction came off the American president announced plans to withdraw from a cold era Cold War era nuclear weapons tree the\nJoke was the one who signed the original document back in Nineteen eighty seven with President Ronald Reagan on Saturday Mr Trump said that the U.S would abandon the treaty that he believes Russia had been lied I sing it for many years\nWhat was all these issues to discuss in many more of us to Trump's national security adviser John Bolton arrived in Moscow on Sunday and he said to me last Russia's foreign minister Sergei Lavrov a in a few hours\nSo well no I haven't critters professor of international relations of the European University in St Petersburg and a leading expert on the U.S Russian relationship um\nOne which suggested that she's not a very easy time for Mr Bolton to visit Moscow\nOh yes I Am from a ... and most of them is the reason I Would say when we speak when we discuss this new\nOh you know you knew about the abbreviation the next three pit which will remember\nThat do simple there are three two to three two was how they could do was violated by by Russia or the\n... you know use the street in the United states too much uh the stalks of goals for years already been made them feel suggested to know to forget about\nThe three day when he wasn't it annoys Arabic and then you know I don't know who you're\nMost of the nation from Fifteen the single\nAnd there are some was accused of oil eaten there three to four at least like five for sale on the U.S and want to know what what's the difference between those stalks and the new suite we show kind I'm no I see that this is a\nProject struggled to domestic programs both Russia and the United states here practically right now that I'm yeah I I can\nDo that or did you wrote deterioration of Russian American relations or to start to well from the Russian cited ... going to the southern boils off to\nMe sir put you in a needed to you know to to to keep his power off though there'd be\nProtests against the looting collection and [noise] and from the United states a sigh they're already been deterioration\nTo start this from going to succeed in since the Broncos ... older than I can states\nYou know we we all for all these waves full full you know of criticism towards Russia Russian meddling in Russian uh what do you see patients somehow in American domestic politics but it's more about the American domestic ah\nPrograms so that made it kinda makes a contract than it smells Russian American relations in what ways all day or a phrase which will slave pretty Jordan ... of the Cold War era this is not the Cold War Russia is much weaker than the Soviet Union used to be\nRussia was all these and we are among them this cost is still a big way weaker and there's no food well most of the old challenger who is a world or something like this taster does some can be if storms virus\nYou very much indeed of encouraging will have to live as a preference lesser relations the European University in St Pete is\nBecoming of twenty minutes ... could monitor the headlines the Australian ... used to live as a National Public ... victims of institutional child sexual abuse the Brazilian far right presidential candidate juggle so NATO\nHas threatened to ban the policy was left wing rival if he wins the election and Mexican volunteers me giving food and medical attention to hundreds of Central American migrants who are marching towards the United states through Mexico ... Lucia\nHi Lawrence think he could moaning Hamilton we'll have to wait till it along the so his fifth well for me the one time go\nAfter he couldn't he finished his Mercedes that the u._s. ... in all states just one case ahead of his nearest rival Sebastian Pecker sorority\nAnd this means that Hamilton missed head to Mexico next weekend with some but still to do it was a very special day for ... and the other sorority who at thirty nine years of age secured his fence grand prix when after one hundred and Thirteen races\nTo stop and the second in his rental\nAnd simple intimate contact in ... county school to dramatic injury timeliness they beat rifles AC Milan one nail in it to the city yeah into remains said in the table six points a fetus event is\nAnd the tools for next month's women's Africa a couple of nations was made up to the ceremony in a crowd on Sunday night\nHas gone up all these algae ... ruin in group a Nigerian the defending champions who won eight of the ten minutes I saw a ... seats in ... the day will face South Africa Zambia and Kenya the championship will kick off on the seventeenth of an event\nThe songwriter presidential front runner in Brazil shy of both ... has threatened to ban the left wing workers' party if he defeats its candidates for not do that in next Sunday's election runoff\nThe b._b._c. Brazil corresponded says Mr ... rhetoric is causing deep concern in a country with recent memories of military dictatorship the Mexican president elect Andres Manuel Lopez\nOprah do as much the only source he's in southern Mexico to protect the thousands of Central American migrants making their way on foot towards the United states the migrants caravan has reached the city of Tampa to ... when ... Mexican volunteers have been giving them food water bugs\nSaudi Arabia has king's cell man and crown prince Mohammed offend the sun off the magic ... to offer that condoning says comes after the Saudis reverse that policy of denial to admit that Mr crush of gee was much ado inside that comes she lives in Istanbul three weeks ago\nActually has just hours to satisfy the European Commission that its budget times for next year or affordable and comply with yours and rules the commission rejected the budget forecast last week and sent today as a deadline for an ... vision\nAnd the Norwegian Resistance fighter your key ruined bag who sabotage Nazi Germany's nuclear program and the second World War has died at the age of Ninety nine daring right he commanded on a heavy ... was it most allies in the film heroes of ten o'clock\nBBC News\n[noise]\nMoney thanks for the Senate welcome to new cyber Lawrence and James on the white [noise] big problem the run up who watch these arms you may remember to comics gestures he won a medal in Rio then went into exile in the U.S well now he's going back to the CEO here we find out why\nElse our income on state TV saying presidential election results or palm Jew I and also we hear that literally they don't rule census hope for the Ugandan singer who's one of the major competition\nIn Denmark off twenty seven years that we've got spoiled as well as the shut level that coming up here on Newsday\nNow we stop in Zimbabwe it's a country in bucks on a national agricultural land or date or the old it is due to last until the end of November ... been run by these Zimbabwe land commission\nIt's kind of analyze land allocation ... says how farmers can be assisted to improve productivity an economic development or in the background of course the long running issue of land allocation land seizure\nAnd to the uh dreadfully slow I'm a a agricultural agricultural production\nIn what's usually referred to as the breadbasket of Africa like some guy said the University of Kent in the u._k. was advisor to form a ... I'm trying to write a and also the constitution writing team as well enjoy just not with his take on this\nUm how important is this actually practically deserve and it sounds like a doomsday but doesn't it the kind of knowing what you've actually got that\nDoes the government not know what it's called ... is this\nWhat was the government should know or the government to do one which I don't get it lent people um you don't remember the chaotic or lend reform program\nIt was one of them is to that was necessary to be done but unfortunately too many people are the top of government who are holding on to too much land they know each other I think what's important is to act and nice to meet with time at talking about who owns more than just to say\nYou know ... located in given to the most productive from a\nRight to the important to act I mean they would say that we're doing this before acting but you say they should just do something now and they can do it without the older so what should they do\n[noise] you don't want to shoot it and these are in twenty fiction because it's in Brooklyn commission we wrote it in the constitution and they just there for five years and they've done nothing about it\nWould think that they're trying to do something about it now but like I said I think it's important for them to be honest and they know each other right to the top of the food chain they know who he was holding onto our machine and they all have multiple phones and they got me to give them up\n[noise] um what about I mean the symbolism of this because\nAs far as international aid donors and so on a concerned\nThis is always be an issue a sort of us saw issues and Bob ... says it has the right to do what it was for the lands as being the problem of white farmers and so on I mean at what is the political usefulness of announcing this old it now for the government it's a bit of a signal abroad isn't it\nWonderful as the cheese I mean one of the things that you should understand that since November last year when the coup happened ... garbage nice to have been trying to whole international community has been trying to demonstrate that he's a former that he's someone who wants to open up to the world and to do the right things\nAnd they leave for each mission the election failed to do that because\nIt's in tend to be a fuss and then there's ... ... this process of trying to demonstrate to the world that ... getting ready to do for me to do better whether or not it's actually happened I think it's a question to be sitting there is\nBut from what you say older and older would do if it was a clear and transparent is that they would\nWould announce to the world that it's the elites that owns the productive land\nSo obsolete yeah I think this has come cause it's little known it's well known that to lend his own but what do you live and unfortunate what might happen that a little of this people they've created a corporate vehicle to relatives and family friends and he just\nDistribute the land among the people and they'll probably say that look we don't have\nA little boy in multiple indoor the ship and then there is out to be the same as what we have right now and are operate\nOn very briefly Alex who just in about thirty seconds I think we have a sort of you know outside journalists often gives the impression agriculture's a basket case it's a disaster how bad is the situation because there are also people who say it's doing a little bit better what do you think\nWe're I think that ... to Berkeley has done very well um I think you're going to put our knowledge is a catch ... that people have gone into because they need money and they're getting for and currency a loop but one of ... what is not a not a crook someone for example rank pushing graying\nAt like ... ... that's why I bring prices going up and of course they really are importing milk from South Africa in New Zealand and are there things that we shouldn't be touching things that are predicting a foreign currency that we should be doing in rolling on our own and we have done this before so\nMany many times in Beit ... ah my guys that Dr Alex ... of the University of Ken speaking to us about the land allocation owed it to the national agricultural I'm doing it which is going to be carried out at least in one area in Zimbabwe or from um this week\nIt's going to Cameron now state TV has come to that later today the presidential election results will be announced that South of the constitutional court threw out opposition party petitions demanding rerun the presidential poll on the grounds that it was marred by fraud and intimidation\nYankee five year old president ... is hoping to extend his ... year rule Randy Joe saw it in your day\nIt's a bit of a tense situation in many of the towns across the country\nAnd you know there's been a lot of anxiety and fear of the unknown given that the constitutional council was Brooklyn that we now of um they'll do about seven presidential election\nTroops have been deployed in the mid ... Jones Young's and streets in the big towns across the country ... law\nIs one of your own some front line activities um she's been in and out of jail many times for a ticket to the streets to protest and messages across I spoke to a pot why law on the line to dwell on on this is how she described how situation\nAbout three dozen police men in riot gear refer machine gun it have been outside my house they pop the pickup truck [laughter] my driveway so there is no way for anybody to leave the house with a car\nAnd they tell me they have received instructions for me not to leave the house so I Am one day and illegal how far a leak out because they have no why they have\nNo document they are not accusing me of any ... and they simply want to stop me from leaving the house\nThat's what I one of the opposition activists in Cameron and\nUh when you heard from a reporter Randy just saw\nIt was this morning comes as a migrant ... in Mexico and that's kind of one of our top stories from the newsroom in the headlines um the question of the migrants not really a kind of on the boat loads of migrants crossing the Mediterranean remains as a constant headache it's so constant\nIt's kind of ... ... even in the headlines anymore Italy believes the NGO should played no role in trying to save lives in central Mediterranean they use those rescue boats\nYou may remember was basically being the taxi service and for the people smugglers and encouraging migrants to make the dangerous journey across the Mediterranean\nIn order to facilitate this the Italian government has closed its ports to the non profit organizations or one of the operation by the Spanish and geo ... open arms decided to define the Italian government it's set sail for the central Mediterranean from Barcelona what happened next\nWell of course there are there was um [noise] at the time and a ... to a far lesser extent now there are members of discontent to from the various sections of the population some who feel that he capitalized on the opportunity to mix sport and a\nPolitics which is a no no in fact as maybe you might be aware of the international Olympic Committee itself threatened to sanction him if he were to continue with that because you are supposed to make any sort of political just drop the Olympics\nThere's also a significant section of the population who are supported the the administration of the time and a ... general opposed to a ... or them when I'm caught up protests off which he was a a firm supporter off but uh\nI ... at this moment of time are those who oppose him are far more muted because um if you tokens of all stripes are enjoying the\nFruits that were brought on the back of the sacrifices of the protesters will support you would not be returning to the country if he was not universally adored the way she uh\nUh yesterday's reception that made quite a bit of\nWonder what sort of impact it's had on him on place today so and his career\nIs the main impact it's had on his ... since that day he has never been able to run for the national so you've got to imagine as a [noise] when you're a professional athlete when you're a professional runner\nA short football are the main you you aspire to reach the world cup when you're a runner he was ... to reach either the world championships or the Olympics so from that point on he hired to realize that his training which no matter how good he would get he would never be able to compete\nAt the pinnacle of a he's a fence a\nOf a an authentic are excellent you would never be able to read to return to the Olympics for the world shopping besides that are you also lose the advantage of training at high altitude training and feel fear\nThat which you know many many athletes or even on that you can have the likes of ... came all the way to Ethiopia just to benefit from the high altitude training you lose this\nI was also for the first few months cut off from his family is very young family wife and kids and and he was reunited with his mother after two years ah yesterday\nHas that there is that I'm from ... to stand on the road there was some issue returned to face that they are the Olympic silver medalists of course in exile for a couple of years of his protest his return a real sign of how if you have to change\nNow to the Ugandan boom singer who's won a major TV talent contest in Denmark a ... some ah won the twenty Eighteen edition of the life as its cold she lived in demand for twenty seven years\nShe also a few years ago one what's called the integration award for her work as an African ... a music I'm as the voice of change in Denmark I like ... called her up and ask what does it feel like to be the judge's choice this time\nToday why to winning some\nOutbreak is the one that I Know about the best one of the puzzle government\nIsn't\nThe case case winning something had been done the\nMost interesting so you seem to look to governor music\nI Do that because that's\nI Am Ugandan and they asked them wide in English that and not expect if enough\nThen when I I I think ... if I read the the one to express myself as a musician and I'm Talking about me personally I we used to take ... to ... what I Want to express in this song because it comes out right and if there was right [noise]\nIf there was music I did write that not that many people\nThat have broken flew in Denmark so I think right now or the ... thing [noise]\nIt's like a very big big I mean it my job I mean I remember the prize that got in Denmark in two thousand and two words it would end integration price for my music they told me you will get saying this price integration price that they just\nWeren't shouldn't decide what you will cross in cultures your breathing on a type of style of music that was unfamiliar to them and you will help you would be to Grisham of those asked me a little book called to into the don't just real living [noise] yet I don't know there's such a good thing to simply talking prize\nIt and that was a good thing because my day to day my coach at the same time\nUsing it to my music has allowed me to build that bridge between the U.S they can and then you ... that two cultures as a Ugandan I feel that I have a lot to offer from my country and that was raised in ... so it's time to do some things that will bring\nTo coach it to get that which is the two coaches I Do that I Would rather do it in ... [noise]\n[noise]\nWould you do well just about the money or was it about the fact that you find them started breaking of little ... music scene\nHours than than they are making the mock\nI think money where the last thing I thought about that I wanted to read and make them in ... in the business industry Dave [laughter]\n\n[laughter]\n\nI really do I'm On my knowledge about music is kinda limited I'm a bit rubbish when it comes to that ... during the ... that I respect others\nAbout the money out of ... and joining just supposed to be a thousand dollars which she's one when she was explaining actually already about it's about [noise]\nWhat she's achieved for [noise]\n[laughter]\n\nWithout being challenged to sing along to latch which we don't want to do is we just don't have the skills that you can find it online as well as a form of the shows kind of very familiar she has to do have almost to the judge who's the judge is certainly loved that she has the\nAbout the size was it was finding out here she is taking us to the news [noise] [noise]\n\n\n[noise]\n[noise]\nThis is community supported public radio U. T. K. U. T. H. do you want to Austin [noise]\nWhen you show your support for us in the NPR station which led to sixty dollars or more will say things with one of our great news thank you get for just five dollars a mascot to clear plastic blank glasses which I Love those are those your favorite often radio station [noise]\nCheck out the K U T public radio narrative T shirt and new K. U. T. X. T shirts and the first ever Texas standards he\nHas also volume twelve of the cage he had lived long term shaky grain Jim yard ... Calexico and many more\nForget the studio one a concert flood neither are weighing bang bang\nFor your generous supportive as smart news you helped make possible tickets on tradition level in a nice thank you gets right now at K. U. T. dot org banks\n[noise]\nComing up on the outside with me Nikki ... accessible areas backstage at the BBC eighth and he had come\nCelebrating experimental an apple and God music we call in sick notices have naked instrument the amazing soprano ha that phrase that tells us what it's like to what were the young living can tell you that as opposed to singing the music of someone centuries dad\nYou're talking with us and you can you can discuss what they mean by such and knocking on the page what bias that musical gesture\n... she brunt of the London contemporary ... message that means the black Canadian planning his name is Benjamin ... piece inspired by the voice of cat campaign and the Israeli ... tells us how high up one support or adapt\nTo this day when I found it comes to coincide say within ten minutes they were Texan and give me advice that I should write things that I'm On a lot of that car things or have a two and pull them all coming up on the tap backstage [noise]\nInterfaces so ... ... and ... isn't able to come over from the states this form and sadly we have to do a slightly simplified model so ... it's the same sounds but that being triggered directly from a drum ... rather than the fruits themselves\nWell I mean you guys have taken on such incredible extraordinary things let's talk about some of your film lab 'cause I stopped so conducts hang your orchestra alone with today amazingly ... said ten is a little bit about all that well\nThat's a school by joining Greenwood and one of his I think it's just such collaboration with Thomas I'm In the dark so [noise]\nAnd our first the first told me what with Johnny Was on some Costa with\nSome of them seem often I filled out in Seventy and then as well as it was meant to be shown\nIt's pretty beautiful um and Joaquin Phoenix Amy Adams\nAnd we'd be playing Jonny Greenwood\nComes at work since uh very first season so you have two thousand and nights last concert up season featured an amazing string ... receiver [noise] um and I think that was one of these pieces that he wrote when transitioning into the composition of Korea long conversation where alongside his what is your head\nAnd pots of peace were used and there'll be blocked support themselves and how they thought this could be great saw the editing around that almost\nUm and then Johnny wrote to the rest of the original school so that would be about ... film that we perform live and so it was off the back of the week but when ... came out it'd be great to\nPerform it live not just a few years later but from the from the outset ... so the pump for themselves you know to the festival who conducted by robe and that was in fact the European premiere of the film so I knew the second time he's been formed in the in the world\nSay um tell me about the ... but ... is it about ten o'clock\nThat's right so that's next may at the south bank center in London and it's just a symphony by ... inspired by David Boies music and Brian is music so it it will be performed alongside could have got his first symphony and for something\nI mean what do you think it is about the length and contemporary oh is that the pools in such big crowds which what did he dominance captured the imagination of same many people\nI think it's to do with the energy of the musicians rarely on on the fascination on that interest in\nBeing pushed and challenged in terms of what we program and of course for audience as well who who seemed to like being challenged and they enjoy being presented with new music in more unusual contacts\nWe're very fortunate when working with a binder notes from a different musical space\n... style that that allowed you should named reaches ... different kinds of ... I'm a wider demographic and then hopefully we drove some of those audience members in for for listeners whatever to a new project so that they might not otherwise have come across\n\n\n\n\n[noise] [noise]\n[noise]\nNo [noise] [noise]\n[noise]\n[noise]\n\nOh [noise] [noise]\n\n\n[noise] no\nNo\nFlavor they pass by the French or we can have ... I'm ... and make it on and we'll be hearing more often seen from and the London contemporary old could stress may to in the press and you're listening\nTo the ... stage on the b._b._c. World Service with me Nikki Beatty where at St lukes church in central London listening to experimental music I had at the epidemic come said\nAnd as always if you have any opinions is that what you just have to join the conversation on social media and use the hash tag BBC\nTalent the peace they pass it features the sublime voice of soprano Juliet phrase that she's performing in other words today to\nSee the last time we met with with your vocal an symbol like Saudi and you're having a very busy yeah somewhat I said the filming you've got recordings out and stuff did you and make life though\nI have um I've just started a record label called ... dust\nWith two friends of mine um new ... strong he's a composer and mock can eat pizza pan is too I work with quite often and we've just released a first batch of five recordings in fact we just have to launch party two days ago and it still\nDoes he invites chi chi's I mean I get I Want to hit me until you publishing then only ... have other people in the labor notes a tool\nI mean the idea is to sort of get beyond ourselves so that um that really gets to to support the music community rather more\nBroadly interesting lay alone with contemporary original ... you'll well name to singing at any music I Love to that in handling so what else is to try some wide rather trials\nFor me in a sense huge [laughter]\nBecause we've always had voices that because we've always some\nAnd so you know music has been been around for I think for as long as we have at civil alongside language and yes you can say my ... is the older than you but in fact says older\nRepertoire than than I sing and of course has led to stuff in the mental that I that I also tend to I tend to the\nBig romantic stuff for example what's the big ... says oh well let's say peachy new volcano\nUm hold on nineteenth century\n[laughter] as I said what does that history on not dismissing at it but I Know you also by exactly\nSome of the music today seems to me to be quite difficult to the phones you see\nUm I suppose that you've been listening to Rebecca\nSoon does yeah he switches cold that's right because we weren't sure that zero\nAll as to say how to tell us into his nose is a is it difficult for them it's it's definitely not the hardest\nMusic that I have to perform\nI suppose actually sitting exactly in the hinterlands between speech and some [noise]\nI'm Sorry it's turning around these different ...\nThat did explode social crossover\nSo it sounds contacts I think but it's also very well I think it's quite emotionally talking backs 'cause you got the impression that there was somebody desperate to communicate something is it three speech is it through some sometimes it's there is such an odd combination of the two but it's clear that that's a message that his trying to to be communicated\nI'm an intense as the difficulty says to me as a performer this thing that separated left about working with Rebecca is that she's writing music criticized well tailored to my voice\nSo even is technically yes it's quite hot I I feel that it it fits me very well\nThe appeals on us working with a composer who is naive when young you have to be quite different from anything else you can you describe what does he talk to them\nIt well yeah that's the first thing that it makes me makes me think I have a dialogue\nWith them it's not just looking at um some nights ... music on a on a piece of paper that has already been through the filter of a publisher you're talking with the person you can you can discuss what they mean by such and knocking on the page will by such musical gesture\nAnd you can awesome what inspired them and get get all sorts of extra information ounce within the country with somebody that\nI'm I'm also ... you can form a relationship with them so that the the the process of working on a piece of music becomes cooperative and not so well that is frightening around a lot but for me it's it's really important and to me very special hallmark of a\nA true cooperation between the composer and the ... says it's something something very special in very personal info sound system\nWith alright presidential front runner in Brazil Australia ... has threatened to ban the left wing workers policy if he defeated candidates for not to have died in next Sunday's election runoff\nBBC Brazil correspondent since Mr both in his rhetoric is causing deep concern in the country was recent memories of ministry dictatorship the Mexican president elect ... ... in southern Mexico\nTo protect the thousands of Central American migrants walking towards the United states the migrants caravan has reached the city of ... when Mexican volunteers have been giving them food water and clams\nSaudi Arabia says king Solomon and crown prince Mohammed has phoned the son of a mutt agenda ... G to offer condolences\nIt comes out to the Saudis reverse that policy of denial admitted Mr ... was mud inside the consulate in Istanbul\nEqually has just hours to satisfy the European Commission but its budget plans for next year on affordable comply with the euro zone rules the commission rejected the budget for costs last week\nAnd said today is a deadline for an edgy revision his populist government one politics yeah promises to increase spending on your retirement\nAnd the region resistance hero your game Rona back several jobs the Nazi nuclear program and the second World War has died at the age of Ninety nine BBC News\nAnd back to the U.S have backstage and the people she will say this I'm Nicky baby and we're behind the scenes in a converted church in central London for the BBC open air come sit they is music for the cutting edge\nAnd wait until ... to the London contemporary orchestra just peculiar insects techno Jew a native instrument\nAnd a genius ... soprano Juliet phrase that Israeli composed ... has written a piece that the L see as a ... a performing its cold drowned in see we speak to her in a moment\n[noise]\nMm\n\nMm\nA little ... of ... drowned in sea to formed by the lumped in contemporary orchestra\nNOAA has some serious credentials she's just finished as doctoral composed and residents\nAt the royal perhaps even dumped it she's ... she's also worked with great fly ball catch me to manage but more importantly fell off she's here at at essay said nukes\nNow can you explain the title of his piece drowned in sea\nYes and so this piece was commission and two thousand Fifteen by the ... festival called minimalist then unwrap and it was for concept as celebrating ... and in sea is one of the greatest works in contemporary music especially in American I'm an ...\nIt's a terribly redefined structured and proposition and it's a piece that is extremely joyful to to play and so all of the ... commission on that evening while response to the peace\nAnd I'm I'm a control freak so the idea of writing an open so called peace was a little terrifying and I try to think to myself what can I potentially due to kind of take the piece\nAs far as I can from in sea and because it's such a you know one of the most ... most famous works in contemporary music so I took some extra cash and like I started playing with it um I stretch them in a very kind of basic way and I kind of\nListen to it and I thought it sounds really nice I got these really lovely confident Costas and I thought maybe I can sort of re imagine\nThis process of course the cliff and then the title was just a bad joke um because one of the permanent thing is to sustain the so I I did leave that in the piece so we've got to the running throughout and I've just sort of\nImagine to process where I kind of ... that I tried but\nYou will crave 'em up the phone is especially dump second date yes recently it was more recently it was a ... but yeah she should we talk about the dump fast than them what it is about that ... that you would say well with it wasn't a\nConscious decision I really liked Don Front I was little I went to ballet but I was really bad at it and and artistic gymnastic I don't know how you call it in the u._k. but you know and that's the thing you see a need more than a limited it actually I was really bad at it as well\nI mean it's sort of happened naturally that I met someone and I had a good connection with and the ... and we've done some walks and then she introduced me to our friends and you\nWill feel exactly I'm from down there and what about the president\nWould deal I think it happened in a similar way I mean I didn't know much about a ... from that and also looks background and his route so I I I didn't listen much prefer most of my life until I actually go to London and someone recommended me for a small project\nAnd that involved sort of an ... treatment or story I didn't know what it meant to the time but I was very attracted to\nThe idea of manifesting Carter's through sound it opened up a lot of interesting possibilities and I started doing that and then three years ago I did I'm a composer and residents which I've just ended with their own up her house and I did um and opera called ... which was ... months ago at\nThe heart and soul generated isn't it [laughter] all your family still viable stalks does he need\nTo stop some of my brothers and sisters are and some of them um who presumably the ones who remain orthodox wouldn't come and see what of escape and a lot of people that are far more to the doctor and my family kind of thing yeah which was lovely I mean it was such a mixed crowd at performances which has in fact you know\nSo I you grew up just outside Tel Aviv and you know live and work in London and you can you walk that you've created while serving in London back to Israel in any shape or form\nFunnily enough the space was tied in Israel not a long time ago by Israeli contempt protests and that you learned about cause and then I've done some some things that over the last few years but not not most of I mean not the dump space is not the ... pieces but more ...\nAnd I I mean some people see experimental music as a little bit threatening and it'll be in trouble just a very phrase album called or experimental a scary yeah\nHow would you open people's minds ... is she was going on in this world\nI I really know the feeling because I grew up in a family that had nothing to do it so obviously experiment for music but I mean the way we listen to classical music but it wasn't something that we listen to a lot at home it was mostly like\nIsraeli music and orthodox music and to this day one of my family comes to coincide say within ten minutes they were ... though with [laughter] you know\nAnd still they give me advice that I should write things that are more melodic or things are has have a two and so I always kind of have this feeling that I Want my music to speak to my family or or anyone and I I I kind of want to be as honest or as direct as I can\nMm\nWow Mm\n... Mm\n\n\n\n\n\nThat was drowned in see by the Israeli composed ... you are listening to the south backstage with me Nikki Beatty ad where here again at\nAl essay said looks at the house of London taking the pulse of the apple on God's music scene here\n[noise] [noise] what we get the privilege of experiencing it these days ... said he's giving a new piece of music that NASA being HUD anywhere in the world before previous people premieres\nI'm with compose at least ... India whose what we've grown a is big premieres tonight with soprano chew that phrase is singing Lisa you'll\nWallace sound that old which it sounds like a very angry animals which is surprising since they're searching for well well I I I don't know how he wouldn't do that but in like an angry fair like rules okay that was\nReally angry at that time I ever had in mind you as an anger that\nNever mind say steaming you always so careless waves at an easy backgrounds and publicity you'll and a chef I come from a um a lot back yeah yeah so how do you have to view lumped up coming together and creating pieces like way hammering at the NATO come says oh All right so one night we were in a\nBar in Berlin my friends and they were going to put on the night of DJ's and um we got invited to play and we we met together to decide what we were going to do and we had all these different ideas but then we decided to put sports without practices together and I was doing like that I'm using found animal sounds\nAnd staying there was doing voice sounds and um yeah so we we we initially were like um field recordings and voice but then more and more with ... been doing field recordings\nSo she's the piece that we will here tonight to all the pieces are improvised on how much is actually lay down and you know totally hostage they exactly as it can post nothing is like\nThat it's all quite open but we have\nStructures that we are frame so we worked within and see if we didn't ... we have like certain materials that we put in to them every time but the way we do that or the order of things can change so it's quite open forming away\nSo are you using your voice throughout yes yes I Am but then all the rules have some Polson loop severe voice to use and we liked\nThis confusion so we use pre recorded voice and my voice or me imitating sounds set Felicity use and also mixed with with the original sound\nFrom animals and also protest sounds of animals and so it's all kind of a blur\nAnd researching for this I think he's soundscape or or sound quality that you can't really tell what is the source of sounds\nBut that could be really chaotic couldn't it yes it is also sometimes\nIt's sort of in between organic and machine and it's really interesting I think that the audience ... than in a forest or they're in like I'm In a context where it's like like ... music so there's a lot of blows and allows you to kind of have these illusions and it's open for you know your imagination to kind of shift you\nToo for the ... what do you want them to feel experienced take away with them what sealed dream audience ...\n... um well I guess this is where I had to say not displacement that these sort of like to transport them in a way I mean it's hard to talk about this without using um TV\nWords that she was ... I don't know they sort of like this magic that happens between days like the organic or in the machine and and it's sort of ... when you listen to it you can never understand really where it's coming from what the person is it's sort of just um\nYeah just sort of an essence of all these different things that hopefully create something years he's that anything\nSpecific play a cute name new region in terms of your staff take what you bring to this project to nature instrument\nI guess I Would say so same so um maybe\nGenerally just be you know region\nBut it's a very a concrete example is the sound of the song called\nThe ... to ... ... it's a title or where the main base is from a Norwegian bumble bee from uh the mountains\n\n[noise]\n\n[laughter]\n\n\n\n\n\n\n\n\nNature instrument that ... says backstage at at let's say sending nukes Walsh a privilege to be able to talk to such innovative disrupt his young living composes what did you think whose music would you like to hear again here's what some of the audience here in London think\nI did enjoy my critics from the ... the initial vote for us I mean what do you live in New York was the only way you view I Would I Would ever to\nWhere all the you know really close to ... to blend of instruments in the first place with a lot of concern real pressure\nOn him was very interesting ... make choose I really enjoy the social thing I'm really really nice sound well she creates a mix of electronics are those are the lock the former foreign to\nJoin the conversation like emailing the talent at BBC the u._k. or if you're using social media\nHash tag ... to see us out or if you're on social media use hashtags BBC ...\nThank you for your is on the south backstage our thanks also to add a face and looks at a college ... three Nikki parents\nThe show and you can join me Nikki faith the Wendy off how long do you think John is that South Africa next week to you that [noise] [noise]\nThis is K. U. T. K. U. T. H. do you want to Austin who you're you're central Texas from for NPR and the BBC I'm Jerry ... thanks for being\nHere\nIn the news and the music you find on ... when you pledge seven hundred and fifty dollars and become a business member of those pay you ten K. U. T. X. here\nBusiness name contact information and website link will be put in a special section on both our website your business will be recognized on air on both station throughout the membership drives for a full week after you love forget one of our great thank you get your seven hundred and fifty dollar contribution identify you as a\nGeneral supporter of Austen's NPR station and the Austin music experience kinda K. U. T. N. K. U. T. X. business number right now and have heat out or ... or more call side one to four seven one six to nine one thanks\n[noise] [noise]\n[noise] hello and welcome to the news today from the b._b._c. World Service learns I'm James ... [noise]\nEverybody strong emotions in the Australian parliament says prime minister ... apologizes to victims of child sex abuse going back decades\nAs a nation we found them [noise] we used to sleep and that was always very shy\nSo we talk about the thousands of migrants walking income voice of America I Hope\nLike made it in to Mexico we speak to our correspondent was the political route of the issue grows the U. S. Y. Mikhail Gorbachev to back in the news with a warning on arms control on the head of the midterm elections we go to Tennessee where African American throws you say they can tip the scales and send a Democrat to Washington\nBlue spirit as working and I'm just happy\nTo see this energy and now we've got to ...\nPercent of life is well you\nAnd I went to kind of stop when this this apology is where it's at the moment it got to stop doing something to protect our children\nAnd I believe when something is happening it's to scout whole swimming hole you know I Believe that's all we're asking you know an assigned flavors or help the victims given this sad story\nRay Leary who was the amongst friends listening to the apology from the Australian prime minister ... ... as he said in a conversation too late for quite a lot of his friends [noise]\nHe's de ... says twelve minutes policy how\nThousands upon Geron migrants who've been traveling you know ... none of the caravan haven't managed to cross the border into Mexico\nA and a period of time and to continue that ... the U.S President Trump has made it very clear and welcome but that doesn't attend them they say they have left in order to escape the public's heat and violence well that one country\nAn oath American correspondent Ali ... is with them and the Mexican town of ...\nIt has been an extraordinary side of the last few out hundreds of those migrants from under us have been tracking for the last eight to nine days now have been pouring into the square and the Mexican town a couple of Chula how are you a hundred and very good spurs indeed I can see\nHundreds of them laid out for the most part to sleep for them I Love them just on a you know called Bhutto or on back home in one corner there's actually a music going on this dancing going on and I'm singing and cheering they are in good spirits not just because\nThey have just ... pounds a major obstacle on that track which is the Mexican border they did remain show but the people who were in the square tonight including the women and children and they came across on raft across\nThe river that runs along the border between Guatemala and Mexico remember these people who come from eastern under as they try to cross country then of course was a model\nAnd go pass this major obstacle that\nBut the other reason they've been given something of a boost than I can see it going on right now is the people from\nThis town Mexicans have come out to give a these migrants mood to give them food we sold them getting medical treatment to leave in the day by volunteer medics and I can see somebody with a bag of clothes hanging up clothes and that has been going on for the last few hours\nHave because the ... the reaction of people just being very different to the reaction of the Mexican authorities\nWill in a sense the author of the sun has certainly kept the the boot a game show but what we saw today and I moved to the migrants for most of the day is yes there was a huge security presence of Mexican security presence and a one point we saw them\nForm a line of riot police in wind in the middle of the route that these migrants with thinking\nAnd then suddenly they were they were cool to go back to stand down and go back to their buses and allow these people through the end it was the police\nWho are handing out so now they have encouraged most of these migrants to seek asylum here in Mexico but these people know have that they've come this fall on that final goal really is to get the United states\nBe applying for asylum here in Mexico could mean detention for up to forty five days so they're resisting that they want to continue on for them to achieve that the dream which is to get to the United states things\nPresident Trump has been extremely clear on a number of occasions but he's not prepared to let them get into the u._s. um what all their posts about\nWell they all legally entitled if\nThey get to the American border to present themselves\nTo officials to claim asylum Donald from as you say that's a pretty adamant reason the border will remain shot they feel people hear those uh in one sense that they they have little choice you know they talk about the conditions back home they talk about the future of their children they talk about working\nKnown stole a and yet not getting any money for that back home and they don't feel that that is any life a tool for them and their families\nAnd the ... reporting from ... on the Mexican Buddhist two thousand miles away from America sixty minutes past the Amish outlawed as he spoke\nNeeds Hamilton has struck duff having keeps them in the one titled celebrations put on hold saying he doesn't win when he when he came in ... as long as it comes in the end he wouldn't ... ... ... ... ... ... people my age\nThat Hamilton fell just short finishing fat and his parents with mental fools how Tamil now have to wait until next weekend's race in Mexico to try and catch the title also cannot tenth street when they if they can be left the city at time he would put the gun is she points of the top of the Premier League\nHas gone I can really find team that preparation for the women's Africa ... nations now after the crew was made in a crowd last night I couldn't see ceremony gone to tune in group ate a ... in Algeria and mommy hold is Nigeria are include the with South Africa Zambia and Kenya it'll stop from seventeenth November\nAnd a season ending women's Seventy eight to repaint continues in Singapore in tennis the focus is on the right group today actually ... and ... let's face it sense Steven\n... who may or may not be privately fuming to read out all the schools in Toronto\nYes a lot of winning streak is obviously the set up to a very good punch line is Seventy ... business now Italy has a few hours to explain to the EU leaders in Brussels\nHow exactly it's spending plans are going to comply with European rules of the original plan put forward was considered unaffordable and now the European Commission has demanded to see a new budget by mid day\nOr else uh they've why doesn't Russell's like Italy spending plans\nA couple of reasons the number one reason is equally wants to spend money it doesn't have the second reason is that would break\nThe rules in the euro zone about how much debt you're allowed to have so you might remember earlier in the year is only had an election a couple of new party formed a coalition and both parties made a lot of spending promises\nTo get elected now they're in pal and trying to honor those promises but to pay for all that they have to raise the amount of money the government but rice and compared to the previous plan that the previous government had the government barring a that amount is a lot bigger and that's why process isn't very impressed\nAnd the problem is how enormous the national debt already is uniquely break some rules does it\nYes and he said no country should have debt that with more than sixty percent of its GDP our annual national income unfortunately Italy has more than twice that amount if that has a debt to GDP ratio of a hundred and ... percent or two point six trillion dollars\nNow the Italian government says it will increase gross that means uh when it comes to borrowing this money because the state he pay increase the ratio to get the crepe because they'll have more money but but the problem is there is an Oscar I initially I had from ... economic spectra ... Luis at University in Bryan\nGrowth has been slow and that has been lower in the last I Would say Fifteen to Twenty years these government to claim said that that these new budget the that the uh contains a lot of additional spending will be financed by our young girls\nAnd does he sticks to them now likely in fact the bank of equally says the main thing that the uh the growing age that that was already ... is so or as slowing down even farther\nAnd on top of that the economic a ward of the ... the no positive and this means that the the outlook for the economy is negative so\nI Would say that he's likely to the deficit that will be the larger or if the government them on the and the promises has made\nWhat do you expect will happen today than at midday who's got it back down here um oh Brussels\nI think nobody's going to a ... down I think the government we love a stick or would we did a budget so we didn't plan and we try to find a clash with the European institution\nIs a populist government to that uh is high and get the next to European elections in the spring\nAnd there is a finding domestic popular support the by showing that they can the fight against the European institutions the institutions we'd probably a sponsor that but I think we would love to see us enough\nTo make a lot for a ... well let me see what happens in about three hours time they've known as many facts [noise]\n\nFormer Soviet leader Mikhail Gorbachev is back in the headlines describing a decision taken by President Trump has showing how the wisdom that voted came off the American president announced plans to withdraw from a Cold War era nuclear weapons treaty\nMystical shelf was the one who signed the original documents back in Nineteen eighty seven with President Reagan and one person who have certainly read the critique is Mr Trump's national security adviser John Bolton who arrived in Moscow on Sunday\nHe's facing the party's candidate in the runoff inaction\nMexican volunteers have been giving food and medical attention to hundreds of Central American migrants who were marching towards the United states the president elect's Andres Manuel Lopez Obrador idea as deals arches in southern Mexico to protect the migrants\nSaudi officials say the country's really does have spoken to the sun the mud and Janis ... adults with him that condoning says his death Assad is the knowledge the matter is edited being a rogue operation\nState media in China has noticed Etheridge this attack on the U.S secretary of state Mike Pompeo he accused Beijing of predatory economic activity cool the remarks wild disrespectful and basements\nControversy for storm is approaching the Pacific coast of Mexico and and they're not just be an issue for ... to the western seaboard however can win a is expected to bring that torrential rain and massive storm and such is a group of resent organizations is warns\nThat the world is losing the war on drugs it said the dream of a drunk free well should be replaced by a more realistic approach BBC News\n[noise]\nAnd how they got parents la la yet [noise]\nYour your for your says Matthew how sorry I didn't know if you were able to to rally [noise] are you the truth or the I'm just trying to get a better idea\nOf how this works how much it costs the liver\nCoast from [noise] all kinds of them\nLive a little trouble straws cirrhosis\nOf the liver cirrhosis beer beer out there you go on for\nDear the weird thing here you need to know to come here to share your workers here and then maybe you'll rate on the line to get the right [noise] I don't know\nIf you've got thirty [noise]\nIt's possible to look online and find Chinese hospitals\n... decorations to foreigners this is one of the first ones all right\nIt's official was rather cagey about how long it might take but finding the cost was more straightforward [noise]\nDa da da da da da da da da da da da da\nDa da\nDa da da da da da da da da Silva is in our last program we heard about growing concern that opens being harvested from prisoners of conscience including filing going\nAnd week is in the second part of our investigation into China's open transport system I'm looking at China's claims to have reformed how they move from reliance on executed prisoners to voluntary donation well ditch to try and mature liver was to look at a website and make a cool\nBut for others particularly from China's neighbors the tourist trade in Oregon's\nSeems well the organizers [noise]\nShe's the Korean Chinese nurse who was in charge of the pre surgery process [noise]\nYou don't have a two thousand and Seventeen and here we go South Korea's TV chose some visited the facility and China which office Trump stones to Koreans [noise]\nThis aged Korean recipient we took the transplant days ago you'll having a hard time recovering [noise]\nShe traveled a long wait for her age ... [noise]\nWhat was your given hunting [noise] an undercover reporter couches a patient on video recovering from a liver transplant he speaks with medics who say the Chinese authorities turned a blind eye to the clinic's activities\n... hotel where patients from Korea and the middle east stay while awaiting Trump's bones we did\nWas I was in the ... when then\nWon't open recipient tells the undercover reporter we didn't even register notes on the waiting list if you have the money you're likely to leave the nest tells the patients we did won't pancreas three kidneys unfold livers yesterday\n\nThe Koreans with that on tourist visas and just three months\nIf they're really getting over ... during the three month window than something very suspicious is going on with something like ... patients in other countries can be ... years [noise]\nSo how is it in China you can get one much more quickly it really begs the question where all the ... coming from [noise]\nPhone from patients society meeting in Spain a gathering of trauma surgeons who around the world\nAnd usefully for us the heads of China's organ donation and transport system was that it's now twenty Eighteen\nThree years since China claims to have stopped altogether the use of open from executed prisoners however the controversy has not gone away the activities of one Chinese live is a ... speaking at this conference in a straight the issue well\nI Would play you a bit of his talk we were told by the transplantation society not through coated\nIn contrast we were free to record this power though session\n[noise]\nIn which the speaker lays out the Chinese opened donation system and invite the audience to visit China we did try to take him up on that offer but for reasons that may become obese later on this program or interests as yet to be taken for them before we get that the cost control proceed with this ... [noise]\n... is the local leader of noble station set up to persecute Falun Gong follows but it's his work as published in the scientific journal the international which has been the issue\nThat is paper reported on the outcomes of five hundred and sixty full liver transplantation taken from what are called D. C. D. diagnoses that dinosaurs died after ... criteria\nDishes Wendy Rogers professor of clinical ethics at the core a University in Sydney, Australia\nAnd I had done this research in between twenty ten and twenty four to eight and they claimed that all of these donors with on a train a pilot program for ... twenty ten but ... ... ... thousand dodge joined the whole of China from twenty to twenty four team\nSo for them to have five hundred and sixty four live as from that program that would have meant that go to ... of all of them to donations across China during that period except that the fed the twist because ... said\nOf patients that dying not way can actually ... that live as because they live as get damaged during the process of dying when the ... law and there's not much ... she's in getting to the ...\nSo I felt all of the ... five hundred and sixty four live as reported in the paper to come from volunteer diners would have required that just about every single one of the violence she died nations across China during that period had gone to the ... office\nAnd we said that we didn't have direct proof but it was just so unreasonable that they could ... five hundred and sixty fold if it's from volunteers during that period when there was any a pilot program that we asked the editor to take action\nIn the paper they say the older the older ones were voluntary donated\nThey do say that and ah it's my contention that actually that's a false claim\nAnd how did she using respond to criticism\nIs actually a very short email ... his claim they declared that all the ... from diagnosed after cardiac death no ... from executed prisoners\nAnd then they said that old transplant and so rich that China liver transplant made just straight as if this was proof that they were somehow ethically per kid\nThat registries no shape and two independent republic ... so we couldn't tell whether the information that would actually verify that claim\nAnd also that register ... thousand and five at a time when all the organs by the Chinese on that mission was so strong prison is so it didn't seem it very useful piece of evidence to say that the Trump sponsor right just said\nAnd then we um enlisted the services of a Chinese speaking reset show that actually looks into the hospital documents from ... province department of health to find out when the pilot program started that\nAnd they document showed that the pilot program didn't stop in ... hospital until late ... eleven so his research program run for Eighteen months\nBefore that was even a pilot program at his hospital and in fact he's hospitals only approved to use hops not live as so we really felt that he had provided any proof a soul\nAnd then he and his colleagues suggests that claim that they would have needed three times as many done is to get the same number of live as because of that problem with that live as not being very viable after ... death\nBut go no response how has a pulse president Jeremy Chapman did agree to be interviewed\nHe was not allowed into Chinese ministry hospitals where much of the charts on trade goes on\nBut he was given access to some other Trump ... census and well dismissive of the things that continued organ harvesting for prisoners religious groups and minorities that we discussed in the last program\nHe's concerned the lack of openness about current practice in China he told me the reasons for his unannounced visit to\nVisit hospitals set out doing transplantation to understand how they operate to\nSee the environment which patients are careful\nTo understand the origin hall and to encourage the use of deceased open donations from intensive care in China and that's been a principal driving interaction for the last eight to nine years\nSince about two thousand and ten when they started a trial here and they use so the CD\nBut I mean you have as a society gun on record as saying that you know those visits you soon but in any kind of Rome during in the sense that\nI have no say inhabitants of the use of executed prisoners Hogan since two thousand fourteen but you have to for the\nLegal and permitted in China\nTo undertake\nTransplantation from executing people [noise]\nI don't know the origin of the whole ... of the patients that I have no idea but you do often to the whole thing off the two thousand and fourteen December two thousand four team that was an announcement\nHalf I'm vice minister fine\nExecuted people's opens with no longer be permissible has held the first of January two thousand and fifty\nAnd I have seen no evidence to the country some have you seen\nPaperwork to see who view during this we're off the two thousand and\nThere is a variety of data\n... interactions which tell you how most of the opens a transplanted\nSo I have been to meetings where there are large numbers of intensive care specialists talking about the origin and the management of patients who have died from head injury and intensive case\nDo I believe that they have largely or completely ... to have these slogans from ah intensive care unit sensitively why why because the volumes\nAnd the change in hospitals that are undertaking transplantation give you had prior to this one uses of of Oakland\nHas a free hospitals so the use of executed prisoners opens I have no way of checking [noise]\nSo you think they should be greater transparency and tried to check up on the independent it's very clear the world's helping us action guidelines states transparency for privacy\nWe don't need to know the individuals who transplanted but we do need to have transparency with respect to the arch in there and have we got that with China [noise]\nI think there are still opportunities for profit transparency [noise]\nBut in terms of other evidence of people being offered who wins the show notice the ... you know come up with a couple of weeks or a hundred thousand two hundred thousand dollars three to be a little Charles\nWrong money speaks loudly doesn't it unfortunate that\nWe have to be very clear about the use of commercialism being banned\nHad wonderful stories which I Believe of a million dollars for priority on the way to miss his outrage because it's outrageous but that doesn't change the origin of buildings that doesn't suggest that this somebody waiting to be killed for organs which is the proposal\nHave you seen that documentary whether I mean she was undercover and that seems to be on the face of it it's a two two or three a hotel Colorado's with Korea and patients in China how\nAm I ... going to China yes anti when these patients being\nTransplanted in the mainland\nAnd patients from Singapore and Malaysia\nMy aware of patients going from Japan to China absolutely yes\nYou're aware hold the I'm a happy with it or do I think it's appropriate neither do I think it meets the legal rules\nOf the Chinese government not\nShould they enforce that an ... yes\nI have no doubt that fit genuine reform in over in front of the nation in the nation is thinking face and trying to lose ...\nJacob live ie the Charles strong such a new managed to get Israel to outlaw Trump's bump tours and\nI'm sure that many centers and sign up to perform and I started to use donors as his moment in the west namely of those were quickly branded following the request of the family is the problem is\nWhat we think that these type of medical center part of the northeast so effective legitimate opens the nation's first with the action takes place in China doesn't mean that the entire system has reform as he said\nChina then has both supporters and critics you know I see it on this issue of transparency with goals for greater openness\nAnd that can be so they shouldn't isn't helping the Chinese position the allegations of abuse including taking opens for prisoners of conscience continue the evidence sites it often does go back to the period before two thousand Fifteen when China claims to have stopped using opens for prisoners\nBut the lack of current independent the verifiable data and the continued presence so the quasar legal Trump slum tourism industry people's suspicion until there is greater transparency pressure will grow on other countries to follow Israel's lead and make it illegal for their patients to travel\nTo China for Trump's bumps ... allows you to get a closer look [noise]\nThrilled bodies exhibition at the un ISI batch is a celebration of humanity but he's one of these people mainly young men from China would they want to be used in this way and is it possible they were executed prisoners\nThe control of see what go way here in Britain and all the ... of trust in aged preserved for days has raised questions over the origins it's suspected the board is used in the exhibition originated in an area of China west security services rent a trade in executed prisoners\nAnd plus the nation technique was being used to turn them into medical specimens as far back as two thousand and four\nCorner to doing it crashed and sent you look to see if there's any evidence of ...\nThat suggests that death was under suspicious circumstances such a shooting\nA nephew hit all this is being discovery from the BBC will service produce it was Judy unsuitable\nThese policies which are in Birmingham where the cause of death is not like where the reasonable grounds to consider that they died under suspicious circumstances\n[noise]\nThis is community supported public radio KU T. K. U. T. H. do you want to Austin [noise]\nWhen you show your support for asking NPR station with a plan to sixty dollars or more well same thing with one of our great thank you get five dollars and I get to clear plastic science classes which I Love those are your favorite often radio station [noise]\nCheck out the cage he public radio on marriage T shirts and new K. U. T. X. T shirts and the first ever standard tea\nAlso ... trial the decay you can't live but sounds from shaky grain urges Calexico andme anymore\nForget the studio contracts last me there are only sang bang for your generous deporting smart news you I'll make possible take advantage of Asian level and a nice thank you get right now\nK. U. T. dot org thanks\nComing up after the news on the BBC well service it's hard to quit me Stephen ... walk gives each of us our sense of who we are not the most personal level we all have our own family background in general sense we all all of us part of the human species\nBut it's the stuff in between that puts us in groups or tribes and often motivates our behavior gender religion ethnicity nationality things all the system's fault lines that seemed to separate\nUs from then on my guest today is Kwame Anthony Appiah an academic on public intellectual\nDon't close yourself off people who live with people of diverse identity tend to be less than people who does so don't allow yourself to be channeled off into a world in which you only are among white people literally among Catholics only among a straight people and so on\nThat's Kwame Anthony Appiah all talk after the news and I'm Mary emotionally\nThen yeah I think that's right ah I think you know you don't believe in in race I think mentioned distinguish between\nWhether what people believe about the species and its subdivisions\nA and I think most of that polls I think most of what people believe about how you should divide how you can divide people off in terms of the ... they have in the colors and the and the hair and so on and the skills and and the genetics I think most of most of that is it's sort of wildly off\nSo no use for racial distinctions and differentiate ... can be made\nNo I don't think so not the biological weapons is genetically rule such a mishmash mishmash and\nThe ... and and we are human beings have now is it this way and I think many people think that is they think that as it were and fourteen Ninety two when Columbus set off there were these four or five major population soon as the East Asian South Asian\nEuropean African them uh uh um or Indian\nPopulation and then they had been there for very long time not mixing with anyone until the quote unquote pure and then they were sort of pure and ... and the mound that off from one another and then uh with the ...\nThe sort of age of exploration and so on suddenly all these things and mix them that's just not what happened I'm always being as as a biologist I put it gene flow genes and people and the genes have been traveling\nAll the time and we none of this because we know that Alexander the great took thirty thousand people you know across great sway the values that we have the gang has gone to people girls crates ways of the wealth and so on but that turns out to have happened to many more times than\nWe read and I understand that but I guess in that in in that sense he is where it's difficult for me to see how the the the well researched a public intellectual that his you connect swim the ordinary let's say black person living in southern Mississippi\nWhose life experience tells him there is such a thing as race and he is a victim of racist attitudes and systemically racist society on one meeting does your message that race is a false construct for him or her\nWell I don't think I I I wouldn't stop with that with that in that situation though if they wanted to talk to be more I Would point out that there the the way that treated that because of the way they looked\nDoesn't predict how they would be presented in lots of other parts of the world so that way you are in a particular place in a race can have a very specific meeting which is why I Would say there aren't any races but there are racial identities\nAnd those racial identities are shaped by the way people think not everywhere but in particular places so in Mississippi right now uh the distinction between black and white people is extremely clear and the ... remains the case\nThat this significant differential treatment by the by the government by other people and so on are in that place\nThough there are going to be people even in Mississippi or how to place or they're going to be people who have say one African ancestor or four generations that go with the rest of the European\nWho might be felt by some people to belong in the back side in Mississippi and by others to be on the white side says the boundaries aren't going to be clear even in the place I mean the city but the consequences of being on one side or another those are as clear as as as anything\nAnd that's why you can't draw a from a from the fact that there aren't any race and you can't draw from that the conclusion that racial identity as a matter they matter enormously\nBut insisting that they are real I'm pointing out that that created by these forms of behavior by these beliefs many which falls that's why the what's called the lies that but what what's crazy\nIs the same approach to religion or creed as as you called it on presumably to sort of gender\nPolitics good again under class policy so in essence what you're saying if I may say some other means disarm rubles a fairly simple in the way you are you saying that\nYou know people in power which particularly in the nineteenth century which is a very important century for all of us were white men basically constructed a whole series of different framework sin which\nCould explain ... their own power yes\nI mean I didn't think they were cleared that that's what they were doing\nOr if they'd been clear about what they were doing it wouldn't have been so easy to do is much easier to do these things well not accepting that that's what you're doing but I Do think we're living with a legacy of these forms of ... and I do think that all of them have serious mistakes built into them which are with this untangling it\nAt the end of the disentangle ing there will still be men and women and the few people in the world who are hard to testify is either there was still the people who in Mississippi or lack for all practical purposes that will still be people who are promising and Catholic in Northern Ireland\nBut I think we can we is important in trying to respond to the problems associated with his identities and to ... to the good things that are associated with the ... it's it's better to be clear about how they're actually made\nBut do do you find a disappointing that that uh you know a couple of years ago you delivered the rather influential reflections here in the u._k.\nAll about the the ... in a sense the Mets and the false constructs that underpins much of what we think about race and religion and what have you you've written this book\nThe ... and that's the key what the ... the buying so you're doing your best to explain to all of us from your position as a public intellectual it a lot of what we think about our identities\nIs is based upon false premises and yet here we sit today in the early twenty first century with the world that seems more driven by group identity\nAnd tribalism group think than ever before yes\nWell at least as if it's not and we certainly are the things I'm reporting in my book it's not as it is if I discovered all these things all by myself and these are much of what I say is pretty common sense nickel in the world of the sociologist and the philosophers and think about these\nBut but I suppose my point is a day you ... you know it's a pejorative term and I again I'm being a little disrespectful but that you said in your serve academic ivory tower on picking at all of this stuff and it makes the blind bit of difference to the way society works Powell is wielded and the way people think\nSo I I'm going to ... I'm going to say something sounds like an American I have gotten used to that I've gotten used to that I think I'm maybe it's worth saying but I think the job of someone like me and my job is to provide tools for people to think about these things that are better than the till they currently do my job is not to tell\nThe far right front runner in Brazil's presidential race said who moves against independence if he wins the election\nValuable to NATO told around the hit pens the country of what he called the west has policy criminals he's facing the party's candidate in the runoff election\nMexican volunteers have been giving food and medical attention to hundreds in Central American migrants who are marching towards the United states and president elect Andres Manuel Lopez Obrador\nIdea of ... in southern Mexico to protect the migrants Saudi officials say the country's really does have spoken to the son of the mud and journalist\nJunk show gee I don't pretend that condolences for his death the sound is acknowledge the matter but said is it being a rogue operation state media in China has launched a ferocious attack on the U.S secretary of state\nOf the accused Beijing of predatory economic activity cool the remarks wild disrespectful and baseless\nStrike as much of Indian administered Kashmir to a standstill stoppage was called by separatists off to the deaths of seven civilians in an explosion in cash on Saturday\nA group of research organizations has warned that the world is losing the war on drugs it said the dream of a drug free world should be replaced by a more realistic approach BBC World sent his knees\n\nDon't sound like you\nDidn't see it in my head and we love the law like raise bomb against myself and I continued to write I never ever she felt that I had was satisfied once I got 'em\nIf that rings a bell then you probably will thing called an insecure over achiever and in this edition of business daily from the BBC with Neiman went outside like also we hear from Cass business school professor Moore and ... and\nWho he's a professional services companies in other words investment banks new sons and consultant to make a point of seeking out insecure over achievers\nAnd employing them but does it matter if some of the best paid workers in our society is a super stressed anxious praised hungry perfectionist that's coming up over to neurons and how did you come up with a Tim insecure over achieve this anyway really\nWhat's behind this is that you know twenty five years of engineering people they kept wanting to volunteer this information\nAnd I was writing a book about leadership and I I found which distracts or into the middle of the book\nI Want snuck it in I was I wouldn't say I was embarrassed about it but it wasn't something that I wanted to lead them because it is such a you know sort of vulnerable and an expose kinds of of of such by did\nThe Financial Times management editor Andrew hills then picked up on the chapter about insecure over achieve this interview he wrote a professor ... book\nAnd it ended up being his most red call them ever not encouraged me to tarnish into Harvard Business review Oscar which also was\nSpectacularly successful so when you talk of course it struck a cold and I realized I just have to go with it and be brave brave enough to go out and talk about her own experience as an insecure over achiever and collect the experiences of many others he's professor lower and ...\nAll over achievers are exceptionally ... famously ambitious\nBut that's driven by a profound sense of their own and not ... or is Jeremy Newman who was global CEO of accounting firm BDO ... explains\nThat was a fear every day that actually something was wrong because everything else would unravel and so one from ... crime to look Serino happening furiously underneath\nGermany could be describing my own life has an insecure over achiever\nI started out as an investment banker before becoming a strategy consultant my employees told me with the best in the business and because he was\nFirst that makes you the best too and that felt amazing\nBecause I'd always down to my own was\nBut he was also wiring because I knew they kicked me out when I failed to live up sorry expectations I Love the book and I was taught forget from actually quickly but the higher I climbed the more frightened I became\nA folding I tried to escape the cyclic ... by changing career I'm becoming an academic\nBut I'm just wondering who's to blame me on my ... and\nThey believe it is that character but that is implausible because it is something that is induced and individual through these work practices\nLike me do ceramics Michelle from the University of Pennsylvania I spent many years researching these elite organizations unlike me she began life as an investment banker in her case of Goldman Sachs\nYou have to suppress your biological and emotional needs\nIn order to be at the Beck and call of your work when I entered gold and then there was a panel of analysts and the important topic was how do you stay awake\nAfter extreme sleep deprivation and one analyst helpfully recommend that that you have a paper clip under the table and cut yourself because that pain in her experience will steal anything strong enough to keep her\nAwake it's tempting to sink son waltz offer all these professionals are getting very well paid by the store type effect sounds disturbing me like self harming and just because they're very well paid doesn't mean we should trivialize that struggles his consultant just comedy a senior manager at KPMG\nThey'd have depression I think sometimes I just felt icon always bring that to what do I have in the past\nAnd it can be really neat to fail the econ till about that\nWith someone it's difficult I mean what can the buildings where everyone has glove rules everywhere and you can see everyone around she when people are smiling and sometimes you feel like small thing a tool\nAnd what's I think is true is that I see other people that feeling that too but everyone is just pretending sometimes\nEvery insecure of retriever has people in the ... who benefits for all those people will do this is the fruits of the ... which courage prosperity\nFor many many other people\nThat suggested grim state and city institution and he's an right he's multiple roles include championships of boxers investment bank unfounded life I've seen one of the ... largest Asset Management companies so she sees the insecurity retrievers fundamental too successful functioning of the section\nSlip by members of the close relationship is well suited to somebody who doesn't cover very good sense of self\nIs prepared to the clubs interests first rule so does very regular Joe public sludge\nI'll eat management consultancy firm McKinsey has an old ... ... with us from second self but I'm just launching the caught by subjugation yourself to the needs can make you feel one seat feeling once it's important the insecurity which Eva\nAll driven not quite dead lawns you set yourself up by the deadline set by your clients\nAnd he was the global senior partner leading Alan and every one of the elite magic cycle ...\nSays he'll client for example says that size friday night\nYou're about to go out and you get a phone call from the client and they say I Want to do this to you and I want to close it by some day weekend is going to be trashed you didn't have much say about law on his relentless\nBut you will of the people who thrived ... was good about it\nIf you do today and you enjoy it that's very stimulating you've come runs or a large bill at the end what she's type by the growth of climate um situation and so you've got her tangible number on the page down stretching the body that you have and\nAnd then the farmers you know to the next one was like a drug and if you're good at it does a lot of states with laws that come from that but financial but also in some ... go and get a sense of the film\n... sounds like an elite athlete driving himself constantly to achieve his personal best\nWhat if you're feeling insecure you know sometimes that can be complacent and I think his whole market people like this that they are quite worried about becoming complacent because I tend to know the complacency quickly leads to selfish which leads to decline ultimately termination\nReframe security is perilously close to complacency and certainly in relation to strive to excel at least something nice from select full when recruiting\nWhere there is an effort to find people that have been reasonably restless and not easily satisfied\nUntil recently you've al ... who's a senior partner at McKinsey FM which NBA graduate so one around the world dream of joining he explains that McKinsey and looking for recruits with personal stories to tell about as coming significant obstacles in their lives\nLearning about the gave us a lot of interesting insights about how much of that can be easier natural to them as opposed to how much of that was driven by wanting to fend off and willing to work for it was a story that\nHe was a gift to our nation a controversial gift but actually a gift and you had an extraordinary courage and he was prepared to stand up to whatever he had to fish and they had to stand up to her a great deal\n\nOf muscle mass Desmond Tutu in the Nineteen seventies new face young carry this was the decade when resistance against apartheid\nTo building us with the repression of the sixties and imprisonment that feed is it was during this time that Desmond Tutu began to image is one of the leading voices against the nicotine and the ... white minority rule\nMore and more as I go to him I realized that this was the nature of the prophet at work and they're uncomfortable people to have around they all the disturbance of the peace but be necessarily show because um the authorities have needed to be disturbed and Desmond ... began to fulfill that row\nAnd he always insisted didn't see that well maybe they had him with his Christian buddy his belief just but he wasn't a natural five in the\nYou know he was ever election protests and public figure you want it to me that he's actually quite an individual person which is quite difficult to believe as you you see this extraordinary ... openness which he's got\nThat and him so he's a quiet man he wants to be a contemplative prayer for men but he threw himself into the gap as or a politically is really mastered rather in exile or in prison\nWas in the months before the wait till uprising in Nineteen Seventy six the Desmond Tutu first became known as a campaigner for reform a year earlier he'd be the first black men to be appointed to the senior Anglican hierarchy becoming dean of to how does that and he used that real as he used every well to campaign for change\nGoing on march is holding vigils even writing a warning listen to this then prime minister is he's a cool place to to the b._b._c.\nI just felt any ... that things would lead to exclude unless the government did something pretty dramatic and they seemed like go to see maybe this men me British born in this catastrophe maybe just the\nOpposite but South Africa's white prime minister didn't respond among states to please confound schoolchildren protesting and the black towns across the west to die inside and outside South Africa so I said was a turning point in the struggle\nAgainst apartheid Desmond Tutu kept on protesting challenging he went to Europe and America cooling that economic sanctions which was very controversial wasn't it especially among\nThe white community and then in October Nineteen eighty four he called the Nobel Peace prize how was that ...\nThere was jubilation I was I was certainly jubilant and it was huge jubilation in a back community particularly because he was seen as a hero of the\nAfricans Desmond Tutu with now and I come second only to the still in prison\n\n\nHe dead to save him saying didn't he spoke out against police brutality policy the black community was full living he\nLike in the way the government to black South Africans to the Nazi jak the equal for boycott this last election but they never arrested him today\nI think they realized that he was two well known in the world but it is possible of course were taken away from them more than once and he went into situations of violence brings up within the townships to to rescue people and he he stood up ... to anybody black or white\nIn Nineteen eighty six Desmond Tutu whose name was put forward for the post is the head of the Anglican Church and stuff in Africa the tissues of Cape Town it was a huge honor at the heart of the establishment the only other contender who's ... Michael muscle\nHe was a reluctant candidate shows us and we decided that it was the right thing to do you know cause debris it up on the water so to speak\nAnd at the two of you that together didn't you waiting to hear that was down to the thing\nIs for several hours that day routes through from about nine ... darkness we were sitting in the library of one of our church schools where they looked at the same day was happening in the large Chappelle talking clock it together\nKeeping a lot of silence trying to be prayer for 'em but both of us obviously quite tense and been ... into the outcome has been pretty clear that this man had been addicted he goes to a two thirds majority of late you could buy the third ballot which is ... it was a very good decision\nAnd how did you feel when you had that\nWell there was a combination of emotions there was a sense of relief\nThat I wasn't going to be ... as it were into this horrendous the responsible row with our country and major crisis when the church itself divided about how we should turn but at the same time even though I prayed as it turned out in vain for what is sometimes called a hoagie indifference [laughter]\nThat didn't work because I actually had to acknowledge a feeding of rejection and um I was just there to sink away and the dog and he made him a magnificent comment is never lift him you know to me she said I'm tongue tied and I know that the quite a lot of people who would probably be glad that that is so [laughter]\nBut it costs us bishop tutu didn't stay silent for long\n\nRight here and ah [noise]\nThe right person was elected for the right time and historians will look back on this election as a crossroads in the last about ... ... and the lack of our country\nAnd here he was at the head of one of the main churches in South Africa the options people used to go with him and he was still going on march is he\nHe was in the hall of those things costing the crowd is writing them to be peaceful even under publication that was his role do not have they respect many would march with the very front page of the march with others around him but he would be in the front and he's a diminutive position physically but Modi spiritually he's a giant\nBut inside the white community there were people who were very wary of war he represented he was sitting in the ... cathedral in the hall of government his official residents with the most expensive white suburb in Cape Town and people left to touch it but didn't they what were they worried about\nThey were worried that he was especially all countries with the devil to Portage and religious gym analogy that huge reservations that I go to court drew onto the Christians and give the purchase a drive around and TBIs but sometimes it works sometimes it took\nMe to\n\nChange was coming in Nineteen eighty nine the same year that South Africa go to new reformist president F. W. to cook bishop Michael ... was appointed to two deputy was a deep sea symbolic move a white man setting is deputy took blackie to protest the to The Mentalist events about to unfold\nWe could see that something was in the offing but we we didn't know and we took on a road is minute by then so not deliberately but by implication to predict an image that discuss during Ford and when this directly to watch the activity and relaxing but it was symbolic [noise]\nA few months off sufficient muscles appointment F. W. surplus lifted the ban on the a and see enough of Mandela and other AMC leaders were released from jail [noise]\n\nNelson Mandela but just last night to freedom that ... to choose resident four years later he became South Africa's first black president\nDesmond Tutu went on to chair the truth and reconciliation commission dealing with the crimes of apologized he's since retired from public life bishop Michael muscle this will serve retired and lives in cause you to tell he was talking to me that we said OK the ... [noise]\nThis is K. U. T. K. U. T. H. D. one Austin who you're you're central Texas home for NPR BBC I'm Jerry ... thanks for being\nHere\nIn the news and the music you find on Haiti in ... when you pledge seven hundred and fifty dollars and become a business member of those have\nEugene cage he acts to your business name contact information and website link will be put in a special section on both our website your business will be recognized on air on both ... throughout the membership drives for a full week after you I'll forget one of our great thank you get your seven hundred and fifty dollar contribution identify\nYou as a general supporter of Austen's NPR station and the Austin music experience cagey and K U G act fitness number right now at ... feet out or ... or more call side one to four seven one six to nine\nOne thanks\n[noise] [noise]\nIt's ten o'clock at London five in Washington May Day and night Robie I'm Julian Marsha with well duct tape from the BBC [noise] coming up on today's program the Saudi Government admits for the first time that your mouth shut Jay was murdered in the Saudi conservation assemble\nIt will really difficult to on some home from the projects for the whole truth who'd lost an operation to involve seven pulls his personal forty called\nIt early in the European Union looked to be on a collision course ... budget\nAnd destroyed in prime minister gives so national apologies have victims of child sexual abuse\nWho nobody asleep for many survivors what they're thinking is should pull that helps and Fonda in the past two middle loves\nPasta justice that's coming up after suddenly says well [noise] [noise]\n\nYou know I mean and the obvious reasons for this and they're also August precedents for whom do you go to\nGo back over his barest attempts to cover a ... or ... ... ... again he has passed all new to protecting on the ... uh it was on the his rule that mom and become was promoted and that is most senior experience cousin\nMom and been knives was ... you know and house arrest\nAnd again you have to factor in the rural\nAll his son in law Jared Kushner who's just happens to pass a relationship with mom and been song\nAnd aren't you know ... regularly an awful lot business goes through that relationship can now he's been Salma and everyone is worried about consequences about traffic ...\nPresident Trump is still saying though the um arms sales to Saudi Arabia will not be affected I'm not as a very different position to the one company being taken by the German chancellor and going to medical\nYes I mean and also really a\nBritain has said very bright enough to live on ... relationship\nOr space engineering depend on sales to a kingdom ... said she will get annual sales go to the kingdom and there's obvious reluctance in Britain to say anything\nAbout this case I think the issue here is not necessarily sanctions or pressure rising kings ... to say that his song is now talks so\nIn a sense of ... about teaching very strategic\nArms sales and a diplomatic channel on security channel to the most important Arab country which is the ... happen to the middle east\nUm financial companies in the middle east\nAnd in the political and ministry kept Middle East is well that's not an issue was an issue is mom and Vince hung himself\n[noise] obsessive touched editor in chief of the news website to Middle East I and a friend of the late ... cut short gee [noise] some of the richest\nIn the wild lost everything when the Titanic sang kind of transatlantic crossing in Nineteen twelve now a consortium\nNew money risk takers is poised to profit from the artifacts that curators had hoped to claim\nThree hedge funds have banded together to submit a bit of Nineteen and a half million dollars to buy Alta facts recovered from the seabed surrounding the Titanic and for the moment they've armpit of group of British museums who'd been hoping to acquire\nThese once lost treasures Kevin ... is director of royal museums Greenwich and told me what they'd been hoping to by now the object\nConsist of all manner of things they each of the ship so for example there's a section of how some ... most I made it a woman for made his toll these feelings from the ship they fix just from the ship and this personal belongings from people and so it's a very very broad array of of materials\nAnd a reflection very macho that period\nEspecially so because of course what's happened is some of the things that have been recovered a suit cases or pledged and bags and things like that and they're extraordinary because they're a microcosm of someone's life in someone's intentions in that bag that they took with him and said they liked me Tom capture\nAnd because I've been in closed and not open to the general see\nThey have been preserved wise you wouldn't expect so there are paper based materials their diaries there are individual materials that relate very specifically to a person postcards collections of post constantly you wouldn't expect would've lasted close to a hundred years on the ocean floor\nTo these rights ... of of a cultural value rather than ... such as ...\n... Jews as well it so happened the way the ships split apart was about where the post is Kevin ... courses where you would have left your vegetables if you didn't want them to you Kevin these hundreds and hundreds of bank notes for example because they would have been in the post is Kevin and that was split the sun to\nSide there are Jews and such things but found a way I think the real value in this collection easily it's social value rather than is it purely singing tons of ... and there's no go by and all that sort of something\nAnd you believe that these items belong in museums\nAbsolutely the principles would with any cultural heritage is if you have a ... you take that collection together so if you are I decided we'd like one of the ... many of them so we'll just have one and we'll put that in a museum somewhere in the world who knows better still will sell it off you know I've got lots of money you know Obama that Weinstein\nThey'd be at right around the world if for some strange reason things from the city people seem to think of his treasure whereas if it was on land it'd be deemed as a heritage collection which must be returning together and this is exactly the same\nThis collection should be retained together and not be under any shred of being broken up either now or in some future state and and just this to collect is now those around the world at the moment that you're being out there don't you buy hedge fund ... what happened was that these companies started collecting material back in the eighties\nBut I've had that collection for something that he is about\nThe company that they pass all his going bankrupt by going bankrupt across ... invulnerable in America to up to a bankruptcy hearing and the potential to collection being broken up and sold off piecemeal\nAnd that would be an absolute travesty we didn't stop it some to usually go to Shawn secure this collection of bringing into public on the ship in perpetuity through to national museums roll museum Greenwich the national marathon museum in Greenwich and also ... the national museum of Northern Ireland\nSo we do have to be in an American bankruptcy situation so it's not your normal cultural heritage management and unfortunately at the last moment we were outbid by our group which has a must side many of the current owners of the company of out of the speed plus a series of American hedge funds\nAnd says I put up the money for it and that's where it currently stands\nAnd they see these aren't as ... as an investment today is is that that thinking well I Can't\nSpeak for them but in my experience most hate funds tend to tend to take that view on things yes usually a short term investment Robin Long term investment\nIs it happening more and more the cultural objects if you want to describe them as a such a being retained by private companies private individuals rather than going to the public tonight\nAuction houses um survive on trading and selling paintings and other things I suppose the differences in most cases you're looking at individual objects what we're looking at here is a very large assembly each\nOf material from one size and which is a collection so it's not as if you got individual off into the recovery one way or another these these out of the time that they recovered and recognized by everyone to be a collection and the court said he recognized as a collection\nSo I don't need to be fair to say this is happening more and more obviously there are people around the world was a lot of money who are interested in whatever the subject matter is whether it be paintings or sculptures ... who start material\nAnd those people who say that can move trying to acquire things the ... the people around you want to cherry pick you know they're interested in one piece or another piece\nBut he sets the lead to happen the collection is just is broken up for overtime and once that happened you could never re assemble it as these one collection service searches and for the public to see into mobilizing for researchers to do to sort of research that she would have would have such an important reckon with such social significance\nI speak of and Kevin ... director royal museums Greenwich\n\nCome out later in the program in what could become the most important Senate race in upcoming us midterm elections we have from voters in the Republican held a state of Tennessee\nWith the extreme conservative than extreme levels a moderate is really really nice thing to have\n[noise] and ... but you don't know if you're going to vote for the moderate filled already that sure right now I'm not you might I might and is that one of the main reasons why yeah [noise]\nReminder of on top stories exist Shaw destroyed and prime minister is to live at a national opponent tea to thousands of victims of institutional child sexual abuse\nOn the phone rang presidential candidate jai out of a sudden out of a threat than to rid the country of the criminal elements of left wing watches like U.S policy\nIf he's elected will have more on those stories later in the ... of well [noise]\n\nYou're listening to well duct tape from the BBC in London I'm Julian Marshall\nA huge migrant come boy traveling through Central America to the United states has set up camp in the Mexican city of chocolate Chula\nThousands of people mainly from Honduras of being on the move for more than a week in spite of threats from President Trump to denied them and treat if they do reach the U.S border on North America correspondent Sunday ... is traveling with the migrants and sent this report from tap huh Sheila [noise]\nAppears\nTo be a little that can stop this convoy of migrants itself it in a town in eastern Honduras people in that thousands strict west across the country and then across with a mother to [laughter] to the gate for what Melissa Mexico shut they were stuck on the bridge between the two countries\nThat anyone who thought that'd be the end of the story was wrong [laughter]\nThe far right from Renee in Brazil's presidential race that you'll move against his opponents if he wins the election say about an hour ago told Irani comes the country and what he called the work has policy criminals he's taking the party's candidates in the runoff election\nWith us joined exercise in the south China Sea is under way between China and some of its neighbors\nSome of those taking pot have territorial disputes over the area\nAt the table easing pound aimed at avoiding misunderstandings at the same media in China has no one's differentiates attack on the U.S secretary of state after he accused ... probably the tree economic activity called the remarks wild disrespectful and basis\nThe kind of you has been extended to cover all of ... city in northern Nigeria in an effort to stop sectarian violence within fifty people being killed in clashes central began after dispute between Muslims and Christians\nFive more techie she employees in Saudi Arabia is counted as an example of beginning statements to officials investigating the mud or other ...\nG idea Saudi officials had the country's ... had spoken to Mr official Gees on a strike has brought much of Indian administered Kashmir to a standstill stoppage was called by separatists off to the deaths of seven civilians in an explosion in cash on Saturday\nBBC News\n[noise]\nDwell drop date to come and do you live from the BBC in London on Julian Marshall hundreds of survivors of child sex abuse and the strength of the prime minister ... deliver a national apology for what they and others have suffered\nA victim's run the audience in camera where of an emotional miss tomorrow some told parliament to destroy in state had failed to protect them from decades of what he called evil don't crimes you say child sex abuse defected institutions including schools churches and charities as one of his family homes\nIt happened die off to die week after week\nMonth after month they ... off the decried\nUnrelenting torment\nWhen a child spark ... they weren't believed and the crimes continued with impunity wants to bother told me that when he told the teacher of he's abuse that teacher then be time he's next abuser trust Brockton\nInnocence betrayed Peron positioned exploited for the dar crimes\nDestroyed and prime minister Scott Morris and um I've been speaking of Dr Kathy ... herself a victim of child sexual abuse to not works for the organization blue not foundation which supports adult uh survivors and provides advice to those who support them she was in parliament when the apology was delivered it was delivered\nBy bus the prime minister and the leader of the opposition and uh it was obviously very emotional would look through survivors in the room but it's so hot tells it felt sincere\nEmphasis evolve as it was very meaningful because the government of this country was saying that won't happen to them a message it'd been acknowledge the Harlem and being acknowledge that believed that it wasn't their fault [noise]\nAnd that was the feeling of of the survivors of sexual abuse in in the audience was satisfied with what was said\nLook I mean obviously one cotton make sweeping ... statements about hundreds of people but the people I spoke to the majority fills the times we're starting to change\nBut there was a definite acknowledgement that you know these little ... you're not by bus and those leaders and now we said they just said more action as well and that was appreciated too\nWhat sort of action argue and I was looking for\nLittle come in the there was an announcement today that there'd be a national uh Santa around child sexual abuse you know looking at research and\nEvidence around some pools which has to be welcomed the news and now it's been around the national museum you know like a sort of memorial and the commemoration the people's stories start to get lost that they do matter I mean obviously from many survivors what they're seeking is should pull that helps and Fonda in the past two bit alive and\nThe posture justice and I suppose that road conditions enabled that with a lot of its recommendations\nSo you you've got a lot of ... of symbol ... if you'd like now but what about ... to ... do you think back to the victims of sexual abuse ... believed now than they used to be\nThe kind of think it's starting to change I think that there is still some very entrenched fears but certainly in this country we now have a national conversation that does acknowledge that people just\nGet is what happens to them that you know it's understandable that knew that when you've been patiently betrayed as a child by the very people who are meant to nurture and protect you that that can have profound impact since that understanding in that\nTolerance is starting to change attitudes that much more needs to happen\nI mean what happened do you miss ... um how long did it take before you would have believed\nLook I mean I wouldn't say that I was believe by I mean my my abuse could in the in the home and family and um you know this is still some segments in my family that don't believe me\nBut I suppose I went through a long process of therapy and support from family and friends and you know go to a place where I was solicited my own belief myself and my truth\nAnd I had enough people who ... to the impact of what had happened to me it's a you know the prices and naval base to move forward\nI mean that's the most difficult issue isn't to to address familial sexual abuse Rob of ... which occurs and institutions such as schools churches charities\nYeah look I mean I think you know any incidents of sexual abuse or repeated sexual abuse is very challenging but [noise] you\nKnow what was the knowledge today also was that\nThis was an apology for survivors of the ... outside the of institutions as well acknowledging the abuse occurs in the home and the family in the neighborhood and that it's not just sexual abuse the impact staple it seemed that physical and emotional abuse growing up with family violence so\nYou know they're starting to be a much broader understanding that we were really in a must not have a hierarchy of trauma that everyone who's experienced trauma in childhood or adult food for that matter and they wrote support so that people can Rick have because we know that people do direct support\nYou yourself are you a happy hour you any more content to adopt of this apology from the prime minister\n[noise] you know ... it's been a very big day [laughter]\nAnd there's a lot to price is so demand is I'm pretty stood up I was sitting next to someone whose sister had committed suicide as a result of what had happened to her and she was serving in Iraq through the apology is as the certainly understandable [noise]\nSo you know I think it'll take a while to to really persist is and and think about it but you know I can sit and they said that it was a very substantial meaningful day for many many pay full\nOf stuff tucked Kathy ... from the blue note foundation is trying to herself a victim of child sexual abuse [noise]\nThe outcome of elections is often said to produce a change in the political landscape for ... threatening something much more dramatic\nHe's the right wing presidential candidates in Brazil's upcoming elections and he says that if he wins he'll Clinton's the country of what he called the criminal elements of the left wing workers' party of his opponents fundamental out that\nWhile he was asked\nMe said Lula da Silva if you were expecting Mr ... to be presidents to give you a presidential pardon I'm going to tell you something [noise] you're going to prison and I ... going to be there soon [noise] not as easy to but just a few years by your side [noise]\nAnd she she love each other so much you both of us in prison because the place for criminals\nWho steal from people ... ...\nIt was you know\nWe're doing now is a ... who spent ten years working during the symbolism and is now a senior lecturer in sociology of media at City University in London what are we to make calls these comments\nElection rhetoric to fire up a miss the most amount of support has\nNow much serious than that I'm there has been an attempt of trying to naturalized hit fastest them or is being a candidate within that democracy and being a right wing candidate which also not\nClearly it's not an extreme right wing candidate and at the moment he is and go ... also in accusations of a legal campaigning practice\nOf using what suck to spread fake news in the ... election\nSo the problem here is not just in relation to the Workers Party but also how to pronounce from ... of the center right from the ... have been at a disadvantage because of the legal campaigning practices that today upcoming across and with documents to prove them\nOr lack for justice has just accept it\nSome stories of the day you depend on us recovered that has death and intelligent\nWe depend on you for the funding we need to keep our smart back based coverage becoming so if you haven't done civil already about making that first ever donation to K. U. T. right now during our membership dry\nNow is a perfect time to become a member\nOf the ending gifts of ten and twenty dollars a month or very popular with new member of your voluntary and generous donation at whatever level helps bring you the public radio news you debate on [noise]\nMake the decision to invest in the smart news and information you\nBecome Katie's new is sustaining member right now by giving safely and securely Katy died or [noise] or by calling five one to four seven one six to nine\nOne thing and as always you can do that and but special today for this hour only you're getting your dollar matched dollar for dollar amount joined by trade shark afternoon producer for all things considered infrequent afternoon host good afternoon tree\nI also take part in the membership drive [laughter] and uh you know a good point was made by that an identified man we were just hearing from that would be met\nAnd its reiterated by Darren Smith who writes I Can't imagine not having K. U. T. and NPR's part of my dad listen for way too long well not being financial donor send to conquer the pledge drive guilt and feel that I've contributed to something that means so much to me\nThat's a good point Darren and we appreciate your support and we're hoping that that many people out there like you who depend on K. U. T. but have not yet become a member of take this opportunity\nTo become one it feels good and we couldn't do it without you you can do it by going to ...\nAnd that you do it now you'll have your dollar matched by Patricia ... and she is matching the next twelve hundred dollars in donations all the money raised during the membership Dr goes directly toward paying for the programs you love and if you do so at ten dollars or above today\nYou get to take part in the last day of our early bird special which will get you a brand new T shirt of your choice and to not one to plastic tumblers of our new tumblers where you can enjoy a beverage of choice or you have to do is go to kill you to eat out of work today\nIs there a glass this American Life it's pledge drive and in this moment when red state America and blue state America do not seem to agree even in the most basic facts on any of the issues facing our country immigration or any of the others\nOn his radio station on public radio we think it's important to try to carefully and truthfully\nDocumented analyze what is actually happening in this country oh\nOne thing I think about all the time is how we now live with a vast alternate news media that is not that bad as\nThe propaganda for political position\nAnd the people in the non factual side\nThey see this is a war there Frank about that they see it as an information word they see it as political war and they organize money and resources for that war I think it is a problem but those of us in fact as people like me like everyone in mainstream journalism we usually do not think of it as a war\nWe don't treat it as a war\nBut it is a kind of war\nAnd if you want independent reporting\nWe need you on our side oh\nOr you can pick a side with your dollars\nOn this radio station\nHere is that a pledge\nOh you have to do is call five one to four seven one six to nine one or even easier just to go to ... to eat out or click that donate button\nBe part of the more than twenty thousand a view that make regular monthly contributions to\nThe news coverage that often depends on you know a lot of places you can go especially like this uh this boil water order from the city of Austin\nUm you may be confronted with a pay wall if you want to find some information out when you go to a website um for a newspaper or some other organization\nWe don't have that why because of your contributions now you don't have to contribute you don't have to contribute a dime and you can still have access to the great information you could turn on the radio you can go to Katie dot org and do all of that for nothing\nBut know that if you do become a member of your helping other people say informed and that's a more important than it's ever been so are you not only um [noise] showing your own support but you're allowing other people to a avail themselves of the service we\nTry to like public information public fact based information is Ira Glass just a\nEmphasized is never been more important than it has been a I feel like it's it's it's a growing concern so uh if you're into that view that's what you want in your news coverage please please please become a sustaining member today all you have to do is go to K. U. T. dot org and uh\nYou get a lot of of of fun goodies with it but no that with your pledge with your contribution you're helping a lot of people get the information they they need and could use to you know improve their lives a little bit\nAnd there's another way to let not only us know that you're out there but let other people know that you were contributing to cagey by tweeting about it use the hash tag left K. U. T. and let us and everyone else know why you support cagey what it means to you and why it's important that it be supported by listeners\nAnd now's the time for you to do your part B the latest member on the shortest Dr ever go to K. U. T. dot org\n\nBack in March Chris Arnold and I investigated a story affecting teachers all over the country\nWill get funding in class clown getting it and I guess Bob\nHope for the first time in on the years I felt like I wasn't oh wow\nI'm Cory Turner and that's Caitlin Moran calm on the government offered her tuition out in exchange for teaching in a low income area\nIt seems like a fair deal until the paperwork is she turned her grants into twenty two thousand dollars in loans thousands of teachers are now facing that they never signed on for after we broke this story the department of education launched an internal review\nAnd a ton of whole fight all actually has\nHelp us do more by becoming a new member today our investigative reporting starts we can you please support it now [noise]\nNow's the time just go to K. U. T. down or become the newest sustaining member on the first day of the shortest Dr ever getting shorter all the time Jimmy yeah I mean we're almost there day one so that means it's less than five days that's flying\nBy and understand or we've got an announcement\nWhat drum roll but that's my job so that would be the\nMatch has been met two\nHundred dollar matching pledge from Patricia Monterey and among the people whose contributions were matched are Angie lot Evelyn Mickey and Abby Alan thanks for sharing your support for cagey and know that your contribution is going twice as far thanks to the matching pledge from Patricia of a Monday\nEvery little bit helps every you know if if you can't uh if it's not in your budget to give us a a ton of money we understand that it's I mean I'm a sustained member I don't give the all that much money but I give something and participation is most important here so whether it's two dollars five dollars ten dollars a month\nIt's your participation if that helps us gives us a broad base of support that helps make possible all the things that we bring it from\nFrom all things considered which trait will help bring you in an hour from now so already working on a Jimmy yeah I Know so uh all of that comes from your contributions we could not do it without you we could not bring you the programs that you love to do like the b._b._c. World Service it's about to air at three o'clock\nIt's real easy to do I mean as you go to ... or there's a the the donate now button and a that'll take you through the steps just take a couple of minutes into you can ah browse among our thank you gifts which includes this time\nA couple of new T shirts and some plastic pipe glasses this is the last day of the early bird special where you can get in on that action for a contribution of just ten dollars a month\nYou are listening to the first day\nThe store to strive ever on Austin's NPR station K. U. T. N. K. U. T. H. D. one Austin oh\nWelcome to the news from the BBC well ... ... it can be today it's any says it sticking\nTo its budget plans even at that rejected by the European Commission it that is already twice the euro zone limit and it wants to increase it could spark another global financial crisis the Italian prime minister today moved to calm those fans\nWorried valley there is no shame no way to get it out though you were over ...\nAlso techie describes the killing of the Saturday Gen ... planned ... they want is the Turkish government hoping to get from Saudi Arabia justice all cash\nAnd I'm James ... Wisconsin two weeks before us midterm elections is Donald Trump still a political I sent in a state that losing not only but significantly in his favor in the twenty sixteen election coming out of the news\nIf that word to shift well then obviously they will be a crisis for the euro area as a whole and again most like the European Central bank would have to change its policies or at least take some new additional measures the risk of that\nHappening is that there would be many\nInternational investors that\nAllocate a certain amount of their portfolio to southern European all peripheral if you like government debt in the euro area\nIf they truly were at some point in the future to be further downgraded by the credit rating agencies into what is called a ... investment grade or more juggler recalled junk a rating\nWell then many of these investors would simply dump their holdings of not just Italian but also the other southern European countries government ... and you would have the kind of contagion that everybody is quite fearful about but as I said to date haven't really materialized\nOkay so you're saying commission and at this point is accusing ... non compliance it supposed to be deciding next ... last time it options\nLegally it's options are they can completely reject this budget but after that then uh it would take several months and then they can enter into a a an excessive deficit procedure sometime in two thousand nine team but there isn't any sort of concrete thing\nIs that the commission can sanction or levy fines or anything like that instead of course a measure that will uh in the short run really have much effect of course if the commission decides to have\nA very public debate or fight with the Italian government do but it will reduce\nThe commission can hope that the international investors and capital markets a notice this and that they ... a financial markets put additional and immediate pressure on uh the Italian government to change its policies\nBut the cost of that would probably be political because uh it ... and the other European members of you are heading into a European election a parliamentary election campaign a culminating next may\nAnd there's no doubt that the current Italian government would love to have\nA big political fight with Brussels over the Italian budget and over the extra money that in their eyes they're spending you know to help [noise] average voters in its ally because that that will obviously play into their political fortunes they're looking for this fight\nYeah kind of kind of got that and some of the Peterson Institute for international economics says why night the Italian government be looking to ruffle feathers and then released in Brussels\nThat's the main parties in the ... and kind of nation stood on us get to the phones during the elections in may so are they trying to stare at hostilities\nI think speaking to the under secretary for fun says not only to and from the science to me that I asked him if the government is just trying to pick a fight with Brussels\nLimbaugh ten things to make people to understand is that we have a a good economy they brought me that so we think that having a stable an increasing economy and the reform that we are applying good out also our country to reduce the debt in three years\nI can go to upset that you say you got a good economy and Jill interest rate has risen shop play in the past few months since the ...\nAnd ... said we have that to a town in government is struggling to sell it bums invested in retreat thing it's not to stabilize you think\nWell it was the other even during the read using all the mood is uh friends they are ... that our economy is good so I think that the reality is that what you're paying more in the interest on to that\nAnd that's all these creating some trouble by the way they think that we can increase our area the economy we used to before so I don't think that in the European Commission they would really and then the difference between an austerity program and inexpensive program\nSo you're looking at this stimulus package basically but even if they had no ... behind its time you'll still in class violation of fuel raised rules in the European Commission ... tomorrow it could turn around and all day you to lean on this subject what what do you do is ...\nIt's sort of to me it sounds very well either go to the end just look at the date that coming from France or Germany I mean friends that have been in both the limit for years even during the ... the mandate that the minister\nGermany is every year is and if their plots in terms of the great ... we're talking about technical things I can agree or not about the specific issues but it is mainly may do believe that\nWe know that in six months we will lead the European election we know that the commissioners and they own internal problems about this cannot deal with the daddy and people will\nGet paid in people's a decision and and well as you say oh this is your main concern but not that ... thing in responsible with Italy's\nEconomy and ... with the economy of the whole year and then I mean you're trying to ... just pensions example when you got an aging population you've got more than ten cent unemployment how are you going to finance that\nWould be gone to college was already found that when you mentioned the aging population and the eye level of the ... generation we can improve the turnover for the younger\nGeneration and leaving the city to retire to the the old one but you have to look at it complete like Joel reform was that we are sure that will bring us\nThe leader of the disputed Somali Region of soup says more than forty people are being killed during fighting between rival climbed overland rights ... is claimed by both the self declared Republic of Somaliland and Puntland\nTurkey has promised to do all the time to shed light on the circumstances surrounding the murders three weeks ago of the Saudi journalist ... a spokesman says the investigation will leave nothing in the dark [noise]\nNorth Korea and South Korea have agreed to remove guns on guard posts from ... from the peace allege that straddles the border is the only place where troops from the two Koreas these each other\nThree former students are suing the French state for racial discrimination that they see police subject to them to at the end of a school trip to Brussels they said they were singled out for searches to Paris ... because they were black\nAnd doing ... ... who's eighty five has won another seven year term as president official results showed he had won a substantial majority of votes the election held earlier this month several opposition candidates alleged fraud their complaint to being rejected by the constitutional court BBC News\nComing up next news and James ... is an American so cold that just state\nBut says two should say my ... in distress Italian government elites that engineers should pay no real and trying to save lives in the Mediterranean it senses that rescue states make the situation was by encouraging migrants to make dangerous Jenny's and it's closed it costs to such non profit organizations\nBut at the end of September one operated by the Spanish and gee I see that it's an ... decided to just find the Italian government ... change Reynolds was on board [noise]\nWe are just setting sail now from Barcelona [noise]\nHeading into the open office of the Mediterranean\nUs kind of comes founded the ... open arms organization at the height of the migrant crisis in twenty Fifteen [noise]\nYou know of course watts it leaves interior minister amateur solving he says he accuses you and other NGOs whipping taxi services for migrants how to respond\n[noise] water or got out of this is a history\nChannel Mississippi is one of the busiest traits in the world Ninety seven thousand shaped bus they hear every year around two hundred and fifty of them every day maybe even ten an hour I don't think we are the ... or important enough to gather all the attention that I\nGet I guess that'd be sitting in the focus now you can't use Italian Port Sudan to travel for days it's expensive operation how long can you keep doing [noise]\nFor the for profit on his ... he was with a ... we\nAre us citizens response to such we want to offer I Do we have the support of many ... the thing that people don't have to die around an abandoned in the military [laughter]\n\nPlus three in the morning [noise]\nRed and green flashing lights [noise]\nWe're really close to that both how do you know fishing boats and not a micro while\nBuy whatever we can see that\nThe white flight ...\nKind of a monk fish is one of the crew members on this ship shape or form a competitive swimmer [noise]\nAnd she's what for many years as a like a [noise]\nDuring this mission\nWe see the\nSeven days we haven't seen any migrant\nHow is that for you when you just don't see any one [noise]\nI think he needs to take a plane because we know we came up and then um we didn't know how many lights so you see the same thing because we are able to help and now\nI'm you feel that way because of course because when you leave me here but I'm I'm late because the I don't remember now and\n[noise] and that report from James Reynolds just off the attorney intense\n[noise] you're listening to ... live from the BBC with me but they can't be in London but let's turn that SWAT Team in the United states taking the temperature of support for President Trump is just two weeks before the midterm elections\nAnd that that will determine whether Trump will continue to govern with Republican majority in Congress\nAnd he's asked James ... is in Wisconsin one of the states which this ideal and delivered Mr Trump to victory in twenty sixteen and James understand we joined us now from Milwaukee\nYou doing danger Becca thanks very much shift the city is known for his beer and it's ... the baseball team the brewers have had a pretty good run this year as we'll be hearing later I'm actually looking out over rather tranquil Lake Michigan in the east of the city but two years ago the upper Midwest and state hey was at the center of the political drama that brought Donald Trump to the White House\nIgnored by the Clinton campaign is supposed to be safe democratic territory Wisconsin went Republican red is one observer put it to me Wisconsin was meant to be Hillary Clinton's five will it turned out to be a speed bump on Donald Trump's wrote to victory I spent the last few days on the road myself crossing the badger state to assess the pre midterm mood\nI began to growing county in the rural south west where they twice voted for Barack Obama will have any backing Donald Trump and a return visit to a couple I met back in January [noise]\nOn the ... metal to school to fool God shines and transport them shock to the top of a stool resigned [noise]\nAt the end of the harvest season [noise] have you flown to the fact that crops\nAnd retaliate three Chinese ... byproducts of President Trump will\nHelp to push down the price they can get for them [noise]\nHey how you doing [laughter]\nNine month since we lost him I was ... ... ... which going sinful\nPrice you're kind of tough right now it's a roller coaster um what was causing the prices to be well I mean no doubt trades or\nYou know or suppress the price and that the army you mean the ... the prices on China or shall we are taking the brunt of it right now but\nIt needs to be done we need to be on a level playing\nField and you know I think in the long haul we're all going to be better off\nFrom a surfer you you'll take the pain yeah for the time being really yeah when we were last us having a few you know you really like what the president was doing you voted for him\nBecause he still have you'll you'll full support yes yup he's probably got more my sport now than they did when I voted ...\nWell just what John John said Hi nice to see you again you could have votes in the mid term elections dress yes I Am a do you know how you're going to vote I have\nI'm probably a little more Republican than I Would\nReally be so you're you're confident that he can come to an agreement with China than it's all going to work out for the ...\nYeah you just got to tighten your belt just hang on for the pretty much what it is the Pentagon for the right people\nThe things we asked for to level the playing field but postcards and dairy farmers are included in there that was good news at a time when our dairy farmers the good news in ... Wisconsin Republican\nFocusing on a trade war the hunting some farmers\nBut on a trade deal that should help others\nAnd the ... campaign went to advance in Milwaukee suburb he talks about the Trump administration's recent trade agreement the UN and CIA which is given Wisconsin's dairy farmers access to the\nPrevious the Clintons Canadian market he told me that ... mind Donald Trump's campaign Romney later this week will be in a traditional swing district in Wisconsin but in a rural part of the states where the president is popular\nPart of the reason why we asked them to come to wall so I was I Want her to the heart of the state or were dairy farmers particular appreciate what he did a good deal with Canada\nWhat one of things so closely thing if you're telling this story you'll economic stories the good news story why things still so close\nTo a better stay in many ways it's kind of ... he got urban areas you got rural area and got suburban areas and the other challenge we have historical or you look when ... when Bill Clinton was President George W. Bush was president rock along with President Donald Trump is president\nAnytime or the party in the White House is up in the mid term it's always a challenge all across the nation protect player in the seventies [noise]\nYou're right you're hungry I haven't got it probably\nDoes a president who is on ... to ... make it harder than usual for the Republicans are the roadside fast food restaurant and other senior Wisconsin Republican the speaking of the state just simply Ruben loss\nAnd I order a butterfly", "year": "2018", "show_name": "BBC World Service", "city": "Austin", "day": "22"}