{"month": "10", "state": "MA", "station": "WFCR", "content": "[noise]\nDreaming of New England public radio was one of the ball you joined riddle architect or to your legacy of combat but to mirror the design celebrating the next generation of leadership cute little dog call\n\n\n\n\n[noise]\n\n\nStreaming of New England public radio is funded by you and killed riddle architect of forty year legacy of commitment to community and design celebrating the next generation of leadership at ... riddle dot com [noise]\n\nThat was the or the U.S chamber orchestra playing the third suite of ancient heirs and dances by auto Reno Ruth ...\nGood afternoon I'm Walter Carol with today's classical music on New England public radio eighty five WFCR in Amherst\nW to six six eight W north Adams W to four to eighty Williamstown W to nine one C. H. Pittsfield W true five to be G Lee and W. to five for a you great Barrington\nIn partnership with UMass Amherst we're on line ... N. A. P. R. dot net\nFor news throughout the day you can listen to the any PR news network at ... am six forty and in Franklin County at Ninety One set an F him\nHere what eighty eight five FM we'll hear Rodrigo is fun to see a ... and they'll tell you about a concert performance Saturday at Amherst College\nKathleen Battle will be at the University of Connecticut on friday we'll hear her singing traditional spirituals\nW. three phone off will be the soloist and the performance of the piano concerto number one by Tchaikovsky well also share your your months new recording of this solo cello sweet number two by box and will celebrate the anniversaries of the birth of Emory come on and to channel burial\nWe'll begin with music which can be heard in a free concert Sunday at Massachusetts college a liberal arts north Adams\nIt's a free community chamber concert presented by members of the Boston symphony orchestra and on that program there's the piano quintet in ... by Dmitri Shuster coverage also music for clarinet below and piano by ... on on the New England\nStreaming of New England public radio was funded by ... architects a forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com\nSearch and share our Dirk Altman's clarinet\nTwice ... viola I'm Florian hench piano playing mission sounding or fairy tale narration by rubber shoe on\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise] [noise]\n\n\n\n\n\n\n\n[noise]\n\nWe had so much about last year we're doing it again New England public radio second annual genders may be Nineteen twenties holiday party Saturday December first at the hotel Northampton get you're glad rags on and get your tickets today at any P. R. dot net Mm\n\n\n\nMm\nMm\n\n\n\n\nNa\nWe had so much about last year we're doing it again New England public radio second annual jet this baby Nineteen twenties holiday party Saturday December first at the hotel Northampton get you're glad rags on and get your tickets today at any T. R. dot net\n\n[noise] ... called ... play the clarinet ... the viola and Florian and ... the piano in the mission sailing or fairy tale narration spy rubber ...\nThat's work that you can share along with the piano quintet in G. minor by stress to cope itch in a free concert on Sunday at the Massachusetts college a liberal arts\nIt's one of the Boston symphony orchestras community chamber concerts you'll find a link to information about that concert on the New England public radio Facebook page\nComing up empire brass plays the bucket no from sent songs Simpson a delight\nNext music by what Keane Rodrigo which can also be heard in concert this weekend I'm Walter Carol ... New England public radio in Amherst in Hartford that eighty five in great Barrington it Ninety seven and online at N. E. P. R. dot net\nClassical music on when good public radio is funded by you and by you comes from their maiden recital hall in stores presenting composer and classical pianist Frederick ... on Saturday\nStreaming of New England public radio is funded by you and killing riddle architects a forty year legacy of commitment to community and design celebrating the next generation of leadership at ... riddle dot com dot edu\nBy Hartford stage presenting Shakespeare's Henry the fifth\nThe recently crowned king embarked on a war that will solidify his reign but bring his country to its knees now through November eleventh Hartford stage dot org and buy a gift from the Richard ... government funded the Hartford foundation for public giving and by our local community\nListeners and area businesses who care about public radio and provide Ninety percent of New England public radio is operating budget\n[noise] I'll refer you once again to the New England public radio Facebook page where I posted a link to information about the concert that the ... symphony orchestras playing Saturday at Amherst College\nThis is part of a series of concerts this season called ... Aspen ya exploring various aspects of Spanish music\nOn the program Saturdays this week called Catalonia by ... the ballet all some ... ... well defiant\nAnd an arrangement by James go away for flute orchestra of the fun to see a pattern into long break by walking Rodrigo with members of the orchestras flute section as soloist\nHere's the original form of a concerto that Rodrigo wrote\nFor Andrea Sylvia in Nineteen fifty for you based it on a set of dances for solo guitar by ... sons this is guitarist Milo Scott adopt each with the London philharmonic orchestra conducted by ... again in the fun to see a ...\nBy what Keane Rodrigo\n\n[noise]\n\n\n\nStreaming of New England public radio was made possible by you and boy she keeps garage in Williamsburg offering foreign and domestic on the repairs AES each certify technicians Massachusetts state inspections she keeps garage dot com\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\nWe had so much about last year we're doing it again the weaker public radio second annual jet this be Nineteen twenties holiday party Saturday December first at the hotel no attempt to get your Glen ... get your tickets today at any T. R. dot net\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\nStreaming up the waitlist public radio was funded by you add Greenfield commonwealth virtual school public odd like K. to twelve school personalizing education for Massachusetts students that were rolling fall gee C. V. S. dot org\n\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gee C. V. S. dot org [noise]\n\n[noise]\n\n[noise]\nStreaming of New England public radio was funded by you and valleys solar local TV design at installation helping household secure state or federal incentives and live carbon free and the four one three valleys solar dot solar\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\nI\nMean those kind of dog which was the subtle which to London so I'm On a carcass stripped was I conduct\nWe had so much fun last year we're doing it again New England public radio second annual jazz baby Nineteen twenties holiday party Saturday December first of the hotel north happen get you're glad rags zone to get your tickets today at NPR done [noise]\nFun to see a ... by walking Rodrigo\nYou can hear this concerto in a slightly different form this Saturday at Amherst College it's on the program of the ... symphony orchestras concert along with the sweet called kept a low neo ... I'll be nice and the ballet all some ... ... to fire\nThe difference I mentioned is the James go way arranged the fantasy of for food and the some of those we Pete played by members of the orchestras flute section\nOn the New England public radio Facebook page there's a link to more information about Saturday's concert\nComing up I'll tell you about Kathleen battles concert friday at the University of Connecticut and we'll hear her singing spirituals next empire brass plays sense Homs\nI'm Walter Carol this is New England public radio in Amherst in Springfield eighty eight five in Leah Ninety three and online at N. E. P. R. dot net\nClassical music on New England public radio is funded by Ewan by music Worcester presenting trumpeter Christian Scott and the soul rebels at mechanics fall on Sunday November fourth tickets at music was stirred dot org\nBy pioneer belly ... but the doctor David Stuckey D O a practice of off the apathy and functional medicine in North Hampton accepting new patients P. V. austere dot com\nBy the rules to Northampton middle school opening hosting an open house for grades seven and eight on Monday November fifth from six thirty two eight information at ... dot com slash middle school\n[noise]\n\n\n[laughter] [noise]\nStreaming up New England public radio was funded by you add Greenfield commonwealth virtual school public online cage to twelve school personalizing education for Massachusetts students now would rolling for fall gee C. V. S. dot org\n\n\n\n\n\n[noise]\n[noise]\n\n\n\nWe had so much fun last year we're doing it again New England public radio check and then you'll just be be Nineteen twenties holiday party Saturday December first at the hotel north helping get you're glad rag Jonah get your tickets today any urine done\n\nWith people who don't let me\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\nStreaming as New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\nKathleen Battle sang were you there when they crucified my lord before that she was done by a course in orchestrate conducted by James Irvine for an arrangement by Evelyn Simpson current to swallow sweet chariots combined with right up in the chair it\nWill be singing songs inspired by the underground railroad a program called underground railroad is spiritual journey performed friday at the University of Connecticut in the Jorgensen Center for the performing arts wing going public radio Facebook page there's a link to information about her concert [noise]\nNext is music by Tchaikovsky and then we'll celebrate the hundred and thirty sixth anniversary of the birth of Emery ... [noise]\nStreaming of New England public radio is funded by you and bay path university graduate schools MS and applied laboratory science at operations enrolling now for August twenty seventh applications at bay paths dot edu\nRadio WFCR in Amherst Springfield in Hartford in partnership with UMass Amherst and online at N. E. P. R. dot net\nDuring this hour you can listen to fresh air on the N. E. P. R. news network at ... am six forty in northern ... county at Ninety eight nine ... online that N. E. P. R. dot net\nHere in eighty eight five FM you can hear music by by buying Baird Barry ... before all things considered beginning up for\nToday health care as a top issue heading into the mid term elections and the arguments on each side of gotten heated especially over preexisting conditions that story and more on all things considered it begins for jazz Ala mode begins at age classical music returns at eleven\nAnd for the latest national and international in regional news from NPR and the New England public radio newsroom please join us weekday mornings from five to nine afternoons from four to six thirty\nClassical music on New England public radio is funded by you and by UMass Hampton gallery presenting containing great space between ... Elliott secret Miller pollen and Jon Weber through November fifteenth fine arts center dot com slash Hamdan\nAnd by provisions hand selected wine craft beer arches in cheese on ... avenue in downtown north Hampton tasting seminar schedule available online ad provisions wine dot com\n[noise] here's pianist Donny of tree fall in love with the ... theater orchestra conductor by February ... in the piano concerto number one in B flat minor by Tchaikovsky\n\nStreaming of New England public radio was funded by un valley solar a local photovoltaic designed to the installation company serving people and wound up to live carbon free or one three valleys solar dot solar [noise]\n[noise]\n\n\nWe have so much fun last year we're doing it again in the window and public radio second annual jet this baby Nineteen twenties holiday party Saturday December first at the hotel no attempt to get your blood red zone to get your ticket today at NPR are done\n\n\n\n\nMm\n[noise]\n[noise]\n\nWe had so much about last year with doing it again New England public radio second annual genders baby Nineteen twenties holiday party on Saturday December first at the hotel Northampton get you're glad rag Jonah get your tickets today at any P. R. dot net\n\n[noise]\n\n\n[noise]\nWe had so much about last year we're doing it again and then we can public radio secondhand you'll just be be Nineteen twenties holiday party Saturday December first at the hotel Northampton get you're glad rag Jonah get your tickets today at NPR dot net\n\n\n\n[noise]\n\n[noise]\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology A. I. C. dot edu\nSo\n\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\nWas done ... off ... conduct in the ... theater orchestra and that was the piano concerto number one in B flat minor by Tchaikovsky\nComing up yo yo ma please box from his new recording of the six solo cello sweets\nNext kilter ...\nConduct or rather sings common on the hundred and thirty sixth anniversary of ... birth I'm Walter Carol this is New England public radio in Amherst in Hartford at eighty eight five in North Adams that one oh one one and the online that N. E. P. R. dot net\nOn the sixtieth anniversary of Edward R morose famous critique of American media ... discusses and and uh uh\nDiscuss is the status of the media to date and a seven part\nIn contrast podcasts series also a special radio broadcast this Sunday at two pm on the stations of the New England public radio and NPR News network it's an am six forty and that ... eighty nine Ninety eight nine rather ... in northern ... county [noise]\nThe Hungarian composer Emory common was born in this state in Eighteen eighty two in ... on the shore of lake ballots on in Hungary\nHis early desire to become a concert pianist was formed by chronic the right is so we studied composition at the national royal Hungarian Academy of music along with ... co die and Leo vying there\nIn Nineteen oh seven he received the frontiers of prize for his compositions and was able to visit by roads and then his first upper end of the gay ... was such a great success in Europe and the United states but he settled in Vienna\nWhere he would become a rival to translate hired as the leading composers of apparatus\nYou left you know after the ... first for Paris and then for United States after Paris was occupied [noise]\nHere is ... singing ... from the operatic ... by ... come on\n\nWe have so much fun last year with doing it again in the window and public radio second annual jazz baby Nineteen twenties holiday party Saturday December first at the hotel north happen get you're glad rags on and get your tickets today in the yard done that\nI find that's hot sauce ... a\nLot of the answer the phone or on a\nLot of the army\nAnd he resigned die in vain off do you do all kinds of screening lost my job and do the\n... yeah\nWhen he was still the same\nSide by side with a ... or an author to me as a\nLife skill or the guy the AC man saying\nOh man I mean I Love those the\nUh\nSeeing a call ... or\n...\nOh see a timeline moms who\nUh\nWho ...\nName nine or ...\nOh that's a\n... a and I thought oh man\nIt's almost as I said I said to me in\nNew York city oh\nOh I see a see God to be a school\nIn\nThe atmosphere the bus to school\n\nOh okay well I find them\nWe have so much fun last year we're doing it again in the window and public radio second annual jazz baby Nineteen twenties holiday party Saturday December first at the hotel north happen get you're glad rags on and get your tickets today in the yard done that\nAnd um we know that goes on as little\nMan and\nA ... to try to tell you the eastern side and on some on you I just I didn't know what I'm saying ...\nYeah\nWe are talking a huge fun 'cause I\nA last ditch hold to remain calm and\nI'm a ...\nA ... called me and the guy that's been done\nOn on the phone\nOh\nWhoa whoa whoa whoa see God I should be that would be any and\nAll that oh I see a tie call my mom and\nA phone to\nName\nTiger and ... man I mean yeah bombs\nGoing off to a\nMan and I thought oh man\nThat's one of those careers\nAnd fun to me and this man is\nYours yo yo\nThe a C a man I mean I'm\n\nJust saying well\nThis\nStreaming of New England public radio is funded by you and killing riddle architects a forty year legacy of commitment to community and design celebrating the next generation of leadership at ... riddle dot com [noise]\n\n\n\nAn impoverished couch working as an estate manager to the title character in the upper ... sings a gypsy song won the ends with a ... that was to curb it saw as tuxedo with the royal philharmonic orchestra conductor by Lucas she bought a bitch\n\nMm\nMm\nWe have so much fun last year we're doing it again in the window and public radio second annual jazz baby Nineteen twenties holiday party Saturday December first at the hotel north happen get you're glad rags zone and get your ticket today at NPR done\n\nMm\nMm\nMm\nMm Mm Mm\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\nMm Mm Mm\nMm\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu Mm\n\nMm Mm\n\nStreaming of New England public radio is funded by you and cute little architect of forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com\n[noise]\n\nWe have so much one last year we're doing it again the window and public radio second annual Jim this baby Nineteen twenties holiday party Saturday December first at the hotel north happen get you're glad reggaeton get your tickets today to you're done you\n\n\n[noise]\n[noise]\n...\nAnd\nWe had so much one last year we're doing it again in the window and public radio second annual Jim this baby Nineteen twenties holiday party Saturday December first to the hotel north happen get you're glad rags zone to get your tickets today at any time you're done\n\n\n[noise]\n\n[noise]\n\n\nDreaming of New England public radio was funded by ... rental architect oh forty year legacy of commitment to community design celebrating the next generation of leadership a cute little dot com [noise]\n[noise]\n\n\nStreaming of New England public radio was funded by you and they have university graduate schools and asked applied laboratory science that operation enrolling no for August twenty seven applications that they passed dot edu\nDon't know [noise]\n\n\n[noise]\n\n\n\nDon't read the conduct of the Gulf Newberg symphony orchestra in this week's number four\nStreaming of New England public radio is funded by un day path university graduate schools and as a in creative non fiction writing enrolling now for August twenty seventh applications that they pass dot edu\n\n[noise]\nMm\nStreaming up the ... public radio was funded by you add Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now would rolling fall gee CVS dot org [noise]\nWe had so much one last year we're doing it again in the window in public radio second annual jazz baby Nineteen twenties holiday party Saturday December first at the hotel north happen get you're glad rags zone and get your ticket today at NPR are done them\n[noise]\nMm\n\nStreaming of New England public radio is funded by us they path university graduate schools and asset applied laboratory science that operation rolling now for August twenty seven applications that they pass dot edu [noise]\n\n\nWe're so much fun last year we're doing it again in the window in public radio second annual jazz baby Nineteen twenties holiday party Saturday December first to the hotel north happen get you're glad rags zone or get your ticket today any you're done", "show_name": "Classical Music with Walter Carroll", "year": "2018", "city": "Amherst", "day": "24"}