{"month": "10", "state": "MA", "station": "WFCR", "content": "Streaming of New England public radio is funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall Gees easy S. dot org [noise]\n\n\n\n\n\n[noise] Francesco double dose conducted the philharmonic orchestra in the symphony number one in sci major by mood CEO Clemente\nDespite that number one this is actually a late symphony one of four he wrote after the age of fifty Clementi's earlier symphonies are mostly lost or they survived only in fragments\nGood afternoon I'm Walter Carol was today's classical music on New England public radio eighty eight five WFCR in Amherst\nW to six six eight W north Adams W two for two Eighteen Williams town W to nine one C. H. Pittsfield W to five to PG league and W. true five for a you great Barrington\nIn partnership with UMass Amherst we're on line that N. E. P. R. dot net for news throughout the day you can listen to the NPR News network\nAt ... am six forty and didn't Franklin County at Ninety One seven ...\nHere in eighty eight five at the end will hear a symphony by mental ... who's youthful string symphonies thankfully survive\nThe one we're here was inspired by a visit to Scotland will hear music for a string quartet by Charles Tom on some grip is which can also be hurting concert on friday it's almost to ...\nStreaming of New England public radio was funded by you and valleys solar a local company installing roof ground amounts and do all access trackers helping households live carbon free and the four one three valley solar dot seller\nConcerto number two we'll hear music by it ruin in celebration of Ninety fifth birthday and ... by ... Christian box and an hour you by Albert ... who was born two hundred Seventeen years ago today\nAnd we'll begin with music which can be hurting concert tomorrow it Smith College on the New England public radio Facebook page there's a link to information about tomorrow's music in the noon hour concert it features music by Beethoven and here's the work which will be on that program\nPianist Christian sacrifice joins the Sabina mind your wind ensemble Indyk quintet in each flat for piano in wins by Beethoven\n\n[noise] [noise] [noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gee C. V. S. dot org\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\nStreaming of New England public radio was funded by un June ... architects a forty year legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com [laughter]\n\n[noise]\n\n\n\n\n\n[noise]\nUm\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n[noise] [laughter]\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gee CVS dot org\n\n\n\n[noise]\n\n\n\n[noise] [noise]\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\nWe have so much one last year we're doing it again in the window and public radio second annual jet this baby Nineteen twenties holiday party Saturday December first moved to North to get your ... your tickets today any tiara done\nA\n\nA [noise]\nA non ...\n\n\n[noise]\n\n...\nKnow [noise]\n[noise]\n[noise]\n\n[laughter]\n\nOkay now you know\n\n\nThat's not something that\nKnow [noise]\n\nStreaming of New England public radio was funded by you and they passed university graduate schools and I asked in higher education administrator ... enrolling for October twenty second applications that they pass dot edu\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\nUh\n[noise]\nStreaming of New England public radio is funded by you and they had to go to ... graduate schools and asked and applied laboratory science that operation generally know for August twenty seven applications that they passed dot edu\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\nStreaming of New England public radio is funded by you and the hotel Northampton offerings six meeting at events bases from board room to ballroom with Avi equipment an inhouse catering hotel north Hampton\nDot com Christian sockeye is played the piano with this Sabina Meyer wind ensemble\nThat's the Clinton tax in each flat for piano and wins by Beethoven or work that you can hear in concert tomorrow at Smith College [noise]\nThis is one of their music in the noon hour concerts at Sweeney concert hall and on the New England public radio Facebook page there's a link to information about that concert and the performers\nComing up to Thomas Quasthoff sings lord sing the composer was born two hundred Seventeen years ago today\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu [noise]\n\n\n\n\n\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu [noise]\n\n\n\n\n\nStreaming of New England public radio was made possible by you know by the keys garage in Williamsburg offering foreign and domestic on the repairs yes these are defined technicians Massachusetts state inspections seek he's garage dot com [noise]\n[noise]\n\nStreaming of New England public radio was funded by un cute little architects oh forty year legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com\n\nBe for long\n\nEither what\nIs your muscles\nGet the money just to see these are all\nPretty much what I Would\nOn\nStreet\nWe had so much about last year with doing it again New England public radio second annual jazz Bebe Nineteen twenties holiday party Saturday December first at the hotel Northampton get you're glad rags on to get your tickets today at any T. R. dot net\n[noise] [noise]\n[noise]\n[noise]\n[noise] [laughter]\n[noise]\n\nI'm a complete ban Thomas Quasthoff with the orchestra of the ... of Berlin Chris genteel among conducting music by Albert ... that was ... you ... from the opera ... by lord sing\nThe marrow desired on and tells us about all the hard work he doesn't just how well he does it\nHe's a second Solomon or at least that's what he tells us\nThe composer Albert ... was born two hundred Seventy years ago today in Berlin in Eighteen oh one\nComing up we're wish conductor Lawrence Foster a happy birthday but music by Chapin next music which can be hurting concert on friday and fields Connecticut [noise]\nThis is New England public radio WFCR in Amherst Springfield in Hartford in partnership with the UMass Amherst and online at N. E. P. R. dot net\nDuring this hour you can listen to fresh air on the N. E. P. R. news network at ... am six forty northern Berkshire county at Ninety eight nine FM and online and eat P. R. dot net\nHere what eighty eight five FM you can hear music by hunter Christian by net drawn Chopin and Mendelssohn before all things considered beginning at for\nToday voter suppression tactics have changed but advocates say the goal is to to keep minorities from the polls how civil rights groups are working against apps that story and more on all things considered it begins at for jazz Ala mode begins at eight\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\nElections representing special programs on the any PR news networks exploring what matters most to voters around the country [noise] Monday through Thursday evenings joined Jonathan Tea Party as he hosts America on the line a national conversation with voters candidates activists and you\nAnd on Saturdays at noon it's the politics show NPR journalists speak with voters about critical issues for the mid term elections\nAll on the N e PR news network at ... am six forty one on one one FM in North Adams and online at N. E. P. R. dot net\nOn the New England public radio Facebook page there's a link to information about a concert at the ensemble ... is playing frightening in in ... Connecticut\nIt's a program Nicole Native Americans and impression is much of the music on the program is based on music of Native Americans and here's an example this is the Cyprus string quartets playing to sketch is based on the Indian seems by Charles Tomlin some Griffiths\n\n\n\n\nStreaming of New England public radio was funded by you had American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see ... the\n[noise]\n\nMm\n\n\n\n[noise]\n\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now we're rolling for fall gee C. V. S. dot org and\n\n\n\nNa\n\nNa\n\nNa\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\nStreaming of New England public radio was made possible by you know by the keys garage in Williamsburg offering foreign and domestic on the repairs AES Easter defined technicians Massachusetts state inspections she keeps garage dot com\n[noise] Mm\n\nNa\n\n\n\n\n\nNa\nNo no\n\nWe had so much fun last year we're doing it again and then when the public radio second annual jet this baby Nineteen twenties holiday party Saturday December first at the hotel no attempt to get your blood red zone to get your ticket today in the yard done\n\n\n\n[noise]\nNah\nStreaming of New England public radio was funded by ... June ... architect or to your legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n...\n[noise]\nWe have so much last year with the public radio second annual jet Nineteen twenties holiday party Saturday December first to get you ready to get your tickets today\n\nWe had so much fun last year we're doing it again in the window and public radio second annual jazz baby Nineteen twenties holiday party Saturday December first at the hotel no attempt to get your blood red zone and get your tickets today in the yard done\n\n\n\n\n[noise]\n\n\n\n[noise]\nStreaming of New England public radio was funded by June ... architects of the year legacy of commitment to community design celebrating the next generation of leadership a cute little dog call [noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\nWe had so much one last year we're doing it again in the window and public radio second annual jazz baby Nineteen twenties holiday party Saturday December first at the hotel no attempt to get your blood red zone to get your tickets today at NPR done that\n[noise]\n\n\n[noise]\n\n\n\n\nMm [noise]\n\n[noise] we had so much about last year we're doing it again New England public radio secondhand you'll just be be Nineteen twenties holiday party Saturday December first at the hotel Northampton get you're glad rags on to get your tickets today at N. E. T. R. dot net [noise]\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n\n\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at events bases from board room to ballroom with Avi equipment an inhouse catering hotel north Hampton dot com\n\n\n\n\n\nThat was Sopranos Susan Graham seeing how they lose ya bye And ed roar I'm with pianist Malcolm marching though before that we heard tenor titled ... it's lucky and Glenn piano\n... setting of stopping by the woods on a snowy evening and we began with Nathan guns singing early in the morning with Kevin Murphy piano\nToday's the Ninety fifth birthday a net roar him he was born in Richmond, Indiana in Nineteen twenty three [noise]\nComing up a recording of the Scottish symphony by Mendelssohn next another new recording this one a music by Johan Christian boss\nI'm Walter Carol this is New England public radio WFCR in Amherst Springfield in Hartford in partnership with UMass Amherst into online at N. E. P. R. dot net\nDuring this hour you can listen to international news on the world on the any PR news network at ... am six forty had been southern ... county at eighty nine five if\nYou're an eighty eight five we have another hour of classical music than on all things considered\nVoter suppression tactics have changed\nBut advocates say the goal is still to keep minorities from the polls how civil rights groups are working against that that story and more on all things considered beginning at for jazz Alamo begins H classical music returns at eleven\nAnd the final weeks before the mid term elections representing special programs on the ... and eat PR news network\nExploring what matters most to voters around the country\nMonday through Thursday evenings joined Jonathan Capehart as he hosts America on the line for a national conversation with voters candidates activists and listeners and on Saturdays at noon will present the politics show in which NPR journalist\nWe had so much about last year with doing it again New England public radio secondhand you'll just be the Nineteen twenties holiday party Saturday December first at the hotel north pets and get your blood red zone get your tickets today at NPR dot net\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\nStreaming up the waitlist public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts do now with rolling fall gene C. V. S. dot org\n\n[noise]\n\n\n\nMm\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu [noise]\n\n[noise]\n[noise]\n\n\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gee CVS dot org [noise]\n\n\n\n\n\nStreaming of New England public radio was funded by you and they sat university graduate schools and I asked in higher education and a stray shots at rolling for October twenty second applications that they pass dot edu [noise]\nMm\n[noise]\nStreaming up New England public radio was made possible by you know by the keys garage in Williamsburg offering foreign and domestic under Paris and he asked each certified technician Massachusetts state inspection she keeps garage dot com [noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\nWe had so much about last year with doing it again New England public radio second annual jazz baby Nineteen twenties holiday party on Saturday December first at the hotel Northampton gig you're glad rag Jonah get your tickets today at any T. R. dot net\n\n\n\nWe have so much last year we're doing it again New England public radio second annual jet this baby Nineteen twenties holiday party Saturday December first to the hotel north happen get you're glad rags zone to get your ticket today at any time you're done\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall Gees easy yes dot org\n\n[noise]\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology A. I. C. dot edu [noise]\n\n\n\n\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting on the bench bassist Ron board room to room with a the equipment and again house catering hotel north Hampton dot com\n\n\nOh no no no no no no", "year": "2018", "show_name": "Classical Music with Walter Carroll", "city": "Amherst", "day": "23"}