{"month": "10", "state": "MA", "station": "WFCR", "content": "To to join in and go to an E. P. R. dot net or call us at eight hundred six three nine eight eight five zero you're listening to New England public radio\nWFCR in Amherst Springfield in Hartford in partnership with UMass Amherst and online at N. P. R. dot net all sorts\nStreaming of New England public radio is funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gene CVS dot org\nOn C. H. Pittsfield W to five to be G Lee and W. to five for a new great bearings and\nI have another place on the Internet to uh refer you to and that is to the New England public radio Facebook page where you'll find a link to information about a concert being held in lick bill Connecticut\nThat's where the great hearts according to one to learn ... ended up a ... and she when she immigrated to this country\nShe lived in lake bill Connecticut and now there is a concert this weekend\nThat is in memory attributes memorial tributes to the great ...\nWith music by bus and more in the details are there on that link\nTo the um ... new to this concert information and here is music by bought for ... in this case it for her to court and orchestra\nThe concerto number six in ... major by box with Tony ... who is the hearts accords total was and conductor\nOf the I'm stardom baroque orchestra [noise]\nStreaming of New England public radio was funded by you and American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see da da da\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see the\nStreaming of New England public radio was funded by ... Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for full Gees easy yes dot org [noise]\nNa\n\nStreaming of New England public radio was funded by you added American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu [noise]\nSo now is the time to become a member\nIf you've been listening to us since Nineteen sixty one you've grown up with us or you've grown into it don't wait hop on the phone right now one eight hundred six three nine eighty five zero or online at any P. R. dot net\nHow about a gift of thirty forty or fifty dollars a month and if you make that contribution right now will enter you in to our Hamilton contest\nIt'll be a special day in Boston from New England Public radio we have two seats to give away this afternoon after all things considered to the Broadway musical Hamilton when it comes into town to the Boston opera house\nThat will be on Saturday October thirteenth a matinee and then we'll send you off to dinner at eastern standard kitchen so don't wait eight hundred sixty nine eight eight five zero or online at any P. R. dot net\nNow when you're asking people to hop on the telephone our visions of doctors and all of these kids who who instead of hopping on top are hopping on on some sort of just gives me that that vision in the head ... ... once you've done that [laughter]\nPick it up and dial eight hundred six three nine five zero or please go to an NPR dot net put your fingers down on the keyboard and get an ... P. R. dot net and bring that website up and the donations a button that you'll find right there prominently displayed\nThat will take you to a page where you can fill up a little form say how much would like to give and answer a couple of other questions and then you're done you're in a row doesn't take very long does it nope nope not at all\nYou can join Walter and I we are both ... not only do we work here at New England public radio but we support keeping classical music on the air because it is something that we are both\nStreaming of New England public radio is funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gee C. V. S. dot org\nAnd John and Walter and Steve because they gave me the stories behind the music that I'm listening to and that carry to classical music it's something that you can only get here in your local community college right now one eight hundred sixty nine eighty five sterile or jump online at any P. R. dot net\nAnd jumping again I'm [laughter] happening ... jumping that's that's really good okay hop jumped skipped do what you need to do to get to the telephone or to the computer and make that contribution that eight hundred six three nine eight eight five zero or N. E. P. R. dot net\nNeed classical music maybe I don't know if it's necessarily as big a part of your life as it has been of mine but when I was about ten years old I actually heard ... playing\nIn the er at the Indianapolis public library [noise] who's that must mean phenomenon it was a phenomenal kind of thing and I was too young to appreciate it the way that I Would now\nBut I've heard I've heard Tom ... playing a an organ in a church in Amsterdam and I've also heard him at Boston symphony hall conducting the the BSO in music by Bach\nAnd it's the music is a wonderful wonderful item that comes all the way through my life it may have been all the way through your life it has it has absolutely and you the listener as what part does he play in your life\nIf it's an important part too you please make sure that you can continue to hear great classical music on the air at N. E. P. R. dot net or call us at eight hundred six three nine eight feet five zero I'm Talking too long it's time to get back to music\nAnd here are the Boston symphony Chamber Players with a transcription by Arnold ... of us both spy Johann Strauss junior does his roses from the south oh\nStreaming of New England public radio was funded by un valley solar local TV designed the installation helping household secure state or federal incentives and live carbon free and the far one three valleys solar dot solar\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gene C. V. S. dot org\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\n\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional education business health sciences psychology A. I. C. dot edu [noise]\n\n\n[noise]\n\n\nEnter into into tickets to Hamilton from an e P R you could win two great seats at the Boston opera house and dinner afterwards the eastern standard\nAnd you're now in any P. R. dot net\n\n\n\n\n\n\n\n[noise]\nStreaming of New England public radio is funded by you had the hotel Northampton offering six meeting at the vet spaces from board room to ballroom with a the equipment and again house catering hotel north Hampton dot com\n\n\nStreaming of New England public radio was made possible by you and by the keys garage in Williamsburg offering foreign and domestic on the repairs AES Easter defined technicians Massachusetts state inspections she keeps garage dot com [noise]\n\n\n\nMm\nMm [noise]\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu [noise]\n\n[noise]\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional education business health sciences psychology hey I see ... the\n\n\n\n\n\nOoh [noise]\nMm Mm\n\n\n\nStreaming of New England public radio was funded by you and valleys solar local PV design at the installation helping household secure state or federal incentives and live carbon free and the far one tree valley solar dot solar\n\n\n\n\n\n[noise]\n\nStreaming up the waitlist public radio was funded by you Greenfield commonwealth virtual school public odd like K. to twelve school personalized education for Massachusetts do that with rolling fall gene C. V. S. dot org\n\n\nMm [noise]\n\n\n[noise] um\nMm\n\nRadius to senior he'd be telling the truth they really wouldn't be a costume but it's a great way to show your support for the station and had a Halloween costume at the same time so call if now one eight hundred sixty nine eighty five zero or online at any P. R. dot net\nThose tongues you heard just a minute ago were the test of a national emergency alert system usually a once a week I or one of the other colleagues at the radio station at some point during the broadcast week\nWe we're required to test the emergency alert system and that's what has just been done but it's been done on a national basis so thank you for your agents through [laughter] thank you for your patients through that\nAnd thank you for your contributions eight hundred six three nine eight eight five zero or N. E. P. R. dot net classical music on New England public radio is funded by you and by paradise city arts festival\nTwo hundred fifty jury to artists and makers from across America this coming weekend at the three county fairgrounds in North Hampton paradise city arts dot com and buy a gift from the Richard ... fund at the Hartford foundation\nFor public giving this Friday\nAt Smith College at the Arcadia players are doing an old Mozart concerts they Jupiter symphony and I believe it's also a piano concerto of the\nUh ... that is on that's concerts um and yes a Mozart piano concerto is on the concert and\nI'm On the New England public radio Facebook page you'll find a link to information about that concerts\nHere we have a recording of a concert performance by the Arcadia players baroque orchestra and chorus Margaret or when Brandon was the conductor in this concert performance of the chorus ... from rocket house price at the time and that's the opening course from the Christmas oratory you Bye bye\n[noise]\nStreaming of New England public radio was funded by un cute little architect of forty year legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com\n\n\n\n[noise]\nInterviewing two tickets to Hamilton from an e P R you could win two great seats at the Boston opera house and dinner afterwards the eastern standard\nAnd you're now in any P. R. dot net\nOf on\n...\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology hey I see dot edu [noise]\n\n\n\n[noise]\nStreaming of New England public radio is funded by un day path university graduate schools MSA in creative non fiction writing enrolling now for August twenty seventh applications at bay past dot edu [laughter]\n[noise]\n\n\n[noise]\n[noise]\n\nOh\n\n\n[noise]\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gene C. V. S. dot org [noise]\n\n[noise]\n\n\n[noise]\n\nMm\n\nNah nah\nNah\n\n[noise]\nStreaming of New England public radio was funded by you when they pass university graduate schools and I say in creative non fiction writing enrolling no for August twenty seven applications at bay paths dot edu [noise]\n[noise]\n\n\n[noise] [noise]\n\n[noise] and ... tickets to Hamilton from an e P R you could win ... seats at the Boston opera house and dinner afterwards that eastern standard answer now in any P. R. dot net\n\n\n\n\n\n[noise] ... shots played the violin Benjamin angle ie the piano and that's where the the twelve variations on ... ... from the marriage of Figaro I Mozart as a marriage of Figaro spy Mozart of course the variations whereby Beethoven\nYou can hear three Beethoven's sonata it's for piano and violin\nThe piano from the Frederick collection of historical piano so it's from the period that said these Samantha's were written and that concert is Sunday at the ... community church part of the historic piano concert series\nUsing canals from the Frederick historic piano collection on the New England public radio Facebook page I posted a link to information about that concert\nThis is New England public radio eighty eight five WFCR I'm Walter Carol here with reading the dial and we're here to ask you to support the radio station that brings you music by Beethoven upper is by myths art\nAnd music by Greek music that Greek coming up in just a moment followed by ... and more\nAre Joshua Bell plays ... Chrysler later\nStreaming of New England public radio is funded by you and killing riddle architect or for the year legacy of commitment to community a design celebrating the next generation of leadership acute riddle dot com\nSo please be a contributing listener dumped just or listener to New England public radio if you enjoy the classical music that you hear please help pay for it and he PR dot net or eight hundred six three nine five zero\nI Am looking forward to that Joshua Bell peace and if you're like me a fan of classical music\nWhy don't you pay for what you listen to won't you become the newest member of the N. E. T. our family you can do so by going online at any PR dot net or calling us at one eight hundred sixty nine eight eight five zero and we need you to call right now so you you don't miss out on our Hamilton contest\nThis afternoon after all things considered we will be picking the winner to the Hamilton contests and what is that contest\nTwo tickets to see the Broadway smash hit Hamilton when it comes to the Boston opera house on Saturday October thirteenth for the matinee show and then we will send you to a wonderful dinner at eastern standard kitchen and drinks\n\nAnd you're doing two tickets to Hamilton from and BP are you could win two great seats at the Boston opera house and dinner afterwards that eastern standard and you're now in any P. R. dot net\n\n\n\n\n[noise]\n\n[noise]\n[noise] [noise]\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gee C. V. S. dot org [noise]\n[noise]\n[noise]\n\n\nBut [laughter] you know\nFrom all the\nStreaming of New England public radio was funded by un bay path university graduate schools MSA and creative non fiction writing enrolling no for August twenty seven applications at bay past dot edu [noise]\n\nUm ... applause is for the Springfield symphony orchestra Kevin roads conducting a sweet from ... or ...\nSpringfield symphony orchestra new concert season has just begun and New England public radio would be happy to put you into the seats for one of the concerts for this season as our way of saying thank you for your contribution of Fifteen dollars a month to New England public radio\nGo to any NPR dot net or called eight hundred six three nine five zero to make that your contribution\n... England Public radio WFCR in Amherst Springfield in Hartford in partnership with UMass Amherst and online at N. E. P. R. dot net on Walter Carol ...\nThat donations have been coming in Welter and it's so wonderful to see that our goal is going down we still have fifty five thousand four hundred dollars left to raise a will you help us pay for what you listen to become the newest member of any PR\nGo on line right now at NPR dot net or call one eight hundred six thirty nine eighty five Daryl and guess what if you call us right now or jump on line right now we will enter you into our Hamilton contest we had two tickets to give away\nFor the Broadway hit Hamilton that will be on Saturday October thirteenth a matinee performance at the Boston opera house and then we'll even treat you told wonderful dinner at eastern standard\nInterviewing two tickets to Hamilton from an e P R you could win two great seats at the Boston opera house and dinner afterwards that eastern standard answer now in any P. R. dot net\nThere will be picked today this afternoon actually after all things considered so call us at eight hundred six thirty nine eight eight five zero or online at any P. R. dot net\nJoined Mary from ... to listen to all the time she's glad that it's their way you're listening concern from Greenfield is has called in and Darren from ... Connecticut says he enjoys the show's during my commute or when I'm at work\nAnd we even have a donor from ... to likes the variety of news sources those are just a few of the listeners who have\nHave phoned in at eight hundred six three nine eight eight five zero or who've made contributions online at an E. P. R. dot net\nThank you very much if you have made that contribution and if not if you haven't done that yet and I was a great time to do with eight hundred six three nine eight eight five zero or an E. P. R. dot net\nYou just have what is it about two two and a little more than two hours left to get yourself into the drawing for a pair of tickets to see Hamilton on the thirteenth Saturday the thirteenth it's in Boston and New England public radio is giving away a pair of tickets for that\nEight hundred six three nine eight eight five zero or an E. P. R. dot net\nThis is listener funded New England public radio and if this is your first time listening welcome would you like to become the newest member of New England public radio join our family with a gift of five dollars a month at ten dollars a month or Fifteen dollars a month\nAnd if you join in as a sustain her and why did we call us sustain or because you give us a little bit each month and you sustain the programs that you listen to on the air\n\nInterviewing two tickets to Hamilton from an e P R you could win two great seats at the Boston opera house and dinner afterwards the eastern standard\nAnd you're now in any P. R. dot net\n\n\n\n\n\n[noise]\nStreaming of New England public radio was funded by you advocate that university graduate schools MS and higher education administration enrolling for October twenty second applications that they pass dot edu [noise]\n\n\n\n\nStreaming of New England public radio is made possible by you and by the keys garage in Williamsburg offering foreign and domestic other repairs AS these are defined technicians and Massachusetts state inspections seek he's garage dot com\nThe Academy of St Martin in the fields ... conducting the barber of Seville the overture to the barber of Seville music piracy me before that we heard Claudio above conducting the chamber orchestra of Europe with base\n... Monday singing like common loon yet from the barber of Seville that's ... recommendation that Dr bar too low spread false rumors about ... almost ...\nWho's courting ... ward Rosina burglar wants to get the count out of the way so he can marry Rosina and her money\nThat's music from ... barber of Seville and by the way you can see a performance of barber of Seville the Boston lyric opera will be opening its new production of Barbara on the fourteenth\nOf this month on the Sunday Sunday the fourteenth of October and\nThis is New England public radio eighty eight five WFCR in Amherst Springfield in Hartford in partnership with UMass Amherst and online that N. E. P. R. dot net\nAnd I should mention of course the reason for playing this actually was to say happy birthday to a general rule Monday he was born in Vilonia Italy in Nineteen forty one\nComing up next to Joshua Bell playing music by Fritz Chrysler\nAnd we have music by Percy Granger as well before four o'clock in time for all things considered now\nThat I mentioned the fourteenth of October that's when barber of Seville opens but the thirteenth of October is the day that you might be going to see Hamilton in Boston also in Boston in at the Boston upper house and that is our\nThat ... will be contested remote you tell about\nSo it is a big day in Boston that you can wind from New England Public radio we have two great seats at the Boston upper house when Hamilton comes into town the hottest show ever on Broadway is hitting the road and you can see it on Saturday October thirteenth\nToo great seats at the Boston opera house that's a matinee performance and then afterwards we\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a ... D you\nTime is running out if you're interested in this contest you needed jump on the phone or jump on line\nTo enter that I'm into that contest one eight hundred six three nine eight five zero or an E. P. R. dot net now you don't have to make a gift to enter that contest but while you're there how about giving us the gift pay for what you listen to we will be a draw up\nWe will be picking the winner of this a wonderful Hamilton contests this afternoon after all things considered again one eight hundred sixty nine eight eight five zero or N. E. T. R. dot\nNet you're paying for that great performance of ... and the uh the terrific overture to the barber of Seville you're paying for Joshua Bell playing Chrysler we've heard music by a handle and Boston Vaughan Williams over the course of the afternoon\nAnd that is paid for as well by the contributions of our listeners so please go to U. P. R. dot net\n... eight hundred six three nine five zero and be sure that\nYou are a one of those listeners who is a supporter of New England public radio perhaps assisting are giving ten or Fifteen or forty dollars a month to pay for the music that you enjoy eight hundred six three nine five zero or in a PR dot net\nOne of the benefits of classical music Walter is as you know it brings back memories and so as we were just listening to Barbara Seville I was remembering childhood of watching Bugs Bunny cartoons on a Saturday morning and why because in Nineteen fifty Warner Brothers released the\nTheatrical cartoon short rabbit of Seville one of my favorite Bugs Bunny cartoons and why animation plus classical music of course it's one of the reasons why I still listen to the New England public radio and listen to classical music\nWon't you joined me in being as a ... for this station pay for what you listen to NPR dot net or call us at one eight hundred sixty nine eight five Sarah\nResponsible for so many people learning about classical music those great cartoons that featured classical music and and put Bugs Bunny into\nStreaming of New England public radio is funded by you and they passed the university graduate schools MS and applied laboratories ... operations enrolling now for August twenty seventh applications at bay paths dot edu\nAnd crazy right along with the music it was a wonderful way of learning about classical music I Know for a fact for to my colleague John the wacky is another great Bugs Bunny fan [laughter] cause that was one of his means of being introduced to classical music\n\n\n[noise]\n\n\n\n\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at a vet spaces from board room to ballroom with Avi equipment an inhouse catering hotel north Hampton dot com [noise]\n\n\n\n\n\n\nMuch miniature to view was Joshua Bell played the violin Polk coke or the piano and music by Fritz Chrysler we also heard Fritz Chrysler's leaves Freud and leave is light\nI'm Walter Carol this is linked in public radio eighty eight five WFCR with music by proceed Granger coming up next but we have a little bit of time before we get there to say please help us out\nPlease help pay for the classical music that you hear on New England public radio were a listener supported public radio station Ninety percent of our operating budget\nComes from our listeners and from the businesses that underwrite they come from the community of people who support New England public radio\n... be part of that community please go to any P. R. dot net or called eight hundred six three nine eight eight five zero to make a contribution in support of classical music [noise]\nNinety percent of our funding comes from you so if you've been listening a while but haven't jumped in to become a member yet of the any PR family how about getting so right now become the newest member of become the newest is Tina ... one eight hundred sixty\nStreaming of New England public radio is funded by Ewan bay path university graduate schools and a creative non fiction writer enrolling no for August twenty seventh applications at ... dot edu\nAnd when you make a gift right now we will enter you into the Hamilton contests will be picking the winner to that Hamilton contest\nIn a couple of hours at the end of all things considered we'll be\nMake will be picking that winter so that's two tickets to see the Broadway show Hamilton when it's at the Boston opera house on Saturday October thirteenth a matinee show and then we'll send you to a wonderful dinner at the eastern standard kitchen in Ken more square don't wait\nYou'll miss out so joining us now on line at any P. R. dot net or call us at one eight hundred sixty nine eight eight five zero\nJared from Connecticut says that he has an emotional dependence on WFCR as classical music and as addictions go it's the best kind I like that and ... and indeed if you're going to have an addiction classical music is a fun yes indeed\nSo and Robert from North Adams says that the overnight classical music is excellent I I agree Peter undergrad was very good\nI Love that a little bit of a history of the peace and composer is shared so please join them\nWith your contribution it and eat PR dot net or eight hundred six three nine eight eight five zero\nThat overnight music that we provide I called up the concert in my pajamas on it it it's a lovely way to fall asleep it really is so\nPay for what you listen to are are you addicted to classical music and to listening to the station do you wake up with us and listen to the news and then\nListen to John and Walter give you classical music throughout the day if so pay for what you listen to\nBecome the newest member of the N. E. T. R. family call us at one eight hundred six three nine eight five zero or online at N. E. P. R. dot net how about a gift of\nTwenty dollars a month or forty dollars a month or fifty dollars a month whatever works in your budget and it'll only take a couple of minutes to make that pledge at end or payment happen any PR dot net or eight hundred sixty nine eight eight five Sarah\nAnd for the forty dollar among the contribution we could think you with a Mason jar review and there's a radio\nStreaming of New England public radio is funded by you and de path university graduate schools and as a in creative non fiction writing enrolling now for August twenty seventh applications at bay pest dot edu\nThey're off a ... it's just going to say all things considered no not yet not yet another Fifteen minutes [laughter]\nThat's a New England public radio is what is there it's got to its own little antenna it's a battery operated thing\nAnd you know a terrific little thank you gift at the forty dollar a month level for New England public radio your contribution of that forty dollars can be made at N. E. P. R. dot net or eight hundred six three nine eight eight five zero what ever level of giving that you choose\nThan you are going to be thanked with all of the classical music that you've heard so far this afternoon you've heard some box\nAnd some Strauss ... Williams Greek and there's Chrysler Beethoven and proceed Granger coming up all of that made possible by contributions from our listeners\nPlease make your contribution at any P. R. dot net or eight hundred six three nine eight eight five zero\nFifty four thousand five hundred dollars left to raise before friday morning won't you how do your part\nNinety percent of all of our funding comes from you our community paper let you listen to become the newest member of an e PR call us at one eight hundred sixty nine an eight five zero or online at N. E. P. R. dot net\nClassical music on New England public radio is funded by you and by paradise city arts festival\nTwo hundred fifty jury the artist and makers from across America this coming weekend up to three county fairgrounds in North Hampton paradise city arts dot com\nBy the Hartford symphony orchestra celebrating its Seventy fifth season opener with pictures at an exhibition with Carolyn climate conducting October fifth through the second sevens\nHartford symphony dot org and buy a gift from the Richard ... found that the Hartford foundation for public giving\nHere's the month of very choir and the English country gardener or ... or district John Elliott Gardner was there a conductor and here's the scotch stress speed and real by Percy Granger\n[noise]\nStreaming of New England public radio is funded by you and the hotel or Santa offering six meeting at the basis for a board room to room with a the equipment and the house catering hotel north Hampton dot com [noise]\n\n", "year": "2018", "show_name": "Classical Music with Walter Carroll", "city": "Amherst", "day": "03"}