{"month": "10", "state": "MA", "station": "WFCR", "content": "Streaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gene C. V. S. dot org\n\n\n\nStreaming New England public radio was funded by ... architect or to your legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com yeah\nA\n... ... more than eleven hundred lifters joined the any PR family last week thank you so very much if you didn't get a chance to step up you can join anytime by making a contribution at our website any P. R. dot net ... thank you very much\n\n[noise]\n\n... ... more than eleven hundred lifters joined the any PR family last week thank you so very much if you didn't get a chance to step up you can join anytime by making a contribution at our website any P. R. dot net ... thank you very much\n[noise]\nStreaming of New England public radio was funded by un valley solar a local photovoltaic designed to the installation company serving people and plan up to live carbon free and the four one three valleys solar dodge solar Mm\n\n\n\n[noise]\n\n\nStreaming up New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students that were rolling for fall gee C. V. S. dot org [noise]\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at the vet spaces from board room to ballroom with a the equipment and again house catering hotel north Hampton dot com\n[noise]\n\n\n\n[noise]\nDreaming of New England public radio was funded by ... riddle architect of forty year legacy of combat but to community design celebrating the next generation of leadership vacuum read all dot com [noise]\n\n\n\n\n\n\nYeah oh\nStreaming of New England public radio was funded by you when they pass university graduate schools MSA in creative non fiction writing enrolling now for August twenty seven applications that they passed dot edu [noise]\n[noise]\n\n[noise]\n\n\n\n\nUh [noise]\n\nUh\n\nStreaming of New England public radio is funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gee C. V. S. dot org [noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n[noise] ...\n\n\n[noise]\n[noise]\n[noise]\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology A. I. C. dot edu\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise] [noise]\n[noise]\n\nUm\n[noise]\n\n\nStreaming of New England public radio is funded by you and they path university graduate schools and asked and applied laboratory science that operation San rolling now for August twenty seven applications at ... dot edu [laughter]\n\n[laughter]\n\n\n\n[noise]\n\n\n[noise]\n\nMm\n\nMm\nMm\n\n[noise] [noise]\n\n\nUh\nStreaming of New England public radio was funded by un valley solar a local photovoltaic designed at the installation company serving people aunt planet to live carbon free and the four one three valleys solar dodge solar\n[noise]\n[noise] [noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\nMore than eleven hundred listeners joined the any PR family last week thank you very much if you didn't get a chance to step up you can join anytime they making a contribution at our website any PI dot net thank you very much\nKing clarinet Tony hosted horn Graham sheen bassoon playing the quintet for piano and wins open sixteen by Beethoven\nComing up our second Strauss waltz of the afternoon next guitarists David Russell plays music by Enrique ...\nLike Walter Carol and this is New England public radio WFCR Amherst Springfield in Hartford in partnership with UMass Amherst ended N. E. P. R. dot net\nDuring this hour you can listen to fresh air on the N e PR news network at ... am six forty and any P. R. dot net and hear what eighty eight five FM you can hear music by ... by and sent sons before all things considered\nBeginning at for Spanish pianist and composer Enrique Granada was one of the great pianist sub the leap nineteenth and early twentieth century after study in Barcelona he spent the time in Paris studying at the conservative part with the famous piano teacher ... Dario\nGranada ... compositions were based on a folk traditions of Catalonia and Spain and here's one of his early works written for piano but played here in an arrangement for guitar this is David Russell playing the ball sports it cos of Enrique for not us\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStreaming up New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling fall gee C. V. S. dot org\n[noise] [laughter]\n\n\n\n[noise]\n\n\n[laughter]\n[noise] [laughter]\n[noise]\n\n[noise]\n\n\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at the vet spaces from board room to ballroom with Avi equipment and again house catering hotel north Hampton dot com\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStreaming up the waitlist public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gee C. V. S. dot org [noise]\n\n\n\n\n\n\n\n\n\nStreaming of New England public radio is funded by you when they pass university graduate schools and asset applied data science enrolling for October twenty second applications at bay paths dot edu [noise]\n\n\n\n\n\n\n\n\n[noise]\n[noise]\nStreaming of New England public radio is funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall GCE the S. dot org [noise]\n\nSoprano naturally just say sang ... or voices of spring by Johann Strauss junior a well written for a benefit concert for the emperor ... Elizabeth foundation for the support of Austria Hungarian subjects in light sink\nThe voices of spring include the lark for nightingale the warm breezes over the meadows spring voices sounding like home [noise] Michael shouldn't violent conducted the Berlin Philharmonic\nComing up Richard II garb plays a part teacher by bus next ... conducts the Boston symphony orchestra in music by Dmitri shots to coach\nThis is a New England public radio in Amherst and Springfield at eighty five in Williams town at Ninety six three and online at N. E. P. R. dot net\nAt the Grammy Awards in twenty sixteen and twenty Seventeen awards for best orchestra performance went to the Boston symphony orchestra conducted by ... two years in a row both recordings are from the same series it's called Shuster coverage in the shadow of styling [noise]\nFirst it was for the ... recording of the symphony number ten and then the second toward came for the center for these numbers five eight and nine\nIn Nineteen forty five shots to coach told the public that he was at work on a symphony of victory a song of praise anticipating the imminent successive Soviet forces in fighting the Nazis\nBut the symphony number nine turned out to be much shorter than the monumental work that most people were expecting it's filled with characteristic humor of Dmitri Shuster Povich\nHe was under still since conducting the Boston symphony orchestra in the symphony number nine by stress to coach\n\nStreaming up the ... public radio was funded by you add Greenfield commonwealth virtual school public online eight to twelve school personalizing education for Massachusetts students now would rolling for fall genes CVS dot org\n[noise]\n\nWe're\n\n\n\nDreaming of New England public radio was funded by you when you read all architect of forty year legacy of commitment to community design celebrating the next generation of leadership vacuum red dot com [noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional and education business health sciences psychology hey I see dot edu\n\n\n\n\n\n\n\nAnd\nNa\nNa\nNa na\nNa\nNa\nNa\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology A. I. C. dot edu\n[noise]\n\n\n\nNa\n\n\n\n\n\n\n[noise]\n\n\nStreaming of New England public radio is funded by you and they pass university graduate schools and asks and applied laboratory science that operation San rolling now for August twenty seven applications that they passed dot edu\n\n\n\n[noise]\n[noise]\nStreaming of New England public radio was funded by un valley solar a local photovoltaic designed to the installation company serving people and wound up to live carbon free in the ... won three valleys solar Dopp solar\nStreaming of New England public radio was funded by you and they got the university graduate schools and asked an applied laboratory science that operation rolling now for August twenty seven applications that they perhaps dot edu and\n\n... ... more than eleven hundred lifters joined the any PR family last week thank you so very much if you didn't get a chance to step up you can join anytime by making a contribution at our website any P. R. dot net ... thank you very much na\n\n... ... more than eleven hundred lifters joined the any PR family last week thank you so very much if you didn't get a chance to step up you can join anytime by making a contribution at our website any P. R. dot net ... thank you very much\n\nStreaming of New England public radio was funded by ... riddle architect or to your legacy of combat but to community design celebrating the next generation of leadership a cute little dot com [noise]\n\n\n\n\nMm Mm\n... ... more than eleven hundred lifters joined the any PR family last week thank you so very much if you didn't get a chance to step up you can join anytime by making a contribution at our website any P. R. dot net ... thank you very much\nOur\nAnd and then there was never meant that doesn't\nIn the end of the\n\nStreaming of New England public radio was funded by ... riddle architect oh forty year legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com\nMm\n\n\nNo no\n\nNo no\nNo\n\nNo no\nNo no more\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\n\n\n\n\n\n...\nStreaming of New England public radio is funded by you and the hotel or Santa offering six meeting at the bench basis for a board room to ballroom with Avi equipment and getting house catering hotel north Hampton dot com\nSince ... written to his publisher that the third movement with either bring the audience to tears with its emotion or it would put them to sleep and that the final movement would wake up anyone who'd been put to sleep\nComing up in just a moment we have music by regard Strauss end at four o'clock it will be time for all things considered on New England public radio in Amherst in Hartford at eighty eight five in great Barrington at Ninety eight seven and online at N. E. T. R. dot net\nBecause Strauss in Nineteen forty six began to work on what turned out to be his final purely instrumental piece the direct concertina for Sudan clarinet an orchestra\nHe wrote that year to his old friend ... been principle but as soon as for the Vienna Philharmonic that he was working on a double concerto I'm thinking of bird houses beautiful tone\nHe did it came to the work to Brooke Hauser and then the second letter he joked that the piece was about a dancing princess who was surprised by the ... of a beer in grotesque imitation of her but she gradually winds over the creature and dances with it where upon it turns into a prince\nHere's Thomas freely clarinet and close to them on the soon with my T. S. S. Parker conducting the Lausanne chamber orchestra playing the direct concertina by regard Strauss [noise]\n... ... more than eleven hundred lifters joined the any PR family last week thank you so very much if you tend to get a chance to step up you can join any time by making a contribution at our website any P. R. dot net thank you very much\n\n\n\n... ... more than eleven hundred lifters joined the any PR family last week thank you so very much if you didn't get a chance to step up you can join anytime by making a contribution at our website any P. R. dot net thank you very much\nSo or\nOr or [noise]\nOr\nOr\n\n\nNa na\nNa na\n\n\n\n\n\n\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology A. I. C. dot edu\n\nOh oh", "show_name": "Classical Music with Walter Carroll", "year": "2018", "city": "Amherst", "day": "05"}