{"month": "10", "state": "MA", "station": "WFCR", "content": "All through the week all around the year eight hundred six three nine eight eight five zero or N. P. R. dot net this is New England public radio WFCR\nScreening of New England public radio was funded by you and they pass university graduate schools MS in higher education administration enrolling for October twenty second applications that they pass dot\nEdu and that N. E. P. R. dot net also W to six six eight W north Adams W true for two eighty Williamstown W to nine one C. H. Pittsfield W to five to be G Lee and W. to five for a you great Barrington\nWill start off our afternoon of classical music with Eduardo Fernandez playing the guitar and ... Garcia sin CEO conducts the English chamber orchestra and music by the Mexican composer men will pump say does she's ... concerto do sewer [noise]\n\n\n\nInterviewing two tickets to Hamilton from an e P R you could win two great seats at the Boston opera house and dinner afterwards the eastern standard\nAnd you're now in any P. R. dot net\n\nInterviewing two tickets to Hamilton from an e P R you could win two great seats at the Boston opera house and dinner afterwards the eastern standard\nAnd you're now in any P. R. dot net\n\n\n\nNo no no\n\n\nEnter to win two tickets to Hamilton from an e P R you could win two great seats at the Boston opera house and dinner afterwards the eastern standard\nAnd you're now in any P. R. dot net\n\nNa na\n\n\n\nMm Mm Mm\n\nStreaming of New England public radio was funded by un valley solar a local photovoltaic designed to the installation company serving people and wound up to a live carbon free and the four one three valleys solar dot solar [noise]\n\n\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall Gees easy S. dot org\n\n\n\n\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at events bases from board room to ballroom with Avi equipment an inhouse catering hotel north Hampton dot com [noise]\n\n\nEduardo Fernandez was the guitarist and ... cents C. O. conducted the English chamber orchestra that's ... by ... say\nComing up all celebrate the eighty fifth birthday a French conductor Michelle plus home with the sweet ... saw by ma yo and next we'll go fishing\nThe queen ... by ... I'm altered Carol this is New England public radio in Amherst in Hartford at eighty eight five in great Barrington at Ninety eight seven and online at N. E. P. R. dot net\nClassical music on New England public radio is funded by you and by WFCR partners Amherst New Hampshire Mount Holyoke in Smith colleges at the University of Massachusetts Amherst\nBy the Hartford symphony orchestra celebrating its Seventy fifth season opener with pictures at an exhibition with Carolyn clung conducting October fifth through the seventh Hartford symphony dot org\nAnd ... who helped bring you classical music with small reliable contributions every month [noise] please become one of them a contribution of ten twenty forty dollars a month at N. E. P. R. dot net or eight hundred six three nine eight eight five zero\nIt's your contributions which make it possible to bring you classical music here at eighty eight five FM\nListener contributions and support from area businesses makeup Ninety percent of the New England public radio operating budgets so thank you for your part in that support\nIn Eighteen Seventeen to twenty year old French Schubert set a poem by Christian ... Daniel Schubert\nCalled ... it's the story of a white lake trout and we lose the fishermen until the fisherman muddy the water in order to fool the fish the ball man's with the stands a warning young women not to be fooled by the Treasury's of their seduce ers well she read left that\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gene C. V. S. dot org\n... commission to work to go along with one by ... that was written for piano violin the older cello and double bass and the patron also asked for a set of variations on she Brits lead\nHere's the results the trucks queen ...\nFrank ... is the pianist Reno ... plays violin drug costs see viola go to you a cup of soon cello and I'll always push double bass in the piano quintet in a major Dutch lifting six hundred sixty seven ... backed\n\n[noise]\n\n\nEnter to win two tickets to Hamilton from an e P R you could win two great seats at the Boston upper health and dinner afterwards the eastern standard\nAnd you're now in any P. R. dot net\n\n[noise]\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu [noise]\nMm\n\nMm\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\nStreaming of New England public radio is funded by us they pass university graduate schools MS and applied laboratory science that operation rolling now for August twenty seven applications that they passed dot edu\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\nStreaming of New England public radio is made possible by you and by sea keys garage in Williamsburg offering foreign and domestic on the repairs and you ask each certified technician Massachusetts state inspections she keeps garage dot com\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise] [noise]\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology hey I see ...\n\n\n\n\n\n[noise]\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at the vet spaces from board room to ballroom with a the equipment and the house catering hotel north Hampton dot com mhm\nNo\n\n\nNo\n\nMm\nMm\nMm\nOh oh\nOh oh oh\nStreaming of New England public radio is funded by un base paths university graduate schools MS and applied data science enrolling for October twenty second applications at bay paths dot E. D. you know [noise]\n\n\n\n\nUm\nKnow\n[noise]\n\n\n\nMm\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu [noise]\n\nFront ... played the piano Reno cup assumed the violin drug costs said viola and go to the cops on the cello and I'll always ... double bass the piano quintet in a major deutsche listing six hundred sixty seven by ... it's\nThe fourth movement is a set of variations on she read song ... or the ... in which the widely fish is able to elude the fisherman's Moore's until he treasure sleep muddy the water\nAnd next we'll hear that song on which the variations were based then we'll wish Michelle plus all happy eighty fifth birthday is he conducts the sweet to problem solve by me oh\nThis is New England public radio WFCR in Amherst Springfield in Hartford in partnership with UMass Amherst and online at N. E. P. R. dot net\nDuring this hour you can listen to fresh air on the N. E. P. R. news network at ... am six forty in northern birch are county at Ninety eight nine ... online at N. E. P. R. dot net\nHere what eighty eight five FM you can hear music by Schumann Sousa divorce shock and Mozart before all things considered beginning it for that followed by marketplace at six thirty fresh year begins at seven jazz automotive age in classical music returns at eleven\nAnd all this music and news and talk programs like fresh air or made possible by can contributions from our listeners during our full sun dried we're asking you to be among the supporters of classical music here on a New England public radio\nThe music wouldn't be here if not for those contributions so thank you for making one at N. E. P. R. dot net or eight hundred six three nine eight eight five zero\nAlso with an A. P. R. dot net you can see the thank you gifts we have for various levels of contribution and right away we'll thank you with more music\n\n[noise]\nStreaming up the wait let public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gene CVS dot org\n[noise] young my ... there's not [noise] the one that ...\nYou know I think from mobile French tonight you know I think [noise]\nThat\nGoing up and they moved on and it's just it's [noise] like long [laughter] [noise]\nSo I I Will read sorry that I [noise]\nKnew about it because I [noise] [laughter] [noise] [noise]\n[noise] [noise]\n\n\nThat's applause for you see beautifully tenor Fritz Fritz ... shouted Becker piano seemed ... to ... the lead by shoot back to ... which I\nDid beat based or set of variations in the ... clean tech which we just heard a little while ago as long as the water remains clear the fish avoided the lure spots than that treacherous fisherman muddy the water coming up we'll see what the springs symphony symphony number one by Robert Schumann\n\n[noise]\n\n\n[noise]\nStreaming up New England public radio was funded by you add Greenfield commonwealth virtual school of public on like eight to twelve school personalizing education for Massachusetts student now would rolling for fall gene C. V. S. dot org [noise]\n\n\n[noise]\n\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu [noise]\n\n\n\n\n\n\n\n\n\nMichelle puff song conducted the capital orchestra too loose in the sweet ... followed by ... meal today's plus loans eighty fifth birthday he was born in Paris in Nineteen thirty three\nComing up march is by John Philip Sousa and I'll tell you about a concert friday at the University of Massachusetts Amherst\nNext ... spring symphony ... New England public radio WFCR in Amherst in Hartford at eighty eight five also in Lees got Ninety eight three and online at N. E. P. R. dot net\nDuring our fall fund drive were raising the money to keep classical music and all the rest\nStreaming of New England public radio was funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gene C. V. S. dot org\nThat purpose if you haven't done so yet I'll remind you that you could be entered into a drawing for a chance to see the musical Hamilton October thirteenth in Boston [noise]\nYou'll get a pair of tickets and the dinner at eastern standard kitchen and drinks and Ken more square you can enter that drawing and make your contribution at N. E. P. R. dot net or you can call eight hundred six three nine eight eight five zero and thank you\n[noise] classical music on England Public radio is funded by un by Julia beauty holistic skin care products and treatments for the entire family since Nineteen Ninety two celebrating their anniversary through October details at the joy of beauty dot com\nAnd by you comes from the meeting recital hall in stores\nPresenting jazz pianist Fred Hirsch in a solo concert on friday October fifth that eight V. D. N. dot ... dot edu\nHere Sir Neville Mariner conducting the Academy of St Martin in the fields and the symphony number one in B flat the springs symphony by Robert ... on\n\n\n\nStreaming of New England public radio it was funded by un valley solar local TV designed the installation helping household secure state or federal incentives and live carbon free and the ... valley solar dot solar\n\nUh\nAndrew to win two tickets to handle in from an e P R you could win two great seats at the Boston opera house and dinner afterwards that eastern standard and you're now in any P. R. dot net\nNa\n[laughter] [noise]\nStreaming of New England public radio was funded by you when they pass university graduate schools and I say in creative non fiction writing enrolling now for August twenty seven applications that they pass dot edu [noise]\nOh oh\nOh oh\n", "show_name": "Classical Music with Walter Carroll", "year": "2018", "city": "Amherst", "day": "02"}