{"month": "10", "state": "MN", "station": "KZSE", "content": "The story the hair on NPR needed that made possible by members investigation fact checking for forty not breaking\nNumbers power every story and in and every step of the way I\nThe forecast for the twin cities clear skies overnight lows and the low thirties so these guys to borrow highs and the upper forties northwest wins around five miles per hour\nClear tomorrow night lows near thirty Wednesday mostly sunny eyes and you're fifty Wednesday night probably the most cloudy slight chance of rain after midnight lows in the upper thirties Thursday cloudy rain likely highs and the upper forties showers led the Thursday night low in the low forties cloudy friday highs and the low fifties\nYou have any of those on the go you can get a regional news ... plus the weather and sports every morning and evening simply by asking what's in the news how just enable the M. T. R. news update on Amazon Echo scales\nOregon Heather Cox Richardson explore what we can learn from previous periods of political paralysis and why the breakdown of our unwritten rules and there's always a bad thing a DJ Dionne and the future of our political parties you can hear the latest from the American public media series the democracy chatting\nAnd for a summary of this hour is new [noise]\n\nLive from NPR News in Washington I'm jak sphere President Trump is threatening to cut off foreign aid to Central American countries NPR's Scott Horsley reports Trump says those countries are not doing enough to stop illegal immigration with just over two weeks to go to the midterm elections\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\nAnd all the time for like a lot of us for our\nThe U.S currently devotes about three hundred eighty three million dollars a year to those three countries that's less than one percent of its total foreign aid budget critics say halting that assistance with only worsen conditions in the Central American countries possibly driving more people to seek refuge in the United states Scott Horsley NPR News the White House\nPresident Trump is campaigning in Texas trying to boost support for Republican candidates has early voting started today in that state as ... from member station KNPR a reports a record number of people have registered to vote in November midterms\nFifteen point eight million people across the state of registered to vote in the upcoming mid terms that's one point six million more than in the last summit terms but it remains to be seen of Texans will show up to the polls\nOnly about ten percent of Republicans in seven percent of Democrats turned out to vote in the primaries this year ... is a political science professor at Southern Methodist University in Dallas\nHe says the state usually ranked last in voter turnout but he sees a lot of excitement\nShow I expected it turned out not as good as lots of other states but better than we normally do\nHe says the Senate race between democratic congressman Beto O'Rourke and income and Republican Ted Cruz will be a big draw for voters for NPR News I'm you got it but as in Dallas the\nBig jak pots just keep coming what amounts to lottery fever as gripping much of the nation at the moment with the mega millions lottery jackpot but it's not one point six billion dollars mega millions is played in forty four states as well as Washington DC and the U.S\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more about the jury and so\nThis lottery another lottery the Powerball is also climbing it's worth an estimated six hundred and twenty million dollars that would make it the fifth largest jackpot in us history\nStocks close mixed today though concerns about banks shares amid rising interest rates helped drag the Dow down blue chip spell a hundred and twenty six points to twenty five thousand three Seventeen NASDAQ was Nineteen points to the U.S and be five hundred dropped eleven points this is NPR\nSupport for news comes from Heather ... supporting African wildlife foundation working to ensure the future of Africa's wildlife band wild lands learn more at age ... or\nFrom Minnesota Public radio news ...\nFlorida Senator Marco Rubio returns today so the only state he was in his twenties sixteen Republican presidential race to encourage support for Jeff Johnson in Minnesota's race for governor Johnson led Rubio's campaign and the state which ended with a cock his victory Rubio says Johnson is a common sense candidate\nWho would bring innovative ideas to state government Rubio says Republicans are awakening to the stakes of the November sixth mid term election\nFrom everything I've seen I think both sides are very energized I mean we've become a country that's all politics all the time I remember not so long ago you had to beg people to care about politics not now it's all they want to talk about\nAnd um which is fine I mean I'm Glad people are engaged\nSo I think there's a lot of passion on both sides and ultimately um I think we're going to probably see higher turnout in many places in this country than we normally see in the terms\nJohnson has trailed EFL or Tim Walz in polls but he has been closing the gap lately with a decent number of voters still undecided\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nInspire them his two different visions of Minnesota one that tells you what we can't do and what it tells you what to fear the other one that tells you what we do we do together and how we grow\nWell says he's open to the new taxes for transportation but he has not advocated for new general tax\nDelta Airlines is seeking authority for nonstop flights between the twin cities and Shanghai, China the new route would likely strip hours from current travel times which no food at least one layover filter wants to operate the new Airbus a three fifty aircraft on the route\nAnd there's a twist and these guys are clear temperatures forty eight degrees it's nine oh six\nProgramming and supported by hustled index patent law dedicated to helping solo investors and small companies protect their intellectual property by offering fixed terms for patent and trademark assistance you can learn more Twin Cities Patton dot com\n[noise] welcome to MPR news presents I'm Steven John on Mondays we are presenting a six part series of programs from American public media about the challenges facing our democracy\nFrom truth politics in power I'm Neal Conan and I'm Heather Cox Richardson with the democracy test one of the great innovations of the American constitution is it system of checks and balances each branch of government can apply a break on the others in particular Congress and the courts are supposed to check the power of the president\nThe presidency has gathered more and more power over the last Seventy years and we now have a president who attacks Congress and the judiciary when it suits them and mounts almost daily assaults on other institutions that can hold them to account the media and the career professionals in federal agencies like the FBI and the Justice Department later this hour we'll\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org\nTo learn more for the Washington Post he's also a senior fellow in governance at the Brookings Institute a government professor at Georgetown and a visiting professor at Harvard his most recent book is one nation under Trump which he wrote with Thomas Mann and norm ... he joined us from Cambridge\nWe're looking at the workings of democracy in this series and central to that our checks and balances and the U.S government I think you described as the genius of the constitutional system how are they supposed to be working\nBut when the founders put together the constitution they did not assume the existence of political parties\nUh that's odd it away because the constitution itself creative what you might call the first party system federalist and anti federalist\nBut they did not assume that the branches would be affected by party loyalty I think what you're seeing in this period since Trump's election is a Republican Party that has largely decided\nNot to play it's traditional role in Congress that the Congress rather than being a check on the president is choosing to support him in the courts particularly the lower courts we're going to see if the Supreme Court proves to be a check their reasons to doubt that\nThe biggest check we do have is not so much in the constitution although as part of the constitution it's in the larger acceptance\nOf small D democratic values in the country so the checks or outside the government both in political mobilization which is happening in a big way in the country\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nIn them to hold the president accountable the courts played a critical role in this\nCongressional investigations played a critical role in this for a member of that the Congress was controlled by Democrats and obviously the media played a critical role now you are missing important pieces in that system of checks and balances and I think we are so far see the outcome\nTo the extent that it is a larger problem I'm not sure it's in our governing institutions as such it may be in part in the media and immediate system\nWhere there is less of a common narrative\nThat people broadly share and then to argue within it now there are not only sort of narratives about facts themselves that are contested across political lines and you know there is some evidence that search algorithms\nPush us into our own little camps now that can be exaggerated but I Do think\nThat the nature of our conversation now is different and I don't want to romanticize the past you can argue\nOnline media have opened up the political system to all kinds of points of view and that in the old system there might have been too much of a leak control I can see that argument but I think the lack of any kind of common agreement on a set of facts\nMakes political argument much more difficult because if he at least you agree on facts you can argue about what to do about them if\nProgramming is supported by why WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more headlines WC A. M. P. L. S. dot org\nDescribe it how do we get back to a system where there are at least in crises more interested in the national interest\nKnow there's an interesting case and it's a very controversial one where partisanship did disappear for a moment of crisis\nAnd that was the bank bailout back in two thousand eight and the irony there is the bank bailout was called for by President Bush will Republican the bulk of the votes for the bail out came from Democrats in Congress\nThey didn't much like it either but there was a feeling that in the middle of this crisis when the entire economy could collapse if this didn't happen no matter what injustices might be involved in the bank bailout\nThe damage to everyone would have been worse so we at least have some occasions when we come together we also came together in a remarkable way obviously after nine eleven when President Bush's\nApproval rating rose to the eighties or nineties\nSome argued that that strong consensus actually became a problem because we inadequate we debated the Iraq War afterward I Would note that in both of those cases it was largely Democrats went over to the other side and said All right we're going to support Bush\nEven though we didn't like this and after nine eleven there was a decision made that we wanted to unite behind our president who many Democrats\nDisagreed with I'd like to think that would be good is circumstances like that when Republicans would do that for a Democratic president I just haven't seen that in recent years I'd like to believe that it's true the one clear example on the other side is\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\nThe Democratic party that there was no agreement reached so we haven't we seen some occasions when a national threat brought people together I Hope we will see a clear example of that on the Republican side some day in this period those have been very hard to find I Am very sorry to say\nWe've talked about the checks and balances of the different branches of government on themselves and each year in the past have talked about the fourth and most important check on the political system\nAnd that's a check the voters you've talked a lot about the role of voters and making sure that they have control over their government and you have some interesting ideas about how we can make that happen [noise]\nWell I Am for an idea that's going to take a long time if ever to take hold which is what I call universal voting and what is in Australia called compulsory attendance at the polls where I think that there should be an obligation on all of us to vote\nHow it works in Australia is people pay a very small fine if they don't vote it's not onerous\nBut it's a declaration that this is a civic duty no less than serving on a jury is a civic duty one of the reason I like this idea is that it suddenly changes the obligations of state and local governments they would have to stop\nMaking it more difficult to vote and begin to make it easier for people to do their civic duty so that's one thought I have a second thought I have\nIs and and a lot of other people have obviously is some kind of single transferable vote system where one of the problems in our system is if in a ...\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\n... non majority area and outcomes with their transferable vote you put a number one next to your first choice which might be a third party candidate but then you can put a number to next to say to the Kennedy from one or the other parties\nThat is closest to your view that guarantees that the winter in some sense reflect a majority view but it also creates gives creates some give\nIn the political system I Am not anti partied myself I don't see how you organize a democratic system without parties\nAnd I think we're barking up the wrong tree if we\nSay all our problems are caused by political parties if only they would go away if this party system went away it would be replaced by another party a system because people come together to with people who are more or less their allies to try\nTo influence government that's democracy but there are moments when the system needs some lubrication some adjustments\nUm yo and two of the ideas that I\nAm sympathetic to that transferable vote in a universal boating I think could\nStrengthen our small D democratic system\nThat idea of universal suffrage the idea that the government must guaranteed that everybody votes as opposed to members of different political parties trying to make sure that their opponents don't the seems to me to be a really interesting and very effective way to make sure that that final check and balance on the government that of voters\nActually works right and one of the reasons I'm I think universal boating might gain some support\nProgramming is supported by why WC a Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit one WC A. M. P. L. S. dot org to learn more\nAre often the folks most kept away by various measures to make it harder to vote on the other hand it would also make our system somewhat let city illogical because\nMany of the voters who stay away from elections or people with less hard hard and is he a logical views and so the combination of those too could be\nI think secretary Chu the political debate I mean I Am unapologetically a person of the center left I\nAm very clear about my own views but I actually think it would be useful for both sides to have to make a case to voters who don't necessarily share of their particular uh\nUh eighty allergy that that is has been the effect down in Australia where the system has worked very well and I like to say we got the secret ballot from Australia so why don't we import this idea to\nThanks for being with us today Jay this has been a wonderful look at America's checks and balances and why sometimes they don't work and how we can maybe get back to a place where they work better than they seem to be working today\nIt's always a pleasure to talk with you it's great to be with you thank you he J. D. on who teaches government at Harvard and Georgetown he's also senior fellow at the Brookings Institution and a columnist for the Washington\nPost you can find out more about this program at our website which is truth politics and power dot on march\nOh you're there you can listen to all the shows that are are ... including previous episodes of the democracy that truth politics and power dot\nComing up the hidden heroes of Watergate\nHadn't talked to protect them and I'm you'll come it's the democracy test from truth politics in power and eight PM\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA and he'll S. dot org\nAnd they did a story\nAnd dig into the details you can tell you they know and then every morning and [noise]\nIt's the democracy test on how they're Cox Richardson\nAnd I'm Neal Conan the checks and balances built into our constitution restrained the power of the president\nThough they created a chief executive the framers took care to make sure the president was not a king\nSome of those restraints are written into law but many others are not for a hundred and fifty years for example there was an informal agreement that no president would serve more than two terms the president was established by George Washington and observed by every one of his successors\nProblematic for public officials those our values I'm familiar with that or at the top of my head\nI think when you get to there is a really important point about a kind of\nTechnicality right we don't really want our president's skating under technicalities about how they use their power yet that's not that uncommon\nPresidents pushing the boundaries of their power all the time courts make rulings that either limit that often that doesn't right that suggests that the broad category of what executive power is encompasses all sorts of different\nPractices you know we saw a lot of that with George W. Bush and the war on terror it's not like that's new but I think it is\nNew and as it concerns presidential conduct much of the time that we don't think of that\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA and he'll S. dot org\nEach other so when any one of them gets weak or starts to work for the others were kind of in trouble\nRight I think that's right and you know as we think about other instances where presidential conduct has been a problem making about Bill Clinton thing about Richard Nixon and both of those instances there's divided government and Congress pushed back in ways you know for Clinton to didn't and his presidency but I\nThink you know in some way she sort of got the message of there are people that didn't approve of how he had conducted himself and obviously for Nixon in it and ultimately ended his his presidency whether that kind of check can occur under unified government I think it's still a little bit of an open question\nBy unified government you'd be when one party controls the White House in both branches Congress\nDirect when one party controls all of it which you know may not be the situation for that much longer so\nWe shall see everyone could have something else you've talked about and that's a shift compared politics today to the political system we had an Eighteen Ninety six and you have a really interesting take on it so why don't you tell us what you mean by that [noise] yeah so\nThat he came out in July of two thousand sixteen\nAnd we wrote that piece thinking about the rise of populism thinking about the concept of a of a new gilded age and thinking about very very close and very\nVocal party competition those were the things that we were really thinking about there in terms of parallels just try and get flush out the idea of is there really anything that has happened before one\nThing I Would say about that he says I kinda think back on it as did a lot of the conceptualization of that paper and twenty Fifteen in early ...\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA and he'll S. dot org\nAppear to many voters to look pretty much the same and they are incredibly vitriolic and what you suggested about that period is that in the Eighteen nineties\nIs it that was the precursor to an entirely different party system and I'm Wondering if you would say the same today in two thousand in Eighteen looking at where the parties are in those particular parallels\nI Know a lot about this and a lot about the possibilities for a change in ways that are not I don't I don't know they're totally reflected in in that piece and there are two things that I keep coming back to one is that our current situation\nIs a recipe for very stale and stagnant parties it's very difficult for the parties to change\nNegative partisanship makes the system very resistant to third parties and I know it's not normally hear from political scientist right political science doesn't tell you that\nHaving electro college and single member congressional districts majority ... majority rule and makes it that's why we don't have their party\nBut third party is bubble up periodically in American history and they take up ten percent twenty percent of the vote in a presidential election and they kind of\nChanged the agenda right they don't win office but they they changed the agenda and they channel new ideas and that really I think strikingly hasn't really happened in the twenty first century\nAnd I think one reason for that is that negative partisanship makes people terrified to cross the aisle it means that the elites don't both their parties at the same rate that they used to to to start new ones you know that may be good or bad\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR list dot org\nStructures pushing back against the shape of the gilded age political economy things like that\nUm that's you know kind of what I see in terms of the possibilities for change the only thing I think is that in political science we've maybe moved away from some of the theories\nThat would explain how we get out of these periods of close competition and vitriol and stagnation we used to call them ... minutes we used to say All right the new majority formed around new issues and there was this\nElection in which that happened realignment theory has kind of fallen out of favor in political science in part because when you do scrutinize those election patterns a lot of those claims start to crumble\nWe haven't replaced it with anything in terms of a big kind of idea about how we get out of those periods so how you get from from Eighteen Ninety six to Nineteen thirty to for example\nWe've referred several times in this conversation to your colleague Jennifer Smith she died this past August much too young we're sorry for your loss and ours\nThank you Julia sorry thank you for being with us Julia sorry teaches political science at Marquette University and thanks for being here thank you so much\nThe one moment in American history that may bashed in body the principle of checks and balances is Watergate a free press the courts and Congress all acted to bring down a president who transformed the White House into a criminal conspiracy\nBeverly gage has another theory yes the Washington Post judge John\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nYell and she's the author of the new book ... J Edgar Hoover and the American century she joins us from New haven welcome to democracy test thanks for having me really it's easy to think of J Edgar Hoover and Richard Nixon as political allies comrades an anti communist fervor\nBut you argue that they were in fact in deep conflict\n[noise] they were both at the same time so they had in fact spent by the time Nixon became president spent a lifetime or at least since the late forties in a pretty close friendship and political alliance\nThat that was built as you say around anti communism and also around kind of shared outlook about Washington so they liked each other quite a lot\nOf 'em they conspired together about all sorts of things including Hoover really supported Nixon being elected in Nineteen sixty eight though he did it quietly but once Nixon became president they came into conflict pretty quickly\nUh one of the things Nixon really wanted to do when he came to office was what he called politicized the bureaucracy\nHe felt that all sorts of federal civil servants were not nearly as responsive to the president as he would like them to be they didn't serve his political purposes\nAnd he really wanted to do that um unfortunately J Edgar Hoover wanted no such thing and he was a pretty powerful man at that point and that brought them into some serious conflict\nWell for himself died just before the Watergate break in right he did\nSo Hoover died in May of Nineteen Seventy two and the Watergate break in happened in June of Nineteen Seventy two already before that but\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot\nOrg to learn more instance Hoover thought that was a very dangerous thing for the FBI to be doing he refused to do some of what makes them want it and that's actually why Nixon created his uh his famous unit known as the\nPlumbers the plumbers to stop leaks right but even though Hoover was dead institution he created and had run for half a century remain behind and you focused on a man who spent Thirty years steeped in the culture of Hoover's FBI\nA man named Mark Felt who most people know as Deep Throat the man who was Bob Woodward's invaluable source and unraveling what had happened with Watergate\nSo why did a really kind of a button down gene man like Mark felt\nTurned on President Nixon\nOf the I think she an unrecognized parts of the Watergate story is that it happened in the midst of a really big battle over the succession crisis at the FBI so when Hoover died in May of Nineteen Seventy two he\n... ... email ...\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot\nOrg to learn more\nTo the consulate in this temple I'm Cathy words are It's Tuesday October twenty third and this is MORNING EDITION [noise]\nThis hour how Congress is responding to the evolving story about the journalists deaf and an estimated seven thousand migrants are part of a caravan traveling north through Mexico the latest on their journey just ahead plus this joining an office pool improve your odds of winning the lottery we'll\nFind out it was on the state of Nineteen Fifteen when tens of thousands of\nWomen marched up Fifth Avenue in New York City [noise]\nDemanding the right to vote [noise] country music singer do white and yolk them has a birthday today he turned sixty two\nIt's six oh one in the news is next\nLine from NPR News in Washington on corporate Coleman Turkey's president is making accusations in the death of Saudi Arabian journalist ... president ... type or two on his soul Turkish lawmakers there are many unanswered questions but speaking through an interpreter he says turkey does not believe this was an accident\nThe information on the evidence that we have so far collect it indicates that Jim ... was slain in a vicious violent ...\nDied inside of Saudi Arabian consulate in ... after giving several different explanations including one that ... was still alive the Saudis now say he perished in a fistfight Turkey's president alleges the Saudis have taken away the cameras\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nOne time Republican rival Ted Cruz on Monday NPR's Scott Horsley reports that Cruz is facing a competitive reelection race in the traditionally red state of Texas\nAt a campaign rally in Houston Trump offered an apologetic defensive is America First policies including pulling the U.S out of an international climate agreement and slapping steep tariffs on traditional trading partners\nAs sort of became a\nNational is really\nWe're not supposed to work you know what I Am a nationalist\nWith just two weeks till election day job is emphasizing hot button issues such as border security and the Supreme Court in a possible side that GOP tax cut is falling flat with voters drop as recently been promising an additional tax cuts that so far little more than a slogan Scott Horsley NPR News Washington\nA judge in California is cutting the amount of money that pesticide maker Monsanto must pay to a man who sued the company over its weed killer roundup as NPR's Giles Snyder reports last August a jury determined that roundup caused the grounds keepers cancer\nDecision by the judge in San Francisco comes in the first to come to trial up thousands of cases that have been filed over Monsanto's round up and ranger pro weed killers in August a jury found the products caused grounds keeper Dwayne Johnson cancer and awarded him two hundred and eighty nine million dollars\nLast month a judge signaled she may consider a new trial um the punitive damages portion of the word as Monsanto now owned by their son to overturn the verdict but Mondays ruling the judge said she was compelled to honor the jury's decision several had written letters or junior\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nComes from say the indefinite taking a personalized approach to helping clients grow preserve and manage their wealth learned more at sit down with the dot com slash wealth sit down with the brokerage services El Al see\nFrom Minnesota Public radio news I'm John Wannamaker Florida Senator Marco Rubio returned yesterday to the only state he wanted his two thousand sixteen Republican presidential race to encourage support for Jeff Johnson and Minnesota's race for governor\nJohnson led Rubio's campaign in this state which ended with the caucus victory Rubio says Johnson is a common sense candidate who would bring innovative ideas to state government\nRubio says Republicans are becoming more aware of the stakes in the November six mid term election\nFrom everything I've seen I think both sides are very energized I mean we've become a country that's all politics all the time I remember not so long ago you had to beg people to care about politics\nNot now it's all they ever want to talk about\nAnd um which is fine I mean I'm Glad people are engaged\nSon has a lot of passion on both sides and ultimately um I think we're going to probably see higher turnout in many places in this country than we normally see in the terms\nJohnson Israel DFL or Tim Walz in polls but he has been closing the gap lately with a decent number of voters still undecided\nHealthcare providers are working closely with the Minnesota department of health to keep an eye on the number of acute lasted my lettuce or a FM cases it's a polio like illness that can cause paralysis and it has no cure or vaccine\nCases of FM seemed to be on the rise across the country with at least sixty two children affected in twenty two states including seven in Minnesota\nDr ... serves as the division director of pediatric infectious diseases at the University of Minnesota medical school he says a parents' best\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA N. P. L. S. dot org to learn more Latin America including some cases in the United states\nDoctors first noticed a rise in a F. M. cases in twenty four teen that's also the year state health officials began surveillance of illness\nThe search for northwestern Wisconsin girl whose parents were killed in the family's home last week was to expand today with as many as two thousand volunteers expected to cover the area\nThirteen year old Jamie clause has been missing since October Fifteen when deputies responded to a nine one one call and they found someone had broken into the family home and shot and James and Denise claws\nAnd earlier search turned up nothing authorities believe Jamie who is not a suspect in her parents' death was abducted\nMarin County sheriff Chris Fitzgerald said yesterday that two cars are being shot in the case investigators are looking for a red or orange to dodge challenger and the black Ford Edge or black accurate empty acts that may have been traveling near the clause family's home on the night of the killings\nRight now in the twin cities it is a clear and thirty five degrees this was Minnesota Public radio news\nProgramming supported by set or clean energy conservation class setting Minnesota for over eighty years they professionals are committed to helping you with hair replacing maintain your hardworking appliances learn more at center point energy dot com slash H. S. P.\nProgramming is supported by you care the health plan D complicate hers you care teams are ready to answer your coverage question in simple terms whether you're from a small town uptown downtown learn more about people powered health plans that you care dot org It's MORNING EDITION from NPR News I'm Steve Inskeep\nAnd I'm Noel King good morning Turkey's president has offered new details on the killing of ...\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nKilling was premeditated Saudi officials meanwhile now say that ... was killed in a rogue operation by individuals who are acting without the knowledge of the crown prince\nThey first said that he left their conflict in Campbell alive now all of this back and forth has prompted many U.S officials to question the relationship between the U.S in Saudi Arabia one of those officials as Congressman Adam Schiff he's a Democrat in California and he's the ranking member of the house permanent select committee on intelligence\nRepresentative shifted many good morning good to be with you so what did we learn in are the ones who remarks today\nWhat we learned that the Turks have additional details or only some of which they've shared with the public about the premeditated nature of this killing a that the team actually didn't all had over the same time that part of the team won over earlier and may have done reconnaissance and are forced to determine where to dispose of the body\nThey brought within the body double their images of that body double in the show she's close so they give a lot of added detail but they still withheld the some of the key evidence that they claim to have which is a either audio or video recordings of of the killing\nDoes what are the one said today square with what you've been told by the U.S intelligence community it\nCertainly far more credible than the Saudi account um but you have to say that the the Turks don't come to this with clean hands are after all this is the same country now demanding extradition of this team from Saudi Arabia\nThat had a team of its own security thugs beat up people in the streets of Washington DC and refused to extradite them a turkey is also the leading jailer of journalists and the world so it's not as if they're the\nAnd I knew and hair each week we recommend great to be in the theater and those gifts and also the movie screen at home it's only you can talk twice a week one of the vices usual\nVisitors your Twin Cities forecasts it should be shutting it a little bit cooler than it was on Monday with high in the upper forties northwest moons around five miles per hour clear tonight with overnight lows in the upper ... weddings\nWednesday sunny with highs and the lower fifty southeast wins five to ten miles per hour partly cloudy in the evening on Wednesday and then scattered showers developing after midnight with overnight lows around forty degrees wins out of the south five to ten miles per hour\nFinality from tools to security to compliance more information at age ... how dot com and gobble a meal kit company that delivers semi perhaps meals to be finished at home in Fifteen minutes with one pan\nGobble sous chefs do the prep work like chopping marinating this week's menu is at ... dot com slash NPR in ... words or this is MORNING EDITION the dilutes city council passed a controversial resolution last night approving the purchase of nearly eighty four thousand dollars in personal protective equipment for the police department\nThe meeting was nearly shut down by protesters and left even supporters at the proposal unhappy Dan Crocker has the report\nAbout a half hour before the city council meeting was scheduled to begin protesters covering their faces with bandanas and masks student in a line in the council chambers chanting\n[laughter]\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nBringing lines three oil pipeline protesters alongside people concerned about policing in communities of color pipeline opponents have criticized police for what they say were violent tactics at the Standing Rock pipeline protests and twenty sixteen\nAnd others have objected to what they see as the growing militarization of police forces and many others argue the equipment is needed to keep police safe\nWith protesters walking and chanting directly behind them to dilute city council wrapped up ... business suit after the meeting began [noise]\nThen they recess and came back about a half hour later council president Noah Hobbs tried to quiet the crowd so the council could listen to comments from the audience when that was greeted with music from a portable speaker and even louder noise he called for a vote\nFive but losing your hand [noise]\nThey were\nYelling and there were tears and there were chants of no peace no justice\nLittle upset um you know a lot of community members have been working on this issue for not even just the last few months for years\nJordan Moses is vice president of the dilute citizen review board which by the city council and the police department they held three community meetings earlier this month on their proposal\nHe says he and many others in the audience had prepared comments about policing in use of force and it was difficult to see the city council hold the vote without public comment\nDefinitely don't think that this is the way to approach demeaning I think\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nPolice officers he was also thinking about police department\nAround I was concerned that if we didn't move forward and show folks that we do supplement support our police officers that we're going to earn a reputation in the city as one that doesn't support them\nCity councilor Joel Cyprus one of two council members who voted against the resolution says he would've liked to have seen a longer more inclusive community process\nI have concerns and I have reservations about the purchase 'em and regardless this would have been a difficult vote for me\nUm but because\nUm we don't have a policy regulating the use of equipment in place I could not in good conscience vote for this tonight\nHe says now that the city council has approved the purchase it's important for the city to put such a policy in place to govern exactly how and when police use the gear that's proven so divisive\nDana Crocker Minnesota Public radio news delivers programming and supported by the close gaps now campaign with Minnesota having some of the worst achievement gaps in the nation close gaps now aims to close the gaps with early education learn more at close gaps now dot org\nSupport comes from sales force sales force essential Z is a C. R. M. tool built for small businesses and start ups learn more about sales force essential that sales force dot com slash essential\nIt's six twenty five the twin cities suburb of Brooklyn park is accustomed to a huge real estate developments but a new plan called project hot dish has angered many residents project hot dishes a plan for a warehouse nearly half\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nIn a foreign this two hundred and thirty ... acre site has long been known for development as a business far\nBelow for ... property wants to build a four story warehouse with about two point six million square feet of space\nEvery week hundreds of semi trailers would deliver products where we packaging in more trucks would call them to another location for final distribution the prospect of tennis is a secret such Amazon is widely suspected\nSo far the company is keeping mom but it's been on a ... for the twin cities and plans to open a fifth site near this location\nNeighbors don't want project caught dish whether it's Amazon or not\nThis would have never even been considered in a diner or Minnetonka or in prairie\nJim Guy singer is a realtor ... project talked to him she's launched a campaign to stop the development\nIt'd be laughed out of city hall if they brought something like that to go next to homes\nMore than a lab and hundred people have signed guy singers petition to opposed the project Jeff guy singer Jens husband says people knew the business park would be developed but never contemplated anything as big or distressing as the proposal on the table\nWhen anybody thinks that the business park the last thing they think of as a two point five two point six million square foot distribution fulfillment center wherever they want to call it with over two hundred trucks every day a truck every seven nine minutes\nCritics fear the truck traffic would over tax roads and make them more dangerous they're also concerned that make a project will be an eyesore raised Dustin pollution levels and hurt property values\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nThe Brooklyn park planning commission voted against the project last month but lacks the final say developers canal properties is working on addressing concerns brought to that board\nThe city council will determine the projects fate in votes late next month and it's no secret constituents are up in arms I couldn't number one thing is traffic Jeffrey ... is a city council member and Brooklyn parks mayor he says the city will ban truck traffic on the county road that borders one side of the site\n... says the opposition is not universal and the economic benefits of the project can't be ignored the project would generate at least five million dollars a year in taxes and create some twenty five hundred jobs in London says that's better than previous proposals\nSomething going in there and so really we're talking about what is going in there are people who want to keep it a cornfield forever and that that's not going to happen\nBut the critics are not limited to Brooklyn park residents many people in neighboring Chaplin don't like it either sampling their Ryan classic contends project hot dish is not permitted under zoning rules for the site and it took ... between Brooklyn park and Chaplin barring distribution centers\nA major concern is traffic traffic congestion safety for the folks electricity and infrastructure extensive long term damage to our roads and there are sections who's going to pay for it\nAt a recent public hearing skin al properties defended the project development manager dance ... said the project would generate more than five thousand daily vehicle trips including two hundred semi trailers stops he acknowledged project hot dish sounds big\nWhen you compare that to what we had a cruise in the previous development plan it's not that far\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nSeats are on the ballot and vote on project caught fish is slated for after the election Marc Morial in Minnesota Public radio news\nFor cutting off you know your faith is broken through here\nThat's Eliot Engel the ranking Democrat on the house committee on foreign affairs he says the president may be frustrated and angry about the caravan of migrants coming from those three countries and moving through Mexico but cutting aid will help\nMake the situation we're we we should be working with these countries to try to uh to help alleviate some of the problems are driving people to come to the United states has ever by\nUSAID and the region is meant to do just that addressing the root causes of migration by improving security and rule of law last year according to the U.S global leadership coalition the U.S provided about eight hundred thirty eight million dollars in foreign assistance to Central America and Mexico\nAnd it is making a difference on the ground according to rich Jones who spoke to us from El Salvador where he works for Catholic Relief services\nHistory the economics and we've already got completely interconnected sports very much in the interests of United States if you develop them happen here that violence you reduce here because it's pushing people into the Georgian irregular migration\nThe Trump Administration is reviewing all USAID making clear to countries that receive assistance that they should support us\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nWhich prohibits the president from with story or pounding money appropriated by Congress\nBut don't expect any quick moves on this says James Roberts former foreign service officer now with the Heritage Foundation a conservative Washington think tank\nWhere dozens of programs in the three countries and they could be reviewed not all of them are effective manner you're too small to make a long term difference it's often difficult to measure them\nWhile Roberts would liked a thorough review he points out that it takes time and needs to be coordinated with Congress he also argues that it is in U.S interests to help these countries blue security and economic opportunities for people in the region to keep them home\nAnd come up begin to solve all the problems of controversial but it has to be from private sector caused embarrassment it is a very small piece of the puzzle\nThe state department won't say whether it has received orders from the White House to cut aid officials ad that they believe Central American governments are discouraging their citizens from taking the dangerous journey north Michele ... NPR News the state department [noise]\nOkay so the holidays is kind of come up pretty fast like pecan pie you a fan of that we're going to go out to a Georgia pecan plantation for all intents and purposes that's what it is a farm and talk about how the weather is affecting the pecan crop is six forty two\nTimes Gary Miller are you looking for a good book to read that sign up for the thread newsletter text book to six seven seven six seven seven and I'll send recommendations to your inbox once a week\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race wind up you see a end he L. S. dot org\n... there's a new way to listen to MORNING EDITION wait wait don't tell me he was around the world and all your favorite program simply say likes to claim here anytime you want to be a good company\nTry Alexa play NPR this is your Twin Cities forecast which would be shutting it a little bit cooler than it was on Monday with high in the upper forties northwest moons around five miles per hour we're tonight with overnight lows in the upper weddings\nWednesday sunny with highs and the lower fifty southeast wins five to ten miles per hour partly cloudy in the evening on Wednesday and then scattered showers developing after midnight with overnight lows around forty degrees wins out of the south five to ten miles per hour\nConflict in his stumble in his speech to parliament alleged after local collaborator helped cover up the murder I'm asking now\nIf it looks a little afraid to has taken\nThe body because she she as well age ... and not sort of the Saudi Arabia is the local collaborator this is not just the river and this is an official I'll tell you the Saudi Arabia is making it is they say that I Love to collaborate to dispose of the buddy\n... wants to know the local color race\nRace China has opened the longest the bridge in the world blinking Hong Kong andme account to mainland China\nIs taking about nine years to complete to the cost of about fifty billion dollars in BBC News understand along the way a teen workers at least a lost their lives there is a conservatively and Hong Kong that symbolizes yet another instance of a kind of a encroaching sovereignty from the ...\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org BBC It's MORNING EDITION from NPR News I'm Steve Inskeep\nAnd I'm Noel King when hurricane Michael plowed through southwest Georgia it hit that area's farms like a bomb cotton fields near harvest were blown bear and decades old pi can groves were leveled\nGBDs grant Blankenship visited a pecan farm in southwest Georgia to see how the recovery is progressing\nTucked away in a corner of the pine ... pecan grove near the town of Pretoria Georgia is one of those things that Mitch Bolger says make living and working here\nWe're on the thing is so this was the\nFlock of about half a dozen water birds fly through cypress trees bordering a bubbling spring fed pool and yes this summer swimming hole is in fact coal so wow [laughter]\nThat's a lot of fun ...\nHas been the farm manager at pine over Twenty years the family that owns the plantation is mostly scattered to Colorado in Rhode Island\nThe for Bolger this is the only home his kids have ever known this means everything to me which is why the scene that our backs hurts so much it's one of the thousands of the farms the country's laid low by hurricane Michael and this one was a real money makes\nOne of those varieties or he is it's actually called a money maker has actually called money like\nHere's a big isn't great just ... it's ripped up tap root is encased in red clay and maybe Thirty years away the concert piled like gravel and address dream that between enormous tree trunks but not it's still together by hand if only someone would do the work\nI had a crew Monday in that now don't have a crusader [laughter] our uh\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nAnd they're\nThey're still money to be made in a group of far younger trees that we didn't\nEscape than [noise] thousands of these trees\nMust be cut down to steal Bolger says the younger trees are the long term future of the panel plantation but in the short term\nYet those lean years coming ahead of us and we'll we'll work around which Bolger says that means re planting\nIntending and waiting for decades then he's hopeful he'll see the ... plantation thick with money makers again for NPR News I'm grant Blankenship in Pretoria Georgia\nProgramming and supported by health partners Minnesota's health partner for over sixty years with helpful customer service and Medicare plans that think your life find your health partner at health partners dot com slash NPR\nNext we have news of a side effect of booming cities where housing costs are soaring and people are priced out people who can't buy in are moving to smaller cities think about San Francisco and Oakland\nOr Manhattan and Hoboken New Jersey which is a little bit cheaper\nOver the past few decades that process has brought big change to Boston and the town's surrounding it and now a full hour west of Boston Worcester, Massachusetts is seeing its stock rise from W GBH radio and Boston Aaron Schachter reports on what could become a case study in urban growth\nA few years ago if you'd asked most people in Massachusetts their opinion of Worcester you'd likely get an answer like this one from Michelle 'cause\nThere wasn't any place I'd ever come um made me nervous made me scared my mother used to tell me all the time when I was a kid stay away from western style\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\nSeventies its roof it gave the there was also the Galleria mall which was supposed to revitalize downtown but instead killed local businesses divided the city and a half and then went belly\nUp there were a lot a silver bullet strategies over the years you know jeeze if we just make this project cap and this'll be the catalyst officials\nReally got to work in twenty ten by unifying the large park outside city hall and then demolishing the inferno mall Kate McAvoy a vice president for Harvard pilgrim health care is a fifth generation ...\nProperties are hot commercially properties are hot residential everyone just wants a piece of West right now it's crazy\nEntire state how this is science and then you can also be half recording facing Rochester in my head to meet you at\nAnd St Paul NPR discovering what matters who\nTurkey's president says Saudi agents began planning to kill the Saudi journalist ... days before he entered the consulate in this temple\nI'm Cathy words are It's Tuesday October twenty third and It's MORNING edition\nThis hour how Congress has responding to the evolving story about the journalists death and former attorney general Eric Holder talks about efforts to halt gerrymandering around the country\nPlus we'll have the results of a chaotic city council meeting in Duluth last night the subject new policing here it was on this data Nineteen Fifteen when tens of thousands of women marched up Fifth Avenue in New York City demanding their right to vote\nHappy birthday to country music singer Dwight Yoakam he turned sixty two\nIt said oh one and the news is next\nLife from NPR News in Washington on corporate Coleman Turkey's president says evidence strongly points to a plan Saturday operation to kill the journalists and the Saudi Arabian consulate in Istanbul NPR's Peter Kenyon reports president ... type aired on discussed the killing of Jamal ... with Turkish lawmakers today\nEveryone says members of a Saudi teams sent Istanbul in advance of the killing scattered out potential areas to disposable body he also says although the Saudi consulate his diplomatic territory there was a murder committed on Turkish soil\nDo an interpreter he called on the Saudi Government to allow the Eighteen people arrested in connection with the show ... killing to be prosecuted in Turkey\nWe every CERN hosted so we will not remain silent against this murder and we will take any steps required like cautious and law\nSaudi officials who claimed to show G A critic of the government suffered an accidental deaths during a fight broke out after he entered the consulate October second Peter Kenyon NPR News Istanbul\nMeanwhile CIA director Gina Haspel is going to turkey to review the matter the un refugee agency and said more than forty five staffers to Mexico to screen the claims of thousands of Central American migrants seeking asylum leads to shine reports\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA and he'll S. dot org\nFleeing persecution and violence me to be given access to tear tree and refugee status determination procedures if people who are fleeing persecution violence and one country they need to be provided access through asylum system president\nTrump has vowed to turn back the caravan of refugees and migrants from us borders steel and they see our warns the caravan is facing a worsening humanitarian situation for NPR News and Lisa shrine in Geneva\nThe largest lottery prize in America could be awarded tonight the mega millions lotto has a jackpot that's now worth one point six billion dollars the chance to win is about one in three hundred three million but that's not stopping to read some gray she bought a ticket in Santa Cruz California\nWe have a lot of poor people in the world and I think anybody would like to take them being rich\nMoney they can do what they want and you know maybe by and highland some made by apple seven day\nEverybody has the jury and so this lottery\nThe odds are more likely that you'll get hit by lightning or become an astronaut and when this lottery if you don't when there's a different chance tomorrow night the Powerball lottery will be drawn that jackpot now stands at six hundred and twenty million dollars\nMega millions and Powerball or played and about forty four states the district of Columbia and the Virgin Islands and this is NPR\nConstant contact is automation feature allow small businesses to deliver emails or a series of email campaigns to their customers learn more at constant contact dot com\nMinnesota Public radio news on John Wannamaker results of a new NPR News\nProgramming is supported by why do you see a Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA N. P. L. S. dot org to learn more\nPresent or undecided a poll last month showed Allison in front by five points or low is still relatively unknown\nWith fifty six percent not recognizing his name it's an improvement for sixty nine percent in September\nUnfavorable opinions of Alison still outnumber favorable opinions and ex girlfriends allegation of his treatment remains a problem despite Allison's repeated denials thirty percent of those polled said they believe the allegation Twenty one percent do not and forty nine percent aren't sure the\nPolls margin of error is plus or minus three and a half a percentage points Tim pug by our Minnesota Public radio news authorities\nAre hoping for as many as two thousand volunteers to help in the search for a Thirteen year old Wisconsin girl missing since her parents were killed in their home investigators believe Jamie clause was taken from her home near barren on October Fifteen her parents had been shot to death\nTips led authorities to call for another ground search today they're also looking for information onto vehicles that may have been traveling near the clause home the night of the killings\nOf polio like illness with no cure or a vaccine has stricken children in twenty two states including seven in Minnesota it's called acute flashing my light us or a a famine cases seem to be on the rise\nOf University of Minnesota patriotic pediatric infectious disease Dr Marc slice says there's no vaccine for a F. M. because more research is needed to find the cause and because of creating an implementing a vaccine can cost hundreds of millions of dollars he says it's plausible that a more widespread outbreak could occur as with any infectious disease we\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nAnd less than one million people in the United states get a a family each year fly says the bass line of defense is washing hands regularly\nMinnesota has its first northern pike catch and release fishing record Maddie August member of women anglers of Minnesota caught a forty six and a half inch northern earlier this month on the lax like the ... school conditions made for good catch and release scenario\nNow the twin cities it is clear thirty three degrees with issues Minnesota Public radio news at the time is eight oh seven\nProgramming is supported by the close gaps now campaign with Minnesota having some of the worst achievement gaps in the nation close gaps now aims to close the gaps with early education\nLearn more at close gaps now dot org support comes from physicians neck and back sent her back pain can affect your entire life before considering surgery visit physicians neck and back sent her long term\nRelief from chronic pain is possible get back to life starting today resume activity dot com\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Noel King good morning Turkey's president has offered new details on the killing of journalist Jamal cause showed Jane ... spoke to Turkey's parliament this morning it\nIs is it will be going to satisfy I don't know the um if I should say the least Justin Rose rationed\nYou are to one also said that he has clear evidence that the killing was premeditated Saudi officials meanwhile now say that ... was killed in a rogue operation by individuals who are acting without the knowledge of the crown prince they first said that he left the conflict in it\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA N. P. L. S. dot org\nGood morning good to be with you so what did we learn in are the ones who remarks today\nBut we learned that the Turks have additional details or only some of which they've shared with the public about the premeditated nature of this killing or that the team actually didn't all had over the same time that part of the team won over earlier and may have done reconnaissance in a forest to determine where to dispose of the body\nThey brought within the body double their images of that body double in the show she's close so they give a lot of added detail but they still withheld the some of the key evidence that they claim to have which is a either audio or video recordings of of the killing\nHis way or the wine said today square with what you've been told by the U.S intelligence community\nIt certainly far more credible than the Saudi account um about you and I have to say that the the Turks don't come to this with clean hands are after all this is the same country now demanding extradition of this team from Saudi Arabia\nThat had a team of its own security thugs beat up people in the streets of Washington DC and refused to extradite them a turkey is also the leading jailer of journalists and the world so it's not as if they're the champions of democracy and human rights in a press freedom but still they're count is far more credible than that of the Saudis\nAn entire state just how the giants and then you can all back on the half reporting in ... in my head\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit wind WC A. M. P. L. S. dot\nOrg to learn more in the world on any device learn more I'd go to meeting dot com the alliance for lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more an alliance for lifetime income dot org\nAnd Amazon Studios presenting beautiful boy based on father and son memoirs beautiful boy chronicles the family's experience of survival relapse and recovery starring Steve corral and Timothy ... now playing\nThe dilute city council passed a controversial resolution approving the purchase of nearly eighty four thousand dollars in personal protective equipment for the police department the meeting last night was nearly shut down by protesters and even left some supporters of the proposal unhappy Dan Crocker has the story\nAbout a half hour before the city council meeting was scheduled to begin protesters covering their faces with bandanas and masks student in a line in the council chambers chanting\n[laughter]\nOn the council agenda was whether to approve the dilute police departments purchase of what's called personal protective equipment protesters called the riot gear\nEquipment like shielded helmets and chess protector and the issue at city council chambers bringing lines three oil pipeline protesters alongside people concerned about policing in communities of color\nPipeline opponents have criticized police for what they say were violent tactics at the Standing Rock pipeline protests and twenty sixteen\nAnd others have objected to what they see as the growing militarization of police forces and many others are\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nThan they recess and came back about a half hour later council president Noah Hobbs tried to quiet the crowd so the council could listen to comments from the audience when that was greeted with music from a portable speaker and even louder noise he called for a vote\nFive but raising your hand [noise]\nThey were yelling\nAnd there were tears and there were chants of no peace no justice\nLittle upset um you know a lot of community members have been working on this issue for not even just the last few months but years\nJordan Moses is vice president of the dilute citizen review board which by the city council and the police department they helped ... community meetings earlier this month on their proposal\nHe says he and many others in the audience had prepared comments about policing and use of force and it was difficult to see the city council pulled the vote without public comment\nI definitely don't think this is the way to approach to me I think it's important to show stuff down but we need to understand the system and how it works\nCity councilor Eric ... says he's also upset people didn't have a chance to speak in favor of or against the purchase he says it's a loss for democracy in the enforcement says he supported the purchase to protect police officers he was also thinking about police department\nAround I was concerned that if we didn't move forward and show folks that we do supplement support our police officers that we're going to earn a reputation in the city as one that doesn't support them\nCity councilor Joel Cyprus one of two council members who voted against the resolution says he would've\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nOf a policy regulating the use of equipment and place I could not in good conscience vote for this tonight\nHe says now that the city council has approved the purchase it's important for the city to put such a policy in place to govern exactly how and when police use the gear that's proven so divisive\nDan Crocker Minnesota Public radio news\nDelivers support comes from sales force sales force essential Z is a C. R. M. tool built for small businesses and start ups learn more about sales force essential set sales force dot com slash a central\nProgramming is supported by you care when it comes to health plans you care uses the power of their people to help simplify antique complicate terms for their members learn about Medicare individual and family or Medicaid plants at ... dot org\nI'm traveling all around Minnesota right now we went from Duluth now down to Brooklyn park\nBrooklyn parks accustomed to huge real estate developments but a new plan called project hot dish has angered many residents their project hot dishes a plan for a warehouse nearly half the size of the mall of America\nFolks living nearby complained that make a project will bring true many headaches Martin boiling reports\nIf you were at the site of projects hot dish recently you'd see a little more than a vast sea of pumpkins awaiting harvest and if one\nIs two hundred and thirty acre site has long been some for development as a business far below for ... for ... wants to build a four story warehouse was about to point six million square feet of space every week hundreds of semi trailers would deliver\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nSite near this location neighbors don't want project caught dish whether it's Amazon or not\nThis would have never even been considered in in China or Minnetonka or in prairie\nJim Guy singer is a realtor and neighbor project taught that she's launched a campaign to stop the development\nIt'd be laughed out of city hall if they brought something like that to go next to homes\nMore than a lab and hundred people have signed guy singers petition to opposed the project Jeff guy singer Jens husband says people knew the business part would be developed but never contemplated anything as big or distressing as the proposal on the table\nWhen anybody thinks that business park the last thing they think of as a two point five two point six million square foot distribution fulfillment center wherever they want to call it with over two hundred trucks every day a truck every seven nine minutes\nCritics fear the truck traffic would over tax roads and make them more dangerous they're also concerned that make a project will be an eyesore raised Dustin pollution levels and hurt property values Aaron balls or can see the projects I from his home he says he never would have built the house had known he could be looking at project hot\nDish it's not safe for my kids it's gonna be loud it's going to be annoying skin to cost us a lot in terms of quality of life\nThe Brooklyn park planning commission voted against the project last month but lacks the final say developers skin al properties is working on addressing concerns brought to that board the city council will determine the projects fate in votes late next month and it's no secret constituents are up in arms I'd say number one thing is traffic jams\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nDollars a year in taxes and create some twenty five hundred jobs in London says that's better than previous proposals\nSomething going in there and so really we're talking about what is going in there are people who want to keep it a cornfield forever and that that's not going to happen but\nThe critics are not limited to Brooklyn park residents many people in neighboring Chaplin don't like it either sampling their Ryan ... contends project hot dish is not permitted under zoning rules for the site and it took ... between Brooklyn park and Chaplin barring distribution centers\nA major concern is traffic traffic congestion safety for the folks electricity and infrastructure expense long term damage to our roads and there are sections who's going to pay for it\nAt a recent public hearing skin al properties defended the project development manager dance ... said the project would generate more than five thousand daily vehicle trips including two hundred semi trailers stops he acknowledged project caught dish sounds big\nBut when you compare that to what we have such a cruise in the previous development plan it's not that far off in terms of operation and actually from a traffic perspective it's it's a little bit less\nIt's not clear which way the council voters leaning members say they can't disclose their plans but it's possible that decision could fall to a group of lame duck council members a majority of council seats are on the ballot and vote on project caught fish is slated for after the election\nMartin oil in Minnesota Public radio news click traffic note here getting\nAbout the citizenship question and not on any questioning of commerce secretary Wilbur Ross\nThe plaintiffs in these lawsuits really want to question however secretary Wilbur Ross because they think that these documents are not sufficient\nThat there have been inconsistencies in a rough his testimony to Congress about why and when he added the citizenship question and the plaintiffs want to use a deposition uh questioning of Ross in order to get more evidence is all preparation for a trial\nThat is expected to begin on November fifth in New York could be the first trial of the six lawsuits around the country\nAnd at this point the children ministry action could ask the Supreme Court to permanently block car secretary Wilbur Ross is deposition Oregon even asked the Supreme Court to hear this case so we're not quite sure right now what will happen to this trial if that is the case well\nWhat is the Supreme Court order mean for the states and cities that are suing over the citizenship question\nIt means that the windows really closing took like additional evidence to support their claims in this lawsuit\nAnd if it were to remember the Supreme Court did allow last night and this order the plaintiffs attorneys to question the Justice Department official John Gore he's the acting head of the civil rights division that the administration says needs the citizenship question to better enforce the voting rights act\nAnd the Supreme Court is allowing additional document requests but again we have to see what the administration does next in their next expected request to the Supreme Court and what they asked the Supreme Court did do a before a trial starts\nAnd the wind can we expect to find out like the the final fate of the citizenship question\nUltimately these this legal battle is expected to be our guest\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nWord wraps up its session it'll take some time NPR times eat long covers the census thanks Hansi You're welcome\nSupport comes from ... recycling striving to help businesses and Ramsey in Washington County is recycled better there's recycling professionals can help you apply for grants update your trash and recycling bins and educate staff on the new process more at these recycling dot com\nFrom attorney general Eric Holder has been going around the country raising money for state legislative races various legislative races now why is that well he says it deals with redistricting and he'll talk about that\nIn just a couple of minutes we're also check your local forecast which includes crisp fall like whether in some rain it's eight forty two\n[noise] the world comes at you fast on air on line on your phone at all things considered we cut through the clutter and take you beyond the headlines there's more to every story listen every afternoon it's\nThis is your Twin Cities forecasts it should be sending out a little bit cooler than it was on Monday with high in the upper forties northwest moons around five miles per hour clear tonight with overnight lows in the upper weddings\nWednesday sunny with highs and the lower fifty southeast wins five to ten miles per hour partly cloudy in the evening on Wednesday and then scattered showers developing after midnight with overnight lows around forty degrees wins out of the south five to ten miles per hour\nIt's a pivotal election year from Minnesota as we choose to US Senators a governor an attorney general and the state and federal\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\nIn hundreds of races that receive little national coverage they are elections for state offices governors and state legislators and many many others they will have great influence in drawing election districts and those districts influence who can be elected to Congress another legislatures in the future\nPresident Obama's former attorney general Eric Holder announced that Republicans dominated that process after the two thousand ten cents as he leads a group trying to give Democrats influence after twenty twenty what is the problem that you're trying to address\nWhat we're trying to deal with the problem of partisan gerrymandering and racial gerrymandering oh we saw the Republicans in twenty eleven use the power that they got in the ... election in the redistricting that occurred the year after\nTo draw gerrymandered seats at the state level as well as the congressional level and so what we want to do with having twenty Twenty one a fair process by which people will draw lines that will include a Republicans and Democrats who are truly going to um represent the the people\nLet's be blunt when you say a fair process do you really mean because you're a Democrat won that it's slanted more to Democrats than to Republicans\n[noise] no uh uh I'm just looking for a fair process I I think that if we have a process that is fair Democrats and progressives as opposed to conservatives and Republicans will do just fine how\nAre you in this whole at least in part because as his critics would suggest President Obama didn't do much to build up the Democratic party to build up the bench at a time when Republicans and conservative groups were spending a lot of time and focus building up their bench\nNo I don't criticize the president on that but I I Would say the Democrats I don't think really have focused enough\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nWhat is at stake in two thousand eighty\n[noise] well we have at stake I'm a little less than half of the people who will be at the table and twenty Twenty one will be selected in twenty Eighteen the governors who are elected 'em in twenty Eighteen and we will be serving for your terms will be intimately involved in the redistricting process in twenty Twenty one\nState legislators who are serving for your terms and who are elected in twenty eight team\nWill be at the table in in twenty Twenty one so\nThe impact that we want to have one twenty Twenty one has to begin now in twenty Eighteen and obviously we have to have a good electoral effort as well uh in twenty twenty in addition to the lawsuits that we will be bringing and the independent commission efforts that we will be supporting between now and a twenty Twenty one\nWhat kind of money as your organization raising an hour you're distributing\nWe've raised I guess about a hundred over thirty million dollars and we are distributing um the money\nWe look at everything through a redistricting lens so governors always matter a state legislators matter\nBut in certain states if you look at Ohio State auditor the state's secretary of state um they matter in certain places um Supreme Court justices will matter so in North Carolina we're supporting an IED or else who is running for the state Supreme Court is one of the reasons why we campaign so\nHard for Rebecca ... who won he Wisconsin Supreme Court seat\nArgue campaigning for judges who are elected in many states with the explicit idea that these are judges who might someday rule the way you would like on a redistricting case\nThough oh I'm looking for or or judges who will look at the facts look at the law a and rule in a fair way not trying to pick the judges who will rule out\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA N. P. L. S. dot org to learn more\nAnd I think ensure a a a fair process one of the attorney general you received a lot of attention particularly in conservative media for a speech you made which you lift off a famous remark by Michelle Obama when\nThey go low [noise]\nThey go low we what did you mean or what I meant ... ... ... ... in that remark was that ah I Am going to stand up very forcefully against anybody who would try to undermine our democracy\nThat the Democrats have to be tough when it comes to confronting people like that and all parties I'm like that\nAs you know there's a broad debate about how properly to be forceful as that's something to be expressed through votes through protests through yelling at lawmakers at restaurants or something else what's appropriate well\nI certainly think votes through protests um I I save it just personally I Would not be yelling at them lawmakers in in in restaurants going to go into their homes\nUm you know I I'd be going act them I'm at the ballot box I I think it was extremely powerful when women came out the day after the Trump ... who was very powerful and young people marched here I'm In Washington to\nAsk for more saying gun safety measures\nThose are the kinds of ways I think in which the people should or should express themselves\nAttorney general holder thanks so much and I think you\nSupport for NPR confidence station ... indeed used by over three million businesses for hiring where employers can post jobs and use screener questions to build their short list at preferred candidates learn more at MIT dot com slash higher and lot of men makers have voted meeting a collaborative\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA M. P. L. S. dot org yeah when\nThis is your Twin Cities forecasts it should be shutting it a little bit cooler than it was on Monday with highs and the upper forties northwest moons around five miles per hour clear tonight with overnight lows in the upper weddings\nWednesday sunny with highs and the lower fifty southeast wins five to ten miles per hour partly cloudy in the evening on Wednesday and then scattered showers developing after midnight with overnight lows around forty degrees wins out of the south five to ten miles per hour\nFrom today ... I don't I don't know it's been a long time coming and then it seems like it just got here\nAll of a sudden Kathy we continue our series this American moment this morning at nine AM and this is the idea of talking with\nScientists and activists and religious leaders and artists and musicians about um how they see the moment we're in not just politically but also cultural culturally to the moment we're in here\nIn this country but I have also been asking guests about how they maintain a sense of clarity imbalance in the world that feels\nNice toys the and the addict chaotic right and excessive and just you know things information coming at you from all sides so\nUh we'll talk with colossal saline about that as well by the way we have two tickets now open for Sally Field are you kidding now see it tonight okay\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\nSymbol he says although it's Saturday diplomatic territory it was a murder committed on Turkish soil speaking through a BBC interpreter he called on the Saudi Government for the murderers to be prosecuted in Turkey\nAnd orange regulation from them going forward or is that the old old response to the highest level as low as it will be a high likelihood will be brought to justice you know and we'll get a punishment they was\nSaudi Arabia has made shifting claims about ... fate for weeks now saying he died after a fist fight in the consulate\nNational security adviser John Bolton is due to meet Russian President Vladimir Putin today in Moscow they're expected to discuss President Trump's intention to withdraw from a major nuclear arms treaty Matthew Bodner reports from Moscow both countries have accused each other of violating it\nBefore today's meeting Kremlin spokesman Dmitry ... said that putting in bulletin we'll discuss a wide variety of issues plaguing U.S Russia relations but after President Trump on Saturday announced that the u._s. intends to withdraw from the Nineteen eighty seven intermediate range nuclear forces treaty arms control is expected to dominate the agenda\nThe treaty was credited with bringing about the end of the Cold War banning an entire class of short and medium range nuclear weapons station to by both sides in Europe\nAs golf said yesterday that ... eager to hear both in explain Trump's position but it is unclear that the two sides which have accused each other violations can find common ground for NPR News I'm Matthew Bodner in Moscow\nThe Supreme Court is temporarily blocking a court order that commerce secretary Wilbur Ross give sworn testimony and lawsuits\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nCity on November fifth a lower court had allowed the plaintiffs attorneys to question commerce secretary Wilbur Ross about his decision to add to question it uh twenty twenty cents is their journeys are looking for evidence to prove their claim that Ross misuses authority by adding a question that Census Bureau research suggest could harm the accuracy of the information collected from the census\nSupreme Court justice Neil Gorsuch however I wrote in his own opinion at allowing the probing of roses mental process he is quote highly unusual a court order allows ... requests to permanently block Ross his deposition or for the Supreme Court to hear the cases on the long NPR News New York\nOn Wall street stocks are lower the Dow Jones industrial average down more than four hundred points or nearly two percent you're listening to NPR\nSupport for news comes from Fidel Eddie investments taking a personalized approach to helping clients grow preserve and manage their wealth learned more at ... dot com slash wealth fidelity brokerage services El Al see\nFrom Minnesota Public radio news on drawn want to hear the dilute city council voted last night to approve the purchase of nearly eighty four thousand dollars worth of protective equipment for police officers what opponents call riot gear as Dan Crocker reports the council meeting was chaotic\nProtesters wearing an ask 'em Dan has shouted and chanted throughout the meeting vowing to shut it down but after a recess and without any discussion because of the noise\nThe council voted six to to to authorize the purchase city council member Eric ... has been voted in favor of purchasing the gear which includes things like helmets with visors an elbow and chess pads we have a responsibility to protect\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race why W ca and he L. S. dot org delivers\nThe CEOs ... says company founder Earl Bach and was a pioneer of medical technology and created an entire industry around it\nA Twin Cities native by Bach and died at age Ninety four Sunday at his home in Hawaii CEO Omar ... says he is also created a profound corporate mission for med product based on the value of improving patrons lives\nAs something who live on this company's future in the mid ... future and I'm sure patients who've been affected by his legacy will also remember him said today that is one that's sad but one that ... allows us to reflect and everything that he's accomplished and we have time for the\nBox and was one of many beneficiaries of the companies technology he had a pacemaker implanted in two thousand one and a second in two thousand nine\nFargo's old city hall is set for demolition and a couple of weeks service visuals made the move to a new city hall adjacent to the six year old building last month city administrator Bruce grub tells KF geo radio that remaining furniture and fixtures have been salvaged by several nonprofit organizations and a specialist remove all started last week\nDemolition of the building should be completed by the end of November part of the area will eventually become parking\nMrs Minnesota Public radio news the time nine of six [noise]\nThat morning I'm Carrying this is NPR News this hour we continue our this American moment series with writer and pod cast creator a colossal lean in a series we're talking with scientists and activist religious leaders and fresh thinkers about where we are in this\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR list dot org\nIdentities as a young black Muslim women fit into this moment in politics and American culture they wrestle with those questions on many episodes of their podcast identity politics including a recent episode about what it means for both of them to be leading their twenties behind soon\n... welcome back to the show and thanks so much for being part of the series it's good to talk to you again\nHi Kay thanks for having me it's I'm happy to be here\nSo when one of your most recent pod cast you America are contemplating what it means to be on the precipice of thirty\n[laughter] and um and I listen to it was fun but you're also considering that this is why this is just perfect for our series\nYour thinking what does it mean to be young leaving our twenties go into thirty black female and Muslim in America right now how does that feel what what would you say about it\nYeah I think you know at the first level it's just the idea of leaving your twenties right [laughter] right I think the monument and in that somebody's lying and yeah right and I think it becomes a big moment in pop culture and movies and TV you see this cleaning onto the last of your twenties [laughter]\nSo I think that's the first hurdle to get over that it's not the end of the world to not be twenty something [laughter]\nAnd that in fact of life can very much diet as you began to enter into your thirties and some people say you're forties and I think in terms of being black and Muslim and entering ... thirty is\nUm the idea that you now have a little bit\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nOn on multiple levels as entity countering other Muslims who were not black\nAnd the racism that comes with that um within the Muslim community itself and then outside of the Muslim community just being a minority on a predominantly white institution\nAnd so now you know we've had about ten or so years [laughter] of learning how things work um in the world and trying to wrangle with that I think it can sometimes be overwhelming but now we have a little bit more balance and how to navigate that YouTube\nAnd I think that when you have social media you know you kind of don't feel alone [laughter] because they're like looking at images you're talking to people over the Internet right um but it's it's not really a source of healing right you're you're not really healing whatever\nThat deep sadness within us and\nNot that you can't operate with that sadness but there's something missing and you're searching for something we're always searching for something\nAnd\nBeing alone and isolated and not knowing how to cope with that can be really difficult and so I mean I think that being alone in isolation can be good when you're contemplating and reflecting um but you also obviously need to be in real life community because that's what it's going to be life giving you\nKnow when I read about your experience at Harvard divinity school did you complete it\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nThough is that there are real connections that are really important to what it means to be human but to also\nYou know getting a a sense of our own identities when I read about your experience at Harvard divinity school you were saying that your classes they're made you feel out of touch with you know people in the communities and what they were going through that you cared about\nSo it sounds like you were you know in the midst of the conundrum that we've just talked about this sense of\nA higher purpose and maybe an intellectual understanding of spiritual as men theology but then also the real and the hard day to day work in communities which is where the transformation takes place have you reconcile that\nI think when I was studying at Harvard I didn't have balance right and I think this our conversation so far has really just about maintain a balance like you you can't be so far on the other end where you can't see the other end\nAnd so I was spending a lot of time in the library right like grad students do [laughter]\nAnd ours that would just ... camp out in the library I laid out a paper and every now and again I Would send it to my mom and she would say you know I have no idea what you're talking about [laughter] what what did she mean by that [laughter]\nUm is she is just read the paper and it was just a bunch of like academic jargon and I would be writing about Muslim community is specifically like black Muslim communities and she just like I don't\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA ... dot org\nAnd once I had that realization I started doing some fieldwork and Boston and I was working with the Massachusetts housing and shelter alliance and there is doing work regarding homelessness ensuring that\nNo matter what social ills a person deals with that they are entitled to housing everyone is entitled to shelter and not help provide some real grounding to my work of what is the potential of a community you know\nIf you have a community that is really unified and its mission and its purpose\nYou know I think the balance our and less and so you know we're just a small nonprofit but we were helping so many people because you know we're working with the religious leaders and we're working with state agencies and we're all really doing the work just service one mission that\nNo one should have to live on the street right like no one should\nBe cold and the data Boston winter and write this all has spiritual grounding as well as I think that was a place where I saw that both of these could work together\nDo you do you look around that you know again in your late twenties about to hit thirty and say you know my peers believe that this can be solved\nWhatever whatever this urgent problem isn't of course there are many I mean that's what we were saying when overwhelmed right by the by the news cycle and what what's going on in our politics today but I I'm interested in your sense of ...\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA ... dot org\nRight once we're running the levers of government or whatever this will look different I just I guess I Want a sense of where the optimism flows through your generation\nYeah that's a really good question you know we have a lot of young people come on the pod cast\nAnd\nThey're doing various different types of work some people are working on immigration we have people who are poets and people doing that justice work\nAnd I think\nWhat I see across the board and all these avenues and I think this goes back to what I was mentioning earlier about lying is that\nPeople are really searching for the truth and their work and I think that I see this with a lot of young people as you know there's a saying like keeping at one hundred [laughter] it was like hey and\nSo given at one hundred means keeping it like above the board you know what are you really saying what are you really talking about why can't we really accomplish what we say what we want to do you know why what's happening in the background what kind of deals are being made that is really blocking us\nFrom getting us where we need to go\nAnd ... if if that's clear to you I think for me this means you know no more fake news [laughter] like I I Want the real news right which is why you see Twitter being a really popular platform right because you can hear from people on the ground versus you know watching a major news network\nThey're like oh no rife with fake news\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nHow can we create a space where that is possible where we all have access to freedom justice and equality you know and I think those three things are what I see young people really looking for it and in order to do that we have to have\nLike the truth of what is happening exposed I mean and I think we see this in politics too right is just like\nVoting you know people have a right to vote but why you know and I am here in Georgia right and\nThis is a big thing now where you have you know Brian Kemp then Stacey Abrams running for governor thousand yeah for governor and fifty three thousand people primarily black people in this state or having\nA pending voter registration and so you know it's really searching for why is this happening how is this possible\nUm when you say these people should have a right to vote but in fact they don't\nUm and so you know people are asking a lot of questions which I think is always get right and I think across every generation the young people are always asking the questions\nThat [laughter] older people probably don't want an answer [laughter] even when you think about you know relationship with the parent and a child and the child is like you know mom why you know why do we have to do this for dinner tonight and she's like don't worry about it just it is for dinner\n[laughter] [laughter] exactly and\nThat's actually a little bit clear of what I mean by searching for the truth really asking you know the difficult questions of why is this happening why is this happening now and what can we do to make it better\nYou know part of the process of asking the question though is having\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nCynical about that and we we uh America is in some ways powered on the idealism right of the next day and the next generation\n... but we're in such a you know I mean ... the the series here this American moment we're in a moment of such cynical polarization and I I'm really interested in is as to whether that mute the idealism that we rely on\nYeah you know I think it'd be really sad\nWorld [laughter] if you couldn't have this hope in idealism is you relied on cynicism you know that seems like a miserable existence really and I think you know we don't know the future\nWomen who will\nTurn to alternative forms of doing yoga you know eating healthy and doing all of these things that are essentially the same thing that for me is the purpose of spiritual journey is to Clinton's yourself and rid yourself of things that you know don't like and hinder you from progressing in this world\nAnd so I mean I I guess that is my answer to like why you should be Muslim now [laughter] what needs to be ... like ... it just a chance to really improve your\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR list dot org\nThe expectation from outside Muslim communities and inside of what it means to be a black Muslim woman that this is the assimilation I think that I was yeah that I was asking about like here's here's what that looks like\nAnd is there tension from you know your generation saying but it can also look like this and that might not conform with\nI don't know the white American version also of one this is right tension between expectations of identity and then pushing the the uh you know barrier or the the envelope I guess around those expectations\nYeah that's a that's a good question I think\nI have found this tension maybe the most you know I got married two years ago [laughter] yeah\nAnd you know I I always laugh of my friends because we did not think that I Would be the one [laughter] when I marry yeah yeah yeah you know I was never ... I was never into it I I was very much like you know\nI'm I'm doing my own thing I have professional goals I have you know all of these goals that did not involve marriage\nAnd I\nWrite before marriage I I was a black Muslim women and women and I still am but I think after marriage I've experienced more of a tension as you know I didn't mean to be a wife and miss\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit while he WC A. M. P. L. S. dot org to learn more\nReally really selfish [laughter] that that's one of the things that I'm working on\nAnd having concern for another person I think it's something I had to think deeply about and even just taking the Muslim part aside just thinking about being a black woman in this country you know I grew up during the time or on the news you know everyone's talking about why can't black women find a man you\nKnow black women are really single um and then all of these movies in pop culture about like\nBlack women trying to find a man and stumbling on that path to trying to find a man and that can be really discouraging like imagery to see right and so you almost have to think like\nHow can black women keep the man and I think the same thing happens when you look at black Muslim women were you write you still do have a lot of single black Muslim and and I will say just if we're thinking about the larger frame in this country just like divorced as high as la ... right right and\nI think a lot about you know how do I want to present myself as a black Muslim woman and I am a wife\nBut I'm Still a class [laughter] um and so it's hurting and having family goals and professional goals and trying to figure out how do I balance those two I don't have an answer for that [laughter] but just stepping into the reality\nYou know I Am a woman and you know I Do want to have children and like what does that life look like for me and and then within Muslim community is you know we had an episode a few episodes back where we talk to black Muslim women about dating\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nCan be really difficult and because because why because I mean\nIt's black was Muslim women become ... some of the least desirable and when and when you're dating and their stories you know we hear from friends and even on the episode about\nEven if you are okay only dating black men you also know that the chances are they're\nDating pool being will open more to outside of black men is very limited so that means that you know white men aren't really looking to marry you South Asia or from men aren't looking to marry you [noise] like I\nKnow in basically really wants to date a black woman and so you ... I remember you said yeah and the podcast\nYeah so that's says really hard and I think right almost causes it can cause\nYou to have very low self esteem when you look up and you're getting older and older and you are able to find a spouse and so I think that that's a very that's a very real thing and that's a very difficult thing\nUm if I remember that that episode right or you were also talking about online dating right which is where a lot of people are finding um people to to hang out with\nAnd I think someone was saying that um there's a lot of I mean not just on not just on the swipe left swipe right thing but there is right on tinder but mhm that\nProgramming is supported by white WC Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more YWCA M. P. L. S. dot org\n... why I mean yeah okay so we we have the statistics that support that I think from some of the dating sites but why is that\nYou had to hand it\nEat I [laughter] I mean I understand it as the racism that it is and I don't think that people have their preference right so some people just want to date with than their racial group and I don't think that there's necessarily anything wrong with that I think the issue is when\nYou are making a conscious decision that I don't want to date these group of people because I don't think that they're attractive or I think that that is right you're holding all these notions of what a group of people are ... and I think that's problematic and I don't think the blame is necessarily on the person right I mean\nIf you look at it the imagery of black women in this country right so\nYou know specifically in this country we started off you know in slave HUD and so\nOur bodies were poverty and you could have them out will right\nAnd so I mean there's the idea that you don't have to marry a black woman but you can sleep with her\nAnd and you can do whatever with her our bodies are for sale and I would say even today it's still you know black women are highly sexual allies\nAnd so you don't see us pictured as like a man me right like a house worker ... I Am but you'll you'll see as high priced actualize in the media\nI think very rarely do you see images of black woman just like being normal [laughter] you could just just going\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nThey kill selenium and Mara Brock Akil I always talk about them on that show [laughter] because they're black Muslim couple\nAnd they do I [noise] they they do production television shows um and so she had to show girlfriends that I really lives that just showed black woman I'm going to work being in relationships\nAre trying to figure out themselves and recently she was also a guest on the show but her name is Nigel ... and she has this film Gen ... which I recently saw and she also highlights the experience of black Muslim women and she does it really interesting because it's intergenerational\nAnd a mother who it is converted to Islam and navigating what does it mean to be a black Muslim woman in this country and that is a really fascinating journey she takes us there of just uh she she starts to cover she works in a new studio and she's trying to figure out like\nHow to be a black Muslim [laughter] um which is really interesting and then her daughter you know is in high school and so to see that as well I think gives a great insight into what that experience is like and so I identified with a ... a lot\nOn the show that I'm going to mention couldn't be further from what you've just described and yet and insecure gets a lot of you has [laughter] for showing somewhat which you've described what it's like to be\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more you've heard a lot of stories\nThis past year unexpected ones complicated ones stories of joy and surprise sadness and hardship no matter what stories the next day or the next year brain MORNING EDITION will tell you what happened listen every day\nAfter day during the show we had a caller brings up the debate about sanctuaries states\nUp one litter so to become a ... it's similar to California um\nThat's just too much burden on the facts fares\nSo it's clear Republican voters are worried about immigration and their candidates are listening Senate candidate Karin Housley brought up immigration in a recent interview with KFC pie\nWe want them to come here legally and not not to come across our borders illegally and and we don't know who they are because that does not keep our citizens safe\nI'd like to hear from Republican and independent voters about what you want to hear on immigration from the candidates support can be specific just talking about border security isn't enough you can call in six five one to two seven six thousand\nFour to eat meat that carry NPR coming up after his hours and then [noise]\n\nLife from NPR News in Washington I'm Lakshmi Singh Sandra Day O'Connor the first woman to serve on the United States Supreme court is publicly acknowledging that she's in the early stages of dementia and probably Alzheimers disease\nNPR's Nina Totenberg says the eighty eight year olds confirmation of the high court in Nineteen eighty one open doors for women across the judicial system it wasn't just that she was a symbol\nShe was very active about that really pushing pushing pushing to get more women into the legal profession\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nAnd helped pave the pathway for women who may have faced obstacles pursuing their careers\nNPR's Nina Totenberg the Supreme Court is temporarily shielding commerce secretary Wilbur Ross from having to sit for questioning under oath for the lawsuits over the citizenship question on the twenty twenty cents is\nNPR's Hansi Lo Wang reports dozens of states cities and other groups are suing the Trump Administration to get the controversial question remove a lower court had allowed the plaintiffs\nAttorneys to question commerce secretary Wilbur Ross about his decision to add the citizenship question to the twenty twenty cents is\nFor now the Supreme Court is siding with the administration which has argued that the court should resolve these lawsuits based on internal documents the administration is already released the first potential trial over the citizenship question is expected to start in New York City on November fifth\nBut in a separate opinions Supreme Court justice Neil Gorsuch noted that the trial may have to be postponed if the Trump Administration asks the high court to hear these cases the plaintiffs suing the administration worry that using the census to ask about citizenship status could harm the accuracy of information collected from the census on the long NPR News New York\nTurkish president regimen type baritone wants his evidence strongly points to a plan Saudi operation to kill a journalist and the Saudi consulate in Istanbul NPR's Peter Kenyon has more on air to one's remarks about your mouth ... death\nEveryone says members of a Saudi teams that is done bull in advance of the killing scattered out potential areas to dispose of a body he also says although the Saudi consulate as diplomatic territory this was a murder committed on Turkish soil do an interpreter he called on the Saudi Government to allow the Eighteen people arrested in connection with the show he's killing to be processed\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\nThat broke out after he entered the consulate October second Peter Kenyon NPR News ...\nBy the way CIA director Gina Haspel traveling to turkey to review the case and this is NPR any\nSupport for news comes from the alliance for lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for lifetime income down or\nFrom Minnesota Public radio news I'm Steven John hundreds of volunteers are fanning out in an area of northwestern Wisconsin as they search for clues in the disappearance of a teenager more than a week ago Brian Granholm leaves you know clear he in a companion showed up in Baron this morning to help find Jamie claws\nWe both live in the local area we worked together we saw was going on and they needed help and figured we'd come out and let out of hand if we could help to have some success today and can find something that'll help solve the investigation a\nThirteen year old clause disappeared October fifteenth the same day her parents were found shot to death in their home outside the town of barren investigators are looking for two vehicles that might have been near the cost home\nResults of a new NPR News Star Tribune poll show at Republican Doug ... now leading by seven points in the race for Minnesota attorney general temp ... reports\nSurvey of eight hundred registered voters last week found forty three percent support ward low compared to thirty six percent for DFL Congressman Keith Ellison sixteen percent were undecided a poll last month showed Allison in front by five points\nWere low is still relatively unknown with fifty six percent are recognizing his name it's an improved\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nTwenty one percent do not and forty nine percent sure the polls margin of error is plus or minus three and a half a percentage points Jim Pogue by or Minnesota Public radio news\nThree am shares fell as much as eight percent in mourning trading after the company reported financial results that fell well short of investor expectations\nThe maple would based manufacturers said its third quarter sales fell slightly and the company trimmed it's expected profit for the year three of them is also deleting factor in the Dow Jones industrial average falling more than four hundred points this morning three AM's results are\nAdding to invest your anxiety over the global economy and corporate earnings\nMainly a cloudy and the north and central part of the state today as well as the north east uh highs upper thirties northeast in your fifties southwest it's eleven oh six [noise]\nGood morning I'm Carrie Miller this is NPR News coming up how Minnesota's midterm candidates are talking about immigration but first why the race from Minnesota as attorney general maybe one of the election days biggest surprises\nWhen Congressman Keith Ellison decided to run for state attorney general his supporters assumed that his name id and political experience would make the race a fairly easy one to win\nThen allegations of domestic abuse surfaced which Ellison has denied\nNow our new NPR Star Tribune poll reveals that for the first time this season Allison's opponent Doug wardlaw is leading were turning to Humphrey school political scientist Larry Jacobs for some insight on how voters are seeing the race and the issues Larry welcome good to talk to you again\nJak hey I think it is\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nCongress and possibly run for attorney general but he held off doing that and actually said he wouldn't because Laurie Swanson indicated\nShe was going to run for re election as attorney general\nWhich clear to feel the Democrats and the high quality Republicans\nAnd lo and behold at the endorsing convention for the Democrats lowest want some pulls out of the attorney general's race and jumps into the primary for the governor's race which ended up losing of course\nTo to waltz so all of a sudden\nKeith Ellison jumps into the attorney general's race\nOr along with a number of other fellers two runs in the primary and he ends up winning a primarily because I think he was better known 'em ... and had a lot of support among the progressive wing of the Democratic\nParty Larry as you note I mean the thousand has good name id he was in it I said very safe congressional seat what do you think the calculation was before we talk about why he's having some trouble with that calculation\nI think he was bored and Congress have been on the market for a long time and a wasn't much fun and he was looking for new challenges and thought he'd come back and the attorney general and kind of advances agenda I'm back on the state of Minnesota\nDo you think there was also an idea of I can do this job for a while and then maybe I'm well positioned for a run for governor at some point\n[noise] uh yeah I mean I think is also is\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA and he L. S. dot org\nAnd I think the point was that America is a country of many religions and one of our blessings is that we respect that and you know this was a barrier that John Kennedy had across because she was Catholic\nUm and you know I think we are at a point\nOf transition where our idea of identity and religion is being a you know challenged Keith also may be part of it\n... the other the other thing we haven't mentioned is we're all assuming a cultural moment where women are speaking out and talking about their experiences of sexual harassment and sexual assault\nAnd you talked to some voters are you watched social media on this and women say I believe her even though she said she had evidence and we haven't seen it\nI'm inclined to believe her so maybe the hall attacks in a larger sense right of this me too movement are having an effect on this\nOh I think the effect is huge frankly you know I think the me too movement has been a big force of twenty Eighteen so I think I also hear from um [noise] my friends in a in a DFL party that they feel\nThat the me too movement is had kind of a\nUnequal effect um it does is\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nLeery that Keith Ellison at this point um think that it would do more damage to be on a debate stage with Doug word loan than than not\nI ... in my view a Keith also at this point has nothing to lose he is ... in my view is a good chance he was going to lose this race the way it's currently set up because\nThere's so many questions about Keith Ellison he's become the point of referendum on this race and there are a lot of anti Elson race or voters out there and instead I think it needs to get out there um and begin to define the word low there's a lot there that\nDemocrats and independents don't know about him may help that fifty six percent this is a poll of registered voters there are gonna be another set of voters are actually turned out the likely voters ... and those folks um\nParticularly in the twin cities might be inclined to to support case also in a higher rate than they are right now if they saw as his campaign and his his agenda\nWell time is short them right we have two week that\nThat is the problem and\nYou know ... that's why I say at this point the advantage isn't as toward lows um court because the clock is ticking and that is a very powerful threat to key fellas and he's going to run out of time\nLarry I always appreciate the insight thanks much yep good to be with you Larry Jacobs with as a professor at that Humphrey school and director of the center for\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA and he L. S. dot org\nOr talking to voters talking to their constituents about this debate about immigration said well we'll get to that on the other side of news first at John Wannamaker with Steven Johnson high ... fine thank you chief justice John Roberts says he is saddened to learn that Sandra Day O'Connor has the beginning\nOf dementia the first woman to serve on the Supreme Court shared her prognosis in a letter today O'Connor now eighty eight took her seat on the Supreme Court in Nineteen eighty one and retired in two thousand six\nPresident Trump has dispatched the director of the CIA to turkey in a quest to get more information about the death of Saudi writer ... showed G and weigh a possible us responds Trump said yesterday he's not satisfied with the explanations he's heard about the Washington Post columnist and critic of the kingdom who died October second at the Saudi consulate in Istanbul\nPresident Trump says he will nominate a former executive at agribusiness giant Monsanto they had the fish and Wildlife Service are really a skipped with of Indiana is currently deputy assistant interior secretary for fish wildlife in parks biologist and lawyer\nSkipped with spent more than six years at Monsanto and has worked out the agriculture department and U.S Agency for international development the fish and Wildlife Service has been without a Senate approved directors since Trump took office in January twenty Seventeen\nStocks are falling sharply on Wall street extending the markets recent string of losses the latest wave of selling came as investors grew on unsettled by slowing economic growth in China and the costs of President Trump's aggressive trade policies Minnesota based three M Ms down six percent\nDown six percent after falling eight percent earlier in the day caterpillar was about seven percent\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth\nVisit YWCA M. P. L. S. dot org to learn more services with over a century of experience and business energy needs including consulting strategy and pricing information at Central point energy dot com slash energy services\nOn the next to NPR News presents a new debate from intelligence squared as dams gear up there twenty twenty presidential campaign which passes\nBest and the debate motion progressive populism will save the Democratic party was in at noon and nine PM\n\nBusy days can always listen to the show at nine eleven you can find all of the conversations on the podcast what are you listening to you right now our show on mid career changes and our series on this American moment coming up tomorrow morning\nIf you can't catch this listen back to at the facts about this migrant caravan heading north not the political rhetoric on at the facts that's tomorrow morning at nine [noise]\n\nI'm Carrie Miller and this is NPR News now what you're hearing about immigration from the campaigns and what is true this\nElection is all about vision one candidate sees in Minnesota where we all lose our health insurance ... down to one government plan where we become a sanctuary state for illegal immigrants and where we all pay even\nJeff Johnson grams a lot of issues into that TV ad attacking his DFL opponent Tim Walz but he made sure he included immigration\nBecause he's seen polling that says Republicans put it at the top of their mid term concerns what to Minnesota voters particularly Republicans want from their elected leaders on the issue\nEspecially since Congress has failed to pass emits\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nOn immigration from the candidates that you support what are you really put aside a lot of the inflammatory campaign rhetoric on immigration what is it you particularly want from the candidates here in Minnesota and beyond\nThese specific just talking about border security isn't going to get us very far so I'd like to know specifically what you're interested in calling on independent voters and Republican voters this morning and for everyone\nThink about what happens after the election on immigration okay here's the phone number six five one to two seven six thousand\nEight hundred two for two twenty eight twenty eight and on Twitter at carry K. E. R. R. I. NPR\nAlan Gomez is with us he's a reporter for USA Today where he writes about immigration policy and he's in Miami an Alan welcome back to the show good to talk to you again\nThanks for having me ... is with us he's the chair of the political science department at Oxford University and in the studio with me welcome Andy good to have you here\nAh let's get the microphone turned on there for Andy ... so anti immigration surpasses jobs and the economy when Minnesota Republicans are asked about their top issue why I mean is this a particularly\nUrgent issue inside Minnesota or are they ... some of the debate a happening nationwide\nI think it's more the latter part there's no burning issue right now the economy's doing very well there's some other problems obviously but they're really caught the attention of voters so immigration just kind of bubbles up by default\nWhat do you think uh Allen is happening with uh this latest news that's put this front and center and that's the migrant\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nSingle day and tweeting about this every single day is having a profound effect I'm you know in Minnesota actually\nI've been looking at a congressional debates around the country and including Minnesota and\nIt's amazing how many immigration questions are are in places that are so far from the southern border um you know I was listening to uh uh the second district congressional race between a Republican representative Jason Lewis and a Democrat they're Angie Craig right and\nI eat a lot of ... extremely poverty in like ...\n...\nI I have like you do is we which is us citizens to wait for her to the fire is for me I have to wait ... years or a little bit less to do that in the same\nWay that I I I'll die if I have a chance to come here to have a better life I Will try that's it\nYou're not saying if you had to do it legally it would take a very long time now that you've been in the country that long\nExactly and they have no interest to make it easier legally because for many of them have kids or voting they think some days they going to vote and the way they damage their image through the events they know\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nFor when he he is a A N E S I hadn't go my what that is that this for eight years\nBecause we we can afford to go we have a problem we go there was like what the hell's up by\n... ... if I might I I really appreciate the call you've set a lot and I don't want to miss it a Allen I Want to come back to you I you know there is a lot of the um misinformation correcting\nBut often I think those facts or get buried under the kind of campaign rhetoric and and the stuff that President Trump says about immigrants and I I don't know why the facts don't prevail\nYeah and it's interesting the earlier the previous caller Germany hum didn't sound like it was a very you know intelligent well reasoned understanding person who's willing to look at the ... several sides of this and then at the end he kind of mentioned the idea that\nNow but they want to come here for the benefits life as you heard from ... undocumented immigrants it's not like there's this wide variety of benefits that they that they can that they can receive\n'em as he's mentioning there is no you don't get healthcare and certain extreme cases if you're about to give birth if there's a if you have to go to the emergency room yes you you you can get treatment um but it's again you from as you heard from him\nYou're not getting regular checkups or you're not getting regular prescription but you know it was only extreme things that you receive 'em that other point that he mentions that they're just a drain on the economy undocumented immigrants pay\nFederal taxes they pay into our Social Security system they pay into her Medicare system but\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nYou know they receive some medical benefits in extreme situations but they also pay in quite a bit I'm sure there's a reason to living here he's paying rent who's ... who's buying things that his local stores and so that balance of trying to figure out what the real costs and benefits of of\nImmigration to begin with and specifically illegal immigration is hard enough to have between the economists but as you mentioned earlier doesn't quite fit on a bumper sticker so it makes it very difficult to have a well reasoned debate on that\nConversation this morning if you've just gotten in on it with Alan Gomez from USA Today and ... from the political science department at ... university\nTaking a look at some of what Minnesota candidates are saying about immigration and national candidate and then the national rhetoric from President Trump on immigration and trying to apply some of the facts\nThat often gets subsumed by the political rhetoric but also to try to understand how voters are thinking about this and this is where you come in\nAs a Republican voter as an independent voter I'd like to know what you want to hear from the candidates the real facts of the real policy thinking on immigration be specific talk to me about more than just border security what are you looking for when it comes to\nProblem solving and concerns about immigration six five one to two seven six thousand I'm On Twitter at carry NPR were Gordon says ultimately the U.S is going to have to reconcile the fact\nThat we already have a population of three hundred and twenty million people with the reality that we can't maintain high immigration levels\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nInterest but our current laws need to be followed the government's main job is to maintain security in order and you can I ask you what you hear in in a couple of those somewhat contrasting views\nWell I think there's some very reasonable questions the last one about costs\nWe really need to have a debate because when economists have looked at the evidence they felt some interesting things at the national level immigrants are probably a net positive but at the state and local level they may be a net negative because the heavy services that users things like education\nAnd so we need to have these kind of debate should there be some transfer funds to make up for the cost the state and local level and so those things are asking I think are very sensible\nSo so when you say um we would see different ah implication of cost a statewide or community wide again that would be because you are using services that are funded by state tax payers in a way that you're not by the way we pay our national\n... exactly and and of course they don't qualify often for many federal benefit right so the feds may come off a head and states at least heavy immigrant states such as California may come off a little behind and so there really are um these kinds of discussions that should happen and they're getting drowned out by this emotional rhetoric\nI I Know I've talked to you about this before why Congress\nOr you know kicks the can on this over and over again and then that the ... line is always well after the next midterm or after the next presidential and it doesn't happen have you essentially given up on a serious effort for immigration reform from Congress\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more ad YWCA M. P. L. S. dot org\nOverhauls um the things that are needed I just don't see how it happens I mean the last time we got close was in twenty Thirteen when the Senate passed a bipartisan immigration bill that affected all these things that are that we're talking about still borders and your guest worker program so worker verification\nUm a lot of the economic issues that we're talking about here um but the house didn't even take it up and we didn't even propose their own solution and so ever since what we see is the occasional effort to\nTo to talk about immigration and Congress I'm right now we're we're we're gonna have a debate after the election at some point when it comes to the eight hundred thousand or so\nDreamers who the president is trying to end to the DACA program I'm so there'll be forced to have that\nBut that's going to be very difficult because it exchange for protecting those dreamers are ... Republicans have already made clear that they're going to demand their entire laundry list of things that they want border security works on force and all these things so it's going to be it's going to be difficult it's going to be ugly\nUm but I just don't see how especially if one of the houses are chambers of Congress flips\nI don't see how they reach a resolution that's going to be very very difficult\nAnd here's a here's an indication of how Minnesota candidates are talking about this issue of immigration distance from my first district debate between a Gen had to learn and Dan see and here they are are arguing about the idea of immigration policy\nIf our entire focus is spent on the idea of the wall we are going to miss things that are\nWell sorry about that I it appears in something happened to the tape will try to cue that up a get let\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nI Am independent yes yes um what I wanted to say it I just think that we need to have um a better vetting system\nIn general and and I know it sounds kind of broad term that I think that you know if you look at some of the other countries like Canada so the other European countries who kind of try to have it more job specific\nUh-huh for people who are coming in\nUm I Know it's just like that also takes great you know changes or you know how the expansion non departments and unemployment and maybe we don't have a system wide you know access to do something like that\nBut I think that if we you know did a better vetting system to having people come in here and more jobs specific got it and that could be of you know anywhere from\nYou know low income jobs are high income jobs I think it would help you know people who are in the United states feel a little more comfortable because us being here we also struggle ourselves\nIs your Twin Cities forecast it should be sunny for the rest of today with high in the upper forties wins out of the northwest around five miles per hour\nLater tonight overnight lows in the twenties women shifting to the southeast after midnight bringing a little bit warmer temperatures on Wednesday mostly sunny with eyes and the low fifties southeast wins five to ten\nPartly cloudy on the evening on Wednesday and then plowed scattered showers after midnight overnight lows around forty degrees south wins five to ten miles per hour\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more [noise]\nOn your own hair each week we recommend great new movie to see in the theater and those are also the movie screen at home it's only talk once a week on why should you\nBe centrist policies we backed disillusioned working class voters or moving a progressive or democratic socialist direction ... were debaters coming up\n[noise]\nLive from NPR News in Washington on Lakshmi Singh a major investment conference allowing for billions of dollars in deals is underway in Saudi Arabia however in recent days and weeks a flurry of individuals and organizations including prominent Americans have backed out\nNPR's ... report certain guests are distancing themselves from the Saudi crown prince who is widely suspected of ordering a hit on a Washington Post columnist who died inside of the Saudi constantly in Turkey\nArabia's future investment initiative was all set to attract CEOs from across the world then journalist ... D disappeared in Istanbul in Turkey said there was evidence Saudi Arabia hadn't killed many Americans pulled out of the conference including the CEOs of black rock in gp Morgan Chase and treasury secretary Steven Mnuchin\nBut there's still a crowd gathered in Riyadh including business leaders and heads of state Saudi Arabia says it's signing fifty billion dollars worth of deals on the first day of the three day conference mostly through the state oil company\nAnd appearance by Saudi crown prince Mohammed bin Salman was greeted with applause he told reporters the event was going well with quote more people more money can you hold on\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nThree eighty five and the years you can uh good she says a decline comes on the heels of volatile trading and Asian markets\nConcern over a slowdown in Chinese economic growth as well as increase global tensions between the U.S in Saudi Arabia over the death of journalists them all to show G are making for jittery markets\nChinese stock markets reverse some of their sharp gains of recent days and other Asian indices closed down two percent or more that sell off continued among European markets\nIn the U.S weak quarterly earnings from three AM and caterpillar attitude concerns that the global economy could be slowing down there was also a sell off and technology stocks as Tobar continues to prove especially volatile you Gucci NPR News\nWashington and now he's seen as the Dow is down two hundred thirty three points under one percent of twenty five thousand eighty three\nSandra Day O'Connor the first woman to serve on the Supreme Court of the United states is in the beginning stages of dementia\nIn a letter she released today the eighty eight year old O'Connor announce it she may be facing all ... disease O'Connor says she was diagnosed some time ago she says her condition has progressed and she's no longer able to participate in public life\nBut O'Connor's letter emphasizes what she describes as countless blessings in her life including when she made history in Nineteen eighty one as the first woman justice on the U.S Supreme Court\n[noise] this is NPR News\nFor news comes from farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life ups and downs coverage options and more information can be found at farmers dot com\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA and he L. S. dot org\nThey search the area around the home for two to three miles\nThere being brave to look for anything that they feel is suspicious or auto place you know brand new ah laying in the ditch or the field or wherever anything you know like a piece of clothing obvious things like a fire on something like that\nFitzgerald says he believes Jamie ... is still alive law enforcement officials have not said why someone fatally shot fifty six year old James clause in his forty six year old wife Denise in their home early last week but Fitzgerald says Jamie was at home at the time of homicides\nDemonstrators wearing dark hoods and masks disrupted a dilute city council meeting as members considered purchasing additional protective gear for police the protesters chanted no riot gear for the D. P. D. as the council trying to debate the eighty four thousand dollar purchase of helmets advisors in elbow and chest pass\nBut after a recess and without any discussion because of the noise the council voted sixty two last night authorized the purchase\nPresident Trump has endorsed third district representative Erik Paulsen who's seen as one of the most endangered Republican incumbents in Congress in a tweet today Trump says Paulson quote has done a fantastic job in cutting taxes and job killing regulations Trump issued the tweet even though Paulson has kept his distance from\nPosting skipped Trump's rallies in Rochester in Duluth and has said he didn't vote\nFor Trump in twenty sixteen\nVariable clubs today from Minnesota highs in the thirties in the arrowhead to around fifty in the southwest in the twin cities now forty three degrees it's twelve oh six\nNPR News present is supported by ... will get since even Minnesota law firms since Nineteen Seventy four\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot\nOrg to learn more ever party controls the U.S house a new speaker will be elected the current Republican Speaker Paul Ryan of Wisconsin isn't running for reelection\nIf the Democrats take control they don't need to decide which person is best suited to lead the Democratic party in the Congress and of course the ... presidential campaign will get underway shortly after these midterm elections\nThe intelligence square to series held a debate about the future of the Democratic party and whether it should head in a more moderate or a more liberal direction [noise]\nGoing\nWork for the Democratic party work in the sense of getting more voters to choose the color blue and then stay there beyond the two thousand Eighteen midterms all the way into twenty twenty well some say that the Democrats need to swing more to the left\nTo the kinds of ideas and promises and under the rubric of progressive populism set the party of standing for game changing policies like Medicare for all or tuition free public education or guaranteed federal jobs program\nBut hold on others say including a lot of Democrats\nThose are promises that cannot possibly or reasonably be kept and they may sound so radical to so many that they will push more voters away then they will pull in better they say\nTo let them stay close to the center and let the Republicans look like the outliers who is right well let's find out because we think this has the makings of a debate yes or no to this statement progressive populism will save the Democratic party\nI'm John Donvan and I stand between two teams of two thinkers on this topic who will argue for and against that resolution as always our debate will go and three rounds and then our live audience here\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\n[noise]\nThree word us\nYou are senior advisor and national spokesperson for move on dot org you're also a lecturer at Columbia school of international and public affairs before that\nOh you were in the White House under President Obama you worked on both of his presidential campaigns your campaign manager for the ACLU initiative on reproductive freedom and most recently the deputy campaign manager for Martin O'Malley for president that is a lot of political experience you have credited your career and your success to your parents and why\nWhy uh my parents are from Haiti they are immigrants they came here decades ago at the time Haiti was a dictatorship\nAnd they wanted the American dream they had heard about the American dream and so they ended up here in New York City grew up in New York\nAnd they've worked so hard and their heart and determination their love for this country in the country where they were born really gave me the fuel to do everything that I've done and because of them I still continue the work that I Do through move on credit don't care\nI think [noise] and your partner is Jeff\nWe're halfway through the opening round of disability spurred us debate I'm John Donvan we have for debaters two teams of two arguing it out over there\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nAs support for the concerns of ordinary people\nPopulism is not about right versus left but it's about top versus bottom\nHow do we fight against a society that benefits\nThe privilege the elites now there are many forms of populism Donald Trump has his form of populism rhetoric but his populism as right wing white nationalist populism he chooses to divide\nUsing race religion immigration status and gender progressive populism unified and brings us all together\nThe late Senator Paul Wellstone used to say we all do better when we all do better\nWe also have to talk about the power of systems that are created to benefit the privilege and beliefs and I'm Talking about white supremacy I'm Talking about patriarchy Islamophobia what professor populism does its fights against that it says no to that\nNow how do we move forward my parents were immigrants my dad was in New York City cabdriver my mom a home health care aide the issues that matter to them also mattered to their white working class counterparts\nProgressive populism have solutions are solutions are actually incredibly popular\nFor example Medicare for all lake research did a survey back in April and asked\nVoters in battleground congressional districts how they felt about Medicare for all fifty four percent strongly support Medicare for all but I think the most interesting thing about that survey was that Democrats who are infrequent voters it\nWas more popular with them\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nDonald Trump won Texas by nine points better rock as authentic he's fighting for the people he's progressive\nHe's not taking pac money's not taking corporation money and he's doing really well in that race Wendy Davis who lost the governor's race a couple of years ago by twenty points said that she would run a more progressive campaign if she were to do it again\nAndrew Gillum incredibly progressive making history and he came out in the general election has been leading in all of the polls in Florida\n... one by one or two points all the past democratic candidates who were who are in the middle have never done as well and he's doing right now look it's not going to be up to us who are on stage that is going to decide what the Democratic Party is going to do it's going to be up to activists\nAnd voters out across the country and they're making it loud and clear they want the Democratic party to challenge the status quo and to fight\nFor the Ninety nine percent not the one percent\nOf\nThe revolution repressive losing the Democratic party here to make\nHis statement against the motion please welcome Steven Rattner chairman and CEO of Willett advisors and\nFormer councilor for the secretary of treasury [noise]\nAnd I consider myself a progressive and I consider myself as a fighter for the Ninety nine percent as I think it should be defined I Believe that our tax system excessively favors the rich\nI Believe that income inequality in our country is a reprehensible levels and must be addressed I Believe that the federal government should lean in and try to solve the pressing problems of those who have been left behind\nBut I don't believe that endorsing policy ideas that are either unaffordable\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit one WC A. M. P. L. S. dot org to learn more\nAccess to the rich certainly not Bill Clinton and not even Brock Obama who Senator Sanders attack this week for not pushing more progressive policies then there are other lose\nGeorge McGovern who carry just one state and the district of Columbia in Nineteen Seventy two in Nineteen eighty four Walter Mondale suffered exactly the same fate all of us up here agree that the election of Donald Trump was one of the saddest days of our life [noise]\nWithin an approval rating hovering around forty three percent there's no way he should be re elected but if we want to make the unimaginable imaginable just nominate someone out of touch with the mainstream of this country\nRemember that only thirty three percent of Americans are even Democrats at all the share of independence at thirty seven percent is the highest in twenty seven years\nYou've heard the suggestion that Bernie Sanders could have eaten Donald Trump will never know but we do know a few things the\nFact that democratic voters are increasingly concentrated geographically particularly in the blue states like New York and California so to when we must reach out more moderate voters in Pennsylvania in Michigan and in Wisconsin three states that we never should have lost\nYou've heard turnout blamed for Secretary Clinton's loss but at sixty point one percent turnout was hiring two thousand and sixteen than it was for Brock Obama's re election in two thousand and twelve\nNow let's turn to policy guarantee a Fifteen dollar an hour income to all that would cost on the order of six hundred and eighty billion dollars annually expand Social Security that sounds pretty good until Americans understand that the trust fund is on track to go broke and twenty thirty four and jeopardize the benefits that we've already promised make public\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nOf his bill abolish ice only thirty two percent of voters want that wall fifty three percent understand that immigration and customs service albeit with reforms is something that we need to have\nI share the goals of the populace but we should address the critical issues facing our nation by putting forward responsible fruit and policies that will attract the coalition of voters that we need to keep Donald Trump from another four years of destroying America thank you\nThank you Steven Rattner round one of us\nWe live on around too and in round two the debaters address one another directly and they take questions from me and from you our live audience here in New York City what we seem to be hearing about is a dispute over how many voters\nWill respond to the set of policies that are identified with progressive populism the team arguing for the resolution ... and Jeff Weaver they described in this country a sense of emergency in light of things like seeing a phobia and ultra nationalism and racism\nA tension between top and bottom and in that framework they say these are solutions\nThat appeal to the bottom ideas like Medicaid for all free public college tuition abolishing ice housing as a human right\nThe team arguing against the resolution Jonathan Cowan and Steven Rattner they identified themselves as progressive but they said the problem is political reality these ideas will scare the public they look great on a bumper sticker but\nIn reality voters will not go for them they cite instance after instance were given the opportunity to either vote for these things they voted against or when put in place they ultimately failed and I want to take a question to Jeff Weaver from something that your opponent said in that Democrats\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nThan we had a hard fought Democratic primary between Secretary Clinton and Bernie Sanders and the evidence was pretty clear I've seen a zillion polls in a zillion states Bernie Sanders was winning rural Democrats conservative Democrats moderate Democrats\nSecretary Clinton was doing much better would suburban Democrats who on paper looked liberal because they are ... pro choice support that ended a little warming and so on and so forth\nSo the modeling that was done is clearly showed that Bernie was winning the very voters that you're talking about it and read places there were coming out overwhelmingly for Bernie Sanders which is why you won or Oklahoma you want to Kansas he won in Nebraska you want to Utah when in Idaho and on and on and goes and in fact it is these voters that I'm arguing we need to bring back into the working class voters in red states\nThis question about geographic concentration of democratic support is a very very serious problem that we have an electoral college system when we need to broaden our support geographically and the way you do that is by being unapologetically undecided working people in these states we all forget to\nThe mid west of this country used to be the center of progressive politics in this country the planes case we have lost touch with those people because the truth of the matter is that there are many people in that wing of the party\nReally don't like those people very much okay just let me break into let your opponents respond to some what you said is it a lot John ... and Jeff is saying that those voters and the red states that you say it would be driven away by these ideas would not be driven away\nWell let me address that but first let me just the last comment you made and maybe I misunderstood it but if you're saying that I Do not like a bunch of working class voters that beyond offensive and ridiculous but a family of five years of my life\nTo democratic policy in policy making the debate is not whether we feel or you feel more passionate\nOr numbers suffered and what you're really saying is had there been a populist maybe Bernie Sanders instead of Hillary Clinton would we be with President Trump today I think that's your question yes a ticket to\nWhat we signed twenty sixteen with Hillary Clinton and people of color is that they were not inspired to vote for her the issues weren't there they weren't talking to them another thing that was happening around that time and twenty Fifteen\nWas the black lives matter movement rate the crime bill came up and so there was a lot of feeling from particular young black voters who didn't feel that uh the campaign was talking to them we didn't feel that there was a place for them because of what was happening in twenty Fifteen with young black bodies being killed on the streets\nLet me take your point to a ... I think you have to disentangle\nProblems with Hillary as a candidate from the question tonight if a candidate in the future\nCarries these ideas will that candidate when whatever you think of the merits of these ideas they're not politically popular enough places just cited the senators who might run for president who support Medicare for all that is true\nThey're all from safe blue places our job as a party is not to figure out\nHow to make blue places bluer it's how to make red places blue and purple places blue that's our job [noise]\nOf us have not gotten a fair shot and his party in terms of funding other things but what we do know is that your point of view has destroyed the party you're free trade deal destroyed the relationship with working class Democrats your call for cutting Social Security is going to kill this party you guys represents\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA and he L. S. dot org\nBrock Obama wasn't progressive so widely supported by working class people were rock Obama built an amazing coalition in fact I think our challenge is to rebuild the Obama coalition the centrist Obama coalition just to be clear because that's\nActually when we have to do when I Wish I Would have had some you make a point a known as something up\nBronco Obama didn't support any of your policies virtually he didn't support Medicare for all hidden support free college tuition\nFor ten years ago were talking about two thousand eight things have changed yes but his job because you\nDon't have All right\nAll right time and I want to throw something into this conversation that comes from an interesting direction the other day there was an op ed attacking Medicare for all it was written by Donald Trump got her and he said quote the truth is that the centrist Democratic Party is dead and Joe Biden reacted to that still Trump he should hang on\nSoap does Trump's characterization of the party have any traction drawn out saying\nThat because his greatest fear is running against someone like Bill Clinton or a bomb and that's why he thinks he'll lose if Democrats regain the house a third of the Democrats in the house will be self describe new Democrats\nFar from the centrist democratic wing of the party being dead it's alive it's well it's real bust it elected the last two Democrats\nTo the White House and I don't believe the way to win is a reprise of Nineteen nineties democratic centuries him any more than I Believe a reprise of Nineteen sixties democratic socialism the way to win we're in a new era and we need something different or the ideas like Medicare for all put out is there evidence that does win elections\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nI think it had been held by Republican for more than ten years if I if I get that right\nHe was running on protecting Social Security he was running on protecting Medicare and Medicaid the issues matter as well now where do you guys stand on that word is third way stand on Social Security I think that matters because you're talking about that are issues are not going to win the day but where are you guys on Social Security\nOn protecting Social Security is into Sanders position or progressive populist position it's a position I Can't really think of many Democrats who don't\nHold it there's a woman with black sweater and I just thank you\nI'm my name is Cathy I'm Wondering you mentioned the new deal and the marginal tax rate in order to pay for that program went from twenty five percent up to Ninety four percent and most other countries that have\nYou know Medicare type for all its Seventy percent how will you get normal working people to be willing to pay Seventy percent increase in taxes in order to pay for others\nYou know there's a recent study on it I got a Medicare for all his also point out that over half of a democratic members of the house of representatives support Medicare for all there is postmaster legislations for Medicare for all who's not a fringe idea by the way\nA there was this report would show that in fact aggregate health care spending in this country would go down substantially if you had a Medicare for all system so will people will be paying more taxes yes no doubt about that you can't get around that will they pay less than premiums yes because won't pay premiums they won't be any copayments there'll ... we're going to finally be able to get our hands around the pharmaceutical industry was\nRipping off this country in charge against the highest price of the world so\nThe aggregate our country is going to save money is going to be good for business\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nWas elected in Nineteen Ninety two why didn't lose the house in Nineteen Ninety four because Bill Clinton raised taxes and the people did not want that so there is a limit to I'm for tax increases I said that um opening remarks you can raise my taxes or whatever you want it but I think it has been well proven in this country\nThat there's a limited tolerance for raising taxes beyond a certain point and I don't think it works politically\nOkay I Want to go to some more questions thinks\nHigh there remains Jen I'm I have a question for each side um I mean there's always and party fighting but there seems to be a claim of who is a true Democratic Party and I guess that I like okay\nWhat's your view is representing the Democratic party here tonight [noise] know can I answer that are so young when I asked if there is a little spray parties\nThing you're supposed to do is build a winning coalition that does not just include your side or other people the point is if you want to get the White House back\nIn large Chastain democratic majorities do good things for the working and middle class in this country you have to build a winning coalition that's the map will they build a winning coalition and when you look at it they don't actually do that ...\nMeant to have such a problem with that because what we're asking for is inclusive witty what we're saying is if you reach out\nYes white working class in the middle America absolutely matters no one is saying we don't talk to them were saying like hey there are brown people there are black people there are young people that needs to be reached out to it needs to be inclusive\nAnd that's how you build a winning coalition and it needs to be multiracial and so for decades now those folks that I just mentioned\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nFocus on one group can sure I agree a hundred percent that you have to have a diverse coalition and there's a lot of folks who haven't been represented well spoken for well the question is what ideas should those diverse group of candidates Terry and build those that he isn't able to get a win\nSir my name is ... so for people who are skeptical about\nToo many government programs and being dependent on\nGovernment health care and government funded education and fearing losing their independence and freedom of choice someone who is more moderate like me who has left the Democratic party has become an independent because I don't particularly relate with a lot of these ideas how do you win me back what a great question [noise]\nThat's right on the table so I wanted to read for free tuition\nOf public colleges and universities we already have K. through twelve I think we're all support probably going down to pre K I don't know if you guys are in that camp or not so we have an arbitrary deadline where once you get past twelfth grade now we cut you off we didn't used to by the way in New York state in California other places you didn't use to get cut off at twelfth grade\n... doesn't want his kids getting a free ride but if his kids' shows up in first grade he's going to get a free ride that's just the way we work at in this country we have\nUniversal secondary primary an early education there's no reason why we can't have it for undergraduate school or even graduate school our European allies in many cases do do it that way\nA great loss of talented young people who either choose not to go to school or come out of school greatly indebted and there's research that shows that people have so much debt that they'd delayed making major purchases like getting married having kids and a whole host of other things if we're going to compete in the international environment we have got to have the best trained workforce in the country we got to maximize\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\n... thought okay interesting I'm I'm happy to respond like if\nI Would just say that this gentleman actually ... says what John and I are trying to persuade everybody about that there are a large group of people out there some number I don't know what who\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nStart your day was Minnesota new every morning taffy wars in hopes to go to the top stories from our region where you are a little whether in sports as a podcast called NPR News update\nYou didn't find it on NPR One or wherever you get your podcasts\nCourse injured and boom the conscience of all humanity\nThe Turkish president rejects Saudi Arabia the explanation for how journalists to mom showed he died It's Tuesday October twenty third and this is all things considered\n... and I'm Audie Cornish this hour we'll look at the global impact of the Trump administration's decision to pull out of the thirty year old arms control treaty this was a Cold War bilateral ballistic missile related\nTreaty in a multi polar world also two hundred and forty five migrant children still have not been reunited with their families\nAfter being separated at the U.S Mexico border obviously the should've never happened to begin with and it should never have taken this long for the ring interpretations\nAnd the Los Angeles Dodgers take on the Boston Red Sox in a World Series for the first time in more than a hundred years first the news\nFrom NPR News in Washington I'm Lakshmi Singh a major investment conference allowing for billions of dollars in deals is underway in Saudi Arabia however in recent days and weeks a flurry of individuals and organizations including prominent Americans have backed out\nNPR's ... report certain guests are distancing themselves from the Saudi crown prince who was widely suspected of ordering a hit on a Washington Post columnist who died inside of the Saudi conflict in Turkey Saudi Arabia's future investment initiative was all set to attract CEOs\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nCrowd gathered in Riyadh including business leaders and heads of state Saudi Arabia says it's signing fifty billion dollars worth of deals on the first day of the three day conference mostly through the state oil company\nAnd appearance by Saudi crown prince Mohammed bin Salman was greeted with applause he told reporters the event was going well with quote more people more money can you know what I'm asking NPR News\nThe crown princes appearance at the conference came shortly after he and his father king Solomon reportedly receive the slain journalist sons\nThe state run ... press agency says the royals express their condolences photographer capture the image of the crown prince shaking hands with ... Sala reportedly has been barred from leaving Saudi Arabia since last year [noise]\nSandra Day O'Connor the first woman to serve on the U.S Supreme Court confirmed she's in the beginning stages of dementia possibly Alzheimer's disease NPR's Nina Totenberg tries to describe part of what would become O'Connor's legacy you know I really\nDon't know a way to express the sort of bursting joy\nThat it it was for women when there was finally a woman on the court and she was such a and able figure she understood that if she failed as she put it it would close the door for women everywhere\nThat's NPR's Nina Totenberg Austin, Texas residents are running low on drinking water most shell of member station KU team has this update\nThe silt the floodwater rolling into Austin reservoirs it looks like chocolate milk and makes it a lot harder to treat than usual Austin water utilities record Greg Missouri is\nWe've been reducing capacity at those plants to try to\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA NPR L. S. dot org to learn more\nHelp fill up city storage tanks meanwhile many restaurants have closed in stores are having trouble keeping bottled water on the shelves for NPR News I'm most the shelf in Austin and this is NPR\nSupport for news comes from the law for Cooley L L P with offices in the U.S Europe and China Cooley advisors entrepreneur as investors financial institutions and established companies around the world where innovation meets the law\nFor Minnesota Public radio news I'm Steven John\nSome two thousand volunteers have been combing the area around home outside bearing Wisconsin today looking for any evidence that could help police find missing Thirteen year old\nJamie clause disappeared after both your parents were shot to death in their home early last week Baron county sheriff Chris Fitzgerald believes the girl is still alive and he hopes volunteers can find something that helps locate her the searchers recovering a two to three mile area around the family's home\nOr they're walking about ten feet apart you know almost arm in arm going back and forth and then there that we have food to Salvation Army is here to help feed them give them hydrated during the day with medical teams on site we have evidence teams on site so this is a a community wide effort from all over the north west Wisconsin\nMotive has been given for the slaying of fifty six year old James clause in his forty six year old wife Denise the sheriff is asking the public to be on the lookout for two types of vehicles that were picked up on surveillance video in the area red orange dodge challenger and a black Ford Edge or accurate M. D. X.\nMinnesota man has waived extradition in North Dakota homicide case forty four year old ... well Cooley is charged with fatally shooting twenty year old Gabriel harass he was\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nShares of three I'm closed down about four percent today after plunging as much as eight percent after the company reported financial results but felt well short of investor expectations the maple would based manufacturer said its third quarter sales fell slightly and the company trimmed it's expected profit for the year\nVariable crowded is the rest of the afternoon for Minnesota not as warm upper thirties were high in the northeast to around fifty in the southwest this was Minnesota Public radio news it's three oh six\nAll things considered is supported by University of Minnesota how cancer can\nOctober is a breast cancer awareness month [noise]\nTheir breast cancer experts for patients with the latest breakthroughs in treatment and state of the character treat all stages of breast cancer\nAnd health data word this is all things considered\nFrom NPR News I'm ... and I'm Audie Cornish there are plenty of questions surrounding the death of journalist and Saudi Government critic Jamal 'cause she'll G. three weeks after he disappeared in the Saudi consulate in Turkey today Turkey's president said ... was killed and and the meditative political murder\nRate it tight ... says his country will not accept the Saudis claim that the death resulted from a botched interrogation carried out by rogue operated\nThe information on the evidence that we have so far collected [noise] indicates that Jim ... was slain in a vicious\nViolent whitewashing such invited the will of course in June and booms the conscience of all humanity now we are of course looking forward to the same sensitivity being demonstrated by\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more tell us more about what are the one had to say today\nWell he laid out a some of what we know an added new details including the fact that members of this Fifteen men Saudi team that showed up the day 'cause showed you disappeared were attracts scouting out remote sites including a forest\nOr the idea of being they might have been looking for a place to dump a body all the details or to one added seemed aimed at knocking down the Saudis version of events their latest version that shows you died accidentally after a fight broke out in the consulate ah everyone didn't talk about alleged audio recordings investigators are said to have\nBut if there's evidence holds up the Saudi explanation does not a he said who in a leadership gave the order that's what he wants to know\nSo Peter what else happened today\nWell the investigators searched a diplomatic vehicle Saturday constantly vehicle found in a parking garage had been left there for two weeks they found suitcases inside a with some closed at ... belonged to Saudi consular employees were still awaiting confirmation also CIA director Gina Haspel\nFlew to hunker to review evidence and aired once spoke with a ... family members and offered condolences\nThat the Saudis also reached out to ... his family um there were pictures released of his son meeting with the Saudi king and the crown prince more can you tell us about this\nYou know the picture was striking there you have the son of a slain journalist standing in front of the crown prince who some say is linked to his death in Istanbul\nUm this event overshadows a economic conference that open today this was supposed to be the capstone for the crown prince who wants to transform the Saudi economy but many global executives polled out\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nIn a grid surge of the area law enforcement says they haven't determined to motive for the fatal shooting of fifty six year old James claws and his forty six year old wife Denise in their home\nOn October fifteenth above the Baron county sheriff says their daughter Jamie was home at the time of the homicides and he believes the missing girl is still in danger we have the latest on line as well at NPR News dot org all things considered from Minnesota Public radio news good afternoon\nSupport for NPR comes from the station and from the financial services firm of Raymond James offering personalized wealth management advice and banking in capital markets expertise along with the legacy of putting clients financial well being first learn more at Raymond James dot com and\nHarvard Business school executive education for executives at any career stage to prepare for new challenges through one of its comprehensive leadership programs learn more H. B. S. dot Emmy slash executive\nFrom NPR News it's all things considered I'm Audie Cornish\nAnd I know said Chang tonight's mega millions jackpot is at a record one point six billion dollars I I don't know about you but I have not even bother to buying a ticket because I'm a total pessimist about the lottery I don't even try any more\nLike I said man I'm actually risk averse to any like does anyone think they're really going to win\nMathematically speaking the odds are ridiculously against us how ever our next story is about a guy who flipped\nProgramming is supported by why WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nEvery single combination of tickets to guarantee a win and this totally perplexed as the people who run the lottery system like ... this is him on TV shortly after\nThe very idea of spending over seven million dollars to buy all the sharing the lottery just seems preposterous\nThe man behind the plane was defined Mondale I tracked him down a couple of years ago the last time there was a big lottery jackpot [noise]\nHe was living on an island in the south Pacific ... hello hello Hi is this defined Mondo yeah\nHe says that Virginia thing it took decades to get to that level the story starts in Romania in the late Nineteen fifty ... has a young family and he wants to get out of the country\nI mean you know I I uh I mean back to the um sixty lay among which was the tune of ... shoes\nHe decides the lottery is his way out he's a pretty natural in that way so he goes to the library and he started reading math paper aftermath paper and he realizes something about the lottery there that if he buys certain blocks of tickets in certain combination he can guarantee himself at least a second prize so we'd pools his money with three friends and he buys the tickets\nWe want Seventy two thousand shutdown that made you could easily which was about a few years with Charlotte\nRight big score that was on your first try yeah he takes the money and he leaves Romania for Australia he finds more investors he raises more money enough to buy all the combinations of numbers for the bigger Australian lottery and he turns lottery winning into a business for a while\nYou know scary it I Want drove time\nAustralia passes a law that block them from buying up all the ...\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR list dot org\nProblem with buying all the tickets though isn't money it's logistics filling out millions of tickets each one different keeping track of where they are so you can find the winning tickets and then turning them all in so\nHis secret was get the tickets ready ahead of time back then it was legal to print your own tickets already filled out so we set up printers going for over a month making the millions of tickets\nThen negotiated with stores across the state to let him turn in stacks of ten thousand tickets at a time and waited\nArgued that would we won five six second Brian I'm going to the un thousands minded writer\nHe says he couldn't do it again lotteries have now added extra numbers and there are just too many combinations so the great\nLottery play of Nineteen Ninety two will likely state the last great lottery playing Alex go Martin NPR News [noise]\nSupport from Planet Money comes from transfer why a service that helps people send money internationally three million people and businesses use transfer a wise to send receive and convert currencies and more than Seventy country\nMore at transfer wise dot com or from their app [noise]\nThe last time the Dodgers played the red Sox and the world series the Dodgers were still in Brooklyn they recalled the Robbins the Boston Red Sox me mile had an eighth pitcher named Babe Ruth remember him well fast forward a hundred and two years\n\nProgramming is supported by white of UCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. a subtle word\n... match up we reached ESPN baseball analyst Jessica Mendoza he Jessica\nBook also today [laughter]\nOkay so like just lay off the stage where this battle the he misspoke teams have these huge histories to the biggest fan bases how epic is this face off\nWhat's crazy also these teams have not met in the world series since Nineteen sixteen and guess who pitched game to that game for the Boston Red Sox who they even ... even without Babe Ruth you might have\nHeard of him and he's a hitter but he was pitching for the Boston Red Sox not the Yankees that's how far back\nHazy they go okay well yeah\nAnd they matched up so it's it's also even though it's it's a historic matchup it's something that in the modern day of two very big baseball teams somehow they missed each other when they both and in the world series it was never against each other so I Love the fact that it goes back historically but also it brings them she two thousand Eighteen\nSo was it was back in the world series after a pretty brutal last last year I mean how how does this team going to be different\nI got one word and its redemption I mean we've all had a little bit of that in life right you get your heart broken in this case the Dodgers got at torn out\nAnd there is something about that World Series last year wasn't just the fact that when seven games but it went back and forth changing lanes extra innings I've met with this spring training I was with them pretty much throughout the season and there is a fire\nTo get back in when the world series but really when you look at the field team is different because they went and got many Machado I mean this has been there often said or eat or he's at shortstop they lost\nProgramming is supported by YWCA Minneapolis bringing the community together to Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nWant to get back and they want to when\nThey're burning to prove themselves now okay what about the red Sox what did they have going into this\nThey want a hundred and eight games I mean the pressure is on them and even though the Dodgers haven't won a World Series and Thirty years you know the red Sox have had that\nBoston is that a lot of reason to celebrate between the patriots and the red Sox but this team is arguably one of the best\nRegular season teams we have ever seen okay so they went and it was without a doubt they were the best thing the baseball so when you were the best team in baseball it's like okay well then when at all no one cares about hey you want to hide your mate games yeah you get an award you get a crowd\nAnd you don't get anything oh you get if you want a hundred and eight games yeah they were in the world series they are so good out of it as well you know in the postseason the vaccines and always when you got to go out and play [noise] All right\nI Want your crystal ball Jessica how do you see the world series playing out who do you think is going to win\nDaughters and that's kind of shocked a lot of people because the Boston Red Sox are the best team\nOn paper there's nobody better what I Love about the postseason transcend all of that\nTalent pitching hitting I don't care throw the numbers out yet is redemption it's passion it's it's this prior to the Dodgers have because they lost in game seven last year and I believe that's going to kill them to victory this year right that was ESPN\nBaseball analyst Jessica Mendoza she'll be on sports center covering the world series thanks so much Jessica thank you out that [noise]\nThis is NPR News\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more [noise]\nI'm hearing now there are you looking for a good book to read that sign up for the thread newsletter text a word book to six seven seven six seven seven and I send recommendations to your inbox once a week [noise]\nThis is your Twin Cities forecasted should be sunny for the rest of today with highs and the upper forties wins out of the northwest around five miles per hour\nTwo hundred and forty five children remain in federal custody that's according to government data analyzed by the American civil liberties union\nThe ACLU has been tracking these children and it was the ACLU lawsuit against the Trump Administration that led to a federal court order to reunite these families we're joined now by ACLU attorney leak learnt welcome thanks for having me\nSo we should first said that the vast majority of these children who were separated at the border more than two thousand of them have been reunited with their families but it has been for months since the court order why aren't two hundred and forty five children still in custody\nYeah that's the question right or you know obviously the should've never happened to begin with and it should never have taken this long for the reunification\nLike one of the reasons is because the government supported hundreds of parents without their children and the reunification process for those parents didn't really even start 'til about six weeks after the court order\nAnd where these children being held right now these two hundred forty five children that are still in custody\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA N. P. L. S. dot org to learn more\nWe reached the parents and they've made the agonizing decision to leave their child in the U.S not because they don't love the child stop because they don't desperately want the child back with them\nBut what they're saying to us is it's too dangerous for the child to come back one father said to me look my life has over ... killed 'em killed and this is a father who seem to be in his forties or fifties obviously his life\nShouldn't have been over he shouldn't have been thinking that way\nBut all he said was was I cannot bring wide shot back here it's too dangerous we're hopeful that the government will allow some of these parents to return to the U.S and reunite but right now the only thing definite we can tell those parents you have two choices leave your child in the U.S to pursue asylum or bring them back to Central America\nWe've heard at various points that some of the families are deemed ineligible for reunification because the parents have criminal backgrounds what kinds of criminal backgrounds are we talking about here\nSo they very we have set all along that if a parent has a very serious conviction that bears on their fitness to be a parent even under stand her child welfare law state law\nThey would not be reunited and so those people we've always said would not be reunited but we're also seeing our people not reunited because of disorderly conduct\nDUIs allegations that they may be part of a gang and that is extremely troubling because we are talking about\nFour year old kids three year old kids who are not being reunited with their parents because the government's saying it's just too dangerous to put them in a family detention center with their\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nGiven us phone numbers finally they gave us phone numbers these are five that we have not been able to reach by phone\nWe remain hopeful will reach the five um but if we don't we will have to look for them on the ground we have great partners including justice motion and kids in need of defense on the ground we hope that we'll be able to reach the one way or the other we're not giving up on the five we will find them one way or the other we believe\nLegal learnt is deputy director of the ACLU immigrants' Rights Project thank you very much for joining us thanks for having me [noise]\n\n\n\n\nYou're listening to all things considered\nFrom NPR News that you couldn't see this next story coming it's about psychics who take advantage of the people who believe them from member station WFDD in New York City\nPataki reports preachy ... was going through a rough time so when she received an advertisement for a psychic reading she thought why not was at twenty dollars for an initial reading\nAnd so curiosity cut the better of me and I decided to give her a call the fortune tell her ... her family was cursed but with her help that curse could be lifted I'll make sure that you know this evil has been put to rest and so this Chris can no longer\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nEven lost her business a quiz no sandwich shop I think I hit rock bottom out at that point because I lost the business and things weren't working out the way she told me it would that's when the hauling obits cried fraud\nAnd called Bob Nygaard for help he's a private investigator and retired police officer who specializes in psychic scams\nUsually in these type of crimes the con artist does what they call a cold reading they initially just ask questions as to elicit what type of problem the person's experience and usually it's something that love money on health once they key in on that then they come into the kill\nNygaard points to one of its undercover investigations and this recording in New York City psychic reader Christine Evans is promising Nygaard posing as a guy named John that you can reunite him with a lost love for five hundred bucks\nToday we have one right next door [noise] do you know they were you guys do\nMany cities and states have laws that ban or restrict fortune telling New York only allowed it with a disclaimer that it's for entertainment purposes only but ... says he's still find it hard to get law enforcement to take the issue seriously\nMost at a time when a victim calls me I said do you have you been to the police and they say yeah and I say what happened and they say oh well they told me it's not a crime\nTop New York city police brass might not argue that point I Would look at it more as a civil matter that parents Monaghan he's chief department for the New York city police department\nOf course you you're really going in there it's your belief that what they're telling you is truth and who am I to say your beliefs\nAre wrong the NYPD did arrest Christine ...\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nFraud and grand larceny counts Gottlieb says she'd never apply to psychics\nWhat's the difference between what a psychic is doing for people who voluntarily pay good money for peace of mind and ... provides\nSo then how do you protect yourself from a malicious medium for that I turned to Daniel New some who says he's a genuine psychic not a scam or\nIf you work with anyone who gives you the impression that they have a very special power and your problems can only be solved by working with them that should be a major\nRed flag new some ads that of a spiritual advisor says you're cursed and ask for large sums of money chances are you're psychic is more interested in cash then Clare boy it's for NPR News I'm George ... in New York\n[noise]\nThis is all things considered from NPR News the latest on a big search effort in Wisconsin for Jamie clause the missing Thirteen year old that's coming up on a proposed change in a federal immigration rule that could affect tens of thousands of Minnesotans\nThose stories all hate and the next ten minutes of all things considered\nProgramming and supported by physicians neck and back center when your bank has been hurting you from within six weeks physicians ... may help you find relief and get back to life without surgery you can learn more at resume activity dot com\nSome of the other stories making news this afternoon prison\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\nSoon but he says quote they had a very bad original concept and it was carried out poorly he calls the events after his show ... death the worst cover up ever\nNews from the first woman on the Supreme Court today Sandra Day O'Connor has announced that she has the beginning stages of dementia and probably also ... disease O'Connor made the announcement in a letter this morning and she says her diagnosis was made some time ago\nHer condition has progressed to the point where she says she's no longer able to participate in public life O'Connor is eighty eight years old she was nominated by president Ronald Reagan took her seat on the court in Nineteen eighty one we'll have more", "year": "2018", "show_name": "no_show", "city": "Rochester", "day": "23"}