{"month": "10", "state": "MN", "station": "KZSE", "content": "Numbers our every story and then in every step of the way\nForecast for the twin cities clear skies overnight lows in the upper twenties tomorrow mostly sunny highs and the mid fifties selfies with five to ten miles per hour\nDirect cloudy with rain likely late Lowe's and the low forties\nThursday cloudy with rain highs and the upper forties Thursday night cloudy rain likely lowest in the low forties friday cloudy a fifty percent chance of rain highs and the low fifties Saturday mostly cloudy thirty percent chance of rain highs and the low fifties [noise] get\nGame and can you say your email\nYankees dot org slash\n\n[noise] this is NPR News presents today a new debate from the intelligence where to series focused on the Democratic party at a crossroads as Democrats look beyond the mid term elections two weeks from today they must consider the future direction\nOf their party should they champion centrist policies we backed disillusioned working class voters or move in a progressive or democratic socialist direction\nThe intelligence square debate is coming up\nLive from NPR News\nProgramming and supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot\nOrg to learn more\nDays now has he stumps for votes ahead of the midterm elections\nReporters traveling with the Central American caravan and the migrants themselves say they've seen no middle Easterners in their group despite the president's claims Trump conceded his ominous warnings might be unfounded but he continues to insist the caravan and illegal immigration more generally pose a grave threat to the United states certainly you have people\nComing up through the southern border from the middle east and other places that are not appropriate for our country and Tom not letting them in\nWell it's not unheard of for people from the middle east to try to cross the Mexican border it's very rare out of more than three hundred thousand border crossers apprehended last year fewer than a hundred were from the middle east Scott Horsley NPR News the White House\nIn the strongest response to the death of Washington Post columnist or milk a show jade the Trump Administration says ... the visas some Saudi individuals suspected of being involved in his death secretary of state Mike Pompeo speaking at the state department today noted the horrific nature what appears to have gone on inside the Saudi constantly ...\nWe want to make sure that everyone understands that the United states doesn't believe this that the killing of democracy was ah was anything other than a horrific act we hope that we can work together both with Congress and our allies to hold those responsible accountable\nSaudis have claimed to show ... inside the consulate after a fire broke out or fight while they're broke out whoever Turkish authorities said ... was murdered by Saudi operatives a law firm representing Roman Catholic sex victims published a report today naming more than two hundred priests from diocese in the San Francisco bay area as Rachel ...\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA and he L. S. dot org\nAnderson represents the plaintiffs\nIn this economic policy he's seeking the truth about what these ... are vicious no\nThe archdiocese of San Francisco and the diagnosis of San jose say they will give you a list of priests the diagnosis of Oakland which has promised to release its own this next month says it prefers to focus on that task for NPR News I'm Rachel Myra\nSocks after being down sharply earlier in the day recovered a good bit of their losses technical training programs kicked in the Dow ended up down a hundred and twenty five points or twenty five thousand one Ninety One the NASDAQ dropped thirty one points yes it'd be five hundred fell Fifteen points today you're listening to NPR\nSupport for news comes from home advisor matching homeowners home improvement professionals for a variety of home projects from minor repairs to major remodeled homeowners can read reviews of local pros and look appointments online at home advisor dot com\nMinnesota Public radio news unproven Eli but very county sheriff's office says no items collected today at a massive search appear to be connected to the death of a local couple\nA disappearance of their Thirteen year old daughter about two thousand volunteers helped investigators Coleman area near the Wisconsin hall where James and Denise claws were found shot to death last week\nAuthorities believe their daughter Jamie was in the home at the time it is in danger\nMeanwhile a funeral will be held Saturday for James and Denise clause family members have scheduled at eleven AM visitation and one PM funeral service at St Peter's Catholic Church and camera at a village next to the couple's home town of barren and ... says it's\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nSays it's not the same strain or potency of flu that hit the turkey industry three years ago\nSo a lot with identify wise and I ... I don't care for low Africana caving in on Saturday I our own ... actually called correctional tricky for\nSay ... but I I actually fall fall that cost ... highly pathogenic ... virus\nBuses this is a North American virus cuddly founded wild birds in the U.S she says the birds are not showing any signs of illness and because he was caught early as easily treatable she says once they recover they will be able to continue on to market\nIn the twin cities guys are clear the temperature is forty one degrees this Minnesota Public radio news it's nine oh six\nProgram he supported by Minnesota iron dedicated to operating responsible innovative iron minds which have helped build protecting support our state and concrete for the last one hundred Thirty years imagine life without ... you can learn more Minnesota iron dot org\n[noise] welcome to NPR News presents and Steven John election days two weeks from today\nWhichever party controls the U.S house a new speaker will be elected the current Republican Speaker Paul Ryan of Wisconsin isn't running for reelection\nIf the Democrats take control they'll need to decide which person is best suited to lead the Democratic party in Congress and of course the ... presidential campaign will get underway shortly after these mid term elections\nThe intelligence square to series held a debate about the future of the Democratic party and whether it should head in a more moderate or a more liberal direction [noise]\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nMore to the left\nTo the kinds of ideas and promises and under the rubric of progressive populism set the party up is standing for game changing policies like Medicare for all or tuition free public education or guaranteed federal jobs program\nBut hold on others say including a lot of Democrats those are promises that cannot possibly or reasonably be kept and they may sound so radical to so many that they will push more voters away then they will pull in better they say to let them stay close to the center and let the Republicans look\nLike the outliers who is right well let's find out because we think this has the makings of a debate yes or no to this statement progressive populism will save the Democratic party I'm John Donvan and I stand between two teams of two\nThinkers on this topic who will argue for and against that resolution as always our debate will go in three rounds and then our live audience here at the K playhouse at Hunter College in New York City will vote to choose the winter and if all goes well\nCivil discourse will also when our resolution is progressive populist will save the Democratic party we have one team arguing for that resolution let's meet them starting with welcome Korean jumpy air [noise]\nFree for us\nYou are senior advisor and national spokesperson for move on dot org you're also a lecturer at Columbia school of international and public affairs before that\nOh you are in the White House under President Obama you worked on both of his presidential campaigns you were a campaign manager for the ACLU initiative on reproductive freedom and most recently the deputy campaign manager for Martin O'Malley for president that is a lot of political experience you have credit\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nAnd so they ended up here in New York City corruption in New York\nAnd they've worked so hard and their heart and determination their love for this country in the country where they were born really gave me the fuel to do everything that I've done and because of them I still continue the work that I Do to move on credit\nDon't care I think [noise] and your partner is Jeff Jeff welcome to intelligence squared I give you are a long time advisor to Senator Bernie Sanders when he ran for president in two thousand sixteen you or his campaign manager of you also managed to Senate election campaign in two thousand and six\nDot com programming is supported by the Abbott fund the foundation of the global health care company ... dedicated to helping people build better lives and stronger communities\nTomorrow on MORNING edition we'll learn about a new tool that can identify risks of climate change from Minnesota community plus we'll hear from the candidates for Hennepin County attorney [noise] than your morning with NPR [noise] we're halfway\nThrough the opening round of disability spurred us debate I'm\nJohn Donvan we have for debaters two teams of two arguing it out over this motion progressive populism will save the Democratic party debating for the resolution here is ... senior advisor and national spokesperson for move on dot org green jumpy here [noise]\nIs defined as support for the concerns of ordinary people populism is not\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nAbout populism rhetoric but his populism as right wing white nationalist populism he chooses to divide using race religion immigration status and gender progressive populism unified and brings us all together\nThe late Senator Paul Wellstone used to say we all do better when we all do better we also have to talk about the power of systems that are created to benefit the privilege and the elites and I'm Talking about white supremacy I'm Talking about patriarchy Islamophobia what progressive populism does its fights against that it says no to that\nNow how do we move forward my parents were immigrants my dad was in New York City cabdriver my mom a home health care aide the issues that matter to them also mattered to their white working class counterparts progressive populism has solutions are solutions are actually incredibly popular\nFor example Medicare for all lake research did a survey back in April and asked\nVoters in battleground congressional districts how they felt about Medicare for all fifty four percent strongly support Medicare for all but I think the most interesting thing about that survey was that Democrat who are infrequent voters it\nWas more popular with them\nAnd we also believe in the auto bailout which was incredibly successful thank you Steve Rattner and it was a great example of how government when they step into activism can really help the markets but now I Want to talk about candidates the first one is better all work he's running in Texas\nDonald Trump won Texas by nine points Beto O'Rourke is authentic\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nAnd incredibly progressive making history\nAnd he came out in the general election has been leading in all of the polls in Florida ... one that my one or two points\nAll the past democratic candidates who were who are in the middle have never done as well and he's doing right now look it's not going to be up to us who are on stage that is going to decide what the Democratic Party is going to do it's going to be up to activists\nAnd voters out across the country and they're making it loud and clear they want the Democratic party to challenge the status quo and to fight for the Ninety nine percent not the one percent\nThinking [noise]\nThe resolution progressive populism will say the Democratic party and here to make\nHis statement against the motion please welcome Steven Rattner chairman and CEO of Willett advisors\nAnd former counselor for the secretary of treasury [noise]\nAnd I consider myself a progressive and I consider myself as a fighter for the Ninety nine percent as I think it should be defined I Believe that our tax system excessively favors the rich\nI Believe that income inequality in our country is reprehensible levels and must be addressed I Believe that the federal government should lean in and try to solve the pressing problems of voters who have been left behind\nBut I don't believe that endorsing policy ideas\nThat are either unaffordable would somehow be good politics for the Democratic party there has not been a single Democratic president elected in our history\nEspousing the kinds of policies that the proponents of this motion advocate not FDR ran in Nineteen thirty two on a platform of balancing the budget not John F. Kennedy who by the way cut taxes for the rich\nCertainly not Bill Clinton and not even bronco bomb who senator cents\nProgramming is supported by wind WC a Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit one WC A. M. P. L. S. dot org to learn more one of the saddest days of our life [noise]\nWithin an approval rating hovering around forty three percent there's no way he should be re elected but if we want to make the unimaginable imaginable just nominate someone out of touch with the mainstream of this country\nRemember that only thirty three percent of Americans are even Democrats at all the share of independence at thirty seven percent is the highest and twenty seven years\nYou've heard the suggestion that Bernie Sanders could have eaten Donald Trump\nWill never know but we do know a few things the fact that democratic voters are increasingly concentrated geographically particularly in the blue states like New York and California so to when we must reach out more moderate voters in Pennsylvania in Michigan and in Wisconsin three states that we never should have lost\nYou've heard turnout blamed for Secretary Clinton's loss but it's sixty point one percent turnout was hiring to thousands sixteen than it was for Brock Obama's re election in two thousand and twelve now let's turn to policy guarantee a Fifteen dollar an hour income to all that would cost on the order of six hundred and eighty billion dollars annually expand\nSocial Security that sounds pretty good until Americans understand that the trust fund is on track to go broke and twenty thirty four and jeopardize the benefits that we've already promised make public colleges tuition free is just suggest that it's a great goal for the under privileged\nBut if any of my kids were to go to a public institution I have no idea why they should get a free ride break up the big banks that sounds appealing although apparently not Mr send their Senate colleagues\nNone of whom have signed on as co sponsors of his bill abolish ice only thirty two percent of voters want that wall fifty three percent under ...\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more we need to keep Donald Trump from another four years of destroying America thank you\nThank you Steve and one of us\nThat we move on to round too and in round two the debaters addressed one another directly and they take questions from me and from you our live audience here in New York City what we seem to be hearing about is a dispute over how many voters\nWill respond to the set of policies that are identified with progressive populism the team arguing for the resolution green jump here and Jeff Weaver they described in this country a sense of emergency in light of things like you know phobia and ultra nationalism and racism\nA tension between top and bottom and in that framework they said these are solutions\nThat appeal to the bottom ideas like Medicaid for all free public college tuition abolishing ice housing as a human right the team arguing against the resolution Jonathan Cowan and Steven Rattner\nThey identified themselves as progressive but they say the problem is political reality\nThese ideas will scare the public they look great on a bumper sticker but in reality voters will not go for them they cite instance after instance were given the opportunity to either vote for these things they voted against or when put in place they ultimately failed and I want to take a question to Jeff Weaver from something that your opponent said in that Democrats need to have moderates\nCome into the tent and it almost sounded as though they were saying that you and green are arguing for appealing to the Democratic base and that the moderates you just can't get them I Want to see if I understand that correctly that is not what we're\nThey had a hard fought Democratic primary between Secretary Clinton and Bernie Sanders and the evidence is\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nShow that Bernie was winning the very voters that you're talking about in red places there were coming out overwhelmingly for Bernie Sanders which is why you want or Oklahoma you want to Kansas you want to Nebraska anyone in Utah when an Idaho and on and on and goes and in fact it is these voters that I'm arguing we need to bring back into the working class voters in red states\nThis question about geographic concentration of democratic support is a very very serious problem that we have an electoral college system when we need to broaden our support geographically and the way you do that is by being unapologetically undecided working people in these states we all forget it's in\nThe mid west of this country used to be the center of progressive politics in this country the planes can we have lost touch with those people because the truth of the matter is that there are many people in that wing of the party\nReally don't like those people very much okay just let me break into what you're going to respond to some what you said 'cause you said a lot of ... and I'm just saying that those voters and the red states that you say it would be driven away by these ideas would not be driven away\n[noise] I'm John Donvan this is where us\nWe have two teams debating this resolution we'll progressive populism saves the Democratic party now it's time for questions from the audience\nPoint of fact here it is true that twenty sixteen twenty twelve the voter turnout was around the same however and twenty sixteen it was significantly down among people of color and among working people\nHillary Clinton was a centrist then was from the wall street wing of the party and her numbers suffered and what you're really saying is had there been a populist maybe Bernie Sanders in right out of elders\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nThe black lives matter movement right the crime bill came up and so there was a lot of feeling from particular young black voters who didn't feel that\nUh the campaign was talking to them we didn't feel that there was a place for them because of what was happening in twenty Fifteen with young black bodies being killed on the streets and we took her point to a\nTo John ... I think you have to disentangle\nProblems with Hillary as a candidate from the question tonight if a candidate in the future\nCarries these ideas will that candidate when whatever you think of the merits of these ideas they're not politically popular enough places Jeff cited the senators who might run for president who support Medicare for all that is true\nThey're all from safe little places our job is a party is not to figure out\nHow to make blue places bluer it's how to make red places blue and purple places blue that's our job [noise]\nHave restaurants have not gotten a fair shot and his party in terms of funding other things but what we do know is that your point of view has destroyed the party you're free trade deal destroyed the relationship with working class Democrats your call for cutting Social Security is going to kill this party\nYou guys represent a certain group of interest I get it at school like this is a big tent party but you cannot be the dominant voice in his party because you have no credibility was working people when you went and talked to real\nHave no credibility with working people so just to be clear because you and Bernie is that as many times you sip rock Obama wasn't progressive so widely supported by working class people were rock Obama built\nProgramming is supported by why WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nSupport Medicare for all\nHe didn't support free college tuition for ... years ago were talking about two thousand eight things have changed since ... native because she\nAll right\nAll right time and I want to throw something into this conversation that comes from an interesting direction the other day there was an op ed attacking Medicare for all it was written by Donald Trump God and he said quote the truth is that the centrist Democratic Party is dead and Joe Biden reacted to that still Trump he should hang up\nSo does Trump's characterization of the party have any traction drunk I was saying\nThat because his greatest fear is running against someone like Bill Clinton or a bomb and that's why he thinks he'll lose if Democrats regain the house a third of the Democrats in the house will be self described new Democrats\nFar from the centrist democratic wing of the party being dead it's alive it's well it's robust it's elected the last two Democrats\nTo the White House and I don't believe the way to win is a reprise of Nineteen nineties democratic centuries them any more than I Believe a reprise of Nineteen sixty democratic socialism the way to win we're in a new era and we need something different or the ideas like Medicare for all put up is there evidence that does win elections for Democrats and there isn't\nSo to respond and I'm gonna go back to questions\nIt's not just Medicare for all there is also debt free college there's affordable homeownership or you talked about examples of elections recently where candidates have one um Conor Lamb Pennsylvania Eighteen congressional district a very red district I think it had been held by Republican for more than ten years if I if I get that right he was running\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nOn Social Security on protecting Social Security isn't the Sanders position or progressive populist position it's a position I Can't really think of many Democrats who\nDon't hold it does a woman with black swimmer and yes thank you\nI'm my name's Kathy I'm Wondering you mentioned the new deal and the marginal tax rate in order to pay for that program went from twenty five percent up to Ninety four percent and most other countries that have\nYou know Medicare type for all its Seventy percent how will you get normal working people to be willing to pay Seventy percent increase in taxes in order to pay for others\nYou know there's a recent study out at a Medicare for all his also point out that over half of a democratic members of the house of representatives support Medicare for all the postmaster legislations for Medicare for all this is not a fringe idea by the way a there was this to report would show that in fact aggregate health care spending in this country would go down substantially if you had a Medicare for all system so will people be paying more taxes\nYes no doubt about that you can't get around that well they pay less than premiums yes cars won't pay premiums they won't pay any car payments they will pinch of Dr ... we're going to finally be able to get our hands around the pharmaceutical industry\nHas riffing off this country in charge against the highest price of the world\nSo in the aggregate our country is going to save money is going to be good for business people will pay less see rather\nAgain this is not a debate about policy debate about politics\nI Do not believe if you go to half of Americans and say you're going to give up your employer based health insurance and come on a government plan they would think that was a great idea but I Want to make a different point because the question was really about taxes Clinton was elected in Nineteen Ninety two why didn't lose the house in Nineteen Ninety four because Bill Clinton raised taxes and\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA and he'll start Oregon\nHi there my name's Jen I'm I have a question for each side um I mean there's always and party fighting but there seems to be a claim of who is a true Democratic Party and I guess that are like okay\nWhat's your view is representing the Democratic party type [noise] know can I answer that are so young when I asked if there is a little\nBut it was great parties\nThing you're supposed to do is build a winning coalition\nThat does not just include your side or other people the point is if you want to get the White House back\nIn large disdain democratic majorities do good things for the working and middle class of this country you have to build a winning coalition that's the map will they build a winning coalition and when you look at it they don't actually do that\nThey have such a problem with that because what we're asking for is inclusive witty what we're saying is if you reach out yes\nWhite working class in the middle America absolutely matters no one is saying we don't talk to them were saying like hey there are brown people there are black people there are young people that needs to be reached out to it needs to be inclusive\nAnd that's how you build a winning coalition and it needs to be multiracial and so for decades now those folks that I just mentioned has some left\nOut we have we have felt left out and now we're at a point in twenty Eighteen where we see candidates across the country in red states blue states that are representing everyone you have to have inclusive of the you have to include everyone and we can't go back and just focus on one group\nAnd I'm sure I agree a hundred percent\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more about\nToo many government programs and being dependent on\nGovernment health care and government funded education and fearing losing their independence and freedom of choice someone who is more moderate like me who has left the Democratic party become an independent because I don't particularly relate with a lot of these ideas how do you win me back what a great question [laughter]\nI mean that that's right on the table so\nI Want to go to the issue of religion and\nPublic colleges and universities we already have K. through twelve I think we all support probably going down to pre K I don't know if you guys are in that camp or not so we have an arbitrary deadline where where did you get past twelfth grade now we cut you off we didn't used by the way in New York state in California other places you didn't used to get cut off at twelfth grade\n... doesn't want his kids getting a free ride but if it's kids' shows up in first grade he's going to get a free ride that's just the way we work at in this country we have\nUniversal secondary primary an early education there's no reason why we can't have it for undergraduate school or even graduate school our European allies in many cases do do it that way\nA great loss of talented young people who either choose not to go to school or come out of school greatly indebted and there's research that shows that people have so much debt that they'd delayed making major purchases like getting married having kids in a whole host of other things\nIf we're going to compete in the international environment we have got to have the best trained workforce in the country we got to maximize the human capital of our population and that means having people who are educated that has a great social benefit I have to wrap up this section so Jeff made a\nDiscovering what matters in the area whether outlook for the twin cities it's mostly sunny day today expected with high temperatures in the mid fifties and winds from the south east\nOn Wednesday night rain is likely after midnight with low temperatures in the north forties rain on Thursday with highs and the upper forties winds from the south on Thursday night and sixty percent chance of rain areas of drizzle after midnight on low temperatures in the lower forties\nSaudi on friday with a chance of rain in the morning drizzle in the afternoon and high in the lower fifties\nActs of an issue President Trump speaks to move to the center of this fall's election coming up on MORNING edition [noise]\nWhat this Turkey's president one I'm David Greene and I'm Steve Inskeep ... placed himself at the center of the investigation of a murdered journalist\nHow could that benefit of president known for jailing journalists\nAlso this hour Republicans once controlled two thirds of state legislatures this fall they're playing defense against Democrats were hoping to catch a wave\nTo get guns out of Washington DC go wrong It's Wednesday October twenty more kind of off the\nAnd the news is next\nLive from NPR\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nDepartment is revoking or denying visas for Twenty one Saudi officials and secretary of state Mike Pompeo says the U.S is considering them targeted sanctions to\nWe've identified at least some of the individuals responsible including those in the intelligence services the\nRoyal court the foreign ministry and other Saudi ministries who we suspect to have been involved in Mr ... Des\n... says the U.S is still learning the facts and will base any further response on what the US government can confirm over the next few days Saudi Arabia's crown prince meanwhile met with the U.S treasury secretary who's in Riyadh Michele ... NPR News the state department\nTo the Associated Press if the government of Mexico reports Central American migrants continue to file applications for refugee status as they arrive from Honduras El Salvador and Guatemala\nThousands of migrants have joined together to walk north to the U.S border there are reports of another my grand caravan leaving El Salvador Maria Martin reports\nSources including a Salvadoran media and the U.S department of homeland security say another migrant caravan said the process of coming together this time in El Salvador reports say the group is being organized via what's up and Facebook with plans of leaving a Salvadoran next week\nThe first step would be neighboring Guatemala and in response that country's interior minister says it's working with the defense department to put in more stringent border security measures than those in place last week when the first migrants march came up from Honduras\nA government spokesperson said that one took us by surprise adding that while the mother has now help return more than three thousand migrants back to Honduras\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR list dot org\nLine and say at least one ticket was sold in that state it's unclear if there are any other winning tickets the estimated ... million jackpot is worth one point six billion dollars\nThe national Hurricane Center says hurricane Willem has been downgraded to a tropical depression\nThe center of the depression is over central Mexico it now has topped sustained winds of thirty five miles per hour when will it was in the Pacific ocean off Mexico's coast it was a hurricane with top sustained winds of one hundred sixty miles per hour or a category five storm\nThe storm's remnants are now moving east toward southern Texas\nYou're listening to NPR News from Washington\nBoston has taken game one of the world series they defeated the Los Angeles Dodgers eight to four at home and Fenway Park last night\nThe red socks went ahead early in the game Red Sox outfielder Andrew been intending had four hits while pinch hitter Eduardo Munoz smacked at three run Homer game two is tonight in Boston it will be justice chilly it was fifty three degrees at the opening pitch in last night's game\nHumans expert on human rights in North Korea says that conditions in the nuclear armed country have not changed in the past year when to pursue those says the report comes despite progress in denuclearization talks and lower tension on the Korean Peninsula\nThe un expert stressed that the nuclear issue is extremely serious but that it's time for North Korea to show a commitment to discussing human rights so far he said it has not done so the un investigator also calls on the north Korean regime to grant access to experts visits\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\n... rights violations are without power alone the contemporary world for NPR News I'm going to sue though in New York\nAsian markets showed mixed improvement in today's trading following smaller losses yesterday on Wall street Japan's Nikkei average rose four tenths of one percent the Hong Kong market fell for tens of one percent in today's training on corporate Goldman NPR News I'm Cathy words or what\nNews from Minnesota Public radio the campaign of eighth district Republican congressional candidate Pete Stauber dismisses a legal fight over his emails as quote politics\nThe Minnesota DFL party filed a lawsuit yesterday asking that emails between ... and the national Republican congressional committee found in his St Louis county email account be released strawberries a county commissioner\nShoppers in a heated contest for the CD eighth seat with ... and Independence Party candidates skip sandman\nAnd its lawsuit the DSL party claims at St Louis county is in violation of the state's data practices act\nThe lawsuit follows last week's\nAdvisory opinion by the Minnesota department of administration which said the emails are public and that St Louis county acted improperly by refusing a request from the star Tribune release Fifteen emails involve the N. R. C. C. founded stoppers cow to email account earlier this year\nIn other news in three at three AM it narrowed their losses to four percent by the close of trading yesterday ... as much as eight percent in mourning trading the last game after the company reported financial results that fell well short of investor expectations and people would be manufacturer says it's third quarter sales fell slightly and the company\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\nNew episode every Friday on prime that he I'll check that forecast looks like we have temperatures mainly in the twenties and thirties at this hour cloudy skies today lows of should say Hi is only in the mid forties across northern Minnesota in fifties in the south and we have a chance of rain mainly in northern Minnesota\nIt's MORNING EDITION from NPR News I'm Steve Inskeep in Washington DC and I'm David Greene in Culver City California ever since the killing of Saudi journalist ... G the Saudi leadership has been struggling to explain what exactly happened\nPresident Trump has been criticized for not responding more forcefully against the kingdom though his tone has shifted in recent days\nSomebody really messed up and they had the worst cover up ever and ... is at the deal standpoint whether they thought about it because while the thought of that idea I think is in big trouble and they shouldn't be in big trouble\nIn addition to the president's remarks secretary of state Mike Pompeo announced that the U.S would be revoking the visas of Saudi operatives who were accused of killing could show G\nThough many of those suspects were already under arrest\nSome parents have said that this would not be the less steps the United states would be taking on this matter but for turkey where the killings took place the uproar has offered president ... air to want a chance to boost his regional influence yesterday\nIn a speech to Turkish lawmakers he demanded cause showed jeeze killers be brought to account and suggested holding their trial in Istanbul\nFor was yours is a professor of international relations at the London School of economics also the author of numerous books on Mideast politics and he joins us on the program this morning professor welcome\nProgramming is supported by YWCA Minneapolis coming together to Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nThe way that ticket has managed the crisis to the monstrous miscalculation by this how it is\nUm what President Obama wants to do is to polish\nOr the standing is sending an image and the well by insisting that he wants justice for John ... who wants to improve relations with the United states which deteriorated in the past year or so\nHe has consistently and systematically exit the pressure on the Saudi leadership it wants to maximize basically a is a interest if he's a he's not just the Saudis and the reason that most of all if you ask me what's the one thing\n[noise] it's a pivotal election year from Minnesota as we choose to US Senators a governor and attorney general and the state and federal houses [noise] keep up on the news meat candidates and dig into the issues at ... dot org\nSlash elections support for news comes from Amazon Web services used by millions of customers aids all the U.S provides a range of cloud services and functionality from tools to security to compliance\nMore information they're able to us is how dot com see three I O T providing a software platform that an eagles organizations to deploy artificial intelligence predictive analytics and I oh chief solutions at industrial scale learn more ...\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nOr at Raymond James dot com\nI'm Cathy ... and this is MORNING EDITION on NPR News [noise]\nYou know sexual harassment and assault allegations have been one of the most dominant features of the campaign in Minnesota this year for the allegations against Keith Ellison to those against Brett Kavanaugh the me too movement has been a constant this election cycle and it could influence how some people vote on election day\nOr a political reporter brand of beers Bach has been reporting on this for quite some time and he's here to talk a bit more about this good to see us hey good morning\nSo both parties brand is you know say that their voters are fired up over the confirmation of Brett Kavanaugh to the Supreme Court and I want to know from where you stand in for what you're hearing\nHouses appointment and and that incredible contentious confirmation process how's it all playing out here in Minnesota yeah I was talking to a couple of candidates this week we're out of the doors and talking to voters and the candidates themselves say they're not bringing up Brett cabinet but the voters are\nOne democratic candidate running for the house said she has had several women break into tears talking about it and they're\nThey're either angry or they're very sad inside watching the the allegations in the testimony play it on national television really triggered\nPast experiences for them or\nJust made them more motivated to vote no on the other side I talked to a Republican who was also knocking on some doors and she said she heard the other side which is\nEssentially they were angry that he got put in a situation they don't believe the allegations against him and they're motivated because they're worried about men they know when men in their life who might have the kind of a public allegation um put upon them in in a way that a puts them through the agony that Brett Kavanaugh said he went through so\nProgramming is supported by why WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more YWCA M. P. L. S. dot org\nFor Democrats Republicans or something else based on the confirmation of Brett Kavanaugh and Democrats had a slight advantage there\nForty one percent of people polled said they were more likely vote for Democrats because of his confirmation well thirty nine percent said they would more likely vote for Republicans but if you look at women\nThe gap is wider forty seven percent of women said they're going to get out and vote for Democrats because of his confirmation ... thirty three percent said the same about Republicans and college educated women in urban and suburban areas are really critical voting bloc and usually not a very unanimous one so\nThis could potentially sway them and help Democrats in some key suburban races\nSo before the cabinet confirmation hearings ... as you know obviously a lot already happening in the state of Minnesota round the me too movement you did a lot of coverage of\nThis at the state Capitol yeah we yeah and I mean the Al Franken seat for instance it's open because of me to allegations and that's been a dominant theme in that race car in house leader Republican is constantly bringing it up related to her opponent Tina Smith\n... it's been in huge into house races Republican state rep gym now block is NPR News reported had allegations against him from his daughter he denies them but he's dropped out of the race really the big one has been to Keith Ellison race for attorney general he has an allegation which he denies of domestic abuse from an ex girlfriend\nAt it it's still do consumed to the entire cycle we had some polling numbers on that this week to saying thirty percent of people believe the allegation against them that's up since September and now he is down in that race as well so that's a huge in that race for him\nEven though the divorce records were made public and didn't show any other instances of domestic assault yeah the poll happened before the questions were asked right before that\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nThan allegations now I talked to a woman who was\nPart of that allegation she settled out of court I'm against China and she said the ad is an accurate and it was really triggering for her to see that on television so it's something that's coming up in TV ads and attack ads weather and the women are consenting in a part of that ad in the first place well\nAri Brenna thanks so much for having me brand of beers by a political reporter for NPR News\nThe pivotal election year from Minnesota as we choose to US Senator or governor and attorney general and the state and federal how to keep up on\nMeet the candidate gauging tradition NPR News for slash elections\nIt's five twenty five President Trump has endorsed Republican candidate Eric pulses campaign for reelection in the third congressional district that's despite pulses efforts to play up his differences with the president during his tough race with Democrat dean Philips\nMeanwhile as Brent ... tells us both sides continue their barrage of sometimes nasty TV ads and the suburban Minneapolis district\nAt a campaign event inside of suburban office building this week Eric pulse and was happy to be with the Republican Party luminaries\nRipe privileged to welcome once again Paul Ryan speaker of the house to Minnesota right here in Florida [noise]\nRyan praised his colleague he told a couple of dozen supporters in the room that it's important that pulse and be sent back to Washington to represent the western Twin Cities district\nIs one of the best guys we got in Congress and no offense Minnesota but the whole country is watching ya countries watching Minnesota to make sure that Minnesota helps deliver us a Republican Congress you got to get out what to do that person is less\nEnthusiastic about another big party figure\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org\nTo learn more something of a surprise Monday Night when Trump tweeted his quote strong endorsement of Paulson\nTrump is Trump or he's going to do what he's gonna do\nPulse and says he didn't ask for the endorsement and wasn't told it was coming\nI I Wish the president would endorse my positions on on trade and protecting Minnesota's boundary waters you start to issues that are critically important the Minnesota\nIt cuts both ways Trump is working to rev up his supporters on behalf of endangered incumbent Paulson as the mid term election draws closer\nBut Paulson is being tested in a district that Trump lost by almost ten points and were some Republicans and independents remain wary of the president pulses democratic challenger is businessmen and first time candidate dean Philips\nHe welcome Trump's statement of support for Paulson President Trump does not endorse moderates Phillip says the Trump seal of approval makes it harder for Paulson to keep his distance the quotes\nHave not match the boats and I think a President Trump's endorsement a congressman pulse and has to be expected because Paulson has been a loyal soldier he's not a moderate\nThe third congressional district race is one of four top tear U.S House contest this year and the state with another suburban race and two in greater Minnesota also attracting millions of dollars and outside spending\nThe TV ads are intense including this one from Paulson sleazy Keith Ellison and shady dean Phillips Paulson and Republican groups of work to link Philips to Alice in the ... congressmen running for attorney general Alison trails in his race and struggled to overcome an ex girlfriends allegations of abuse which he denies\nDean Phillips should be honest with voters about whether he'll vote for Keith Ellison or not the only person that I Know I'm voting for on November ...\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot\nOrg to learn more strict about the issues important to the people that I Hope to serve and I'm running against their pulse and meanwhile democratic allies are coming in late to help Philips in his quest to flip a seat the Democratic congressional campaign committee is entering its first ads calling pulse and special interest sellout\nDeliver the Minnesota way we know only time we spend Aaron calling on the\nAd barrage will come to an end soon but residents of the third district won't know until election night who will represent them in the house for the next two years\nCovering politics I'm Brian ... at the Capitol\nOn the next to NPR News presents the congressional candidates in the second and fifth district's Jason Lewis and Angie Greg debated on ... Twin Cities PBS and NPR's Tom grand hosted Jennifer ... today at noon and nine\nPM yeah that was quite a debate we had friday night with Louis and Craig and hope you'll tune in at noon today and listen to that part of NPR News presents and Kathy words are glad to have your board\nThat to a congressional oversight is supposed to work but hasn't now with one party controlling Washington the past two years Justin rude is a former congressional investigator now with the nonprofit project on government oversight\nWhat we've seen is not only a a a stretch of time when you have an executive branch that has been breaking norms but you have a Congress who sat by without consequences allowed that to happen without significant accountability\nDemocrats would face pressure from their base to in ...\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org\nTo learn more as Democrats should go after Trump's tax returns he's refused to disclose them Democrats would have the authority to get something\nAt the house intelligence committee perspective care Adam Schiff of California says he would probe allegations that Russia has financial leverage over Trump\nThe Trump Administration has ignored virtually all information requests from congressional Democrats but there's a workaround for that get the documents from friendly nonprofit groups that get them through the freedom of Information Act Austin ... is director of American oversight a progressive group this now filing for ya request\nIs actually very difficult to enforce the congressional subpoena in court in contrast a freedom of Information Act request wish we could file we can go to court very easily and force agencies to be transparent\nIt's worth noting this for your strategy was owned by conservative groups in the Obama era House Democrats plan to have all the committee's doing oversight investigating cabinet secretaries who broke the rules protecting Obamacare finding out what went wrong with hurricane relief and tackling other issues that Republicans have brushed off\nOne master of oversight is former congressman Henry Waxman during forty years in the house he investigated everything from the tobacco industry to the Iraq War\nWaxman listed three goals have good oversight stopped the waste of money hold people accountable and make government work the way it should use word of caution to House Democrats don't do oversight the way the Republicans have recently\nThe committees in Congress used their power which is eating credible amount of power and abused it for simply political points simply to advance their election interests\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA and he L. S. dot org\n[noise] this is NPR News\nGood morning from the BBC in London I'm going to get to see with BBC talk ... some of the top stories we're watching right now NATO is beginning its biggest military maneuvers since the Cold War and exercise to repel among invasion of Norway angel secretary general Jens Stoltenberg said the war games had a deterrent factor\nSense like fed message driver nations and the potential of the survey and they still does not seek a confrontation but this ... this is defend all of us against and it says\nIn a few hours the European Parliament is expected to vote on an e wide ban on single use plastic products\nUnder this draft law plastic items where there are alternatives would be bands across the EU states countries would have to find ways to reduce the use of plastic containers and cops manufacturers would also have to contribute to the bills for cleaning up their products after they've been used\nThe BBC's Adam Fleming and the BBC has the new evidence that China has rapidly expanded network of detention camps in the ... region aging denies the allegations\nChina cools the vocational training centers but they don't look much like schools we visited woman with tools steel walls watched towers and the heavily guarded gates now a detailed analysis of satellite images has identified forty secure facilities built over the past decade across ...\nJohnson birth and in London I'm going to do see the b._b._c. [noise]\nYour plate ten years in the national football league you retire mostly healthy and\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nRight here on M. B. R. news\nWell here looking at uh the uh current conditions around the region the reporting stations checking in it's um it's kinda frosty around hitting Nineteen degrees at this hour twenty eight\nIn grammar ray at the Duluth harbor it's thirty twenty eight at the river falls Austin Twenty seven degrees\nIn La Crosse Wisconsin It's thirty yeah everyone's kind of cool the highs around the region today mid forties across northern Minnesota mid fifties in the south clouds to have a chance of rain in the forecast today\nSupport for NPR comes from this station and from farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs coverage options and more information can be found at farmers dot com [noise]\nFrom Trader Joe's offering new products in every store and new episodes of the original pod cast series inside Trader Joe's at apple pod cast or where podcasts are available more at Trader Joe's dot com\nAnd from the listeners who support this NPR station\nIt's MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep\nParis was one of the first large cities to experiment with a bike sharing system what it introduced the leap more than a decade ago valium had been a huge success at a point of pride for the city until this year when it changed operators and almost collapsed\nThe parents mayor has given the new valium operators until this fall to get their act together\nWell it's fall NPR's Eleanor Beardsley reports\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nOr taking the metro vote he says despite the leaves recent troubles the system has improved a lot in the last two months\nOr voted goes for ... for August Vacation there were no bikes here and you had to walk to a lot of stations to find one at least now their bikes\nFor tens of thousands of Persians they leave is a vital mode of transportation and air traffic choked city so when a new transport consortium won the veil a contract with a plan for electric bicycles people were enthusiastic\nWere very excited with the new ... there were a lot of promises are new barge was hard to ... new features\nThat ... way of Paris in the saddle a cyclist advocacy group lab ... says the new companies ... was a big disappointment\nOf disaster for biking um disaster for ...\nBikes were broken or unavailable the dock that held them we're out of order daily Bailey bused plummeted from one hundred thousand trip today to a couple thousand\nParis mayor and eat out though said she was giving ... just a couple of months to get things on track the company hired crisis manager I don't know Mario Cuomo who became ... new CEO Mary ... says the first mistake was changing they leave operators with no lead in\nTime it was I think crazy to do stuff because you have to be the musicians or an ... an refined ducks flu deterred by a to B or chops for about three\nContinued downhill over the summer now they all said on top of its technical problems the company struggled with vi damaging theft\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nNew they leave now fit snugly unlock properly and they're charging docks trips have now written back up to nearly forty thousand a day and he says the new they leave them like the old ones are available in the Paris suburb\nYou have to think about these people who have moved from the ... to ... from the one to use clean bike or treat by Joe and and we have ducks in stations roughly ...\n... feet bully is still trying to unlock a bicycle\nYou know to start earlier was\nFinally one becomes available in this one told me no a minute ago he says it shows you should never give up and said this is Amy\nLab he rides away Eleanor Beardsley NPR News I'm Aaron\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm David Greene and I'm Cathy wars are but have you with us It's Wednesday here on MORNING edition five forty nine\nYou know someday little Lenin Getty will be told about his birth and the incredible circumstances surrounding it last Tuesday Ashley Getty who was quite pregnant awoke to find her husband Andrew gasping for air and in cardiac arrest\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years\nBringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org programming supported by the Institute for freedom and community it seemed to lift college posting to discussions with Wall Street journal columnist widely acclaimed historian and foreign policy professor Walter Russell Mead on October thirtieth\nInstitute dot ... dot edu [noise]\nThis hour what we know about the release of the kidnapped Japanese journalist and the latest international followed after the killing of Saudi journalist ... ... plus how political parties are spending their cash in these critical days before the midterm elections\nIt was on this date in Nineteen eighty when Paul McCartney was recognized by the Guinness Book of world records for being the best selling songwriter and recording artist of all time [noise]\nFormer Rolling Stone Bill Wyman as a birthday he turns eighty two\nIt's six oh one in the news is next\nLife from NPR News in Washington I'm more of a Coleman President Trump says he wants to know everything there is to know about the death of journalists democracy OJ NPR's Giles night or reports Trump says he'll be briefed on the investigation later today\nPresident Trump told reporters at the White House it a lot of information has been gathered about the killing of Washington Post contributor to ... jeep and that he's planning to meet with U.S officials looking into his death says he takes a stronger tone toward Saudi Arabia calling the killing a total fiasco\nWas horrible yes if your shoes are that they should have never been in execution or is it should've never happens\nSays he wants to hear a bipartisan recommendation from ...\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nBillion dollars in aid to help shore up that country's troubled economy some Pakistani critics say the money's a reward for the country's support of the kingdom of Saudi rulers face criticism for ... killing\nNPR's ... reports from Islam about about the actions of Pakistan's new prime minister Imran Khan\nThe money was announced off to con attended an investment summit in the Saudi capital several big name companies and speakers withdrew from the event after the killing of journalists ... in the Saudi ... con ... said he couldn't skip the conference because Pakistan was desperate for loans\nNPR's Diaz and dean the top health official in the Trump Administration says new data suggests the opioid epidemic in the U.S is beginning to plateau as NPR's Emily Sullivan reports overdose trends are being cited\nIn his speech yesterday Alex days our secretary of health and Human Services cited new preliminary data from the Centers for Disease Control and prevention just increased by ten percent from twenty sixteen to twenty Seventeen those numbers stole toward the end of twenty Seventeen through the beginning of this year\nIn other words deaths aren't going down but are now at a steady rate\n[noise]\nPresident Trump is expected to sign a bill later today that expands medicate opioid treatment programs and support research of non opioid pain relief Emily Sullivan NPR News\nThe national Hurricane Center says what was hurricane Willa has degenerated into a tropical depression it's now over central Mexico once it\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA N. P. L. S. dot\nOrg to learn more they're winning tickets this is NPR Amazon Prime video with their ... serious and the creator of Mad Men Stein Diane Lane Noah why only Christine Hendricks and Andrew rentals a new episode every Friday on prime video\nFrom Minnesota Public radio news I'm Phil ...\nThat's already see items collected yesterday in a search for a missing teenager do not appear to be connected to her disappearance for the deaths of her parents\nAbout two thousand volunteers helped investigators comb an area near the Baron Wisconsin home where James and Denise claws were found shot to death last week authorities believe they're Thirteen year old daughter Jamie cost was in the home at the time of the shooting and is in danger\nTrailing his Republican opponent in the polls DFL attorney general candidate Keith Ellison says he wants to refocus the campaign on issues Tim ... reports\nThe latest NPR News Star Tribune poll shows Republican Doug ward lower the seven percentage point lead over Allison just a month ago Allison was ahead by five points\nDuring a news conference highlighting the need for lower prescription drug prices Alison said the poll results show that he needs to work a lot harder talking about health care and other issues\nAnd if other folks believe in those things I think they need to get busy and helped me with my campaign\nWord low was unavailable for an interview his campaign said in a statement that Minnesotans are looking at Alison ad are disturbed by what they see Tim pug by our Minnesota Public radio news\nAirlines is hoping to provide nonstop flights between the twin cities in Shanghai, China Martin ... has more the carrier has submitted a proposal to the U.S department of transportation\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nIn Minnesota and China\nCommercial airline service between the two nations is governed by agreements that limit the ability of airlines to establish new routes an airport spokesman said the service to China is not a done deal by any means but does this application to fly the route is an important first step\nMartin wildland Minnesota Public radio news\nMinnesota Vikings defensive end Everson Griffin is returning to the team after being away for a mental health evaluation\nThe biking say Griffin will resume team activities today refund left the team last month after a series of events that included a welfare check at a hospital it's not clear of Griffin will play and Sunday's game against the New Orleans saints\nIn basketball the timber wolves play the raptors tonight in Toronto\nIn the weather forecast partly sunny to mostly cloudy skies this afternoon high temperatures from the thirties north to the mid forties in the south\nA four to tomorrow cloudy skies with rain high temperatures mid forties north in mid fifties in the south right out of the twin cities thirty one degrees with fares guys this is NPR News at six oh seven\nProgramming is supported by center point energy you can help lower operating costs and decreased energy used with central point energies rebates on energy efficient natural gas equipment\nThe application deadline is December thirty first send your point energy dot com slash safe now programming is supported by Blue Cross Blue Shield of Minnesota offering a broad range of Medicare plans to meet your needs\nMore information can be found at Blue Cross MSN dot com\nIs MORNING EDITION from NPR News I'm David Greene in Culver City California\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\nThe decisive elections there are close so\nWhere the Republicans place their final bats\nSteven Law is with us again he leads the Senate leadership fund for the Republican side good morning thanks for coming by the morning so what'd you just explain what the role is of groups like yours at this moment when individual democratic star candidates people like ... rock of Texas have raised tons of money what is the group like yours do for the Republican side\nSure well we look at uh all the different races we tried to figure out which ones are the most competitive and most importantly where our own involvement would make a critical difference and uh so we're placing our last that's in the final weeks in the same way that outside groups and the other side are as well would you give me an idea of where some of those vets are going\nSure as a majority leader McConnell a a described it they're pretty colorfully he said a lot of these races if not all of them\nAre nice fights and dark alleys they're very very close\nAnd uh so we're investing in states like Indiana and Arizona in Tennessee and Nevada, Missouri West Virginia all states where those races are essentially within the margin of error and these are states where our money matters\nImaginable even a year ago that you would have to invest money in Tennessee to keep Republican Senate seat on the Republican side [noise]\nWell yeah I mean a tendency is definitely become a much more Republican state Democrats recruited a very strong candidate in Phil Bredesen and and he's somebody who's known to the electorate ah so this is a much more hard fought race than many thought we our view was that it was going to be competitive from the get\nGo I hadn't thought it was that close in the last couple of weeks but you're saying it's not decided you want to put some money there\nOr what have we been active for for weeks and weeks there or we think it's a pretty close race were very uh volition or Marsha Blackburn but this is a tough race are you still supporting\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nThere's a new way to listen to MORNING EDITION wait wait don't tell me he was around the world and all your favorite program simply say like so blame PR anytime you want to be updated or one good company\nTry Alexa play NPR oh relevant data deliver answers to complex business issues Tara data dot com campaign monitor an email marketing platform used by more than two hundred thousand customers worldwide\nWith the email temple it's a drag and drop email editor and twenty four seven customer service more ad campaign monitor dot com\nAnd Amazon Studios presenting beautiful boy based on father and son memoirs beautiful boy chronicles her family's experience of survival relapse and recovery starring Steve corral antipathy shelling may now play\nWith less than two weeks to go before election day two candidates for Hennepin County attorney squared off last night during a forum held in Minneapolis incumbent Mike Freeman and his challenger mark ... discussed what they would do to address racial disparities in the criminal justice system\n... Williams moderated that debate and has this report\nMight feminist served as Hennepin County attorney for nearly Twenty years he began the forum by telling the enthusiastic crowd at the north high school auditorium but some of the changes he's brought about during his time in office\nTwo years ago I usually rent in our struggle to make more transparent and more a redesign drug charges and we tried to use in the lower\nLevel than Freeman also\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nYou they should vote for the incumbent\nWhen my point is talk of all of his former now I Hope you're really question that based on his his record 'em I like to hope that he if he wins is going to make these reforms he's talking about um I don't have a lot of confidence and not based on his record\nThe foremost hosted by several organizations who posed questions on a series of issues including immigrants' rights sexual assault cases mass incarceration in bail reform how's he is the cofounder of the second chance coalition a nonprofit organization which advocates for people trying to get their life together after a criminal record\nYou said too many people get locked up pre trial because they can't afford bail and how'd you said he supports getting rid of the cash bail system\nFreeman said bales should be reserved only for people who pose a public safety risk or who are not likely to show up for court he said changes are already underway with programs like the city of Minneapolis is signing release program that program allows people facing nonviolent misdemeanor offenses to avoid jail for missing a court date\nSo I think you've made some progress on the ... issue and I'm In favor of moving forward on that before I got\nWe'll reform was not the only topic to race passions from the crowd as Freeman made his closing statement he was briefly interrupted\nI wanted another four years is kind of your journey because I Believe I've done a good job in the previous terms and I want to do that kind of additional criminal justice reforms that I've talked about\nThe name yelled by demand in the audience was\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nAnd works for everyone equally devote for new leadership in the county attorney's office\nIf we can have a justice system that is Julius drugs just that's actually affected that keeps us safe because it's just an effective and that we can all she taught us\nHow he got the DFL endorsement for the nonpartisan race but without any polling it's not clear who the front runner is in the race to serve the next four years as Hennepin County attorney Brandt Williams Minnesota Public radio news Minneapolis\nProgramming and supported by the close gaps now campaign with Minnesota having some of the worst achievement gaps in the nation close gaps now aims to close the gaps with early education learn more at close gaps now dot org\nSupport comes from sales force sales force essential is a C. R. M. tool built for small businesses and start ups learn more about sales force essential that sales force dot com slash essential ...\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep good morning not for Twenty years has there been a democratic governor in Nevada it's an increasingly blue state in presidential elections the governor's office has said read but this year Republicans face that challenge as NPR's Leila Fadel reports\nIt's Sunday afternoon and ... is that the seafood city supermarket I'm here with the Democratic candidate for governor walks through the fast food joints at the entrance into store passing out different kinds\nToday he's focused on the Asian American islanders out there that ten percent of the state and like the country that the fastest growing nation but in this community the turnout is historically low\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR left out Oregon\nState trend in the two thousand sixteen election largely due to Latino voters organized by the state's strong is labor\nUnion the color of their union that it shows Hillary Clinton Democrats flipped the state legislature and delivered the first Latina senator to Congress Catherine Cortez ...\nIt's the model says Tom per as the chairman of the Democratic National Committee he's out of the day campaigning\nThe Democratic party nationally\nLeads to emulate what the better have been doing\nSince the beginning and twenty fifth in which is organizing early organizing everywhere making sure that we have\nTwelve months party\nWhere we are talking to people\nHe points to the voting flyers at every checkout counter the Asian grocery store in early voting states he says attention to details like that is what's important\nYou know the old DNC had a faith based approach to the German elections you always ready to cut his whim but we didn't do much else\nGrad says he thinks Democrats will flipped anywhere from eight to a dozen governors seats this election the popular Republican incumbent in Nevada Brian Sandoval is barred from running because of term limits\nSo it's just like has a chance against his Republican opponent Adam lack salt the current attorney general Irish ... campaign for this story too but no one responded\nNow something is shifting this year with voter turnout was higher than usual during the primaries and in the first days of early voting and the race is really a toss up according to polls\nJohn Austin is the editor of the data independent and an expert on Nevada politics we needed a coffee shop\nIn Nevada electorate reflects the nation's electric very polarized\nThe lower turnout election so\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nFor for attorney general he's the only candidate in modern Nevada history to have lost both the urban areas and still won a statewide race\nBack at the grocery store democratic candidates keeps his rack wraps up his visit to people he needs to reflective of Las Vegas a transient character summer recent arrivals or visitors who can't do that to others are conservatives to shake suffer like sand and later tell me they're not voting for him and then there's ...\nShe registered with as a sixteen to go to legalize marijuana she got the money that came from it would go to her kids' schools so far she says that\nWhere's the money going how are we going to fix the schools because when you first started my my daughter I just couldn't afford because there were in that for the kids\nShe'll do for the person who will improve her three children's education than the fault in NPR News Las Vegas [noise]\nSupport comes from Cornell College where students build their experience one course at a time with over fifty programs in pathways and the ability to create their own major students with their education to their passions explore more at Cornell College dot edu\nProgramming and supported by health partners offering help for Medicare support for Minnesotans just like you whether you're a small town there or a high rise downtown or on\nYour health partner at health partners dot com slash NPR coming up on six thirty\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nIs that a bill book it was awesome you know ... so any form of threat to the Atlantic rainforest is terrible he says because once you lose it you'll never get it back then it reads NPR News El Dorado\nYears after he vanished in Syria a freelance journalist is confirmed safe drew pay a suitor was taken by an extremist group but unlike other reporters who have been killed in recent years he has surfaced in Turkey NPR's Anthony Kuhn reports\nJapan's chief government spokesman you'll Sheehy de su ... told a hastily convened press conference on Tuesday\nThe Tokyo had received information from ... about the journalist forty four year old to June pay us to to you and you can you do you go to conjure informed us that Yahoo dot has been released and is it an immigration center a turkey suit got told reporters\nYesterday I went to Syria three years ago to report on the fate of his colleague Ken gee go\nGo go was taken hostage in Syria in twenty Fifteen and headed by the Islamic State's group\nIn al Qaida affiliated group known then as the new front reportedly took an pseudo hostage it's not clear how he was freed in twenty sixteen video came out purporting to show yesterday he told his family he loved them any hinted at the nature of his ordeal in wherever\nYou are a solid and we and\nYou're sitting in a dorm room suffering pain he said well there is no one to answer a no win respond you are invisible you do not exist no one cares about cheap Yahoo that began reporting in the middle east in the early to thousands he was taken hostage in Iraq and two thousand and four and later fried\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nSons release she folded little paper origami cranes at least one a day more than ten thousand you know\nAnthony Kuhn NPR News Beijing\nAnd\nMany campaign endless long how they unified theme\nThe healthcare John knows firsthand how important health care's her family unlike him\nI'll take on the big drug companies to reduce prices candidates are playing to their voters we are seeing them take on health care more head on in part because voters are so concerned about health care in the mid term this afternoon on all things considered from NPR News timely topic of course\nATC starts at three o'clock this afternoon now before that at eleven o'clock this morning it's Carey\nAnd Carrie Miller we'll talk about health care reform and a health care premiums specifically customers who buy insurance through the Affordable CARE Act are seen that the average price for the most popular level of insurance drop for the first time\nSince the health plans were created so she's going to ask what is causing the drop in price and how is the current administration contributing or working against these trends and what to do when it comes to a tweaking the Affordable CARE Act or making changes to it as eleven o'clock this morning Carrie Miller here on NPR News coming up\n... weather forecast and the news from the BBC\nStart your day was Minnesota new every morning taffy wars opposed to go to the top stories from our reach for you a little weather and sports if I kept called NPR News updates\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nStart your day was Minnesota new every morning tapping was opposed to the top stories from our reach for you a little more than ... pi Kappa called the MPR news update\nYou can find it on NPR One or wherever you get your podcasts\nHere's your NPR Twin Cities forecast partly cloudy day today with the highest fifty two degrees or the southeast breeds of five to ten the overnight Locy about forty two the chance of drizzle after midnight and then the rain moves into Morrow rain is likely with a high at fifty two\nFifty percent chance for rain tomorrow night in a fifty fifty chance of rain friday it's still a chance for rain on Saturday with rain likely Saturday Night into Sunday and that's your NPR weather forecast\nTo the network of detention Centers for we go Muslims in ... our correspondent Jones said with his hug from those who've been inside the camps\nA program of pretty harsh physical regime often cruelty and violence or alleged and the the costs walk if you like again to use China's phrased consists of a rote learning of China's anti extremism laws and\nThings like the singing of ... songs if that'll sounds like brainwashing well some people would say that's exactly what it is\nJoining us as the camps provide where you're going to Muslims with education human rights groups say the people are being forcibly detained NATO was preparing for its biggest military maneuvers since the Cold War an exercise to repel a mock invasion of Norway\nJuncture is intended to demonstrate nature's ability to reinforce a threatened allies speed of the crisis breaks out the whole thrust of the alliance his current but at the thinking has been to make its forces more agile\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nHanging around some on Alexander Griffith uh the b._b._c.\nIt's MORNING EDITION from NPR News I'm Steve Inskeep in Washington DC\nAnd I'm David Greene in Culver City California for years now Israel's prime minister Benjamin Netanyahu has\nNot so quietly work in tandem with Saudi Arabia's rulers even if the two countries don't have formal diplomatic relations they saw shared interests and also shared antipathy towards Iran\nWill now Saudi Arabia's crown prince Mohammed bin ... faces suspicion for killing and a cover up after the death of a journalist and ... so what does this mean for Israel NPR's Daniel Estrin is with us from Jerusalem Hi Daniel\nI David so how many Yahoo handling his what's he saying\nSo far he said one thing about this um early last week he said I Know about the shows you a fair as much as you do he was responding to a question from a journalist privately I can imagine he's quite worried um he has spoken a lot about\nA new Middle East or where some Arab countries\nEnemies of Israel are starting to get closer to Israel and Saudi Arabia has been seen as the first in line and I remember I was in Washington earlier this year I was covering this on yahoos visit to the White House that's on Yahoo briefed reporters he then ended the briefing with a little bit of drama he took out a piece of paper\nHe said he didn't working on on an issue for a long time and he read from this paper that Saudi Arabia was going to open its airspace so flights from India could fly over Saudi Arabia and reach Israel um you know instead of making a big detour around yeah your abs so this was like how did\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\nFor a relationship so how was released feel about that how do they feel about Saudi Arabia and its leader\nWell they've really been banking on on the ... been some on M. B. S. as he's called they see him as the the man in Saudi Arabia who leads who has led this new approach towards Israel and they believe he's willing to do two things first press the Palestinians to accept\nWhatever plan Trump presents for a peace deal with Israel\nAnd to uh to lead a coalition of Arab countries to stand up to their mutual enemy Iran\nAnd the concern here now is that a NBS Mohammed bin some on after this killing will be more defensive I'm On the defensive inside Saudi Arabia\nAnd won't be in a good position to push these things these heavy Israel and as former ambassador to Israel under President Obama Dan Shapiro has said can you imagine any European diplomats now willing to really be seen sitting down with Mohammed bin ... you know in discussing it around\n... ... what about Palestinian leaders and what about the rest of the region because there's there's often very little nuance when it comes to Saudi Arabia and sort of a feeling throughout the region right but you're either with the Saudis are are not\nYes and we've seen that a lot of a wall to wall support by many countries Egypt Jordan the United Arab Emirates many others um allies of Saudi Arabia putting out curiously almost word for word statements in some instances supporting Saudi Arabia um a lot of these countries get money from Saudi Arabia\nAnd pears Daniel Estrin in Jerusalem for us this morning ... thanks as always You're welcome\nIncreases in hell\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR list dot org\nNPR's Code switch team met people who want to grab young voters' attention by making them laugh\nA new campaign called the call the cops started a few days ago and it's thirty second spots are popping up on the Internet in one a guy with a laptop is sitting on a cafe patio he looks disgusted Lee into his recyclable cup as a stunning young black woman pulls up a chair\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nI'm Gary Miller are you looking for a good book to read that sign up for the thread newsletter text book to six seven seven six seven seven and I said recommendations to your inbox once a week [noise]\nWest support these offering no evidence for these claims I'm Cathy wars or It's Wednesday October twenty fourth on MORNING edition [noise]\nThis hour a look at the end game for Turkey's president in his handling of the Saudi journalist murder and how Minnesota voters or factoring me too and the Kavanaugh hearings and into their decisions about local candidates\nThe supersonic Concord jet minutes less commercial passenger flight on the state in two thousand three traveling at twice the speed of sound from New York's\nKennedy or international airport Heathrow in London today's birthdays include actress and comedian Casey Wilson who's thirty eight [noise]\nIt's seven oh one in the news is next\nLive from NPR News in Washington I'm more of a cool I'm In the state department is taking steps to punish Saudi Arabian citizens who are suspected of involvement in the killing of Saudi dissident journalists Jamal consume Jane the agency has revoked or denied us visas for Twenty one Saudi officials\nSecretary of state Mike Pompeo says the United states is continuing to learn the facts after weeks of changing explanations the Saudi Government now admits ... was killed in a fist fight in the Saudi consulate in Houston\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA and he L. S. dot org\nThrough the debate Republican Brian Kemp was asked if he used his position as secretary of state to suppress minority voters in elections his response\nIf you look at the numbers minority participation in Georgia's up twenty three percent we have a million more people own our voter rolls today than we had when I took office but Democrats Stacey Abrams said voter suppression was about more than being on the rolls creating an atmosphere\nOf fear making people worried that their votes don't count\nThe pair of glasses in recent weeks over everything from rejected absentee ballots the door just strict voter registration law they both face libertarian Ted met in November for NPR News I'm Stephen Fowler and Atlanta\nA Japanese journalist is free after vanishing in Syria three years ago NPR's Anthony Kuhn reports from Beijing that the freelance reporter is believed to have been held hostage\nForeign minister tomorrow kono told reporters that Japan has confirmed the identity of forty four year old Jim pay us would a Qatari officials notified Japan of us who does release on Tuesday Japanese diplomats went to visit him at an immigration center in southern turkey and found him in good health\nYes Sudan went missing in twenty Fifteen and it was reportedly taken hostage by an al Qaida affiliate known as a time as the al Nusra front\nTokyo insisted that it had paid no way in ... in St turkey unconscious for their help with the case this is Yasser does second freedom from captivity he was taken hostage and later fried in Iraq in two thousand and four\nAnthony Kuhn NPR News Beijing\nThere is at least one winning ticket for last night's near record breaking one and a half billion dollar mega millions lottery and fears\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more ad YWCA M. P. L. S. dot org\nThose numbers I was at one point six billion dollars of our twenty nine years or a lump sum payment of some nine hundred and four million dollars NPR's Emily Sullivan this is NPR\nAmazon Prime video with that Romanoff seduce areas from the creator of Mad Men Stein Diane Lane Noah Wiley Christina Hendricks and Andrew rentals a new episode every Friday on prime video\nFrom Minnesota Public radio news I'm Phil ...\nItems collected yesterday in a search for a missing Wisconsin teenager do not appear to be connected to her disappearance or the deaths of her parents that's according to authorities who say about two thousand volunteers helped investigators comb and area near the Baron Wisconsin home where James and Denise claws were found shot to death last week\nThirteen year old Jamie clause has not been seen since\nThe FBI is investigating the deaths of two men on the red lake Indian reservation in northern Minnesota FBI spokesman Michael ... did not provide any details about the deaths of twenty six year old Dustin beret and thirty two year old James Rojas both men were from Minneapolis authorities say they died on Sunday\nOr west St Paul woman administered lifesaving CPR to her husband last week and then gave birth to the couple's first child a few days later Martin ... reports\nAt about five am actually getting noticed or husband Andrew gasping for air it turned out he was suffering a cardiac arrest actually called nine one one and a dispatcher told her what to do\nWanted me to get him down to a hard surface but I like to them that I'm thirty nine weeks pregnant and I couldn't get ...\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\nFriday Andrew saw the birth of his son Aladdin at the hospital ... Minnesota Public radio news\nShares of Maplewood based three M narrowed their losses to four percent by the close of trading yesterday after falling as much as eight percent early in the day the last game after the company reported financial results that fell well short of investor expectations\nThree am says third quarter sales fell slightly and the company trimmed it's expected profit for its a year [noise]\nMinnesota Vikings defensive end Everson Griffin is returning to the team today and we'll resume team activities driven left the team last month after a series of events that included a welfare check at a hospital and the mental health evaluation it's not clear if Griffin will play in Sunday's game against the New Orleans saints\n... play the raptors tonight in Toronto\nAnd the weather forecast partly cloudy skies today with high temperatures in the forties and fifties breezes from the south east at five to ten miles per hour to nights mostly cloudy skies a chance of some light rain low temperatures in the thirties and forties\nRight now in the twin cities with fares guys the temperature at thirty two degrees at M. S. P.\nThis is Minnesota Public radio news at seven ... seven\nProgramming supported by set her point energies home service plus serving Minnesota for over ... years\nEver fashions are committed to helping you repair replacing maintain your hardworking appliances learn more at center point energy dot com slash H. S. P. programming on Minnesota Public radio is supported by ... Baker Daniels lawyers providing integrated and strategic legal counsel and the range of issues affecting finance\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nStruggling to explain what exactly happened President Trump has been criticized for not responding more forcefully against the kingdom though his tone has shifted in recent days\nSomebody really messed up and they had the worst cobra ever and we're ... is at the deal standpoint when they thought about it as well as on to that idea I think is in big trouble and they shouldn't be in big trouble you\nKnow in addition to the president's remarks secretary of state Mike Pompeo announced that the U.S would be revoking the visas of Saudi operatives who were accused of killing could show gee\nDo many of those suspects were already under arrest\nSome parents have said that this would not be the less steps the United states would be taking on this matter but for turkey where this killing took place the uproar has offered president ... air to want a chance to boost his regional influence yesterday\nIn a speech to Turkish lawmakers he demanded cause showed jeeze killers be brought to account and suggested holding their trial in Istanbul\nFor was yours is a professor of international relations at the London School of economics also the author of numerous books on Mideast politics and he joins us on the program this morning professor welcome\nThank you so what what are\nThe ones motivations here for coming out so forcefully and so publicly in this case\nWell I think a president has managed to crisis in a strategic Glenn away or at the way that it has managed to crisis to the stress miscalculation out [noise]\nUm what President on wants to do is polish a ending spending an image and the thing that you want justice\nProgramming supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred and twenty five years bringing the community together to Minnesota Forward when it's time to talk forums on race YWCA and he'll ask dot org\nHere's your NPR Twin Cities forecast partly cloudy day today with the highest fifty two degrees without these braids at five to ten the overnight ... about forty two at the chance of drizzle after midnight and then the rain moves into Morrow rain is likely with a high at fifty two\nFifty percent chance for rain tomorrow night in a fifty fifty chance of rain friday still a chance for rain on Saturday with rain likely Saturday Night into Sunday and that's your NPR weather forecast [noise]\nI'm Catherine richer part of the NPR News team based in greater Minnesota from Rochester to Morehead we report on the economy the environment and the people across the NPR audience discovering what matters\nPlanning in their client's best interest\nLet's make a plan dot org the department of homeland security with e verify dedicated to providing employment eligibility verification for all businesses and the employees that helps them thrive at e verify dot Gov slash go\nAnd Lyndon mood bell learning process he's committed to helping all students learn to their potential they're learning centers and online private school offer instruction in reading and comprehension Lyndon mood bell dot com slash NPR\nI'm Cathy ... and this is MORNING EDITION on NPR News [noise] you know sexual\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with its telling him to talk forums on race on October twenty fifth you can visit while he WC A. M. P. L. S. dot org to learn more\nOr political reporter brand of beers Bach has been reporting on this for quite some time and he's here to talk a bit more about this good to see us hey good morning so\nBoth parties brand is you know say that their voters are fired up over the confirmation of Brett Kavanaugh to the Supreme Court and I want to know from where you stand in for what you're hearing\nHouses appointments and and that incredible contentious confirmation process how's it all playing out here in Minnesota yeah I was talking to a couple of candidates this week we're out of the doors and talking to voters and the candidates themselves say they're not bringing up Brett cabinet but the voters are one\nDemocratic candidate running for the house that she has had several women break into tears talking about it and they're\nThey're either angry or they're very sad and said watching the the allegations in the testimony play it on national television really triggered\nPast experiences for them or\nJust made them more motivated to vote no on the other side I talked to a Republican who was also knocking on some doors and she said she heard the other side which is essentially they were angry that he got put in a situation they don't believe the allegations against him\nAnd they're motivated because they're worried about men they know when men in their life who might have the kind of a public allegation um put upon them in in a way that\nA puts them through the agony that Brett Kavanaugh said he went through so really voters are talking about it and they're bringing it up even if the candidates aren't now I Know that we did some polling on this on NPR News and the star Tribune a polling data about how voters feel about red cabinet what does that show and we had a number of questions this week I thought one of the most interesting ones was a\nOn November ... are you more likely to vote for Democrats Republicans or something else based on the confirmation of Brett Kavanaugh and Democrats had a slight advantage there forty one per se\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR list dot org\nRepublicans and college educated women in urban and suburban areas are really critical voting bloc and usually not a very unanimous one so this could potentially sway them and help Democrats in some key suburban races\nSo before the cabinet confirmation hearings others as you know obviously a lot already happening in the state of Minnesota round the me too movement you did a lot of coverage of\nThis at the state Capitol yeah we yeah and I mean the Al Franken seat for instance it's open because of me to allegations and that's been a dominant theme in that race card house leader Republican\nIs constantly bringing it up related to her opponent Tina Smith\n... it's been in huge into house races Republican state rep gym now block is NPR News reported had allegations against him from his daughter he denies them but he's dropped out of the race really the big one has been to Keith Ellison race for attorney general he has an allegation which he denies of domestic abuse from an ex girlfriend\nUh it it's still do consumed to the entire cycle we had some polling numbers on that this week to saying thirty percent of people believe the allegations against them that's up since September and now he is down in that race as well so that's huge in that race for him\nEven though the divorce records were made\nPublic and didn't show any other instances of domestic consult yet the poll happened before\nThe questions were asked right before that was unsealed so maybe that will have some impact potentially and voters who had questions about that if they're showing up and TV ads to it is Eric pulse and has an ad out or against his opponent dean Philips who used to serve on the line of health board saying that he\nUh didn't deal with several sexual harassment allegations now I talked to a woman who was\nPart of that allegation she settled out of court I'm against China and she said the ad is inaccurate and it was really triggering for her\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nPower to health plans you care teams go the extra mile to deep complicate health coverage for their members learned about Medicare Medicaid individual and family plans at ... dot org programming supported\nBy the Institute for freedom in community it's seen all of college posting to discussions with Wall Street journal columnist widely acclaimed historian and foreign policy professor Walter Russell Mead on October thirtieth Institute dot ... dot edu\nIt's seven twenty five President Trump has endorsed Republican candidate Erik Paulsen campaign for re election in the third district and that's despite pulses efforts to play up his differences with the president during his tough race with Democrat dean Philips\nMeanwhile his brand backs tells us both science continue their barrage of sometimes nasty TV ads in the suburban Minneapolis district\nAt a campaign event inside of suburban office building this week Eric post and was happy to be with the Republican Party luminaries\nRipe religion to welcome once again Paul Ryan the speaker of the house to Minnesota right here in Florida [noise]\nRyan praised his colleague he told a couple of dozen supporters in the room that it's important that pulse and be sent back to Washington to represent the western Twin Cities\nDistrict is one of the best guys we got in Congress and no offense Minnesota but the whole country is watching ya countries watching Minnesota to make sure that Minnesota helps deliver a Republican Congress you guys can do that person is less enthusiastic about another big party figure Minnesota\n[noise] both times President Trump came to Minnesota to rally the faithful pulse and what's\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org\nTo learn more he didn't ask for the endorsement and wasn't told it was coming\nI I I Wish the president would endorse my positions on on trade and protecting Minnesota's boundary waters are two issues that are critically important in Minnesota\nIt cuts both ways Trump is working to rev up his supporters on behalf of endangered incumbents like Paul soon as the mid term election draws closer but Paulson is being tested in a district that Trump lost by almost ten points and were some Republicans and independents remain wary of the president\nPulses democratic challenger is businessmen and first time candidate dean Philips\nHe welcome Trump's statement of support for Paulson President Trump does not endorse moderates Phillip says the Trump seal of approval makes it harder for policy to keep his distance the\nQuotes have not match the votes and I think a President Trump's endorsement a congressman pulse and has to be expected because Boston has been a loyal soldier he's not a moderate\nThe third congressional district race is one of four top tier U.S House contest this year and the state with another suburban race and two in greater Minnesota also attracting millions of dollars and outside spending\nThe TV ads are intense including this one from Paulson sleazy Keith Ellison and shady dean Phillips Paulson and Republican groups of work to link Philips to Alice in the ... Congress men running for attorney general Alison trails and his race and struggled to overcome an ex girlfriends allegations of abuse which he denies\nDean Phillips should be honest with voters about whether he'll vote for a thousand or not\nThe only person that I Know I'm voting for on November six right now is the guy you're speaking with being Philips Phillip says the comparison is misplaced Congressman Ellison and my race and we have nothing to do with one another he's running a statewide race\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more committee\nIs airing its first ads calling pulse and a special interest sellout\nIn Minnesota we now it's time we send Arizona on his way ad barrage will\nCome to an end soon but\nResidents of the third district won't know until the election night who will represent them in the house for the next two years\nComing stole the political recently he wants to work with committee Republicans\nThose are the kinds of things were going to have to do and if they're going to is that going to be very pleasant for them if they're going to be very pleasant for me but I signed up for this job is what I'm supposed to do\nThat's how congressional oversight is supposed to work but hasn't now with one party controlling Washington the past two years Justin rude is a former congressional investigator now with the nonprofit project on government oversight\nWhat we've seen is not only a a a stretch of time when you have an executive branch that has been breaking norms but you have a Congress is set by without consequences allowed that to happen without significant accountability\nDemocrats would face pressure from their base to impeach President Trump House Democratic leader Nancy Pelosi says she's against it here she is last week at Harvard Institute of politics I have\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nAdam Schiff of California says he would probe allegations that Russia has financial leverage over Trump\nThe Trump Administration has ignored virtually all information requests from congressional Democrats but there's a workaround for that get the documents from friendly nonprofit groups that get them through the freedom of Information Act Austin ... is director of American oversight a progressive group to snow filing for your request\nIt's actually very difficult to enforce the congressional subpoena in court in contrast a freedom of Information Act request which we could file we can go to court very easily and force agencies to be transparent\nIt's worth noting this for your strategy was owned by conservative groups than the Obama era House Democrats plan to have all the committee's doing oversight investigating cabinet secretaries who broke the rules protecting Obamacare finding out what went wrong with hurricane relief and tackling other issues that Republicans have brushed off\nOne master of oversight is former congressman Henry Waxman during forty years in the house he investigated everything from the tobacco industry to the Iraq War\nWaxman listed three goals have good oversight stopped a waste of money hold people accountable and make government works the way it should his word of caution to House Democrats don't do oversight the way the Republicans have recently\nThe communities that Congress use their power which is in credible amount of power and abused it for simply political points simply to advance their election interests Waxman said that's not what oversight should be about Peter Overby NPR News Washington\n\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nAlready going by fast it's seven forty three [noise]\nThe stories the hair on NPR News I made possible by members investigation fact checking reporting on breaking news\nNumbers power every story and NPR News every step of the way\nHere's your NPR Twin Cities forecast partly cloudy day today with the highest fifty two degrees of the southeast breeds of five to ten overnight ... about forty two the chance of drizzle after midnight and then the rain moves into Morrow rain is likely with a high a fifty two\nFifty percent chance for rain tomorrow night in a fifty fifty chance of rain friday still a chance for rain on Saturday with rain likely Saturday Night into Sunday and that's your NPR weather forecast\nI'm NPR News chief meteorologist Paul ... start your day with a weather updates from NPR News text the word whether to six three seven three five and ... your phone every morning with the forecast to plan your day\n\nProgramming supported by the Minnesota Wild who are honoring law enforcement and dispatchers that's part of their hometown hero series November fifteenth the ticket offered presented by security and financial include the ticket to the game and a limited edition T shirt while dot com slash heroes\nIt's MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep Republicans want to preserve their power and this fall state elections Democrats want to take some of that power away\nYou know the audience they had a faith based approach to the German elections do we pray that this would win but we didn't do much else democratic\nGerman Tom for as is working on the Nevada governor's race\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nPublic into overseas his party's efforts\nThere part farm team and their part a current leadership people underestimate the impact that state and local governments have\nMatt Walter of the Republican state leadership committee was with the group as the party captured two thirds of all state legislatures they've recently lost some ground and hope to avoid losing more\nWhen you're at all time highs you are naturally playing defense so when you have an environment that the historical trend lines are going to tell you that you're going to wind up losing seats um you have to fight against that regression to the mean\nAren't there several states where the flipping of a couple of seats could make a significant difference or even change the chamber\nYes you have a one seat majorities and a Colorado and New York Maine two seats\nAre in Wisconsin and and the number of other states are quite close further compounding what you're saying is the narrow margins by which those seats chain chance ten votes twenty votes a thousand votes so it is critically important for people to get out and vote\nI guess we should remember that the Virginia house of delegates after the election in two thousand Seventeen ended up on the verge of being tied between Republicans and Democrats and they had to have a drawing to decide the last seat and you guys won the drawing you got the drawing even though you've lost a lot of ground in the election\nHow much of an advantage is it for your side that Republicans were in charge of many state legislatures at the beginning of the decade and so they did the redistricting in many many states\nIt's important to make sure that you've got fair and competitive lines and our contention is that better candidates with better ideas when based on ah the quality of their campaign there were some\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nThat's drawing the district lines that's where they came from right well I Would\nRaise a couple of points on that first and foremost the system we've designed has to have local representative that people can count on carrying the interests of that community we don't have a parliamentary system\nA it's a winner take all system within districts uh and so applying a notion that a statewide total somehow should be apportioned out two representatives a is a fundamentally against uh the basic structure of our system\nBut if you drew the lines differently in Wisconsin the election result could have been completely different with the identical set of votes from the public\nCould have that and you could have had different candidates and you could have had different issue sets and there are a lot of hypothetical\nBut what you've seen within Wisconsin a is overwhelming Republican success at the statewide level um you've seen Republican governors lieutenant governor statewide elected officials be reelected which has nothing to do with lines and you see that all across the country\nHow if at all do you advise state legislative candidates to deal with questions which must come up about President Trump\nThe state legislative level has very little to do with the federal government as it as it relates to um personality issues and dominant figures now there's obviously an environmental impact it's going to drive energy and resources in certain categories\nBut the best thing any elected official can do to be successful is understand their district can advocate for the things that are important to their constituents\nYou had a wave election in two thousand ten on that went all the way down to the state level um how do you deal with the danger of a wave election in two thousand eight team\nWell certainly always need to be prepared for the challenges that come but when you look at the special elections that have taken place this year if there are winding up\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\nDifference between the two parties the Democratic and progressive movement seems historically it'd be more focused on sort of installing a a a master architect at sixteen hundred Pennsylvania Avenue a and a more conservative philosophy wants to defuse that power out to the localities That's Matt Walter of the Republican state leadership committee\nProgramming supported mindset or point energies home service plus serving Minnesota for over eighty years\nEver fashions are committed to helping you repair replacing maintain your hard working appliances learn more at Santa point energy dot com slash H. S. P. O. it's a little cool here this morning around the region temperatures in the teens on the range twenties and thirties elsewhere\nA nice day to day pretty nice day and then you know things changed joining us with a look at the forecast is chief meteorologist ... already this morning my friend\nI'm NPR News chief meteorologist Paul hunting or start your day with a weather updates from NPR News text the word whether to six three seven three five and ... your phone every morning with the forecast to plan your day\nWho\nVisuals in Japan say a Japanese journalist kidnapped in Syria three years ago has been released and is now in Turkey I'm Cathy wars or if It's Wednesday October twenty fourth and It's MORNING EDITION on NPR News\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nAs President Trump and President Obama will make stops in the state this week by the latest on Wisconsin races just ahead\nIt was on this date in Nineteen eighty when Paul McCartney was recognized by the Guinness Book of world records for being the best selling songwriter and recording artist of all time\nFormer Rolling Stone musician Bill Wyman has a birthday today he turned to eighty to\nEighty one and the news is next\nLine from NPR News in Washington encore of a Coleman Turkish broadcaster MTV says Turkish police have received permission from Saudi Arabia and authorities to search a well on the grounds of the Saudi constantly in Istanbul they had previously been denied\nThis is part of the investigation into the killing of Saudi journalist ... NPR's Peter Kenyon reports that constantly building has already been searched\nSaudi officials have acknowledged ... died in the ... following more than two weeks of denials they said it was an accident during a rogue operation clean met with skepticism from Turkish president reject to fair to won\nA presidential advisor says ... killing as quote a disgrace that reaches all the way to crown prince Mohammed bin Salman everyone wants to those responsible tried in Turkey rather than Saudi Arabia Peter Kenyon NPR News Istanbul\nThe Associated Press says the government of Mexico reports Central American migrants continue to file applications for refugee status as they arrive from Honduras El Salvador Guatemala\nThousands of migrants have joined together to walk north to the U.S border President Trump has threatened to cut off aid to Central American countries if they don't stop the migrants journey today he tweeted us will never\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nRetreat pests called called us plans to leave the intermediate range nuclear forces treaty and develop new weapons tantamount to a declaration of a new arms race such announcements made the world a more dangerous place a pass calls and Russia had no choice but to think of its own national security\nWell the U.S has yet to formally exit the nuclear agreement the White House has made clear to Russia it's intend to do so\nIn talks with criminal officials in Moscow this week Trump's national security adviser John Bolton called the Nineteen eighty seven Cold War treaty outmoded for failing to include countries such as China in Iran and pointed to Russian violations of the IMF packed to justify the U.S withdrawal from current News I'm Charles Maynes in Moscow\nThe national weather service confirms a rare tornado touched down in New England on Tuesday it struck the city of Lincoln a suburb of Rhode Island's capital Providence it's not clear how strong the twister was a Beverly ... Roche says she and her husband will never forget it\nHe could see that the Clinton fly through the air and I hear him saying screening the trees the flying all over the place\nThe national weather service also reports more storm survey work is underway in North Providence Rhode Island but there's been no tornado determination there yet\nLottery officials in South Carolina say at least one winning ticket was purchased in that state for the huge mega millions lottery the jackpots where at one point six billion dollars it's not known who the winner is and it's not clear if there were other winning tickets you are listening to NPR\nPrime video with the ... the new serious and the creator of Mad Men Stein Diane Lane Noah why only Christina Hendricks and Andrew rentals a new episode every Friday on prime video\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\nNationwide sixty two cases have been confirmed in more than one hundred fifty are now suspected that condition can cause weakness or paralysis\nOf luck of turkeys in West central Minnesota has been diagnosed with a strain of avian flu ... senior veterinarian with the Minnesota board of animal health says it's not the same strain or potency of flu that hit the turkey industry three years ago\nSo I was identified as ... al ... pathogenic ... county and a ... of commercials tricky for us at the same direction that but I I actually thousand fall fall that cause stating highly pathogenic ... virus\n... says this is a North American virus that is commonly found in wild birds in the U.S she says the birds are not showing any signs of illness and because it was caught early in his easily treatable she says once the birds recover they continue on to market\nThree people canoeing near you Lee last weekend were rescued after their boats capsized Peter Cox reports history where\nCanoeing and snow bank lake when they're canoes flipped they took shelter in a small island called nine one one for help\nBorder patrol agents in the area overheard the call and responded they launched a boat and found that people provided them with cold weather emergency sleep systems and took them to the landing where they were turned over for treatment\nLaw enforcement on the scene recovered the people's gear including their two canoes Peter Cox Minnesota Public radio news\nMinnesota state colleges and universities system is waiving its application\nProgramming is supported by why WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nThe Minnesota Crichton and a handful of community colleges that are part of the Minnesota state system\nIn sports the twin or rather the timber wolves play the raptors tonight in Toronto\nIt'll be partly cloudy this afternoon with high temperatures in the fifties a chance of some sprinkles in the northwest southeast wins at five to ten miles per hour tonight how these guys some grizzled low temperatures in the thirties and forties\nRight now in Rochester it's twenty eight degrees here in the twin cities with various guys the temperature at thirty in St Paul\nThis is NPR News it's eight oh seven\nProgramming is supported by Comcast Business providing a gigs speed network and innovative applications that can help businesses move beyond Comcast Business beyond fast more at Comcast Business dot com programming supported by Thomson Reuters e discovery point I knew what they see discovery software solution that delivers speed accuracy and ease of use\nThompson writers provides the intelligence technology and human expertise defined trusted answers Thomson Reuters the answer company\nIs MORNING EDITION from NPR News I'm David Greene in Culver City California and I'm Steve Inskeep in Washington DC this is a tough mid term election for Republicans although there is no evidence yet that they're doomed\nThough the party in power usually loses ground Republicans are favored at this moment to hold the Senate they're long shots at best to keep the house although many of the decisive elections there are close so where the Republicans place their final bats\nSteven Law is with us again he leads the Senate leadership fund for the Republican side good morning thanks for coming by the morning so would you just explain what the role is\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nWhere our own involvement would make a critical difference and uh so we're placing our last that's in these final weeks in the same way that outside groups and the other side are as well would you give me an idea of where some of those vets are going [noise]\nSure I as a majority leader McConnell a a described it they're pretty colorfully he said a lot of these races if not all of them are nice fights and dark alleys they're very very close\nAnd uh so we're investing in states like Indiana and Arizona in Tennessee and Nevada, Missouri West Virginia all states where those races are essentially within the margin of error and these are states where our money matters on imaginable\nEven a year ago that you would have to invest money in Tennessee to keep Republican Senate seat on the Republican side [noise]\nWell yeah I mean a tendency is definitely become much more Republican state Democrats recruited a very strong candidate a in Phil Bredesen and and he's somebody who's known to the electorate as so this is a much more hard fought race than many thought we our view was that it was going to be competitive from the get\nGo I hadn't thought it wasn't that close in the last couple of weeks but you're saying it's not decided you want to put some money there\nOh we've been active for for weeks and weeks there or we think it's a pretty close race were very uh bullish on Mars or Marsha Blackburn but this is a tougher\nAre you still supporting Rick Scott the governor of Florida who's trying to win a Senate seat but it's falling behind in the latest polls against Bill Nelson\nFifty percent chance for rain tomorrow night in a fifty fifty chance of rain friday still a chance for rain on Saturday with rain likely Saturday Night into Sunday and that's your NPR weather forecast\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA and he'll S. dot org\nI'm Carrie Miller are you looking for a good book to read that sign up for the thread newsletter text book to six seven seven six seven seven and I said recommendations to your inbox once a week [noise]\n[noise] see three I O T providing a software platform that enables organizations to deploy artificial intelligence predictive analytics and I owe chief solutions at industrial scale\nLearn more ... ... ... a guy and the financial services firm arraignment dreams offering personalized wealth management advice and banking and capital markets expertise along with a legacy of putting clients financial wellbeing first\nLearn more at Raymond James dot com\nIt's about eight twenty here on MORNING edition I'm Cathy wars or President Trump makes another campaign visit to Wisconsin this evening he'll arrive in little ... Wisconsin to bolster the political fortunes of Governor Scott Walker\nWalker is in a tight race with Democrat Tony reverse Republicans are growing increasingly nervous about the prospects of Walker winning a third term\nThere's also contentious US Senate race in Wisconsin to get a look at the big races in Wisconsin midterms we're joined right now by Molly back she's a political reporter for the Milwaukee Journal sentinel Molly good morning to you\nDidn't learn anything for having an\nAbsolutely so the president is coming to this area and your wife saw this evening to boost walkers reelection campaign why Moses neat\n[noise] so they can't then turned out pretty heavily for him and and twenty sixteen\nProgramming is supported by YWCA Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nChallenger Twenty years I Want to ask about the get go to Charlie raise a first year because Walker and Trump were rivals in twenty sixteen so how are those two guys are they friends now\nIt seems pretty friendly now in the race\nIt was pretty contentious and I remember there is a rally here that Donald Trump held in Janesville ahead of that election and he he kind of took some swipes at ... and any us it took some swipes\nAt Scott Walker since then it's been pretty friendly with when got locker got out of their race he said he was getting out that somebody could move forward and gain more popularity to try and\nOvertake Trump but those feelings seem to have dissipated and don't cure Governor Walker\nSeeking ill about the president he will face some things he disagreed with it but for the most part it's very friendly\nSo let's talk about the race between Scott Walker and Tony ... uh it looks like it is pretty close what are your what are your most recent polls saying about those\nThe polls are saying that this race is pretty much a toss up there are polls that show Tony ... way ahead there is a marathon poll a few weeks ago that showed him I had I\nQuite a bit but most of the polls I've seen have shown the race to be a little bit more tight than that but with ... getting a little bit of an edge\n[noise] a seemingly there's a new campaign ad which says that Uber's wants quote special treatment for illegals in Wisconsin and the ... campaigns calling that racist and this sounds like this is a pretty contentious race between these two candidates\n[noise] it's getting that way that that ad was produced after their first\nProgramming and supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward when it's time to talk forums on race YWCA NPR less dot org\nThat and and using the term illegals really spark a lot of criticism from the Latino community\nWhat are the other issues driving discriminatory all race\nI think health care is it is a big big issue\nEspecially right now there there's a lot of back and forth between the two campaigns and there's been a lot of ads produced\nAbout whether or not pre existing conditions will be protected in the future if the a lawsuit you overturn the Affordable CARE Act is successful and Tony Evers has\nStaked a lot of his campaign on that issue you're saying that the current Governor Walker authorized Wisconsin's joined a lawsuit to overturn that law he is not\nIntending to protect cruises and conditions\nWhile Governor Walker says even though he does want that law overturned he would seat state legislation that would continue a coverage of pre existing conditions\nLet's turn to the Senate race between income a Democrat Tammy Baldwin and her Republican challenger Leah Vukmir how close is that race\nThat race is not close most of the plane that I've seen has shown Tammy Baldwin ahead is our recent poll that showed her up by double digits over her opponent leaves and clear I haven't seen a poll where they've been very close\nWe're also going on in these races that might be just bubbling underneath the surface that you're watching\nWe're watching what's going to be happening in the Milwaukee suburb they're very conservative counties but we are seeing the movement in some of them among female voters and voters I identify as independents and in the polling that we've seen Governor Walker is not doing as well\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nTheir hometown hero series November fifteenth the ticket offered presented by security in financial included a ticket to the game and a limited edition T shirt wild dot com slash hero and by the way up president former President Obama will be in Milwaukee on friday to rally democratic supporters\nAnd other political news with us in two weeks to go before election day two candidates for Hennepin County attorney squared off last night during a forum held in Minneapolis incumbent might Freeman and his challenger mark ... discussed what they would do to address racial disparities in the criminal justice system\n... Williams moderated that debate and he has this report\nMight Freeman served as Hennepin County attorney for nearly Twenty years he began the forum by telling the enthusiastic crowd at the north high school auditorium but some of the changes he's brought about during his time in office\nTwo years ago I usually rent in our struggle to make it more and more reviews on drug charges were dropped from parents low level\nFreeman also promised to make other reforms to address the disproportionately high numbers of people of color in the criminal justice system and more specifically in the Hennepin County jail whoever challenger mark ... said the inequities in the system continued under free minutes watch and he said if people want that to continue they should vote for the incumbent\nWhen my point is talk of all of his former now I Hope you're really question that based on his his record 'em I like to hope that he if he wins is going to make these reforms he's talking about um I don't have a lot of confidence and not based on his right\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nTrying to get their lives together after a criminal record you said too many people get locked up pre trial because they can't afford bail and how'd you said he supports getting rid of the cash bail system\nFreeman said bales should be reserved only for people who pose a public safety risk or who are not likely to show up for court you said changes are already underway with programs like the city of Minneapolis is signing release program that program allows people facing nonviolent misdemeanor offenses to avoid jail for missing a court date\nSo I think you've made some progress on the ... issue and I'm In favor of moving forward on that before I got all\nFail reform was not the only topic to raise passions from the crowd as Freeman made his closing statement he was briefly interrupted\nI Want another four years is kind of your journey because I Believe I've done a good job in the previous terms and I want to do that kind of\nAdditional criminal justice reforms that I've talked about the name yelled by the man in the audience was\nGerm are clerk clerk in African American man was shot and killed by a white Minneapolis police officer in twenty Fifteen sparking weeks of protests in Freeman's decision to not filed charges against the officer is still a sore spot for some of the community\nHousing encourage people who don't think the justice system works for everyone equally devote for new leadership and the county attorney's office\nIf we can have a justice system that is Julius ... just that's actually affected like she's a safe because it's just sort of ...\nTokyo had received information from ... about the journalist forty four year old to ... to you and you can you do you go to conjure informed us that Yahoo dot has been released and is it an immigration center a turkey suit got told reporters\nYesterday I went to Syria three years ago to report on the fate of his colleague Ken gee go\nGo was taken hostage in Syria in twenty Fifteen and beheaded by the Islamic State's group\nIn al Qaida affiliated group known then as the new front reportedly took us who the hostage it's not clear how he was freed in twenty sixteen and video came out purporting to show yesterday he told his family he loved them any hinted at the nature of his ordeal in\nWhere you are a solid and we and\nWhen you're sitting in a dorm room suffering pain he said oh there's no one to answer a no win respond more you are invisible you do not exist no one cares about ...\n... began reporting in the middle east in the early to thousands he was taken hostage in Iraq and two thousand and four and later fried at the time some Japanese voice to anger a freelance journalist who got themselves in trouble and then had to be bailed out by their government\n[noise] yes it as family meanwhile has been eagerly awaiting news his mother told state broadcaster and ha that has she prayed for her son's release she folded little paper origami cranes at least one a day more than ten thousand you know\nAnthony Kuhn NPR News Beijing\nAnd\nAfter historic flooding in Austin, Texas that cities one million residents have been told to boil\nProgramming is supported by why WC a Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nSo on Monday the city told people to conserve water and as a precaution to boil what they're going to use for drinking in food ... you can probably guess what happened next and I'm calling as a\nSelf financed yesterday Maggie Chapman was one of a bunch of shoppers at a supermarket wheeling out bottles of water supply had improving the day before when shells were bear after stores started to limit how many\nBottles people could buy it's just inconvenient at this point but I technically about you know just ... that we use water I hadn't even thought about\nWhat kinds of things some restaurants are close to cafes aren't serving so you meet a lot of people desperate for coffee and on a more serious note the city of San Antonio central water tank or to help keep the local jail supplied with drinking water and the city of Austin worried about maintaining water pressure and its system\nWe've been providing water for a hundred years this has never happened to us this is blowing our mind to\nGreg ... is the director of the city's water utility he says after all that silk slowed water treatment the city's system of pipes and reservoirs started to lose pressure\nIf it loses too much pressure that said he won't be able to spray water from hoses to fight fires and water pipes risks getting contaminated as micro organism sneak into holes and openings they wouldn't normally access\nThe good news is there a says is that water conservation is working people in Austin or using less more water is going into the system and water pressure has improved\nThe one thing we can control is how much water we use we can't control the weather but we can control that aspect of it\nSays if conservation continues and the weather cooperates things could still\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org\nTo learn more families and pursue their retirement dreams ... promises kept on line at all the ... life dot com\nLook for cats coming up here on MORNING edition and then of course we have more news for you or including a look at the Paris bike share programs pretty popular although it's going away will tell you why it's eight forty four [noise]\nAnd I knew and care each week we recommend great new movies to see in the theater and those did you get\nThe also the movie screen at home it's home to talk yeah why so we wanted the vices usual\nHere's your NPR Twin Cities forecast partly cloudy day today with the hype fifty two degrees or the southeast breeds a five to ten the overnight lows you about forty two the chance of drizzle after midnight and then the rain moves into Morrow rain is likely with a high at fifty two\nFifty percent chance for rain tomorrow night in a fifty fifty chance of rain friday still a chance for rain on Saturday with rain likely Saturday Night into Sunday and that's your NPR weather forecast [noise] get\nEvery day with NPR News daily email\nNPR News dot org slash\n\nOn the next to NPR News presents the congressional candidates in the second and third fifth district's Jason Lewis and enjoy Greg's debated on ... Twin Cities PBS and NPR's John Chrin hosted Jenna Brazil in skiing alone will markets today at noon and nine\nIt's MORNING edition\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nWhen it changed operators and almost collapsed the parents mayors given the new relieve operators until this fall to get their act together well it's fall NPR's Eleanor Beardsley reports [noise]\n... he is trying to unlock one of the colorful new valium dong the businessman says he's been riding the bike to work every day for the last several years and can't imagine going back to driving a car or taking the metro but\nHe says despite the leaves recent troubles the system has improved a lot in the last two months\nOf ... for August Vacation there were no fights here and you had to walk to a lot of stations to find one at least now their bikes\nFor tens of thousands of Persians they leave is a vital mode of transportation and air traffic choked city so when a new transport consortium won the veil a contract with a plan for electric bicycles people were enthusiastic\nWere very excited with the new ... there were a lot of promises are new barge was hard to ... new features\nThat ... way of Paris in the saddle a cyclist advocacy group lab ... says the new companies ... was a big disappointment\nWas also for biking um do those two for ...\nWere broken or unavailable the ducks that held them we're out of water daily Bailey bused plummeted from one hundred thousand trip today to a couple thousand parrots mayor and eat out though said she was giving ... just a couple of months to get things on track\nThe company hired crisis manager out no matter you know who became ... new CEO now young says the\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more ad YWCA M. P. L. S. dot org\nFor about three things continue downhill over the summer now they all sat on top of it technical problems the company's struggled with like damaging theft and it tore it in the city of light\nUnfortunately because I'm French and on the origin the sees a a tone of uh in CBD cheap and it's a beauty of schools and so we had the at the beginning of this century thousands bikes which was stolen all destroyed\n... says the new they leave now fit snugly unlock properly and they're charging docks trips have now written back up to nearly forty thousand a day and he says the new they leave them like the old ones are available in the Paris suburb\nYou have to think about these people who have to move from the set up to par reason they want to use a clean bike or treat by Joe and and we have ducks in stations roughly ... ... I read\nBack at the veil aid station Philly bully is still trying to unlock a bicycle\nTo you know to start early\nFinally one becomes available in this one told me no a minute ago he says it shows you should never give up and say then they leave\nLab he rides away Eleanor Beardsley NPR News Paris\nSupport for news comes from farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs\nCoverage options and more information can be found at farmers dot com and Trader Joe's offering new products in every store and new episodes\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more [noise]\nPayne I Am leaving shy\nFive to ten miles an hour tomorrow cloudy with a chance for rain in the morning Rene becomes more likely by afternoon back into the low fifties for a high on Thursday and then tomorrow night it continued\nGood chance for rain and Fridays still some showers\nExpected around the metro area with a high in the low fifties once again [noise]\nHow to mind is NPR's in to inform and mobilize new conversations about mental health [noise] now we can talk about it you realize it's not our fault [noise]\nNine more coal mine now not more\nTrade is to just\nMore head on all things considered\nI'm Tom Green Minnesota Public radio news with Elsa Chang in DC and after the news Hillary Clinton and former President Obama were among the targets the latest in five minutes we'll also hear from a former Secret Service agent about how they scan packages center former presidents for the rest of their lives [noise]\nPlus rural Minnesotans are struggling with their phone service and even some company employees agree it's a problem\nFirst avenue is expanding its footprint in St Paul what's next for the famous music venue those stories old ahead on this Wednesday but first\nProgramming and supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA N. P. L. S. dot org to learn more\nNPR's Scott Horsley reports at least five suspicious packages have been located dress the former President Obama's CNN's headquarters in New York and others\nPresident Trump was briefed on this suspicious packages by the FBI the homeland security department and the secret service among others he says the packages are being inspected by top explosives experts and he promised to spare no expense and bring whoever's responsible to justice\nIn these times we have to unify we have to come together and send one very clear strong unmistakable message that acts or threats of political violence of any kind of no place in the United states of America\nTrump spoke at a White House event to address the opioid epidemic where he said the safety of the American people remains is highest priority Scott Horsley NPR News the White House\nSaudi Arabia is powerful crown prince Mohammed bin ... today vowed to kill as a journalist ... will be brought to justice rocks coming at a Saudi investment conference sometimes referred to as ... in the desert been saw him on speaking through an interpreter also condemned the journalists killing\nThey a crime was really painful to all the Saudis ah\nAnd I believe it is a painful to every human in the world it is a heinous crime that cannot be justified\nSaudi Arabia is continued to blame the killings took place inside the Saudi constantly in Turkey on rope operatives acclaimed turkey has dismissed\nThe Federal Reserve is expected to announce this week it's considering a proposal that will ease rules Rob with the nation's biggest banks proposed which has yet to be officially unveiled expected to implement several major provisions contained it a banking bill Congress passed in may\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA and he L. S. dot org\nRoyal us stock markets today swing up and down several times before closing down between two and four percent and it's the latest in a stretch of losses for the market as investors react to uncertainty about global economic growth and didn't forecast from corporate earnings\nThis was particularly true for the tech sector which is heavily represented and then as that composite Texas Instruments and Eighteen keep both issued weaker than expected sales driving down semi conductor stocks ... NPR News Washington\nBreaking down the numbers the Dow Jones industrial average was down six hundred and eight points today that was a drop of two point four percent that as well three hundred and twenty nine points losing four point four percent of its value standard and Poor's five hundred closed down eighty four points today you're listening to NPR\nSupport for news comes from the little markets offering artisan made goods and home decor with a commitment to fair trade a nonprofit sounded like went into empower female artisans in marginalized communities around the world more at the little market dot com\nFrom Minnesota Public radio news unproven Nelly ... gubernatorial candidate Tim Walz created confusion today about where he stands on raising the state's minimum wage to Fifteen dollars an hour at a morning news conference walls refused to say what the minimum wage should be\nBut later in the day he took to Twitter to reaffirm his support that amount well said during the news conference at setting a specific figure would short circuit efforts to get something passed given the differences between supporters and business owners who would have to boost paycheck I think it's\nA irresponsible at this point in time not to bring them together and have that conversation of where we land\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nMinimum wages now nine sixty five an hour for large employers but it's due to rise to nine eighty six an hour in January first because it's indexed to inflation\nAuthorities are offered the twenty five thousand dollar reward for information leading to the location of a Wisconsin girl missing since her parents were fatally shot in the family's home Thirteen year old Jamie clause has been missing since October Fifteen\nDevotees that morning discovered someone had kicked in the door of her family's home near barren and killed their parents Jamie was nowhere to be followed that investigators believe she was abducted at a news conference today Jamie's on Jennifer Smith spoke she told Jamie her family nice or to fill that hole in their hearts and we'll never stop looking for her\nThe FBI is investigating the deaths of two men other red lake Indian reservation in northern Minnesota and the FBI spokesman declined to provide any other details about the deaths of twenty six year old Dustin beret and thirty two year old James Rojas the third the men were from the red lake area authorities say they\nDied on Sunday we'll see how these guys and the twin cities fifty four degrees this is Minnesota Public radio news it's five or six [noise]\nAll things considered is supported by the University of Minnesota where researchers are using three D printed Oregon models to\nBetter prepare physicians for surgery learn more ... un dot edu\nNPR News this is all things considered I Know that Chang All right we're learning more this hour from the FBI about a number of suspicious packages that were addressed a democratic political figures this week authorities say five devices were sent in identical bubble line manila envelopes each of them with the return\nProgramming is supported by why WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nExplosive devices but they're also report more\nThat's right so the FBI says that these envelopes were addressed to George Soros he's a billionaire a big contributor to democratic causes a Hillary Clinton Brock Obama Obama's former attorney general Eric Holder and his former CIA director John Brennan\nThe package that was intended for Brennan was sent to CNN's New York office right on not clear why that was but\nYes there were other people who said they received ... suspicious packages today one of them was in New York governor Andrew Cuomo who is a Democrat his office later said however a package of didn't contain any sort of suspicious explosives another was California congresswoman Maxine Waters\nUS Capitol police said they intercepted a suspicious package that was addressed to her they say it was removed and is being investigated by the FBI right now we don't know whether the FBI didn't mention her because her package\nA doesn't belong with the others or perhaps it would just was received too late I'm not clear at this point but the FBI did say in a statement on Wednesday that ah it's possible that there are more suspicious packages out there or that it doesn't know about at this point\nSo what do we know about the five packages that the FBI discussed in its announcement early\nWell law enforcement official described him as pipe bombs earlier today in the case of the one cent to CNN or the package also is said to have contained to white powder now the FBI itself says that all of the explosive devices were mailed and he's identical bubble wrap envelopes\nThe address is on the packages were computer printed the return address on all of them was as you mentioned for Wasserman Schultz although her last name was ... was misspelled\nEach package had six U.S Postal service stamps although in the one photo of a packed\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nCourses Wasserman Schultz now she says today that she didn't send these uh she says she's deeply disturbed by these packages are disturbed that it showed up in that her name has been used in in all of this\nI mean I say we have a number of targets you say there could be more out there where does this investigation go next\nWell the FBI says that these items that had been collected there on the way to a ... a FBI crime lab in Quantico, Virginia will be examined there there are a lot of federal agencies are as well as local law enforcement that are involved in this investigation on the federal side you have the secret service of course uh the bureau of Alcohol Tobacco firearms and explosives\nIt could be costly you'll hear about that on marketplace and the day on the market then a journey of several thousand people toward the U.S border is creating a political firestorm less than two weeks before election day the daily from the New York times looks into that with a reporter\nWho is in mix Mexico on the ground and that's at six thirty so stay with us for all of that\nSupport for news comes from logged me in makers of go to a meeting a collaboration meeting platform allowing people to connect around the globe to get work done\nLearn more I'd go to a meeting dot com and Amazon Prime video with the ... a new series from the creator of Mad Men starring Diane Lane Noah widely Christina Hendricks and Andrew rentals\nA new episode every Friday on prime video\nIt's five twenty good afternoon frontier communications says\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more employees agreed with the assessment bill\nRosa has worked for two decades for frontier most recently in the company's Fairmont office of southern Minnesota He says it's a good company but it's slipped in recent years\nYou know the more it can be done and that side of the end\nHe hears about it first hand from customers like from the residents of the small town of Ceylon about three years ago some underground frontier communication cables there went bad roast I came up with an emergency solution to keep customers connected\nStanding on a street corner in Ceylon he points to where he hooked up the new lines in a make do solution he left the new cables exposed laying on the ground to cross the street he ran the new line through trees on either side it was meant to be a temporary fix a few months at most\nIt wasn't very I did it but we got him going there and they got service and at that point in heroin engineering to get married\nBut that's where things came to a halt nothing happened management failed to follow through on roses quick fix in the temporary lines were left on buried exposed on the ground and strong through the trees for several years\nFrontier finally completed the project input in below ground lines this month that happened after Ceylon city council member complained to state officials about the lack of a permanent fix Rosa says in the last few years the company just isn't keeping up with its work\nThis isn't the frontier that I was hired on that problem is there's there's enough people at the end of the day to get the died\nReports filed with the U.S securities and Exchange Commission support roses contention at a time when the company is expanding frontiers us workforces contracting down nearly thirty percent\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA N. P. L. S. dot org to learn more nation showed up\nI don't know what the problem is if they do not feel things right away I think they shouldn't be a lot more of their customers when we got it fit with all the phone it's ridiculous\nThe steep public utilities commission is investigating frontier service in Minnesota more than six hundred people have filed complaints in administrative law judge is also scheduled to file an opinion soon on the company's performance\nUniversity of Minnesota law and business professor Paul ... says the frontiers problem started when it began buying land mines and other assets from competing telecommunications companies in recent years\nHe says that's left frontier in poor financial shape\nFrontier communications got there I think by using the corporate strategy of acquisition without a thoughtful business strategy on how to integrate and enhanced the value of the assets that they bought\nAmong the buys was frontiers to thousands sixteen purchase of horizons landlines and other properties and California Florida and Texas for about ten and a half billion dollars paying for that deal and others left the company unable to invest sufficiently in customer service and equipment\nOr losing customers faster than they can get in a choir new ones and we're looking at the quality of service decrease that had an impact on their bottom line\nLast more than a billion and a half dollars in the last three years and its stock price collapsed down Ninety five percent in a statement frontiers that much of the financial loss was caused by the expense of integrating his recent acquisitions into the business\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more role\nThere may be a brighter future ahead for frontier but right now the company has multiple problems to fix and that's left customers searching for answers mark style Minnesota Public radio news Ceylon\nNews now about an iconic St Paul landmark first avenue is expanding its foot printed in the twin cities once again the music venue company announced this coming to an agreement\nWith Minnesota Public radio to buy the Fitzgerald Theater in downtown St Paul Peirce Cox has been following the story he joins me now with the latest on the deal Hi Peter at times so at this point what do we know about the deal\nWell we know that first avenue and NPR have an agreement that first avenue will buy stuff is Gerald theater and that still needs to be finalized neither side would disclose the terms of the deal and the stale sale is still pending and will be for about Ninety two hundred and twenty days\nIt factor due diligence all turned out to be fined first avenue will take the place over\nNow I should say we found out about this development through a press release from first avenue is shooting coordination with NPR at NPR News we are reporting the story independent of the rest of the organization\nAlright that's said what our first avenue and NPR's saying about the agreement\nSo I spoke with NPR's cheap chief operating officer they can't just this afternoon who says they'd been thinking of selling the theater for a few years\nHe said they were in ... they were in touch with first have for the last several months but the sale also comes at a time of transition a prairie home companion use the theater as a home base for years\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nThe decision but certainly a that signature programs using the venue last for using the venue for other things\nCame just to say NPR would like to use the Fitzgerald for events in the future what do we know about first avenues plans so I spoke with Nathan friends the general manager of first avenue and he said they see it as a multi purpose venue\nYou will host concerts and unlike many first avenue owned or operated clubs it is seats throughout no dance for\nThe Fitch holds a little more than a thousand people friends said to gives the company another option for artist who might play to different crowds\nYou expect more live music shows at the fits than there had been there in the past but he also says the company plans to use the historic venue for other events like comedy shows live podcast tapings and possibly even films\nFirst avenue started off as a music venue itself in comic a presence in downtown Minneapolis made nationally famous by prince's movie purple rain so where is the company headed now\nThey've definitely expanded over the last few years that started in twenty Thirteen when first avenue bought the turf club it's a smaller music venue in St Paul\nAnd since then they've taken on promotions cooperation agreements and ownership at several clubs in theaters a\nFirst avenue ... manages the palace theatre with the city of St Paul and just last month they announced they're buying the fine line in Minneapolis Nathan Franz says they put more shows at the palace than they initially expected and found the city\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\nProduce it's allowed us to also increase our staff and train new people and so we feel pretty good about it\nThat's Nathan friends of first avenue Peter ... reporting on me plans of first avenue to buy the Fitzgerald Theater in downtown St Paul for us thanks Peter You're welcome to\nStart your day was Minnesota new every morning tapping was hosting it at the top stories from our region for you a little whether in sports as a podcast called the NPR News update\nYou can find it on NPR One or wherever you get your podcasts\nThe twin cities forecast calling for mostly cloudy skies not as silly as last night a low right around forty two degrees southerly wins\nFive to ten miles an hour tomorrow cloudy with the chance for rain in the morning Rene becomes more likely by afternoon back into the low fifties for a high on Thursday and then tomorrow night a continued\nThat's a pretty strong condemnation for a country that has historically been and will remain I think an important security partner of ours\nBut should President Trump had been so reticent to criticize Saudi Arabia at the beginning\nI think reticence when you're dealing with national security partners is probably a positive impulse but right now\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA and he'll S. dot org\nSaudi Arabia specifically Jared Kushner the president's son in law has cultivated a very close relationship with the crown prince Mohammed bin some on does that concern you\nYou know we have had strong relationships with Saudi government's for generations and uh that's uh something that has continued with this administration recognizing that the Saudis have been in can continue to be very important security partners are they provide as valuable intelligence\nBut I have to admit that relationship or gets undermined is the Saudis are Deceive Us and as they engage in a violation of our fundamental values as strongly appear to have done in this instance in the ...\nRepublican senator tot young of Indiana thank you very much for joining us things so much else [noise]\n\nIt was another tough day for the stock market all the major indexes were down but the NASDAQ had an especially bad day it declined four point four percent the biggest single they last for the tech heavy index in seven years\nNPR's Yuki Noguchi reports much of a day's sell off happen in the last hour of trading\nInvestors are worried that a global economic slowdown could have a deep impact on growth in many sectors and all over the world it is also the heart of corporate earnings season and less optimistic growth forecast from several major firms and under scored some of those economic concerns for investors\nOne indication of this growing pessimism is evident in the ...\nProgramming is supported by why WC in Minneapolis bringing the community together to move forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nSector especially larger name pretty much gone straight\nHe says when companies announce disappointing earnings investors are down to punish the stocks today in particular weaker than expected sales from Texas Instruments ripple across the entire semi conductor sector Eighteen tease weaker profits also helped drive tech down overall\nA similar sell off occurred earlier this week after three yeah and and caterpillar release their results but my says he does not see evidence in recent corporate or economic news I get him cause for major concern he says the fundamentals of the global economy and the tech firms that got hit hard in recent days are still healthy\nArgue not ... you're a global recession or anything like art early sentiment triggered\nMeyer says he thinks what's driving markets these days is the sometimes contagious emotional sense that stock prices have simply reached their peak\nVolatility is going to be the name of the games are stumped our dog is just shake that investor confidence to be restored\nThe Dow Jones industrial average an F and P five hundred have now lost all of their games for the year ... NPR News Washington [noise]\n\n\n\nListening to all things considered from NPR News when you\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA ... started word\nIt's impossible to miss this which has how in the village of ... for starters there's a big poster up her right outside it reads the most powerful which from Europe Mick Hi Kayla main cut [noise]\nTo walk through a meta curtains and introduces herself\nYou'll proving being on a very strong which magic is very powerful and my family I can solve any kind of problem in life was loves success anything\nShe's in a floor linked dress black with bright flowers her hair also black is tied by a sparkly baby blue scarf my Ga is still with dying to you\nWhat I Do is beautiful and dangerous it is a fight between good and evil [noise]\nShe cuts tomatoes and cheese for what she calls an interview snack we sit in the dining room on gold painted chairs that resembles Thrones her phone buzzes with clients that it she is\nTheir customers who asked me to split up couples they asked me to destroy people and there are several spells I can do with black magic what I learned from my grandmother that too many evil spells we'll always turn against the powerful which\nAnd summer ... I Do believe in the power of which is a sociologist Danny Sandy psychic twenty fourteen survey about\nTwo thirds of Romanians believe in demons curses in China men's and there\nSays these beliefs come from the Eastern European tendency towards ... this is where it which is find their niche problem\nProgramming is supported by why WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nAnd Seventy years ago Romania which has made international headlines for cursing politicians who tried to tax\nThem says ... ... ...\nThat's me ... own mother in law in video making up post should not have cat poop after that the politicians drop the tax surprisingly make a wish they hadn't fought it they will do for the children\nBeing tackled prove that this is a respectable profession is in my daughter's finished high school I Love it if they could open there which is offices in Eucharist\nLike most which is here meantime is Roma a stigmatized minority in gear up most of her clients are not are working magic supports her husband and kids it's allowed them to build a house in Romania and live for a time in Los Angeles where she says she has many clients\nWe walk to her backyard office for chicken ... pass a table filled with crystals sides and dried herbs she raises a bell pours water into a bowl\nAnd chance that look a little who said there'd be ... ... there'll be peace that there'd be happiness\n[noise] God blessed to be so [noise] I'm relieved\nShe doesn't charge for this good luck to spell because her spells are not cheap I ask her how much would it cost to put a curse on my editor six hundred dollars us she said and the\nWhich means ... is careful to say that she gives no guarantees Fred NPR News I'm Joanna Kakissis in ... Romania\nIt's five forty eight now were correct\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot\nOrg to learn more non profit dental clinic expanded dental work force and school based programs to improve our own health delta dental and then ... slash NPR\nOh things considered is supported by University of Minnesota how committed to providing seem to be nothing exceptional camp to knew him and he's and comfort and then the daily nationally recognized new natal\nCare more at ... dot org slash moms\nAll right we are getting late in the month meteorologist Paul hundred joins me and our temperatures around the state today how were they\nYeah they're pretty close to the average for this time of year time were mostly in the fifties we've had some forties up along the north shore I saw sixty two in Tracy in southwest Minnesota can be\nUh but uh mostly in the fifties and it's been a great run of sunshine and dry days that comes to an end now with the high clouds moving in already today and then the rain tomorrow into friday mostly light showers or southern Minnesota maybe a quarter of an edge central in northern Minnesota half an inch to an inch\nAnd then Saturday looks like the drier day of the weekend more showers follow on it looks like for Sunday Times\nWere showers Sunday what about temperatures are for the weekend an engine next week staying average mild\nLooks like we will through the weekend and into the early part of the next week Tom but I've just been looking at the weather models again and it's still looks wet and cool for Halloween and there is a one or two models that are saying this might transition into some snow after Halloween next week we're going to have to keep an eye on this", "show_name": "no_show", "year": "2018", "city": "Rochester", "day": "24"}