{"month": "10", "state": "AL", "station": "WERC", "content": "On Facebook the girls are constantly posting pictures of you know we'll talk about a job or whatever that we're working on her stuff like that they usually within a few weeks I got it on our website and they you know you are on our Facebook page you take a look at all the cool stuff or did it\nBecause there's a lot of start to finish pictures or whatever on there yeah and uh [noise] that's it yeah\nI had the opportunity to St ... this past week um other than the garden center all last week and I was out spraying your just three emergent\nPlanet for emerging everybody's yours this weekend in in between doing some service calls his lawn care bids are starting to come back up with with being fall and I was doing a lotta won't care business will have males weren't run wide open\nAll week long you know I had a little bit of a back ache the other day Chris and I couldn't figure out what I was that well I may not like frequently but that don't usually do for him it out I was at work one of the days and I was I may you know I I we just it really started laying off a mammal backers can't figure out what's going on and I've\nI've got to thinking about like you've you've\nBusted lack to racks would not cause I'm taking some woods and you know camp and obviously a sub us that it you know and I don't I don't have a\nLike I Would split or I have a mall so that is the ... yeah I Am the would split or so as like okay then yeah does that for my bags\nAre either I I don't have a wood burning fireplace my new house and how short on this for offshore don't miss splitting far well yeah you have a reason above lead but man that you know there ain't nothing like a far you know like an hour ... wood burning fire S.\nS. words that I got gas logs you know like propane logs\nYou still got the you know [laughter]\nYou know I had my my grand dad had a monster pecan tree in his yard and it had base is like a truck that was you know I mean you could put our arms around it you know it together and then branched off into three main sections and storm came through knocked off one section\nAnd then you have a couple of weeks later another storm is you know it's been a couple of months ago when we were getting those heavy you know quick down you know micro burst the arms and then the storm knocked the other section down in another section was leaning towards is chicken coop and ... it's split right in the crush of all three\nAnd so one of the neighbor said hey I'm just going to bring some guys down here we're going to hook tractor up to real cut the whole thing now and um\nI didn't have a need for the fire would but I wanted a bunch of it the smoke with and so my\nSister in law they've got a wood burning fireplace I'm telling you I took a dump truck and I loaded the thing up to the brim twice with pecan and I don't ... their dumped it at their house and then I got a whole nother truckload of my house of you know small all those ah you know that I cut about eight inches tall and you know split up to smoke would\nWith ... I shouldn't have Bob ... I shouldn't have to buy charcoal for about two years left out the guy would split or ... well my grandad does and it's basically on yeah 'cause they I'm\nThat right there you ain't busted when some strong stuff right there and twist it and he had a ... ... yeah we got logs clear to handle that\n[laughter] yeah back in the days I mean\nIt's been forever ago but there was a house rabbit downtown sprinkle his bat a\nNearly across in the park yeah you know the big park in downtown right there\nAnd it was one of them all historical houses are out there in the law and they had a big open country out there and it got struck by lightning or something and busted half of it off and stuff and\nWe went in there and cut the rest of it and daddy was just hail man I Am you know I'm ... I won't that firewood down there I Want to I said well we're going to get it or whatever we went down there and cut all that stuff up as in people's yards\nAnd he gassed his stuff the house and then I was the would split or to you know what I'm saying so are\nWe out I was like a bit of what her for quite some time that I was a split it for a while I'm where I'm where I'm right with you I Do\nHave a he's got to split or he's gotta would split are now he didn't have was split or at the time way yeah he did he may have one is a new born\n[laughter] but\nAnyway I beat not buying than I Am talking about ... wages and\nEverything with that stuff and finally we wound up cutting it in short legs lucky for your for your Maria just where you could do so in some way to do it\nFor about a time we do need to talk about the garden center it's a Monday through friday eight to five y'all come see us get your ... or am I going to have pain these in next week more than likely it's going to start cooling down so she had any ... because it's been\nAnd stuff that go on it's been like July and not that I Know she said that she was going to have to truckloads of ah shrubs yes\nYeah you know so we're probably going to be restock I'm I'm a big player go boy I mean you know a lot of probably ... I don't know what all she got coming on there ain't no till we got we got a really great selection of\nOf shrubs to come in and you talked about the all of the earlier I mean we got some beautiful the all those you know back here and ... and ... have been going nonstop I don't think they've stopped blooming this year there's a bunch of still got boys oh yeah they're still\nRock and roll and uh uh\nSome dominance greenhouse somebody that bloom till Christmas yeah um well y'all come see us word Eighteen fifty five caution road where you've been for ever [laughter]\nWhere ... four four zero zero five if you are the landscape and our law care irrigation not ... Janine patios retaining walls come see us chicken settle on it's W. W. W. dot classic gardeners dot com or you can like us on Facebook\nYou know Chris I saw that liquid fence right there and I thought about Tom Smith we get to a [noise]\nTom has got some roses and stuff over at his house he's angry is in a gray stone gray stone thank you buddies rather than a cold a second these backed up the woods so he ... he does have deer but he's got mega dear yeah in a\nIn a liquid fans\nHave set up on that this is a classic gorgeous landscape show a hope everybody has a great weekend and get out and enjoy the glue whether when it finally gets here I'm going to reverse oh yeah well yeah [noise]\n\nThey're proceeding has been a ... program the opinion ... those are the hose and do not necessarily represent be abused opinions of WBRC management employees or advertisers\nThe news you want to know what it was fair\nOften use buckle your seatbelt you need to know what's going\nOn this vote the age of fifty one the nose\nForty nine the motion is agreed to\nEncourage anarchy in the free from Congress or you\nCan also be confirmed them all to the Supreme Court\nNews radio one oh five five\nWe are see are there certain areas of your body that you would love to love more\nIf so it's time for you to try ... Hi I'm Jane ... specialist at village dermatology you may be very active in happy with your body but you likely have that one stubborn area that needs extra help that are cool sculpting comes in\nIt's noninvasive requires no surgery no needles and know downtime you can finally freed the way that stubborn and want to sat for good\nIs that village dermatology dot net to request you're free consultation village dermatology helping you with a beautiful life\nGallery smoke is Alabama's premier smoking vapors door with stores in Hoover this outside and Roebuck\nWe have the largest selection of glass tobacco pipes name brand vaporize there's any juices now gallery smoke offers glass blowing classes learn to blow glass pipe last Christmas ornaments and more and our glass bloom\nStudio and October glassblowing classes or fifty percent I find it on Facebook or email glass lower ed galleries not dot com or details glass blower galleries not dot com stay glassy all messaging\nData ... burning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nBut what if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders and what if you could earn that degree in his little sixteen months one hundred percent on line\nTo find out more text trend to seven nine six four or five [noise]\nThat's T. R. E. N. D.\nTo seven nine six four or five star to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today learn more about the W. P. carry business graduate programs online checks trend to seven nine six four or five\nAll right we want to thank all of you who voted in our current traveled polled new traveled pose local up after the show later today are an world travel dot com\nUm but before we get any incentive for anything further in today's broadcast I Robert why don't you share the results at the polls that are up at right now\nI'd be happy to America All right so the first question is actually coincides with fall and frankly radio I bet you're enjoying some nice for which there endorse it as we speak a at the trees turning out there\nJust just starting the sheep are still out those still sort of green here section renting 'cause it's very green it's still emerald green and you know it's beautiful it's been a warm summer for by UK standards\nWell we asked the question that we asked is what region of the U.S is best for fall foliage traveled and the results are the northeast sixty one percent middle mid Atlantic area fourteen percent Rocky Mountain states Thirteen percent upper Midwest nine percent in the northwest three percent that's what everybody said\nSucking traveled poll question that we ask 'em how far in advance do you plan your Thanksgiving travel which incidentally folks are six and a half weeks away\nA and the results are spontaneously forty two percent luck a love spontaneous like\nA one week prior twenty five percent which by the way it married Rudy ... why we always get email questions about what is the best time to buy airline tickets because everyone either spontaneous frail anyway multiple months in advance Eighteen percent\nTwo weeks prior sixteen percent one month ... nobody at least as far as those devoted a so maybe we\nCan easily planning Thanksgiving travel maybe that's red trip\nTraveled if you put the two together is like sixty seven percent of the week or so at some point oh my gosh\nWe warned them I Know in travel when would you are traveling by whatever you know in spring I don't know where you're going to be\nLearned Rudy we've been doing this show since two thousand and a war in some combination and nobody listens to ... I thought that was that's a high percentage of that so it's very sad to you know our\nUm well actually have to show our team will put up the new travel polls you'll find them an RN world travel dot com so check them out we hope you will cast your vote and before we finish a with some travel news marry one that we do the ...\nSounds good when they returned from the break in a few minutes we'll be joined by Caroline Pearson or the EL maiden voyage dot com for today's cheap travel leader episode as we focus on solo and female business travel\nAndrew ... offers some insights on the folks who writes fake reviews for pay on trip advisor dot com if you or someone you know has a fear of a crossing bridges are tunnels Ken good to hear in segment for with some travel advice on that and will catch up with mark ... perhaps\nIt's the most knowledgeable train man in the u._k. to get his advice on the best ways to travel by rail um ... sounds like he had a lot of your show that's only a strong UK presence yeah it's good for your heritage yeah look at that Rudy but even having your news pal\nWell just one you know I I Know you know I send you a Gemini friday night the new started going to do but what I just learned today delta is now has an announcing that they're going to provide why find their planes for free\nAnd that'll be a big change for all that that really hurt one company that charge yeah um and I I'd wager and I bet you'd agree with me that everybody else is going to follow I mean there's going to get ... those United American and\nNever will be a story to wash up so we will see how quickly that free why forever everyone regardless of your seat wow that's fantastic news right now I Know and so the\nSo the new story I had I thought I Begin with was how many times have you ever wanted to ask how many times you boarded a plane looked up at that overhead luggage minute thought hey I can practice my pull ups by grabbing onto that did well one passenger a flying an American airlines flight from Phoenix the Boston thought just that this week\nAnd when he wouldn't follow flight attendants requests you stop doing pull ups using the luggage when things got ugly the flight actually had to be diverted landed in Kansas City where law enforcement agents took him off the plane and I believe alcohol may have been in full you thank you\nHow do we expect quite often I get on the plane now I I'm always running and I like to be athletic when I'm On planes but I mean come on or how many were doing pull ups on planes and when you're asked to stop ... continue to work out\nAnd I I wouldn't have to trust those luggage been spring now like well nice to have you in the house with Mary Robert me today when we return Robert ... to talk with Caroline Pearson or chief travel leader interview she's the u._k. base maiden voyage executive stick around we got a lot of travel come up this hour next [noise]\n\nTo join moody Robert in Mary ... eight hundred three eight seven eight oh two five four follow us on Facebook and Twitter are\nIf you haven't tried out butcher block dot com slash or him do it today as we are all loving the sponsor and what they deliver right to your door older meat is guaranteed to be humanely raised with no antibiotics were hormones ever the beef grass fed the chicken is free range organic the heritage bread pork is source from pigs raised to keep their flavor and\nPrices are good too as you'll get a month's worth of delicious meat for less than six bucks a meal plus shipping twenty dollars off your first order and to free pound of baking when you sign up today at butcher box dot com slash R. M. R. M. world travel because\nWe've all tried a lot of pillows over the years at home and hotels on planes staying with family friends or wherever if you're looking for an innovative pillow my pillow is that\nYou can adjust my pillows patent it failed to your individual needs to help you get to sleep faster and stay there longer\nMy pillows are made in the usa that fact with a ten year warranty and a sixty day money back guarantee and you can even wash them in dry them right now if you buy one pill you'll get a second for free just go to my pillow dot com and use ... Iran or you can always visit our emerald travel dot com under sponsors\nWhether you're looking to buy do luggage give it as a gift or replace what you're using because you know it's not the best\nGet trouble prone luggage as it for luggage that we use when we'll travel traveled prose the choice of flight crews and in the new frequent travelers\nThey've transformed travel since creating the original role aboard we'll luggage and they stand behind their products with lifetime warranties you'll find trouble pro at Macy's Amazon ... bags and top luggage specialty retailer or check out travel pro dot com per specials at their online store and there's also a link or I'm real trouble dot com under sponsors\nWe've been hearing for many of you in our audience about how much you're enjoying love blue premium ultra pure water just like us\nLittle blue is perfectly natural water that's over to us and coalition anything you're drinking you're thinking water isn't unless it's eleven percent hydrogen eighty nine percent oxygen without additives mineral solving ths et cetera but we most enjoy about drinking with blue is it has a fresh clean taste that your body will crave\nThis is water and the perfect liquid for you ask for retailers nationwide or go to ... blue dot com or are in world trouble dot com under sponsors\n[noise] no matter [noise]\nMilitary matters falling ... in between American and Chinese warships earlier this week in the south China Sea vice president Pence issue Beijing a stern warning\nChina wants to nothing less than to push the United states of America from the western Pacific an attempt to prevent us from coming to the aid of our allies but they will say\nThe vice president spoke at a Washington think tank Thursday last week China canceled a visit by defense secretary Mattis after American long range bombers flew over the east and South China sees the Chinese military called the U. S. B. fifty two flights\nProvocative the U.S Pacific Fleet says the destroyer USS Decatur nearly collided with a Chinese warship near gathering refinish South China sea one is seven manmade islands\nBuilt with military fortifications in recent days China can't sort of port call for a large us warship to Hong Kong days after yanked its top admiral from Newport Rhode Island had it been meeting with his American counterparts for military matters at the Pentagon look is Thomas in Fox News\nYou know sixty W. E. R. C. [noise]\n\nA question or comment savvy travelling by connect with Robert Mary and Rudy anytime on Facebook or Twitter at R. M. world travel now back to our em world travel\nActually part of a world trouble get together million are happy to have you here for the latest installment of our chief travel with her series we've built into the female business travel market with Caroline Pearson the CEOs maiden voyage\nYou want to show that today's broadcast was made possible by life locked dot com that now includes Norton Security\nWe do and I'm sure you've heard about that fifty million Facebook users who had their accounts hacked\nFifty million dollars getting ridiculous but we also want to let you know about something else to look out for the national cyber security and communications integration center is won enough malicious cyber activity centered on the recent Hurricane Florence that involves fraudulent emails contain links or attachments that steer people to malicious websites\nUse caution with any email with the subject line attachment or hyper link related to the hurricane recovery scammers are also using social media in on suicide attacks because we also be careful not\nTheir stuff folks and never stops because there's so many threats than today's connected world and it just takes one weak link for criminals to get in when you have life luck with Norton you gain peace of mind because of the river is a problem they have agents who uh work to fix it\nJoin now in for the first year get an additional ten percent off the most starting price of just seven Ninety nine a month plus a twenty five dollar Amazon gift card go to life locked dot com used promo code are and you get the offer or find the liquor R. M. world troubled dot com under sponsored\nOkay joining us for today's chief tribal leader interview all the way from Leeds, England is Carolyn Pearce and the c._e._o. of maiden voyage\nCarolyn in her team have created a successful network as professional women business travelers an eighty countries with the belief that travel should be safe liberating addicts citing to maximize our time today will that Carolyn share other details so let's get right to the show hotline and welcome Carolyn\nCarolyn list to connect with us today Thanks for joining marry me for the exclusive chief travel leader interview\nI get that that I knew about that nothing\nLovely to chat with you as well so less and less weekend married I we celebrated our twenty third wedding anniversary and really for the twenty five years or so that I've known marry you know we've traveled extensively probably hundreds of different places you know in different parts of the world\nCome together as one of the polls in Birmingham beat year once you lose that you lose the country use radio ... W. E. R. C. [noise]\nNews I'm Karen would you today's historic vote on Brett Kavanaugh Supreme Court nomination has been overshadowed by acrimonious debates is one GOP senators is\nAn incredibly asteroid day my thoughts on that under normal circumstances will be celebrating how talented or jurors Brett Kavanaugh as well because of the circus the left is made of this we have had all this other debate but Brett Kavanaugh will be an outstanding jurors and he will be approved today\nLouisiana's Bill Cassidy on Fox and friends devoted expected to begin about three thirty President Trump is happy with the way things turned out so as the missus I think\nIt's highly qualified for the court\nOf law did that for\nWhat kind of ... that that's having out of\nThe ... like buying ...\nWrapping up or goodwill tour of Africa in Egypt this is Fox News [noise]\n\nMostly sunny conditions in hot across central Alabama after temperatures reached the low nineties overnight lows lowly ball into the upper sixties with partly cloudy skies more sunshine into for gas for Sunday tomorrow's high eighty nine ended up going to be our seat box eggs\nAre still learn whether center I'm a urologist bread hundred on your side right now it's eighty degrees at news radio nine sixty down when you we are seeing\nHey faucet running no that's a\nThat's a river rational and force reversed provide over one hundred million people with clean water to drink the water coming straight from the forest to us in fact\nI think that's not a vacuum season for cleaning up the air we breathe howdy trees\nThey still got the dirty and ... and ... which means ...\nCool I didn't know that yet\nBut the forest of more than give us clean air and water it gives you a shade for hot days ... care\nTo climb wow that's awesome I didn't know how ... can be hey blurs the Miller\nVisit the forest today and enjoy all it does just for you to learn more about the forest and find one near you go to discover the forest dot org ... by the U.S Forest Service in the ad council news radio ... W E R C [noise]\nEight hundred three eight seven eight oh two by four vision of the show on\n[noise] welcome\nBack to your heart and morals\nTraveled connection going\nBack to the show and bring it back to the sports and in the program sponsored by relief factor dot com just about all of us know someone who struggled with pain that comes from aging exercise and other everyday activities maybe you're struggling with occasional banged yourself back her neck pain shoulder hip her knee pain\nI Know some of those do well is it up as relief factors at one hundred per cent drug free supplement created by doctors for people who are tired of suffering with pain associated with aging exercise and other everyday activities maybe that you\nHave so you should read all the positive testimonials on this product from other members of our audience they ordered the three week quick strike back and they're aches and pains reader lowered or eliminated\nNow is a guaranteed to get rid of all your pain of course not but the majority of people who ordered the three week quick started packed gone to order more because it apparently and definitely helps likely do the same for you to is it worth Nineteen Ninety five or less than a dollar a day to find out\nWe think so I got to really factor dot com take a look at all the testimony is why you're there and let's see if we can get you out of paying two by starting you're Nineteen Ninety five dollar weeks three weeks ago started pack\nVisit really factor dot com or find a link at our world travel dot com under sponsors\nYou know every month more than four hundred and fifty million people click on just some part of trip advisor dot com looking for advice on lodging and restaurant options all around the world\nTrip advisor ideally it's populated by consumers filing honest appraisals but it's well known that some posts are fake planted by someone with a grudge against the business or by someone pumping up their reputation by finding fake words of praise\nNow website conceived in a pizza parlor Eighteen years ago and grown into with seven billion dollar business along with it has gone the responsibility of trying to weed out Sony reviews well not deleting legitimate ones\nMy guess is Andrew Wilson he's a reporter at the London times in London and he recently took a hard look at trip advisor and found a host them interesting not exactly heartening facts Andrew welcome to the show\nI think you\nAre one of the points you made a write off the bat I found interesting was a large companies can now pay trip advisor to dominate search result what is dominating search results mean in the case of trip advisor\n[noise] well if you're a true of whether you that you may not necessarily realize now when you go visit the sides and you are such a test that I shouldn't say\nHotels in New York hotels in London um you might imagine that the the ... hotels that come up with the list that there's much recommended by a fellow trip advisor uses but actually a ... or ... when you tap\nShowed automatically default to theirs and it doesn't that she rank what you see and the older ... it's a particular algorithm to which the have nots you explain how it works but it takes you out of the factors such there's\nAvailability I felt booking part that's I'm a ... customers views but that type ... now and if you want to see the raging custody these ... and you have to go to the top of the most typical as I'm used to be whether this is happening\nI don't think so you also write and this is very damning a quote black male cheating and dirty tricks may not be the first thing that comes to mind when you think of hotels and restaurants but trip advisor has grown so powerful that it's during the hospitality business into a cutthroat world where morals are are often sacrificed in the pursuit of five star rating I think I Know what you're talking about there but you have an example\n[noise] yes well many examples in the process of ... and several restaurant and hotel owners are given exalted in the hotel try those a a site in the restaurant trade in Edinburgh quite a quite a a high standard ... and I started restaurants sort of international ...\nEspecially ... said increasingly over the last year and a real uptick in the number of customers coming in threatening to leave bad result triple as if she doesn't offer them a discount\nI'm also an extra freebies it's a it's a real growing problem and that we set a survey for the ... the association let's shed\nUm eighty percent of people age ... members had an experience ... view of the ... yeah I mean very very large 'em up and said I said it's growing fosters well\nAll right equally bad I was most interested that you set up a service offering I guess a website offering to write phony reviews for anyone seeking such things restaurants hotels are needed reviews placed on other people's sites that are negative or on their sites were positive didn't take long for businesses to come knocking did it\n[noise] no I didn't I mean within twenty four hours of setting up by some keywords on Google such as by fake trip advisor V. several several other similar as the or ... or go to the top of search results so this in the in the u._k. and um\nThe clear peas and the oldest started rolling in and initially\nUm ... I Want to sell to have a a cash small cafe chain in the south 'cause they don't want you to a ... a twenty a post degrees among for one could check the brunt of the chain that been suffering some other views on how to look out and walk seemed like a legitimate review said dude I was sort of a hat\nTrouble food but then they get they\nGo even more sinister to realize that people wanted to ... negative reviews to do down their rivals one shot or ... fifty reviews ... um [noise] one star reviews of the rifle outspoken some people in the ... they say it's all too common\nIs unbelievable you wrote that also that\nUh one owner of a a boutique hotel or excuse me owner I wanted thirty reviews the month for each of us to restaurants and hotels it to his new restaurants well a ... hotel in Wales wanted five reviews focusing on the Venus relaxed atmosphere in ...\nIn the Fifteen seconds we have left clearly people were directing us what you should be pointing up right\nOh absolutely they they you know this was this was part of the market to call it wasn't it wasn't just sort of learn approaches that that was a plan it was clear it was organized and it was it was ... on a grand scale\nYou would have been warned if you use trip advisor dot com casts a fish I and some of these reviews Andrew Elson is a reporter at the London times Andrew congratulations on a series of articles erode and it's lovely having you on the show\nNo phones I drive a male appreciate what we'll be right back with more travel talk after this\nOr immoral travel my eyes are open twenty four seven and eight hundred three eight seven eight oh two five and so it was the website at R. M. world travel dot com stay tuned for back after these messages\nSay when you walk into a store or go on line you'll\nFind all types of bed sheets and bass ... made overseas\nAlong with the materials that red line cut and sheets at bath towels are one hundred percent made in the U.S starting to see in the ground on a family farm the sheets are exceptionally soft breed the cotton sheets stitched with the highest craftsmanship and the seats are so popular that red line continents now making luxurious super soft", "show_name": "At Home with Gary Sullivan", "year": "2018", "city": "Birmingham", "day": "06"}