{"month": "11", "state": "MA", "station": "WBUA", "content": "Ninety two point seven W ... very eighty nine point one W. B. U. H. Brewster and streaming at W. B. U. R. dot org W. B. U. R. Boston's NPR News station\nViolent acts like the serial pipe bombs in the synagogue shooting and you have President Trump's rhetoric hardly linked and if so how do we know\nFrom W. A. M. U. N. NPR in Washington this is one and [noise]\nHey there I'm Joshua Johnson today oh what a range rhetoric and responsibility human face charges for politically motivated violence one from mailing pipe bombs other for killing seniors at a synagogue\nBoth men have a good President Trump's talking points in hateful online posts is the president responsible for inspiring these crimes give not will soon and regardless of who's at fault or how much what are we going to do about it [noise]\nIt's a tough subject and we need more help to get through so email us one a ... am you'd on words or tweet us at one egg [noise]\n\nLive from NPR News in Washington ... Stevens the man accused of killing eleven people at a synagogue in Pittsburgh is now facing forty four federal counts as W E essays only herring reports today's indictment include some new charges\nFederal prosecutors originally detained Robert powers on twenty nine pounds of hate crimes and firearms offenses this grand jury indictment includes additional firearms charges and also accuses him of preventing ten other worshippers from practicing their religion through an attempt to kill them\nThe indictment accuses the alleged gunman of entering Pittsburgh's tree of life synagogue with three handguns in an A R Fifteen rifle\nAnd also says he expressed his desire to quote killed Jews there the alleged shooter is set to appear for a preliminary hearing on Thursday he's being held without bail for NPR News I'm only herring and Pittsburgh\nMeanwhile more funerals were held today for victims of the synagogue attack in Pittsburgh mourners gathered to say goodbye to sixty nine year old urban younger and Seventy five year old Joyce Feinberg a funeral was also held for eighty eight year old Melvin wax who was leading Sabbath for one of the temples three congregations when the attack began\nA federal appeals court says Ohio residents purged from state voter rolls for not participating in elections for six years must be allowed to cast ballots in next week's midterms guarantee ... of Ohio public radio has details\nAnd appeals court in Cincinnati says voters who were removed from the rolls between twenty seven and twenty Fifteen may cast provisional ballots\nAs long as they still live in the county where they were registered and hadn't been disqualified from voting because a felony convictions or other reasons [laughter] these are voters who may have been removed or purged before a lawsuit was filed in twenty sixteen\nChallenging Ohio's voter roll maintenance method which was upheld by the U.S Supreme Court in June Ohio secretary of State John used it says he disagrees with this ruling but won't appeal it because it doesn't affect many voters and because of the short timeline until election day\nFor NPR News I'm Karen ... in Columbus\nPresident Trump says he's confident that Republicans will do well in the mid term elections before heading to a campaign rally in Florida tonight Trump also insisted that citizenship rights for U.S born babies of undocumented residents can be revoked\nI Believe you're going to have a devoted got four bots by reserve is that the first ballot legal scholars daughter jak devoted out I'd rather do it the Dodgers that from\nTrump's as the number of us troops being sent to the southern border will be increased from five thousand to as many as to teen thousand that's in addition to the national guard troops border patrol in immigration enforcement agents already there were the anticipated arrival of asylum seekers from Central America you're listening to NPR News\nThis is nine point nine W. B. U. R. I'm Joe Ziegler Reno in Boston as it is trial draws to a close Harvard is pointing to data showing that it does not discriminate against Asian American applicants\nBut attorneys for the group suing the school said Harvard's experts analysis is inaccurate WBRC max Larkin has more\nEconomist David Card has spent the past two days in a professorial mode detailing his evidence that Harvard is not engaged in a legal discrimination\nFor example he found that Asian Americans do get some advantages and Harvard's admissions process\nStill there have been tense moments in the courtroom after one explanation at a more thorough and attorney for students for fair admissions asked card or you've done Harvard attorney Seth Waxman shot back\nTough questions are one thing snide remarks or another more terrible continue to question carts analysis tomorrow for Ninety nine W. B. U. R. I. max working at the federal courthouse in Boston\nOne current in one form or Springfield police officer has pleaded not guilty to federal charges that they used excessive force while arresting to Latino teenagers\nGreg big ... and Stephen ... appeared in us district court today following their arrest earlier in the day the federal indictment allege is a big debt kicked to one of the boys in the head and spat on him the other officer Steven vague not is also charged with assaulting a second juvenile\nAbout big data has been suspended without pay\nColumbia gas says almost Nineteen percent of residential meters have restored gas service and about Eighteen percent of businesses have natural gas again in the Lawrence area following last month's gas explosions the utility says it has twelve workers in the field as they try to meet their new deadline of full restoration by December sixteenth [noise]\nAlmost two thousand families are still being forced to live in hotels trailers and shelters and elementary school in east Boston is getting one hundred thousand dollars the nonprofit invest ... honor the McKay school with the prize today citing increases in the school's test scores over the last five years\nThis is Ninety point nine WB you are\nAnd that's the biggest thing that we've done\nWhen students feel that\n[noise]\n\n\nThis is one a I'm Joshua Johnson in Washington words are powerful but how much power to the president's words really have\nThe debate continues over what part political rhetoric played in the mass shooting at Pittsburgh's tree of life synagogue ended the mailing pipe bombs to outspoken targets across the country the Donald Trump has never backed away from harsh rhetoric thrown out\nIf you do all defend your guard or\nIn the good old days as soon as it happened because it used to treat them very very rough guards\nAre very juggle with him he's work it out like a big hype was violating laughing like the punch him in the face I\nLove to see one of these NFL Owners when somebody disrespected our flag to say get that son of\nThe field right now\nSome are blaming the president at least in part for creating a climate in which these atrocities could happen others including the White House call that outrageous still others say the president's rhetoric may cross the line but blaming him for someone else's criminal actions is unjustified\nWhose rights\nWe'd love you to weigh in on this especially of President Trump's words have had a tangible impact on your life email is one a at W. A. M. U. dot org comments on our Facebook page or tweet us at one a\nJoining us from Kate AMU public radio at Texas a and M. university is Jennifer ...\nAn associate professor in the university's department of communication at an expert in American political rhetoric Jennifer welcome to want to say hello and thank you for having me on joining us on live from Georgia is Heidi ... director of the intelligence project at the Southern Poverty Law Center\nThe project trucks hate groups and extremists Heidi welcome\nThanks for having me edit NPR New York Nick Gillespie is editor at large for the libertarian magazine reason Mick thanks for joining us oh my pleasure thanks for having me Jennifer let me start with you you've been paying very close attention to President Trump's rhetoric\nFrom an academic standpoint since twenty Fifteen during the campaign when after he announced his candidacy what have you noticed about his use of language particularly the most salient ways that you see maybe differs from previous presidents\nYeah so Trump is very consistent with the way that he uses language he has used the same sex rhetorical strategies throughout his campaign and his presidency [noise]\nUm and and largely those are the strategies that presidents typically use for war rhetoric and so what I mean by that is you have lots of examples at the beginning of what we think of as I ... I'm threats threats of force we usually use those threats of force when we're trying to intimidate opponents\nUm when we're trying to shut down debate and discussion\nSo he does that repeatedly what your examples where regret it showing he also uses ad hominem attacks is is attacking the person instead of their argument so we're used to these attacks and sometimes they're funny but they position people as objects of derision so corrupt Hillary or low energy jab or lions head\nI'm not willing to compromise my values over election time is up\nSome lawmakers who could accused now face voters tomorrow on MORNING EDITION from NPR News\nTomorrow morning at five or ... point nine W. B. U. R. Boston's NPR News station\nSupport for NPR comes from the station and from the Annenberg Foundation committed to supporting educating and engaging communities and the United states and globally for more than twenty five years learned more at Annenberg Foundation dot org\n[noise] from the state of June be crock who's requests serves as an enduring investments in the future of public radio and seeks to help NPR be the model for high quality journalism and the twenty first century\nAnd from the John D and Catherine's the MacArthur Foundation at max found dot org\nIs what a I'm Joshua Johnson we're discussing the role of political rhetoric in public life particularly these latest acts of politically motivated violence and whether or not President Trump beers any responsibility at all for these acts\nWe're discussing with Jennifer ... an American political rhetoric expert from Texas A M university highly by Rick of the Southern Poverty Law Center a Nicholas be a reason\nPage one hate speech is allowed a platform under the guise of free speech hate will proliferate and violence will follow just wanted to read this comment by way of bringing up we've mentioned this on the program before but just to be clear\nHate speech is protected under the first amendment you are allowed to speak hateful things in public the line is when it fails what the Supreme Court calls the clear and present danger test when it's considered to be intended to cause imminent violence and likely to cause him and violence so I I hear where you're coming from Ronald but just\nTo be clear under the law hate speech is free speech speech that is designed to end likely the cause of violence that has not protected under the first amendment\n... two of our commenters mentioned the same example which also has come up and free speech Supreme Court cases\nRobert writes research supports that hateful vitriolic speech drives hateful behavior the logic is blatantly obvious why is it illegal to yell fire in a crowded theater\nAnd skier tweets if we can't yell fire in a crowded theater liking the president yelled at immigrants lead to rapists in a crowded country Nick\nAh you know because that's the law and um you know it is amazing ah what we need a you know and and you know I I think part of part of what we're struggling with\nUm is Trump is a master of using the media to to make everything about himself and then everything becomes a referendum about him I mean literally since before he took office\nEvery new cycle every day I mean even you know the the day or ... you know ... ... less than forty eight hours after the synagogue shooting he talked about the media is the true enemy of the people and he's shifted the focus away from the synagogue shooting and the specifics of that back to his ongoing a critique of the press for I think that's kind of pointing\nThese comments I mean if you yell fire in a theater that is not in fact on fire then you can cause a stampede VIP will hurt just based on saying one word fire that one word and cause trouble so my calling someone your enemy you don't lean back when you feel an enemy\nIs approaching you that's what this is on one side action but this is also where you know and I mean it's a you know I'm a parent myself and it's kind of bizarre conversation to be having with the you know it was Seventy something year old man who's the president of the United states but it's like\nIf we continue to take the bait and by that I mean you know not just that we're all part of the media now in in various ways whether or not we actually are you know have a a company that publishes a newspaper or something like that\nWe need to we need to be engaging this in a different way and it and I'm not saying that we we ignore it and things like that but\nYou know talking about the caravan is like is fascinating um you know what reason we've published stories recently both looking at what is the makeup of the actual people in the caravan which is not you know a bunch of unknown middle Easterners as\nDonald Trump has tweeted and it's not ISIS agents and it's not even you know very many men are looking at the demographics of the care of and looking at the countries that there are emigrating from which the United states has a long history of of ah you know really bad foreign policy but make that kind of feels like that kind of feels\nLike when someone yell fire in a crowded theater you ask well where in the theater is is there a fire curtain right ... that it doesn't work that way that visceral reaction takes over and may well have taken over for this guy who shot up the synagogue in Pittsburgh it sounds like you're trying to have an apples and oranges\nArgument about what is what I'm saying is you you are not you are not going to win an argument with Donald Trump by you know being visceral and reactive to it like you you ... what we need to do I think and this is part of the polarization that politics\nEven as fewer and fewer people are identifying in political terms you know we're at historically low levels of identification as Republicans and Democrats of liberals and conservatives what these terms mean is now up for grabs it as it is leaking out of our life but the people but we are acting as if it's the only thing that matters\nUm and I think this is when I say we need a different type of conversation we need a conversation\nThat is not simply about politics particularly electoral or partisan politics because\nPolitics is a zero sum game essentially him somebody wins and somebody loses and the winner gets to put their thumb in the eye of the people who lose this is a bad way to organize our everyday life there are parts where politics are absolutely important and and needs to be dealt with\nBut Trump Trump is winning partly because he is able to keep us focus on this very narrow slice of our lives and he is dictating the discussion\nI'm Sorry that I don't think you're hitting his nail in the head for me I'm Talking about the visceral and made how ... how do you like about this throwaway I'm trying to explain this clearly but maybe I'm kind of be facing in the wrong direction how do you\nSee this well I I like the next call calls for a ... ... about that but I don't feel like that's the way that we can respond to what you know Trump is dealing in other words and sort of being diverted\nDidn't have tried to maintain out of the turn of the White House and I think he thrives on\nThe chaos that is involved with kind of hate rhetoric and raising the emotions of people and basically stoking fear which is what we're seeing with the caravan and and I don't know how you bring that down a notch by calling for civility 'cause it just doesn't seem to be to be working as much as I Would love to have that\nAnd and I think Trump knows that\nI'm not talking about civility what I'm Talking about is you know on on some level we need to ignore the president there have been a couple of calls for saying you know every time Trump\nTweets it's not news and Everytime he says something stupid and fat free were devote sort of a device of it isn't news and we're acting as if you know she is you know every ... every breath but he takes us somehow meaningful um and and again you know I I agree that\nUh I I it's not that I Want to read more him but it's like if we could talk about policy if we just talked about actual things that are going on rather than every time Donald Trump you don't attack suppressor says something about the NFL where it's cetera like we we are we're playing into his fantasy life and not making him the center of the world\nI'll grant you that there is certainly a desire among many folks to talk more about policy than the hardcore politicking will\nGive some thought so maybe where this kind of conversation needs to go in the future when we continue with Nick Gillespie Heidi Byron and Jennifer ... Heidi I Wonder if you could respond to one of the concerns that I think are a number of people on the political right have raised which is\nThis idea that the rhetoric is too hot all the way around that the political discourse\nHas heated up in both directions many on the rise of points the left\nSaying that they use similar rhetoric to the rhetoric that President Trump has been using but they don't get hold out for quite as much here is a sample of some of what they're referring to\nIt is time for us as Democrats to be as tough as they are to be an dedicated as they are to be committed is Michele always says you don't when they go low we all know\nThey go low we can [noise]\nNot a cabinet\nThank you\nThat you cannot be civil with a political party that wants to destroy what you stand for what you care about that is why I Believe if we are fortunate enough to win back\nHouse and or the Senate that twin civility can start again but until then the only thing that the Republicans seemed to recognize and respect is strength\nThat of course was former secretary of state and democratic presidential candidate Hillary Clinton preceded by democratic California congresswoman Maxine Waters and first was former attorney general Eric Holder Heidi ... what about the course and this across the political spectrum how does that factor into into our current climate\nWell there's no question that there was ... as well on the left but I think it's a little ridiculous to try to say sort of like Donald Trump did after Charlottesville but there's some sort of equivalent scare the real nastiness is coming from the right and it's coming on the basis of attacks on immigrants\nMuslims global is which many people would argue are anti Semitic theories and and there's something else more the violent is coming from the right we don't have domestic terrorism that's out of control from leftist that needs to be the case in the Nineteen sixties\nAccessible I think I've learned recently that Elaine had no concept of any of my work or anything next time hearing now tomorrow here on Ninety point nine W. B. U. R. Austin's NPR News stations\nSupport for NPR comes from the station and from Americans for the arts committed to transforming America's communities through the arts and arts education supporting the nonprofit arts industry which employs four point six million people nationwide learn more and Americans for the arts dot org\nAnd from the Kauffman Foundation working together with communities in education and entrepreneurship to create uncommon solutions and empower people to shape their lives and be more successful more online ad Kaufman dot org\nBefore we get back to our conversation we would love your help with tomorrow's program about voter access head of the midterms we've heard a lot of concerns about people who should be able to vote not being able to voter fraud has been a hot topic for the last few years some say voter suppression is worse now than it's been in some time\nHow easy or hard is it to vote where you live\nWhat have you encountered in terms of registering to vote or casting your ballot leave us a voice mail eight five five to ... three six one a one egg if you've ever run into problems voting what was the issue and how did you deal with it\nTell us your story eight five five to three six one a one ... or send us a radio quality audio file through our app won a vox pop will share some of your stories tomorrow on one ...\nUm no free to cats but I tend to avoid scary movies if you're like me and you find yourself facing a tale of tear on the screen\nIce cover your ears [noise]\nImages of spooky houses and bloodthirsty monsters are only a small part of what gets our heart's racing [noise] the rest of it's done by the south [noise] especially the music [noise]\nJohn Carpenter is a master of horror movies end of the soundtracks to bring them to live his latest project as a return to the film that launched his career\nHalloween John Carpenter directed and scored the original back in Nineteen Seventy eight and he's the composer on the twenty Eighteen sequel which is in theaters now\nJohn Carpenter welcome to want to thank you for having me you've been away from the Halloween movie franchise for some time now what made you decide to come back when his producer Hollywood\nProducer Jason Blum a convinced me to come back\nI knew that one was a a a sequel was going to be made as I Know a Malik the cod he's the the son of the man who put up the money for the original Halloween so I knew there was a sequel coming\nBut Jason's bomb a talk to me and he said you know where it's going to be made with or without us so why don't we meaning he he and I\nI'm getting bored and try to help it be good so nobody had put it to me that way before so I thought that's a great great thing\nJason Blum spend doing some pretty interesting things with horror movies lately what what do you make of where the genre stance today\nThat's in good shape but it's always in good shape horror has been was cinnamon since the very beginning and I have a feeling\nA will be with us until doomsday just because everybody's scared of something that they were all born afraid we all understand fear and so it's really fun to go to a horror movie with your girlfriend or your significant other and cuddle and scream and so forth\nWas it like for you not being in the directors chair for the twenty eighth team version of Halloween you are involved in the film but what about watching someone else direct this movie it was a relief\nBecause I don't have to suffer the stress and anxiety that directors suffer and that's a worst profession in the world other than being a coal miner\nThe worst other than a cold I'll come on now well it could it could be worse I guess you could be a slaughterhouse type news or that you're right ah it's not the worst now uh when when things were a it's great to be a director when they don't work it's it's really garbage\nWhat do you think movie fans least understand about what it takes to direct a movie especially a horror movie\nWell ever order they at least understand let me think that uh\nDirectors are responsible for all the central elements of a movie if it's supposed to be funny they're responsible for the humor of it if it's an adventure and so forth and so on so director of a horror movies think of it this way horror and and comedy or a lot like\nBecause it's turning it's all about timing and it's all about when\nThings happen and how they unfold and it's more complex than than people assume but uh people just think that ... a lot of war in obvious violence and it's not\n[noise] yeah see I I I hear you on that it's an interesting analogy between horror and comedy I'm not big on Gore I Do not personally do well or on blood and Gore and all but a good suspenseful movie like I can I can hang with that 'cause that's that's a satisfying experience what what do you think\nIt takes to make that kind of timing in a horror movie work\nWhat is it what does it take to make a horror movie work these are secrets that only the Brotherhood no so I Can't oh come on you can tell me something well look to make it really simple uh\nThere are no rules for any horror film the horror horror movies come out of the story and horror\nIs every action think of it that way none of genre necessarily what's your reaction to things\nAnd if the story is is unfolding than you used the storytelling to a a a set up your scares and set up things they're frightening for the audience he said the word earlier suspense that's what's you if you get the audience in suspense and you can scare them\nSo maybe the key is having a story it's got enough of the right elements to make me feel that suspense so that they're there can be that pay off so that there can be the scare is that it\nThat is correct you got it what about the music you contributed music to this film and and the music to the original in Nineteen Seventy eight what does it take to make that kind of music work for a scary movie\nWhat does it take it takes a certain amount of talent and ability\n... that's what it takes\nNow were you always musically inclined when you put the original movie Halloween together Nineteen Nineteen Seventy eight or wasn't something that kind of came together unexpectedly\nKnow as I grew up in a musical household my father was a music professor he was a [noise]\nA virtuoso violin player and he had taught the college level music courses at a university where I grew up I grew up with music in the house all the time classical music listening to it\nHe decided when I was about eight years old that I should learn to play the violin there was only one problem with that and I had no talent other than that it was a great idea but I moved on from the violin to the piano and guitar and other things I picked a lot of stuff up\nWere there any particular influences that you draw on when you made the music for the original Halloween or that you've drawn on over the years\nYes I'm all classical a\nMovie composers and classical ... ah musicians and rock and roll I'd get influenced everywhere\nWhat about the timing I did this seem to the original Halloween is not in a plain old for for your time it's in five four time it's in this odd kind of time's signature was what drew you to that\nMy father taught me five four time uh when I was Thirteen and try it on the I had a pair of bongo signed up for Christmas I taught me find forum had and I thought it was unusual just straightforwardly unusual time inside\nAdapted that time's signature piano piece in their ...\nWere speaking to John ... the director of dozens of heart classics including probably some of your favorites Halloween to thing Christine prince of darkness escape from New York also a musician and composer who wrote the soundtracks for many of his films including the sequel to Halloween which was released this month by the way since it is Halloween we were curious\nWhat are you wearing shorts your costume send us a tweet with a picture at one a or tags vote one a show on Instagram to show off your holiday outfits what are you wearing what made you decide to pick your costume this year and also\nYou can check out what our producers dressed as for Halloween yes there is Eighteen costume\nAnd we will share that with you on our social media channels on Facebook we're Facebook dot com slash the one a show and on Twitter We're asked one hey John Carpenter what made you decide to direct and scores of music for your movies\nOr score at directing and scoring was a a an act of desperation because I didn't in the beginning I didn't have enough money to afford to a higher composer or an orchestra somebody to play the music\nSo I knew I could do minimal job but at least get the job done and I was quick and I was fast so I hired myself", "show_name": "1A Plus", "year": "2018", "city": "Tisbury", "day": "01"}