[{"month": "10", "state": "AZ", "station": "KOFA", "content": "So we have a snail mail there as well\n... thanks everybody for tuning in his native voice one the Native American radio network\n\nThis border radio tell you where the Yuma Thirteen twenty am ... dot org these surveys of Arizona western college\nWe also broadcast on the hour we're going to community radio network at eighty nine point five FM kj CSI age ... Williams Ninety One F. M. K. Jaycee deep Prescott\nNinety ... kj easy gay Kingman and Ninety One point three FM Flagstaff\nSunny and humid today with the high end you're eighty three breezy what the North West wing round Fifteen miles per hour guesses highest twenty miles per hour Kingman or thirty percent chance of showers and thunderstorms partly sunny with a high and you're sixty nine\nNorth northwest wins around eleven to sixteen miles per hour in the afternoon with wind gusts up to twenty three miles per hour in Prescott eighty percent chance of showers and thunderstorms behind your fifty six in Flagstaff eighty percent chance of showers and thunderstorms mostly cloudy skies with a high near forty eight\n[noise]\n\n\nGreetings\nGreetings greetings this is my world the music if peace will believe fake want those space from radio Phoenix semi hosts while rejects it is good to be here a good to have everybody on board alright it we'd go\nHey ah have a uh some music for much Jaycee lodge coming up for you here also some music by a scratch or least grudge Perry\nAnd then uh I have some uh a music by nice it's an interesting group coming up later on in the program so everybody kickback relax enjoy yourselves or are we moving to is a quote those space in a peaceful manner right ... whatever you want do right now it would go in this world wars with is if we go [noise]\n\n\n\n\n\n\n\n\n[noise]\n\n[noise] [noise]\n\n\n[noise]\nI'm\nI Am the only time they don't know\nMiami the danger oh\nI Am this week on the job\nI Am on the day\nThey may not then they [noise]\nThey live\nDraw\nA\nAnd the main base oh\nGun free zones [noise]\nMe and said oh\n\nThe line I think I'm leaving it in\nTerms of being name brand is the main\nWe man [noise]\n\nName is\nUnder the danger\nOh I\nLeaning all the gun Jones\nDying\nThe danger\n\nThe manner\nAnd the danger\n\nTo\nBring him\nWell\nWe ... we do\nSaid oh I\nIs saying you know\nOh I Love\n\nLean\n\nYeah I\n\n\n...\n\nYou don't know but\n\nOnly\nOne who is\nGoing\nTo win\nThe no\nNo one was\nNa na\nNa\n\nI knew\nI was in no way to do good\nAnd the St John\nThey do because\nAnd\n\nUm no\nI don't know where they're going to do one\nAnd they don't make me a change in\nBut in any way and\nIt was known\nAnd that and you get\nIn and\n[laughter]\nThe law [laughter]\n\n\n\n\n\n\n\nYeah\n[laughter]\n\n\n\n\n[noise]\n\n[laughter]\nWow nothing\n\n\n\nUp with the ... not a CD with listening to the kid is in string excuse me street is to get it before that Michael Rose up of the warrior job CD\nWho this to the cuts die or a robot that set up with Bob Marley up of the survival CD with it to the cat so much trouble in the world it would take in a small break do go into where we'll be right back alright [noise]\n\nDa du Jamal walk [laughter] got George couldn't show more\nThan\n... Brian ... command high in\nNew law law can be ...\nYour\nDoor one now on the\n\nAnd\nThe machine and for\nMy children and young George and George ... she drinks coffee\nI'm eating [laughter] [noise] [laughter] yeah I like the Iraq\nDo you write dumb law\nIn place like turkey dinner\nCurves and she never showed converged on your urge all your average about\n[noise] either Sean ... about an hour and you asked your\n[noise] which Dr ...\n\n\n\nJohn ... schools\n[noise] even Russia and go about [noise] manufacturers\n[noise] I was trying\n\n\n\nI think I'm\nAlone\n\nThe\n[noise]\nYou sure\nGo [noise] you sure that\n[noise] either you're\n[noise] he would do\nIs Bob Bob five five gallon [noise] years\n[noise] ...\n...\n[noise] five down fall down and\nHouse is [noise] you know the whole peace [noise] either don't\nEat with these guys get down get [noise] crafts I've\n[laughter] and you're going to the ... the German war [laughter]\nAnd he jumped off\nShe bright [noise]\nYou know just for me I Am [noise]\nAlong\nYou\n[noise] I mean\nI mean my\nDad [noise] I mean you might enjoy and you're still young young journalist me wrong\n[noise]\n\n\n\n\n\nWas the or the future in leaf scratch Perry up of the observer in the dark how the the resistance to the pet thirsty\nAnd before that ... Alvarez top of the Caribbean since it the the we listen to the to the ... or more than ... ... right and a quilting is set up with midnight or be through right the the with the to the ... the day [noise]\n\n\nWe'll put up with midnight ought to be true right CD who they to the home that day [noise]\n\n[noise]\nMe\n\nBe on the\nI Know\nKnow\n\nDog\nTo do what\nYou can do those may they\nWell be making the\nThe more the UMass day to\nDo that then\n\nMall do indeed\nDid did you just didn't\nSee\nKnow\n\nThe\nBeat\n\n[noise] no\n\n\nYou weren't you didn't think he will say you must border radio Thirteen twenty am and border radio easy don't work we also broadcasts an Arizona Comey radio network eighty nine point five FM cage easy a drink Williams Ninety point one at the same cage ACP print skit Ninety point seven F. M. K. J. C. K. Kingman in Ninety One point three FM's\nLike stuff where you see this Sunday Morning sunny skies were behind your eighty three when guts is highest twenty miles per hour today in Kingman thirty percent chance of showers and thunderstorms partly sunny skies with a high and you're sixty nine west south west wind about five to ten when its highest twenty three miles per hour\nIn Prescott showers and thunderstorms today about an ... percent chance on your fifty six in Flagstaff eighty percent chance of showers and thunderstorms hind you're forty eight and a south wind up six to eight miles per hour\n[noise]\n\n\n\nGreetings this is my world musical peaceful believes in causes space from radio Phoenix I mean who is well Richard that's good to be here it's good to have everybody overboard [noise] alright well okay he was there was a a group of a a rural may result\nIn the name of the group is made you go I have some of their music on the top of the program here also I have some are fiesta mumbo for you also have some really crude jokes are interesting version of the Jimmy ... this too that she did\nGreetings greetings this is my world the music of peaceful place in the space from radio meaning me who is what Richard said good to be here it's good to have everybody overboard alright okay here there is a a group out of a a drum Arizona\nBut in ... the name of the group is made you go I have some of their music on the top of the program here\nSo I have some at the at the mambo for you also have some really good you are an interesting version of the Jimmy hippies to that she did and then also of course some above body for you okay Bob Bob Marley bad that also I have a\nBand out of San Diego lifted that have them on on on the program as well or in their music for\nThough hey you all take back relax to do whatever you want to do in this peaceful place they caught those face All right\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\nMan yeah\n\n\nAnd two kids that need to do\nNa na\n[noise]\n\n[noise]\n\n\n\n\n\nMm\n\n[noise] [noise]\nOh oh oh\nIn your\n\nNa\nNa na\n\n\n[noise]\n\n\nUm although\nDa\nDa da da da\nAmong them on the ... the movie of all what will begin to get in the in\nThe lower ... along\nDeal in the\nLook will be will be\nDid you have any at all she\nDoes all that kind of a you know the the last thing you\nGot\nTo be a leading up to\nThat we gave them both I mean\nThey're gonna be a new one and read a little bit older than you know\nPatti big guy you know\nAnd they won't\nMe go\nLong movie I mean look\nWhat a shame\nIn\nLaw who will begin to get on the Web all\nThe cool\nThings go sing oh sure\n\nI didn't know what I'm doing during the day after the after the pound and now he just didn't know how\nOld are your thoughts on new\nMuslim don't do that while\nWho want to\nDo in the Desert Shield them\nBack on\nTo look down\nNine times\nYou don't want to do with them\nLead to the bar in your town you know be independent country going on in the\nIt because they would probably have done\nTo come up all around the world around\n\nIt needs to be with us today\nDoor\n[noise]\n[noise]\n[laughter] [noise]\n\n[noise] [noise]\nYes indeed yes indeed that that was the son they excuse me sending a day off of the sink grow a series CD with it into the ... system\nAnd before that and Julie could you up with the covered the world see be listened to a nice rendition of a Jimi Hendrix to boot child slight returns right\nIt will open that up with Bob Marley in the way it is up to the rest of them on vibration CD we listen to the cat positive vibration so okay\nHey we'll take a small break and we'll be right back they'll go anywhere [noise]\n\nDo believe\nNew baby ...\nThey stay in those\nThe guy that I was\nDa da da\nDa da da\nYears in the ... been dealing with Errol off of the island\nJammed see be willing to take me back and before that you know offer the suit gala CD with it then it gets a scholar and we open up the F. word the mambo off of the south or music CD would let the cat mama can't do that All right [noise]\n\n", "show_name": "My World of Music with Walt Richardson", "year": "2018", "city": "Yuma", "day": "07", "locations": [["Arizona", 34.5003, -111.50098], ["Kingman", 6.4, -162.399], ["Prescott", 34.54002, -112.4685], ["Miami", 25.77427, -80.19366], ["Iraq", 33.0, 44.0], ["turkey", 39.0, 35.0], ["Russia", 60.0, 100.0], ["Kingman", 6.4, -162.399], ["Phoenix Arizona", 33.44838, -112.07404], ["Jimmy", 6.51007, -9.23831], ["San Diego", 32.71571, -117.16472]], "not_found": [], "ep_coords": ["Yuma, AZ", 32.72532, -114.6244], "in_country": ["Arizona", "Prescott", "Miami", "Phoenix Arizona", "San Diego"], "out_country": ["Kingman", "Iraq", "turkey", "Russia", "Kingman", "Jimmy"], "in_state": ["Arizona", "Prescott", "Phoenix Arizona"], "out_state": ["Kingman", "Miami", "Iraq", "turkey", "Russia", "Kingman", "Jimmy", "San Diego"]}, {"month": "10", "state": "AZ", "station": "KOFA", "content": "Ninety point seven FM kj the cake Kingman and Ninety One point three of them Flagstaff your weather forecast\nFor Kingman this Sunday Morning sunny skies expected today with high is reaching up to eighty three some calm southeast wins partly cloudy in the evening with the Loeb around fifty eight in Prescott mostly sunny highest reaching up to Seventy five\nPartly cloudy in the evening Loeb around forty eight in Flagstaff sunny hides reaching up to sixty nine to ... southwest breeze partly cloudy in the evening with all up around forty in Yuma mostly sunny today has reached Ninety five partly cloudy in the evening a low up around sixty eight\n[noise]\n\n\nReduce\nGreen thing this is my world music a peaceful place in court to space from radio Phoenix that'd be host what Richard said it's good to be you're good to have everybody on board in the new year her white [laughter] All right let's see what we have here in this uh this this brand new slate of time [noise]\nUh ... Ziggy Marley music for you off of the uh fly Ross to the beach\nAnd then a going forward I have some sort some Bob Marley for you All right and then some ... to kill him and offered his uh meant the CD have somebody to come in for mayor so it's a lot going on and are you all just kick back relax enjoy so dance to you can't dance anymore are just you know it's it relax\nHey All right so it's all about thanks for being here let's kick off this program that's go [noise]\n\n\n\n\n\n\n\n[noise] you see\n\nNo one\nCan pick up\nMy mom my mom my mom I\nDi di di di di\nDi di di di di\nDi di I\nAnd I\nKnow he\nThe la di di di di di di\nMom and my mom and my ... doo\nDoo doo doo doo doo doo doo\nMom and my I\nNeed to know my\n\n\n[noise]\nAnd then they did in\nIn the new the new\nMom and my ... my\n\n\n\n\nYou do in\nNew to me that he needs to be in the new new thing they\nTo know your name on my mom my\nDa\nDa da da\nDa\n\n\nI Can't give\nTell\nAgainst the\nDid give\nWas that I Will tell them you\nSpies worse than the men that\nJobs as Paul ...\nThere are no time to be able\nCry in\nIs that you might face and so many shows she would be so many individual city which is going to the many ... machine in many over\nAnd so many abuse\nSo many Ryan\nIt'd be ...\nIn your situation becomes your weakness\nBe above the\nSo many ... see so many of the time you see so many by many are good for you\nDo many rising\nSo many rice\nShepherd was\nMoney in your mind you're done the trash\n\nIs greener than\nThe burn than that you do lose their\nJobs too hard on my shoes\nYou make friends and we tend to so many challenges in\nSo many devices are so many places many are you\nCan do many abuse\nDo mania riots\nShe do mania arrive\nDo many\nYes indeed and met with Ziggy Marley up of the flight or us the C. D. listening to the cut so many rising and like I said it's nice to hear a a a ... version of some of his music there and before that Maria Alice up of the printed media presents Cape Verde CD [noise]\nTo list into ... son on the field\nThey will open that set up with an R D up up of the rough guy to\nThe music of Egypt CD we listened to the ... and be ready to lead [noise]\nWould it take a small break the grill [noise]\n\n\n\nThanks for listening to border radio Thirteen twenty I Am in Yuma we also broadcast on the Arizona community radio network in Prescott Kingman black step and Williams\n\n\n\n\nThat died in ... for the dubbed CDs with it than to the judge made us for a purpose\nAnd before that Bob Marley up for the easy skiing in Boston Seventy eight CD we listen to the CAT scan and I believe that was pretty much the time when it was quite a bit last performance is coming to the United states if I'm correct also uh we met up with big mountains up but the resist\nAnd it was quite a bit last performance is coming to the United states so correct also uh we'll let the up with big low ... off of the resistance with the bonus track CD with is that to cook so teacher\n\nSay don't touch my downfall\nWhat\nThe\nI\nGuy the\n\nThis is my second of all nice\nPlay their game\nNa na na na na\n\nThe\nTime\nThe needle\nDa da\nDe\nDa\nWe also broadcasts an Arizona community radio network at eighty nine point five FM cage you see a trick Williams Ninety One F. M. K. J. C. P. Prescott Ninety point seven F. M. K. Jaycee kicking meant in Ninety One point three ...\nMostly sunny in Yuma this Sunday Morning hides reaching up to Ninety five degrees today partly cloudy in the evening with the local around sixty eight\nIn Kingman sunny skies today highest reaching up to eighty three some calm southeast when throughout the day with the public cloudy skies dental Loeb around fifty in the evening in Prescott mostly sunny today hydrogen up to Seventy five\nPartly cloudy in the evening all over around forty eight in Flagstaff sunny sky high near sixty nine some ... south west reasons partly cloudy in the evening a low around forty\n[noise]\n\n\n\nGreetings greetings this is my world of music a peaceful policing closest to the radio feeding me both what Richard said it's good to be you're good to have everybody on board\nYou already have some of the music for somebody to fans off of the stuff out there you know so much replete scratch Terry [noise]\nAlso I have some music I'm I'm from\nFolks out here in Arizona sugar beat up some of their music also some music from all over the boots off which is a ... D C B I think that's one of the latest recordings that we're going on there so it's a lot of music you know into this new year oh go ahead you're back relax enjoy so would you\nTake some time all too good about yourself or so before anything for it [laughter] to do this [noise]\n\n\n[noise]\n\n[noise]\n\n\nNice things\n\n\n\nWhat do you\nDeal\n[noise]\n\nYou want you know a lot of the day that it is I I\nMean I [noise] each [noise] he can you know\n\n[noise]\n\n[noise] [noise] [noise] do need\nTo be\n[noise]\nThe holy moly ...\n\n[noise]\n\n[laughter]\n[noise]\n[laughter]\n\n[noise]\n\n[laughter]\n\nIs one of\nBe meeting remarried B. B. B. but nobody\nAll this will be somebody that will be will be some\nMore companies will\nTo be happy to be able to\nThe measures that are going to\nA show Jamie ... I\nAt them naming the\nWhere they need the badger these bugs is she\nThe book but we\nThe vehicle then they'll be deemed it may be you\nWith it I didn't want or\nKnow they might be prone to\nDa da\nDa da da da\nDa da da da\nOr do what we did\nThey drew me to grow up in the movie I get\nShould not be the one of the research that's\nCall me out every ... but the New York how about the lawyer\nGuns are doing all the\nWhen they came back you know given Micki de Vito ... called me in\nBe no way you\nBut he knew how to me and then it'll\n[noise]\nLong you\nKnow half of them may\nBe really bad [noise]\nArizona's sugar beat up of the sugar B. C. be released into the bright future in sales and before that\nWe would visit to stand up for the good meal presented French Caribbean CD [noise] willing to to the to the studio beat\nAnd we'll let set up with a bill to bust up\nOf the feeling the sixty be related to the cut love story love in the world that uh [noise]\nThey take a small British and we'll be right back don't go anywhere [noise]\n\n\nBroadcasting from the campus of Arizona with in college from within forty five years this is Thirteen twenty ... radio importer radio a C. dot org\n[noise] [noise]\n\nBe\n\n\n\nOut of LA the delivery ends up being the be entitled the delirious we're listening to the big man street is that before that with John Carlos up the the ease it ruling by\nA reggae ... tribute to Bob Dylan we listened to get blowing in the wind that moves right along really nice nights like this\nIt losing it set up with a little bit to do the opposite the shin ... CD that just that strange isn't it [noise]\n\nAre or do", "year": "2018", "show_name": "My World of Music with Walt Richardson", "city": "Yuma", "day": "28", "locations": [["Prescott", 34.54002, -112.4685], ["Yuma", 32.72532, -114.6244], ["Phoenix", 33.44838, -112.07404], ["Egypt", 27.0, 30.0], ["Yuma Arizona", 32.72532, -114.6244], ["the United states", 39.828306, -98.5795], ["the United states", 39.828306, -98.5795], ["Arizona", 34.5003, -111.50098], ["Yuma", 32.72532, -114.6244], ["Prescott", 34.54002, -112.4685], ["south west", -15.0, -52.0], ["Arizona", 34.5003, -111.50098], ["New York", 40.71427, -74.00597], ["Arizona", 34.5003, -111.50098], ["Arizona", 34.5003, -111.50098], ["LA", 34.052235, -118.243683]], "not_found": ["Prescott Kingman", "Boston Seventy"], "ep_coords": ["Yuma, AZ", 32.72532, -114.6244], "in_country": ["Prescott", "Yuma", "Phoenix", "Yuma Arizona", "the United states", "the United states", "Arizona", "Yuma", "Prescott", "Arizona", "New York", "Arizona", "Arizona", "LA"], "out_country": ["Egypt", "south west"], "in_state": ["Prescott", "Yuma", "Phoenix", "Yuma Arizona", "Arizona", "Yuma", "Prescott", "Arizona", "Arizona", "Arizona"], "out_state": ["Egypt", "the United states", "the United states", "south west", "New York", "LA"]}, {"month": "10", "state": "AZ", "station": "KOFA", "content": "Ninety eight point seven ... men in Ninety One point three FM Flagstaff\nMostly sunny today in Yuma hides reaching eighty degrees partly cloudy an evening but the Loeb around sixty six\nIn Kingman today there's a fifty percent chance of showers partly sunny a high on your Seventy three the chance of showers will continue into the evening with mostly cloudy skies and a low rent fifty five\nForty percent chance of showers throughout the day in Prescott with partly sunny skies hind you're sixty seven mostly quality in the evening with low around forty seven forty percent chance of showers in Flagstaff throughout the day mostly Claudia Hi near sixty most equality in the evening with the low around forty\n[noise]\n\nAh\nThree deans greasing greeting this is my world music a peaceful bleeds enclosed space from radio Phoenix I mean who knows what Richard said it's good to be very good to have every body on board [noise] hey ah you know what I put a little radical music is is a line up for you okay today [noise]\nAnd also have some music or for a group out of a San Diego the ... there's also some music from yellow man coming up right [noise]\nAnd then uh for all the view I tells fans I have some music or as well for that so stick around a a you know we do this in this peaceful place and causes sleep is create your own reality for a while but it's also fun alright [noise] we we go [noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\nI mean that a\n\nDo\nDo\nIn the room\nNeed you need\nI mean never made it you know one\n\n\n\nSure [laughter] slang\n\nLet go online and I went through [laughter]\nSo yeah I I'm sure it's not\nA\nShot so I run a school for the phone show and who were from them all on at one point my you know young young\nChildren read what I [laughter] go very nice cars\nTowards Muslim ... [laughter] you know one nice thing we're\nTo find a job [laughter] Knoxville and and uh [laughter]\n[laughter]\nFunny on TV [laughter]\nAbout them I don't know too much so far out of the time and I I'm not going to do that to them they don't even know where we\nDont know with the job [laughter]\n[laughter]\n\n[laughter]\nYeah\nI wanted to own it every day you know [laughter] so I mean [laughter]\nYou know for the young bond over here because it wouldn't it\n[laughter] you\nYou really should be I don't know [laughter] [laughter]\nOne by one\nDay and I didn't mind in a moment with bombs\n\nTo the point where\nThere are some of those vehicles we\nDecide to go\nBack to the show tonight but [laughter]\n[laughter]\nNo game\nSo Merkel sorted them John John on the line and John John with us you know you\nGot it on\nThe line [laughter] [laughter]\nWant to Jay for\nIn the world\n\n\nThe people\n[noise]\nDid you watch them on my son in Tunisia and in addition to the new show in front of\nA young man a right to be permanent maybe a like a gun is John John from John Donne drum comic\nDoe budget be in the ... year low minute John I well you know mommy John ... of\nThe day and night time and it's nice down there to\nDo or don't do in the I Know my own my own John strange I don't mind when they might not be on a stay at home ... G A door\nHim on a gun in not in charge now for me to do when the the the normal and go on the East China or gear yellow mind on both the one who's on human\nBeing in a ride me from that maybe I'm right\nHere I'm going to be stable government from John John from the top\n... Paul ... or the ... are you not only will he allow my ... the ... ... ...\nIt does it do they die and then they know you're trying\nTo do that do in the ... I Love golden rule my into John John Adams me honestly around\nMe I guess I'm On in the long run it on what we mean by going near my knee deep in the Enron and\nProbably the men's draw your way to turn them you don't have to bring you here's your problems are young you're not going to be a mistake on your on your way around wherever they call for\nCongress from ... Oregon\nWe have a lot of money off it around hall says your limits on Iraq fish for maybe a year or less fearful John from their jobs from Germany\nBe from a\nGovernment job from the dog from John\n...\nOh I Do do you do in a lot more than ... million loan on John I'm hopeful\n\nThat was the yellow man off of the young gifted and yellow CD listen to the ... who can make it a threat right\nBefore that Tony Ellen off of the real guy afro beat revival CD\nRelated to the cook crazy afro beat we open that set up with a group out of Arizona do walk up at their age or pool defiant tone CD related to the ... step a list of winning tickets small break we'll be right back [noise]\n\n\n\nYou can hear border radio Thirteen twenty am on the radio at at at download the app install it and so like K O FA as your favorite station\n...\n... ...\n...\n\n\nAnd ... being the by\nMan has done na na na na na\nNa na na na na na\nGun ... gang although\n\n... the\n\nMan go while a man named the body na\nNa na and get someone in the the ban\n\nA lot of\n\nDo remember\nMurder\n\n\nIn the\nIn\nAnd why\nNa na na\nNa na na na na na na\nNa na na\nNa na\n\n\nThat\nThat was ... tore up of the uh Molly CPA would listen to the cut cap and before that a buck Chuck a shock on top of the\nAfrican music CD we lived through to the cut and by the lead and we opened that up with some ... music to New Orleans right their parents sent me an up or be plugged the to lead the hid the be related to the cut paradise [noise]\n\n\n\nGoldstein\nDa\nDum dum da\nDa da\n... you know\n\nTo the man or the\nThe the man do\n\nDo they do ... new homes he said the most ... they don't lose aid booms and the ... most shops\n\nMan\nPlay men do\nDo not let me see [noise]\nDo not put the ...\n... Oregon hoping to shoot the\nDo they don't ski machine thing the ...\n... ... ...\nPeople on the team or\nRead them do\nDa da\nDa da da da da da\nDa da da da\nNinety point seven FM cage easy cake king that in Ninety One point three of them like staff\nFifty percent chance of showers throughout the day in Kingman today partly sunny skies hind you're Seventy three o'clock in the evening of Loeb around fifty five forty percent chance of showers throughout the day in Prescott partly sunny behind you're sixty seven today with mostly cloud these guys in the evening and the low around forty seven\nForty percent chance of showers in Flagstaff throughout the day mostly Claudia Hi and you're sixteen most equality in the evening alone around forty degrees\nMostly sunny in human today a heightened you're eighty degrees partly cloudy in the evening with the low up around sixty six thanks for listening\n\n\nRoutines\nGreetings greetings this is my world music a peaceful place called space for radio Phoenix I mean who is well Richard thanks good to be very good to have everybody on board okay so some music out of Arizona right I have some of that for you\nOut so uh so Bob Marley okay we've got to Manuel they call you also have some terrible\nFor you so uh it's been a while since I've played some of that so a kickback relax enjoy yourselves and news peaceful place All right let's agree to a reality for a while at the moment [noise]\n\n\n\n\n\n\n\n\n\n\n\n\nAnd [noise]\nAnd\n[noise]\n\nMake\nMe ... ...\nEmail later lady and may maybe\nLady and may be\nBut oh well let me what it was like oh\nWould do\nYou make them they will not amazing though do they do a little bit and call in my way into\nThe language and\nX Y do do do\nDo do you want me to a guy\nWho would do it at all she's been making it a lot to me I'm trying to do maybe\n\nWay a little bit earlier they get it out\nTo do\nWhat we do our men do I look back in ... do you mean daily me loaded our guy will do thank God he's been making you know the main thing to\n\nBeen born and raised in the\nAudio although I got a reason to think about the future is bright do do you know you may think\nGirl that you can do\nEach other and the lady do you mean the\nDo\nJohn during the late ... do you mean the guy who would do though he didn't make it\nA lot of the main thing and so\n\n\n\nA a guy\nI Do want a job you know education and what they do not that every day I just don't go out there almost no I mean what you want a man you know every\nWe might have come and get their every day and the way\nYou know I'm at that time is short young people don't strain on the stage that boy you're right about\nA car and then I think I'm like\nWhoa whoa\n\nWhoa whoa whoa\nWhoa whoa whoa whoa\n\nWhoa\n\nA baby and\nBetter one down models draw a\nJohn\nBon resume is there any way and he says that\nJames Bond runs the shop is there any way to\nStruck the direction\nJive whoa\n\nWhoa whoa whoa\n[noise]\n\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n\n[laughter]\n\n\n\n[laughter]\nAnd I I'm a size\n[laughter]\nThe company\n[laughter]\nYou're very well [laughter]\n[noise] [noise]\n\nNah nah nah\nNot very\nOf the church and the\nAnd\nAnd new day [noise]\nUm I'm\nNot [laughter]\nGuy\nI\n\n\n\n\n[laughter]\n[noise]\nShe [laughter] [noise]\n\n\n[laughter]\n\n\nThey're not paying\nYour big\n[laughter] [noise]\n\n\n\nTo probably he Bob\n... book on\nThe news on the topic was about eight miles every\nKnow\nReally where not to do is ...\nNot that sounds like you're\nProbably would not be a colleague as he signed on law on my on my team Amy go bungee ... bond buying a call ...\n... my time in my\n\nThat was a Anthony be off of the reggae on the river lives CD we listen to the cut rate the bar and you're right [noise] and before that Bob Marley in the winters up the Babylon by bus to live CD with this new to the could\nPositive vibration and we're hoping that set up with another band out of a\nI think these are folks were at a flex a medical summit dug up for their the beauty wage CD would listen to that could survive it we're going to take a small break stick around we'll get plenty of music [noise]\n\n\n\nThinks we're listening to border radio Thirteen twenty or Yemen Yemen and border radio easy dot org we have been the service of Arizona was in college for more than forty five years\nDon't touch my downfall\nWhat\nThe\nAnother thing\nI I Am not\nBy the\n\nThis is my kind of fall nice\nDied of French fry my\nYes indeed that was arrow of both the Caribbean party CD you listen to the ... don't touch but to go for it to be for that delivers a dingo up of the\nCaribbean Sunset CD we listen to the ... Bill Gates is going to reopen that set up with Barry ... for the met at their lowest CD related to the ... there [noise]\n\n\n\nOoh\nWell\nI'm\nCalling you out of the leading in Louis ... ... ... ... do they have been seen a\nOn law and I mean\nDo they have been seen\n...\nBad is it going I'm going to lead a God doesn't do you think it's going to I'm among the ... the the big ... and when we\nGo I go with the ... the global would not get a new ... new\nAnd they need to do that the\nListener Myrtle by people do little body\nBut I don't know it could be up at least in some but I'm the middle of keeps you up the up and you know ...\n... I Believe\nThey'll say it but it back to the museum\nNeeds to go out to do I do\nA lot more than just saying being highly though that was just thought man\nMean in my spare the\nLargest and most of them ... ... ... ... the ...\nThe\nWell where we are going to put it is a\nBeach could I've hooked up to believe that that kids who\nAre routinely up by ... by a guy\nWho will be up by the by a Becky a\nNew York by ... by a\nYoung man who will be a very good at a\nMolly they'll pay up pretty bad you know you live\nOn the stand while well we'll go out to walk\nYard and they will they will say is competing on leave those bathrooms you should stay out\nFor me to cheat let's say a bridge the\nName of the main job what do you call your school\nDoes to a souvenir Roy chi chi identity mile ... Williams who else is a\nA year later the Nike or move where do you get in a\n... who who would be like the high a lucky or would you like it is a new dog ... G of like am I a\nYou do not\nKnow what\n\nThey need to live\n\n", "show_name": "My World of Music with Walt Richardson", "year": "2018", "city": "Yuma", "day": "21", "locations": [["Yuma", 32.72532, -114.6244], ["Prescott", 34.54002, -112.4685], ["Phoenix", 33.44838, -112.07404], ["San Diego", 32.71571, -117.16472], ["Tunisia", 36.81897, 10.16579], ["Oregon", 44.00013, -120.50139], ["Iraq", 33.0, 44.0], ["Germany", 51.5, 10.5], ["Arizona", 34.5003, -111.50098], ["New Orleans", 29.95465, -90.07507], ["Oregon", 44.00013, -120.50139], ["Kingman", 6.4, -162.399], ["Loeb", 42.11278, -124.18944], ["Prescott Arizona", 34.54002, -112.4685], ["Yemen", 15.5, 47.5], ["Yemen", 15.5, 47.5], ["Arizona", 34.5003, -111.50098], ["Louis", -20.16194, 57.49889], ["New York", 40.71427, -74.00597]], "not_found": [], "ep_coords": ["Yuma, AZ", 32.72532, -114.6244], "in_country": ["Yuma", "Prescott", "Phoenix", "San Diego", "Oregon", "Arizona", "New Orleans", "Oregon", "Loeb", "Prescott Arizona", "Arizona", "New York"], "out_country": ["Tunisia", "Iraq", "Germany", "Kingman", "Yemen", "Yemen", "Louis"], "in_state": ["Yuma", "Prescott", "Phoenix", "Arizona", "Prescott Arizona", "Arizona"], "out_state": ["San Diego", "Tunisia", "Oregon", "Iraq", "Germany", "New Orleans", "Oregon", "Kingman", "Loeb", "Yemen", "Yemen", "Louis", "New York"]}, {"month": "10", "state": "AZ", "station": "KOFA", "content": "We also broadcast on the hour is on a community radio network that eighty nine point five I asked them kj CSI age ... Williams Ninety One one that same Jay Jay Z peep Prescott Ninety points ... kj easy take Kingman and Ninety One point three FM Flagstaff\nSlight chance of rain before noon in human today with mostly sunny skies and behind your eighty three mostly clearing the evening with a low of around sixty three in Kingman sunny skies with a high near sixty nine today got up to Twenty one miles per hour mostly clear in the evening with a low ebb around forty four\nThirty percent chance of showers in Prescott today partly sunny with the high end you're sixty one partly cloudy in the evening with low rent thirty six in Flagstaff partly sunny a high near fifty three slight chance of rain and snow showers in the evening with partly cloudy skies and the low up around twenty six\n[noise]\n\n\nDude greedy duties [noise] this is what were the music the peaceful place to stay a radio host what Richard said it's good to be very good to have everybody on board we have here [noise]\nOh okay I haven't played any a collie but where you are in a while also have to music or out of Arizona some local artists there if you will\nA David way did some deep Drake coming at you also have some uh I told coming at ya it later on in the show so stick around kickback enjoy yourself you know how we do this in this school plays a quantum states about great your reality for a minute All right let's do this [noise]\n\n\n\n\n\n\n\n\n\n\nWe can\nGo\nNow to me\n[noise]\nAs soon as he\nTo your mind as you you\nPeople that\nAny more [noise]\nDown\nLines and they called me on yo mimics you write\nThat down time that I did tell why why\nDon't know if I was up here to tell me to oh\nLook it up you can read on the number one you know\nPeople need out you don't need them and to me or you know the law needs after you know the impact on how you want to leave after the wreck can you tell your own it down to rake in ... ... from what I tell them you're getting a little plug that I Need to go to\nThe line when you talk to\nWhy they called me on your and maybe I should I mean I\nWas at a time that I did tell why\nI say that I'm On a guy there was no follow up here to tell me do\nThat and they pulled me out to mimic it you know I Would add on top and the idea Kelly da da\nDa da da da da da da da\nDa da da da da da da\nDa da\nThink that that country after the fact that I mean by\nThat time of need to make it more\nIraq how can you tell your own it down to race and how does it stop you know ... for book but I you know go get a little part that I mean do we need\nWhy they called me on your membership and downtown idea to walk by\nLevels European and find a job\nWhy they called me on your membership and downtown idea to abide by\nNot be as they tell me all\n\nWell they may\nGo bang boom boom\nBoom boom boom boom boom boom\n\nBoom\n\nBoom boom boom boom\nBoom boom boom boom boom boom\nBoom boom boom boom boom\nBoom boom\n\nBoom boom\nBoom you\nGood job at a dog or a boy oh yeah my family man and a man or a lawyer or a bomb the man go lie down and go to a much ... than a dog named manager\nOf a A R A M may\nOr may not be\nBomb in a in\nBoy or a lot of the mind\nThat by the end of the\nOf a word on a\nOn a black guy or a day\nBring the guy I Try to break down by a boy or a dog on\nBy the by a lot\nA lot\nOf\n[noise]\n[noise] [noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\nAnd\nStuff to\nDo that by a by again\nTo\n\nDo that by that I buy a gun you know I don't blame them ideas on on a on\nA on a\nA [noise]\nWas ... excuse me that was uh\nThat was total re excuse me that was a recruiter and all the book tour a if you will of the uh talking to look to see the witness to their cooked go Mimi\nAnd before that was going to budge off of the\nCountry but a CD we listen to the ... mama seat to write it will open it up with Bob Marley off of the best of the early years as the de ... to the cat go tell it on the mountain ticket I've been here Peter Tosh in as well in the mix that's it right there baby [noise]\n\nWe're taking a small break and we'll be right back alright stick around [noise]\n\n\nBroadcasting from the campus of Arizona western college for more than forty five years this is Thirteen twenty am border radio and border radio ABC dot org\nTo ...\n\n\n\nAnd spends\nThink we need\n\n[noise] [noise] [laughter]\n[laughter] [laughter]\nAh\nAsk\n\n\nAnd do you have a ...\nAnd ... and\n... and ...\nAnd ... ... ... ... ... [noise]\nAnd there's a [noise]\n\n[noise]\n[laughter]\n\n\n[noise]\n[noise] [noise]\n[noise] [laughter] [noise]\n[noise]\n\n\n\nOh yeah that would be a toss up for the in this year time a C. D.\nTo the ... you don't care right\nThere before that a local artist out of Arizona the dress up or the right on job people see the when the the to the ... stand for and another artist out of a Phoenix, Arizona David weight off the beach or a CD when they're sent to the cuts day [noise]\n\n\n[laughter]\n\n[noise]\nMm Mm\n\n[noise]\nNot the Internet is such that much that they can't be a little bit they got to find him on my duty to Louisiana thank you cattle light candles that'll\nSolve the Battlemind teaches me that she's not allowed to get his gun laws to all the time she says she knows that the guys\n\nWho are [noise]\nThe kids are the keys and made them much better\nThen\nWould be a\nBetter\nLook at it will be my dad\nAnd download that way but then again\nWay way down to get away with them and I can\nListen to a lot does it look like you say that because there's no more than three times and they thought they saw them minor thing but they get the TV I don't use ... new badly needed anything they did on those details of a way to look at\nIt ... did I hear we machine on\nBoth\nSides [noise]\nThe ah the the the mind\nAnd then he's\nBetter than\n\n\nThe key to\nThe name of the\nIn\nThe in\n[noise] [noise]\nNinety point seven F. M. K. C. C. K. king men in Ninety One point three FM Flagstaff\nSunny skies in Kingman today hind you're sixty nine degrees with gets up to Twenty one miles per hour mostly clear skies in the evening with the low around forty four in Prescott thirty percent chance of showers partly sunny but the hunger sixty one part of the quality in the evening with the low around thirty six in Flagstaff there's a chance of showers snake partly sunny with a hundred and fifty three\nFive chance of rain and snow showers in the evening partly cloudy with a low rent twenty six and you mostly sunny a high and you're eighty three in the evening mostly clear what the low around sixty three\n[noise]\n\n\n\nGreetings greetings this is my with the music of peaceful place in caught the space from radio Phoenix I mean who knows what Richard said good to be here it's good to have everybody on board All right so what do we have here a loser or is that took a long time to put out who's right\nAnd we finally have it here resides in Arizona right now do we have some of his music coming at you\nAlso I'm Out of I'm kind of like the ... area we have some pouring in saying come for you and I'm also some lean you scratch Perry [noise]\nThere's a lot of artists out of Phoenix said featuring in this in this part of the program so stick around kickback in this peaceful place in the space and create your own real reality for a little while okay who would do this do this [noise]\n[noise] Mm\n\n\nYeah so yeah the\nSame day that mind being in a way to\nDo but I don't see any Jay Danny Dona ...\nJohn not only do so he can\nThe day they came in a\nJob or not ... than the man I don't know\n[laughter]\nOh\nSo they\nThink oh go\n\nAhead I'm saying it and I knew what do you care about them and I thought\nOh okay so\nOkay\nOh\nOh you know and\nThen yeah then when the man\nHe saw that again in our family said I\nRead a lot of\nDid an\nMean they're going\nNeed a bunny bizarre to me and they made a baby\nYou do\nFor you so you know I thought that they have a damning\nYou don't mind I'll go over there and they've been\nBy\nSo\nThey ever came in\nBaby carry either [laughter]\nI\nDon't I mean you know [laughter] oh I\nOh I ...\nOh I oh\nOh I\n\n... no\nOne wants to live\nIn a\nPool I don't know who they know who they say oh well\nA friend of\nMine last so oh dear ... to ... the ... last saw flu but that didn't they won't go to the known that I went out to cut by\nAll the boy oh boy yeah well the boy yeah\n[laughter]\n[noise]\n[laughter] so you\nCan be used for next to the way it should be so now than we do not lucky away be so now if you will be going down to the way it can be so nice to be so lucky away be so now\nYou get one way it's fun to to\nBe so nice and the only way ...\nYounger one way to it'd be is the name ... why don't lend that led to be so nothing to do the way to\nBe some that will be so lucky away from them for three years from now on the way be used for nothing says\nPeople will say oh no no I'm\nNot I didn't know why would\nWay way way\nSee nothing nothing nothing nothing saying\nNo no\n\n\nCheese\nAmong last saw\nThe ...\nThe man\n\nMaine oh\nI'll just do the bugs do their\nAnd then the other\nShowdown game and\nDream my use of the time\nAnd again Illinois a\nAnd you know like a\n... in that and now she's on the\nPart jumped the shark young south fish which will burn up on top yeah\nWell\nAnd he's now a days to come up and then when\nNow and again\nThe\n... they really knew that\nStuff and then the other night\nAnd getting done\nThe game on the job\nThat you can see try and get\nRag\nAnd I\nAll\nYou know the um\nAnd\nThat made sure that the games\nBy no means Ken Lay\n\nRead the\n\nAnd you\nI'm In the\nNice day and it's\nReally hot\nIn the shanty a nice to see the greeting is\nReal hot\nIn the shade they\nWas sixty\nTo tell us be thought well on\nThe total was maybe they\nWill still be so easy\nTo lose the new\nBore you come away my reference to the sun\nYour friend on your show your booze I'll\nTo ... days may well do\nMay\nJust have this man\nThem and say Hi to the big news this man\nIs a\nTo she meant\nJust a A R thank\n[noise]\nJust I\n\nYou have\nThis\nTo have you\nDone this\nThis\nThis\nTime we have is [noise]\nYeah I uh that was a third world off of the better the magic son CD with is that just at Ninety six degrees and this was a ... or actually recorded versions right there\nAnd the artist that uh it took awhile for him to\nGet a C. D. L. [laughter] she lives in Phoenix so you're telling me do and the CD is titled finally it's here we're listening to the could miss down in the yard [noise] alright and another Phoenix artist or Sarah McAllister up are the two girls so you'd be to listen to this could mean\nPool man right [laughter] I'll get him to do whatever you want to write the okay if it were to take a small break we'll be right back to go anywhere\n[noise]\n\n\nThis is Thirteen twenty and border radio kill Afghan border radio easy dot org it's evidence of Arizona what's in college for more than forty five years\nDon't get paid\n\nOnly way to do\nBeen out on that we have them all\nFeel the same point no medical bills\nThere but I don't know\nDi di di di\nDi\nDi di di in that in on the phone rang when a man does\nLike no no\nNo no they're like fine I\nBased on all the young man by a dog\nThey don't want to be the young man I bought I don't\nKnow na na na na\nDa da da da da da\nDa da da da da each to go home to the top of the rough guy too so that Dan second edition CD we listen to a lady boy but Columbia and before that get a lot of the ... CD with us today because she's a good cook ...\nAnd a group that said that we keep the name of the ... present Brazilian beat and we listened to the ... are going to do is go do some but [noise]\n\n\n\n\nMan I don't know\nMan I don't\nDa da da da da da\n", "show_name": "My World of Music with Walt Richardson", "year": "2018", "city": "Yuma", "day": "14", "locations": [["Prescott Arizona", 34.54002, -112.4685], ["Iraq", 33.0, 44.0], ["Arizona", 34.5003, -111.50098], ["Arizona", 34.5003, -111.50098], ["Phoenix", 33.44838, -112.07404], ["Louisiana", 30.12595, -92.00939], ["Kingman", 6.4, -162.399], ["Prescott", 34.54002, -112.4685], ["Phoenix Arizona", 33.44838, -112.07404], ["Phoenix", 33.44838, -112.07404], ["Maine", 45.50032, -69.24977], ["Illinois", 41.85003, -87.65005], ["Phoenix", 33.44838, -112.07404], ["Phoenix Arizona", 33.44838, -112.07404]], "not_found": [], "ep_coords": ["Yuma, AZ", 32.72532, -114.6244], "in_country": ["Prescott Arizona", "Arizona", "Arizona", "Phoenix", "Louisiana", "Prescott", "Phoenix Arizona", "Phoenix", "Maine", "Illinois", "Phoenix", "Phoenix Arizona"], "out_country": ["Iraq", "Kingman"], "in_state": ["Prescott Arizona", "Arizona", "Arizona", "Phoenix", "Prescott", "Phoenix Arizona", "Phoenix", "Phoenix", "Phoenix Arizona"], "out_state": ["Iraq", "Louisiana", "Kingman", "Maine", "Illinois"]}]