{"month": "10", "state": "ID", "station": "KRFA", "content": "... in ... go to Sean in Bellingham yeah a way to go Sean I Love it listens everyday\nAnd I really enjoy your your support it so important to keep the station on the air and to bring you the programs that that you deserve frankly your contribution supports these short fund drives to you can give right now at N. W. P. B.\nDot org got to the news coverage coming up and just a moment beautiful day here across the north west you expect dry conditions throughout this week and into the weekend maybe you didn't into next week pretty nice fall weather great time to pledge at N. W. P. B. dot org keep the pledge drive short end W. P. B. dot org northwest\nPublic broadcasting K. R. if a Ninety One point seven Moscow Pullman K. N. W. V. Ninety point five clock St Louis and K. N. W. O. Ninety point one caught what Greenville NPR in classical music community service of the road armor all College of communication at Washington state university\nOn line that N. W. P. B. dot org live\nFrom NPR News in Washington I'm jak sphere the small Gulf Coast community of Mexico beach may have taken the hardest hit from hurricane Michael even as rescue crews continue to search for survivors and others worked or store power\nPer hour winds and you can see the evidence everywhere here uh houses that were in under construction are now just sticks\nMany homes are missing their roofs summer missing or siding and their sides fences down the most surprising things the trees trees are done everywhere crushing houses whole forest over like matchsticks and also there on the roads making it very difficult to get in and out of Mexico beach and all these other communities down here on the Florida Panhandle Michael\nIs now blamed for at least half a dozen deaths across Florida Georgia and North Carolina currently a tropical storm Michael continues to roll across North Carolina and Virginia dumping heavy rain as it heads towards the ocean\nPresident Trump welcome to an all star line up with musicians to the White House today everyone from kid rock to my love of the beach boys to Sam more from the group salmon Dave gathering came as Trump signed legislation overhauling the way music as licensed and songwriters are compensated Sam more said it's been a long time coming for musicians and artists\nThis is a historic moment I'm so proud when Mr Bush was then we couldn't get it done when we had Mr Obama and we couldn't get it done but we've got to do with this man [noise]\nOf the ... hatch music modernization act to measure creates a new independent entity that will license songs to companies that play music on line\nWall Street with the Dow Jones industrial average falling more than five hundred points or ... percent NPR's Scott Horsley reports President Trump is blaming the markets slide on interest rate hikes by the Federal Reserve\nAs stocks yoyo throughout the day White House economic adviser Larry Kudlow tried to sound reassuring he stressed the U.S economy is still in good shape\nBut President Trump complains the Federal Reserve is quote out of control despite the feds ample warnings Trump says he's been caught off guard by the pace of interest rate hikes\nI think the fed is far too stringent and they're making a mistake and is that right [noise] and it says despite that we're doing very well but it's not necessary in my opinion and I think I Know about it better than they do\nStill Trump says he has no plans to fire fed chairman Jerome Powell Scott Horsley NPR News Washington\nTaking a look at those numbers on Wall street the dollars down five hundred and forty five points to close at twenty five thousand fifty to the NASDAQ closed down Ninety two points to Seventy three twenty nine the S. and P. five hundred felt fifty seven points today this is NPR\nIn this day is northwest public broadcasting I'm Tom cocaine glad to have you along on this beautiful Thursday October eleventh\nWelcome aboard great to be aboard I'm joining Tom for the northwest Public Broadcasting's fund drive you know you get a lot from the station a no matter when you listen\nMorning midday evening weekends making\nTwenty four seven All right well you you know you get a lot well we're asking you to give something back today you weren't donation your support your pledge right now keep these programs you value on the air now you've already called or if you mailed in your contribution thank you so much if you haven't do it now that end W ... or you know it's\nJust after five o'clock maybe you just got off work and may you're sitting in the car and you're maybe sending that message to your wife or a loved one and saying yeah you know what do we need from the store I I'll pick up some dinner tonight why you're sitting there on their phone\nMake a pledge to end W. P. B. dot org make that pledge of support right now or if you're using the ... the ... app just click on that donate button or it says right there's click on super Thursday just touched that and\nYou bang you'll be able to uh uh make that pledge to support right down this special day pledge of support and W. P. B. dot org\nAnd you know the car is is pretty good bet that maybe in the car was maybe the first time you've ever heard or started listening to NPR and then W. P. B. well now you can call it\nDo it today do it now right now\nYeah it's easy to do when you go to W. P. B. dot org or one of our friendly phone volunteers will walk you through when you go to our colleague hundred eight four to eight nine nine one maybe you're trying to figure out what to say I don't know how much the gift\nWell you know that really is up to you but it's important to pledge is the important key uh but donating it'd be participating is more important than the amount donated N. W. P. B. dot org and\nDonate now to pay for the service you value called eight hundred eight four to eight nine nine one it only takes those two or three minutes\nHow much you figure that out will help you will help you with the various ways that you can pay an W. P. B. dot org one eight hundred eight four to eight nine nine one or N. W. P. B. dot org\nIs all things considered from NPR News I'm Mary Louise Kelly and I could Chang hurricane Michael has been downgraded to a tropical storm but not that far wreaking havoc all across the Florida Panhandle\nMichael ferocious wind ripped off roof obliterated homes and treat tore down power line and flooded communities all along the state's Gulf Coast\nWhen hard hit town in Port saint ... writes in Michael\nHe told us what he's been theme\nOr much destruction all over and say oh well not just in India forcing yogurt area right around the earth ah everything got destroyed credible businesses or got totally destroyed floating even in my house was never flooded before really across the political receding from the water\nAll but now we just got a math math plaintiff\nHow difficult hesitant to even to drive through the area and\nIt pretty buyers yesterday afternoon and early ... where did you see any Cruz county crews they all went out today and that might have been doing right now\nIs clear in free up the Roosevelt looking pretty good ... well thought out and there's not a whole lot of degree on the road right\nNow I knew that port saint Joe has somewhere between three to four thousand residents did did most of them evacuate\nOh I Would say less than ...\nLess than half okay we did they evacuate cheating that portion of all\nThe Georgia Alabama jobs for what is that what it in a song called back on that much\nOkay in Alabama so for the record in to date I mean where they mostly now are sheltering at schools are are there other facilities where they are hunkering down\nGory for hurricanes so did you feel that read that in more prepared enough in advance of this storm\nOh where do they could be like to say it happen quick are you ah you know it's usually looking at a two and a new way or the amount of war right away a little bit of time and I think it pretty red relied on for a longer time by we would have probably more people will\nGo we never had to deal with my wife is for a long road ready but we'll get it done we've got a lot of volunteer and this is not close knit community and I'm here to community people would do everything they can to help you know the ram\nThat Paterson the mayor of port saint Joe on the Florida Panhandle thank you very much mayor I Do\nThat here in Washington Senate majority leader Mitch McConnell is sending a warning to voters with midterm elections now just twenty six days away he wants Republicans to no control of Congress is not the only thing it steak\nBlues the Senate and the project of confirming judges is over for the last two years of President Trump that I think is a scary prospect of the people who like what we've been doing owned the judge Roger and ...\nGiving takes just three or four minutes tops gives them contact information how much you want to pledge that's completely up to you too and so is how you want to pay it checks cash installment payments credit card\nEverything works were looking for Fifteen pledges to stay on track right now we can do that when you pledge at N. W. P. B. dot org [noise]\nYou know how much did you give that is completely up to us suggested them out is ten dollars a month maybe you can support twenty or thirty dollars a month everybody has different and it doesn't matter how much you give it's really that you give but you give what is best for you best for your budget that's all we're asking\nBut every gift does matter ... eight hundred\nEight four to eight nine nine one or come to an W. P. V. dot org and a good way to donate today is by signing up as a sustaining member through your checking account or credit or debit card every news automatically each year and it's can feeding it for you it provide ongoing support for the programs you value\nAfter bout contributing to your checking account or other methods when you call eight hundred\nThank you very much and Cathy in Moscow we really do appreciate every donation today also calling from ... really good to hear from you\nKnow would love to hear from ... island we and how about Olympia we know you're listening on the way home today how about pull over may go to the ... maybe or go to end up with a P. B. dot org and make that donation pot latch would love to hear from you and how about ... eight hundred eight four to eight nine nine one now if you just\nTuned in your joining us for all things considered and super Thursday but one day fund drive and more noses ahead but first let's get three calls each from Richland\nPort Angeles let's get some more from you and cotton wood as well now let's get that pledge you an at an W. P. B. dot org looking for just fourteen more to make that goal for this break\n[noise] that's right I Would love to hear from you love a neck thank you so much uh he's from calling from Bellingham he says NPR is truth says Tom cocaine said maybe you're leaving work maybe you're going to the store maybe you're picking up the kids for practice he was doing all of that\nI Am president kind of but I Would love to hear from you feel like Nick for love or make that donation I we know you got a busy evening but while you're thinking about it while you're listening now is the time to do it just make that pledge it's more important\nGive is important when you go to and W. P. B. dot org and donate now at N. W. P. B. dot org\nOr do you know if your employer matches gifts to public broadcasting Microsoft bowling AT and T. just a few that do and there are many of them it means extra money for the programs you listen to and you can donate then ask your employer if they'll match that gift N. W. P. B. dot org\nLove to hear from Bellingham right now with the pledge of financial support for northwest public broadcasting how 'bout Tacoma Seattle love to hear from you or you know would love to get three calls from to come on let's let's let's light up the phones to come up eight hundred eight four to eight nine nine one of the ... of like a\nSomeone instead quality programs and they like the app when they listen you can listen all over the world with a northwest public broadcasting apps and all of these things do cost money has because of your pledge to support there were able to continue to give the news and information that people value every day\nAnd as you know it it's not possible to think everyone on the air but we are thinking lots of people on the air and we'd love to thank you and thank you if you haven't contributed yet do it right now you can give it N. W.\nB. dot org or you can call eight hundred eight four to eight nine nine one again and W. P. B. dot org from NPR\nTheir nominee nearly two weeks ago more than three thousand people are confirmed dead the number of missing could be as high as five thousand\nNow a new surge has started among the living parents and children separated in the chaos or trying to find each other and charities are trying to help them NPR's Lauren Frayer reports from the city of power\nTen crowd the lawn of a government building coloring books are spread out on a part of this is why they bring children separated from their parents\nBy that and\nLove\nSocial workers teach the children a song about not being afraid of earthquakes and then pull them aside one by one to glean information\nBut the most difficult is the babies because the what is their name was your father or whether you leave our Helene\nWith UNICEF says this is when he's work begins once the power back on an aftershocks dwindle hunched over a laptop in a tent heat index in school photos and list of the dead\nDo baby clothes hang from save the children said only now that some roads are possible and phone services restored are people able to report their children missing in the case numbers have spiked for example response\nChildren altogether believed to be missing and even if the government presumed dead charities like these say they will keep searching\n[noise]\nChildren play in the driveway as adults keep arriving at\nThis encampment dazed and desperate and hopeful yeah yeah yeah and scanning all these little faces says ... dean who's looking for her nine year old grandson ... he disappeared when the family fled from their house when the earthquake\nHit it on I mean when it's done up to them that are left smart and chatty boy she says just got a new bike across town the rest of our all these family waits in another ten on the edge of their neighborhood which is now covered in mud they hope that maybe the boy might wander back to their house\nIt's been Thirteen Days [noise] but I'm the only way to go to their house now is by motorbike through rice patties asphalt roads are all wiped out\nAnd when we get there at the house is gone\nOnce you get 'em all over the books on our [noise] your husband to hear about it must have like a little out of her mouth shut it carried it way over there the missing boy stepfather\nAnd memorials for all these family says they are not ready for his grandmother ab sleeps at the camp for lost children every night she's become a surrogate grandmother to the kids they climb on her lap and tell them sleep cycle chow today they have\nGot killed her and I so precious she says and our time with them do funding\nThere have been a few reunification here when parents walking and bought their missing child but they're also more on the plane to children being dropped off\nAkbar ... from UNICEF chokes up recounting how street vendor recently brought in a little boy his mother had handed him off and she was swept away by the tsunami\nLooked at my job [noise]\n\nAnd the mother and his friends\nAnd we try to find somebody to go to [noise]\nYou been here a week hearing all these stories and it doesn't get easier river river\nAnd he says he will never give up an Indonesian brother and sister were reunited with their parents ten years after the big two thousand for Asian tsunami ... initially thought he'd be in ... for days or maybe weeks\nYou're listening to northwest public broadcasting I'm Tom cocaine glad to have you\nLong it's five twenty nine NPR these headlines are in just a couple of minutes and not less public broadcasting news is about four minutes and thank you for listening today uh I Am in the studio with Greg meals\nBecause today is super Thursday we're asking for your pledges of support super Thursday seemed like a perfect day to come into the studio yeah that's why I'm here it is northwest Public Broadcasting's one day fun driving the dollars we raise in this Dr provide the news reports analysis in discussion you depend on every day to\nMake that pledge now and then W. P. B. dot org or call\nEight hundred eight four to eight nine nine one you know the mid term there just\nTwenty six days away and regardless of which party wins the house or Senate they're all we'll be big changes the policies and laws and that's because you aren't engaged citizen you'll want to know exactly what's going on\nChances are you'll find out by listening to NPR northwest public broadcasting that's why your donation today is important because we don't know what the next big story is but we know we have to be prepared to cover it\nNo matter where and when it happens you're gifted five or ten dollars a month\nFrom Lakewood thank you John from sugar land and another one from Ellensburg saying we support all organizations to speak truth to power your contribution supports these short fund drives and you know you love hearing more news and you're going to get to do so but it doesn't happen without new members to support those carrying the load give\nEllen great tack works at ... which helps police solve crimes is way\nWe're working on these cases that you haven't been able to be solved for decades they're all either homicide or sexual assault and and some of these are just I mean they're horrific murders of children things like that is just [noise] things that need to be solved\nAnd great tech says it's not nearly as easy as this new research may make it sound but others argue that the findings underscore the need to make sure people know what they're getting into ... to give up their genetic information Erin Murphy is a New York university law professor\nIf it comes out tomorrow that they can use genetic information for something that feels a little unsavory it's going to be virtually impossible to claw back the information that you've put out into the world and more importantly you've made a decision not just for yourself but for your siblings figure distant cousins for people you don't even know you're related to for your children for your children's children\nSo Murphy and others think better ways are needed to protect people's DNA to make sure it is and misused\nCan meeting scheduled for Seattle and Portland next week that at all has to do with the decisions being made hundreds of miles away in the desert that hampered corresponded Emma king tackled this question how do you keep them mostly empty radioactive waste tank safe for hundreds of thousands even millions of years\nThere's fifty six million gallons of radioactive waste at Hanford it's stored in aging underground tanks from World war two and the Cold War\nIt's all not far from the Columbia River these waste tanks that Hanford are huge some of them could fit a three storey house inside\nThere are a hundred and Seventy seven tanks altogether and most of them are single shelves or have a single whole\nMany of these tanks have leaked radioactive waste into the soil like at least a million gallons worth\nBut some the federal government has been able to pretty much empty transferring the waste into slightly dirtier tanks so now the question is how can the feds close these emptied out tanks for the long haul like keep them safe for thousands of years\nHere's the federal government's plan fill up the empty tanks with route and then build a rain proof cap over them to protect them from moisture\nIdea is if you keep the water away three meaning what\nThe level of contamination that will remain on the site\nThat Susan ... the chair of the Hanford advisory board to have as it's known around here is a group of stakeholders that watches over clean up at the site and give the feds states advice\nLuck Ben says when the federal government cleans out those tanks they aren't that clean really there will be about Seventy thousand gallons of waste left and just one group of tanks called the ... the farm\nThe federal government wants to go out over that\nAnd we're also concerned about the fact that we're not sure that the ... they put in there will actually mixed with the waste and become a salad impenetrable waste to form so that it won't leak into the water table\nAnd Washington state officials are also worried they say the federal government is looking at to narrow slice of Hanford when it calculates its total chemical and radioactive waste risk the Columbia River\nThe states the feds are counting all the other ways to Hanford like the stuff that leaked out the tanks already and other scary waste sites like pets or the government just used to pour radioactive liquid into the desert\nAnd all that waste has created plumes of contamination\nAdding to that eventual burden on the ground water under Hanford and ultimately the Columbia River\nThat's just bright he helps watch over Hanford clean up for the state of Oregon and the state is very invested in what happens at hand for an answer the Columbia another issue grounding is a really permanent measure like concrete it's likely those massive blocks would remain in place maybe forever\nOr at least for thousands of years hundreds of generations from now that's how long it would take for the radioactive waste to cool down some\nOregon's bright says it's really hard to plan for a million years of climate change civilization change and things we just don't know\nThere are the things we know and then to borrow from Donald Rumsfeld there are the unknown unknowns that we need to make sure we're managing overtime\nThis decision is important what's done at the farm might be the template for all the other tank farms Hanford on a scale of a million years bright says it's the things we don't know that could harm future generations that depend on the Columbia River\nI'm Anna King in Richland\nAre several upcoming meetings in Seattle and Portland next week weighing whether or not the federal debt\nSo much for listening to northwest public broadcasting and you know when you contributes to end up the TV [noise] you're supporting Anna King whose\nCovers the cleanup of radioactive waste Hanford in the agricultural community economy that is in the region\nYou're places supports a day keeps her on the road to give you that information that you need that will inform not only you but the rest of the northwest I'm Tom cocaine this is all things considered and with me as great meals on this super Thursday northwest Public Broadcasting's one day pledge drive\nRight and as you said I'm I'm with Tom I could have one of those shirts that is I'm I'm with [laughter]\nThat would work for the day today only or yeah one of the ... like a buddy shirt so it's just like all one shirt but you get one sleeve I guess the other yeah that would be great [laughter] well\nThis is the fund drive for northwest public broadcasting a we know that are coming on the air and asking for money that well a little different way to run a radio station if you've been listening commercially you'd notice the big difference there but it is the way that public radio works it's supported by the people who listen\nAnd if you're ready to give do it at N. W. P. B. dot org\nSan W. P. B. dot org you know one time the federal government provided a big percentage of the funding to bring you the programs you value on northwest public broadcasting but strong listeners support\nSeven percent of the annual income the single largest source of funding comes from listeners like you you're gifted day keeps the station independent make a difference give your first time contribution right now at N. W. P. B. dot org\nAnd donating takes just a few minutes but it means so much give it an W. P. B. dot org or call eight hundred eight four to eight nine nine one some contact information is all you've got to give us and then you decide how much you want to give\nYou pay your pledge in variety of ways so again you make the decision however you want to pay a checks credit card monthly payments whatever works at the volunteers they'll help you through it when you call eight hundred eight four to eight nine nine\nAnd said four to eight nine nine one give the amount that is right for you want to thank or someone from Lacey who says that they listen to the programs here a lot\nAnd I met him a shell and ... say that I'm ... twenty Seventeen a year ago they have to keep the informative entertaining and insightful information coming your way thank you so much for your pledges to pour today on this super Thursday if we can get Fifteen pledges in this break that's what we need to stay on track\nLet's hear from you and your ... eight hundred eight four to eight nine nine one and it donors to N. W. P. B. to bring\nCard it easy and convenient for you provide ongoing support for the programs you love and it'll continue until you decide to change asked about a sustaining membership called eight hundred eight four to eight nine nine one that eight hundred eight four to eight nine nine one and it would sure like\nTo ... get a free calls from Pullman and three calls from Moscow\nA Richland a kennel I can pass go the trifecta there and eat three calls from each of these cities right now let's keep on track with Fifteen pledges if we do that we'll we can make that ... this whole day will be a success if everyone listening right now calls you're in the car right now must out the phone pull over to take your phone out maybe ... picking up the kids\nOf at soccer practice maybe you're going to the store or maybe you know you get in the last couple of ... coffee before you your head home but make while you're listening right now take some time to make that pledge that bus that your phone and go to an W. P. B. dot org\nIt now and if you've donated thank you very much if you have and you can do so by calling eight hundred eight four to eight nine nine one\nThing about it while you're listening to the next story coming up it's your choice and your donation will be most appreciated again eight hundred eight four to eight nine nine one or give at end W. P. B. dot org\n... what's a positive effect on the entire day make sure you call it listen coal eight hundred eight four to eight nine nine one\nLike you've already pledged but blood good and he died ordered\nAnd just nine pledges needed now to stay on track we can do that yeah we can do that if you've donated thank you very much\nIt's not possible to thank everybody on the air but hey we'll we'll try every single gifted do appreciate it if you haven't contributed do it right now given in W. P. B. dot like Stephen and Sonia ... while they listen to NPR daily wanted to show their appreciation for the variety of shows\nNow for tonight but also on the weekends when he pled supported helps all the programs you hear\nNews cast is next thank you for listening but pledge at N. W. P. B. dot org\nNorthwest public broadcasting K. R. essay Ninety One point seven Moscow Pullman\nK. N. W. V. Ninety point five Clark St Louis didn't end cayenne W O Ninety point one cotton wood Greenville NPR and classical music community service at the end would armor oh College of communication at Washington state university\nLaw\nOther rescuers are making their way into areas along the Florida Panhandle devastated by hurricane Michael NPR's Debbie Elliott has in Panama City and describes the scene there today\nIn Panama City there is just utter destruction groups have been written from buildings windows are blown out power pole light posts twisted like they were something like a paper straw trees are snapped down everywhere every time you turn around and go down the street you can't\nBecause of things in the road mostly trees but also power lines pieces of billboard the front facade of a church had completely come off there is devastation on every street to just about every structure that I've seen in Panama City\nNPR's Debbie Elliott Michael is now a tropical storm moving through the Carolinas on its way out to see at least half a dozen deaths were being blamed on the weather system\nSenate majority leader Mitch McConnell says he is optimistic about Republicans keeping a majority in the Senate next year NPR's Kelsey Snell sat down with McConnell who's on what amounts to a victory tour following the confirmation of Supreme Court justice Brett Kavanaugh\nMcConnell says the often bitter fight over Kavanaugh's nomination is giving the G O P and needed boost just weeks before the midterm election\nThe timing for a surge really couldn't have been better not that this was all planned you understand but I mean it was a great a break for us in terms of energizing\nOur own people in the interview McConnell offered protesters up hurting half an hour like mob he added that Democrats encouraged the opposition but he's proud of Republicans are standing up to their tactics Kelsey Snell NPR News the Capitol\nA two man crew aboard a Russian Soyuz spacecraft bound for the international space station as safely back on the ground today after a dramatic emergency landing shortly after takeoff when the rocket malfunction\nRescue crews quickly located us astronaut Nick Clegg washing caused by Alexi option and after the capsule they were in separated from the malfunctioning rocket to send it back to earth with parachutes helping to slow it down\nBut the second day in a row the stock market plunged bank rake dot com chief financial analyst Greg McBride says there's a simple explanation\nNow that the economy's doing better interest rates are rising and or the bond market a kind of got that memo last week and the stock market got that mental this week uh and as a result did investors are predictably throwing a little bit of a temper tantrum\nMcBride says despite the steep losses however investors probably shouldn't panic he says that's because selling into a declining market could be the worst thing an investor can do\nThe way we like to ask for your financial support donating as quick and easy it doesn't do much to provide the news and information that you rely on and appreciate every single day are you ready to give you can do it right now it N. W. B. B. dot or you know this is ... ... maybe it's the station you listen to every day to get the news and information that you rely on\nUm maybe it's a station that you also listen to for classical music that you are supporting all of the programs you here today with this one day pledge drive\nWould love to hear from you in a\nTo cheat and how about union town Albion if you are from a rural community where you can get northwest public broadcasting\nIs it is how important is it to you to hear this station every day to quality network station that he was able to give you using information that is unbiased so you can choose the information that is right for you and make your own choices\nEight hundred eight four to eight nine nine one and donated N. W. P. B. dot org ... take that three or four minutes you'll give some contact information don't forget to ask if your employer\nMatch his contribution to public radio what an incredible boom and your pledge could be worth two or three times as much well that would be great eight hundred eight four to eight nine nine one gene from Walla Walla says that she's new to the area\nDo I hear it falls boxes dogs my dogs appreciate hopefully if your dog is listening to thank you so much well we think that it's worth a pledge of support for this station for you and your community eight hundred eight four to eight nine nine one or pledge right now and then what are you ... or give any amount that is right for you the thing is to pledge\nEight hundred eight four to eighty nine Ninety One thank you\nAnd all things considered from NPR News ... Chang and I'm Mary Louise Kelly\nAt least six people have been killed since hurricane Michael blasted a short yesterday the category for storm left a huge trail of destruction along the Florida Panhandle including in the coastal community of Mexico beach which is where we find\nNPR's Greg Allen enough on line in Mexico beach are understandably not great but we think we've got you hey there Greg [noise]\nHi Mary Louise how bad is it [noise] well\nIt's what you would expect you know it was a category for storm nearly category five when ... came ashore right here the I passed right over this this area and Mexico beach which is a very small community you know in the storm surge came in and you can see signs of every of every where there are still lots of standing water here most of the water went out but there's still plenty of ...\nYou saw roofs off you know siding off sides off um luckily the most people who had left and weren't here to steal and\nAre you able to drive around them in the streets relative it clear of water\n[noise] yes the here it's a very small community and the do the streets themselves are not too bad getting here is another matter you know we came over from Tallahassee day it should be a couple of hours\nMy producer Becky Sullivan and I took us nine hours to get here because you just don't know what roads are open and with the roads are open they're just barely open you have to drive around this round down trees your power crews out and in in ... and good Samaritans doing what they can but it's still very hard slog get in or out of this area\nRight at what about the impact on people I mean as always with the storms some people said they rode out the storm I assume you've been out talking to them what are they saying [noise]\nYeah I mean it's it's a tough one I talked to a man here who stayed and he said he left in hurricane oval\nWhich was in Nineteen Ninety five and the always regretted it is so hard to get back into the community later he always where he'd states we stayed and he said the strong as like anything he was prepared for rent ever experienced before you know the the sound the noise the the windows the walls flexing\nAnd he had a little safer and built for himself and his pets\nAt one point he said it became so he's ...\nWould have been injured if they had been the case and he kind of struggled to patch up his window and rode out the rest of the storm and ah today's here repairing his house with a neighbor and I asked him if he was sorry that he said he says no he'd do it again because he says if I didn't stay there all my mature all my possessions everything we get ruined by the rain and the other stuff coming in\nAnd what about the people who did evacuate is there any kind of timeframe on when they might be able to come home [noise] uh\nNo I don't I'm not not yet as far as I Know when you arrive engulf a county here you get an alert on your cell phone telling you that only for sponsors are allowed in the county at this point that they don't that even private even people who live here residents are not allowed back and so there's road blocks that many all the the major intersections\nAnd many many people were being turned away um it's to their frustration so it's they're worried about the safety because there are still wires down um everywhere here so it's it's it's safety first and it's going to be some time I think for people were allowed back\nA NPR's Greg Allen reporting in Mexico Beach Florida we hope you stay safe thanks so much you walk\nWhile you've tuned into all things considered and super Thursday the fall fund drive\nAlso maybe one or two from Mount Vernon Moses Lake and Moscow that would be terrific right now those pledges mean dollars for the programs you love and you can give it N. W. P. B. dot org give what is right for you\nAnd W. P. B. dot org thank you to Susan and let her to Moscow and and when that she mark and Laura in Walla Walla and Brooks in water ... thank you so much in a Cathy in Kashmir says she loves these one day pledge drive\nAnd she wanted to make sure that they keep going she says thanks ten W. P. R. N. W. TV crew and keep up the good work has nobody covers the north west like us thank you so much for that pledge of support\nYou know what's with that lead that you're supporting people like me who managed in the ... valley Emily ... who's been reporting on the not yet over fire season and a king who covers the radioactive waste and Hanford Tom ... Courtney flat often Jenkins the reporters that you hear every day on this station\nYour support make sure that you're helping them bringing the news to you and your community pledge of financial support\nEight hundred eight four to eight nine nine one the pledge drive is almost over it you need to do it\nAnd if it's one thing we'd like to do it make your donation as easy as possible now good way to do that is by signing up as a standing member\nDid you decide to change it that all your decision\nIt also makes your community a better place and that's what public broadcasting does each and every day starting your sustaining membership at five dollars six dollars a month any amount that you think is right for you donated N. W. P. B. dot org that end W. P. B. dot or\nIt maybe the station is a lot like a summer teams you have like your favorite cup of coffee or you know your morning walk that routine that you have every morning or every afternoon maybe you're getting off work and you get in the car and boom you turn on the radio to listen to northwest public broadcasting to hear the latest what's happening around the world and the north west\nNorthwest public broadcasting it's a regular part of your day you know you can make it stronger by donating now one popular first time gifted thirty five dollars you know that amount may not seem like a lot but that will go toward keeping your favorite programs on the air\nBut you got to donate got to do it right now and W. P. B. dot org after it's been about a year since your last contribution\nNorthwest public broadcasting take that couple of minutes today and renew your support your contribution keeps the station on the air and makes it more independent that's a good reason to renew your support\nEllen is burg that says that he's been a supporter since this poor college student days laid back in the Nineteen seventies Gordon really appreciate you in northwest public broadcasting is coming up on that one hundred years of service to the community and your pledge to support not only it's not your place of support today is a pledge to support for the future\nPeople from the from years past\nAre or who have pledged to make sure that this station is available for you today if you want the station to be part of the future for this this uh northwest\nYou need to pledge today eight hundred eight four to eight nine nine one or go to an W. P. B. dot org it's been this was of a future thing that keeps a northwest public broadcasting NPR public broadcasting on the air is because of view from people in the past\nMaybe what you're listening to today you're plus the day keeps it in the future thank you\nThank God the crew it alive and those were the words from it in for Russian President Vladimir ... after a Russian lawyer you rocket carrying two astronaut to the international space station failed during it today\nThat liftoff had proceeding smoothly for about two minutes then came in real life drama\n[noise]\nThe failure of\nThe crew American the Hague and Russian Alexei option and are safe and after an emergency landing in context on\nThree other astronauts are currently on board the space station and now they're returned home might be delayed for more on all of that we are joined by Canadian astronaut Chris Hadfield he served as commander of the international space station in twenty Thirteen and flew up there and back any Russian Soyuz capsule welcome\nThank you nice to be talking with you also\nSo this was going to be American Nikkei for time into these ... seconds for like the ocean and what kind of training would they have had to handle a situation like that\nOf them and training for decades Alexei as cosmonauts for quite a while as you say with space flight experience nip prior to being an astronaut was a test pilot in the U.S air force so that's an extremely risky complex job so they've been getting ready for this for many many years and then specifically for this launched\nWorking together for a couple of years we wring out every last thing that could possibly go wrong and the way the crew behave there was so Chris and professional right\nOn top of their game you would never know the vehicle was behaving so badly if you listen to all Alexei ... which dealing with\nYeah you're you're right you know the crew at first will be super focused in professional and doing their job but afterwards they're just going to be kind of mad because they didn't get to go to isn't based today you know kind of\nLike gosh all that preparation that but neither of them got hurt and they're they're back in the game and they'll have a chance to fly again by and I don't know who will fly\nNext it's way too soon to tell it's going to be a a long time to figure out what went wrong and then we'll have to start thinking about who should fly next what's skill sets should we need one is that going to be\nOf the repercussions that come from an event like today\nTell me what it will take what kind of conversations are going to have to happen to figure out how to move forward the\nFirst thing we need to do is find out what went wrong what failed in this rocket there's a lot of information people be able to sift through video of it but also the sensors on board then we need to see how can we fix it was it a design problem a manufacturing problem who knows\nAnd then once you know that you can fix it then you can set a timeline is that in three months from now than no big deal but if it's gonna take a year or two years\nThen we need other plans bowling is building a rocket that can take people to the space station or ... or a spaceship space sex is building a ship that can take people to the space station maybe they could be accelerated maybe they could fly before the Russians are going to be ready to\nNow that return could be delayed correct\nThey flew up in a different ... to the space station and sort of like a lifeboat or their their their ride home if they're they can come home anytime they want but if they ... to\nCome home than they are basically abandoning ship the space station would be empty and it's a big enough and complicated enough ship that after a little wild things start to go wrong and there'd be nobody there to fix them\nSo it really causes a lot of risk for the space station to leave it unmanned so people will be looking really hard at all of the limits and have to decide what the right trade offs are we don't know the answers yet but but it it's going to be a really complicated decision making process coming up\nChris Hadfield went the first Canadian commander of the international space station thank you very much for joining us today nice to talk of the also thank you\nAnd you're listening to northwest public broadcasting I'm Greg mills sitting right next to Tom cocaine and this is the fund drive for northwest public broadcasting\nNow we know the coming on the air and asking for money what might be a little different way to run a radio station but it is the way that public radio works and it's supported by the people who listen like you if you've already given thank you so much if you're ready to give do it now at N. W. P. B.\nThe reading getting homework done but you have all things considered in northwest public broadcasting on the radio maybe you're listening to it through the phone with the app\nYou know this is something that you as part of your day isn't it something that you think is worth of time and effort that you can contribute to it to keep it going for you and your neighbors support right now and what do you ... dot org or eight hundred eight four to eight nine nine one\nAnd you can feel good about the fact that if you if donors to N. W. P. B. that bring the music the news the arts so much more to the region\nShare the load with them become a sustaining member today with your checking account online they'll pay or credit card it easy and convenient provides ongoing support for the programs you love and you can continue it until you decide to make a change\nAsk about the standing membership when you call the eight hundred eight four to eight nine nine one that's eight hundred eight four to eight nine nine was Greg's\nTalking about the standing memberships maybe you want to do it like five or six dollars a month an easy one easy math I like this math ten dollars a month\nAt you know for twelve months that's a hundred and twenty dollars a year or you know maybe you're that type of person that likes easy math math but I didn't know is my favorite place them out Greg it's twelve dollars a month because that's twelve dollars a month or twelve\n\n\n\nDa\n\n\nDa\n\n[noise]\n[noise]\n\n[noise]\n\n\nYou do that\n\nUm\n\n... pipe dream quartet number fourteen called spring it's also the first of the most are dedicated to a friend and mentor so called the father of the string quartet us of heightened\nMozart's courts had performed here by the Emerson string quartet on northwest public broadcasting and W. P. B. dot org\nAnd Julie here thanks for choosing classical music to accompany your friday afternoon\nStill to come over the news in all things considered a guitar do wet between friends a couple festive work and some bussing in that courtesy of today's birthday composer find William it's three o five\n\nNorthwest public budgeting received program support from listeners Lakeview enrichment medical center serving the region at the new Richmond dot org developed connect patience with a comprehensive health information education and support including access to the online clinic and details about services classes and\nHe had ... Ninety point five quarks St Louis and can't W O Ninety point one cotton wood Grange bill NPR in classical music a community service will be Edward R Meryl ... communication that Washington state university [noise]\n\n\n[noise]\n\nAnd I have the nights bit of energy for friday afternoon this saber down from ... ... Guyana Eugene ... Philadelphia Orchestra performing here on northwest public broadcasting\nMusic is made possible on this station things to donations from listeners like you\nA big thanks to everyone who supports an W ... in a warm welcome to listeners who became members with their first time donations on super Thursday your dollars are hard at work bringing in firing music to you and your community\nIf you met to give but caught a little busy on Thursday he can still make a difference pledge now at N. W. P. B. dot org and again thank you for all you do to make public radio possible\nAnd for being a friend to chew and W. P. B. I mean surely do ya and here now is the work celebrating friendship it gets hard do wet composer Fernando store called the two friends\n\n\n\n\n... ... ... ... ... ... ...\n...\n... [noise] [noise]\n[noise]\n\n\n[noise] [noise] uh\n\n\n[noise] [noise] [noise]\n[noise] [noise]\n\n\n[noise]\n[noise]\n\nMm\nMm Mm Mm\n\n[noise] [noise]\n\n[noise] [noise] Mm [noise]\n[noise]\n[noise]\n\n\n\n[noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise]\nMm and then\nThey get [noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\n\n[noise] [noise]\n\n[noise] [noise]\n[noise] ah\nNo no no no\nNo\n\nThere in in\n\nBuilding in the building a new but\nKnow\nMm Mm Mm [noise] ... we're\nThem\n\nHow can you get tired you know performing here Robert ... the kind of ... than that\nNorthwest public broadcasting and W. P. B. dot org where you can find a playlist of today's music TGIF it's good to be with you on this Friday afternoon I'm ... [noise]\nI'm Sarah Snyder inviting you to join me for the next edition of early music now we'll hear selections from the musical events of the year Fifteen eighty nine\nLa Salle agree no music for the wedding of Verde non debating the Frisbee and I'm Lorraine\nPerformed by the\nNext time on early music now [noise]\nInto early music now to night at eight or to the repeat Sunday add to that is right here on N. W. ... NPR in classical music therapist\nWill become now to today's birthday composer ... Williams who was born on the day in Eighteen Seventy two it was one of the pillars of twentieth century British music ... had a lifelong fascination in interest in English focused on\nAnd then around well let's see Nineteen oh fourteen Nineteen oh six he was the editor of the English him do it\nHis alma mater Cambridge and this is the overture from that aspect of incidental music find Williams the Y. oh for sure performed by the English from the orchestra here\n[noise]\n\n\n\n[noise]\nYou know and and you wonder what does that sense of security that's now ... away at school principal in Panama City Florida where one resident tells NPR this whole town is destroyed today it's friday October twelve and it is all things considered [noise]\n\nI'm Mary Louise Kelly and I know it's Chang ahead to our date me\nShe didn't wear crews are working to replace pipelines\nTell you the truth I Am scared to death when they joined that gas or I don't want to be in this neighborhood\nAnd the cheating scandal rocks to wind world's ... I'm hoping to become a master ... space to do over there and going to have to once again and perform in the way an athlete in the ... first and he's\n\nLived from NPR News in Washington I'm jak sphere\nAs oil and gas workers begin returning the platforms in the Gulf the job of assessing the damage along the Florida Panhandle after hurricane Michael continues\nAnd some Gulf Coast communities just a matter of twenty miles appears to have made a major difference NPR's Greg Allen described to areas would appear to stain slightly less damage but they're still cleaning up after the storm\nWe visited Appalachian coal in East Point to communities that are the harder Florida seafood industry there are a little bit east of where the storm made landfall they didn't get as much when some of these other communities what they saw was a massive storm surge that came in and push buildings bought off their foundations destroyed many and did a lot of damage there and\nTo some buildings that are really at the heart of a string and other fishing in Florida\nTown of Mexico beach where Michael made landfall as a category forests\nPresident Trump visits the area next week president welcome the release of an American pastor who was held for more than two years in Turkey NPR's Scott Horsley reports Trump expects degree pastor Andrew Brunson at the White House this weekend\nTrump says he expects Andrew Brunson to get a full checkup in Germany on his way home to the United states but he thinks the American pastor is in good shape Brunson was arrested in twenty sixteen as part of a round up following the failed coup attempt against Turkish president regimen type or the one\nWe're very honored to have him back with us he uh\nHe suffered greatly but we're very appreciative do a lot of people a lotta people\nTrump says the administration made no concessions to turkey in exchange for Branson's release the White House spokeswoman says the administration remains deeply concerned about the continued detention of other us citizens in Turkey and around the world Scott Horsley NPR News the White House\nThe chance or North Carolina's flagship public university apologized today for the school's history of slavery chancellor Carol's fault acknowledging was slaves helped to build and maintain the University of North Carolina at Chapel Hill during a celebration of the schools two hundred and twenty fifth anniversary fault such actions should ever happen again\nAnd we're from university\nStudents in Seventeen Ninety five just Nineteen years after the founding of the U.S [noise]\nSocial networking site Facebook is out with new from figures on how many of its user accounts were hacked as part of a security breach disclosed two weeks ago\nOriginally Facebook instead as many as fifty million accounts may have been affected the company says the real number now appears to be more like twenty nine million the case of fourteen million of those accounts details like birth dates and home towns were exposed\nOn Wall street today the Dow closed up two hundred and eighty seven points to the NASDAQ was up a hundred and sixty seven points this is NPR\nSupport for NPR comes from NPR stations\nOther contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair a new episode every Friday on prime video\nIt's for all for the northwest public broadcasting News I'm Tom cocaine Canada is poised to legalize marijuana for adults nationwide next week the Canadian consulate this morning cross border travelers that it's still illegal to take part across the border in either direction correspondent ... reports\nColumbia is issuing licenses to marijuana growers and recreational pot retailers\nDoesn't make it okay to cross the border with Canada as the Canadian consul general in Seattle Brandon Lee says he's concerned drivers may forget and get in big trouble\nAnd nothing is changing as far as our border patrol on border security are concerned on both in the U.S had in Canada there are crossing north and how with candidate still remains illegal or\nLegal marijuana sales will start slowly NBC because only one recreational pot store is ready to open on the first day I'm Tom bonds the reporting\nState and county health officials say they are investigating a possible six the case of a rare nervous system just order that causes sudden limb paralysis in children\nThat condition is called the cutest lasted my light us or a FM which attacks the nervous system and can lead to arm or leg weakness and lots of muscle reflexes all of the children are six or younger and had symptoms upper respiratory illness the week before developing systems of a FM\nThe children live in king peers Louis so how much scheduled counties\nThe U.S Centers for Disease Control is trying to confirm the cases the CDC says that condition is not new but that there's been an increase in cases starting in twenty fourteen\nTo northwest public broadcasting news [noise]\nOur kids' lives\nHere from the principle of the school that was partially destroyed informant it's on all things considered I'm Tom cocaine good afternoon\n\nFrom NPR News this is all things considered ... Chang and I'm Mary Louise Kelly search and rescue teams are out in force along the Florida Panhandle they're looking for survivors of Hurricane Matthew\nWhich is now being blamed for at least Thirteen deaths according to the ... one of the towns along Florida's coast that was pummeled by Hurricane Matthew is Panama City emergency crews there are working to clear down trees and debris\nThe city is still without water without power and there is no time table for when those services might be restored NPR's Joel Rose reports the roof\nOf the St Andrews United Methodist church is still in place at the pews are still there where the back wall should be there is only blue sky\nWe're all in our little safe rooms one of my members them out and let them search word Feldman and just said young the [noise] search wears a\nPastor John blonde with sheltering inside the church along with two dozen other people when the hurricane hit the wind ripped two of the walls away the blunt didn't even hear it because the storm was so\nAnd uh have a very social service they claim that God as good\nAs we talk in what's left of the church a visitor arrives almost as if on cue\nI'm father Michael talking about life and I'm a write up here at St john's great uh we'd like off Iraq facilities ones 'cause we we didn't have that much damage\nFather Michael ... says his church just a few blocks away came through the storm relatively unscathed but talk well knows that was the exception in Panama City\nThat is going to take years for this place to get re established\nAnd that was kind of take months probably to get electricity back on Oprah doesn't take too long for water 'cause that's important\nCell phone service is sketchy there's no clear sense of wind power and water might be back on and the ... streets are still a tangle of fallen electrical wires twisted metal\nDowned trees [noise]\nThe storm Afridi two hundred year old old trees and towering magnolias saps tall pine trees in half\nJose Maria ... owns a landscaping business in Jacksonville he traveled here to work cleaning up the mess\nWhat a storm like this there's really no where to start basically you just got to come in and whoever yelling out for help from trying to help\nAh houses on livable their campaign with us [noise] um\nWe ... we just don't I Will take an hour\nIt's the days and weeks ahead that worry father Michael Douglas\nThe biggest problem is you have to come and that is when the those evacuated come back you know a lot of people are gone from here [noise] and uh when when they come back that's when there's going to be a lot to do\nCounty officials say help is on the way in the form of water and emergency rations they say residents who want to return to their homes can but if there's somewhere else they can stay for a while they should Joel Rose NPR News Panama City Florida\nAlright for more now on how Panama City it's coping after the storm we're going to go to Brett ... he's the principal of ... middle school they're in school suffered tremendous damage wall buckled portions of Ruth were entirely ripped away the gymnasium is essentially destroyed\nSupport for NPR comes from this station and from log men makers of go to meeting a collaboration meeting platform allowing people to connect around the globe to get work done learned more is go to meeting dot com\n[noise] from Tara data working to transform how businesses work through the power of data using pervasive data and tell us\nAnd from the sustaining members service NPR station it's\nAll things considered from NPR News I'm Mary Louise Kelly and I know that saying early this morning there was news from the Vatican that Pope Francis has accepted the resignation of Washington archbishop cardinal Donald Wuerl\nWorld had been under tremendous pressure to resign as a report that summer detailed the abuse of more than three hundred children in the Pennsylvania dioceses\nWorld was accused of mishandling several cases of abuse while at the diocese of Pittsburgh for over two decades\nAnd in Pennsylvania this morning the man who prepared that scathing horrific report Pennsylvania attorney general Josh peiro\nUrge state lawmakers to eliminate the statute of limitations for child sexual abuse the prosecution he's on the line now from Philadelphia Welcome to be with you thank you so I'm gonna ask you about your reaction to worlds resignation what went through your mind when you first heard the news today\nWill cardinal worlds resignation is a necessary step a given what the grand jurors uncovered about his role in the systematic cover up of child sexual abuse I actually second his comments about the need for greater transparency within the church I think what's missing here though isn't it now\nI'll I'll I'll leave it to the church is you know the the churches internal politics to them and their parishioners but I I Do not think that the people of Pennsylvania will accept that anyone proven to be part of this cover up should face no real consequences for that criminal conduct\nThat's exactly what I wanted to address because in a letter to cardinal Wuerl that the cardinal released today Pope Francis actually praised him a letter seems to suggest that the only thing cardinal world is guilty on in managerial mistake not covering up any crimes\nWhat do you think of that characterization by the pope\nI think that it is demonstrably false to suggest that then bishop world did not play any meaningful role in the cover up the church's own secret archives show the active role that bishop world played in it\nOkay I I Want to turn now to your calls for changing the current statute of limitations you you basically agree with four recommendations that the grand jury report articulated tell me about how you think the law should change\nIn Pennsylvania we uncovered three hundred and one predator priests sadly I could only charged two of them and if we lived in another jurisdiction where there was no criminal statute of limitations\nBut it's completely in eliminating the statute of limitations for criminal cases it is true that the longer you wait before you prosecuted crime harder the Cape become to prove witnessed it passed away memories fade evidence grown stale does any of that concern you as a lawyer\nOf course but the burden is always on us the prosecutors to bring that case and yes it is more difficult often times when the number of years goes by but it doesn't mean that we should be barred from bringing a case especially when the data clearly shows the children who were abused\nOften don't come forward right away and in fact the average age that a child comes forward to share their troops is when they turned fifty two fifty two and yet\nThe law here in Pennsylvania says that we couldn't bring a criminal case after the age of fifty and so we believe and the data shows that if it's going to take that much time for someone\nTo come forward we shouldn't be barred from prosecuting\nWhat your officers report laid bare in how a large institution and the ... the Catholic Church but there's so many other examples how a large institution can go to great lengths to cover up sexual abuse and to protect abusers does revive the statute of limitations get it that we did actually\nThe Catholic Church arguably the most powerful institution in the world constantly and consistently putting its own reputation above the needs of\nThe people they were there to serve in this case children I think there's a reckoning going on in this country right now about how we are going to or how much we are willing to hold powerful\nInstitutions accountable and I think you're seeing across this country with all that's going on with the me too movement the Kavanaugh hearings and The Cosby trial is is you're seeing more and more people stepping up and being willing to hold powerful institutions accountable and law enforcement\nPlays a unique and critical role in that process that's what we're doing here in Pennsylvania\nJosh appear out in Pennsylvania state attorney general thank you very much for joining us thank you [noise]\nSome of the last secrets from the Watergate scandal may soon be revealed\nA federal judge in Washington has ordered the national archives to review key documents and prepare for their release\nThe papers helped to advance the impeachment effort aimed at president Richard Nixon and scholars say they are relevant today as another special counsel investigating the current administration NPR national justice correspondent Carrie Johnson reports\nLaws when we succeeded which was first in history to get the courts to promote the grand jury report to go to the house Judiciary Committee because the committee would have had real difficulty in doing this work are way behind it hadn't gotten all the brown\nLeon Jaworski told an interviewer in Nineteen Seventy seven the document contained in detail live to the evidence the Watergate prosecution team had gathered\nWe called a road map in our office because last just up\nFor forty four years that road map remained secret under seal by the federal district court in Washington on orders of the judge who presided over the Watergate cases\nThat secrecy persisted to protect the grand jury's work but not for lack of trying in Nineteen Ninety seven Stephen ... was working for the independent counsel investigating President Bill Clinton base was looking for precedent for how a special prosecutor might send an impeachment referrals to Congress\nThe national archives let me see a lot of stuff from the Watergate special forces you to that was very interesting when I asked you to load math was set up to the house I lay on the worse if\nSaid no Bates tried again years later but the answer was the same no last month he and others petition the court\nInterest in Watergate that alone would be sufficient to justify releasing this material but there's real urgency in this instance to getting the road map on to the public\nRecord urgency because another special counsel is on the job now investigating the Trump campaign and one of the big questions about the end of Robert Mueller's investigation is whether he'll try to send to report to Congress or the public John's sale worked on Watergate as a young lawyer\nTwenty first century variation of the so called road that is something that the lower team is very likely considered\nSales box on the Watergate team was James corals to now serves as mothers deputy\nBut he says unlike Richard Nixon Donald Trump's legal team is likely to object ... any such material going to Congress\nTrump's personal lawyer Rudy Giuliani has already signaled he would fight in court to stop lawmakers from seeing that document meanwhile the battle over the Watergate roadmap could soon come to an end\nThis week judge barrel how ordered the national archives to review it and directed the Justice Department to get ready for his release Carrie Johnson NPR News Washington\n[noise]\nHe is not unprecedented particularly under George W Bush the president often voice displeasure with the Federal Reserve's monetary policy some of Trump's rhetoric though has been especially hard harsh you'll get a closer look at the four thirty five\nThe programs you enjoy I northwest public broadcasting or made possible with financial support from ... drug in hobbies located in downtown Moscow for the drive through window for pharmacy pick up\n... also offers this election of games gifts and more including educational toys from Melissa and dug in lego open daily and online at ... dot com [noise]\n... thank you to everyone who supports northwest public broadcasting in a warm welcome to listeners who became members\nWith their first time donations on super Thursday yesterday\nHere dollars are hard at work bringing stories of substance and inspiring music if you're meant to give a little but we're busy yesterday you know you can still make a difference if you can pledge now at N. W. P. B. dot org again thank you for all you do to make public radio possible\nAll right for some perspective on this we're joined by someone who worked at the fed for forty years until twenty ten Don cone with vice chairman of the fed board of governors thank you so much for coming in today for having me Earl usual it\nAnd particularly under George W Bush the president and its minister ration often voice displeasure with the Federal Reserve's\nA monetary policy that maybe didn't call the fed crazy no I don't know that doesn't sound like his rhetoric does it [noise] but since uh the Clinton Administration came in\nThey decided that it was best for the Federal Reserve and for the country not to be constantly harping on monetary policy so they could make their views known private lead to the chair and other members other decision makers but not with this public pressure\nOkay go up until now fed officials had been defending the fed is from the president attack but then today the president of the Chicago fad Charlie Evan he was quoted as saying it's fair to question the rate hikes still does have a point putting aside the president's rhetoric is it fair to question these right I\nIt's always fair to question whether the Federal Reserve is doing the right thing and a democratic society the Federal Reserve has to be able to defend itself uh with the elected representatives and the public I think it brings all the information to bear but it's a legitimate question always and the fed\nOn how the fed managing the economy could the president and how the way the fed to slow down the rate hike\nNo I don't think the president's words will affect what the fed is doing and I would note that the president has made some very high quality appointments to the Federal Reserve which makes me even more confident\nThat it will continue to do the right thing based on economic analysis information using the institutions well insulated from the political winds the ... attacks could be standing there I think is very well insulated I Do get concerned that if the president keeps up to the tax\nAnd others drawing him and so far there really hasn't been that he's putting the Federal Reserve into the middle of a very difficult polarized political situation\nSo I don't see\nAn economic riskier given who the decision makers are but I see a political risk and I think it's important for the Federal Reserve the have the confidence of the people of the United states that it is doing the right thing but it is a deliberate\nNonpartisan institution that's acting in their best interests like you're a little concerned that maybe comes right it could be affecting that trust among the man I think it could overtime\nThe Federal Reserve's oversight group why they're doing what they're doing and I think that as well as explaining to the American people I think that's the basic installation for the Federal Reserve\nFrom political pressure is understanding as Donald tone the former vice chairman of the Federal Reserve board of governors thank you so much for coming in today your walk I'm also bank you for having me on [noise]\n\nYou're listening to all things considered from NPR News\nMad Men creator Matthew Weiner is back with a new series for Amazon called the robot off it is an anthology series different cash different story and each episode but NPR TV critic Eric Deggans says the theories rarely matches the heady ambition of its creator\nEpisodes of the Romanoff that I've seen film like a collection of creative ... aimless indie films linked by single then premise at least one person in each episode thinks they're related to the ... the last royal family to rule on Russia\nWho's cared for by her American nephew Greg played by Aaron Eckhart and those cars racist classes then demanding reacting predictably when a Muslim woman is sent to work as a home health care aide\nI Need a cat if I'm not terribly\nThey emailed me or references she educated she's studying to be a nurse you know CPR first day she the best caregiver they have any you are by far the worst client\nI Hope to see whether when she grows up my apartment\n... claims a family connection to the Roma knobs lamenting the humble end of our once proud family line Greg is only relative left struggling with the caustic French girl friend who just wants to know what's going to die so they can have a opulent massive apartment in Paris all themselves to my\nFamily [laughter] Haiti even when\nThey need to the sad thing to be washed they claimed to meet a lot and I think keeps you from going in the case um eating in restaurants\nLet's see terrible French girlfriend doesn't want a baby nice Muslim caretaker shows up nicely America nephew likes or by the middle of this nearly Ninety minute episode you can guess where the story's going\nCorey stole is a sad sack has been in therapy with his wife played by Kerry bus Shea who wonders why he never wants to do anything with her\nI don't care what we do\nI Would do anything you want but\nYou do care because you make all the decisions what I Do in my spare time how many hours I work I went to a business is both of our okay but we\nBoth know that you're the boss and I have the employee id will only say that because it's true Sally we try not to say people always say anything right\nExcept he does kind of always blame her which causes issues in his job helping students prepare for standardized test when he confronts a not too bright kid who is fixated on getting into Harvard\nYou have to accept the reality and try to be happening is whatever\nYou get ill you're not listening Andrew the big secret\nIs nobody ...\nI came to protest perhaps\nEventually those character meets another woman he would very much like to spend time with during jury duty this story has an awful ending which mostly leaves you wondering why was forced to spend so much time with the Supreme Leon likeable people\nMatthew Weiner wrote and directed every episode of the Romanoff filming in beautiful locations across the globe there's also an ace cast with names like Diane Lane\nCan't manage the same trick here critics were only given three episodes in advance so it's possible the series gets better but so far the Romanoff feels like a glitzy showcase for mediocre stories with a tenuous connection to each other\nIt's disappointing second act and the guy who created one of the best dramas that history [noise]\nIt all things considered from NPR News and this is northwest public broadcasting\nThe controversy in the world of wine as twenty three new masters Somali gays have had their certification revoked after ... cheating scandal\nWill hear from the wind Bible author can make me all about the situation that's coming up next on northwest public broadcasting hurting the tries cities in Walla Walla and eighty nine point one eighty nine point seven I'm Tom cocaine [noise]\nWell if you are among the more than fourteen hundred listeners who generously donated on super Thursday yesterday thank you so much\nYou get will help to bring another year the programs you value now if you met to pledge but you just didn't get around to it don't worry about it you can still give at N. W. P. B. dot org do right now to end up all the TV dot org and make a pledge thanks [noise]\nA listener supported public service of the Edward Murrow College of communication at Washington state University in cooperation with the University of Idaho school of journalism and mass media [noise]\n\nAll the blue San Louis colored valley a dry cold front delight brings breezy conditions into Saturday would go up to twenty five miles per hour otherwise through the weekend and much of next week you can expect sunny days clear nights and dry weather with possible frost forming overnight and in the morning [noise] blows my thirties to low forties and I was in the mid fifties to mid sixties [noise]\nYou are listening to northwest public broadcasting on K R S a Ninety One point seven FM Moscow Pullman a listener supported public service of the Edward Murrow College of communication at Washington state University in cooperation with the University of Idaho school of journalism and mass media\n[noise] [noise] [noise]", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Moscow", "day": "12"}