{"month": "10", "state": "GA", "station": "WNGH", "content": "Hang out here on gp looking forward to sharing music working again type [noise]\nFor now take care and get\n\n\nThank you for tuning into listener supported ... it's our fault fungi when we all joined together to keep the program that you listen to enjoy on the air right here on gp day\nI'm Leah Fleming inviting you to join us at the G ... dinner with a convenient affordable monthly contribution it's easy for you and it's best for the bait you can also make a one time gift of support what counts most is that we hear from you\nRight now go to ... dot org and click on donate our policy that eight hundred to two to four seven eight\n[noise]\nWas Ninety seven point seven FM double your G. P. B. S. W. A. G. P. H. D. Rome part of Georgia Public broadcasting radio network [noise]\n[noise]\nIt looks Mendelssohn linked to kind of a charmed life the only drawback was that that life was relatively short but he came from a supportive family who had means they had a an intellectual tradition and artistic tradition in their family\nMendelssohn himself was encouraged to exercise his what was becoming obviously a genius for music [noise]\nAnd when he wanted to go on the grand tour [noise]\nDad had plenty of money to send him a kind of father ship it took him to Italy which yielded a symphony and some other pieces it took him to Great Britain which yielded\nA symphony and other pieces that sympathy from Great Britain the Scottish symphony is in the hour head\nBlind from NPR News in Washington I'm chase Stevens and attorney for a woman accusing Supreme Court nominee Brett Kavanaugh look past sexual assault is condemning President Trump for making fun of his client NPR's Giles Snyder is more reaction to Trump's remarks at a rally in Mississippi\nAttorney Michael Brown which is responding to President Trump's speech in ... in Mississippi and what she was cheered by the crowd when he did his version of the back in ...\nIt's a city attorney Michael Brown which is responding to President Trump's speech and south haven Mississippi and what she was cheered by the crowd when he did his version of the back and forth during Christine Blasey Ford's testimony before the Senate Judiciary committee\nWhat was it and I don't know where\n[noise] I'm Wondering what I don't know but I haven't been\nFollowing Trump's speech problem which took to Twitter saying it was a vicious violent soul was attack on Fort gold for to remarkable profile in courage and President Trump of profiling cowardice\nTrump is planning to appear to more campaign rallies this week is he seeks to boost Republicans November's midterms ... NPR News\nSecretary of state Mike Pompeo is heading back to North Korea to advance talks on denuclearization NPR's Michele Kelemen reports that Pompeo is also said to visit Japan South Korea and China during his weekend trip\nIt's would be his fourth trip to North Korea in less than a year and State Department spokesperson Heather Nauert says he hopes to meet the north Korean leader Kim Jong good who has exchange letters with President Trump\nI hadn't been privy to all the letters and the communications uh that have gone back and forth but obviously these conversations are going in the right direction and we feel confident enough to hop on a plane or to head there to continue the conversation\nNow where it says the U.S wants to other countries to maintain sanctions and pressure on North Korea in the meantime though China and Russia are calling for an easing of sanctions to deport diplomacy Michele ... NPR News the state department\nChairman Jerome Powell says he sees no need to abandon the central banks policy of gradually raising interest rates piles as a policy reflects current economic conditions\nWill remain an extraordinary times [noise] oh I'm going to see a gradual interest rate normalization reflects our first ... being able to risks that come with an extraordinary times so it was to extend the current expansion maintaining maximum employment\nAnd low and stable inflation\nSo distraught trying to strike the right balance by not raising interest rates to quickly to avoid recession or too slowly which could lead to higher inflation it made the comments in Boston during his speech to the annual conference on the national association of business economics\nAmazon says it's hiking salaries for all its employees beginning next month bottom earners will make at least Fifteen dollars an hour the e commerce giant also says it intends to push Congress to\nAll these employees beginning next month bottom earners will make at least Fifteen dollars an hour the e commerce giant also says it intends to push Congress to increase the federal minimum wage which is seven twenty five an hour or less than the amount that Amazon is offering this is NPR News\nNew York times is reporting that President Trump received at least four hundred Thirteen million dollars from his father or the decades and not just a one million dollar loan he claimed he obtained got started in business\nThe times reporter ledge as much of the money passed down to Trump and his siblings was the result of tax evasion an outright fraud Charles Harder and attorney for Trump condemns the report calling it extremely inaccurate [noise]\nElection as be gone in a college basketball bribery case in New York NPR's Barbara ... reports on the first of three federal trial stemming from an FBI investigation into corrupt recruitment practices\nAnd aspiring sports agent and two former Adidas employees are pleading not guilty to wire fraud and wire fraud conspiracy charges in a corruption case involving some big names in college basketball\nThe defendants allegedly lord high school athletes to play basketball at for universities\nMiami Kansas ... in North Carolina state by paying them or their families all those schools are sponsored by Adidas the indictment also alleges that the sports where company expected players to sign them up on training professional\nCollege players are not supposed to accept payment in any form\n... NPR News Washington\nThe Democratic mayor of Kansas City Missouri says he's dropping his bid for reelection to deal with post traumatic stress and depression Jason Kander says after eleven years of trying to outline his problems he's decided to confront them the former army intelligence officer says he's become the process of getting treatment\n... NPR News\nIn Washington\nSupport for NPR comments from NPR stations other contributors include vivid St Petersburg Clearwater along Florida's Gulf Coast offering artistic draws including St Pete's Dali museum but your who collection and the museum of fine arts more er visits saint Pete Clearwater dot com\n\nThis is listener supported classical music ... trillion tonight thank you for listening and of course\nThe conclusion and the balancing of that equation is for supporting the station as well\nIn tonight thank you for listening and of course\nThe conclusion and the balancing of that equation is for supporting the station as well\nFelix Mendelssohn simply number three the Scottish symphonies just ahead after this\nBit of music which originally was um incidental music\nByron Copeland for play by ... Shaw a\nYou may remember him from the mini series in what decade was that now the\nLate seventies coal rich and poor man he also wrote a novel called the alliance and a play called quiet city night talked to various people in New York Darren ... provided this music for quite city here in ...\n\n\n\n\n\n\n\n\n[noise]\n\n\nAre\n\n\n\n\n\nAll over the world\n\n\n\n\n[noise]\n[noise]\nNo\n\n\nWhoa\nOr\n\nWe're\n\n[noise]\n[noise]\n[noise]\n\n\n\nPitches\nMember supported G. P. P. we're in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my GP beat and Georgia Public broadcasting\nTeen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my GP beat and Georgia Public broadcasting on Facebook thank you for listening\nMy I'm there has been my favorite is an interview moments when the wind to promote the teacher to first hearing is definitely like bubbly\nExciting and welcoming so I thought she on camera\nYour support the exciting welcoming you loved\nTo G. P. B. dot org and click donate\n[noise]\nNinety seven point seven double your G. P. B. S. W. GBH three room for the Georgia Public broadcasting radio network [noise]\n[noise]\nBelieve it or not the time of year that many call the holidays\nMaybe this year we'll all be better prepared [noise]\nDoes your family like to do when they get together during\nThe holidays I mean besides [noise]\nWould you be a game playing family\nCards charade [noise]\nClub WC composed a ballet about games called draw in Nineteen twelve it starts with a tennis ball [noise]\nAnd you hear what happens next in about forty minutes\nHere on music through the night [noise]\nLive from NPR News in Washington ...\n[noise] a ground is I'll have to be trying to think we want Kavanaugh's President Trump addressed a political rally there late Tuesday president mocked the woman accusing Supreme Court nominee\nBrett Kavanaugh of sexual assault when they were teenagers Trump also poked fun at Senator Dianne Feinstein is reaction to accusations that she leaked documents on the nominee\nNo I don't think I went to the doctor [noise]\n[noise] really [noise] [noise] [noise] we didn't really to\nThe full US Senators to vote on the counting on nomination this week after the FBI completes a one week investigation of the sexual misconduct allegations against him\nA lawyer for President Trump is disputing a New York times special report suggesting that the vast Trump empire was built on fraud and tax evasion Charles Harder calls the report extremely inaccurate\nTime sites taxing financial records dating back to the Nineteen nineties and passed employees and advisors alleging Trump and his siblings set up a sham companies to help their father ... millions of dollars in taxes\nOrders as minor as state issues were settled with the IRS and the New York taxing authority over a decade ago and that Trump had virtually no involvement in those matters\nWhite House economic adviser Larry Kudlow is defending the administration's new trade agreement with Mexico and Canada\nAs NPR's Scott Horsley reports that agreement drew criticism from the conservative editorial page of the wall Street Journal\nKudlow there was a former CNBC commentator calls the Journal's editorial writers dear friends but he takes issue with their criticism of the trade deal nothing is perfect Kudlow says the deal provides an uptick to NAFTA which would affect a quarter century ago\nWe've been proved to supply chains of terrorists we notice a tear free zones and in effect sly James would be their\nBusiness will not be disrupted all those threats have not come to pass so I\nCould do all the presidents are spreading\nNever mind that it was the president himself who threaten cross border supply chains with promises to tear up NAFTA if you didn't get his way Kudlow stumbled over the name of the new NAFTA which Trump insisted on rebranding as the U. S. M. C. A. Scott Horsley NPR News the White House\nRemnants of a former hurricane drenched parts of the southwest Tuesday cage ACC Casey Kuhn has more\nMore than two inches of rain fell in the Phoenix area and they can get the ninth what his day ever recorded in the desert city\nThat much rain left many roads flooded and several people were rescued from being stranded in their waterlogged cars thousands were without power early in the day no one has died but a sinkhole opened up on a city street and roads and parks closed because they're underwater\nStudents got not a snow day but a rainy day here it's half a dozen local schools closed and the community college system shut down because of the weather for NPR News I'm Casey Kuhn in Phoenix\nThis is NPR News\nAnd the community college system shut down because of the weather for NPR News I'm Casey Kuhn in the next\nThis is NPR News\nFor California men are facing charges in connection with the violent unite the Right rally in Charlottesville, Virginia last year as Sandy Hausman reports from member station WWNO V. T. S. all for our members of a white supremacist group that allegedly trains and deploys militant protesters across the country\nUs attorney Thomas ... says the men took part in it tiki torches rally at the University of Virginia on August eleventh of twenty Seventeen and the following day committed several assaults\nTheir hands taped and ready to do street battle they committed multiple acts of violence including punching kicking had boating and pushing numerous people in Charlottesville\nCollins says the same man had engaged in three other protests in California all four members of a racist and anti Semitic group called the rise above movement they face up to ten years in prison if convicted for NPR News I'm Sandy Hausman in Charlottesville\nThe food and Drug Administration says it sees more than a thousand pages of documents on sales and marketing practices at each cigarette giant Joel lab's last month the FDA said he was considering a ban on flavored east cigarettes\nSigning an epidemic of miners using the product according to Wells Fargo Joel controls more than Seventy percent of the cigarette market\nShares of tobacco companies including Philip mores altruism British American tobacco jumped after the FDA announcement\nOn Asian market shares are mixed up one percent in Tokyo following a down day on Wall street\nI'm Shay Stevens NPR News in Washington\nSupport for NPR comes from the end he Casey foundation developing solutions to support strong families and communities to help ensure a brighter future for America's children more information is available at ... dot org and listeners like you who donate to this NPR station\nOr the ... from formative all done says\n[noise] you're very welcome to the music and music through the night my name's Andrea lane\n[noise] this is ... and he was a good enough violinist apparently to lead his school orchestra and he loved playing music at home and his sort of domestic setting with the family presumably and friends to its probable that he proposed\nThe artist and he loves playing music at home and he's sort of domestic sensing timely proceed plant Frank probable that he performed speech we're going to be here it's called the pet peeve for five and piano\nOn this recording than your parents climate the pianist I start to find the dream team\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n\n\n\n\n[noise]\nA long\n[noise]\n\n\n\nCool [noise]\n\n\n\n[noise] [noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\nJust [noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n\n\n\n\nOoh\n\nOoh\nAnd\nUm\n\n\n\n\n\n\n\n\nBut they\n\n\nIn\n\n\n\nSweet number one the not turn from that by ... ... what's the New Zealand to the orchestra conductors dies on the east coast\nSweet number one the not turn from that by Jews my and I was in New Zealand symphony orchestra conductors ... awful\n[noise] that'd be stay in a kind of a fringe mode if you know what I mean music buy clothes WC now this is ... where's your games is the title it's about like the scene of the garden at dusk a tennis ball is lost a boy and two girls are searching for it they look for it\nThey coral they call it all gets a little bit dark another tennis ball is thrown and there are thrown by that they disappear at the end it's interesting music and it's paid for you by the French national radio and TV orchestra [noise] [noise]\n[noise]\n\n\n\n\n\nOh did you see the ballet score July or game for the French national and radio and TV orchestra\nThis is member supported G. P. B. where an Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening this this listener supported gp beep Hi there I'm Ricky ...\nAnd my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening this this listener supported\nTPP Hi there I'm Ricky ... inviting you now to join the public radio family listeners like you who value TPP is a source of news conversation and entertainment make the programs you enjoy possible that's precisely why we're coming to you now during our fall\nFund drive please go now to chief TB dot org and clicking donate at the top of the page\nOr call us at eight hundred to two two forty seven eighty eight here support right now with any amount is so important and banks\n[noise]\nNinety seven point seven FM W. A. G. P. B. S. W. A. G. P. H. D. rural part of Georgia Public broadcasting radio network [noise]\nOoh\nI have a secret to share\nSome of my favorite music hasn't find a great classical masters his music I've studied and played for years and [noise]\nMy favorite music is moving music\nThere is something about the linking as a good time with music such suits that [noise]\n\nMusic was composed to the company and particularly moving emotional and true story made into a film and scored by a composer who meant to real people involved and took great care with music [noise]\nThat said there's something that I don't like about the score\nAnd I'll share that with you later this hour [noise]\n\nFly from NPR News in Washington I'm Shay Stevens\nPresident Trump has mocked the woman who says Supreme Court nominee Brett Kavanaugh sexually assaulted her when they were in high school as NPR's Miles parks reports the crowded and Mississippi rally lap and cheered as Trump pretended to act out Christine Blasey Ford's testimony at a Senate hearing\nChristine Blasey Ford said last week that she could remember that she had only one beer the night she says Supreme Court nominee Brett Kavanaugh assaulted her\nPresident Trump's seized on that fact at a rally in South even Mississippi know what I mean she couldn't remember other details Trump acted out both sides of Ford's rational testimony to last and applause from the crowd how did you get home\nTo ... you know what I mean she couldn't remember other details Trump acted out both sides of Ford's congressional testimony to last and applause from the crowd\nHow did you get home I Do remember how'd you get there I don't remember where is the place I don't remember how many years ago was when I don't [noise] after\nFour testified last week however Trump called or a quote very credible witness the president also said Tuesday but it's a very scary time for young men in America Miles Parks NPR News\nThe white Chicago police officer charged with murdering a black teenager testified on his own behalf Tuesday as NPR's Cheryl Corley reports the officer told jurors he would not have fired his gun if the teen had obeyed police orders\nAnd twenty fourteen Jason Van Dyke joined other police officers answering a call about someone breaking into vehicles\nSeventeen year old ... McDonald was walking on a busy Chicago street he had a knife and didn't drop it after police ordered him to do so the other officers were waiting for a taser when Van Dyke arrived video shows McDonald walking away but bend I testified he thought officers were under attack he shot McDonald sixteen times\nHe couldn't ... churn and walked in the opposite in Russia and all you could have drawn a nice way to do it All right and then their\nVan Dyke is the first Chicago police officer to face a murder charge for an on duty shooting in decades Cheryl Corley NPR News Chicago\nAid is trickling into areas crippled by the devastating earthquake and tsunami on Indonesia's ... the island the official death toll from friday's disaster exceeds twelve hundred and time for finding any more survivors is running out\nAs he toured hard hit capital Palo Tuesday Indonesia's president to there's a lot of work to be done but that conditions are improving\nAnd NPR's Julie McCarthy made her way to one devastated area by traveling with an army eight and security convoy\nWhere there's a high that hug the cold does we may know she'll follow the roads are decent condition it started to rain or which sort of added to the misery here there's not a lot of traffic coming\nOut um which you would have expected because a lot of people are trying to leave however\nThere is no gasoline to do that and so people really there's this feeling attract\nJulie McCarthy reporting this is NPR News\nSecretary of state Mike Pompeo will return to pee on young Saturday for denuclearization\nAnd this is NPR News\nSecretary of state Mike Pompeo will return to pee on young Saturday for denuclearization talks with North Korea's leader Kim Jong ... it'll beep on pales fourth trip there since spring he's expected to press Kim for progress on promises made during the summit with President Trump in Singapore\nNorth Korea has said it once relief from international sanctions before making any commitments to end its nuclear weapons program the state department says Pompeo will also traveled to South Korea Japan and China\nDuring his weekend trip rising democratic storage Jason Kander says he's ending a bid for political office in Missouri to concentrate on treating as post traumatic stress disorder NPR's Scott Detrow has more on candor surprise announcement\nKid or narrowly lost a bid for Senate in twenty sixteen but the young democratic veteran made an impression the former Missouri secretary of state who served in Afghanistan spent the past two years traveling the country campaigning for Democrats and advocating for voting rights in June he announced he would run for Kansas City mayor\nNow that's all on hold in a blunt statement Cantor says he had repeatedly ignored warning signs of pie TST but things have gotten worse and he's recently had suicidal thoughts\nCanada right after eleven years of trying to outrun depression and P. T. S. D. symptoms I have finally concluded that it's faster than me he's now starting treatment through the department of Veterans Affairs and says he can't work on himself and run a campaign at the same time Scott Detrow NPR\nNews ... stock market shares a mostly lower following a down day on Wall street this is NPR News\nSupport for NPR comes from dream wave maker of luxury massage chairs from Japan with Shiites viewpoint detection and sixteen program to massages including warning night and stretch sessions retailers nationwide more a dream wave chair dot com Andy any case the foundation\nAbraham\nWelcome to music through the night my name's Andrea Blaine good to have your company [noise] talking casual now which is always\nA wonderful thing I think the sound of the guitar is terrific with an orchestra the orchestra and this performance as the London symphony orchestra and I said so if this is the guitarist and a performance of my customers ... today goes ... number one\nThis is the guitars and a performance of Mario ... to ... go get architectural number one or\nNa na na na na na\n\n\n\nNo no no\nNo no no\nBoom\nBoom boom boom boom boom boom boom boom boom boom\nBoom boom\nBoom boom and are are now and November\n[laughter]\n[laughter]\n\n[noise] like a dark and ... by Mario customs and we have to go in terms of a number one that was nice too so you pass the guitarist put the London symphony orchestra Luis Antonio Garcia and viral conducted\nThis is listener supported classical music music through the night today's classical music is also supported by buried financial part to finding families businesses communities and institutions since Nineteen Nineteen I W Baird dot com has more information\n[noise] [noise] [noise]\n\n[noise] [noise]\n[noise]\n\n[noise] [noise]\n\n\n\nYou know by George pretty Kindle his contract to uh do we\n[noise]\nGetting down by George predicts his contract to uh do we ...\nNumber three is coal back because they have not one but two groups or Cory climbers oh wouldn't it needs to be joining during playing off against one another it's performed in this recording with the economy of each music Christopher Hope would conduct\n\n\nAnd those can turn to for to orchestras number three with the Academy of music let like Christopher how would\nI Would have been a film music now I Do love film music and uh I like don't you dare try is an\nAward did film composer so his music is lovely and very suitable for the film Philomena which is based on a true story he actually met the woman I mean and\nYou think is last night and very suitable for the Phil ... which is based on a true story he actually met the woman I mean and spent time getting to know the story\nIt's an Irish story however in my beef with the score is that it ... years old colors of Irish music that said it's a lovely score the scores Philomena here's the sweet\n\n\n\nNa na na\nNa\nNa na\nNa na\nWell\nI'll tell\n\nOh\n\n...\n\n\n\n\nSupported TPP we're in Eighteen station radio network you can listen online at ... dot org and you can find us on Twitter at my GP beat and Georgia Public broadcasting on Facebook thank you for listening\nOne recent highlight conduct you're describing the stresses of things\nThank you for listening [noise]\nOne recent highlight conductor describing the stresses of seeing\nReally tricky music and you've got to get to the end of it such that the final Tam Tam crash and the big explosion of the Death Star happened up the right moment [noise]\nYour support keeps the insides of music you love I'm here for you\nPlease go to ... dot org and click donate\n[noise]\nWas Ninety seven point seven FM double your G. P. B. S. W. GBH leave room for the Georgia Public broadcasting radio network [noise]\n\n... any divorce adds up ... with all kinds of the title character is a water ... who wants\nTo tell them Marshall man that she loved him and ask for them to help her\nShe sings to the moon has become\nHas been called a radiant morning\nBecause in the process of getting close to the man she loved to gives up more than is good for her it is an all too familiar tale\nA very very beautiful piece of music [noise]\nI'm Andrea Blaine and this is me six through the night to hear the tune that result kissing time\n\nLive from NPR News in Washington I'm shape Stevens Senate majority leader Mitch McConnell says a confirmation vote on Supreme Court nominee Brett Kavanaugh will be held this week NPR's Kelsey Snell reports that McConnell expects the FBI will soon completed supplemental background check on Kavanaugh\nMcConnell said the FBI is working quickly to investigate claims of sexual misconduct by cabin on the bureau has until friday to complete that work but McConnell expects a report quote soon\nIt'll be made available ... each center dose\nAnd only ...\nBe allowed to look at it that's the way the reports are always handled\nMcConnell says it will be his decision when to schedule it confirmation votes\nWe'll be allowed to look at it as a way to reports are always handled\nMcConnell said it will be his decision when the schedule a confirmation vote some Republican senators and many Democrats say they would prefer for the public to have access to that report they say it could avoid confusion or controversy over the findings Kelsey Snell NPR News the Capitol\nThe secret service says it's investigating a suspicious ... that someone tried to send to President Trump NPR's Scott Horsley reports that it is one of several dubious letters intercepted in the Washington area this week\nThe all the rest of President Trump was received on Monday but at the secret service says it never made it inside the White House letters addressed to the president are routinely processed and screamed at an offsite facility\nThe secret service as any threats directed at the present are treated seriously and that it's working with law enforcement partners to investigate the batter the FBI is also testing to other packages that were intercepted at a Pentagon male sorting facility those pieces of mail contained what law enforcement called a suspicious substance\nScott Horsley NPR News Washington\nFederal Reserve board chairman Jerome Powell says he sees no need to abandon the central banks policy of gradually raising interest rates palaces the policy reflects current economic conditions\nWill remain an extraordinary times ongoing policy of gradual interest rate normalization reflects our efforts to balance ... will be inevitable risks that come with extraordinary times so it was to extend the current expansion while maintaining maximum employment\nAnd low and stable inflation\nPalaces the fed is trying to strike the right balance by not raising interest rates to quickly to avoid recession or too slowly which could lead to higher inflation he made the comments yesterday in Boston during his speech to the annual conference and the national association of business economics\nAmazon says it's hiking salaries for all its employees beginning next month bottom earners will make at least Fifteen dollars an hour the e commerce giant also says it intends to push Congress to increase the federal minimum wage which seven twenty five an hour less than half\nAmazon's amount and Asian stock market shares are mostly lower you're listening to NPR News [noise]\nLess than one week after an earthquake and tsunami devastated ... Indonesia a volcano has a right to it on the same island there are no immediate reports of evacuations\nOne week after an earthquake and tsunami devastated ... Indonesia a volcano has a robbed it on the same island there no immediate reports of evacuations amid ongoing efforts to find more quake survivors many roads and the earthquake zone are blocked and communication lines are down\nA district land too hard hit areas where the un humanitarian offices sheltered clean water food and emergency medical care are desperately need it [noise]\nAnd South Dakota a Catholic priest is facing accusations of sexually assaulting a minor in South Dakota Public broadcasting Lee ... reports the accused has been in the rapid city area for less than a year\nLocal law enforcement arrested thirty eight year old John ... on suspicion of sexual contact with a minor the investigation began over the weekend when the alleged juvenile victim came forward\n... served as a temporary priest in Rapid City area since early summer the rapid city Catholic diocese says it will cooperate with the investigation for NPR News I'm the ... in Rapid City South Dakota\nFacebook is being sued by a woman who claims of social media company enabled the sex traffickers who recruited her when she was Fifteen\nAny McAdams an attorney for the un identified planted says her client was befriended by another Facebook user who gained the trust and promised her a modeling job the case file in Houston Monday Sikhs at least a million dollars in damages\nAnd also the owners to to Houston hotels and a website shutdown earlier this year or allegedly posting ads for sexual services\nI'm Shay Stevens NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include home advisor matching homeowners with home improvement professionals for a variety of home projects for minor repairs to major remodeled homeowners can read reviews of local pros and book appointments online at home and visor dot com\nTo not act\nVery welcome to music through the night we have a Facebook page check that out there is always different things happening there my name's Andrea lane really happy to be here\nThat are Zach's opera result is about singing or\nRather its about what happens when you can't sing a bit like the story of the Little Mermaid if you knew what result is Walter ... and she gives up her voice so she can she can live on land and be United with the prince but he is some kind of put out when\nSo her voice so she can she can live on land and the United with the print but he is some kind of put out when his bride to be\nOr soccer can't say a word so she decides to marry a foreign princess instead and were soccer obeying which is ... is doomed to live in the ...\nOn a lake forever it's a sad story very beautiful music this is the song she sings [noise]\nTo them [noise]\nA trial soprano [noise]\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\nToo and\n\nGirl or\nA\n\nAnd ...\n\n\nAl\n\n\n\nTell us Charles Moore and an identical meal the piano and you're on a spouse that channel ... number one right here on music through the night\nNa\nNa\nNa\n\n[noise]\nThe music now by march ... when his noble and sentimental Walt since we first heard back in Nineteen eleven there were actually boos and catcalls because the audience was expecting some simple or from a well then what Roosevelt had written\nNowadays a wolf says are among his most popular pieces so things do change their play dress now but the Minnesota Orchestra conductor ...\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\nAnd\n... [noise]\n[noise]\nThere is a wonderful world of dance that was noble and sentimental wall says with the Minnesota Orchestra led by ...\nThis is members supported gp Pete were in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening\nThank you for tuning into listener supported G. P. B. and most importantly thank you for your support [noise] I'm I'm Barclay and it's our fault fund drive a reminder that it's your support it allows us to bring you the programs are GB that matter to you day in and day out\nSo right now while you're listening and thinking about it please do your part at whatever level is right for you\nGo to a gp beat out Oregon click donate or called eight hundred\nTo two to four seven eight\nThank you so much for your supportive GDP [noise]\nNinety seven forty seven FM double your G. P. B. S. W. A. G. P. H. D. role for the Georgia Public broadcasting radio network [noise]\nOr\nThese days it seems that a lot of people want to be in the spotlight celebrity is big business [noise] everyone wants to be famous [noise]\nThat actually was not the case for the super ... on and off\nWhen he was given concerts and amazing audiences with his powerful technique\nHe didn't suit being\nLate and smile much on stage he looked stern head of hair cut the made him look like a convict\nBesides all of that but he really wants to do is compose [noise] here the result of that in less than half\n[noise]\nLive from NPR News in Washington ... Stevens [noise]\n\nCrowded sounds even Mississippi has evolved Kavanaugh was President Trump addressed a political rally there last night [noise] some people in the audience laughter cheered when Trump mock\nThe woman accusing Kavanaugh of sexual assault decades ago Trump also poked fun at Senator Dianne Feinstein reaction to accusations that she leak\nWhen Trump mock the woman accusing Kavanaugh of sexual assault decades ago Trump also poked fun at Senator Dianne Feinstein reaction to accusations that she leaked documents on Kavanaugh\nNo I don't think I lost weight [noise] [noise] [noise] [noise] no we didn't like the\nSenate confirmation vote on Kavanaugh Supreme Court nomination is expected this week after the FBI complete supplemental background check\nThe New Haven Connecticut police department has released a report naming Brett Kavanaugh home in a decades old bar fight as W essay choose Cassandra bachelor ... explains the report shows one person was arrested over the incident that another was sent to the hospital\nThe report describes a night on September ... Nineteen eighty five where cabinet and his friends got into an altercation with another patron officer David heartening as with the New Haven police department\nWhat is alleged regarding the circumstances of you through\nIce someone\nSomeone else through glass of the same person on the plus a victim of the here and that first one was like a hospital\nHartman says Kavanaugh was part of the investigation but not arrested he says his department deals with this kind of assault on a nightly basis in a college town with about Ninety bars for NPR News I'm Cassandra Adler in New haven\nThe Pentagon says it's detected a suspicious substance on to ... that arrived at its mail screening facility the tales from NPR's Greg Myre ie\nThe Pentagon says the envelopes were discovered on Monday at the building where all incoming letters and packages are checked the building is on the Pentagon grounds but not inside the Pentagon itself\nThe FBI says its agents took control of the two letters on Tuesday Morning and the bureau is conducting a more detailed analysis\nNeither the Pentagon or the FBI has officially identified the suspicious substance all other male that arrived at the Pentagon facility on Monday is currently under quarantine Greg Myre ... NPR News Washington\nThe food and Drug Administration says it sees more than a thousand pages of documents on sales and marketing practices at ease cigarette giant jewel lab's last month the FDA said it was considering a ban on flavored e cigarettes citing an epidemic miners using the product\nAccording to Wells Fargo jewel controls more than Seventy percent obese they read market yesterday's announcement\nCigarettes citing an epidemic miners using the product according to Wells Fargo jewel controls more than Seventy percent of the easier at market yesterday's announcement sent shares of tobacco companies including Phillip Morris British American tobacco and inferior brands hire this is NPR News [noise]\nThe last of this year's Nobel Prizes for science this will be announced this morning each year top researchers are on her tour advances in studying how molecules combined and interact the prize is roughly one million dollars\nLast year's winters where us with and British researchers who developed a microscope technique that let scientists the details of the molecule that Dr life [laughter]\nThe clergy abuse scandal has apparently hurt the pope's standing among Catholics in the United states NPR's Tom Gjelten says a new survey from the Pew Research center shows that confidence that the pope has fallen sharply in the last few months\nThree years ago a Pew survey found more than sixty percent of us Catholics having a very favorable view of Pope Francis no it's half that just thirty percent and clearly it's his handling of the clergy abuse scandal that has disappointed the pope's followers\nSix of us Catholics say his response to the problem has been fair or even poor the slide and popularity is across the board among Catholic men and women alike old and young those who attend mass weekly and those who don't\nHave that trend holds for the u._s. public as a whole until now Americans thought more highly of Francis set of Pope Benedict his predecessor now they're on the same level Tom Gjelten NPR News\nI'm Out two hundred twenty five million mobile devices across the U.S will receive a test emergency alert at two Eighteen Pete and eastern time today famous says it's the first nationwide tests for wireless phone emergency [noise] this is NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include vital project started supporting the museum of modern art in Manhattan where jets and dance theater that work is never done is on view and includes weekly performances in the ... more ... org\n\n[noise] thank you so much for joining me my name's Andrea Blaine ... music through the night Saturday wrestling and I was a superstar piano sell us but he really wanted to compose and he did that and you're going to hear one of his face\nPlain and the music through the night Saturday wrestling and I was a superstar piano solo but he really wanted to compose and he did that then you're going to hear one of his famous piano concerto right here in about twenty minutes\nBut before that music by Beethoven this is the sex for two horns and strings the ... cortex is joined by ... on the horn\n\n\n\nLike that\nOne\n\n\nAnd\n\n\nMm\n\nThat's just like to\n\n\n\n\n\nAnd\nThing going on over\n\nThey\n\n\nWell what's\n\n\n\n\nNo\nWhen ...\nWhen I was\nLike whoa whoa whoa whoa\nPut\n\n\n\n\n\n\n\nEven\n\nBeethoven's except for two horns and strings like ... we're joined by Herman Bowman ... off on horns\n[noise] you're listening to music through the night listener supported classical music plays classical music is also supported by western hotels and resorts dedicated to empowering your wellbeing\nWhile on the road with signature wellness programs designed to help you stay in control while traveling west and let's rice find out more at West and dumped come\n[noise]\n\n\nMy name's Andrea lane and this is music through the night\nBasic now by Sergei ... if he really wanted to be a composer but he was a much salt after pianist and that golf in a way of his composing ambitions even so he managed to write a lot of music in the end inevitably bunch of that was for the piano\nIn addition to his wonderful Rhapsody on a theme of ... he managed to compose for piano concerto so this is the last and I think probably the most adventurous of them piano concerto number four\nIt can pose for piano concerto this is the last and I think probably the most adventurous them piano concerto number four on the fans it's the pianist here with the Montreal symphony orchestra\nOr\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n\n\n\n\n\n\nMm Mm\n\n[noise]\n...\n\n\n\n\n...\n...\n\n\n\n[noise]\n\n\n\nLou\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]", "year": "2018", "show_name": "Classical 24", "city": "Chatsworth", "day": "03"}