{"month": "10", "state": "GA", "station": "WNGH", "content": "This was divorced ... symphony number three the Berman symphony orchestra played it here on gp conductor Jose ... hey\nI'm Sarah ... hope you enjoy that music by divorce wrapping up night cap and they stay here on G. P. B. next time thanks for listening and good\nOr better stay here and if you're in your car I Want you to try something roll up the windows you all sealed inside take a good smell\nCan you smell that that was the great cologne experiments of two thousand for it you should not have gone with the dollar store for that one boy you can lose that older car smell by donating your vehicle one of your favorite causes like public radio it only takes a few minutes and just like that you've supported the station and well you were on your way to a life of better smell [noise]\nGo to ... dot org slash cars and thanks\n[noise]\nNinety seven point seven FM W. A. G. P. B. S. W. A. G. P. H. D. Rome part of Georgia Public broadcasting radio network [noise]\n[noise]\nYou can't tell right off the bat Kenya\nComposer Stanley grail where each new music for instruments partially using some of the\nOf renaissance in the early ...\nInto those voices he puts a new language as well\nAs salt because music it seems to exist outside of time\nAnd I'm Steve seal coming along with me this hour Stanley grill lonely voices\nThat or more ahead on the extra collector [noise]\nFlying from NPR News in Washington ... Steve and President Trump says there is a major federal investigation into the bomb threats targeting several prominent Democrats\nJust conduct is a board to everything we hold dear and sacred as Americans my administration will provide additional updates as they become available\nAnd I just want to thank everybody for ...\nYou're and sacred as Americans might administration will provide additional updates as they become available\nAnd I just want to thank everybody for their understanding [noise] we're extremely angry upset\nAbout what we would this this morning and we will get to the bottom of\nPackages containing pipe bomb type explosives were sent to former President Obama and Hillary Clinton among others but known exploded\nWanted the suspicious packages addressed former CIA director John Brennan was sent to CNN's building in midtown Manhattan when Hogan of member station WNYC was there a CNN employees spend hours outside their offices well authorities combed the building for explosives\nThey were live on the air when Anchorage had to cut out and evacuate the building outside behind a police barricades CNN staff were rattled but they're reporters kept reporting here's anchor Keith Baldwin rate after she interviewed New York governor Andrew Cuomo\nIf they do and you don't want to become the news and we all became a little bit of the news today but [noise] ah never been more proud of my colleagues and honestly\nIt might be they were beyond professional but I but yeah it's scary\nAuthorities say they transported the explosive which was found in the mail room to a remote area forget nation other pipe bombs were sent to prominent Democrats including George Soros Hillary Clinton and Barack Obama for NPR News I'm Glen Hogan in New York City\nThe Catholic archdiocese and Anchorage, Alaska says it will take a close look at possible sexual abuse within the church Alaska Public media's Abbie columns reports on the steps being taken\nThe church is appointing an independent commission to review files from the last fifty years archbishop ... H ... says the investigation will look into how sexual abuse accusations have been handled\nWe are taken care of business and we're taking care of victims\nThe three commission members have brought a background in law enforcement and criminal prosecutions ten years ago the Catholic dioceses in Fairbanks, Alaska filed for bankruptcy after paying out millions of dollars in settlements to victims stretching back decades\nAgent says the current review was not prompted by new allegations in Alaska but instead the climate throughout the country and recent revelations in other states the review is expected to be completed next year for NPR News I'm Abbie Collins in Anchorage\nAnd others elopes and Wall Street stocks tumbling again\nThe review is expected to be completed next year for NPR News I'm Abbie Collins in Anchorage\nAnother cell ups and Wall Street stocks tumbling again Wednesday the Dow Jones industrial plunged over six hundred points Asian markets are lower at this hour this is NPR News\nFood and Drug Administration has approved a new medicine to treat the flu NPR's Richard Harris reports that it is not a substitute for getting a flu vaccine to prevent some\nScientific study shows though flus out is about as effective as other flu drugs on the market including generics this brand name drug is administered as a single dose to people twelve and older it was developed by a Japanese pharmaceutical company and will be sold by Roche and its American subsidiary Jeanette in tech\nThe drug has unique mechanism of action and it's effective against strains of flu that are resistant to a popular flu medication\nJeanette in Texas the drug will be available in a few weeks the wholesale price as a hundred and fifty dollars but genetic says it's offering a coupon that will bring the cost down to as low as thirty dollars for people with health insurance Richard Harris NPR News\nState of Maine plans to use the state's\nRanked choice voting system for the first time to our next month's midterms the system that allows voters to rank candidates on the ballot and the person with the most first place votes wins if there's no majority winter than the last place candidate is eliminated and boats are we allocate it until someone ends up to the most votes\nFederal Communications commission is proposing a sixty three million dollar fine against ... based broad band company that's accused of misusing government money the FCC claims American broadband and telecommunications bought a yacht private plane and other luxury items\nWith funds that were meant to help low income people get phone and Internet service\nI'm ... NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the William and Flora Hewlett foundation committed to supporting ideas and institutions to advance education for all preserving environments and promote vibrant performing arts more information is available at ... dot org\n...\n[noise]\nExtra cluttered with lesser do music is always arriving I'm sure you feel a marvelous worthwhile Stanley grill coming up this hour we'll have you asking\nAlways arriving I've ... I've got a marvelous work by Stanley grill we kept a shower and says well have you ... ... when was this written exactly [noise]\nSome of those pieces that seems to exist outside of time [noise] because I wouldn't do as well and this piece by Alexandra ... when this is an extra ... to ...\nAh ah\nAh [noise] [noise]\n\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise] ah [noise] [noise] [noise]\n[noise] or\n\n[noise]\n\n[noise]\nHere are the extra click I'm Steve seal good to have you tuned in there's a certain quality to this next piece by composer Stanley grill particularly in the opening minutes and makes it sound as if it exists outside of time\nThere qualities of early music to sort of restraint to the string play much like a renaissance early baroque music but it's clearly contemporary\nIs well it does take off and go on from different directions soon enough lonely voice is by Stanley grill here is the due to row string quartets\n[noise]\n\nMm [noise]\n\n\n\nMm Mm\nMm\n\n\nMm Mm\n[noise]\n\n\n... ...\n...\n[noise]\n\n\n\n\n...\n\n[noise]\nVoice is by Stanley grill played by the ... string quartet\nI'm Steve seal thanks you too and again for extra collecting we're off to Iceland in a moment\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n... ... ... ... ... yeah that would be an Icelandic name and this is a piece titled the sun is sinking now\nOne hopes not for the final time do we do see a beautiful one hemisphere weeks here with the school looking toward Rick you're\nOn [noise]\n\n\n\nDon't know how to\nAlone or\nA\nTV [noise]\nWant to know\nMe is\nYou know the\nCity\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\nOh\nOr\n\nA man or a you know\n\nThe community and the games\n\n\n\nOh\n\n[noise]\nSon is sinking now by the Icelandic composer kill she'd go beyond\nWhat the ... conducted by quarter ... son here on extra [noise]\nDon't forget about the extra click extreme it is just one of the many many it seems to ever growing list of streams override your classical dot org ... place where you will find this sort of music and in fact to an even more adventurous lineup of\nShort of twenty twenty first century music\nYour classical dot org where the newest curated streaming peaceful piano wind up there as well as as a piece by the contemporary American composer Dan Colman drowned out this hour's program and it's called the bonds and symmetries here say a version four\nStrings and flew to the piano and shoot version Ellis Dade John ...\nIs members deported gp beat we're in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you\nYou can listen online or G. P. B. dot org and you can find us on Twitter at my GP beat and Georgia Public broadcasting on Facebook thank you for listening [noise]\nYou know selling a car can be a hassle but Joan ... is a whole different story ... ... I was taking off your hands or off your driveway and turn it into public radio and maybe even a tax deductions ... all the host marketplace here is how to do [noise]\nEight seven seven GP be one car or donate securely on line a gp dot org slash cars ten thanks [noise]\n[noise]\nNinety seven point seven FM WG P. B. S. W. A. G. P. H. D. rural part of Georgia Public broadcasting radio network [noise]\n\nDo you love the characters classical music has created but if you might remember including the cracker come to life\nPeter who isn't afraid of walls and a woman named Carmen [noise]\nShe's the title character of an opera written by George busy back in the Eighteen seventies the opera still perform these days but not often as the sweets drawn from it [noise]\nYou'll get to revisit one of those sweets here in about six minutes I'm Garrett McQueen disease Carmen and more on this hour of music through the night [noise]\nLive from NPR News in Washington ... Stevens President Trump open a Wisconsin campaign rally by denouncing bomb threats against several high ranking Democrats and others Marty Michaelson of member station WBUR WN\nReport President Trump spent the first few minutes of his speech condemning incidence of suspicious packages delivered to former Presidents Clinton and Obama along with CNN offices in New York City he says his highest duty as president is to keep America say\nThe federal government to conduct an aggressive investigation as we\nHe says his highest duty as president is to keep America safe\nThe federal government just get a dog and aggressive investigation we will find those responsible and we will bring them to justice hopefully very quickly\nPresident also said the media has a responsibility to stop what he called the endless hostility and constant negative and oftentimes false attacks for NPR News I'm Marti Michael send in\nMilwaukee among the people targeted by the package ROMs intercepted this week is former CIA director John Brennan a package address to him was mailed to CNN New York offices which had to be evacuated and searched rented says he thinks President Trump's rhetoric is behind the violence I think one can make an argument\nThat it has embolden individuals to take matters into their own hands and so when a complement individuals who have insect body slammed others or that he's going to pay the legal bills of somebody takes us with somebody\nThat can only be seen as encouraged within lighten up\nRunning says too many Republican Party officials are not fulfilling their responsibilities by failing to challenge some of Trump's remarks and actions\nHealth officials in New Jersey are trying to contain a viral outbreak that has claimed the lives of seven children Rachel holiday Smith of member station WNYC reports that Eighteen cases of the buyers have been confirmed\nMedical officials say the ... virus is not much of a risk for healthy people as it might only bring on a cough or paint guy\nBut for pediatric patients at the ... Center for nursing and rehabilitation the virus has proven deadly the facility provides long term care to chronically ill and disabled children New Jersey's health commissioner Dr Sharif el ... says his agency is working closely with the facility that specializes in treating fragile patients\nThat reality is there aren't that many do any better able to care for\n... says the health department will be onsite until the outbreak ends for NPR News I'm Rachel holiday Smith\nThe attorney general says Exxon Mobil misled investors about the risks that climate change posed to its operations attorney general Barbara Underwood center Exxon courted investors such as the state's public pension funds with an accurate information\nThey are also comes three less than three months after the federal securities and Exchange Commission dropped an investigation into the Texas energy giant along the same lines [noise]\nIs NPR News\nInvestigation into the Texas energy giant along the same lines [noise] this is NPR News\nNew report concludes that federal immigration and health officials were blindsided by the Trump administration's zero tolerance policy on migrants crossing the southwest us border\nAnd investigation by the nonpartisan government Accountability Office shows agency struggled to handle the fall out over family separations the federal court ordered the government to reunite families and to provide regular progress reports the jail a says government computer systems often fail to fly when a child was separated from a parent\nAnd health and Human Services officials say homeland security did not always provide the information\nThe world famous Cleveland Orchestra has fired two of its star musicians\nThat's after an investigation found the ... multiple instances of sexual harassment against female colleagues and in some cases students they taught from C. P. N. I. C. P. and Idea Stream in Cleveland Adrian ma is more\nThe firings were announced three months after a Washington Post story brought to light sexual assault allegations involving William crucial for over two decades producer was the orchestras concert master the ensembles leader after the conductor but after the post story came out the orchestra suspended him and hired an outside law firm to investigate\nThat inquiry resulted in another suspension of its lead trombone player must be ... Rosa based on dozens of interviews and documentary evidence the investigators concluded the two men engaged in numerous instances of sexual misconduct\nIn a statement the executive director of the orchestra apologize to the victims and announced it would be implementing a new sexual harassment policy\nAdrian ... in Cleveland this is NPR News\nSupport for NPR comes from NPR stations other contributors includes the Aaron ... Brewing Company family owned operated and argued over since Nineteen eighty proud supporter of independent about whether that online over the air or in a bottle more FDR Nevada dot com\n[noise]\nWill come again to another hour of music through the night and this week's edition of euro classics each week during this hour we present our euro classics recordings which are a special on corps from festivals and concert halls across Europe that you can only enjoy right here\nThis week brings a performance from these Sergei ... which national philharmonic the great hall over in Moldova the group performs music\nEnjoy right here this week brings a performance from the ... national philharmonic great all over in Moldova gr performs music show ... this is Carmen sweet number one\n[noise]\n\n\n\nTheir performance from the orchestras great hall ... Moldova as part of our weekly euro classics special encore broadcast the performances from festivals and concert halls across Europe be sure to join me next week same time same place for the next edition\nAnd the opera Carmen includes a number of really beautiful ballad called romances or reminds us here's one by living American composer Daniel Godfrey the cat's string quartet for ... [noise] [noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\nFor the double bass to claim to all of those musical walking baselines the job of the ... player as you just heard in the conclusion to that work there now the violence and not a number eleven by our ... really performed by trio so near\nAnd dear McQueen thanks for joining me he's a little music by recorded Wagner this is his secrete idol\n\n\n\nWell you\n\n[noise]\n\nMm\n\n\n\n\n[noise]\nWell\n\n\n\n\nI'm gear McQueen thanks so much for your company\nIs members supported G. P. P. we're in Eighteen station radio network you can listen online at ... dot org and you can find us on Twitter at my GP beat and Georgia Public broadcasting on Facebook thank you for listening [noise]\nHey this is David Greene host of ...\nAnd you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening [noise]\nHey this is David Greene host of MORNING EDITION I'm here to talk with you about that poking feeling the one that keeps reminding you support public radio you can support the programs you love by donating your used vehicle that old car truck could be worth hundreds of dollars to the station or you have to do is call and you might even received tested\nUs just voted G. P. B. dot org slash cars or called eight Seventy seven GP beat one car and bank [noise]\n[noise]\nNinety seven point seven FM double your G. P. B. S. W. A. G. P. H. D. Rome portable Georgia Public broadcasting radio network [noise]\n[noise]\nChurches church services and church events that inspired classical music for ages\nThis work is one of the newer side relatively but it's still reverberates that age old spirit of music meeting church [noise]\nBy composer oath to Reno ... he wrote this piece of music inspired by some of the stories he'd seen depicted on stained glass\nYou'll hear the sound see associated with those beautiful windows and about Fifteen minutes church windows by we're speaking and more coming up on music through the night [noise]\nLive from NPR News in Washington ... President Trump's as political violence has no place in America and NPR's Scott Horsley reports Trump dial down his partisan rhetoric at a campaign rally in Wisconsin Wednesday hours after threats were mailed to several prominent Democrats and others\nInvestigators track a series of suspected pipe bombs to prominent Democrats President Trump made an appeal for political harmony\nEars partisans to stop comparing their opponents to historical villains and he's self consciously tried to moderate his own rhetoric joking at one point do you see how nice I'm being\nDuring their opponents to historical village and he's self consciously try to moderate his own rhetoric joking at one point do you see how nice I'm being\nOne way to serve the largest agreements gold peacefully at the ballot box\nThe president promised an aggressive investigation into the suspicious packages to Hillary Clinton bronco bottom up CNN and others he says he hopes to bring those responsible to justice very soon Scott Horsley NPR News Washington\nThe FBI has arrested the leader and two other members of a violent white supremacist group that's based in Southern California NPR's Kirk Siegler has details on the government's case against the so called rise above movement\nAccording to the criminal complaint white power leader Robert run do and three other California men are alleged to have traveled to political rallies in Huntington Beach San Bernardino Berkeley in Charlottesville, Virginia last year where they quote violently attacked and assaulted counterprotesters\nThe leader run do was arrested here after reportedly returning from a trip to Latin America\nThe foreman are charged with conspiracy to riot and writing the FBI says these men publicly promote themselves as being a combat ready militant group that posts videos on social media of assaulting people at rallies usually with their faces covered up with American flag masks\nThey're seen as leaders in the latest white nationalist surge in the U.S since the election of President Trump\nKirk Siegler NPR News Los Angeles Alexis\nToyota and Mazda we're at the top of the latest Consumer Reports list the most reliable vehicles the magazine says the least reliable brands were ... Cadillac Tesla ram and GMC\nIts sights more than five hundred thousand responses to an annual survey ups of its subscribers plus data on vehicles may from two thousand to twenty Seventeen\nWall Street ended another volatile trading day after a sell off to send us stock indices two percent lower than swamp the chief economist at grant Thornton in Chicago says one reason why investors are so rattled is that markets are so unpredictable\nUnfortunately the complacency we San Anton markets wasn't the norm the volatility we're seeing today is more than ... and you know reality is never as pretty as what we like it to be\nBlue chips are down down seven percent from their old town high on Asian stock market shares are lower down three percent\nIn Tokyo you're listening to NPR News [noise]\nOf migrants from Central America are still making their way\nTokyo [noise] you're listening to NPR News [noise]\nThousands of migrants from Central America are still making their way north through Mexico Emily Green has been traveling with the group and reports that participants are facing more obstacles and becoming more dispersed than in previous day's\nUnlike in previous days there was nobody lining the roads giving out snacks and bags of water and many of the migrants say they're dehydrated\nThere continues to be relatively heavy police presence tracking the caravan and government helicopters are flying overhead but the Mexican authorities have made no effort to stop its passage\nMexico is facing a political conundrum President Trump has threatened to pull out of the newly renegotiated NAFTA agreement worst trillions of dollars if Mexico doesn't stop the caravan\nBut impeding its process couldn't violate Mexico's own immigration laws and play badly with the Mexican public by giving the impression that Mexico is that Trump's Beck and call\nFor NPR News I'm Emily Green and my step back Mexico\nVenezuela's president Nicolas Maduro is launching outed vice president Mike Pence for claiming ... socialist government is funding the migrant caravan fences said he got that information from the president of Honduras manure recalls the claim crazy an extremist\nVenezuela is facing its own migrant crisis has thousands of citizens their fleet and economic and political crisis as well as shortages of food and other basic goods\nThe Boston Red Sox lead the world series two games to none after beating the Los Angeles Dodgers forwarded to Wednesday at Fenway Park game three schedule for friday in LA [noise] this is NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the Walton family foundation where opportunity takes root more information is available at Walton family foundation dot org and that John D and Katherine Tiedemann Arthur foundation at max bound dot org\n\nThere's no talking about Bach for very long before the subject of church music comes up it was his bread and butter in many ways but he did right lots of works on the more secular side you'll hear a great example of that in the form of a can sure do a little later this hour\nFirst though you and I will spend a little time inside of the church there's a guitar work by August ... barrios titled the cathedral\nWe'll spend a little time inside of the church is a guitar work by overseeing barrio title the cathedral [noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\nMm\n\n\n\n\nUm or\n\n\n\n[noise]\nComposer to read over speak he had a deep fascination with music from ages ago I'm Talking Krikorian chance from the first century\nFor all to Reno re speak he had a deep fascination with music from ages ago I'm Talking ... Korean chant from the first century\nWell if you take a look at his catalog you'll see lots of new orchestrate bargains or re mixes if you will of works by composers of those ... chance he also wrote a lot of music on the original side inspired by churches and chant you just heard of that I heard heard a great example of that\nThat was a piece titled church windows by ... to Reno we're ...\n[laughter] I'm Garrett McQueen thanks for joining me here for music through the night attacking composers like we're speaking looked over to Germany a lot for inspiration or the converse is true as well here's the Taliban concerto by Johann Sebastian Bach\n[noise]\n\nAs members supported TPP where an Eighteen station radio network you can listen online at ... dot org and you can find us on Twitter at my GP beat and Georgia Public broadcasting on Facebook thank you for listening\nNow is the perfect time to clean up the garage and get rid of that car you no longer need do face the coming months with a fresh start by doing\nFor listening now is the perfect time to clean out the garage and get rid of that car you no longer need\nThey'll face the coming months with a fresh start and by donating your used car to GB believing it a tax deduction called eight seven seven GP be one car or donate securely on line at gp dot org slash cars and thank\n[noise]\nNinety seven point seven FM W. A. G. P. B. S. W. A. G. P. H. D. Rome portable Georgia Public broadcasting radio network [noise]\n\nClassical music from Western Europe often draws on both elements he's got the people inspired\nFor the people well this work by Jesse Montgomery is a great American example of that idea [noise]\nThe Washington Post described it as a handful of American Folk melodies tossed into a strong wind cascading and tumbling joy fully when you consider that an accurate description [noise]\nYou'll get to take a closer listen here in about Fifteen minutes the poll conspired sounds of Jesse Montgomery and many others coming up on this hour of music through the night [noise]\n\nFly from NPR News in Washington I'm Shea Stadium and President Trump says there's a major federal investigation under way into the bomb threats targeting several prominent Democrats\nDisagree just conduct is a boards to everything we hold dear and sacred as Americans my administration will provide additional updates as they become available\nAnd I just want to thank everybody for their understanding [noise] we're extremely angry upset\nAbout what we what this this morning and we will get to the bottom of\nPackages containing pipe bomb type explosives were sent to former President Obama and Hillary Clinton along with other prominent Democrats in others none of the intercepted mailing\nPackages containing pipe bomb type explosives were sent to former President Obama Hillary Clinton along with other prominent Democrats in others none of the intercepted mailings exploded it's unclear whether any of them were ready to go off [noise]\nMeanwhile democratic leaders are condemning President Trump's divisive ... against the party and the press NPR sinister Romo has more\nFollowing the presidents remarks that in these times we have to unify democratic congressional leaders Chuck Schumer and Nancy Pelosi said Trump's comments quote ring hollow until he wrote versus his statements that condone acts of violence\nSimilarly in New York congressman Hakeem Jeffries said it's time to and hateful rhetoric directed at political adversaries conspiracy theories and claims that the press the enemy of the people\nTop Republican leaders also denounced the attacks but some are calling on Democrats to refrain from blaming the president in an interview on Fox house majority whip the skull lease said quote we shouldn't be criticizing the act whether a Republican or Democrat is under attack the ... NPR News\n[noise] Canada's prime minister Justin Trudeau says his government may cancel a major arms deal with Saudi Arabia ... reports Trudeau says Canadians expect consequences for the murder of Washington Post journalist Jamal ...\nTrudeau has joined other G. seven countries in calling for a thorough investigation into the murder and he said his government is looking for ways to cancel it Fifteen billion dollar deal to sell light armored vehicles to the Saudis without having to pay penalties they could amount to about one billion dollars\nTo those that ought to walk could suspend export permit something it is done in the past to do was met with senior cabinet ministers in officials to discuss the issue is government has faced criticism for keeping the deal with the Saudis despite concerns about human rights violations Jamal ... was brutally murdered after entering the Saudi consulate in Turkey earlier this month\nFor NPR News I'm Diane ...\nMain plans to use the state's ranked choice voting system for the first time it next month's midterms system allows voters to rank candidates on the ballot and the person but the most first place votes wins if there is some majority winter the last place candidates eliminated and bow to reallocate it the process is repeated until someone comes out on top [noise]\nThis is NPR News [noise]\nFederal judge's order Georgia election officials to stop rejecting absentee ballots in applications with signatures that don't match one on the voter registration card us district judge Lee ...\nThere's order Georgia election officials to stop rejecting absentee ballots in applications with signatures that don't match ones on the voter registration card [laughter]\nHe was district judge Lee May has directed the secretary of state's office to instruct county elections officials to ... a chance to fix any problems before the midterms\nMays ruling came into lawsuit alleging the constitutional rights of Georgia's absentee voters are being violated especially minorities acquainted state elections officials deny\nFederal regulators have issued a conditional permit for the first oil and gas production wells in the Arctic and Alaska Public media's Elizabeth hardball reports that another company a step forward three years after shell abandon its Arctic drilling program\nThe Trump Administration has handed a key approval to the Texas ... for a proposed oil development in the Beaufort Sea off the north coast of Alaska\nHe'll gr aims to build a gravel island about five miles from shore and drill for oil from there it would be similar to other oil developments that are already built in Arctic waters differences that they're in waters controlled by the state and not the federal government\nThe project still need several other permits before it can go forward he'll Corp has not received at the same opposition shell face when it explored for oil in the Arctic but environmental groups are still worried the state has find he'll court for safety violations in recent years for NPR News I'm Elizabeth ... in Anchorage\nOn stock markets in Asia shares a lower down nearly four percent in Tokyo following a sell off to cause major declined on Wall street the Dow industrial is lost six hundred eight point this is NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the ... foundation fostering improvements and learning and enrichment for disadvantaged children and the vitality of the arts for everyone ideas and while the ... foundation dot org and the listeners who support this NPR station\n[noise]\nToday's classical music is supported by progressive insurance suffering a way to buy a home insurance with\nTheir home quote explorer tool custom quotes and rates are available online learn more progressive dot com or one eight hundred progressive\nNow bats progressive [noise]\nThe progressive harmonies and writing styles showed themselves will in this next performance featuring ... bottom boots men he performs here the romance reveal an orchestra by max broke\n[noise]\nThat's for ... an orchestra by max\n\n\n... ... and\nTo\n\n\nAlways a pleasure for me to present music by composers of color that was at work by a friend of mine named Jesse Montgomery I work a purse titled Shrum\nThe strings aren't strong but hammered in this next piano feature stay tuned\n\n\nHe was elected as whites and bird with appears conservatory orchestra on the ... leave them in the piano concerto number two by Chopin\n[noise] [laughter]\n\n\n\n\n... ...\n... ... ...\n[noise]\n\nMm\n\n\n\n[noise]\n[noise]\n\n... ... ...\n[noise] [noise] [noise]\n\nAnd secretary orchestra I'm Garrett McQueen things so much for joining me\nSays his members supported gp Pete were in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening\n... here and if you're in your car I Want you to try something roll up the windows you all sealed inside take a good smell\nCan you smell that that was the great cologne experiments of two thousand for it you should not have gone with the dollar store for that one boy you can lose that old car smell my donating your vehicle one of your favorite causes like public radio it only takes a few minutes and just like that you've supported the station and well you were on your way to a life of better smell\n[noise] go to G. P. D. dot org slash cars and thanks [noise]\nNinety seven point seven FM WG P. B. S. W. A. G. P. H. D. Rome portable Georgia Public broadcasting radio network [noise]\n[noise]\nRelaxing would it be to laser ... does off in a beautiful garden filled with fragrance and freshness\nMaybe your garden is already suited for that\nWell this music will be the perfect companion [noise]\nIt's by what Keane Rodrigo\nIn writing this sea grouped for lower buys meant to gently transformed the four seasons of the year into a musical garden [noise]\nBill experience these transformations in about Fifteen minutes I'm Garrett McLean music for a garden by Joaquin Rodrigo and more on the way [noise]\nFrom NPR News in Washington ...\nAnd then at the package from sense two prominent Democrats and others [noise]\nDetonated as law enforcement of visuals took them away for examination and disposal there have been no reports of any injuries one package center CNN's New York building yesterday was addressed a former CIA director John Brennan prompting an evacuation and search their Brennan says\nInjuries [noise] one package sent to CNN's New York building yesterday was addressed a former CIA director John Brennan prompting an evacuation and search their Brennan says he thinks the President Trump's rhetoric is behind the violence\nI think one can make an argument that it has embolden individuals to take matters into their own has and so when he complement individuals who have in fact body slammed others or that he's going to pay the legal bills of somebody takes us with somebody\nThat can only be seen as encouraged within the heightened\nBrennan says too many Republican Party officials are not fulfilling their responsibilities by failing to challenge some of Trump's remarks and actions\nThat treated water system in Austin, Texas is fail to meet safety standards due to flooding in the region as most ... reports from member station cave team the city has already been under a boil water water for days\nAfter the flooding water in Austin reservoirs got so murky became difficult to process said water treatment plants on Monday the city ordered conservation measures and told people to boil their tap water but that boil order was precautionary the city still met safety standards until Tuesday night\nThat's when testing by the city show to Austin drinking water fail to meet minimum standards for clarity that means they're more particles in the water than deemed safe by state law the latest test results may be a setback for the utility which had hoped the water emergency would be over by this weekend\nFor NPR News I'm Mose Buchele in Austin\nFor the most powerful storm to hit any part of the United states this year is turning to the Pacific super typhoon due to was a category five storm as it passed over the northern Mary on an island as a Public Radio's Bill Dorman report due to has caused extensive damage but so far no reports of any deaths\nSuper typhoon YouTube tore through the islands of ... pan with maximum sustained winds of one hundred eighty miles an hour they're part of the commonwealth of the northern Mary on islands\nLets us territory about thirty eight hundred miles west of Hawaii he wins ripped roofs off houses and blown out windows trees and power lines are reporting down around the archipelago\nAs the storm moves west flooding is expected to continue it may also affect Guam NASA's calling super typhoon due to the most intense storm to ever struck the islands for NPR News I'm Bill Dorman in one of the loop\nStock markets in Asia shares closed mixed today hire in Shanghai but down nearly four percent in Tokyo\nFor NPR News I'm Bill Dorman ...\nOn stock markets in Asia shares closed mixed today hire in Shanghai but down nearly four percent in Tokyo following a sell off that caused declines on Wall street [noise]\nYou're listening\nTo NPR News [noise]\nBut in his top lawyers investigating whether Catholic clergy in the state engaged in child sex abuse or try to cover up any such crimes what the evidence reports from member station WFDD\nIn Richmond, Virginia attorney general mark herring says his investigation began within days have been August grand jury report documenting decades of sexual abuse and cover up by Catholic clergy in Pennsylvania herring confirmed on Wednesday he has received reports from potential victims in Virginia\n[noise]\nHearing his launched at twenty four hour hotline for victims or anyone else with information regarding abuse in Virginia diocese for NPR News I'm with the evidence in Richmond\nThe FCC is proposing is sixty three million dollar fine against the Toledo base broadband company accused of misusing government money\nThe FCC claims American broadband intangible communications bought a yacht and other luxury items with funds meant to help low income people get phone and Internet service\nAnd they were ... that federal immigration health officials were blindsided by the Trump administration's zero tolerance policy on migrants crossing the southern border\nAn investigation by the government Accountability Office chose agency struggled to handle the fallout over family separations a federal court ordered the government to reunite families and provide regular progress reports\nJails says the government computers often fail to fly when the child was separated this is NPR\nSupport for NPR comes from NPR stations other contributors include home advisor matching homeowners with home improvement professionals for a variety of home projects for minor repairs to major remodeled homeowners can read reviews of local pros and book appointments online at home advisor dot com\n[noise]\nDoes anything in particular come to mind for you when you think of the combination of flu and guitar they're actually a few Latin inspired works that popped into my head immediately but things to clever rangers and researcher\nThe combination of flu and guitar\nThey're actually a few Latin inspired works that popped into my head immediately but thanks to clever rangers and researchers you can enjoy music for Clinton Qatar from virtually any area or any part of the world\nIs a great example of that this is the blitz about a number two by George project candle featuring flatus menu who'd with guitars Christian ...\n\n[noise]\n... [noise]\n\n\n\n\n\n\n\nNa\nNa\n\n\nEnrique but these let the London symphony orchestra in their performance I Want to give a special shout out to the percussion section that's a nice keyboard percussion in that performance you just heard them perform music for a garden by what Keane Rodrigo\nFrom a garden to an entire landscape music of John Cage next [noise]\n[noise]\n\n\n\nOh\nI'm gear McQueen thanks for joining me if you've ever sat in silence for about four and a half minutes he performed the most\nI'm Carol Queen thanks for joining me\nIf you've ever sat in silence for about four and a half minutes he performed at the most famous work or maybe I should say the most infamous work by this next composer\nHis name is John Cage at work I'm referencing if you don't know is titled for thirty three four and a half minutes of exploring the sounds created for us by our environments\nWell here's a little music of his that you'll be able to hear someone else perform it's called in a landscape\n\n\nMe\n\n[noise]\n\n\n\n[noise] [noise]\n[noise]\n\n\n\n\n\n\n\n", "year": "2018", "show_name": "Classical 24", "city": "Chatsworth", "day": "25"}