{"month": "10", "state": "GA", "station": "WNGH", "content": "And composer who lived for Eighteen eighty to Nineteen fifty my\nStomach Andre handling playing that met near including night kept this evening on Georgia Public broadcasting ... and ... the clock to that district midnight selling out of here for now thanks for listening in on the next time said\nThank you for tuning into listener supported gp and most importantly thank you for your support I ... and this is our fault fund drive a reminder it is your support that allows us to bring you the programs on TV that matter to you day in and day out please do your part right now at whatever level is right for you\nGo to CPB dot org and click donate or call us at eight hundred to two two forty seven eighty eight thank you so much for your support of TPP [noise]\n[noise] was Ninety seven point seven FM W. A. G. P. B. S. W. A. G. P. H. D. rural part of Georgia Public broadcasting radio network [noise]\n[noise]\nHow often have you heard a piece of music described as\nWill for composers one could argue that\nMany of them down through history has taken a look at a work of visual art in heard it singing\nRelationship between music and visual art has always been strong\nUp this hour of extra collecting some Tony's and twenty first century examples\nSuch as this piece called white landscapes by a country are you ... ... also have perhaps the most famous twenty century example one that just so happens to have been inspired by a Japanese food cooked\nExtra collected as classical music of the present tense that it's happening\nBlind from NPR News in Washington I'm Shay Stevens White House officials are defending President Trump's criticism of a woman accusing Supreme Court nominee Brett Kavanaugh of past sexual assault spokeswoman Sarah Sanders was asked about Trump's comments at a Tuesday rally where he mocked Christine Blasey Ford's testimony at a Senate hearing\nPresident was dating the facts are frankly facts that were included in special prosecutor Rachel ... reports\nChristine Blasey Ford's testimony at a Senate hearing\nThe president was dating the facts are frankly facts that were included in special prosecutor Rachel Mitchell's report he was stating facts that were given during Dr ... testimony innocent it has to make a decision based on those facts and whether or not they see judge Kavanaugh to be qualified to hold a position on the Supreme Court\nCenter says Kevin O's detractors of made falls in baseless allegations in a coordinated smear campaign to question his legitimacy for the high court\nMajority leader Mitch McConnell says a copy of the FBI supplemental background check on Capitol will be released a lawmakers for review he says a procedural vote on the nomination is set for friday\nThe international court of justice is ordering the United states to make sure that it's sanctions do not hinder aid to Iran NPR's Michele Kelemen reports that the Trump Administration is fighting back accusing around of using the court as a propaganda forum\nThe Trump Administration is pulling out of the Nineteen fifty five treaty of amity with Iran which Iran used to bring its case against the U.S at the international court of justice national security adviser John Bolton says the U.S is also withdrawing from another international protocol to undercut a Palestinian case that the court\nWhich challenges that decision to move the U.S embassy in Israel from Tel Aviv to Jerusalem\nUnited States will not sit idly by as faceless politicized claims are brought against those Fulton\nAds that he's now reviewing all agreements that exposed the U.S to the jurisdiction of the un tribunal Michele ... NPR News Washington\nAnd Florence South Carolina son in law enforcement officers have been shot in one killed ... trying to serve a warrant South Carolina Public Radio's Victoria Hansen reports that authorities say a suspect barricaded himself inside of home and help children hostage\nInvestigator said the way the suspect was positioned he had an advantage shots being fired everywhere three of the wounded officers were removed with a bullet resistant vehicle as a suspect continued to open fire wounding for more police officers\nAuthorities say the standoff lasted two hours some of the injured officers are in serious condition the children have been taken to safety the suspect is in custody the shootings happened in an upscale neighborhood police have not said why they were surveyed the warrant for NPR News I'm Victoria Hansen\nOn Wall street stocks closed a bit higher although blue chips hit a new house\nAnd police have not said why they were serving the warrant for NPR News I'm Victoria Hansen on Wall street stocks closed a bit higher although blue chips hit a new high the Dow gained fifty four points on Asian market shares are mixed up one percent in Shanghai this is NPR News\nWorkers at seven Mariano hotels in Boston walked off their jobs after months of field contract talks their union UNITE HERE says more than Fifteen hundred service workers are taking part in the strike\nThe Boston walkout comes days after members of another unite your local reached a new contract agreement at more than a dozen Chicago hotels\nStrikes continue with several other Chicago hotels where workers are insisting on year round healthcare benefits for workers who are laid off during slower mumps and hotels and several other cities are facing the possibility of strikes most of them in California [noise]\nThe engineer who helped shape the sound of the Beatles has died just emirate well Seventy two years old and NPR's ... reports emerged died yesterday of heart failure at his home in Los Angeles\nJak America came of age with\nThe Beatles [noise]\nYears old when he began working at the road studios in London she was in the engineers for such early hits as love me do it in a hard day's night he became the Beatles primary engineer it and just as he turned Nineteen and helped turn into a laboratory for town\n\n\nWent on to work with a wide range of artist from Michael Jackson to Kate Bush ... NPR News New York\nAnd I'm Shay Stevens NPR News\nIn Washington\nSupport for NPR comes from NPR stations other contributors include vital project started supporting the museum of modern art in Manhattan where judges and dance theater the work is never done is on view and includes weekly performances in the ... more ... moment dot org\nThe plants\nExtra click or classical music is always arriving twenty twenty first century music every week at this time I'm Steve seal and a real big way back into the early twentieth century\nI'm twenty first century music every week at this time I'm Steve seal and um well the way back into the early twentieth century\nEarlier leader in this hour and it's kind of all about music inspired by visual arts this hour um so we get a piece a that is probably the most famous work there was ever inspired by a piece of visual art\nSpecific Japanese would cut later on [noise]\nAnd from the Japanese composure talked I she Yom ... are you must you white landscapes and a few minutes Zachary once worked as an English composer though first this is his three letter prints right\n\n\n[noise]\n\nYou\n\n\n\nPretty piece from ... to ... ... ... white landscapes when the Manchester come around to with food is John Barrow and um I just keep Wilson Johnson priced like children\nYeah Manchester camaraderie with food is John Barrow and I'm Harvard keyed Wilson Johnson price playing cello such ... conducting\nTony Tony first century pieces inspired by visual arts has time on an extra collected\n[noise]\n[noise]\nIf you read very many contemporary composers bio's starts to get a little old finding that I'm almost all of them are in there\nA bio copy one of the most exciting young composers working today [noise] um well that's a phrase that it's actually true of Caroline Shaw and just one of the ways that you know that is true is that her bio doesn't say a so here's a piece by Carolyn Shaw who is awesome\nAnd it's played by the ice jury quartet and it's called blueprints\n\n\n\n\n\n\n\n... ... ... ... ...\n... ...\n\n\n\n\n\nOr\n\n\n\n\nHa ha\n\n\n\n\n\nPitches member supported G. P. P. we're in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening this\nSupported gp being that means people who listen just like you're doing right now for by the most important and reliable share of the funding that keeps the programs you rely on and enjoy on the air\nIn people who listen just like you're doing right now provide the most important unreliable share of the funding that keeps the programs you rely on and enjoy on the air [noise] Hi I'm John Barclay and it's our fault sunrise\nAnd right now I Hope you'll join our public radio community and\nGDP is stronger and better with your support\nQuick and easy to give on line at gp dot org or call eight hundred to two to four seven eight eight and thanks [noise]\nNinety seven point seven FM W G. P. B. S. W. GBH the rural part of Georgia Public broadcasting radio network [noise]\n[noise]\nNow that it's October it's almost time to think about the ghoulish in gasoline sounds of Halloween\nThis music may not sound too spooky to you but it did to it's early audience [noise]\n'cause the piano trio number five by Beethoven what was perceived as a very eerie aesthetic earned the nickname the ghost do you think that nickname works for this music [noise]\nYou hear a recording of a live performance of it by dilute the trio than about six minutes I'm Garrett McQueen the ghost by looted fun Beethoven and more coming up on music through the night [noise]\n[noise]\nFly from NPR News in Washington I'm Shay Stevens Senate majority leader Mitch McConnell says he's filed a motion to end debate over judge Brett Kavanaugh's nomination to the U.S Supreme Court\nHe says the boat on the confirmation could be held as soon as Saturday McConnell says there's plenty of time between now and then for lawmakers to review the FBI supplemental background check and to allegations that Kavanaugh engaged in past sexual misconduct members will have\nThe opportunity to review investigators records\nAnd as a standard procedure does it do to\nReduce your step numbers what's required ...\nWill be authorized debris members\nLawyers for Kevin O's principled accuser Christine Blasey Ford say they're disappointed that the F beyond reviewed did not include an interview with their client nor witnesses to corroborate her\nLawyers for Kevin O's principle accuser Christine lousy for say they're disappointed that the FBI reviewed did not include an interview with their client nor witnesses to corroborate her allegations President Trump's ridicule to Christine Blasey Ford has alienated Republican Senator Susan Collins Lisa Murkowski and Jeff Flake\nAs NPR's Tim Mak reports the lawmakers are upset over Trump's remarks at a campaign rally Tuesday night Trump\nMocked Ford's Senate testimony at a political rally in Mississippi his attack on Capitol is accuser was greeted with cheers but where is the place I don't remember\nMany years ago [noise] not so much on Capitol Hill Republicans have a slim majority in Senate meaning that Kavanaugh's confirmation may come down to three key lawmakers Here's Senator Murkowski\nAnd taking everything into\nThe president's today\nDr Ford were wholly inappropriate and it might be unacceptable\nSenator Collins called the comments just plain wrong and Senator Flake called it kind of appalling Tim Mak NPR News Washington the FBI\nHas arrested a former sailor in Utah who is suspected upstanding suspicious letters to the White House and the Pentagon the story from NPR's Greg Myre worry the FBI\nIdentifies the suspect is William Clyde Allen aged thirty nine of Logan, Utah you served in the navy and the early to thousands but it wasn't immediately clear what he's been doing in recent years he\nWas picked up after two incoming letter to the Pentagon in one to the White House were flagged just suspicious before the envelopes interred either building\nThe Pentagon says the two letters received contained caster seeds which aren't inherently dangerous but can be used to make the poison rice and the secret service hasn't disclosed its findings from the letter addressed to President Trump Allen is expected in court on friday\nGreg Myre NPR News Washington\nFirst lady Melania Trump is toward the infamous door of no return off the coast of Senegal a hub for the Atlantic slave trade Mrs Trump described it as a solemn reminder of a time in history that should never be forgotten the site is now a museum and memorial this is NPR News [noise]\nFederal judge in San Francisco is temporarily blocking the government from ending protections for hundreds of thousands of immigrants from countries afflicted by disaster or war us district judge and were chained granted a request for ...\n... for hundreds of thousands of immigrants from countries afflicted by disaster or war us district judge Edward Chan granted a request for preliminary injunction pending the outcome of a lawsuit over the issue and she was filed on behalf of immigrants from Sudan Nicaragua Haiti and El Salvador\nWho stand to lose protections which allow them to live and work in the U.S until conditions at home in prove [laughter]\nWith the help of a former Pennsylvania governor a nonprofit group says it plans to open a supervised injection site for illegal drug users in Philadelphia is WHYY Bobby Allyn reports the Justice Department is already threatening to shut it down\nAdvocates call it an overdose prevention site it's where users inject illegal drugs under the watchful eye of medical staff\nSupporters say it will save lives and move more people into treatment deputy attorney general Rod Rosenstein says if the site opens the response will be swift and aggressive because it violates federal drug laws former Pennsylvania Governor Ed Rendell is a board member of safe house the nonprofit trying to open the site he isn't worried\nA message from his Rosenstein incorporate or of the safe injection site non profit and they can come and arrest me first\nResearchers say the opioid crisis claims a hundred lives nationwide every day for NPR News I'm Bobby Allyn in Philadelphia on stock\nMarkets in Asia shares are mixed up one percent in Shanghai following slight games on Wall street chase Stevens NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major remodeled homeowners can read reviews of local pros and book appointments online at home in ...\n\nA very good evening to you and thanks once again for joining me here for music through the night if that time once again for your old classics every Thursday during this hour we present our euro classic recordings special one time on corps from concert halls and festivals across Europe that you can only enjoy right here\nThis week brings a performance from April of this year taken from a concert at Paolo day like music I cut to learn that over in Barcelona the featured ensemble is the ... big trio they play music by their namesake composer ... fund Beethoven this is his piano trio number five indie nicknamed the coast\nThe big trio they play music by their namesake composer ... than they tell me\nThis is his piano trio number five in the nickname\nThe go [laughter]\n\nTalk a\n\nNumber on\n\n\n\n\n\n... [noise]\n\n\nOr [noise]\nOr the or\n\nA\nOr\n\n\nI'm a\nOr\n\n\n\n[laughter]\n\n\n\n\n\n\n[noise]\n\n\n\n\nKnow\n\n\n\n\n\n[noise]\n\n\nThat is a\n\n[noise]\n\n[noise]\n\n\n\n\n\n\nA\n\nMan\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise] [noise] [noise]\n\n\n[noise] [noise] [noise]\n\n\n\n\n\n\n\n\n\n[noise]\n[noise] [noise]\n\n\n\n\nMm\n\nStitches members supported G. P. P. we're in Eighteen station radio network you can listen online at ... dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening\nHi I'm Sarah is asked by evening classical ... TV I get to share musical stories in to the sec Amy [noise] but I Know that went really brings us together\nTo music to relax to commute to be lifted transported\nTo music too relaxed immune to the F lifted transport it\nKind of road when words\nLeave off easy to get\nYour support keeps in music here for you good at gp dot org and click donate\n[noise]\nNinety seven point seven FM double your gp be and W. GBH the room portable Georgia Public broadcasting radio network [noise]\n[noise]\nIf you take a look at history the Hungarians had a really strong tradition of folk music composers like you're homeless Brahms even composed works inspired by them or this Hungarian folk song inspired piece was written by another [noise]\nHis name is Tom Cole died in addition to writing tons of folk inspired pieces he developed a teaching method for children still used around the world in right here in the states [noise]\nYou'll hear co dies variations on a Hungarian folk song in about six minutes time Garrett McQueen so tonko die and many others featured on this hour of music through the night [noise]\n[noise]\nLive from NPR News in Washington I'm Shay Stevens the Senate is preparing to vote this week on judge Brett Kavanaugh's nomination to the Supreme Court down at the FBI is done looking into sexual assault claims against him\nMeanwhile the White House is defending President Trump's comments ridiculing testimony by Kavanaugh's accuser Christine Blasey Ford\nNPR's Ayesha Rascoe has more\nWhite House press secretary Sarah Sanders says Trump was not making fun of for during his remark that Mississippi campaign rally during the event the audience laughed in a plot as Trump question for the count of the alleged sexual assault\nSeemed to me that he was stating facts that Dr Ford herself a laid out in her testimony once again a every single word that judge Kavanaugh has said has been looked at examined picked apart by most of you in this room\nKevin has categorically denied all allegations of sexual misconduct some Republican senators have complained that Trump's remarks\nDepart by most of you in this room cabinet has categorically denied on allegations of sexual misconduct some Republican senators have complained that Trump's remarks were inappropriate Ayesha Rascoe NPR News the White House\nA federal judge has temporarily preventing the Trump Administration from ending humanitarian protections for more than three hundred thousand immigrants and sending them home from member station KCPW Huey deed for eat a jumble of morel has more\nJudge Edward Chen says temporary protected status holders and their U.S born children would suffer irreparable harm if the Trump Administration ends TPS for nationals of Salvador Nicaragua Haiti and sedan\nBy contrast ... says the federal government failed to establish any real harm if TBS stays in place\nThat program allows immigrants from countries devastated by natural disasters or war to live and work in the U.S\nThe preliminary injunction will be an effect on the generals on the class action lawsuit brought by TPS holders and their American Kids they claim that Trump Administration unlawfully ended that protections because of racial bias for NPR News I'm fatty that jet but after I made all in San Francisco\nAnd he's won South Carolina law enforcement officer has been killed six others were wounded after a gunman opened fire on them in the city of Florence Allen hide lowers the city's police chief we were responding\n... all of us are brothers and sisters and the sheriff's office for their\n... shares we're trying to deliver a search warrant on a man barricaded himself inside the home open fire on them and police responding to the shooting he says the suspect who had been holding children hostage is in custody\nAuthorities in Logan, Utah have arrested a man in connection with suspicious letters mailed to the White House and the Pentagon to the oval contained traces of what turned out to be cast her seat they were thought to contain traces of the poison rice and which is me from a byproduct of castor oil production you're listening to NPR News [noise]\nThe U.S Senate has voted overwhelmingly to send almost two billion dollars in recovery aid to states impacted by Hurricane Florence and other recent disasters NPR's David Schaper reports that the money is part of a bill Rio authorizing funds for the aid programs to build tackles\nA wide range of controversial air travel issues it requires the FAA to establish a minimum size for\nBill reauthorized funds for FAA programs the bill tackles\nA wide range of controversial air travel issues it requires the FAA to establish a minimum size for airplanes seats to stop the shrinking of leg room and it prohibits airlines from removing passengers from overbooked planes\nIt also attempts to shorten airport security lines by boosting the number of bomb sniffing dogs at airports about funding new passenger screening technologies\nIt signed into law the bill would at ease cigarettes to the onboard smoking ban it would prohibit talking on cell phones during flights and it would set new rules for transporting animals but an effort to limit the fees that airlines charge for checking baggage and changing reservations failed David Schaper NPR News\nType area state Mike Pompeo says the United states this terminating a Nineteen fifty five treaty that affirmed friend who relations with the wrong the move came after the United nation's highest court order the list all the sanctions on Iran that effect imports of humanitarian goods\nAround argue that sanctions imposed after the U.S pulled out of the twenty Fifteen nuclear agreement where in violation of the Nineteen fifty five treaty\nFrom pale calls the claims absurd and accused to round of abusing the international court for political and propaganda purposes on Asian stock market shares are mixed down nearly one point eight percent [noise]\nIn Hong Kong this is NPR News\nSupport for NPR comes from NPR stations other contributors include ISI MC foundation working to improve postsecondary educational outcomes for under served to students the evidence based innovation learn more at ease the emcee foundation dot org\n\nComposers tonko die once said something I really agree with he said to teach a child an instrument without first giving them preparatory training and without developing singing reading and dictating music to the highest level is to build upon sand\nBecause I really believe in the importance of not only singing but folks singing and folk songs even ... music inspired by them here's an example so tonko dies variations on a Hungarian folk song\n[noise]\n\nOr\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\nAll\nRight all\n\n\n\n\n\nWhoa\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nJust as members supported TPP we're in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening\nYou for tuning into listener supported G. P. B. it's our fault fungi when we all joined together to keep the programs that you're listening to enjoy on the air right here on June ...\nI'm Leah Fleming inviting you to join us at the G ... dinner with a convenience affordable monthly contribution it's easy for you and if that were ... you can also make a one time gift to report what counts most that we hear from you right now go to ... dot org and click on donate or policy that eight hundred to two two\nIt can make a one time give to report what counts most that we hear from you right now go to ... dot org and click on donate our policy that eight hundred to two to ...\n[noise]\nOf Ninety seven point seven FM W. A. G. P. B. S. W. A. G. P. H. D. rural part of Georgia Public broadcasting radio network [noise]\n\nHow old were you when you got your first job I was Seventeen when I got my first job at McDonalds [laughter] ... know was twenty when he got his first gig as a music teacher he wrote this shortly after [noise]\nMan they didn't think he had shops that matched his heroes so while teaching he went back to school his piano trio and gee minor was one of the first of his big projects I Wonder what his students thought of it [noise]\nYou'll get a chance to grade that trio here in about six minutes Beatrix madness piano trio N. G. minor and more on this hour of music through the night [noise]\n[noise]\nFlies from NPR News in Washington ... Stevens oh one hundred US Senators and a handful of staff will get to read the FBI supplemental report on sexual misconduct claims against Supreme Court nominee Brett Kavanaugh an initial Senate vote on the nomination set for tomorrow\nA new NPR PBS Marist Poll shows more Republicans are becoming enthusiastic about next month's midterm elections as NPR's Brian Naylor reports the survey also shows Republicans have narrowed the gap with Democrats over which party voters want to see in control of Congress\nShows a two percentage point difference between the numbers of Democrats and Republicans who are calling next month's election very important in July the number was ten points in favor of Democrats and the Democrats advantage on which party Americans want to having control of Congress has fallen in half\nFrom twelve points in mid September to six points now the latest poll numbers come during a heated partisan battle over President Trump's nomination of judge Brett Kavanaugh to the Supreme Court multiple women have accused him\nThe latest poll numbers come during a heated partisan battle over President Trump's nomination of judge Brett Kavanaugh to the Supreme Court multiple women have accused him of sexual misconduct which Kavanaugh has denied the controversy appears to have fired up Republican voters Brian Naylor NPR News Washington\nThe United states is pulling out of a Nineteen fifty five treaty affirming friendly relations with the wrong the largely symbolic gesture comes after the international criminal court sided with Iran in a complaint challenging us sanctions that affect imports of humanitarian goods\nNational security adviser John Bolton says the U.S is also withdrawing from an amendment to the international law on treaties\nThe United states ... from the optional for the call and dispute resolution to the Vienna Convention or diplomatic relations this is in connection with a case brought by the so called state of Palestine naming the United states is a defendant's challenging our move our embassy from Tel Aviv to Jerusalem\n... says the Vienna Convention resolution violates us sovereignty and could have been used to sue the United states in international court\nShooting and Florence South Carolina has left a police officer dead and several others injured South Carolina Public Radio's fence called loophole reports that the suspect is in custody police say this\nAspect exchanged gunfire with officers for two hours while holding children hostage before he was taken into custody\nNeighbors described hearing burst of gunshots dozens of police cruisers swarmed the neighborhood including an armored vehicle that was used to rescue three of the wounded officers by the time the shooting stopped seven officers have been shot one fatally as well as a twenty year old male who was in the home too though it's not clear who he is or why was their\nPolice have not released the name of the shooter or the condition of the other officers at\nLeast identified the slain officer as parents care way a thirty year veteran of the force for NPR News I'm Vince cold blue go in Colombia\nAnd you're listening to NPR News [noise]\nOfficials claimed the Russian military intelligence unit gee argue is behind a new wave of global cyber attacks on political institutions and businesses foreign secretary Jeremy Hunt calls it a pattern of behavior that chose disregard for international law or established norms\nBritain's national cyber security center had already blame that you are you for the poisoning of a former Russian double agent and his daughter in England earlier this year Moscow denies any involved\nDirty center had already blame that you are you for the poisoning of a former Russian double agent and his daughter in England earlier this year Moscow denies any involvement in the attacks\nThe first moon and another solar system may have been detected with the help of the Hubble Space telescope NPR's Nell Greenfieldboyce reports that the find as exciting but still needs to be confirmed\nFinding moons is important because planets aren't the only kind of world that alien life could call home\nAstronomers David camping and Alex teaching of Columbia University now say they see signs of a moon around Jupiter sized planet in a solar system that's eight thousand ... light years away keeping says this planet appears to have a moon decides of Neptune\nYou know we're still not hundred percent sure about that but we think is the leading hypothesis\nIf they're right it would be a pretty big deal that's why they hope to do more observations with Hubble next year Nell Greenfieldboyce NPR News\nThe U.S Senate has voted to reauthorize the Federal Aviation administration and fond aviation programs for the next five years ... legislation requires to get the aid to establish a minimum size for airplanes seats set new rules for transporting pets and prohibits airlines promoting pastors from overbooked flight this is NPR\nSupport for NPR comes from dream wave maker of luxury massage chairs from Japan with shootouts you point detection and sixteen program to massage years including morning night and stretch sessions retailers nationwide more a dream wave chair dot com Andy any Casey foundation\n\nMcQueen thanks for joining me think about your early twenties for second a lot of things we're coming together all at once right\nWill ... Smith know was in his early twenties when she graduated from school landed his first job got married and had kids it was a time of celebration for smitten until he lost his two daughters to disease one loss of tuberculosis and the other two scarlet fever\nOr the response Smith in the ... the only thing he could he wrote music here's that musical response this is his piano trio n G minor it's performed here by the boat arts trio\n\n\nNa\n\n\n\nNa\nNa\n\n\n\n\n[noise]\n[noise]\n\n\nMm\nMm\n\n\nNa\nNa na\n\n\nNa na\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\nWell ... ... ... well [noise]\n\n\n\n\nOh\n\n\nNa\nOh\nMm\n\n\n\nNa na\n\n[noise] [noise]\nMm\nMm\nThose are some final fantasy by Louis Theodore groovy I'm Garrett McQueen\nThis is member supported gp beat we're in Eighteen station radio network you can listen online at ... dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening\nI'm there has been my favorite is an interview moments when the wind techie chaired a person is definitely like [noise] I Believe\nExciting and welcoming so I thought something for that [noise]\nYour support the exciting lessening\nLike a G. P. B. dot org and could donate\n[noise]\nNinety seven forty seven FM double your G. P. B. S. W. A. G. P. H. D. rural part of Georgia Public broadcasting radio network [noise]\n[noise]\n... red scare the twentieth century tarnished the careers of mini film and music industry stars Leonard Bernstein's name came up but it didn't stop them from celebrating Russian master works like this one [noise]\nHe was accused of being a communist sympathizer for his affiliation with the committee to re elect a black socialist in New York His career survived those accusations and thank goodness so I'm like these sounds could have only been produced under his baton [noise]\nBernstein leads the performance of this work nicknamed the little Russian and about ten minutes that more coming up on music through the night [noise]\nLive from NPR News in Washington ... Stevens\nSenate majority leader Mitch McConnell says he'll vote hold a vote tomorrow to end debate on Brett Kavanaugh's nomination to the U.S Supreme Court if successful McConnell says the confirmation both could be held on Saturday\nIn the meantime there's he says there's plenty of time for all one hundred senators to review and FBI's report on sexual misconduct allegations against\nAnd Saturday in the meantime there's he says there's plenty of time for all one hundred senators to review enough beyond his report on sexual misconduct allegations against Kavanaugh while\nThe opportunity to review investigators records [noise]\n... percent or the other noted [noise]\nShirts up numbers for the ...\nWill be all of the ... members\nLawyers for Kevin O's main accuser say they're disappointed that the FBI reviewed not included an interview with their client the witnesses to corroborate her story may well an NPR PBS NewsHour Marist Poll finds that more Americans believe Christine Blasey Ford than those who believe judge Kavanaugh details from NPR's just could tailor\nForty five percent say they believe for its allegations of sexual assault against Kavanaugh as described in her testimony to the Senate that is uh Thirteen point uptake from those who thought Ford was telling the truth before she testified last Thursday a third of Americans say they believe Kavanaugh\nWho strongly denied assaulting for it or ever acting inappropriately that's up slightly from before he testified went about a forethought cabinet was being truthful\nThe public perception is a shift from the Nineteen Ninety One Clarence Thomas Anita Hill hearings back then fifty six percent of Americans believe that the Supreme Court nominees denials over hills accusations that Thomas's sexually harassed her only twenty four percent then said they believed to Jessica Taylor NPR News Washington\nA federal judge in San Francisco is holding the government's plan to end temporary protected status for immigrants ... natural disasters or war at home\nUs district court judge it were Chen issued a preliminary injunction in a lawsuit brought by a number of immigrants from Sudan Haiti Nicaragua and El Salvador chance as the Trump Administration has failed to show that there's any real harm and letting the immigrant's day pending the outcome of their case\nOf Florence South Carolina law enforcement officer is dead and several others were injured after a gunman shot them last night South Carolina Public Radio's Victoria Hansen describes what led to the attack\nInvestigators say the suspect open fire the officers as they tried to serve that war edge\nThey say he was barricaded in a home with children inside\nThe kids have been taken to safety the suspect is in custody of the only thing the standoff lasted two hours some of the officers injured are said to be in serious condition no word on the reason the war was being served for NPR News I'm Victoria Hansen\nOn stock markets in Asia shares are mostly\nIn serious condition no word on the reason the war it was being served for NPR News I'm Victoria\nHansen on stock markets in Asia shares are mostly lower down one percent in Shanghai and up nearly two percent in Hong Kong you're listening to NPR News [noise]\nI'm In and Utah was accused of sending suspicious letters to President Trump into us defense officials [noise] thirty nine year old navy veteran William Allen was arrested yesterday in the northern city of Logan he's accused of mailing novel dose with traces of what turned out to be cast her seeds initially thought to be traces of the poison rice in\nBritain claims Russia's military intelligence service the G argue it's behind a series of global cyber attacks designed to undermine international stability as the b._b._c. is Gordon career reports British officials say the targets include a British television station and the U.S Democratic Party\nBritain's national cyber security fence up says it has high confidence that a group of activists belonging to the G all you often known as fancy bear was almost certainly responsible for a series of cyber attacks a previous attack in June twenty Seventeen which crippled businesses around the world including the u._k. had\nAlready been linked to the geo you in a statement the foreign secretary Jeremy ... said the G all use actions were reckless and indiscriminate and that together with allies the u._k. would expose and respond to the G argues attempt to undermine international stability\nThe BBC's Gordon career of reporting\nInternational relief efforts are picking up and central Indonesia nearly one week after an earthquake and tsunami on silhouettes ... waste the island\nIndonesia's disaster agency says at least fourteen hundred people were killed and more than Seventy thousand others are displaced the un estimates that around two hundred thousand people need assistance in the disaster self\n... NPR News\nSupport for NPR comes from NPR stations other contributors include the George guns foundation working to make Cleveland and northeast Ohio more globally competitive livable sustainable and just more information available at gun foundation dot org and the corporation for public broadcasting\n\nI'm Garrett McQueen thanks again for joining me here at around this hour my body\nBegins to tell me it's bedtime and maybe you and I share that well my overnight shift isn't over for another few hours of the body is\nIt's our my body begins to tell me it's a bad time to maybe you and I shared\nMy overnight shift isn't over for another few hours so the body is just kind of have to be patient if your place right now where you can catch some sees this team should help no this is a slumber saw for cello and piano like Frederick daily [noise]\nNa na\nNa na\n\nNa\nNa na\n\nNa\n[noise]\n[noise]\n\n\n\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n...\n\n\n\n\n\n[noise]\n[noise]\n\n\n... [noise]\n\nBut some of\n\nPeter Tchaikovsky utilize Ukrainian folk songs when he wrote that work you just heard the Ukraine in those days was often called little rush up for that reason that peace is nicknamed the little Russian symphony\nThe cello section had some nice lines and the symphony you'll hear ... alone next\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n[noise]\nMy opinion the most important part of being a collegiate music student is being a part of a studio I loved the the ... studios that both schools I attended well here's a performance by the Northwestern University cello studio\n\n\n\n", "show_name": "Classical 24", "year": "2018", "city": "Chatsworth", "day": "04"}