{"month": "10", "state": "GA", "station": "WNGH", "content": "I'm Sarah that's I think the only thing I Can't see you know and\nThis fall we're counting on the participation of everyone who listens to cover the rising cost of the programs we bring you an GB if we didn't hear from you during our fall fund drive there's still time to support the programs that make a difference in your life\nPlease take a moment now to make an online contribution good a G. P. B. dot org and click donate at the top of the page\nYour contribution at whatever level is right for you well helped cover the cost of the programs you love on ...\nThank you so much for your support at Georgia Public broadcasting [noise]\nWas Ninety seven point seven FM double your G. P. B. S. W. A. G. P. H. D. Rome part of Georgia Public broadcasting radio network [noise]\n\nWhat is the phrase olive garden's conjuring your mind\nBlooming bugs and buzzing bees would fall\nComposure I Know you hunting route to Florida\nAutumn gardens for out of our ah [noise]\nEr visits for around too far and I'll bring you his autumn gardens in about twenty seven minutes is part of extra click\nLive from NPR News in Washington I'm Jim hawk hurricane Michael is blamed for at least one does a Florida Man killed when a tree fell on his home NPR's Debbie Elliott reports Michael intensify do a powerful category for hurricane just before making landfall near Mexico Beach Florida\nMichael is making history as the strongest storm to strike the Florida Panhandle with one hundred and fifty five\nOn their Mexico Beach Florida hurricane\nMichael is making history as the strongest storm to strike the Florida Panhandle with one hundred and fifty five mile per hour when\nThose wind and storm surge have caused widespread destruction from Panama City to Appalachia cola and traits McCormick Panama City that's her ceilings caved in at the storm came ashore\nUsing here just about every ... breaking handle wanes is hitting up against the house you can tailor with something major but again if you've never experienced a hurricane or a major storm trust me this is something that you never want to go for a\nSearch and rescue teams will deploy with boats helicopters and high water vehicles Debbie Elliott NPR News quest Florida\nPresident Trump visited Erie, Pennsylvania Wednesday night trying to rally Republicans before the election Chris Potter of member station W E s a says Trump sought to damage democratic Senator Bob Casey by invoking the fight over Supreme Court ... court justice Brett Kavanaugh\nAc is up for reelection and Trump blasted him on a number of fronts including this one he joined\nLoading again Kevin\nCasey has said Trump's media quote corrupt bargain by picking a nominee from a list of pre approved by outside conservative groups but Republicans say their bases energized by the Kavanaugh fight and its allegations of sexual misconduct\nRepublican Lou Barletta has struggled in his bid to unseat Casey Barletta told the crowd that if they didn't like how have not had been treated they had to vote Casey out for NPR News I'm Chris Potter ...\nDown day on Wall street Wednesday the Dow almost eight hundred thirty one points by the end of the training session ongoing trade tensions between the U.S and China gets some of the blame as well as the steady rise in government bond yields and the Federal Reserve's ongoing tightening up interest rates\nMarket analyst alec young says higher rates are affecting businesses and consumers\nWhenever they go out to borrow money to do something to grow their business they're not having to pay a higher interest rate on that long it also means higher interest rates for consumers on their credit cards on their mortgages so consumers have less money in their pockets that can slow the economy\nInvestors pulled money out of high growth tech stocks like Facebook Amazon and Microsoft and the NASDAQ Composite index fell more than four percent magnitude six point oh earthquake struck just off the coast of Indonesia a country still reeling from an earthquake and tsunami last month or killed more than two thousand people\nI think the two six point earthquake struck just off the coast of Indonesia a country still reeling from an earthquake and tsunami last month that killed more than two thousand people believe this quake hit early Thursday I bought one hundred miles North West of the popular island of Bali this is NPR News\nSan Francisco judges ordering a new trial on two hundred of damages after a landmark judgment against the chemical giant Monsanto in August a jury awarded a total of two hundred and eighty nine million dollars to a man who says the weed killer roundup causes cancer from member station ... D Daniel Levitin has more\nDoing Johnson is a former school grounds keeper with terminal non Hodgkin's lymphoma he believed years of using roundup at work cause he had cancer and sued Monsanto saying the company's should've labeled at the product is having potential health hazards and one\nBut now judge ... says granting the requests for Monsanto lawyers to overturn two hundred and fifty million dollars in punitive damages against the company\nIn her ruling the judge agreed with the company's contention at trial that Johnson had failed to produce evidence Monsanto executives were malicious in marketing their products\nIt's unclear whether Johnson will keep nearly forty million in compensatory damages for NPR News I'm Daniel event in in San Francisco\nFederal officials have arrested a man from New York state for manufacturing a two hundred pound bomb in his basement the FBI says it was intended to be part of an election day attack on the national mall in Washington\nFifty six year old Paul ... Rosenfeld was charged with federal offenses related to manufacturing a bomb and transporting explosives\nFBI spokesman William Sweeney set in a statement that had Rosenfeld been successful a plot could've claimed the lives of innocent bystanders and caused untold destruction FBI bomb technicians safely removed the device from Rosenfeld basement and tap in New York\nI'm Joe hawk NPR News in Washington\nSupport for NPR comes from NPR's Beijing other contributors include home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major remodeled homeowners can read reviews of local pros and book appointment on line at home at ... dot com\nIt's extra collector classical music in the present tense I'm Steve seal had this our contemporary a tunnel sounds from ... Missouri I Know hunting around to borrow his autumn gardens coming up\nOr contemporary ... sounds from ... Missouri item hunting around too far out his autumn garden ... coming up\nWe'll skip some stones on the lake and will enjoy some fall color since we're all starting with a vivid one here from American culture mark ballots as she's called simply red just bought a new music Detroit\n[noise]\n\n\n\n[noise]\n[noise]\n[noise] [noise] [noise] [noise]\n\n\n\n\n\n\n[noise]\n[noise] [noise] [noise] [noise] um\n[noise]\n\n\n\n\nMark ... is the guy who would compose is just a ... to head straight up\nAttractive contemporary pieces that is a fine example there it's called simply red yeah we're here to played by the percussion new music Detroit's on extra collect\n\n[noise]\nHere's ... skipping stone by Michael fine\n\n\n[noise]\n\n[noise] how are you at skipping stones I don't think I've ever been able to get more than one maybe two balances max out of out of a try skipping and stones by Michael fire [noise]\nIran extra collecting I'm Steve seal thanks you too and again tonight uh we'll go back to a lake here after a little while I'm going to lake piece by age ... can make a little bit later\nBut first I'm an a tunnel piece here and buy a new hunting around too far down its cold autumn gardens [noise] now if you a garden\nThen maybe you don't think so fondly of what a autumn brings to your garden when things just wilt and or maybe you do the the waiting in the fall or you wait till spring you know there's not very positive association with that but if it would have the garden is big enough\nAnd there are trees and then you get to enjoy all sorts of beauty\nIf you look up and not down I suppose\nAutumn gardens by relative our here's the Helsinki all her Monica ... how's he conducts [noise]\n\nWhoa\n\n...\n\n\n\n\n\n\n...\n\n\n\n\n\n\n\n\nWho already\n\n\nMember supported keep ... we're in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B.\nWhere did gp Pete were in Eighteen station radio network you can listen online at ... dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening [noise]\nIf you recently supported gp during our fall fun drive thank you were already putting your dollars to work to bring you the\nPrograms that matter to you on the beach if you didn't get a chance to donate during the\nDrive your online contribution now will still make a difference [noise]\nPlease take a couple of minutes to go to G. P. B. dot org and click the green donate but at the top of the page thanks so much for your generous supportive G. P. B. and the service we provide every day [noise]\n[noise]\nWas Ninety seven point seven FM WG P. B. S. W. A. G. P. H. D. Rome portable Georgia Public broadcasting radio network [noise]\n\nUm ... says one of Europe's most exciting up and coming cellist his recordings like this one are proof enough in my book [noise]\nHe joined pianist and ... pots around this time last year for this performance of music by ... sounds like they have lots of synergy doesn't [noise]\nFeel here that performance in this week's edition of your old classics in about six minutes I'm Garrett McQueen and his performance and much more coming up on this hour of music through the night [noise]\n\nLive from NPR News in Washington I'm Jim ...\nHurricane my goal recently downgraded to a tropical storm has moved away from the Florida Panhandle and responders are just beginning to assess the damage the storm left does wake Doris ... from member station WFDD is that the emergency operations center in Panama City where a mandatory Korea was in effect\nThe county sheriff Tommy Ford announced the curfew will start early after reports of looting came in from Panama City police\nWill not tolerate anybody\nTony Ford announced the curfew will start early after reports of looting came in from Panama City police\nWe will not tolerate anybody looting or or or disturbing anybody else's property there's enough damage and we're not going to tolerate it one bit\nOfficial said the top priority now is to clear the roads for responders so that agencies outside the area can aid cleanup effort for NPR News I'm Delores and clean Panama City\nAt least at least ten people died on the Spanish island of Majorca after a tarantula rainstorm caused flash flooding that caused heavy damage from surges of water and mud some parts of the island received up to nine inches of rainfall and around four hours more than one third of the average yearly rainfall\nSpanish tennis star Raphael and the dog who was from ... how presidents clear ... from their houses Nobel also announced on social media that has tons of academy on the island would offer shoulder to people affected by the floods [laughter]\nBe chief justice of the Supreme Court John Roberts has referred to another circuit court the Fifteen judicial misconduct complaints recently filed against Brett Kavanaugh and the D.C court of appeals where Kavanaugh served until this past weekend\nNPR's Nina Totenberg reports the complaints all stem from Kevin O's testimony during his confirmation hearings\nThat complaints filed in the DC circuit in September in early October when Kavanaugh was still a judge on that circuit the to complaints that have been made public were brought by the Democratic coalition a political action committee and Washington the charges are the cabinet lied and violated judicial ethics rules against partisanship\nJudge who filed the remaining Thirteen complains has not been disclosed but the D.C court kicked the allegations up to chief justice Roberts for referral to another circuit\nRoberts then sent them to the tenth circuit in Colorado which theoretically could now launched an investigation but experts say that's highly unlikely Nina Totenberg NPR News Washington\nThere was a lot of red ink on Wall street Wednesday the Dow plunged eight hundred and thirty one points on them as that goes down three hundred Fifteen points and the U.S and the five hundred closed down Ninety four on his way to another campaign appearance President Trump told reporters he doesn't like the Federal Reserve's recent actions to keep inflation from soaring [laughter]\nBesides interest rates and trade wars investors are also concerned about treasury bond yields which hit their highest level in seven years on Wednesday and [laughter]\nInterest rates and trade wars investors are also concerned about treasury bond yields which hit their highest level in seven years on Wednesday [laughter] this is NPR News\nCatholic bishops in Texas are promising to release a list of all priests accused of sexual abuse as Laurie Johnson of Houston Public media reports parishes are expected to release the names early next year\nThe Texas Catholic conference of bishops says to lift will date back to at least Nineteen fifty and will include names have priests who have been credibly accused of sexually abusing a minor\nCardinal Daniel ... the archbishop of Galveston Houston set in a statement that decision is a response to calls from Catholic laypeople for greater accountability and transparency\nThan article also leads the U.S conference of Catholic bishops and has been meeting with Pope Francis at the Vatican to discuss the nationwide sex abuse scandal\nAll Thirteen hundred twenty parishes in Texas say they will publish the names of accused clergy by January thirty first the bishops also pledged to update the last when new accusations are made for NPR News I'm Laurie Johnson in Houston\nMacedonia in parliamentary committee has begun debating the constitutional amendments required under a deal with neighboring Greece to change the country's name to North Macedonia in exchange for NATO membership\nThe move comes after September ... thirty referendum on the deal with Greece which would end the nearly thirty year dispute between the two neighbors over Macedonia is name [laughter]\nA pipeline explosion in British Columbia could end up cutting off the flow of Canadian natural gas to Washington state and companies are urging customers to conserve the boy asked Tuesday evening shut dummy Enbridge natural gas pipeline about six hundred miles northeast of Vancouver\nI'm Jim ... NPR News in Washington\nSupport for NPR comes from NPR stations\nOther contributors include the ... foundation dedicated to the idea that people can live in harmony with one another and the natural world learn more about artists and its partners at our cars foundation dot org and the corporation for public broadcasting\nEvening to you and thanks again for joining me here for music through the night at that time once again for euro classics each week during this hour we present recordings from concert halls and festivals across Europe for you to enjoy as a special one time encore\nThis week's edition features ... with pianists Enrique love pots and this recording\nOr you know enjoying the special one time on for\nThis week's edition features ... ... ... ... ... ... and this recording was taken from a live performance the gate in November of last year it's music of Russian composer Sergei ... one of my favorites I think\nHe'll be one of your favorites to after you hear this this is ... sonata for cello and piano in the\nAnd\nAnd ...\n... and\nNa\n\n\nAnd\nThe ... the um\n\n\n[noise]\nMm [noise]\n\n\n\nOr\n\n\n...\n\n\n\nIt\n\n\n\n...\n\n\n[noise]\n\n[noise]\nA and\n\nIn\n\n\n\n\n[noise]\n[noise]\n[noise]\n\nThen in a\nI\nKnew\n...\n\nThere\n\n\n\n\nI can\nLiving\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\nWell [noise]\n[noise]\n\n\n\n\n...\n\n\n\n\n\nNa na\nStitches member supported gp Pete were in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for it\nListen online at ... dot org and you can find us on Twitter ... my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening [noise]\nMORNING EDITION and on second thought to political ... splits their support make everything you hear on ... [noise] if we didn't hear from you during our fall fun to hide your contribution now still make a difference [noise] please take just a couple of minutes to support the\nPrograms you rely on and enjoy on ... and do your part now at whatever level is right for you\nGood at ... dot org and click donate and thanks so much for your support of Georgia Public broadcasting [noise]\n[noise]\nWas Ninety seven point seven FM W G. P. B. S. W. A. G. P. H. D. Rome portable Georgia Public broadcasting radio network [noise]\n\nHalloween is just around the corner [noise] do you have a costume picked out\nIf not this music by Sergei Rocky Mount enough might inspiring you\nGet to pick so gloomy evening next to the shores of a dark body of water in the distance as a small rocky island from which both men is traveling back and forth it's the aisle of the dead\nYou and I are going to travel there musically in about six minutes and ... McLean rock mono style of the dead and more coming up on music through the night\n\nLive from NPR News in Washington I'm Jim Huck\nHurricane Michael slammed into the Florida Panhandle with winds of one hundred fifty five miles an hour on Wednesday splintering homes and some merging neighborhoods before continuing it's destructive church inland across to south east\nFranklin County sheriff VJ Smith ordered a curfew from sunset through sunrise to give 'em urgency cruise the chance to clear but the breed\nCatastrophic damage here there's trees everywhere\nDrawn to water a day or two National Guard there would have a hard time getting in there to some of these roads or\nDo we assessments eighth or you can even travel across\nThose are underwater DOT National Guard they would have a hard time getting in there to some of these roads are\nWe assessments eighth or you can even travel across\nThe strong also knocked out power to hundreds of thousands of homes and businesses hurricane Michael has we can do a tropical storm as it moves across Georgia and heads northeast words into the Carolinas NPR's Rebecca Hersher reports warm water in the Gulf of Mexico fueled the storms initial category for intensity\nAnd the hours before it hit the Florida Panhandle hurricane Michael gotten more and more intense it's wind speeds got higher its core got tighter and the barometric pressure inside the storm dropped lower and lower\nMichael is the most powerful hurricane to hit the panhandle since recordkeeping began in the mid Eighteen hundreds\nHurricane Michael's increased intensity was driven by hot water and the Gulf of Mexico\nThe surface temperature and the Gulf water in the mid eighties is warmer than usual and that's part of a trend global climate change is causing our oceans to heat up and that helps fuel major hurricanes Rebecca Hersher NPR News\nA Chinese intelligence official has been arrested in Belgium and was extradited to the United states to face economic espionage charges according to an FBI indictment NPR's Rob Schmitz reports\nThe extradition of she enjoyed and is a major escalation of the Trump administration's effort to crack down on Chinese theft of us technology\nShoe who went by several aliases belongs to China's main spy agency the ministry of state security sixteen page indictment details or dramatic sting operation to lure him to a meeting in Belgium to obtain proprietary information about Jack fan blade designs from a GE Aviation employee\nInstead he was met by a Belgian authorities and put on a plane to the U. S.\nG. ... was a ripe target because it builds a jet and helicopter ... for the Pentagon shoes apprehension is the first time a Chinese intelligence official has been brought to the United states to be prosecuted and tried in an open court Rob Schmitz NPR News Shanghai\nUs stocks plunged Wednesday as investors fearful and rising interest rates and trade tensions good her company profits ramped up their selling of high flying technology and Internet stocks\nThe Dow Jones industrial average fell eight hundred thirty one points is worse loss in eight months apple and Amazon to most valuable companies in the U.S will be five hundred each of their worst day in two and a half years\nThis is NPR News\nSo they have some ... five hundred each have their worst day in two and a half years this is NPR News\nI'm In the study is suggesting that for women giving birth and the United states the risk of having a life threatening emergency during or after childbirth largely depends on their race and ethnic origin NPR's Rhitu Chatterjee reports\nEvery year over sixty thousand women experience life threatening emergency requiring a blood transfusion or other life saving procedures jarring or after ... death\nThe new study looked at women who underwent that procedure between two thousand and twelve and two thousand and Fifteen study out the ... the admin isn't OBGYN at the University of Michigan\nOur data show that racial and ethnic minority women are more likely to be a fact that\nFor example healthy non Hispanic black women have a Seventy percent higher risk of complications than white women and that risk is even higher for women with chronic health conditions like diabetes or hypertension study appears in the general that tricks and gynecology read their tragedy and can use\nFederal authorities have charged a New York man with building a two hundred pound bomb in his basement prosecutors say he planned to detonate the device on election day on the national mall in Washington\nFifty six year old bull Rosenfeld was charged Wednesday with unlawfully manufacturing of destructive device and interstate transportation and receipt of an explosive\nThe FBI said in court filings at Rosenfeld confessed ordering large quantities of white powder over the Internet and that he constructed smaller explosive devices in order to\nConduct test ... nations\nI'm Jim ... NPR News in Washington\nSupport for NPR comes from Americans for the yards committed to transforming America's communities through the art and art education supporting the nonprofit art industry which employs four point six million people nationwide learn more at Americans for the arts dot org\nToday's classical music is supported by T Rowe price suffering a strategic investing approach that examines investment opportunities firsthand institutions advisors employers and individuals choose T Rowe price T Rowe price invest with confidence\nYou know cigarette modern off with confidence that death would come for him and all of us and he wrote this next work with that idea in mind this is ... I Love that\nIt is to get my mind was confident that debt which come for him and all of it and you will just next work with that idea in mind it's ... I Love the ...\nOr\n[noise]\n\nKnew\nWho\n...\nIn\n\n\nFor a\n[noise]\n\n... once described at work at six feet and two inches of Russian glue that was the ... of the dead by ... ...\n... ... alongside being a brilliant composer was the piano ... she was so well he never wrote a large chamber work that included the piano composer Robert ... and you'll hear it next\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\nUh\n\n[noise]\nI'm Garrett McQueen good evening\n\n\n\n[noise]\n\n\n\n\n\n\n\n\nAs members supported TPP we're in Eighteen station radio network you can listen online at ... dot org and you can find us on Twitter at my GP beat and Georgia Public broadcasting on Facebook thank you for listening this fall we're counting on the participation of everyone who listens to cover it\n... my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening\nThis fall we're counting on the participation of everyone who listens to cover the rising cost of the programs we bring you an GB if we didn't hear from you during our fall fund drive there still time to support the programs that make a difference in your life please take a moment now to make an online contribution good a G. P. B. dot org and click donate at the top of the page\nYour contribution at whatever level is right for you will help cover the cost of the programs you love on cheap ...\nThank you so much for your support of Georgia Public broadcasting\n[noise]\nNinety seven point seven FM W. A. G. P. B. S. W. A. G. P. H. D. rural part of Georgia Public broadcasting radio network [noise]\n[noise]\nA clever trick to get folks like you and me to remember a composer symphonies was to subtitle or nicknamed him almost all of Mendelssohn symphonies come with nicknames there's his reformation symphony the Italian and Scottish symphonies than this one called song of praise [noise]\nThe word song was inappropriate descriptor and a full performance you hear lots of singing with text taken from the Bible [noise]\nYou'll hear the Seattle Symphony performance section of this song of praise in about six minutes music of mental sending much more coming up on music through the night [noise]\nLive from NPR News in Washington I'm Jim ... most of Georgia is under the threat of heavy winds flooding and tornados as watch now tropical storm Michael continues to head north east toward the Carolinas Georgia Public Broadcasting's Steven Tyler has more\nGeorgia is one of the largest states east of the Mississippi and Michael is larger than that high winds and heavy bands of rain will continue across the state overnight\nA southwest Georgia farmers worry about pecan cotton and peanut crops others and the storm's path could be left without power and are at risk of damage from fallen trees and debris [noise]\nThere are reports of isolated tornadoes across the state [noise]\nPath could be left without power and are at risk of damage from fallen trees and debris [noise]\nThere are reports of isolated tornadoes across the state governor Nathan Deal has declared a state of emergency for over two thirds of George's County and is asking for federal declaration as well for NPR News I'm Stephen Fowler in Atlanta\nMichael came ashore Wednesday afternoon as a powerful category for storm in the Florida Panhandle where it caused extensive damage and at least one death [noise] President Trump says the White House is looking for answers and the disappearance of Saudi Arabian journalists ... NPR's Ayesha Rascoe has more from the White House\nSaid it's important to find out what happened to democracy Yogi administration officials I've talked with Saudi Arabia and crown prince Mohammed bin some on about the missing journalist ... says the U.S is asking the thought is to provide more information about the investigation\nIs very sad situation is very bad situation and we want to get to the bottom\nTo show me it was last seen entering the Saudi consulate in Istanbul that with a little more than a week ago and he has not been seen since as a columnist for the Washington Post he had been critical of the Saudi royal family Ayesha Rascoe NPR News the White House\nDown day on Wall street Wednesday the Dow last eight hundred thirty one points by the end of the training session ongoing trade tensions between the United states and China gets some of the blame as well as the steady rise in government bond yields and the federal reserves ongoing tightening up interest rates\nMarket analyst alec young says the higher rates are affecting businesses and consumers\nWhenever they go out to borrow money to do something to grow their business they're not having to pay a higher interest rate on how long it also means higher interest rates for consumers on their credit cards on the mortgages so consumers have less money in their pockets that can slow the economy\nInvestors pulled money out of high growth tech stocks like Facebook Amazon and Microsoft and the NASDAQ Composite index fell more than four percent\nA magnitude six point earthquake struck just off the coast of Indonesia a country still reeling from an earthquake and tsunami last month that killed more than two thousand people\nThe latest quake hit early Thursday about one hundred miles North West of the popular island of Bali the international Monetary Fund and World Bank are holding their annual meetings on Bali through Sunday [laughter]\nThis is NPR News\nThe U.S Forest Service plainly has an official boss NPR's Kirk Siegler reports\nThis is NPR News\nThe U.S Forest Service plainly has an official boss NPR's Kirk Siegler reports the Trump Administration has tapped interim chief Vicki Christians and to lead the agency Vicki christiansen\nHas overseen state forest in Washington in Arizona and spent the past seven years in Washington DC with the federal Forest Service\nShe's also been a wild land firefighter and has worked extensively and fire management that is one of the biggest and most important roles of the modern day Forest Service [noise] this is a highly scrutinized position she'll oversee a hundred and fifty for national forest and twenty national grasslands\nChristians and also takes over the agency at a time of turmoil her predecessor resigned earlier this year I met a sexual harassment investigation\nThe agency is still grappling with numerous complaints and lawsuits many in California over alleged sexual misconduct by supervisors Kirk Siegler NPR News\nFederal officials have arrested a man from New York state for manufacturing a two hundred pound bomb in his basement\nThe FBI says it was intended to be part of an election they attack on the national mall in Washington fifty six year old Paul ... Rosenfeld was charged with federal offenses related to manufacturing a bomb and transporting explosives\nFBI spokesman William Sweeney saying in a statement that had Rosenfeld been successful the plot could've claimed the lives of innocent bystanders and caused untold destruction FBI bomb technicians safely removed the device from Rosenfeld basement and tap in New York\nThey also recovered empty black powder canisters and bomb components\nI'm Jim ... NPR News in Washington\nSupport for NPR comes from green wave maker of luxury massage chairs from Japan with she adds to point the action and sixteen program to massage years including morning night and stretch sessions retailers nationwide more a dream wave chair dot com and the ... foundation live\nIt must have been hard hard work to carve out a full page of text on would block back in the day\nAll around the year fourteen forty movable type was finally invented and it changed the world\nAbout four hundred years later composer Felix Mendelssohn decided that he should write music to celebrate this ... centennial it's music you're about to enjoy this is part three of mental ... symphony number two it's subtitled song of praise\nCentennial it's music you're about to enjoy this is part three middle since symphony number two it's subtitled song of praise\n\n\n\nWell\n\nWe're\nAll\nYour\n[noise]\nThey're over three hundred and fifty pieces of music that have been dedicated over the years to the guitarist you just heard his name is David starting he performs those a newer works master fully alongside music up old\nHe just had a great example of its attention to that music of centuries past that was an ... by moral Giuliani\nTime Garrett McQueen things so much for your company\nDoes next work by regard Strauss almost solve the twentieth century the premier back in Eighteen Ninety eight the story that inspired it though is much older might be a story you know this is Don Quixote by record straps the Cleveland Orchestra performs here\n\n\n[noise] [noise] [noise]\n[noise]\nBook and\n\n\nOh\n\n\n\n[noise]\nNah\nOr\n\n\n\nOr\n\nA fever that was Don Quixote tape I regard Strauss performed by the Cleveland Orchestra\nPitches members supported gp Pete were in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening [noise]\nIf you recently supported gp during our fall fund drive thank you were already putting your dollars to work to bring you the programs that mattered once you ... if you didn't get a chance to donate during the drive your online contribution now will still\nMake a difference [noise] please take a couple of minutes to go to G. P. B. dot org and click the green donate but not the top of the page thanks so much for your generous supportive G. P. B. and the service we provide every day [noise]\n[noise]\nNinety seven point seven FM W. A. G. P. B. S. W. A. G. P. H. D. Rome portable Georgia Public broadcasting radio network [noise]\n\nWhat's the weirdest or even most offensive piece of music you've heard audiences over the span of history have had visceral reactions to lots of works by many composers including this one by actor barely is [noise]\nWell he considered it fantastic\nWith the help of restless nights and lots of opium he completed his symphony contest peak back in Eighteen thirty weird then but the standard now\nA movement from that company fantastic is coming up in about six minutes and then in more on this hour of classical music\nLive from NPR News in Washington I'm Jim hawk was hurricane my goal has been downgraded to a tropical storm but it continues bringing high winds and heavy rain to the southeast Georgia public broadcasting Steven follower reports local officials are gearing up to assess the damage\nEmergency crews and local leaders across the southern part of the state or waiting for sunrise to take stock of what Michael left behind the biggest casualties from the wind\nA ... emergency crews and local leaders across the southern part of the state or waiting for sunrise to take stock of what Michael left behind the biggest casualties from the wind and rain could be Georgia's row crops like peanuts and cotton and thousands of residents are without power\nThe state of emergency continues for more than two thirds of door just counties and or does governor has asked for federal help as well meanwhile Florida's governor is urging residents who evacuated affected parts of the panhandle to stay away until the full damage is assessed for NPR News I'm Stephen Fowler in Atlanta at\nLeast ten people died on the Spanish island of Majorca after I turned Joel rainstorm caused flash flooding that caused heavy damage from surges of water in mud some parts of the island received up to nine inches of rainfall and around four hours more than one third of the average yearly rainfall\nFormer FBI Director James ... says limiting the FBI investigation into Supreme Court justice Brett Kavanaugh to seven days was quote idiotic from member station WBUR GBH Maggie Penman reports\nCounty had said that seven days could be a knack for the FBI to do significant work if they were allowed to do it but from the outside he's had it doesn't seem like the agency with given free reign and the type that mine didn't make sense if the goal was finding a tree\nI'm not sure that the institutions either of the Senate or the Supreme Court well served by as limited investigation the truth doesn't hurt anyone the institutions is supposed to be devoted to the truth so I was a little frustrated by the shock to begin with seven days\nComey sat in a normal investigation the agents are able to follow any logical ... and it seems like there would be more logical lead than just four or five and ... for NPR News I'm Maggie Penman in Boston\nThere was a lot of reading on Wall street Wednesday the down plunged eight hundred thirty one points while the NASDAQ was down three hundred Fifteen points and the U.S and the five hundred closed down Ninety four on his way into another campaign appearance President Trump told reporters he doesn't like the Federal Reserve's recent actions to keep inflation from storing\nBesides interest rates in trade wars investors are also concerned about treasury bond yields which hit their highest level in seven years on Wednesday\nPresident Trump signed two bills aimed at drug prices the bills which passed with broad bipartisan support me in that insurers will no longer be able to bar pharmacist from telling consumers when paying cash would be cheap\nISIS the bills which passed with broad bipartisan support me and that insurers will no longer be able to borrow a pharmacist from telling consumers when paying cash would be cheaper than using insurance for their prescriptions one bill applies to private health insurance the other to Medicare this is NPR News\nIn Washington state officials are requesting more wildfire management money than ever before as the Northwest News network's Emily ... reports the fifty five million dollar funding request is more than double the previous amount\nForest in Washington state or overgrown and writes for wildfire and that's why the state's commissioner of public lands Hillary France is calling for a doubling of the state budget to improve forest ... wildfire part\nFor the last decade Washington legislature it's allocated about Twenty one million dollars on average\nTo manage and fight wildfires but the state's department of natural resources has had to go back every year to ask for more than twice that the new budget request would front end funding to make more resources available and create more fulltime firefighter positions for NPR News I'm Emily swing\nMacedonia in parliamentary committee has begun debating the constitutional amendments required under a deal with neighboring Greece to change the country's named to North Macedonia in exchange for NATO membership\nThe move comes after uh September thirty referendum on the deal with Greece which would end a nearly thirty year dispute between the two neighbors over Macedonia is name\nA pipeline explosion in British Columbia could end up cutting off the flow of Canadian natural gas to Washington state and companies are urging customers to conserve\nThe blast Tuesday evenings shut down the Enbridge natural gas pipeline about six hundred miles northeast of Hoover I'm Jim Huck NPR News in Washington\n\nSupport for NPR comes from the ape and either Cooper foundation commemorating ... Cooper by supporting public radio programming that highlights issues including diversity racism equality anti Semitism and sexism and the corporation for public broadcasting\nLeonard Bernstein once described actor barely as a symphony fantastic as the first musical expedition into like a daily [laughter] he said this because of the word to loosen it tore nature he also noted that because history\nIt has the first musical expedition into like a deal yeah he said it's because of the word to loosen it tore nature\nHe also noted that because history suggests barely as composed to at least a portion of it under the influence of opium all over time this pieces culturally and the furious origin was out shined by it's brilliant it's one of the great work setting up the nineteenth century\nBecause the first movement of it performed by the Detroit symphony orchestra\n[noise] [noise]\n\n[noise]\n\n\n[noise] [noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\nWhoa whoa whoa whoa\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n\n[noise]\n[noise] [noise]\n\n\n\n\n[noise]\n[noise] [noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n[noise] [noise]\nTo\n\n\n\n\n\n\n[noise]\n\n[noise]\n[noise] [noise] well [noise] well [noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise] [noise]\n\nWell [noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n[noise]\nUm\n[noise]\nUm\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise] [noise]\n\n\n\n[noise] [noise]\n\n[noise]\n\n[noise]\n[noise]\n\nHave really fond memories performing that music of Lou ... son Beethoven that was his quintet for piano and when you heard performed by de Mello ensemble the nearby BBC pillar Monica wraps up this hour classical music next\n[noise]\n\n[noise]\nI'm Garrett McQueen thanks so much for coming along\nYou've heard of romantic comedies right\nWell how about romantic adventures that's the category the French novel by moon show was put in if I was the story of contraband runners into Basque regions of France that novel ended up inspiring several adaptations including for films and I play with music by French composer ...\nHere's a bit of that music the ... sweet number to like ...\n", "show_name": "Classical 24", "year": "2018", "city": "Chatsworth", "day": "11"}