{"month": "10", "state": "GA", "station": "WSB", "content": "And the bad news I heard all day I'm downloading that happen right now or do you have the radio ads downloaded out in the store\n[noise]\nNow what do you ask me is broadcasting University of Georgia board ...\nPi by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on that when you asked me radio up north to W. S. B. radio dot com field and and I hard here the game as\nBulldog talk on ... about them on your radio and on AMC seven fifty U. S. B. W. F. B. programming continues here at a later our\nNormal depend on it [noise]\n\n\n\n\nMy job to be on the road a ... hour\nBe breaking weather and traffic you've been going on now on your\nDo you ever do you ask me radio I listen to the latest WSBIU more traffic on on demand way\nLive\nCoverage on the news people you depend on the radio ads downloaded out the door\nAnd Google Play [laughter]\nBusy I hate it when I this white in gym to pre\nStorm didn't release power\nWould be the guy you know you can listen to WIP anytime anywhere with a double USB radiolab paid all their their latest news in traffic on demand is always the beer weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio and download it out in the dark and play [noise]\nNow what do you ask me is broadcasting University of Georgia board somebody bought by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on WSBIU radio up north to W. S. B. radio dot com tune in and I hard here the game as\nBulldog talk on these ... them on your radio and\nOn a um seven fifty W. S. B. W. F. B. programming continues here at a later our normal and on it [noise]\n\n\n\n\n... power\nCan be bringing\nWeather and traffic you've ever and on now on your skin\nW. W. F. B. radio I listen to the latest WSBIU or traffic on longer than an\nAllied came from the people you depend on the radio I downloaded out in the outdoors\nNow what do you ask me is broadcasting University of Georgia ... buy them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up or through W. S. B. radio dot com tune in and buy hard here the game as\nBulldog talk on these ... them on your radio and on a um seven fifty W. F. B. W. F. B. programming continues here at a later our\nNormal and on it [noise]\n\n\n\n\n[noise] [noise] [noise] morning workout\nBusy I hate it when I miss white and Jamie brain when storms and we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab Peter all their their latest news in traffic on demand is always severe weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading data right now to do what do you have the radio and downloaded out in the store and go play [noise]\nThat what you asked me a broadcasting University of Georgia board somebody bought by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up or through W. S. B. radio dot com tune in and I hard here the game and\nBulldog talk on these ... by them on your radio and\nOn a um seven fifty W. S. B. W. at the programming continues here at a later our as normal and on it [noise]\n\n\n\n\nYeah my job to be on the road ... power\nBe breaking news weather and traffic you've and on now on your\nDoor you had to do when you ask the radio waves until the latest WSBIU more traffic on on demand and\nAlive continuing coverage on the people you depend on the radio ads\nAnd Google's lay [laughter] morning\nI'm busy I hate it when I miss late and James\nWhen it storms and we lose power what gives you the guy you know you can listen to W. S. C. anytime anywhere with a W sb ... all their their latest news in traffic on demand is always severe weather coverage what about when something happens freaky news staff it's your station on your time\nAnd the bad news I've heard all day I'm downloading not outright now do you have the radio ads downloaded out in the stores and go play [laughter] [noise]\nSo what do you ask me is broadcasting University of Georgia sports on Ninety five five FM am seven fifty new to broadcast restrictions we cannot offer the UGA sports presentation on USB radio up north through double USB radio dot com tune in and I hard here the game and\nBulldog talk amused ... him on your radio and\nOn AM seven fifty W. S. B. W. F. B. program and continue here at a later our as normal that can do that [noise]\n\n\n\nI'm a jumped on the road ... storms and we lose our\nBoys that can bring in weather and traffic you've ever end on now on your\nDoor you had to do when you asked me radio I listen to the latest ws for traffic on on demand and\nListen live people depend on the radio out downloaded\nThat when you ask me is broadcasting University of Georgia sports on Ninety five five FM idioms seven fifty broadcast restrictions we cannot alter the UGA sports presentation on WSBIU radio off\nOr through W. S. B. radio dot com and as I hard here the game and bulldog talk on music ... them on your radio and on a um seven fifty W. S. B. W. S. B. programming continues here at a later our\nNormal depend on it [noise]\nTurned to the experts\nTell us maybe about ... er Cox media group station [noise] twenty four hour news weather and traffic dies and am\nMe to me [noise]\nNow [noise] good evening at\nTen o'clock I'm Bodie Brooks live in the ws be twenty four hour news center leading us off this hour and a lot of guys and the ws be twenty four hour traffic center where the traffic red alert Maloney that red alert is in ...\nCounty it's two eighty five southbound the interlude multi multi vehicle wrecked their Wright Patt Covington highway exit forty three all lanes are currently blocked they'll watching the ws be jammed camps they may be opening some lanes soon we'll have more on that coming up Bodie\nYou could um by half of the islands and the British Virgin islands because the total GDP of the British version island says about nine hundred million dollars so here seriously what you ought to do if you win the lottery first number one tell nobody that you want not even your spouse\nI especially your spouse don't tell anyone as soon as you tell anyone everyone's going to know and that's really\nScary because not only you're going to be bombarded by requests for money from family and friends but also total strangers your safety is also at risk and I'll talk a little bit more about that in the second so when you win the lottery what you need to do is take that ticket and keep it somewhere safe\nLike a bank safe deposit box no not not under your mattress not somewhere and you know a secret police my house no\nAntibiotics that positive box do not signed the ticket not yeah\nWhat I Want you to do is to photocopy photocopy both sides and then put it in a safe deposit box then get a lawyer get in the state attorney someone who is expert and experienced in dealing with wealthy families because guess what you're not wealthy\nAnd left the lawyer tell you how you should sign the ticket should use on it and your name only should it be join with your spouse should you put it in a trust should you have an owned by an el ... limited liability company\nYou want to get legal advice tax advice financial advice you need a lawyer you needed a CPA and you need a financial planner\nBecause if you don't handle this correctly you've got to be aware of the studies that have been done on lottery winners there is a preponderance of bankruptcy we're not going to a lottery winner go bankrupt hey Michael Tyson had three hundred million dollars and ended up bankrupt\nPeople think it's a bottomless pit more okay one point six billion is pretty bottomless but it's not it's only four hundred and Ninety two million that've taxes in a lump sum\nIt's not a bottomless pit like you think it is and when you start throwing out a lot of money to family and friends and charities you'd be amazed how fast you can plug the cash so a lot of lottery winners end up bankrupt they end up divorced they end up with drug and alcohol abuse they end up with suicide\nThey lose their jobs are friends even their family and if you're going to say on the kid growing in my work every day like always know you're not you know why because every time you show up at work all of your co workers are gonna be resentful\nBecause they got to be there because they need the money and you don't and they know it and if you're going to go out to lunch and not treat everyone\nYou're going to be a pariah so if you think your life's not going to change Oh yes it absolutely well you're going to lose all your friends you're going to be ostracized with family if you don't give them enough money to satisfy what they believe\nIs how much money you ought to give them\nSo in addition to having a lawyer and an accountant and a financial planner you need a personal security team as well the first thing you've got to do is get out of your house because everybody knows where you live easily do Google your address not only strangers but crux\nMight come and do you harm they might come and challenge threaten your family members in order to uh extort from you blackmail you\nSo you need to go to an undisclosed location choose a sweet ... threats we were me and have a security detail around you your life is going to change in ways you've never thought possible because you need personal security and when it comes to gifts to families and friends well let's think about this for a minute\nHow much money you're going to give your mom you just netted after tax four hundred and Ninety two million dollars unless you give them a million bucks you ...\nCome on you're going to give her ten million Ninety million dollars how much given your mom\nHow much you've given your dad how much you've given your brothers and sisters how much you've given your children your grandchildren let's say that you decide to give ten people ten million dollars a piece that is a hundred million dollars guess what\nDidn't give away a hundred million dollars because when you give away a hundred million dollars you know my friend knock them you have to pay a gift tax\nGuess how much the gift tax is forty percent\nWhich means if you give away a hundred million dollars you incur a forty million dollar gift tax now you've just spent a hundred and forty million dollars so\nOf the four hundred and Ninety two that you did you just gave away a hundred and forty of a year now down to three fifty\nWe haven't even talked about charity\nLet alone Bentley's do you see my point my friend you got to recognize that winning the lottery\nRequires a massive change and lifestyle\nMassive calculation and preparation and planning because your relationships are going to change with virtually every one you're not going to be able to trust anyone because they're all going to be wanting to know what you can do for them in whatever you do for them ain't got to be enough in their opinion\nLet me give me another reason why I didn't buy a lottery ticket instead of buying a lottery ticket if you were to say take the money you would have spent on three lottery tickets three dollars a day instead of buying the lottery every single day you take that three dollars and you invested into the S. and P. five hundred stock index and you do that for forty five\nYears I'm On a bet you'll have more than a million dollars guess what you'll have won the lottery of course pest performances ... future results any social the contras a federal ... portions and therefore my friend now you know why [noise]\nI didn't buy a lottery ticket because as I often say to friends and family well okay not friends and family what I often say the enemies may you win the lottery because it's often the worst thing that can never happen to you and I mentioned all of this for one simple reason\nTrying to make you feel better for not having one\nSubject aren't you glad that you didn't win the lottery I thought so that's why I'm here to help you make you feel good and the reason I'm trying to make you feel good is because you probably have been noticing that not only did you not win the lottery on Tuesday\nYou saw the stock market meltdown on Wednesday\nAnd you did notice that not only didn't get much you've got a little poorer because of the stock market's performance and we're going to talk about the stock market\nAnd what it means for your investments and what you should do about your investment strategy as a result of the new volatility that we're experiencing in the stock market and the bond market and the real\nEstate market in the market\nWe come back here on the show\nOn line at rice dome and dot\nHost of the PBS TV series the truth about money coming up on a ... show [laughter]\nSeventeen Kuwait carrier W. S. B. twenty four hour traffic center had he delayed and the cat county because I'm a multi vehicle racket ball lean toward belong to any find southbound pass coming can highway exit forty three\nNow it looks like and the devil USB GM can be open up most lanes right wing bloc expect lingering delays they're speaking of DeKalb County they've got roadwork on the outer lead to eighty five north down between\nMemorial drive and east punch church street exit forty right lane Blount there are a travel advisory he's in effect in Cobb County because of roadwork\nSeventy five north down past windy hill road to south near yet a parkway exits to sixty to two sixty three only two left lanes open use highway forty one as an alternate how money kind double us be [noise]\nMillions of people unite to do good for others on this make a difference day and we're trying to make a difference every day here in ... Chevrolet your destination for Chevrolet fears Enrique's Journey\nBy yeah we made a difference for for not sound like forty nine credit we prefer eight point nine percent on twenty eight teams are not going to\nLet us make a difference for you find new energy landed dot com foresee us at ... Chevrolet in Duluth\n\nLast year the Dow Jones industrial average was up just over twenty five percent everything was so good even the self help experts were giving out investment advice but you also saw a lot of fear fear of missing out in fear of crashing the\nHere's the thing here is an emotion not an investment strategy if you're making your own investment decisions emotion plays a role whether or not you realize\nSo make twenty Eighteen the year that you keep beer out of your portfolio make an appointment with a financial engines advisor today and get a solid logical financial plan for your future one that helps take some of the fear out of the equation because self help is for ... not your financial security and retirement\nGet you financial engine dot com today [noise]\nHi I'm Bruce solved with financial engines here in the Atlanta area I'm ready to work with you to help make your financial goals of reality and go to financial engines dot com or call for oh four six zero two fifty two hundred today\n\nWelcome back to the program you're listening to the risk at all then show it's the truth about money I'm very happy very excited to welcome forty new affiliate radio stations to the ... show we're now broadcasting this program to eighty five\nRadio stations across the country or this program is the longest running national personal finance radio show in the nation are talkers magazine has ranked me one of the top one hundred talk radio show hosts in the country\nAnd the number to talk show hosts that airs weekends only uh so we're very excited to be welcoming all of you who are listening to the Rick Edelman show for the first time\nThe steel thirty eight thousand dollars worth of guns and the charity cash that gun group raised at a gun range in Roswell they smashed vehicle windows wild remembers rat a restaurant police say the it's got away with Eighteen guns from three cars and money to fight breast cancer\nNewly wed DeKalb County woman is dead and her husband in intensive care after a man's by their car with bullets Monday Night at a ... a police have arrested Nineteen year old Carlos Rodriguez for the murder of thirty five year old uh Elisa Stevens W asked me news times ten thirty one\nBrian ... Georgia's future is in your hand follow Georgia's race for governor every day we got played Erick Erickson and the ... the largest news team nobody covers Georgia's elections like news Ninety five five AM seven fifty do when you asked me penned on it\nYou hear nagging little voices in your head telling you all the things you need to do\nThis is Dave Baker get your fall for us to know that North Korea factory authorized carrier dealer\nKorea super seizing their know breakdown guarantee with a credit up to two hundred and fifty dollars toward any repair if you're\nFurnished breaks down after your safety check in tune up this winter just sign up for a cooler a cool care maintenance agreement and you'll get two hundred and fifty dollar credit on any repairs through march they also helped get rid of all those voices in your head Korean carrier turned to the experts\nIf you know\nAnd this and what happens [noise] yeah well it's more than just annoying it could be a sign of a serious health problem called sleep apnea renews lead solutions can diagnose and treat\nSleep apnea and beginning with an easy ... and they work with your medical insurance so there may be little or no out of pocket costs deal because seven seven zero three seven one ten twenty two now to learn more what didn't renew sleep dot com [noise]\nDeli as being used on ten thirty two nine to ... now with a look at the rose money ties and it'll be it'll be twenty four hour\nTraffic center having delays DeKalb County because of a wreck I really find found found in the past having can highway exit forty three right lane but a lot there you've seen delays ban kid memorial and travel advisory\nSeventy five north balance Wendy hill road to health Mariana ... only two left flank open because of roadwork traffic raunchy by John ... associates car accident get to strong arm\nJohn ... associates personal injury law free consultation pay nothing unless you win contact Gianforte twenty four seven Gianforte dot com oh any kind of all us be [noise]\nYou know I'll just grab it with the most accurate and head of a weather forecast\nMostly cloudy breezy and cool through the day temperature struggling to make it out of the fifties most areas and then overnight and into tomorrow morning with a clearing sky will fall back into the forties about forty six to start Sunday Morning then mostly sunny and Seventy tomorrow afternoon on Monday sunny low fifty high Seventy one\nForty seven degrees on the street street at ten thirty three with news on the hour and a half and winter break sign Bodie Brooks on news Ninety five five and am seven fifty W. S. B. depend on it\n[noise]\n[noise]\n\nWalking back to the elements show we invite you to send your questions by audio and that's exactly what George did here says question he sent to ask wreck at ... dot com\nI read this is George from California my in laws are both over eighty five years old and have an investment balance that likely could pay for a long term care for those is needed\nMy question is should they maintain any stock investments since they could earn over three percent in bonds and it is unlikely their life expectancy will expose them to significant inflation risk so Rick what do you think thanks\nSo that's a great question George and a lot of folks face this question in my older years I'm In my seventies my ... my nineties I have far more money than I Will ever need to spend even find curb massive medical costs are long term care costs\nBetween pensions and Social Security and the money I've accumulated over my lifetime I have lots of cash and I'm not spending it because I live kind of frugally\nSo therefore we would argue traditional financial planning strategy would argue that you should place all of that money in very conservative investments you should put the money into bank accounts you should put the money into treasuries you should put the money into guaranteed\nInvestments that they might not pay much an interesting not only pay one or two or three percent puts so what you don't need to earn high returns it's more important that you have protection of your money then you try to double your money because doubling it isn't going to change your lifestyle but losing half of it could\nSo traditionally we would argue don't take any more risk than is necessary\nTo achieve your goals\nBut let me turn that inside out and give you a different reason why you might want to consider\nA riskier investment strategy and their strategy that includes investing in stocks to some perhaps even significant degree\nBut say they've got a few million dollars saved\nAnd you're hardly touching it and you don't think you'll hardly ever touch any of it because you get plenty of income off of that money you've got plenty of income from pensions and Social Security you only spend a few thousand dollars a month your house is paid for your expenses are low\nAnd you've got this money now ordinarily I Would you know we would say like I said a moment ago\nPut the money into those call today but think about this when you die\nWho gets that money\nI'm willing to assume that you are going to leave that money to your surviving spouse and ultimately to your children and your grandchildren\nIn other words if you have a very high degree of confidence that this money will outlast you and will ultimately be transferred to your kids and grandkids you could argue\nThat that money really isn't yours it's ... and you are merely the steward of that money\nYou're the custodian your the caretaker of that money and if you know that you're going to transfer that money to your children and grandchildren who will use it for their lifestyles and their personal financial needs and the achievement of their financial goals\nWell then maybe we should be investing the money with their goals in mind\nMeaning that if your son or daughter had the million dollars they invested in stocks because they would have a long term time horizon and they would want to earn a return that net of taxes and inflation is growing and real economic terms\nTherefore we could argue you should be investing the money not based on your age but based on ... and if your kids are in their fifties or sixties if your grandkids are in their twenties or thirties then maybe you should invest in a portfolio allocation that mirrors them and not you\nKnow we want to make sure we're not doing so to the point that we are really placing you act financial risk or jeopardy\nBut I think we could strike a healthy balance between protecting you for your lifetime while also having an eye toward the legacy of protecting your children's financial futures as well\nAnd on that basis we could in fact argue that you should have stocks in your portfolio\nTo what degree should it be ten percent of the portfolio fifty percent of the portfolio somewhere in between the only way to know for sure is to meet with us all sit down with one of my colleagues here at the firm\nSo that we can examine the entire family dynamic\nLook at what your true expenses are relative to the income available and the resources and designed what that strategy might be taking into consideration the circumstances with your children and grandchildren so don't automatically assume that the older you get you shouldn't have any money in stocks\nInstead look at it as an intergenerational family dynamic because after all that's exactly\nWhat it is so George thanks so much for your question if you would like to have this conversation with us you can do so just calls the triple each plan wreck or visit us online at rice element dot com\nYou know we've got some of the aftermath of Hurricane Florence and Michael we've seen just astonishing devastation those storms came so quickly especially Michael\nAnd left so quickly but a huge amount of damage in the wake a gene and I are heavily involved with the boys and girls clubs of America and\nWe have now gotten reports from them that Thirteen of their clubs sustained damage\nFrom Florence and Michael significant roof damage water damage ruined computer labs and game rooms one administrative building was destroyed one of our staff members had a heart attack and died\nSix staff members lost their homes and so I Want to mention to you if you are so inclined and looking for where you might be able to provide financial support to the victims of Hurricane Florence and Michael I encourage you to go to the boys and girls clubs of America Bee Gees E. A. dot org\nTaking telephone calls here on the record all been show or heading off to pleasant rage Michigan Kirk you're on the air how are you\nHi Rick thanks for taking the call and very good happy to how can I help I have a\nQuestion regarding financial literacy I have a twelve year old son and a ten year old girl who I talked to a lot regarding the importance of managing debt saving money and investing for the future they both shown some interest but more so my son\nI got a book from the library which my son read the entire thing and when it's very excited when he read something about how to invest you know three thousand dollars for my summer job into Iraq IRA\nIn forty years later it's worth a you know big number\nIt was all excited he told me dad I'm going to be a millionaire Sunday so\nI'd like to continue um you know that thirst for knowledge but didn't find anything more at the local library for him to read however I Would also like him to learn more about life general financial realities things such as various bank account savings checking credit unions how to balance a checkbook\nUm various kinds of insurance credit card in credit card debt and then just also investing for the future so I'm Wondering what books or digital media would be available for his you know that would be age appropriate\nFor him yeah I'd awful like a a word book or software to go along with it so it can ... provide like hypothetical examples for him to work through their anything out there like that\n... Kirk on going to give you the applied\n[noise] ah the Selig aged and so focused on financial education for your kids\nYou know we lament in this country that there is a substantial amount of financial illiteracy\nAh parents seem to be talking to their kids about everything these days religion politics drugs sex but they're not talking about money\nSo I'm really glad that you are because we have so many Americans growing up financially illiterate they're not taught me this and K. through twelve or they aren't getting any college classes on it and employers are certainly not telling them much about money so I'm really glad you're getting your kids off on the right foot\nI'm going to give you two answers\nFirst is my first book the truth about money\nOr that book is considered a classic in the field a personal finance was named book of the year I'm by the Institute for financial literacy when it was first published\nAnd it covers everything about personal finance from getting out of debt and dealing with credit all the way to multimillion dollar states and everything in between\nUh and the first three parts of that book are really aimed perfectly for your children understanding what is money held his money work of understanding compound growth\nA and the very basics of money so I Would encourage your kids to read the truth about money second\nOn going to direct you to a website called jumpstart dot org\nThe jumpstart coalition for personal financial literacy is a nonprofit organization that serves as a clearing house they collect\nUh information and resources from dozens maybe even hundreds of organizations academic organizations nonprofits government agencies as well as corporations that produce financial education materials\nThe jumpstart coalitions materials are almost all free all of it's available on line that jumpstart dot org it's designed for teachers and parents of kids K. through twelve\nSo if you go there you'll find a wealth of data information articles videos work books quizzes all kinds of information that you can use to help foster your children's educations\nI Will definitely do that right thank you very much\nYou're very welcome cook thank you so much for the phone call you can do with Kirk did and call us the triple late plant wreck that's triple eight seven five to sixty seven forty to whatever your personal finance question we're ready to help you and you know Jim in higher\nSo focused on financial education financial literacy that's why we spend so much of our effort it's why I've written nine bucks and gene has written one of her own\nAnd why we do so many seminars this year I think we'll be doing eight hundred seminars by the time of year is out across the country and why I Do this radio show every week for you and why we do television specials for public TV around the country\nWe are really focused on financial literacy because we know what a problem it is and how so many Americans are just\nIlliterate when it comes to the subject and it's why I'm very happy to tell you Jean and I have written together a first book uh and it's for children\nThe book is called the squirrel manifesto it's being published by Simon and Schuster and is being released November twenty about a month from now\nAnd it's our first kids' book it's aimed at children ages four to eight and it teaches children the most important fundamental lessons about money so I encourage you to go to Amazon dot com Barnes and noble dot com your favorite book seller and pre order the book right now\nSo I encourage you to pick up a copy of the squirrel manifesto available to you at your favorite book seller hope you pick up a copy\n[noise] thanks for being with me here on the program this weekend and let us know if we can help you AAA plan rests on line of lifestyle ... remember he loves the show some friends that have to show some of the ... [noise]\nYes\nI proved about money every weekend on the ... show [noise]\nInvesting census brought to you by financial engine sanitizers that are throughout the United states including your local advisor to financial engines advisory centers provide investment advice we services to the clients use in research and announces performed by the research team\nInvestment advice provided to reach advisors center serves the needs of each individual client and may or may not include\nFunds mentioned in today's broadcast listeners should not consider today's discussion is the recommendation of any fund or investment products into carefully evaluate any investment before investing the advisory centers do not provide tax or legal advice consult attacks professional or lawyer for help protection legal matters individuals who invest with their local financial engines advice for Senate will incur management fee but not Los in addition to the management fees\nAnd other expenses charge by the phone companies were discussing ... an exchange traded funds during this broadcast the research team recommendations main food\nLocally funds that are only available through certain trading collect coins\nMiddle one's in exchange traded funds like other investments Everest of lost as reference on the show term life insurance products are offered through the M. F. S. insurance agency yellow sea in states where license which does business is low cost like insurance agency accepting California advisory services are provided by financial engine advisors out I'll see a federally registered investment advisor\nBoth entities subsidiaries a financial interest in Lincoln's advisors that'll see north always receive any conditions or for all these from Memphis insurance agency ... certified financial planner border seventeenth also certification ... certified financial planner and the U.S which is the worst individuals who successfully complete sea ...\nInitial and ongoing certification requirements see a phase a registered trademark ... Institute please visit financial engines dot com ... information\nYou're Affordable Care coverage isn't affordable at all that now you have the power and the national PPO noted out to those and no huge Obamacare premiums with new era health plans call seven Senate now six to eight fifty nine fourteen more at our plan rocks dot com\nIf you are struggling to find job related how for your town the disability county now the ... mountains and people with disabilities find meaningful employment locally people likely since I'm\nTired of it than I Am I signed the training I mean very confident and you need to take an independent don't worry about him being able to park and banks coming at a ... ... how big\nI mean ... continue to impact families in our community by donating cars are a monetary gaffe now ...\nLast year the Dow Jones industrial average was up just over twenty five percent everything was so good even the self help experts were giving out investment advice but you also saw a lot of fear fear of missing out in fear of crashing\nBut here's the thing here is an emotion not an investment strategy if you're making your own investment decisions emotion plays a role whether or not you realize\nSo make twenty team the year that you keep fear out of your portfolio make an appointment with a financial engines advisor today and get a solid logical financial plan for your future one that helps take some of the fear out of the equation because self help is for ... not your financial security and retirement\nTo financial engines dot com today [noise]\nHi I'm resolved with financial engines here in the Atlanta area I'm ready to work with you to help make your financial goals are reality go to financial engines dot com or call for oh four six zero two fifty two hundred today\nWhen you ask me about ... Cox media group station\n[noise] twenty four hour news weather and\nFive and am\nAsked me to\nIt's I live on the clock I'm Charlie O'Brian live in the ws maybe twenty four hour news center top story this hour WSBIU stop national story at least eleven people are dead after\nA gunman opened fire at a Pittsburgh synagogue today ABC's taught and with the update\nA of charge the suspected gunman in a massacre that killed eleven people at a Pittsburgh synagogue with twenty nine charges including using a firearm to commit murder at eleven kinds of obstruction of exercise of religious beliefs resulting in death federal investigators say Robert Bauer is targeted worship is because of their faith but likely acted alone\nThis latest act of violence may change our law enforcement treats these acts of homegrown terrorists Steve Gomez is a former special FBI agent and ABC News consultant\nWhat if something's already at a high price and it falls well shorting was short selling as a way for us to profit from that and I'm going to give it a real world example here\nLooking at ... clack gets Kaylee ten core ticker symbol K. L. A. C.\nAnd they've been around a long time in ... near and dear to the heart of honor I treat academy used to be a stock that a lot of people used to learn on trade back a few years ago but the clock as early as September ... September or early September it was right around a hundred and twenty dollars a share\nI so if you got to buy a hundred shares that'll cost about twelve grand and so what's important to understand is that as the market started to fall we started losing the technology sector because this stock sits in the technology sector there's been up to to make money when it fell\nAnd so shorting short selling would have been a really good opportunity if you understood what to do and so clack Kaylee sea in early September trading at a hundred and twenty bucks this year and now here's the thing that a lot of people get confused on\nHow can I make money selling something if I don't already own it in other words how can I sell ... if I don't if you buy at the store with well that's the beautiful thing about the financial markets that are broken will allow us to sell shares of their inventory into the market before price falls\nWith the goal of us than buying it back and giving it back to the broker after price fall so let me give an example on ... let's just say um September eighth of tens of right around that time you decided to use the clock was going to fall in price and you went to the markets and you said I Want to sell a hundred she has a clock\nNow it's a hundred and twenty bucks a share so your broker would basically say okay we have inventory that you can sell and we'll let you utilize our share of clock to sell into the market at a hundred and twenty bucks a share so what we're doing is we're going into our trading platform we're executing a short sale\nAnd what that does that sells a hundred shares of class into the market at a hundred and twenty bucks a share on our behalf\nNot understand we don't own stock broker owns the stock they're allowing us to utilize their shares to sell into the market at the market price which was a hundred and twenty\nSo we do that now with considered short the stock now here's what happens\nWe believe prices going to fall well here seven weeks later clocks at Ninety and it's it's actually happened so we're using a real world example at clock at Ninety you decided at night and you're gonna bite back so when you go into the market and buy it back it costs you Ninety bucks this year to buy it back when you sold it you took it a hundred and twenty\nWhen you bought it back because you're Ninety\nNow the moment you bought it back to share that came out of your brokers they've been toy originally now when you buy back immediately go back in your brokers and mentor in other words they're made whole with their share the clock they got their stock back\nNow what did you do well you sold at a hundred and twenty and seven weeks later you bought it at Ninety think about that you bought low and sold high you just sit in reverse order that's the beautiful thing about the markets we can do that\nIt's a real strategy it's called shorting short selling and that's what we're talking about we barely drum every week you need to understand how to make money regardless of direction and because of that you just made thirty bucks a share on the stock that fell that you've never own think about that\nSo in a hundred shares you made three grand on a thousand years so you make thirty grand\nThink about that folks that opportunity is real and exist and it happens all the time in the market and we get movement down like machine a lot of lately there's tremendous opportunity in the market now imagine if the Ehsan ... forty to fifty percent like a lot of people are calling for magic view is short that position\nWhat could that turned into your financial life seat the beautiful thing about the markets is up is good and down is good once you realize that it's a game changer\nWell exactly and that's why online trading and kept me the sponsor bulls and bears they teach people how to short so\nThey teach people how to capitalize on a downward moving the market the average person knows it can happen they don't know how to do it\nAnd that's why they teach those classes a five hundred dollar class that they teach at the campus and we actually have a few seats in this class to give away the losers right now now if you have money out there in the market in the ... and the IRA if you're concerned about a correction you want to capitalize on that direction this is the opportunity for you do not want to miss out on this is a five hundred dollar class we're gonna take college right now ten to twenty five\nPick up the phone and call eight four for five one trade that date for four five on trade for callers ten or twenty five five hundred dollar class and shorten the market from our sponsor online training academy\nThat's eight four for five one eight Seventy two thirty three hate for four five one eight Seventy two thirty three for ... ten to twenty five to get this five hundred dollar class at a four four five one trade is adamant champ tumbles and bears [noise]\nCorrect carrier WFDD twenty four hour traffic tension ... county correct that was causing some ... from South down from morning trying that's cleared off to the right shoulder\nHe had some roadwork and ... find each pound outer loop between interstate six Seventy five I to eighty five or ... to flat shows and wrote ... road that's exit number forty eight and then you have still have traffic a travel advisory\nCobb County Seventy five north down between windy here will execute the south Marietta parkway exit two sixty three\nMe too left lanes are open they're doing good work and if you're coming to downtown Atlanta you know pretty good speed limit rides in both directions I'm On my knee K W S P\n[noise]\nI recently learned at the same twenty four hours a week on line with out of that ... campaign funding Kathleen manifest shower and\nGo out and I got\nTo have come a name and so sometimes I have to my mind all kinds of restaurants and you can make social problem\nI have to hire and that was in Google Search has any time even\nIf you don't make during our pen when any that have twenty four seven before I let them and they gave him\nThat make you laugh factory at ... dot com fault if you have to feed on line [noise]\n\nOld windows are so needy paint me you've got\nTo replace your old rotting windows remodel your home with infinity for Martin fiber glass window say look if you're home like traditional wood windows but don't\nRockies elements that keeps the comfort in and said big on your energy bills year round incentive for Martin fiber glass windows by north Georgia replace the windows this much limited time off or had his you windows dot com\nPlacement when\nIf you're struggling to find a job related how for your time with him for many counting the center as hell ten thousands of people with disabilities find meaningful employment locally people lie Gleason sign\nSign that training very confident you need to count independent I Know I don't worry about being able to support him shop banks coming at us and our future looks bright\nHow the ... center continue to impact families in our community by donating cars are a monetary gaffe now ... ... email they sent our data mark\nHey Sean Hannity here from my friends at runners warehouse and I'm here to talk about TNT\nThat's top notch tenants people who'll respect your property they pay their rent on time\nAnd are good neighbors to those around them out top notch tenants are the key to making renting rock and you find them by partnering with runners warehouse once your property is in rent ready condition runners warehouse taps hundreds of Web sites they but thousands of potential runners\nThe score you top notch tenants in just a few weeks on average than they do walk through they do the thorough background checking credit checks\nThey assist with these documents inspections rental licensing everything that builds a solid foundation for a great relationship between you and your renters plus for one low monthly flat the winters warehouse manager property twenty four seven\nTo keep your renters happy and there's no upfront fees no binding contracts and you can cancel at any time they have a number in Georgia it's for oh four six six two twenty three twenty two renters warehouse great tenants live here\nThe scotch lake but the story that still gives me the creeps I grew up with an old fashioned oil fired furnace on the farm and when it got cranky which was often I was the one who had to go down the cellar and coax it into working right now\nI get a chill just thinking about this was a very old farmhouse on top of a deep shirt seller met furnished reminded me of a giant Jacqueline vents that looked like huge arms coming out of the top of fiery grand covering the fire box I was convinced that I think it would blow up on me if I looked at it wrong\nRather been and better for it and it just makes me appreciate ... Dale heating air and plumbing and carry or even more um Iraq deal maintenance customer now so I Know if there's ever a problem with my heating and air system there'll be there quickly with amazing service and know how to get my furniture up and running in no time with no scary trip to the basement\nI recommend ... eating an air to all my friends and family because they get it right I trust rags to their name you know you can trust rags DL a factory authorized carrier dealer ranks deal in carrier turned to the experts\n[noise] [laughter]\n\n\n\nWell getting back to ... a little bit if there is\nNothing screams wealth intelligence like a little Sanford and son absolutely always having a good time don't forget to follow us on Instagram at bowls and bears O T H that's at bowls and bears oh TA and of course had over the Facebook Like us at bulls and bears radio a lot of social media going on out there you have a lot of stuff that we're finally\nAnd the Trump credit the Morehouse school of medicine as a starting worker I'm fifty two million dollar campus\nExpansion given clues about two hundred units of market rate multi family housing a medical office building wellness center retail space and ... it's up to be complete in time for the fall torn each one of the semester\nThat will give us being used on eleven thirty one\nThere's something so unique about a business built on family in his nurturing with a level of care dedication respect that sets it apart Hi I'm Monica ... appears that and for almost forty years I worked for a family owned business WFDD TV\nAnd that's what I found when I walked into Woodstock furniture Netroots outlet a family owned and operated business that started out Thirty years ago as a small variety store and the heart of Georgia they pride themselves on selling better quality furniture at lower prices\nBut what I discovered is that the heart of their business is the desire to serve you the customer\nThe air and family provides a friendly laid back atmosphere with hands on customer service it's one of a kind shopping experience with great deals on everything you can eat for your home Woodstock furniture a naturalist outlet found that secret to success it's a year the customer\nStep by one of their sat inconvenient locations today to experience what difference\nDoes it Woodstock outlet dot com for location\nNear ... and maybe you don't have time or the ideal situation for a typical home sale Sean Hannity here and that's why my friend march Spain developed the march Spain guaranteed offer a\nCompletely new way to sell your home that allows you to bypass the market and sell your home hassle free showings no open houses no negotiations it's all that simple and you don't even need to worry about making your bed or the dirty dishes that are in the sink\nAnd with the march Spain real estate guaranteed offer you can receive an offer and clothes and his little is Twenty one days allowing you to move on to the next chapter of your life\nYou simply by past the market you choose when you want to move and you're close with confidence the team known for your homes sold guaranteed present the march Spain guaranteed offer which is a groundbreaking innovation from march Spain real estate no showings no open houses no negotiations it's that simple\nJust go to mark Spain dot com slash guaranteed offer and get your guaranteed offered today\nPlay ws being news weather in traffic in a flash\nHis skills and your Amazon let's ask and search tells us the radio and unable to bring the news ...\nFive and am seven fifty ws the economic [noise] someone\nYour best friend and it was time for thirty three not allowed to him coverage of traffic going wherever it starts with I've ever will give us maybe twenty four hour traffic center and a church with marijuana ...\nOh Charlie and it's like they've got some roadwork going on in ... county\nFrom al ... east down the out of there from six Seventy five\nTo flat shows ... to ... forty eight a couple of left lane to block there and then they may be also working on the west bound side and the inner loop from ... shows back to\nA six Seventy five and in the ... Seventy five north down between windy so roads and south Marietta parkway exits to sixty to two sixty three\nOnly two left ... open that's because they're doing roadwork there and the gal quota exit is shut down um for an exit is shut down traffic is being diverted off to North Marietta parkway you'll see ... D tours in place traffic rocky by compassion in ... now\nFor just style food water education more is what you give her a child in poverty But Lisa chow from poverty compassion dot com slash radio\nAny kind of double USB\nAnd it'd be ... with the most accurate and dependable weather forecast\nChili falling into the forties overnight with a clearing sky will bottom out near forty six to start the day that mostly sunny and highest Seventy one for Sunday afternoon on Monday we'll stay sunny cool in the morning at fifty back to a higher Seventy and then on Tuesday sunny low forty eight Seventy three\nDouble your most media storm track or radar is clear forty six degrees on ... street at eleven thirty five I'm Charlie O'Brian used Ninety five five and seven fifty WBEZ be depend on it\n[noise] [noise]\n[laughter]\n\n\nWell go back to ... go have a good time that it's a blast stuck it a little bit about everything don't forget to follow us on Instagram at bowls and bears OT a that bowls and bears oh TA or head over to Facebook Like is the bulls and bears radio\nYeah Facebook really great time with us over there and get a lot of bloopers videos every time we do a show we recorded here live and then we post some of the the fun stuff the stuff that doesn't quite make the stuff that goes on the editing room\nFloor so Jay handles on that by the cuts in slices places and then we'd ... rate is going to get that you'll see the real reality when you go to the faces exactly\nDon't forget to check that out she had one of the things that you know it's key when you're trading investing as managing your own money a lot of people out there the average guy who's working for corporate America or the lady who's you know\nWorking out by the corporate ladder you know they have four one K. is they have maybe some old four one K. they moved to ... the average person's not managing their own money and that's paramount when it comes to having long term success in the financial markets let's take a moment let's talk about what that means really to self directed self manage well the problem\nIs many people don't they they're sophisticated enough to manage your own money 'cause Wall Street has I'm convinced of that maybe they think it's way too complicated and it's really not a hard process which you understand it\nThe key thing is is is if you don't learn how to control your own money then you've got to have money under management are going to pay exorbitant fees it's amazing that\nAnd the average four one K. people will pay over a hundred and fifty thousand dollars in fees over the course of a twenty five year four one K. think about that folks hundred and fifty grand goes to some Wall Street firms some entity\nGoldman Sachs citadel UPS CIA craft there those trust you have your phone K they they wrote the charter they wrote the prospect is\nAnd you pay them and you pay them whether you make money or not the only guaranteed return your phone case the fees that you pay here's the problem most you don't understand the fees 'cause you sign the paperwork with the lord you\nWith the match the company match so when you sign up for the four one K. they offered you the company match you went whoa that's free money chip it's not free money because now you're going to have to basically put your money into a position where somebody's going to manage it you got to pay a hundred and fifty thousand dollars or more in fees over twenty five years and you can only make money one direction\nThinking about that you bought that you you you were all in and the reality is is is those fees are going to crush your ... your long term profitability they're going to hurt you badly overtime and what we see is that when people learn the skills of self right we take that bucket of money yourself\nAnd there's not a complicated process to do this you can learn the skills of self directing and you can profit regardless of direction and you don't have to pay those fees which long term gives you a much better chance of hitting those financial goals\nWell and that's the key it's long term being able to set up a plan that's going to be able to work for you now be able to work for you later\nAnd ultimately get you to where you want to be chipped there's a lot of people out there if you ask them one day when you want to retire and their answers now said well what are you doing now to get ready for retirement and the thing they're doing nothing there's just there's working well the average American is way short financially I've ever been able to retire at their current\nStandard of living see that's the real issue\nAnybody can retire but can you retire at the lifestyle that you currently live the lifestyle you want to live\nAnd the real problem is the biggest issue with the baby boomer generation is that they're worried about run out of money before they die so the system that you're in four one K. managed diaries has you worried about run out of money before you die now I have students at all like jaded kept him that spent six to ten hours a month managing their own nest egg they manage their own IRA\nAnd they make decisions in that and those decisions are built around trying to make one percent a month thinking about that if you can make one percent of mine was a mock goes up to our side we can do that consistently over time you put a compound in calculator it gets powerful\nAnd the problem is is that many people can't make one percent a month because the market goes down they don't profit they lose they needed to go up for them to profit and ultimately because of all of this turns in price of the marketing these fees they never hit the goals\nSelf directing learning the skills to take control that bucket is essential to long term success and more and more people we're seeing this Adam\nAre coming out of the woodwork saying I Need to learn how to control my own money because the mass of my account says I'm going to run out of money before I die the Math Doesn't work and I need to change the formula and you know that former means no chain that formula means\nSelf directing taking control that bucket and making the decision to yourself 'cause who cares more about your money then you you should be in control of it you should be making those decisions and ultimately you could hit those long term goals if you get the consistency and that kind of ... monthly returned that we're focused on\nAnd that's key the long term goal that long term goals are gonna separate you from the masses online training academy they have a class specifically on self directing your brand new to the market or you maybe you've been in the mark and you've never thought about managing your money yourself until now\nThey have a class specifically on at this is a five hundred dollar value class we have a few seats to give away the listeners if you have money in the market for one k.'s IRAs understand this is the opportunity for you to manage it yourself", "year": "2018", "show_name": "The Clark Howard Show", "city": "Atlanta", "day": "28"}