{"month": "10", "state": "MS", "station": "WMPN", "content": "Great orchestrating full flight is the most amazing thing in ... let you experienced that thrill every week Hi this is Brian new house we touched down a terrific orchestra towns from Boston to San Francisco and get the best of Europe and Asia\nAll captured my encounter ... from American public media Sunday Morning at ten on MTV music radio\nStations have been Bebe music radio R. W. M. H. Biloxi debate in may ... W. M. A. you view\nW. M. P. in Jackson W. M. A. W. Meridian W and may be struck W. M. A. V. Oxford W. M. A. O. green ... check out what's happening on MTV music radio and listen on the line at him be be online duck or gee\n\nIt's bound to love the rich warm sound of the viola\n\n\nOne would love to feel that it's getting a creamy no range the things on\nMy ... of course I play in the building I promise you problems really did know the\nThing about this deal is not of it is annoying to me and I'll tell you more about that in half an hour\n[noise]\nMusic saw the wonderful doctor Zhivago this is my risk the music by ...\n[noise]\nBut I suppose most composers have different instruments\nAnd later this hour we're going to hear the ... which I Am convinced problem slough sure wouldn't\nKnow does he ... and then she meant that I think it's quite close to the LA Times Tom Sawyer in terms of Tony ... and that was called Maria from neighbors the French ... potential was pending you're at the very important ... eleven the orchestra loved it but there's no higher priest that\nIn this before him into the Dresden state orchestra performing that led by President Trump's that and so this is the wonderful Selina Meyer planet potential for\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\nYou can hear why old clarinet playing as love that work Tom reinforce neighbors clarinet detention number one\nTo them I was a soloist with the ... state orchestra and more music on the way by a well loved instrument that the composer was very hard to\n[noise] [noise]\n\n[noise]\n\n[noise] [noise]\nMm\n[noise]\n\n\n[noise] [noise]\n\n[noise] [noise]\n\n[noise] oh Brahms loved the Vila this field is to not to worry about to hear ... the oldest ... number one was originally composed for clarinet still a great piece of ... to be honest here\n\n[noise]\n[noise]\n\n[noise]\n\n[noise] Mm\nMm\nMm\n\n\nA ...\n\n\nMm Mm\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\nKnow we\nDo\nAll they don't\nKnow [laughter]\n\n[laughter]\n\n\n[noise]\n[noise]\n\n\n\nMm\n\nMm [noise]\n[noise]\nGoes\n[noise]\nAnd do\n\nYou have to be and\nI'm hoping to cash\nMm Mm\nMm\n[noise]\n[noise]\n", "show_name": "History Hour", "year": "2018", "city": "Jackson", "day": "15"}