{"month": "10", "state": "MS", "station": "WMPN", "content": "WMA H H ... to Biloxi\nWMA E. H. D. to believe WMA you a fee to view WMA O. H. D. too Greenwood W. N. P. N. H. D. to Jackson W. M. A. W. H. D. too Meridian W. M. A. D. H. D. too acrobat W. M. A. V. H. D. to Oxford [noise]\n\nMm mhm mhm [noise] mhm\n\nDa da da da da da da da\nDa da da da da da da da da\nDa da da\nDa\n\nThat's missed Michelle Thomas what marmaduke from her project is title I take real me with Neal algae or on guitar to work off on very sex Alex good knock on base Clark farmers also on base Darren scores on drawn\nAnd die before the Charlie Parker composition job well done this time\nNext step we have music from ... from her latest release a cause dance and that's the title of this song\n\n\n...\nMm Mm\n\nMm Mm\n\nMm\nMm\n\n\nMm\nMm\n[noise]\n\n\n\n\n[noise]\n[noise] [noise] [noise] [noise] [noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\nAll right well gosh you know do\nYou like to be with my dog and all that\nAnd I thought I was telling the truth\nI bet it\nIs but good paying job and I know that this is my ...\n[noise] if I\nCould be the way it is you\nThat was really nice piece by woody Herman from Jim in jam if I could be received in coming up next is a favorite of mine that I like to share with your Quincy John I had to deep deep to sign this than I think you can join you\nIt's from the project in title cool um Atari\nAnd it was actually recorded seventies\nAnd some time ago when she took a public position in a in a wreck an apple by calling it this is how I feel about ... and that assertion of musical philosophy was kind of a paraphrase to the biblical reference a punt this rock I built my church for obviously Quincy's foremost thing is\nFeeling and that's the way I feel this particular going um Atari along with Quincy Jones is the beautiful voice salary\nHere's Quincy Jones and his wife distract from the title track cool um Atari ooh\n\n\n[noise]\n\n\n\n\n\n[noise]\n\nOh\nUh\nNo\n\nNo no no no [noise]\n\n[noise] [noise]\n[noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise]\n\n\n[noise] [noise]\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "year": "2018", "show_name": "History Hour", "city": "Jackson", "day": "08"}