{"month": "10", "state": "MS", "station": "WMPN", "content": "Even contemporary every week on Sunday or if you can hear the writing\nOf modern performers treats the music is living are torn and put their unique imagine it gets stamp on music from the Eighteen century earlier I don't I Hope you can join me for Sunday\nSunday Morning at six impede be music radio\nStations have been Bebe music radio R. W. M. A. H. Biloxi there'll be MA ... W. M. A. U. U.\nW. M. P. in Jackson W. M. A. W. ... W and may be struck W. M. A. V. Oxford W. M. A. O. ... check out what's happening on MTV music radio and listen on the line at him be be online or gee\nI'm\nI'm just a poor weak comparing stranger\nThrough the world as well\nThere's no sickness toil nor danger in my long term I Try and go\n\nIn addition to being a number one hit songs from the country singer I mean the Harris Nineteen eighty\nEarly Nineteen century and gospel song has been recorded by many other artists\nScores to [noise]\nClassical composers have also use the tune of ... sorry stranger impair works\nHere to examples wanted some\n[noise]\n[noise]\n\n\n\n\n[noise] remarkable fiddling there from the Norwegian radio orchestra was titled I'd like to find solace in music by you on hold for senora we did that number six\n[noise] this is let's do supported classical music music through the night\nToday's classical music is also supported by home a device or matching homeowners with home improvement professional sports variety of home projects from minor repairs to major remodeled homeowners can read reviews of local pros and book appointments online at home advisor Don come\nUp ahead we're heading for the hills\n\nThe system\n\n\n\n\n\n[noise] is it now but the American composer Kennedy bon ... explores all kinds of American idioms this is from a such a piece is called strings circle it's ballot the ending is cheaper ensemble ...\nMm\n\n\nNa na\nNa\nNa\n\n\nNa\nYeah\n\nMm\n\n[noise]\n\n\n\nMm\n\n\n[noise]\n[noise] Mm [noise]\n\n\n\n\n\nMm\n\nMm\nMm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise] [noise]\n\n[noise]\n\n[noise]\n[noise]\nMm\nMm Mm\nNah nah nah [noise]\nBut\nDo do\n[noise]\n\nMm\nUh [noise]\n[noise]\n[noise]\nNa na na na na na na na na na\n\n\n\nNa na na na na na\n\n", "year": "2018", "show_name": "History Hour", "city": "Jackson", "day": "22"}