{"month": "10", "state": "AZ", "station": "KJZZ", "content": "\n\nBack\nIn the ...\nYou know the\n\n\n\n\nThe same name in and I\n\nThan me and then I\nAre saying\n\nWill\n\n\n\n[noise] [noise] to do\nThis to go to the\n[noise]\n\n[noise]\n\n\n[laughter]\nBack and\n\n[noise]\nJazz\nAnd up here friday night on kj is easy with cannon ball at early and Milt Jackson on the vine things are getting better are they [laughter] well it is a friday evening so things are definitely looking up 'cause we got the weekend to celebrate jazz and anything you want in life\nThis hour I've got the ... brothers Dennis rolling and Count Basie orchestra\nI'm Michelle Robbins thanks for joining me ... supported by a issues school of civic an economic thought and leadership\nMark ... author of the once and future liberal speaks at the polarization and civil disagreement series October eleventh at the Tempe campus S. C. E. T. L. dot ... dot edu\nWell up next is Brazilian guitarist delete Oscar Castro Memphis who's considered a founding figure in Boston over from all one hears double rainbow on kj is easy\nTo do\n\nWell that's next is Brazilian guitarist so late\nOscar Castro that who's considered comedy figure in Boston now from all one hears\nDouble rainbow on King James easy da da da\nDa da da da\nJames Alston junior on King James easy Ninety One point five ... too with the track from his tribute to Stevie Wonder part time lovers and bag of rocks sets us on a theory and forge a new release new standards\nI'm Michelle Robin welcome to the friday night party late night jazz just what the doctor ordered after this incredible week of lots of\nJames Austin junior on ... Ninety One point five ... too with a track from his tribute to Stevie Wonder part-time lovers and bag of rocks at the song of dairy and forge a new release new standards\nI'm Michelle Robin welcome to the friday night party late night jazz just what the doctor ordered after this incredible week of lots of lots of wetness\nHumidity and a lot of politics let's put it all aside and get into some great jazz I've got the Count Basie orchestra something new from them also Dennis Roland and art pepper will take us to Broadway\nFrontiers desk reporting on kj ... is made possible in part with support from the Ford Foundation addressing inequality in all its forms worldwide learn more at Ford Foundation dot org\nPull up next is the Brubeck brothers and that is Chris on base and trombone and Dan on drums and their quartet from a release they put out back in twenty twelve hard to believe so much time has flown by lifetimes\nAnd will listen to jazz inane eons ... runs and they're paying tribute to their dad Dave Brubeck by reimagining a number of his best known tunes that you'll find on lifetimes especially this one\nThe Brubeck brothers on K jazz\n\n\n\nClassic jazzy than grew to Monday through friday from eight until one key Jay's easy Ninety One point five of them ... two and twenty four seven at jazz donkey Jay Z dot org\nClassic jazz you can group to Monday through friday from eight until one I can ... Ninety One point five of them also an HD two and twenty four seven jazz decay Jay Z dot org\nBringing in an all star line up ... piano Jimmy green on sax Jeremy ... called on trumpet and Peter Washington on the base there'll be a show at seven and also nine Fifteen PM and then on Sunday the seventh\nThere'll be doing the FCC jazz big band with Jeremy Pelt\nInfo and tickets at the national dot org or you can find out more jazz dot ... dot org ... art Institute art pepper zoo Sims too bad they didn't record more together because as you'll hear on this track\nThey really really had a chemistry and the relief certain zoo was actually subtitled they're only concert together it's a live album and they recorded in eighty one\nNash dot org or you can find out more jazz dot ... dot org ... art Institute art pepper zoo Sims too bad they didn't record more together because as you'll hear on this track\nThey really really had a chemistry\nAnd the relief certain zoo was actually subtitled they're only concert together it's a live album\nAnd they recorded in eighty one at Royce Hall in Los Angeles but it wasn't released on the path blow label until Nineteen Ninety five let's take a trip to Broadway with art and zero on your classic jazz connection ...\nBurn and um Mm Mm\nTo do\n\nDa\n\nThat [noise]\n\n\n\nNa na na\nI\n\n\n\n\n\nNa\n\n[noise]\n\nThis is Kay Jay's easy FM Phoenix H. D. H. D. to a service of the Maricopa community colleges\nNo no no\nThere's\nThere's ...\nNo need for\nDa da da da da da da da da da da\nDa\nDa na na na na\nNa na na\n\n\nNa na\n\nNa\n\nNa na na na na\nNa\nNa na [noise]\n\n\n\nClassic jazz you can group to ... Ninety One point five FM your classic jazz connection sunny clerk with Charlie Rose on the facts doing something special from leap an envelope and I'm Michelle robin's great to have you here this hour about car Allison's new one also features some Dexter Gordon\nAnd up next is Paul ... meal brightened felt who took a phone book opened it to a page\nPut his finger on a name and transformed into Paul Desmond one of the most popular musicians on the cool jazz scene and of course best known for his work with Dave Brubeck and for composing their biggest hit take five here's the night has a thousand eyes from\nLet me tell you about Desmond on ... or\n[noise]\nKnown for his work with Dave Brubeck and for composing their biggest yet take five here's the night ten thousand eyes from let me tell you about Desmond on key Jay Z or\n\n\n\n\nNa\n\nNa na\nNa na na na na\nAnd I\nThink she said\n[noise]\n[noise]\n[noise]\n\nK jazz Ninety One point by the famine H. D. too with saxophone is Greg and fishermen who brought in another sax player Doug Web for lunar it's a track off his new release so you say\nAnd listening to yard bird sweet we've heard it a million times but not the way Christine hits saying it was John easily on the piano from magical\nK jazz Ninety One point five FM an HD too was saxophonist Greg Fishman who brought in another sax player Doug Web for lunar it's a track off his new release so you say\nAnd listening to yard bird sweet we've heard it a million times but not the way Christine hits saying it was John Beasley on the piano from magical kite\nAlso in this hour I've got Dexter Gordon and some Michael a done by request\nI'm Michelle Robbins thanks for joining me on this beautiful weekend can finally say for the summer is over and I've got a song\nCalled that summer is over by our next artist mark Lewis from his New York's sessions release you know in in a perfect world mark Lewis would need no introduction to you\nHe's a well traveled Alto saxophonist and flew this he's created a vast intense body of music over forty years and he's been everywhere from Seattle San Francisco to Rotterdam in Paris so I'm not sure why he's not better known but\nHere's something from New York session that applies to Arizona right now summer is over and kj Z. Z. your classic jazz connection [noise]\nYou don't really do\nUp in\nThe country [noise]\n\n\n\n[noise]\nAs Ninety One point five salmon H. D. too with pianist and Oregon has been Patterson with his trio featuring a cherry on guitar do an editor\nFrom live advent calendars at the legendary Rudy van ... recording studio in front of an audience doesn't get any better than that for a musician Cornell is and also saying wish your mind off of her new one some of that sunshine she'll get plenty of sunshine when she gets here to the ...\nOregon is Ben Patterson with his trio featuring at cherry and guitar do an editor\nFrom live advantage elders at the legendary Rudy van ... recording studio in front of an audience doesn't get any better than that for a musician Cornell is and also saying wish your mind off of her new one some of the sunshine she'll get plenty of sunshine when she gets here to the valley of the sun\nOn October thirtieth she'll be performing at ... music theater and doing probably a lot of students who are new release\nYou can find out about that event and many many other jazz happening on our website calendar at jazz dot ... dot org\n[noise] Michael Dunn is with Eric Alexander on saxophone from I Love music on Jay Jay's easy [noise]\n\n\nNa na\nNa\nBand and the and\nAnd the day\n", "show_name": "Classic Jazz with Michele Robins", "year": "2018", "city": "Phoenix", "day": "06"}