{"month": "10", "state": "AZ", "station": "KJZZ", "content": "The wonderful mix of jazz the quality music that you hear every night on kj ... give us a call at eight eight eight seven seven for nine one five zero or go on line decay Jay's easy dot org and with thirty seconds left we just got our call All right\nThis is members supportive cage as ... FM Phoenix H. D. and D. H. D. too you can also find us online at jazz dot ... dot org\nAnd Shelby here playing jazz where she got to hang out with you and less chatter more platter but if you want to contribute contribute you can go to Kay Jay's easy dot org [noise]\n\n\n[noise]\nJazz and up your friday evening on ... with Texas tenor Houston Person last fall in love from nice and easy which pretty much describes the next couple of hours from the yellow jackets to David fat head Newman nice and easy\nI'm Michelle Robin ... jazz is supported by the town of carefree the enchanted pumpkin garden transforms carefree desert gardens into a Halloween wonderland October nineteenth through twenty eighth\nCarefree pumpkin garden dot com\nThanks to everyone who's called in or gone on line to show their support for great lived jazz on your NPR station kj is easy it's not too late we'll be doing more fundraising on Monday Night but right now twenty four seven you can go to ... dot org\nAnd make your voice heard make a difference support jazz on key Jay Z\nWill keeping romance alive is trumpeter Chris Bodie doing the Frank Sinatra tune one for my baby on ... the your classic jazz connection\n\n\nSinatra to one for my baby on key genes easy your classic jazz connection\n\n\nNo no\nNo\nNo no no no\n\n\nNo no no\n...\n...\n\n\n\n[noise] Mm\n\n\n\n\n\n\nDa da\nAnd then I didn't know anyone in the ... you know we live\n\nOr is it\nJust goes to the\nFor\nFirst\nThe third bills in\nTo bumper\n[noise]\n\n[noise] [noise]\nFor\n\nDa da da da da da da da da da da da\nDa da\nDa da da\nDa da da da da da da da da da da da da da da\nDa da\nDa da da da\nDa da da na na na na da da da da da\nDa da da da\n\nDing ding ding ding ding ding da\nDa da da\nDa\nDa\nDa Vinci married\nPainting\nLine into the living room and the buildings\n...\nDa da da\nDa da da da da\nAnd trying\nBuild\nCage\nHe needed to be\nDriven\nTo\nYou\nDo do things you learned\nThe doo doo doo doo\nDoo doo doo\n\n\n[noise]\n[noise]\n\n... suggests you can group to Monday through friday from eight until one of the king James easy Ninety One point five of them also an HD two and twenty four seven at jazz dot ... dot org\n\nMan\nLet me\nSee\nOh they do a little bit\nI mean\nI don't know where\nAnd\nUm they do their\nMain\nI got\n\nBrazilian pianist Antonio adult filling cage as doing Wayne Shorter speak no evil from hybrid of Billie Holiday loved me or leave me and drummer chip whites new one new dedication and Latin mood features rainy Ross this on piano we heard like coal train\nI'm Michelle Robin thanks so much for listening for making your contribution and you know one of the reasons why we can offer jazz twenty four seven on her each due to channel and also on our website is because of you\nBillie Holiday love me or leave me and drummer chip whites new one new dedication and Latin moods features rainy Ross this on piano we heard like coal train\nI'm Michelle Robbins thanks so much for listening in for making your contribution\nAnd you know one of the reasons why we can offer jazz twenty four seven on her each due to channel and also on our website is because of you because of your donations your gifts makes it possible for jazz to be heard twenty four seven\nSo thank you for your support and if you haven't made it yet\nConsider making a donation five or ten dollars a month and check out key Jay Z dot org where it's easy takes a minute of your time and again thank you for your support\nWill pianist James honest in junior believes that Stevie Wonder is the be all and end all of composing and piano playing and has done a whole CD dedicated to songs in the key of wonder he brought and guitars Bobby Broom\nAnd this is part time lover James Austin junior on K jazz\n[noise]\n\n\nBoom boom boom boom boom boom who do\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\nBones [noise]\n\n\n\n\n\n\n\n\n\n\n\n\nThis is Kay Jay Z's E. S. and Phoenix H. D. H. D. too let's service of the Maricopa community colleges\n\n\n[laughter]\n\n\n...\n\n\n\nNa\n\nAnd\nShe [noise]\nOr\nJust the number\n[noise]\nThen\n\n\n\nThey\nBy\n...\n\n...\nAnd\n\n[noise]\n\n\n\n\n\nOkay Jay Z or classic jazz connection at Ninety One point five ... too with David vetted Newman and Goldfinger\nI'm Michelle Robbins into the midnight hour we go with Ellen Tucson bring in a little bit of New Orleans along with Hank Mobley and Miles Davis\nYou know we're really close to Halloween and if you're looking for the perfect Halloween costume I just read this article where ... easily fun shop is closing down after\nI Can't even remember how long it's been open it's been that long and this'll be the last Halloween there'll be offering stuff to make your Halloween incredible weird and perfect along with lots of fun so if you're a\nInto supporting those Phoenix institutions that are going by the wayside checkout ... fun shop it's a interesting place to find something good for Halloween\nMiles Davis brings us ... with the John Lewis on the piano on your classic jazz connection kj is easy\nCheckout Bernice lease fudge shop it's so interesting place to find something good for Halloween Miles Davis brings us Bob ... city with John Lewis on the piano on your classic jazz connection king Jay Z na\n... ...\n... ...\n... ...\n\n... ...\nThe ...\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\nAh ...\n\n\n[noise]\n\n[noise]\nNah\n[noise] [noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\nAnd Ninety One point five ... too with trumpeter bread good in a new release called that's right and he brought in legend Ernie want some the saxophone listening to blues in the night\nAnd the bread good is currently associate professor of jazz studies at the University of Colorado and of course plays with a lot of groups and lead to zone in the Colorado area\nGreg Diaz\nDid brother John second line struck and I go I go altogether and a beautiful medley taken us to New Orleans\nFrom big in the ... and still the comet got Ellen Tucson\nHe's up next with bright Mississippi then I'll follow that with a request for dying of the crawl\nAnd Hank Mobley in your future also I'm Michelle Robbins thanks for listening and thanks for making your contribution as either a new member or returning member to key Jay Z Xi's family of jazz lovers keep jazz alive by making your donation\nOh my God Ella to sell it he's up next with bright Mississippi then I'll follow that with a request for dying of the crawl\nAnd Hank Mobley in your future also I'm Michelle Robbins thanks for listening and thanks for making your contributions as either a new member or returning member to king ... family of jazz lovers\nKeep jazz alive by making your donation at kj is easy dot org while we get into Allen Tucson bright Mississippi on K jazz\n\n\nHis\n\n\n\n\n[laughter]\nPiece of\nBack home and then\n\nNeed to be in the movie and [noise]\nThe one in the end of the\n[noise]\n\nThe only a great but gosh me too I mean\n\nMm [noise]\n[noise]\n\n[noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise]\nBest\nBest best\n\n\nJazz on kj ... from Hank Mobley blowing his horn for Ricardo bossa nova\nI'm Michelle Robin thanks so much for listening tonight and also for making a contribution to support jazz in this community on kj easy if you haven't made one yet\nAlthough bossa nova I'm Michelle Robin thanks so much for listening tonight and also for making a contribution to support jazz in this community ... kj easy if you haven't made one yet", "year": "2018", "show_name": "Classic Jazz with Michele Robins", "city": "Phoenix", "day": "20"}