{"month": "10", "state": "DC", "station": "WMAL", "content": "As you know what I'm saying like you do any like well you don't need to a kid from a foreign country they give you updates of what they blew inch of the nation boy with my tax money because they know what lender wash and the street just always dirty was born into a dirty street is always on America what are you doing this too bad some\nChange in on your credit rating has gotta be given that I saw on the when one or jumps to improve that you know the way of\nDoing with my money you know when my money I Want to know I wanted to see I watch watch you know is that\nHear what they make money I was I don't know who\nWants to know from Uncle Sam what they're doing with their money you know I Can't blame or other issues on her way to Jordan John you're sitting there in America the blood and treasure knows burning [noise] do you\nWhy they all up and we're rich W a male Washington shot one thousand dollars a\nDay I Am A L hug you and\nThey all news it's new barber Brett Michael leaving a path of death and destruction and Florida and now in Virginia\nFirefighter responding to a car accident is dead after a tractor trailer crashed into the back of the fire truck he was riding in the other four doubts were due to drowning Jeff Caldwell with their Virginia Department of emergency management set today there's widespread flooding and power outages\nWe expect the recovery from the storm to to continue for several days so roads get reopen waters recede and and we restore service has\nFive deaths than Virginia bringing the total death toll from Michael two eleven had her Curtis ... W. M. A. L. dot com to brand\nNew elementary schools in booming loud and county are already overcrowded and we've\nSeen the growth and that is just far surpass anything that we had planned especially in the in the south area in the elementary school grade\nSchool board member just more says frustrated the county opened one elementary school last year another this year in both are already beyond capacity\nWe're gonna have to look at options for those students in those areas because of the schools cannot contain any more children\nAttendance has grown by twelve hundred fifty students if you're actually the smallest increase in years and there is one bright spot attendance in middle and high schools actually did just a bit John nephews on WMA Ellen W. I. L. dot com\nExpress lanes on two Seventy it's part of Larry Hogan land to battle DC area traffic not getting overwhelming support a new Washington post poll finds forty four percent of registered voter liked the idea of fifty percent do not\nRelations easing between us and turkey with the ... the release of an American pastor who's been held in Turkish prison for two years\nAfter Brunson just released will be home soon President Trump's tweets in all capital letters following a Turkish courts decision to order the release of what North Carolina missionary who'd been convicted of anti government activities Andrew Brunson released was a major issue for the evangelical base so vital to President Trump's political fortunes\nIt also will help men relations with turkey because the president had imposed sanctions specifically trying to force Brunson freedom from the order one government on top of that turkey is looking for leadership from the U.S over the alleged killing of Saudi dissident Jamal ... inside Saudi Arabia's assembled consulate but Gostin Jeannie the White House\nCan today turkey says it has evidence on tape that proves to show he was killed inside the Saudi conflict in Istanbul\nIf this is done at the hands of the Saudi Government\nAt the crown prince was involved in this in any way\nIt will virtually destroyed his ability to lead this country on the international stage senator\nLindsey Graham finally feels like on them and that means flu season Montgomery County really wants you to get your flu shot offering free flu vaccines ... at the University of shady grove this Monday afternoon\nFrom four thirty seven thirty checking your money the Dow looks like it's recovering a bit so far up a hundred and fifty nine NASDAQ up one twenty W when they al trafficking whether next\n\nLong gives welcome can knew the Carolina Panthers to be\nHours to get in on these new\nNine thirty [laughter]\nM. A. L. O. here's a story that may sound familiar I used to post to several job boards only to be overwhelmed with tons of the\nWrong resume and because there were many residents was tapped to separate the great candidates from those who weren't the ... I mean it's not easy to find the right person for my wineries my sports medicine good for our global NPR agencies\nThat old process was definitely not smart then I went to the producers they figured out hiring recruiters\nThe whole process we're definitely not smart then I went to the recruiters they figured out hiring\nRecruiter did the work for their powerful matching technology scanned thousands of residents to identify people with the right skills education and experience for my job and actively invite adventurous life so I go to qualified candidates stock\nThe way the recruiters rated number one by employers in the U.S trying to protect her now for free at the recruiter dot com slash free that different groups dot com slash free once again the recruiter dot com slash free ... recruiter\nThe smartest way to hire based on trust by the rating of hiring side to liberate went down to review\nStill replace the carpet to get a zero clean and safe book and there were red DC to try\nSomething new mail traffic and whether the Herschel aren't in the ... center\nThirty five universe Judea pre school right now and there's ... one ... down toward the ongoing nothing in a way though north to Seventeen you was that road work in the left lane\nOne oh nine heights down into ways one Twenty one clerks work in early uh the beltway Maryland southbound on the beltway the balls washed parkway the accident was clear a way it's going to be so now after that from the VW parkway down to four fifty Annapolis wrote\nDown from garage door repair jak gum the W. M. A. L. weather Channel's forecast\nSunny guys today Chilean high only think people are when diminishing this afternoon tonight ... overnight low fifty one tomorrow or early morning shower thin brighter sky high tech the nine right now he's sixty two degrees and partly sunny at Reagan National bar for print on one of five ... thirty Taylor you and I am\nAt the national keyboard here nine ... down here in Ninety five eight or nine eight or nine five\nEight nine ... feedback from your rent free and that's why I won't be able to you and a\nChris plant here you've heard me talk about the ten ten IRA which delivers ten percent annual returns guaranteed for ten years well now is your last chance to take advantage of the ten ten IRA program with a banner year on the stock market it's a smart time to do some profit taking a role of portion of your account\nInto the ten ten IRA reduce stock market downside risk getting lock in ten percent annual returns guaranteed for the next ten years\nYou might be wondering how is that possible with just one called up produce Uri advisor David errands you'll get all your questions answered I've known David for years recently he showed me the ten ten IRA program and I was amazed\nCold day but now they have a free information pack it on the ten ten Iowa re delivered to you call or text to eight eight eight four one one forty one thirty that's eight eight eight four one one forty one thirty call or text to eight eight eight four one one forty one thirty\nAppreciate your straightforward truth out there everyone else I'd point nine at the end and am six thirty\nWashington comes to talk\nShe she does\nYou aren't tuned to the most listen to radio talk show in America you aren't tuned to the most talked about radio talk show and radio talk show host in America\nOf course you know the reason\nDon't we what we get it over the line of Florida and here we are wrapping up [noise] telephone number eight hundred joy to Wade through and of course you're going to send an email that that's what you want to do something as I Do is I ask our subject line [noise]\nI just have it this is a little league [noise] zero in on the subject line was you know it gets very very seldom get tricked fight fan [noise]\nWe got good spam shoulders anyway but some trickle through but for the most part I find good what we get\nUp pretty soon [noise] seeing thousands during a show so it's not possible to catch 'em all obviously you can still go that route if you want [noise] okay so\nWhat what start here with audio soundbite number one normally I Would not waste my time on this done by but it is going to provide an interesting oh you made it from the court is oh I didn't think you'll be here this quickly I just got the note saying you were you're where you were leaving ten minutes ago\nRock is the is the arm storms I Want to see it\nIs the is the arm storms I Want to see it\nAnd they roll the dice thinking that they'll survive it or what have you [noise] takes all kinds of people but this one I when I saw just today I thought it had to make sure this is not you know some satire sight and it isn't\nClimate deniers making these storms worse by stopping action on climate change so see\nIf we hadn't just not gotten out of the Paris climate accord and if if Trump would stop at ... stop making fun of the UN's inner plant mental whatever it is on climate change\nThen the hurricanes and get the message and the hurricanes or go somewhere else they're hurricanes wouldn't get so strong but the hurricanes no hurricanes know that they're attacking Republican voters who therefore don't believe in climate change their hurricanes are targeting people for destruction of wiping them out and these people need to know that they're making it happen because of the way they vote\nHow absurd how stupidity how\nOther leap politically partisan by the way it was it was getting ... book on it like clockwork\nJust today here come more intense report suddenly UN's inter governmental panel on climate change\nWe've only got eleven years this is it folks we've\nOnly got eagle eleven years to get that Celsius temperature increased down to one and a half a degree [noise] if we are not able to keep them below two degrees Celsius and the next ten years we're all what coast\nWe're cooked\nIn my lifetime and this is I've cow that this is the fourth ten year warning and we haven't been given by the United nations and other related climate activists Al Gore gave us ten years in Nineteen Ninety three ten dancing gave us ten years in Nineteen eighty eight\nTo dances ten years or cleaning up the oceans which by the white Trump just got around to doing\nMillennials are going to see that by the way and they're gonna they're gonna love at something Obama never did but one of those are big on their planet being destroyed they they literally have been bombarded their whole lives with the fact that their parents and grandparents are destroying\nTheir planet they have no place to live with their parents are not stopped they've been taught there since they've been going to kindergarten I Believe it they don't think are\nJust sustainable that's why when people start calling night in talking about colon nodding colonizing Mars or an asteroid millennials fall for it\nNot hard to understand it that's all you've been taught\nAnd it's all ... [noise] but anyway I I just have their share this with you because it's if if and another example and they are countless\nWhat is becoming genuinely electorate have insanity and on and behavior at all these people are in\nPositions of real responsibility and power such as professors\nOf engineering at major institutions of higher learning let's go to the Washington Post today\nBecause we're not just confining ourselves to discussing lunatics in climate science had a piece here by a woman named Victoria ... brown she's a retired history professor in Grinnell College\nShe lives in Haverford township Pennsylvania maybe have preferred I'm not sure how it's pronounced\nThe headline that this column is remember Washington Post thanks for not raping us all of your good men but it's not enough\nThis woman has written a piece thanking all of us good guys who are not raping women but that still isn't enough you want details of this or not stand\nYour listening to Rush Limbaugh America's gifts to broadcast the ... met for how\nLong can mall W. M.\nWashington come talk there is still in college in America where students can debate ideas openly and honestly where they can work with their professors and respectful ways it's Hillsdale College every student in Hillsdale lives by an honor code and it's not a list of do's and don'ts if the simple pledge and this is it\nA Hillsdale College student as honorable and conduct honest inward and did do it full in studying service and respectful of the rights of others\nThrough education the student rises to self government backed it every\nDo it full in studying service and respectful of the rights of others through education the students right to self government\nBacked ... every incoming freshmen commits to follow that code and throughout their Hillsdale education their character is built to be true and good you don't find grievance lists safe spaces or identity politics\nHillsdale graduates go on to serve our country is teachers doctors stay at home moms lawyers journalist and more the excellent education they get\nProducers proud self confident people learn more at rush for Hillsdale dot com\nIf you're concerned about your heart health or know someone who it than you could consider cardio mobile the NBA clear personal EKG device for just Ninety nine dollars cardio mobile delivers a medical greedy Katie right to your smartphone\nAnd it fits in your pocket that you can take any Katie anytime anywhere to order the cardio dot com that may A R D I hate dot com and give you feel heart racing or other than to\nTake any Katie on your phone and it just thirty second you can't have peace of mind to knowing your heart rate them as normal cardio is also prevented attacks atrium relation common heart condition and a leading cause of struggling to order ... today with the guardian dot com K. A. R. D. I. A. dot com\n[noise] morning noon or night cardio mobile they do you take on limited medical great EKG\nThey joined the peace of mind ... today for just Ninety nine dollars with the cardio dot com K. A. R. D. I. A. dot com\nYears ago almost half of us want him to leave Maryland forty free tax hikes\nThousand jobs swing vote in\nA four by Hogan referred slating\nOur Chris Rosenthal treasure\nHow do you ever wanted to speak another language whether you want to speak Spanish French or German battles ten to Fifteen minute lessons ... speaking confidently in your new language within weeks I just started learning Spanish with\nApple and it's really helping me with my pronunciation all new to him is call multi I\nDid on the latest phase on that it\nGot it all means though ... we I speak Spanish I Wish I'd try battle sooner battles\nAward winning technology gives you speaking right away and best of all you remember what you've learned no wonder battle is the number one selling language learning happened to Europe\nTried for yourself and see my battle is the quick way to get conversational in a new language like Spanish German Portuguese and more you can try battles were free to go to battle dot com or download the app and try and for free\nThat battle B a B B. E. L. dot com or download the app to try it for free that's babble dot com\nWon all five point nine us at ... am six thirty Washington Mall W. M. A. L. more Washington comes to tie\nWas just asking wait a minute rush years\nWeren't we told not long ago that we were beyond the point of no return yes it's a it's a great great observation in the last Fifteen Years and I'd have to go back to the archives that I've kept every one of these stories and they will be in our show our ... in our ...\nShow archives at Rush Limbaugh dot com we have every climate change story I'm disgusted including those which\nSay it still wait there's nothing we can do now\nAnd there were two or three of those stories within the last ten or Fifteen Years so why now are we again getting we've only got ten years to fix a minimum fourth time in Thirty years that I Know\nAnd this is the UN's this is that they alone may have given us ten year warnings three times and you add in Al Gore in ... dancing and all the other disparate\nKooky environmental groups and the numbers of people in times warning us we only have ten years couldn't be more than we can count\nThe reason they're doing it is because they realize there's always gonna be a group of news consumers that have never heard\nIt the left recycles all of their greatest hits\nA group of news consumers that have never heard it the left recycles all of their greatest hits it's like the Clarence Thomas Anita Hill hearings\nThis woman Seventy she's still matter\nThis woman Seventy she's still mad their husband controls her I guarantee you what's the other way round [laughter] no I said to him you can't change you are able to change you don't have the skills and you won't do it you are you said\nOr one of the good man you respect women you believe in women you like women you don't hit women you know raped women or in any way abuse women you have applauded and fund and feminism for fifty years you were at one of the good guys and you cannot change you can listen all you want but that will not create one iota\nWell then this poor guy [laughter] what this woman is saying the guy is perfect and yet he's guilty he's perfect because his perfection will not change anything\nHis\nBeing right on the money everything she wants will not matter\n\nIn the ... century as a feminist movements that have washed up in a way good men have not once organize their own mass movement to change themselves\nAnd their sons or new attack the mean spirited teasing punching thing that passes for male culture not once bastards don't listen to me listen to each other\nTalk to each other or in your power for once the gender war that has broken out in this country is flooding all of our houses it's her rising I'm tired of memories that every woman has [noise]\nI\nSaid do what I said about three weeks ago that these women have this irrational hatred man they're angry I don't know what's happened to them but something did and that quote has been brought up and recycle all over the drive by media\nProbably because they know it hit the nail on the head\nBut this is [noise] this is in comprehensible as this professor suggesting\nThat if you vote Republican you're responsible for hurricanes finding you and wiping out and if you want to stop it stop voting for Republicans are on the climate deniers and when you stop blaming Republicans are hurricanes will know to leave you alone\nHurricanes will continue to seek out Republicans and destroy them and their property but leave you alone if you vote Democrat [noise]\nThis woman spends half is columns thanking her husband for being perfect an ideal and doing everything right not raping her not abused or anybody else but it's not enough it's not enough Seventy years old former professor asked\nNo man she writes no man right now understands the flood the that is rushing through American women's brains\nAnd only women in the deepest denial have evacuated their minds before the flooding could reach though\n[noise] huh they try that again [noise]\n[noise] no man no man right now understands the flood that is rushing through women's brains I'm Victoria ... we never half the fun of it\n\nBut see that will not be understood that the dual does that won't work no man right now I understand the flood that is rushing through women's brains and only women in the deepest denial have evacuated their minds before the flood could reach the\n\nMemories of being dismissed disdain distrust of memories of having to put down to the office cat calls in the parking lot bark orders at a dinner party\nAnd for some reason the most chilling memory of all the one Christine balls e foreign called up and we all recognize no laughter\nThe old laughter\nOf men who are bonding with each other by mocking us when balls the Ford testify under oath adult laughter is the sharpest memory of her high school assault every woman within the sound of her voice come here about laughter had heard that laughter somewhere somehow ladies assist describe\nAll of you are using this consumed with hatred even for the guy you love and your life who may be not guilty of it is\nNot guilty of any of it\nIs not going to ride is respectful he has not abused ... he's not ... not laughed at you know he's not raped ... thank you for not raping but it isn't enough that describe your relationship with them having to live\nWashington Post not the penny saver [noise] not some little flimsy do rag out there that you never find English and go to some of the way a story in a strip mall this is the Washington Post op ed section [noise]\nThe range who thinks like this\nFault [noise] propaganda section\nThe rage\nWho thinks like thanks for not raping us all your good men but it's not enough\nFor what what you are listening to Rush Limbaugh this sound track of your conservative ... work\nComes to talk tonight tonight central on ABC finish the sentence from millennia Trump is the first lady I took the women in the me too movement call you a supporter of no question this is off limits you're not the first first lady to have to deal with her husband's alleged infidelity has is present on your marriage\nTonight what will the lawyer calm say let's talk about the ... is that\nWhy did you wear being ...\nThe ABC exclusively about don't miss tonight at tonight's central on ABC\nYour brain is an amazing thing but as you get older and naturally begins to change causing a lack of sharpness or even trouble with recall\nThe breakthrough in ... helps your brain and actually improve memory the secret is an ingredient originally discovered didn't jelly fish in clinical trials production has been shown to improve short term memory ... healthier brain better\nNow available in stores everywhere things enough and evaluate anybody at the product is not intended to treat you prevent any disease\nHi I'm ... owner of blind stir dot com you know I made it my life's mission to convince everyday people that measuring an installing custom blinds is one of the easiest do it yourself projects there is a blockbuster or custom made lines are not only easy to install our prices are often less than those off the shelf blind you'll find at big box retail stores\nAnd now it made it even easier check out our new no tool cellular shades\nThe first and only shades installed without any screws or tools\nYou heard me right customs shades there in Seoul without any tools work to be easier but with my personal fitter free guarantee our guarantee you're going to fit their own remake the free of charge you only pay shipping\nNow there's no reason to better pay a high price professional whereby poorly fitting ready made blinds visit ... dot com today and save a bundle and ferocious there's only save up to fifty percent off any order just under the code Russia checkout lines to dot com that's blinds T. E. R. dot com\nRush Limbaugh has brought you by Kevin discounters are open to kitchen cabinet and your hands out on the floor originally spices in the back and everything falls out and if you said that entertaining at the holidays because you're tired tops or in such bad shape when he can help [noise]\nCatch a nice little Bruce ... nature of the Nile designers accounted manners can help you look at our website had an\nGorgeous pride you said mom mom\nOne came\nAnd met him in Maryland and Virginia\nCheck out this must special offers find show in locations hours and hours had cabinet this ...\nTrafficking whether together every ten minute first on the five mornings on Mondays five nice WN am [noise]\n\n\nAccept\nMy friend's try this this is from Breitbart and this is about the Senate\nRace in Arizona is it up a woman or she may run in the U.S market may sound like Martin makes Sally is running for the Jeff Flake seat Jeff Flake by the way now claiming that there's going to run against Trump maybe twenty twenty\nAnd Jeff Flake of saying is really really disturbed at all of the gloating and spiking of the football after the Kavanaugh studies really really really disturbed by it was really really very very concerned like Tom Daschle I'm\nVery very concerned Jim we're\nWe're really concern and it didn't you hear you picked up the mantle are very very uh CERN now flake is concerned\nBut it's Martha McSally who's the highest ranking woman in the air force she's the first female fighter pilot she's seeking a Senate seat in Arizona\nPlay called her opponent is a woman named ... cinema\nOr semi Model S I C e M ... I'm Sorry for not knowing how to pronounce it's my fault I should have taken the effort to figure it out but I haven't saw just cover my bassist pronounce it every which way I think it could be\nThe headline of story here here's students standing or semi mock crazy Arizonans avenue legion moms that remember Conan is Martha McSally the highest ranking woman in the air force first female fighter pilot Democrat Senate contender here students\nThe highest ranking woman in the air force first female fighter pilot Democratic Senate contender here students sunny my worst cinema of Arizona made fun of Arizona's as crazy\nIn northern Virginia singled out for higher sales\nTaxes on home sales on new tax on gasoline there's nothing more external attacks now northern Virginia is getting it was hard trolls I'm sixty six [noise] up to forty seven dollars for a single morning commute\nForty seven dollars just to go to work really wrong\nWith Jennifer works in an office we get taxed or what\nIf Jennifer Wexton goes their car wash puffs soda politician we can knock trust men are seriously paid for his responsible for the content of this advertisement authorized running a candidate or candidates committed WWW dot ... dot org [noise]\nDo you feel if it were rich W a male Washington shot one thousand dollar type\n... ... email\nMe when they all knew that one I'm Barbara bread tropical storm Michael is on the Virginia coast but not before tearing through Virginia leaving five people dead for them drowning and flash floods from the parental rained last night the fifth death\nAnd one was due to a motor vehicle accidents\nJeff Caldwell with Virginia Department of emergency management says it was a firefighter who was killed responding to a car crash trees\nHave come down and knocked power down flooding continued and we still have high water in many areas of the state and that will likely continue through the day to day\nHere in the DC area we still have a few scattered hundred outages reported and in Florida where six people were killed damage assessments are now underway two days after hurricane Michael\nStanding in the middle of a of a section of houses it's just not here anymore and some of these objects like the bath tub he looks like it's got tossed somewhere these are things that could be could have been in houses down the street because we talk to residents here who said they had furniture in their houses that wasn't there furniture when the storm was at its height furniture being blown right into their houses\nCorresponded Brian Todd Maryland Governor Larry Hogan plan to ease traffic congestion by adding express toes to the beltway to Seventy in the ... W parkway getting mixed reviews\nUniversity of Maryland Washington Post poll finds fifty percent of registered voters state wide or against adding express toll lanes to the beltway to Seventy and the VW parkway forty three percent are in favor political scientist not ever lay\nPeople like the idea of white and you're adding lane what they don't like the idea of paying the toll\nIs that the numbers mean Hogan taking the risk by continuing to support the plan but if he's reelected in won't have to face re election in the future he may go\nWith it or not having to worry about the electric off of it\nHad to Curtis sound heavily ... dot\nCom the archbishop of Washington has resigned but will remain in power behind the scenes\nCardinal world was mentioned in the Pennsylvania attorney general's report about decades of cover ups of priests accused of sexual abuse the pope had praised for the Washington DC cardinal thing he put his flock ahead of his own ambitions a Vatican statement said that world made some mistakes in his handling of sexual abuse allegations but he didn't cover them up\nCorresponded Steve constant bomb cardinal Wuerl is being allowed to stay on it as the day to day administrator of the Washington dynasties until a successor is found Republicans kind of rare and blue Montgomery County but at the G O P candidate for county executive says he has a good shot at winning\nThe voters want change Robin vicar certainly represents that period W I mailed diner tour in Silver Spring he said his record to hold the line on taxes is just what businesses are looking for\nThey want freedom they want freedom from regulation freedom from taxes and I think that of mark yell Rick somehow gets in there Amazon will never come to Montgomery County\nBigger says the Democrat Al rich or independent Nancy ... when the raid they'll start raising taxes immediately John nephews on WMA Ellen W. I. L. dot com\nTurkey is rejecting President Trump's assertion that us pressure contributed to the release of American pastor Andrew Brunson President Trump tweeting today us worked very hard to gain pastor Brunson released checking your money the Dell is up thirty eight the NASDAQ up Seventy five W male trafficking whether up next\nAn Amazon Echo you've got a new way to listen to the devil you know there's this huge mornings I'm a law\nLimbaugh leery O'Connor Margot\nI listen to this one time set ups the W A L skill once your devices unable to say what we believe it's really that simple however you can actually getting breaking news on the Inside Story just never be easier to get all the details\nIf you believe and it's really that simple however you can actually getting breaking news and the Inside Story had never been easier but I got up on you get all the detail to W. M. A. L. dot com\nHave you ever wanted to speak another language whether you want to speak Spanish French or German battles ten to Fifteen minute lessons ... speaking competent leaner new language within weeks\nI just started learning Spanish for travel can really help I knew my pronunciation almost ...\n... said the old adage\nI got it amazed though ... we I speak Spanish I Wish I tried battles sooner battles\nAward winning technology gets he's speaking right away and best of all you'll remember what you've learned no wonder battle is the number one selling language learning up in Europe\nTried for yourself and the wide battle is the quick way to get conversational in a new language like Spanish German Portuguese and more you can try battles were free to go to battle dot com or download the app and try and for free\nThat battle B. A. D. D. E. L. dot com or download the app to try it for free that babble dot com\nDon't replace the carpets zeroes clean and safe ... D. C. dot com\nAnd they all traffic in with her children in the daytime cleaning traffic center on sixty six east bounding actually that was right before the beltway was cleared up lingering volume from that leads people to graduate need proving Ninety five sounds found\nHis to soften were wondering what birch dance or they are going to more delays sounds that on this Friday from dumb presented the triangle and then from ... to go off and on through Stafford county the outer loop with the bell ways well from two to up to fifty and then again from the university boulevard around to Georgia Avenue now from garage door was heritage I come at W. M. I. L. Weather Channel forecasts\nWe have bright sunshine it's chilly though that the wind dying down this afternoon a high sixty four tonight it'll be cloudy with a possible showers overnight down to fifty then tomorrow\nMorning showers lingering and they will clear in the afternoon I just fifty nine degrees for Sunday\nTalking about overcast guys in high stick to the degree now partly sunny and Chantilly we have sun shining Greenbelt partly sunny Reagan National sixty four degree bar for free and I'm One of five point nine at them and they and fix thirty Washington Mall several un AL Dr\n... Johnson is in northern Virginia base small business owner she's also a colonel in the Army Reserves she needed funding to grow our business banks wouldn't help and online lenders were too expensive\nThen Joni found street shares run by your fellow military veterans street shares is a finance company on a mission to serve veteran owned and Main street businesses\nAre street chairs offer small business loan lines of credit and government contract financing that's fast\nFair and flexible street cheers achieve that commission whether supportive everyday Americans like you who invested in St chairs veteran business bought a social impact investment that supports veteran businesses while returning five percent fixed Daniel interest and providing flexible liquidity\nIf you need funding for your business or you want to earn solid returns while supporting military veteran entrepreneur street chairs dot com today [noise]\n... chairs dot com [noise] this is not an offer to buy nor solicitation to sell securities all investments about risk Lucy are offering\nStatement for whole details terms and conditions apply\nShe she was in\nHi welcome back Rush Limbaugh doing what I was born to do [noise]\nThe on the right yeah and you were born\nIn what we're doing to and it was [noise]\nOkay so fast ... hours a day when we get a lot done here so a lot to do so we just can't on non attract they don't let your way through a Jew eight eight to if you want to join us [noise]\nSo I got a [noise] a couple of emails weren't some of the year old woman yet the kind of have a one woman run I'm sixty six years old Russia had anything like it just kind of hate and I went to school you know\nTo University of science she ... [noise] if you're just joining us we're talking about\nSome ... named Victoria missile brown who was Seventy years old she has an op ed in the Washington Post\nToday Thanks for not raping us all your good man but that's not enough and she makes no bones about the fact that she's livid she is leaving the X. men period and I'm not going to respect the whole thing because it's at\nAbout the fact that she's livid she is leaving at men period\nI'm not going to respect the whole thing because it's at and my treatment of it is a soon to be at Rush Limbaugh dot coms where's the woman like this get this kind of hate\nThe ... is is not a single bit of it has ever been corroborated like ball the foreign story not a single bit of corroborate shouldn't no evidence whatsoever and yet that dot CA was used to get a finds a warrant to spy on the Trump campaign\nAnd that dot CA is what kicked off in a truth ... special counsel investigation and try to find collusion between Trump and Russia to many of his old those but that's what Trump's for learning to and Trump does exactly right the collusion here between anybody in Russia is the Hillary Clinton campaigned the DNC\nAnd the route is Hillary Clinton DNC to I'm a fusion GPS then on to Perkins collie and then just deals for the money still got went through a\nBunch of different layers before he got it but they essentially commissioned an opposition research hit piece on Trump that they tried to sell everybody was legitimate until Trump's one miss out\nHillary those bananas she can't believe the truth is being told about her she can't believe it they can't let this day and so she has to Trump is the guy that as the roses there had me he did it on national TV Trump is a guy that he would and they have tried to make this case\nIt's the funniest thing in the world Trump was down in Miami up his resort down there to route and this was a period of time where Hillary's emails ever sixty thousand total on her server\nAnd she told the the legal or illegal server private server private address while she sector I said\nThis was discovered new and it was Hillary was told she had to turn some of those over says well half of these are personal and their nobody's business there about Chelsea's wedding reception and her registry and yoga lessons at all that so I'm not going to let you see those she turned over thirty thousand\nDo investigators leaving thirty thousand still on the scene\nShe tried to tell her about a neighbor to lead this caused a frenzy in the media and elsewhere to try to find them and the media kept making a big deal out of it and a lot of other people were too so Trump decided to have a little fun\nIn the middle of the news cycle where Hillary's missing thirty thousand emails were prominently disgust\nTrump said hey Russia Russia if you're listening maybe you can find Hillary's missing emails and then you can tell us media\nThey might be very interested although I doubt\nThat moment\nThat I I'm laughing myself silly when I hear that this is it that is my favorite kind of humor this is just Ramadan right down their faces and making fat tire out of what they do this this this is their dead serious about Trump's mocking them and laughing at when they converted this\nEnds with Donald Trump\nOpenly asking the Russians to hack Hillary's server and they try to say that that was evidence of Trump collusion with Russia and Trump was simply doing what Trump does he was laughing at them\nAt the futility that none of the greatest investigative agencies in America can find Hillary's emails media could not find Hillary's emails the best investigators but nosy as people and nobody can\nTrump didn't believe nobody can find them Trump believed everybody was shielding them in protecting Hillary so he said hey Russia maybe you can find them none of our people seem to know where they are maybe you could jewelry is still bug by this\nYou asked Russia hacked me on national TV she went to Twitter to make that point and Trump did no such thing ... anybody would even the slightest sense of humor would realize\nHe was making a blindingly obvious\nWhen he said the news media would reward Russia for finding Hillary's emails before Trump quote is Russia if you're listening I Hope you're able to find the thirty thousand emails that are missing I think you'll probably be rewarded mightily by our press he was being sarcastic because everybody was trying to hide those emails because there is no doubt they were incriminating\nThat's why nobody knows where they are now to talk radio oh yard were\nSmall and washing come\nTalk temperatures change this time of year and so do sleeping patterns especially as the wetter begins to cool while one person sleep soundly the other is either freezing are way too hot depending on where to ...\nUh bowling branch makers are the world's most comfortable sheets loved by free us presidents by the way are offering their luxury flannel betting for a limited time\nMost comfortable sheets loving to buy for us presidents by the way are offering their luxury flannel betting for a limited time he's are unbelievably soft folks there warm and breed the ... everybody stays the right temperature\nThese flannel sheets coming fourteen patterns in color so there's a style and a color right for your home\nYou can even try them for thirty nights risk free that's the bowling branch guaranteeing last year there flannel sheets sold out in just a few weeks don't wait on this go bowling branch dot com today for fifty dollars off your first set of shifts and free shipping with the ... rush my name\nBowling branch dot com you spelled B O L L and branch\nDot com remember the ... code rush\nHi Michelle ... one of the biggest outrageous I recorded on with the trial of abortion doctor Kermit ties now now the woman goes into a clinic comes on data there is no police report and I helped get both the crime the mainstream media tried to cover up we had instructions snacks and of course the gods now movie is amazing Cormac God's nails perhaps\nThe most holistic through an American who bring friends and family you do not want to pass something unique opportunity to change our mind about abortion God's know rated PG Thirteen no play\nTonight ten nine central on ABC finish the sentence for millennia Trump is the first lady the interview can women in the me too movement call you a supporter\nNo questions is off limits you're not the first first lady to have to deal with her husband's alleged infidelity has just put a strain on your marriage tonight what ... say let's talk about the jacket this\nWhy did you wear being ... the ABC exclusive event\nDon't miss it tonight at ten nine central on ABC\nHey Larry O'Connor here recently I met with David Foster and his team at foster remodeling solutions expansive designing selection show room\nFor the past thirty five years foster remodeling solutions has been providing northern Virginia families with award winning home renovation projects the best fit their current and future lifestyle whether it's a redesign of your homes lay out to age in place a newborn may kitchen for those who love to cook for a bathroom\nThat will make you feel like you're living at a spa foster remodeling solutions can make it easy David explained that no matter the need the key to a great home renovation project is proper planning\nHonestly you're going to be shocked how simple the entire process can be an old craftsmanship it's amazing for complimentary consultation and thirty percent off of design agreement called the company I recommend foster remodeling solutions seven three seven four or five eleven ten that's seven three seven\nFour or five eleven ten or on line of pasta remodeling dot com foster remodeling solutions they're process makes it perfect\nHow do you ever wanted to speak another language whether you want to speak Spanish French or German battles ten to Fifteen minute lessons ... speaking ... new language within weeks I just started learning Spanish with\nApple pie and it's really helping me with my pronunciation almost ... call multi almost\n... said that it\nGot it covered I speak Spanish I Wish I tried babble sooner battles\nAward winning technology gets he's speaking right away and best of all you'll remember what you've learned no wonder battle is the number one selling language learning happened to Europe and\nWe tried for yourself and see my battle is the quick way to get conversational in a new language like Spanish German Portuguese and more you can try battles were free to go to battle dot com or download the app and try and for free\nThat's battle B. A. B. C. D. E. L. dot com or download the app to try it for free that's babble dot com\nThat Chris plants show we have nine AM to Washington Mall double E. N. A. L. Washington comes to tough\n\nIt is a highly as in Nineteen Seventy two [noise]\nHere so long for a woman a black dress I knew Grinnell College was in Iowa and new like when I was a big name id say Grinnell big name in Iowa tests where this [noise]\nWashington Post op ed writer taught young people at school back to the phones this is Aaron in Boise idaho hot\nAir or negative ... thank you sir great to have you here with us\nThank you I Know you say it's a it's kind of let sometimes when I left the ... but I wanted to bring up some regarding Brett Kavanaugh and all that without about him and his high school drinking and whatnot but\nUh I remember when President Obama when he was a campaign and whatnot he was talking about uh or actually it was in his book where he spoke about how in high school is that most of the ... days\nBecause he was trying drugs and alcohol and ethically yeah you never hear ever anyone in the left is ever even mention it\nThat's exactly right it is it called him so he was in the gym yet these are people who went to somebody's card and I started blowing dope\nAnd fill it with the video exist what are the people were asked why isn't Obama weighing in on Capitol why an old bottle because Obama knew these videos are out there he couldn't wait in because he had admitted to much more\nI'm a weighing in on Capitol wiring a bottle because Obama knew these videos are out there he couldn't way in because he had admitted to much more than ... ever did your no no you're exactly right\nYeah I don't know like it's at this point a to point it out but at least I like to try and shove it down their throats every chance I\nOf stress or more plausible\nInterpretation for all of this interview of some psychological experts is that Trump has been cultivating adapting and prospering from his distinctive brand of provocation brinksmanship and self drama for the past Seventy two years what we're seeing is merely the president's\nOwn definition of normal it's only the audience who finds the performance disorienting emerged Trump's not crazy but the rest of us are getting their of fast\nAnd people are going to psychiatrist and paying money to be told this we tone Trump is driving them crazy\nHe literally is causing them to lose their sanity you thought I'd been joking or the exaggerating about this and I'm not we're dealing with people who are genuinely on here\nThey haven't gotten over the fact that Trump won they can't get over the fact that they're people can't get rid of Trump the intelligence agencies the FBI that the OJ the deep state powerful people in Washington the Democrat Party\nOver liable as like Dianne Feinstein Chuck Schumer can't lay out Guam on Trump and there beside themselves getting rid of Republicans has never been as hard\n[noise] [noise]\n[noise] Trump signed legislation to clean up millions of tons of garbage from the world's oceans Obama didn't\nDo this president Donald Trump\nAdded his signature till the save our cities act on Thursday green lighting and initiative to clean up eight million tons of day Bree from the planets oceans\n\nSponsored by Alaska Republican senator Dan Sullivan the bill aims to promote better domestic at millennials are gonna go nuts over this\nThis is the big deal to them or as a big deal this is sustainability of their life providing and supporting planet and Obama didn't do what Trump is doing it\nThey're going to be so conflicted they want to plug this they want to support this they want to thank Trump for doing this but they just can't think Trump on my God I'm telling you it's funny to watch this and it's funny\nParts of it are dangerous to it because we're not talking about people in the French were talking about a whole lot of mainstream Democrats who are losing their minds\nHere [noise] and the number\nIs growing exponentially back to the phones Paul in wiping just falls New York it's great the way that you waited thank you and welcome to the program\nThank you very much Russia listening to you again one on WABC and I've been listening every since I really appreciate what you do [noise] and my memory is correct when he first moved to New York did you not lose your luggage or your your furniture never arrived\nWithout engine dad did they did the moving trucks that had all of my worst league good jak got parked in a truck staff of the trucks on Indiana the driver quit\n[laughter] hadn't got driver got mad at a company and I didn't have I didn't have luggage Jacques for the first month after I got the furniture nothing I have no worldly possessions other than my briefcase\nAnd the club has worked for for a month yeah you're right that was the\nOne of the first elements of the uh debuting other program your your memory is really good to remember that\nWell thank you [laughter] I'm calling I wanted to talk about what's left is dealing with the intolerance and how that relates to the Saudi journalist ... oh yeah but I first of all I mentioned just ironically didn't want us to talk about I happen to be a clinical psychologist in private practice and I am not soon\nYou know people coming into the office falling apart because of Trump\nIt's just not really happening sometimes it gets mentioned in passing but but um it's not really happening and when people mention anything that triggers a stress free stops\nIt really isn't the the stress or that's the problem it's helping people to manage their own ability to deal with stress because they could they could have problems in any issue money or relationships or something else which really help them get the get stronger TV [noise]\nOr to build some palaces and to not check some so Chris soon to be a little more open minded [noise]\nI'm ... I'm not seeing with with some of those people are saying\nWell now wait a minute now are you suggesting that the store\nA little more open minded I'm ... I'm not seeing with what most people are saying\nWell now wait a minute now are you suggesting that the story is in the political that's the equivalent\nOf something as big of a widespread the Washington Post them or you suggesting that the story is exaggerated and not that many people are suffering from this ah trumped arrangement syndrome or whatever\nI can tell you that I have an extremely busy practice and it's not happening does Trump get mentioned in passing yes so didn't George Bush so they ... Obama but usually they were not ... they're member\nYeah but what if your office was on the Upper West side or what if your office was in Georgetown or you know in Hollywood Boulevard what it's wiping tears falls is not I mean you've got basically when Jimmy Stewart's up that right\n[laughter] well I'm sixty miles from New York City so it's not too bad\nWell that's that's far enough away I mean that's the way in a whopping just falls not Manhattan for a reason\n[laughter] well if someone came to me and they were really really upset about Trump my goal will be to try to help them manage that so they don't say don't fall apart because Trump is not the issue and they'd be the issue is rarely the trigger unless it's unless it's\nOn the street you're being responsible I think the psychiatrist these people are going to say are suffering from the same things I don't really shrinks know how to help them I think the drinks are probably encouraging them that they're justified in feeling this way to Trump is enough of a rubber ... there make anybody feel this way and that's normal\nI can tell you one thing that I'm I'm right of center and I'm In the minority in psychological and psychiatric the whole\nOh yeah Oh absolutely\nSo that that that bias does bring in someone who's very much a progressive or liberal [noise] um they will certainly be affected by what's going on okay\nLet me ask you this I'm a you may not be able to tell me this because of a a patient client or a confidentiality I'm not asking any names but what what percentage of the people\nWho are coming to see you for help are in fact out of kilter because of politics not maybe Trump per se or any other personality but just politics in general how many of them are in a state of confusion or stress just because of politics\nSays zero percent zero percent yup zero percent that's it because they're not coming here with\nFor that is that they have other things to do they're worried about you know their families are they're going through a divorce or they have anxiety or depression about other things or they were traumatized [noise] um\nLet's see two liberals all of that is Trump spoiled [noise] 'cause he got elected and he's president it's all his fault [noise]\nThat you know it's it's interesting one of the things that helped me here to the right was psychology when I was running it because um when people come into my office and that sort of have terrible child [noise]\nAnd and maybe it's legit they were mistreated and they were viewed as I can sympathize emphasize and I say that was horrible now we have to do the work of getting past it and continue to blank oh doesn't help\nAnd having the attitude that somebody else must change in order for you to feel better there's backwards we have to be willing\nTo thank you you have just the mind liberalism ... daddy is perfect everybody else must change in order for these people to feel normal and God that's exactly it they force everybody to become what they demand\nAnd to love it at the same time ah that's I'm Glad you call I really appreciate it\nA Paul thank you I'm up against it on time I have to go but I'm I'm really up also flattered you're a lifer\nAugust first eighty eight is the first day of this program and yeah I think it was I forget the name of the of the\nMoving company I Want to say nationwide but I think it was it anyway but furniture was due to arrive on a date and it didn't show up but it didn't show up and we call a company that is why it's always will be there to win brother one day after tomorrow\nWell a month a goes by and they finally had to call the FBI to go find the ban because nobody knew where the ban was on the driver had parked at a trucks drop\nA truck stop somewhere in Indiana and had just walked away from it he was mad at the company and then that delayed it even further because the FBI they had to go inspect the contents and make sure everything was okay it was what a\nPain goes from\nRussia have high be met for\nTalk prices for these buildings all United with windows ... additional business owners rent or at least space including storage space stop wasting your money paying someone else for your space you can now see a ton of money and own your own building with the incredible\nNo business owners who rent or at least space including storage space stop wasting your money paying someone else for your space you can now save a ton of money and own your own building with the incredible sale prices from\nGeneral steel it's right now you can save as much as half the time and cost of conventional construction and stop renting space from others just go eight eight forty one steal to see how general seal can help you save money or fifty years structural warranty buildings are\nCustom designed for your needs you can get a forty by sixty building burn less than twenty five thousand dollars for a fifty by one hundred Klinsmann building for under forty thousand dollars there's no wasted space in construction takes half\nInto the temptation IRA reduce stock market downside risk and lock him ten percent annual returned guaranteed for the next ten years\nYou might be wondering how is that possible with just one called for jury advisor David errands you'll get all your questions answered I'd known David for years recently he showed me the ten ten irate program and I was amazed\nKobe but now they have a free information packet I'm a ten ten IRA delivered to you call or text to eight eight four one one forty one thirty that's eight eight eight four one one forty one thirty call or text to eight eight eight four one one forty one thirty oh you are they all up and which do you uh male washing\nOld are you in\nThe mail news it to a barber bread the state of emergency remains in effect in Virginia where nearly as many people died from hurricane Michael as in Florida\nThis storm killed five people according to governor Ralph Northam he sat for drowned in Hanover firefighters died in a crash responding to call in the storm\nWe hope that the number of fatalities due to the storm will not increase\nKnow evacuations were ordered for tropical storm Michael but north them doesn't think they would have saved lives he's had they're usually ordered for coastal areas\nMost of the the you know damage that we have suffered in this particular storm has been from heavy rains and and when to approve the trees\nHad her Curtis ... dot com\nAnd American pastor jailed in Turkey for two years is coming home pastor Andrew Brunson being released tweets President Trump meanwhile turkey now says it has proved on tape audio and video that journalists ... was killed inside the Saudi constantly than is simple something the Saudis deny if they lower this man\nInto that conflict and they killed them and they chopped up his body and now they're lying about it that is going to have a dramatically negative impact\nOn us relationship with Saudi Arabia on Capitol Hill members of Congress are going to be up in arms about that including myself something's gonna happen\nSenator Marco Rubio the archbishop of Washington steps down in one capacity\nOver the last three months there have been studying calls for his resignation including from some of his own parades on his own faithful in Washington today and Pope Francis did except his resignation as expected\nCorrespondent John Allen in Rome cardinal Donald Wuerl will stay on overseeing day to day operations in the archdiocese the Washington until a replacement is found\nGovernor Larry Hogan plan to add Lexus lanes di do Seventy not getting a groundswell of support according to a new Washington post poll al says forty four percent of registered voters\nSaver express lanes fifty percent said no thanks those numbers are generally similar among Republicans and Democrats\nTo brand new elementary schools and loud and county already packed to the guilt\nThe concern obviously as as we look at the elementary schools down in the south Madison's trust in Goshen post specifically those two schools personally a hundred and twenty percent capacity\nJeff more it's loud and county public schools and board member says the only option he sees aside for redrawing attendance boundaries is to expand the existing school buildings it is another royal wedding that we are not invited to as Britain's prince says Eugene need the daughter of Sarah the duchess of York was married today at Windsor Castle\nAny ... any any handle it will be waiting among many many others I Know when we came to have\nMany new off with a very responded\nAnd Stewart the mega millions lottery way up their dog Lloyd the public affairs were representative with Marilyn said lottery we've\nGot a pair of dueling ... are powerful and make a million and of course everybody's talking about and I make a million ... five hundred and forty million dollars with an estimated cash value after taxes of three hundred and nine point two million dollars\nThat drawing as tonight checking your money on Wall street little recovery going on Dow Jones up a hundred and Eighteen NASDAQ up a hundred and eight W and they all traffic and whether next\nSaturday on WMA you start your day would do it yourself investor radio at five and it's a Saturday morning update with Rick bell or it's six listen for gardens and city at night it's legally speaking\nIs it true self investor radio it by then it's a Saturday morning up day with Rick Ballard six\nListen for gardens and said age at night and it's legally speaking with my colleague at ten here ... at noon it's about federal benefits with winter trucks all had won its mortgage radio too it's the retirement key at three it's to do it yourself investors show here an encore presentation of the mortgage radio show at seven\nAnd don't forget Sunday night it's evidence real estate today on WMA L\nIf you're like most people and you see two gas stations and one ... gas for a little bit west you go to that one it just makes sense every little bit helps but here's what's weird though sometimes we save a few pennies here and there and ignore opportunities to save\nHuge money life changing money if you switch to net is share for your health care it could be massive savings for you the typical savings for a family it's five hundred dollars a month\nI think what you could do that over time just\nDoing the math of six thousand dollars a year that\nThe significant and yes people love it and they love it because it works it's believers who share each other's healthcare costs more than four hundred thousand people are now members and met a share and it's growing like crazy fight on how much you could save and why met a share it's so popular go to net a share dot com or\nCalled eight four four Ninety One Bible essay for four Ninety One Bible Neda share dot com or aid for four Ninety One Bible\n[noise] find out how deep the retires on their retirement ... Saturday afternoon it to here on W. N. E. L.\nYour mail traffic and whether ed Rodriguez and they had the carpet cleaning trap center\nWell tomorrow either sneaking out a little bit early on friday the busiest beltway getting right now we've got traffic jams on the Internet just crossing the American legion bridge from Virginia and Maryland against those who seventies for a\nThe Mormon temple on the outer loop kind of knew delay from Delaware now they're all the way down the route fifty over on the out all the traffic jams up to\nFor and forests bulletproof fifty\nAnd again often on from my Ninety five and ... to Seventy now from garage door we shared on Tom\nBright sunshine out there it's killing would get the wind down down this afternoon high sixty four tonight cloudy possible ... hours every night low fifty degrees tomorrow for Saturday morning shower\nAn afternoon clearing Heinz fifty nine degrees on Sunday looking over cancer the high to hit sixty four now mostly sunny in Alexandria sixty degrees in Albany sixty horn Reagan National in sunshine I'm Barbara ... W A L K it's\nLarry O'Connor and this is a true fact\nLast year over forty nine percent of the homes listed didn't so with the real estate agent who actually took the initial listing\nAre the result of that is well it cost home sellers thousands of dollars in lower offers and painful holding cause\nSee this is why I always recommend my real ... in Debbie Reynolds of the rentals team with color Williams Syria and Debbie already have the buyers in fact they have over seven thousand ready buyers looking to buy right now\nSyrian Debbie Reynolds lead the industry with getting your home so fast and for top dollar ... their sellers six percent more money on average Syrian Debby will even guarantee if you're home doesn't so they'll buy it for cash at a price acceptable to you\nCall the rentals seem direct right now eight for for three four four sold that aid for for three four four sold or visit Debby has the buyers dot com that Debbie has the buyers dot com [noise]\n... ...\nBeen talking about this I didn't mention it on on the show this week I Am the story\nBut I was just crazy I'm not even gonna wait time of day then hear the story\nThird grade teacher up Stephen Miller Stephen Miller is\nVery ranking advisor to trauma in the White House brilliant guy came out of Jeff Sessions' job\nAnd he's Trump primary advisor on immigration and you hear the stories this week\nA third grade teacher claim that he ate below [noise]\nIn the third grade\nMany times a week\nWe see stories of the [noise]\nCheck leftist people [noise] so stay these outrageous should've [noise] lying sayings about Trump and have long horn [noise]\n\nTwo thousand rages unconscionable lying things about from from people [noise]\nAnd\nWhen it's discovered that they have it making it all off some of these people are still spend this [noise] some of them get fired not many [noise] some of them are put on leave ... has discombobulated these people that that they are literally\nHuman and some Bible tissue mass or what have you uh it's got\nStars people that you know people to put their careers on the line of star and this moving the odds are that they're going to have trouble getting cast and other movies having been identified with is dean Cain is one\nOf the ah the actor who plays a gazelle himself as a as an actor and I think ... commercials name was Earl Billings for somebody that's\nOnly widely known as an actor in TV commercial this guy does one heck\n\nOf a job it's probably the finest [noise]\nRole that he's played for the best performance that he's had a I Would guess or as an actor but I just wanted to let you know that if it if you're thinking about going to states PG Thirteen we're not talking acts we're not we're not even talking ours here so you're not\nGoing to be immersed in a bunch of\nRepulsive Gore and again it's it's thought that they don't need to do that tell this story up the story itself tells itself\nThe trial of America's biggest serial killer there are a lot of people who have put everything in their careers on the line to get the movie made they got it made a\nLot of people to put their careers with a line of agreeing to appear and start even Searcy a directing\nThe films of [noise] [noise]\nI've ... I it it it's it's powerfully\nDone and it opens than I Am if if you don't know about ... if you've not heard the name of it doesn't ring a bell you by all means should say this if you do know who goes well is and if you think you know the story\nYou should see this\nAnd it's also good much as I say if it follows a procedural format so you're you're not watching a political documentary here you're watching a movie in portrayal of a real life event and it's treated as a real life event has any other would be without a lot of political preaching\n[noise]\nBecause it's felt it's not necessary and it isn't the story itself is [noise]\nPart stopping enough as it is so good guys now the trial of America's biggest serial killer opening today they've had they've had a the red carpet premieres and so forth and [noise]\nPeople who have a scene of our our raving about it just so you know brief time out we'll be back and continue after\nDoing more mainstream American media just fall Rosh ... be men were\nAnd\nTalk two weeks only left to get the Ginia cell sunspot correct or free for sunspots age thoughts and even read inflamed patches\nI loved the junior cell sunspot correct or it might go to product every day I have sun spots in eight spots and can see a definite difference in my skin since using it\nThat's Renee from Boulder, Colorado raving about the brand new genius el sunspot correct there and for the next two weeks only you can still get the sunspot miracle free but time is running out watch your sunspots vantage and your bags and puffing is gone for results in as little as twelve hours the genius el immediate effects is also yours free\nBuilt a genius L. dot com now or call eight hundred eight two to five nine four one still thinking about it we'll order this weekend receive Germany's a luxury micro Durham abrasion also free reached Juba Natan unplug porous for instantly radiate baby soft skin\nAnd these two weeks shipping is also free call eight hundred eight two to five nine for one or go to genius L. dot com that's the genius L. dot com genius L. dot com\nTonight ten nine central on ABC finish the sentence for millennia Trump is the first lady can win and to me to call you a supporter no question off you're not the first first lady to\nHave to deal with her husband's infidelity has put a strain on your marriage tonight what role in the long term say let's talk about the jacket on\nWhy did you where the Milan the NBC exclusive\nEvent don't miss it tonight at ten nine central on ABC [noise]\nLooking great Rob thanks man I was planning on adding a deck too\nTo live I don't miss tonight at ten nine central on ABC [noise]\nBackyards looking great Rob thanks man I was planning on adding a deck to no one could contractors why don't you just have combing visor on what\nHome advisor dot com you just tell them about your project and they match you with local pros that can do the job nice but how much does it cost home advisors totally free to use plus you can reach customer reviews check pricing and book appointments for free what's the website again home advisor dot com or just download the free home advisor having [noise]\nRush Limbaugh has brought to you by Kevin discounters drop in the kitchen cabinet and Japan style out on the floor originally spices in the back and everything falls out and it's you know I said I ... for the holidays because you're tired tops or in such bad shape when he can help [noise]\nSpruce abhor nature remodeled designer to Canada in manners can have a look at our website had an ...\nBoise pride your mom mom\nScanners and now I never told me for\nCheck out this month special offers by showing locations hours and hours had cabinet just ... cabinet discounters\nAnd how do you ever wanted to speak another language whether you want to speak Spanish French or German battles ten to Fifteen minute lessons can gain speaking confidently in your new language within weeks\nI just started learning Spanish with apple and it's really helping me with my pronunciation is yeah must call multi ...\n... feet all day at a\nHigh got at least they'll cover that we are six vantage that I Wish I tried battle sooner battles award winning technology gets he's speaking right away then basketball you'll remember what you've learned no wonder babble is the number one selling language learning happen to Europe\nPride for yourself and see why battle is the quick way to get conversational in a new language like Spanish German Portuguese and more you can try battles were free to go to\n... dot com or download the app and tried for free that battle B a B B. E. L. dot com or download the app to try it for free that's\nBabble dot com\nCaught up on your way home with the biggest payment Rio hunter show every day right after run [noise]\nWhy keep intending to go to the phones and an enormous keeps coming in\nAnd a nose keeps dragging me back even though I keep trying to head toward the yellow blinking right here on the phone when I get to you here in a minute you're recall the story yesterday I told you about Jamal ... the Saudi journalist\nWho is reportedly been dismembered murdered in the Saudi consulate in scramble\nBecause of his criticism of the crown prince and Saudi Arabia Mohammed bin solemn up\nI went through every ... of the story\n... said Saudi journalist very critical of the so called reform movement in Saudi Arabia being led by the crown prince\nMohammed bin Salman known popularly by as friends as MPs [noise] he's thirty\nTwo millennials got all these reform plans that your mom your show he didn't think he really millions and think they were true been very very critical juncture show me\nWant to get married he had to get a legal marriage license or document chose to go to the Soviet sorry Saudi consulate in Istanbul and nobody has seen it since he went in\nAnd now the Turks say they have audio recordings that prove he was murdered in the side that\nThe president of the United states has talked about this was a very serious thing but says look we have an outstanding deals with the Saudis that we cannot derailed just because of this is this outrage the media\nEven though Trump\nWas initially very hard on Saudi Arabia claiming if this happened and if it was proven this was very very bad we're not going to look the other way [noise] [noise] well here's the development of evidence was that this was one of the things I shoot myself I should figure for not having predicted this yesterday when I told you the story [noise]\nWe have a tweet here from a guy named Daniel Klaidman now he's the editor in chief at Yahoo\nYahoo News here's his tweets\nClose friend of Washington Post columnist Jamal ... tells Michael it's a cough and me that the Saudi crown prince Mohammed bin ... may have felt emboldened\nIt's a cough and me that the Saudi\nCrown prince Mohammed bin ... may have felt emboldened in\nParentheses to murder but journalist by Trump's anti media rhetoric Trump hates\nJournalists and he would not react if we kill one journalist says colleague Andy fury [noise] and so now with democracy all\nGave thought to have been murdered and dismembered and by the way they think now that he's been buried in a plot of grass\nAll of the decisions that hire all the architect everything else has to be done to build a gigantic mall only to realize it's gonna be submerged underwater in a few years\nWho would do this what kind of response planning commission would permit it what kind of developer would waste is money the point is nobody really believes that word has mall is being built is going to be inundated by rising sea levels anytime soon\nThere's a there's another analogy that this ... Gulf Stream which is a manufacturer\nOf one of the largest most popular corporate aircraft in America the gulfstream series there's the G. five fifty or ... about forty five ... four ... four fifty\nA when they announced they were going to build the G six fifty six fifty as a like a foot wide or a little bit taller um has a massive range ... interior\nAnd they announced this at a time where the media was telling us that we were on the verge of running out of fossil fuels and that the supply of fossil fuels finite\nAnd we were gonna have to do something real fast because we're losing votes will be up to start conserving and fossil fuels it's a good thing anyway because they caused climate change and so forth and I asked myself why would Gulf Stream I happen to know the c._e._o. at the time\nI thought why are you guys doing this if you how are you going to power this jet how are you if there isn't going to be any kerosene refined which is jet fuel jet a if you're not going to have enough jet fuel for anybody who buys this plane to fly it why are you going to make it\nSo well what you're hearing isn't true well\nWe routinely study the fuel markets ... you're right Mr ... there's no way that we would design and produce manufacture a brand new jet if there isn't going to be ample supply is a feel for it\nAnd he said by the way we're not the only people to make jets there continue to make new ones everybody I Know when the jet business said the gulfstream CEO is designing and building new what's in fact Mr Limbaugh you can look around we'll find some people actually trying to redesign supersonic travel\nInto Concord right so how can any of his be if we're hearing that there's a finite supply of fossil fuel and that you're not going to get enough for anybody to be able to fuel and one of these planes to fly anywhere he said well just simply isn't true\nSo I once you get realized listen to the people who are making financial investments\nIn their products and and their businesses designed to grow the business and sell them why would they start making new airplanes if there isn't going to be any fuel why would they build a brand new big mall if it's going to be underwater in five years\nOld you have to do is look at real life look at people at what they're investing in where they are investing at an angel no the future\nYou'll at least not worth the smart money thinks we're headed in the future as much as anybody can do it but I'm just here to tell you\nThat old Jim here on Jupiter is right there is no way on earth you build the biggest mall and the state of Florida or in many other states in a place that you think it's going to be underwater or that Al Gore thinks is going to be underwater\nDoes that change with Al Gore said no no no in fact in Hawaii they have these things periodically called king tides and when king tides hit in Honolulu and a woman who you can have streets in Waikiki temporarily flooded when those things happened in the king tides have happened in ... when king tides happened that's when Al Gore goes on TV\nTo see the climate change rising sea levels precursor Honolulu soon to be underwater it's just a king tide happens regularly it goes out it comes and it goes away\nThey just lie to people folks they simply lie and make it up making money making money all the way\nWe want to leave the ER worse\nLong you can double and\nTo talk if you suffer from E. D. and you've seen your doctor about the little blue pill you know can be expensive and seeing the doctor and waiting at the pharmacy can be a hassle wonder if\nIf you suffer from E. D. and you've seen your doctor about the little blue pill you can be expensive and seeing the doctor and waiting at the pharmacy can be a hassle\nWhat if I told you that a certain little blue pill just came up Paton December eleventh and that the active ingredient that's in the little blue pill is now available and generic form available to you for thirty dollars for a month's supply that's a big discount no more getting ripped off by the big pharma companies\nWith four ... dot com you can bypass the doctor's office pharmacy visit and see huge money on your prescription ... just go to for hymns dot com slash one\nConsulted licensed physician ad following their confidential medical review you can have the proper prescription deliver directly to your door for a fraction of the price and today we'll supplies last you can get started with a trial month for just five bucks that's right five dollars because what you do just go to for hands dot com F. O. R. H. I. M. S. dot com slash want today and get started for five dollars while supplies last\nVisit for hymns dot com slash want right now for hymns dot com slash want\nTo see what's safe for Forty Tales mental services to the platform are available and if he stays\nTonight ... central on ABC finish the sentence for me millennia Trump is the first lady came when in the me too movement\nCall us border no questions Hoffman you're not the first first lady to have to deal with her husband's alleged infidelity has put a strain on your marriage to know what will Milan Trump say let's talk about the jacket this\nWhy did you wear being Milan ABC\nExclusively that don't miss it tonight and ten nine central on ABC\nCarlo a steel worker is married to his high school sweetheart a cancer survivor they have a special needs son Carlos just been laid off from his job losing his medical insurance and to make matters worse the bank is about to foreclose on his house with his back\nAgainst the wall Carlo will do anything to protect his family directed by an starring James ... Carlo is a ... a little on Amazon I tunes and Google Play watch Carlos inspiring story today on Amazon iTunes and Google Play\nParamount tactical solutions presents corruption but self defense what Steve to Ronnie\nParamount technical solutions specializes in firearms and medical training but they also realized that carrying a firearm for self defense isn't always an option so being able to defend yourself with an edge weapon or against a knife attack\nIs a critical skill for self protection in this two day course happening October twenty seven twenty eight ... seed to run he will discuss and demonstrate the features in advantages of using ... for self defense\nThis course will be perfect for beginners with no self defense or edge weapons training and yet every bit as relevant Britain France students all trading equipment will be provided active duty military and law enforcement discounts available by calling ... for six to zero for nine to one spaces are limited sewing role as soon as possible\nFor more information or to enroll good at paramount tactical dot com that's paramount tactical dot com in our house\nBedtime is complicated my wife is always freezing and when she layers of the bed I get way too hot Hi I'm Scott tan and founder of bone branch makers of the world's most comfortable seats loved by three us presidents if you're like us you'll love our flannel betting back for a limited time at all and branch dot com\nThey're unbelievably soft warm and bring the ball so he stays warm and I don't overheat it's like magic we let you sleep in them for thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets coming fourteen stunning patterns and colors you're guaranteed to find a style you love but don't wait last year they sold out and just a few weeks go to ... dot com today for fifty dollars off your first set of sheep plus free shipping with criminal code relief\nThat fifty dollars off plus free shipping right now at bowling branch dot com promo code relief bowling branch dot com spelled B O L L and to branch dot com promote relief\nMichael than we have six to nine PM Washington Mall W A L Washington comes to talk [noise]\n\nOkay we got some audio soundbites here of the mob reacting the economy was in the oval office yesterday we played a lot of us down by German so you're familiar with what happened to Jim Brown versus the American you're it went off on a number of subjects\n[noise] he happened to other a couple of pro family as you can just ... you can imagine the reaction of some people\nIn certain places it was it was over the top primarily on CNN and in a number of other places or CNN I guess\nI just want you to listen to how they're describing Kanye West on on the one hand\nThey go they go out and embrace Taylor Taylor Swift even though she just white privilege and they abandoned con yet uh and it's it's\nThey want you to believe they love women and support women and African\nAmericans but you stray off the reservation\nAnd then your gender and your race have nothing to do with\nWhat the Democrats meant so here is black liberal Dr buys attacking Kanye West s\nWhat the Democrats meant so here is black liberal Dr buys attacking Kanye West as token negro as a minstrel show as a prop as mentally ill as a vintage trolling was dummy for white supremacist what I\nSaw was a minstrel show today the token negro of the Trump Administration is what happens when negroes don't read\nSomeone who is not in a healthy place from a mental point of view\nThe dog suffer from some mental illness he has some issues mental health issues\nNothing Kanye West today was about the black community like the music brother this is a prop moment this is white supremacy vibrant true of course I'm a black mouth is moving with white racist ideals are flowing from Kanye West ... mother is rolling over in her grave", "show_name": "The Rush Limbaugh Show", "year": "2018", "city": "Washington", "day": "12"}