{"month": "10", "state": "CA", "station": "KEIB", "content": "You know the Patriot dot L. A. is preempted Duda sports programming shaky IBM evil resumes streaming audio at the conclusion of the game for best is Kay eat I'd be Los Angeles streaming audio patriot dotted LA's preempted due to sports programming\nGeeky id will resume streaming audio at the conclusion of the game\nFast is K. E. I. B. Los Angeles streaming audio patriots ... preempted due to sports programming K. E. R. I. B. will resume streaming audio at the conclusion of the game\nPasses K. E. icy Los Angeles streaming audio and patriot dot LA's preempted due to sports programming\nKinky id evil resume streaming audio at the conclusion of the game\nMasters K. E. I. B. Los Angeles streaming audio patriot dot allies preempted sports programming ... I'd be will resume streaming audio at the conclusion of the game\nBest is ... I'd be Los Angeles streaming audio patriot dot L. A. is ... to do the sports programming ... I'd be evil resumes streaming audio at the conclusion of the game and\nThis is ... I'd be Los Angeles is streaming audio and hatred dot L. A. is preempted sports programming geeky I'd be will resume streaming audio at the conclusion of the game and fast is K. E. I. B.\nLos Angeles streaming audio patriot not LA's preempted due to sports programming Kiki I be evil resume streaming audio at the conclusion of the game\n[noise] basses K. E. I'd be Los Angeles streaming audio at patriot dot L. A. is preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game [noise]\n[noise] [noise] the\nBest is Kay eat I be Los Angeles and streaming audio and patriot dot L. A. preempted due to sports programming the ... id will resume streaming audio at the conclusion of the game\nPasses K. E. I'd be Los Angeles streaming audio and patriot dot L. A. preempted do the sports programming ... id will resume streaming audio at the conclusion of the game the best is Katie id Los Angeles times streaming audio and patriot ... preemptive pseudo sports programming\nGeeky id will resume streaming audio at the conclusion of the game\nAnd in this case I'd be Los Angeles streaming audio at patriot dot LA's preempted due to sports programming ... I'd be evil resumes streaming audio at the conclusion of the game\nIn this case I beat Los Angeles streaming audio and patriot dot allies preempt into the sports programming\nEat id will resume streaming audio at the conclusion of the game the best is K. E. icy Los Angeles has streaming audio and patriot dot L. A. is preempt into the sports programming kinky id evil resume streaming audio at the conclusion of the game in\nKiki id will resume streaming audio at the conclusion of the game\nAnd in this case I'd be Los Angeles streaming audio at patriot Donna LA's preempted due to sports programming ... id evil resumes streaming audio at the conclusion of the game\nPasses K. E. I. B. Los Angeles streaming audio and patriot dot L. A. is preempt into the sports programming\nEat id evil resumes streaming audio at the conclusion of the game and the best is K. E. IP Los Angeles streaming audio and patriot dot L. A. is preempt into the sports programming kinky id evil resumes streaming audio at the conclusion of the game in\nThis case I'd be Los Angeles and\nStreaming audio at patriot dot LA's preempted due to sports programming\nK E R B will resume streaming audio is the conclusion of the game [noise] bad is Kay eat I'd be Los Angeles and streaming audio patriot dot L. A. is preempted due to sports programming\nKatie id will resume streaming audio at the conclusion of the game on the basis ... I'd be Los Angeles or streaming audio and patriot dot L. A. is preempted to to sports programming\nK E R B will resume streaming audio at the conclusion of the game will [noise]\nThis is Kay eat I be Los Angeles streaming audio patriot dot L. A. is preemptive due to sports programming shaky id evil resumes streaming audio at the conclusion of the game\nIs K. E. I. B. Los Angeles streaming audio and patriot dot L. A. is preempted due to sports programming K E R B will resume streaming audio at the conclusion of the game\n...\nBest is Kay eat I'd be Los Angeles streaming audio patriot dot LA's preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game fast is K. E. R. I. B. Los Angeles\nStreaming audio at patriots dot LA's preempted due to sports programming ... id will resume streaming audio at the conclusion of the game\nIs is K. E. R. I. B. sauce Angela streaming audio patriot dot L. A. is preemptive due to sports programming for a new id will resume streaming audio at the conclusion of the game\nBand is Katie I'd be in Los Angeles streaming audio patriot dot LA's preempted do this for the program a\nK E R B will resume streaming audio and the conclusion of the game ... I'd be Los Angeles clippers rename audio and patriots LA's preempted sports programming Katie id will resume streaming audio at the conclusion of the game\nPasses ... I'd be Los Angeles dreaming audio patriot John LA's preempted due to sports programming\nK. E. I. V. will resume streaming audio at the conclusion of the game\nAnd the\nIs K. E. IP Los Angeles streaming audio and patriot dot L. A. is preempt into the sports programming kinky id evil resume streaming audio at the conclusion of the game\nThis K eat I be Los Angeles streaming audio and patriot dot L. A. is preempted due to sports programming\nEat id evil resume streaming audio at the conclusion of the game all this is Kate I be Los Angeles and streaming audio patriot dot L. A. is preempted due to sports programming\nK E R B will resume streaming audio at the conclusion of the game\n[noise] the bans is Kay eat I'd be Los Angeles or dreaming audio at patriot donnelley's preemptive due to sports programming Katie id will resume streaming audio at the conclusion of the game basses case I'd be lost\n[noise] [noise] the\nBest is Kay eat I'd be Los Angeles and streaming audio and patriot dot L. A. is preempted due to sports program a K E R B will resume streaming audio at the conclusion of the game\nPasses K. E. I. B. Los Angeles streaming audio and patriot dot LA's preempted due to sports programming ... I'd be evil resumes streaming audio at the conclusion of the game the best is Katie id Los Angeles streaming audio and patriot dot L. A. preempted due to sports programming\nGeeky id will resume streaming audio at the conclusion of the game and the best is K. E. I. B. Los Angeles streaming audio patriot donnelley's preempted do the sports programming ... id will resume streaming audio at the conclusion of the game\nIn this case I be Los Angeles streaming audio expatriate dot LA's preempted due to sports programming\nTo eat I be evil resumes streaming audio at the conclusion of the game and the best is K. E. IP Los Angeles streaming audio and patriot dot L. A. is preempt into the sports programming kinky id will resume streaming audio at the conclusion of the game\nThis case I'd be Los Angeles and streaming audio at patriot dot LA's preempted due to sports programming\nK. E. R. I. Beagle resumes streaming audio is the conclusion of the game band is Kay eat I'd be Los Angeles streaming audio at patriot dot L. A. is preempted due to sports programming\nKiki id will resume streaming audio at the conclusion of the game and the best is K. E. I. B. Los Angeles streaming audio and patriot dot L. A. is preempted due to sports programming\nKiki id will resume and streaming audio at the conclusion of the game will [noise]\nBad is Kay eat I'd be in Los Angeles streaming audio patriot ... preemptive due to sports programming ... id evil resume streaming audio at the conclusion of the game\n... I'd be Los Angeles streaming audio and patriot dot LA's preempted due to sports programming GE id will resume streaming audio at the conclusion of the game\n... best\nIs Kay eat I'd be Los Angeles streaming audio at patriot dot L. A. is preempted due to sports programming Kiki id will resume streaming audio at the conclusion of the game in this case I'd be Los Angeles streaming audio and patriots LA's preempted due to sports programming\nFor GE id will resume streaming audio at the conclusion of the game\nIs is K. E. I. B. Los Angeles streaming audio at patriot dot LA's preemptive due to sports programming for GE id will resume streaming audio at the conclusion of the game\nBand is Katie I'd be in Los Angeles streaming audio and patriot dot L. A. preempted due to sports programming\nK E R B will resume streaming audio at the conclusion of the game passes ... I'd be Los Angeles and streaming audio and patriots LA's preempted due to sports programming kinky id will resume streaming audio at the conclusion of the game is ... I'd be Los Angeles\nStreaming audio patriot John LA's preempted due to sports programming Kiki I've evil resume streaming audio at the conclusion of the game\nAnd the\nBest is K. E. IP Los Angeles streaming audio and patriot John Elway is preempt into the sports programming kinky id evil resume streaming audio at the conclusion of the game\nThis K eat I be Los Angeles streaming audio and patriot dot L. a.'s preempted due to sports programming\nKatie id evil resume streaming audio at the conclusion of the game [noise] best is Kay eat I be Los Angeles streaming audio patriot dot L. A. is preempted due to sports programming\nKiki id will resume streaming audio at the conclusion of the game\n[noise] the best is Kay eat I'd be Los Angeles dreaming audio at patriot dot LA's preempted do the sports programming Katie id will resume streaming audio at the conclusion of the game will pass this case I'd be Los Angeles\nStreaming audio and patriot dot L. A. preempted due to sports programming\nKatie id evil resumes streaming audio with the conclusion of the game\nBasses may eat I be from Los Angeles streaming audio patriot jot LA's reinstitute a sports programming\nAnd Katie I've evil resumes streaming audio at the conclusion of the game best is Katie I'd be Los Angeles dreaming audio at patriot dot LA's preempted due to sports programming Katie id will resume streaming audio and the conclusion of the game\nFast is K. E. I. B. Los Angeles streaming audio patriot dot L. A. is preempted due to sports programming\nOr ... id will resume streaming audio at the conclusion of the game too fast is Kate I be Los Angeles and streaming audio patriot John LA's preempted due to sports programming K. E. R. I. V. will resume streaming audio at the conclusion of the game\nAnd his eyes be Los Angeles streaming audio at patriot data LA's preempted due to sports programming ... still streaming audio at the conclusion of the game\nAnd the best is K. E. I. B. Los Angeles streaming audio and patriot John Elway is preempted due to sports programming\n... evil resume streaming audio at the conclusion of the game and\nThen this lady I be Los Angeles streaming audio patriot dot L. A. preempted due to sports programming Kiki id will resume streaming audio at the conclusion of the game\n[noise] [noise] [noise] oh\nIs Katie I'd be Los Angeles dreaming audio patriot dot LA's preempted due to sports programming\nKatie id will resume streaming audio at the conclusion of the game ... I'd be in Los Angeles streaming audio and patriots dot L. A. is preempted due to sports programming K E R B will resume streaming audio at the conclusion of the game [noise]\nBest is K. E. R. I. B. Los Angeles\nI'm dreaming audio patriot dot L. A. preempted due to sports programming Kiki id will resume streaming audio at the conclusion of the game fast is ... I'd be in Los Angeles streaming audio at patriot data LA's preempted to to sports programming\n... id evil resumes streaming audio at different clues you know the game's best is Kay eat I be Los Angeles streaming audio at patriot dot L. A. is preemptive due to sports\nRamming K eat id will resume streaming audio at the conclusion of the game\nIn this case it I'd be Los Angeles streaming audio patriot dot L. A. is preemptive due to sports programming Katie id will resume streaming audio at the conclusion of the game\nThe\nBest is K. E. I'd be Los Angeles dreaming audio at patriot dot L. A. preemptive pseudo sports programming Katie id will resume streaming audio at the conclusion of the game or a bad this case I'd be Los Angeles\nStreaming audio patriot dot LA's preempted due to sports programming Kiki id will resume streaming audio the conclusion of the game ... ... fans is Kay eat I'd be Los Angeles streaming audio patriot ... freedom to do the sports programming\nKatie id will resume streaming audio at the conclusion of the game\nAnd the best\nIs Kay Ivey in Los Angeles streaming audio and patriot data LA's preemptive Judah sports programming\nTo eat I be evil resumes streaming audio at the conclusion of the game for best is Kay eat I'd be in Los Angeles streaming audio patriot dot L. A. is preempted do the sports programming geeky id will resume streaming audio at the conclusion of the game\nFast is K. E. I. B. Los Angeles streaming audio patriots dot L. A. is preempted due to sports programming shaky id will resume streaming audio at the conclusion of the game\nPasses K. E. icy Los Angeles streaming audio and patriot dot LA's preempted due to sports programming\nCan eat I mean will resume streaming audio at the conclusion of the game\n... says hey I'd be Los Angeles streaming audio at patriot dot allies preempted sports programming ... I'd be will resume streaming audio at the conclusion of the game\n... I'd be Los Angeles streaming audio patriot dot L. A. is reinstitute a sports programming ski I be evil resumes streaming audio at the conclusion of the game\nAnd\nFast is ... I'd be Los Angeles streaming audio and patriot data LA's preempted due to sports programming geeky I'd be will resume streaming audio at the conclusion of the game", "year": "2018", "show_name": "The Dave Ramsey Show", "city": "Los Angeles", "day": "27"}