{"month": "10", "state": "CA", "station": "KEIB", "content": "Five Fifteen or twenty miles split the worst tropic of the nation\nIt's up to two lane road it's a beautiful view but you get to enjoy the view yeah\nRight or the neighborhood is not you know you might not necessarily want to raise your kids are\nRight right okay so there is some options along those lines um then I you know there's not a magic answer to it what I don't want you to do and that's why I started the answer the way I started to what I don't want them to do is just give yourself permission to do something that's harmful to you\nJust because it just because it's expensive and you throw up your hands go well just the way it is and the rams he just doesn't understand was not me it's math math still a problem when your house payment is sixty percent of your take home pay because real estate's expensive\nYou're going to go bankrupt I mean you're not going to make it your kids aren't going to college are going to struggle financially you're gonna struggle you can't keep that from happening and so you've got to you gotta you gotta bite the bullet into a neighborhood you don't love a commute you don't love or make some other arrangements um\nOr honestly truthfully what happens is a huge Silicon Valley as an example of just reading an article about the other day the number of people that have left\nIs absolutely amazing 'cause they just yeah and then they're having the bus they're bussing service workers in\nBecause they can't afford to live there all by some in and you know some of the ski resorts face the same thing they build housing for the workers because it's the only way they can get somebody to stay there because you can't afford to live in Aspen\nAnd work in Aspen as a as a ... you know as a ski patrol guide right you can't afford to expand right and so it's the same kind of an economic issue on these micro economic economic situations but you know you cannot it's almost impossible to live on the island of Manhattan and make less than a hundred grand\nYou're right it's just ... very tough and so you end up cross in one of the bridges I'm ... and living out in one of the other boroughs um in in order to get your costs down enough to actually survive and live your dream of being there\nSo I'm hopefully you can find a way to you know mix in the neighborhood idea and the commute idea\nEnough to get a value that works what do you do for a living\nAnd I am a firefighter okay well as a part time I'm a flight attendant\nOkay cool and are you married yeah what's your wife do\nRight now she pretty much stays at home with the\nKids how many kids I'm too We're two under two oh fun and what's your household into\nYeah I'm about five thousand a month\nTake home on average a ton of fluctuates on my part time job kind of fluctuate depending on how much are yeah worker\nAs soon as low for a fire fighter have you got a lot of stuff coming out of your check\n'em on a really it's about I think my deductions about thirty percent below\n... I mean do you have other junk like insurance or something coming out of your check\nUm\nNo I don't know I think well water is a major city and so I'm just as long as you're not exactly in a rural environment here so I was just guessing I didn't know right uh I I rented a firefighter make a hundred all over the place so I'm\nAll yeah not at all in their heart out to be a\nA captain ... which is a\nYeah most of the way for me to be yeah\nAll right uh and are you are you in are you doing three days on for all for that kind of a routine\nYeah three days every other day and then for yeah you know I might instead of being a flight attendant I might look at a part time a business on the side you might make more than that that on the flight attendants stuff\nLotta firefighter guys I Know have great side hustles so that they make almost as much as they do with fire hall\nAnd they're really fabulous they get in the construction business the painting business or something like that and they make really seriously good money\nBut hey man I'll I'll Try to help you cannot put you guys in the financial picture virtually the one year memberships that includes the nine lessons or the clash hold on I'll have Kelly pick up all of sudden that tell you it's great to talk to you I Wish I had a magic wand to make this work\nFor you but it's a toss up answer what it is thanks for calling him that puts us\nRamsey show in the bucks we'll be back with you before you know what in the meantime there's ultimately only one way financial peace and that's the walk daily with the prince of peace Christ Jesus guys\nFrom the production officer for the ... show this hour you'll find more on our YouTube channel where we have over six million you to use each month\nCan find Danbury screams millionaire our slim de France is so much more go check it out\nIf you're a business owner I Need you to listen up did you know that more than half of teens today associate stress and worry with money half\nAnd young adults are entering the workforce with no idea how money works that's not okay what if I told you your business could be known as the business making a direct impact on your community well it can\nOur Ramsey education team worked with businesses like yours\nTo provide life changing curriculum to high school and middle school students in your local community\nMore than forty percent of high schools across the country have used our foundations and personal finance curriculum many more want to but they often don't have the funds so by joining forces with us and sponsoring a school in your community you're making a difference in these students' lives\nTo learn how we can partner together visit Ramsey education dot com slash sponsor Ramsey education dot com slash sponsor\nK. E. A. B. Los Angeles this is the Patriot am eleven fifty broadcasting throughout the south land and all over the world I heart radio [noise]\nI'm White House ceremony I least sound like Sarah Fox news his work at the high court it's already be gone that President Trump held a ceremony at the White House we Supreme Court justice Brett Kavanaugh Dr Steve rapper boy has more live\n[noise]\nIs K. E. I. B. Los Angeles streaming audio patriot dot LA's preempted due to sports programming\n... I'd be evil resumes streaming audio at the conclusion of the game best is Kay eat I'd be in Los Angeles streaming audio and patriots dot LA's reinstitute a sports programming and eat I mean will resume streaming audio at the conclusion of the game\n... I'd be Los Angeles\nI'm streaming audio patriot dot alleging preempted due to for its programming\nAnd Kiki id will resume streaming audio and the conclusion of the game\nFor fast is ... I'd be in Los Angeles streaming audio patriot donnelley's preempted due to sports programming\n... id evil resumes streaming audio at the conclusion of the game in this case I'd be in Los Angeles streaming audio at patriot dot LA's preemptive due to sports programming\n... id will resume streaming audio at the conclusion of the game\nIs Kay eat I'd be Los Angeles streaming audio patriot ... preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game the best is K. E. I'd be Los Angeles\nAnd streaming audio at patriot dot LA's preempted due to sports programming\nAnd Katie id will resume streaming audio at the conclusion of the game for the best is Kay eat I'd be Los Angeles streaming audio patriot dot L. A. for him to do the sports programming\nKiki id will resume streaming audio with the conclusion of the game ... ... fans is Kay eat I'd be Los Angeles and streaming audio patriot dot LA's freedom to do the sports programming\nKiki id will resume streaming audio into conclusion of the game [noise]\nBest is Kay Ivey Los Angeles streaming audio and patriot dot L. A. is preempted due to force programming Katie IBM evil resumes streaming audio at the conclusion of the game for best this case the eyepiece Los Angeles\nStreaming audio patriot dot LA's preemptive due to sports programming\nKatie id will resume streaming audio at the conclusion of the game\nIs ... I'd be Los Angeles dreaming audio patriot dot L. A. preempted due to sports programming geeky id will resume streaming audio at the conclusion of the game\nPasses K. E. I. V. Los Angeles streaming audio patriot dot L. A. is preempted due to sports programming can't eat I be evil resumes streaming audio at the conclusion of the game\nMasses K. E. I. B. Los Angeles streaming audio patriot dot L. A. is preempted sports programming ... I'd be will resume streaming audio at the conclusion of the game\n... I'd be Los Angeles streaming audio patriot dot LA's reinstitute a sports programming kinky I'd be evil resumes streaming audio at the conclusion of the game and the group and\nThis is ... I'd be Los Angeles streaming audio and patriots dot L. A. preempted do the sports programming geeky I'd be evil resumes streaming audio at the conclusion of the game and passes K. E. I. B.\nLos Angeles streaming audio at patriot not LA's preempted do the sports programming\nKiki id evil resumes streaming audio at the conclusion of the games [noise] basses K. E. I. B. Los Angeles streaming audio patriot dot L. A. is preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game [noise]\n[noise] [noise] the\nBest is Kay eat I be Los Angeles and streaming audio and patriot dot alleging preempted due to sports programming ... I'd be will resume streaming audio at the conclusion of the game\nPasses ... I'd be Los Angeles streaming audio and patriot dot L. A. is preempted do the sports programming and Katie id will resume streaming audio at the conclusion of the game the best is Katie id Los Angeles streaming audio and patriot dot LA's preempted due to sports programming\nKiki id will resume streaming audio at the conclusion of the game\nAnd the best is Katie I'd be Los Angeles streaming audio patriot Donna LA's preempted due to sports programming ... id will resume streaming audio at the conclusion of the game\nPasses K. E. I. B. Los Angeles streaming audio patriot dot LA's preempt into the sports programming\nEat I'd be evil resumes streaming audio at the conclusion of the game the best is K. E. IP Los Angeles streaming audio and patriot dot L. A. is preempt into the sports programming kinky id evil resume streaming audio at the conclusion of the game\nIn this case I'd be Los Angeles\nStreaming audio patriot dot LA's preempted due to sports programming K. E. R. I. Beagle resumes streaming audio is the conclusion of the game [noise] bad is Kay eat I'd be Los Angeles and streaming audio at patriot dot LA's preempted due to sports programming\nKatie id will resume streaming audio at the conclusion of the game and the best is K. E. I. B. Los Angeles\nStreaming audio and patriot dot alleging preempted do the sports programming Kiki id will resume and streaming audio at the conclusion of the game will [noise]\nFast is Kay eat I'd be in Los Angeles streaming audio at patriot donnelley's preemptive due to sports programming ... id evil resumes streaming audio at the conclusion of the game\nIs ... I'd be Los Angeles streaming audio patriot dot L. A. is preempted do the sports programming GE id will resume streaming audio at the conclusion of the game\nBest\nIs Kay eat I'd be Los Angeles streaming audio patriot dot L. A. is preempted due to sports programming Kiki id will resume streaming audio at the conclusion of the game in this case I'd be Los Angeles streaming audio patriots LA's preempted due to sports programming\n... id will resume streaming audio is the conclusion of the game\nIs is K. E. I. B. sauce Angeles streaming audio at patriot dot LA's preemptive due to sports programming for GE id will resume streaming audio at the conclusion of the game\nBand is Katie I'd be in Los Angeles streaming audio and patriot dot L. A. preempted due to sports programming\nK E R B will resume streaming audio at the conclusion of the game passes K. E. R. I. B. Los Angeles dreaming audio and patriots LA's preempted due to sports programming kinky id will resume streaming audio at the conclusion of the game\nIs ... I'd be Los Angeles streaming audio patriot John LA's preempted due to sports programming\nGE I've evil resume streaming audio at the conclusion of the game\nAnd the\nBest is K. E. IP Los Angeles streaming audio and patriot data LA's preempt into the sports programming kinky id evil resume streaming audio at the conclusion of the game\nIs Kay eat I be Los Angeles streaming audio patriot dot L. A. is preempted due to sports programming\nKatie I've evil resume streaming audio at the conclusion of the game [noise] best is Kate I be Los Angeles streaming audio patriot dot L. A. is preempted due to sports programming\nKiki id will resume streaming audio at the conclusion of the game\n[noise] [noise] [noise] ... I'd be Los Angeles are streaming audio at patriot donnelley's preemptive due to sports programming Katie id will resume streaming audio at the conclusion of the game a little bit this case I'd be Los Angeles\nStreaming audio and patriot dot LA's preempted due to sports programming Katie id will resume streaming audio is the conclusion of the game\nBasses may eat I be involved in July streaming audio patriot John LA's reinstitute a sports programming and can't eat ice evil resumes streaming audio at the conclusion of the game bans is Katie I'd be Los Angeles\nDreaming audio patriot dot L. A. is preempted due to sports programming Kiki id will resume streaming audio and the conclusion of the game\nFast is K. E. I. B. Los Angeles streaming audio patriot LA's preempted due to sports programming\n... id will resume streaming audio at the conclusion of the game the fast is Kate I be Los Angeles streaming audio patriot John LA's preempted due to sports programming K. E. R. I. V. evil resumes streaming audio at the conclusion of the game\nAnd in this case I'd be Los Angeles streaming audio patriot dot LA's preempted due to sports programming\n... will resume streaming audio at the conclusion of the game and the best is ... I'd be Los Angeles streaming audio and patriot John LA's preempted due to sports programming\n... will resume streaming audio at the conclusion of the game and the best is K. E. I. B. Los Angeles streaming audio and patriot John LA's preempted due to sports programming\n... be evil resume streaming audio at the conclusion of the game and\nThen this ... I'd be Los Angeles streaming audio patriot dot LA's preempted Judah sports programming Katie id will resume streaming audio at the conclusion of the game\n[noise]\nBans is K. E. I. B. Los Angeles dreaming audio patriot dot LA's preempted due to sports programming\nK E R B will resume streaming audio at the conclusion of the game best is Kate I'd be in Los Angeles streaming audio and patriots dot LA's reinstitute a sports programming K E R B evil resumes streaming audio at the conclusion of the game\n... best is K. E. R. I. B. Los Angeles\nI'm streaming audio patriot dot L. A. is preempted due to sports programming Katie id will resume streaming audio and the conclusion of the game for fans is ... I'd be in Los Angeles streaming audio patriot dot L. A. preemptive to the sports programming\nKatie id will resume streaming audio at different clues you know if the game's best is Kay eat I'd be in Los Angeles streaming audio at patriot Donna LA's preemptive due to sports programming\nCake eat id will resume streaming audio at the conclusion of the game\nIn this case it I'd be Los Angeles streaming audio patriot dot allies preempted due to forge programming Katie id will resume streaming audio at the conclusion of the game\n\nBest is K. E. I. B. Los Angeles dreaming audio at patriot dot LA's preempted due to sports programming\nKatie id will resume streaming audio at the conclusion of the game and best his case I'd be Los Angeles streaming audio patriot dot L. A. preempted do the sports programming K E R B will resume streaming audio is the conclusion of the game\n... fans is Kay eat I'd be Los Angeles and streaming audio at patriot dot L. A. is freedom to do the sports programming\nKiki id will resume streaming audio at the conclusion of the game\n[noise] basses\nK. E. I. B. and Los Angeles streaming audio patriot dot LA's preempted due to sports programming\nShaky id will resume streaming audio at the conclusion of the game for best is Kay eat I'd be in Los Angeles streaming audio patriot LA's preemptive due to sports programming Katie id will resume streaming audio at the conclusion of the game\nFast is Katie I'd be Los Angeles streaming audio patriots donnelley's preempted due to sports programming geeky id will resume streaming audio at the conclusion of the game\nPasses K. E. I. V. Los Angeles streaming audio at patriot dot LA's preemptive due to sports programming can't eat id will resume streaming audio at the conclusion of the game\n... I'd be Los Angeles streaming audio at patriot dot LA's preempted Duda sports programming ... I'd be will resume streaming audio at the conclusion of the game\n... I'd be Los Angeles streaming audio patriot dot L. A. is reinstitute a sports programming ski I'd be evil resumes streaming audio at the conclusion of the game and\n[noise]\nThis is Kate I be Los Angeles is streaming audio and patriot dot LA's preempted do the sports programming geeky IBM evil resumes streaming audio at the conclusion of the game and the best is K. E. I. B.\nLos Angeles streaming audio patriot LA's preempted do the sports programming\nKiki id evil resume streaming audio is the conclusion of the game [noise] basses K. E. I'd be Los Angeles streaming audio at patriot dot LA's preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game [noise]\n[noise] [noise] the\nBest is Kate I'd be Los Angeles and streaming audio and patriot dot L. A. is preempted due to sports programming to the gate E R B will resume streaming audio at the conclusion of the game\nFast is K. E. I. B. Los Angeles streaming audio and patriot dot LA's preempted due to sports programming ... I'd be evil resumes streaming audio at the conclusion of the game the best is Katie id Los Angeles streaming audio and patriot dot L. A. preempted due to sports programming\nK E R B will resume streaming audio at the conclusion of the game in this case I'd be Los Angeles streaming audio patriot donnelley's preempted due to sports programming ... id will resume streaming audio at the conclusion of the game [noise]\nPasses K. E. I. B. Los Angeles streaming audio at patriot dot LA's preempted due to sports programming\nEat I be evil resumes streaming audio at the conclusion of the game and the best is K. E. I. V. Los Angeles streaming audio and patriot dot L. A. is preempt into the sports programming kinky id evil resumes streaming audio at the conclusion of the game in\nThis case I'd be Los Angeles\nStreaming audio at patriot dot LA's preempted due to sports programming GE I Beagle resumes streaming audio is the conclusion of the game\n[noise] best is Kay eat I'd be Los Angeles and dreaming audio at patriot dot L. A. is preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game and\nThe\nBest is K. E. I. B. Los Angeles streaming audio and patriot dot LA's preempted tutor sports programming K E R B will resume streaming audio at the conclusion of the game will [noise]\nFast is Kay eat I'd be in Los Angeles streaming audio patriot ... preemptive due to sports programming ... id evil resume streaming audio at the conclusion of the game\nIs ... I'd be Los Angeles streaming audio and patriot dot LA's preempted due to sports programming GE id will resume streaming audio at the conclusion of the game\n...\nIs Kay eat I'd be Los Angeles streaming audio ex patriot dot LA's preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game in this case I'd be Los Angeles streaming audio at patriots LA's preempted due to sports program\nI mean she eat id will resume streaming audio at the conclusion of the game is is K. E. I'd be Los Angeles streaming audio patriot dot L. A. is preemptive due to sports programming ... id will resume streaming audio at the conclusion of the game\nAnd band is Katie I'd be in Los Angeles and streaming audio and patriot dot LA's preempted do this for the program a\nK E R B will resume streaming audio and the conclusion of the game fast is Kay eat I'd be Los Angeles has remained audio and patriots LA's preempted sports programming kinky id will resume streaming audio at the conclusion of the games\nThe best is K. E. I'd be Los Angeles dreaming audio patriot John LA's preempted due to sports programming\nK. E. I. V. evil resumes streaming audio at the conclusion of the game\nAnd the\nBest is K. E. IP Los Angeles streaming audio at patriot dot L. A. is preempted due to sports programming kinky id will resume streaming audio at the conclusion of the game in\nThis case eat I be Los Angeles streaming audio and patriot dot L. A. is preempted due to sports programming\n... I'd be evil resume streaming audio at the conclusion of the game all [noise] best is Kate I be Los Angeles streaming audio patriot dot LA's preempted due to sports programming\nKatie id will resume streaming audio at the conclusion of the game\nThe\nMan is K. E. I. B. Los Angeles or dreaming audio at patriot dot L. A. is preemptive due to sports programming Katie id will resume streaming audio at the conclusion of the game will best is Kay eat I'd be Los Angeles\nStreaming audio and patriot dot LA's preempted due to sports programming ... id evil resumes streaming audio is the conclusion of the game\nBasses may eat I be in Los Angeles streaming audio patriot data LA's freedom to do the sports programming K. E. I. V. will resume streaming audio at the conclusion of the game band is K. E. R. I. B. Los Angeles\nStreaming audio patriot dot L. A. is preempted due to sports programming K E R B will resume streaming audio into conclusion of the game best is K. E. I. B. Los Angeles streaming audio ex patriot data LA's preempted due to sports programming\nAnd uh they deserved to because look what they've done of the country look at what the hell they want to double down on investigation and lie still say and do anything for power but they don't have an agenda that's going to benefit anybody but themselves\nA Julianna is next North Carolina Julie on uh how are you glad you called\nVery well thank you so much for taking my call Sean\nYep thank you thank you for calling thanks for being out there hope you're voting in twenty eight days\nAbsolutely I Am and I just honestly want to say thank you sound like I watch a show my family watching your cell nightly I listen to your show on the radio daily and I my family twenty six year old woman I Am just cost and\nThe way that the Democrats handled that Brett Kavanaugh situation at that time you get the right just isn't the answer to the right thing\nWell I think we have I agree I Will tell you that this was a big fight it was say it's sad that it came down to the wire and one vote the way it did it's sad that this man's family had been through everything it's sad that allegation deserve\nAnd accusations are accepted as truth for people you know we live in a very dangerous time where you could just make any allegation against anybody and people run with it and they think you're you are I Believe it I Believe guilt by accusation\nYou don't even get a chance to defend yourself at all\nLack of due process like ridiculous on us alive or a physical ... myself and electric outrageous I lift hysterical crying during that entire hearing and Lindsey Graham that it that that I was so proud of and it was great the way he set up\nYeah he really had his moment I'll tell you if it wasn't but Lindsey Graham and Susan Collins so I think gave the speech of our life in the Senate\nToday we come to the conclusion of the confirmation process\nThat has become so dysfunctional it looks more like a caricature I think I got her level political campaign than a solemn occasion\nThat ... percent do not me that her pet sir for what's not sexually assaulted that night for it some other time\nBut they do lead me clues that the allegation fails to me the more likely than not standard\nThere for I Do not believe that the charges Ken hair really heard bad\nJudge cap enough credit surfing on the court Mr President I Will vote chicken for Chad's cat and\nI don't think I don't think Brett Kavanaugh would have made it and I think what I loved about what Susan Collins did is how independently and methodically she went through every detail of how she was voting the way she was\nVoting exactly yup they did it go that way on ... well I'm Sorry you've been through abused too by the way I listened I Know too many people to see people that have suffered greatly at the hands of these corrupt evil individuals and I'm going to tell you something\nUm it is evil if you abuse anybody in any way shape or form you deserve the full force of the law to come down upon you and I'm a it's terrible but hang in there okay that\nIt was disgusting thank you so much John I appreciate it\nAll right thank you and I so I didn't think my friends of my pillow would ever be able to outdo themselves or they've created the my pillow mattress copper and what you do is you put it on top of your mattress\nAnd it's like you're floating on the air and yes it helps you sleep better it is the greatest invention I've ever had on top of my pillow itself\nNow it has three layer designed one is my pillow phone for their support transitional form to help relieve pressure points and also the ultra saw patented temperature regulating cover you lay on the show like wow I don't want to move I Want to sleep\nAnyway comes with a ten year warranty you're going to love my pillows top or ... it comes to the ten year warranty is washable dry Abul made in the usa backed by Mike sixty they unconditional money back guarantee and right now because you listen to the show you're going to say thirty percent\nIt's going to change your life just use the ... when you go to my pillow dot com you say thirty percent hall eight hundred nine one nine six zero nine zero now Mike is also going to throw into standard my pillows absolutely free\nNow when you add the mattress topper to the pillows it's habit my pillow dot com eight hundred nine one nine six zero nine zero promo called Hannity [noise]\nLaunched a silence sanity don't let it happen snake but now three hours every day three PM this Sean Hannity show\n\nDoes your dog itch scratch stinkers shed like crazy come to die to buy for help order Ninety Days supply of dynamite pick up two bottles of liquor jobs get the third bottle free new improved liquor chops with the mega six omega three vitamin E. and now it's six extra direct fed microbial\nEven better for the digestive tract and immune system and dogs ... try and look what jobs by to get one free this is Lucas subject for die to bike\nAnd our\nHigh mushroom all can hear the gods now movie opens on October twelve dean Cain and the entire cast was her job bringing this to during the big screen\nThe woman goes into a recording comes on down and there's no police report\nYou might be very into movies too scary it's not the mother of two I promise you can bring your teenage children to bring friends and family we have a unique opportunity to change hearts and minds about abortion Cormac\nGossip mill is perhaps the most prolific ... in American history goes no really read you a thirty\nMinute this is the Patriot am eleven fifty and\n\n\n[laughter] my twenty eight\nDays or weeks from the Knight the biggest election mid term in our lifetime well full coverage tonight and the latest on the deep state we've got Sarah Carter Greg Jared John Solomon Victoria Toensing dampen Gino Sebastian Gorka\nAnd she had a diet and Monica news you won't get elsewhere yeah it all starts with Hillary and guess what all these people in the FBI knew and they yeah they were talking about their little soft coup tonight at nine Hannity Fox News [noise]\n[noise]\n\nHey I'm Brandt so there's this guy didn't Jordan he's a healthy guy he's a dad of six and he works as a guide in Alaska and he goes to the doctor a true story goes to the doctor and he's diagnosed with cancer stage four\nUm booster because you've proven you're worth that over more than a fluke or you did it over a long period of time so we know that you have to\nUm [noise]\nUnbelievable world class skills one age driven in depth knowledge of luxury motor homes and uh how they work and what makes them tick and how you can help somebody in a situation and so on there okay that is a very narrow set of a skills\nIt really has only one application in your city and you lost that job okay the second thing we know is is that you know how to sell large ticket items to wealthy people\nAnd you're very good at it\nAnd so were you for instance to sell 'em\nAshton Martin ... or ...\nYou would be in a similar market and ... the downside is you don't know much about how they work you've never worked on them\nBecause of the curve would be but you know how to communicate serve closed the sale handle the service after the sale how a high end luxury buyer wants to be treated and needs to be treated in order to create repeat business you are an expert in that\nAnd I think that set of skills can be applied in other places would you agree got her I don't care if you're selling a hundred thousand dollar watches if you want to do that that's fine I put so I just came I went to something what wheels on it because you had some wheels in a motor before so you're mechanically inclined\nAs well so maybe that's it but you know I talked to a guy the other day is selling the crowd out of high and cars and he used to be in the um recruiting business she used to sell a you know recruit people for jobs\nAnd it's just similar skill set because we were dealing with high on the executive placement and then he's dealing with a executive placement into cars and it it's the same set of people you're dealing with this thing they think the same way you know how to keep that kind of person moving unhappy\nAnd I think if you think if you broaden that out that white if you're if you're back off your pan out with your camera angle you'll see that and I think you're going to be fine so I wouldn't panic I'm\nThe only other thing I could think of is if you can't kind of some kind of brokerage situation where you're brokering high end luxury RVs um for two hundred and fifty grand you can fly in and out of a city every so often and make a deal happened\nAnd so I mean you could go straight to manufacture or to a dealer of the same brand fired you but as in a much larger metropolitan area and sell to people\nAll over the nation and hand hold their hands in the process where the broker process I'm done I'm not sure where the leads come from not sure how that deal happens but when you're dealing with sometimes two or three hundred thousand dollars airplane tickets are cheap\nAnd that makes that deal happened can't do that when you make and thirty five thousand but in your situation you there's a lot of stuff you can do um [noise] I mean you could be gone one night a week and jump around and really close some big deals you could sell a jets private jets\nThat's another thing that would fit perfectly in your scenario um and the job market's pretty hot right now because the economy's booming\nCouldn't give a jet away two years ago and now you can't find one show um it you know that's another place you that you think of a luxury mechanical element that's all I'm doing I'm just brainstorming out loud here I think you've got a lot of potential it may take you six months to land in the right seat\nAnd but you got plenty of money you're All right you don't have budget watch what you're doing I don't know if you're spending come up um but don't don't do something dumb and\nIt's a tenth of what used to make and call that okay and don't say that was your passion either because I'll smack you\nThis is the Dave Ramsey show [noise]\nI Know it's back to school season but that doesn't mean you have to stress out about what's for dinner for almost ten years I've been telling you about my friends that he meals who make meal planning and shopping virtually stress free\nYou can even have your groceries gathered for pickup over delivery right from the emails that it's the smartest way to save money every month and you'll be a hero is your family eats delicious held dinners to gather sign up for a free\nTwo week trial today at emails dot com\nThat's easy meals Dodd Tom\nMoney fight we them and unfortunately\nThere when the leading causes of divorce in America today this is number one New York times best selling author Rachel created and are fast paced culture and ...\nSometimes are marriages take a backseat suddenly we look up and realize it's been a while since we've focused attention on another important parts and our spouse why not dedicate a finite to learn more about each other small joint docking last night at many a narrative that definitely gave anti cancer is there is deep today\nGet a lot of calls from listeners not knowing what to do with their timeshare\nI don't care if the reason you want out is because you were duped\nYou can't afford it you inherited it the smart thing to do is just get rid of it they're horrible they never live up to the expectations the resorts\nSat and the only way you're going to exit you're timeshare safely legally and forever is with time share ... team they have offices all around the country where you can sit down face to face and review your contract to find a solution they've accepted thousands\nOf timeshare owners this year alone\nThey're the best in the business because they simply add more options for exit than anyone else it could be a long process but there with you every step of the way in timeshare exit team is so confident in their exit service that if they don't get you out you get a full refund called eight for four nights\nNine nine ... and schedule a free consultation eight for for nine nine nine or ... or timeshare exit team dot com\nWe predicted that the Democrats wouldn't be satisfied with what they asked for they ask for an additional week of FBI investigations they got it immediately after getting a base that we wouldn't be long enough\nThey don't we predicted the what everybody comes back and change the Democrats are going to say it's tainted because they didn't do a sound when investigators should everything that we predicted is coming to pass on the Democratic side\nLimbaugh tomorrow morning at nine on the patriots am eleven fifty\nNow traffic on the patriots ma'am I'm loving it do\nWe do have a crash working right now to the mid city area there any sound before ... boulevard look out for a wreck they're blocking the two lanes right now they're trying to get back to Robert ... boulevard traffic is sponsored by the California earthquake authority nine days\nTill the great California shakeout to survive and recovered from the next damaging earthquake will join ... through the world on October\n... dean am registered earthquake ... dot com slash shakeout ... by the California earthquake authority you are listening to the patriots am eleven fifty fifty\nAnd calm and part of it is you know and I never graduated but I was thinking about cash flowing wrecked my degree and going back at all and I would start as a team and I have\nBut you need the money you're in the military are trying to buy a home and you need the money and you don't need to be like you got you did not set out to own rental property everywhere these rental properties by default was not you're not you're five your strategy to buy rental properties all over the United states\n\nSo that the connection that I've been getting from a couple of folks that have been talking to my my only hesitancy though is that they they ... had renters that have been paying the mortgage and um it seems like there there's the possibility of it are you going up\nAnd I'm about to go up but I'm also sure somebody's gonna change their hardly or when you're living room good you're out of town [noise] this is going to happen I I I've got rental properties my I got a bunch of them I'm I'm rental property for forty years\nAnd um you've got to be I I just don't do any longer says landlord it I don't have any property that I ran out that is not in my town\nAnd you did not ... not buy the property spot plan you ended up with them and you're trying to move on to the next phase of your life which is home ownership you are long distance landlord and you don't even own your own heart I personally was so both of them are meeting when you do what you want to but that's what I thanks for the call [noise]\nThis is the day Ramsey sure\nI get this question all the time they wouldn't it be smarter for me to sell my house myself the answer is really simple\nThe typical for sale by own our home sales for one hundred and Ninety thousand dollars for the typical home sold by an agent is two hundred and forty nine thousand dollars I'll do the math for you that's fifty nine thousand dollar difference so here's the secret to making more\nMoney selling your home you need a high octane rockstar real estate agent you need one of our real estate endorsed local providers these folks are the top ten\nPercent of agents in your area best of all you can trust in the ... to give you the same helpful advice you to hear from me why because the yuppies are vetted\nBy our team and practice what we teach they will create a plan to market your home do as many buyers as possible they only been work with you to make sure your home gives a great first impression if you're planning to show your home don't do it alone\nFind our top agents in your area today Dave Ramsey dot com slash EL pay\nWhat are you mad after all of this brouhaha after all the banks after all the character and the life assassination of Democrats tried on gambling on what are you back to the lord and would have turned out that way the same regardless what the Democrats dead than\nDemocrats didn't weigh one vote\nLush Limbaugh tomorrow morning at nine on the patriots am eleven fifty [noise]\n\nI'm rich Dennison hurricane Michael's no a category ... storm with winds of one hundred twenty miles an hour as it approaches the Gulf Coast ... says region getting strict damaging winds heavy rain deadly storm surge and power outages\nTime to prepare is now a please we want to re emphasize or to eat those local warnings as they know best for our citizens that are visitors or Florida Gulf Coast\nLandfall is expected around lunchtime tomorrow along the Florida Panhandle US ambassador to the U.N Nikki Haley announcing her resignation from the Trump Administration today the former South Carolina Governor says she's happy with the work she's done over the past two years body it's time to move on\nTo us as strong again and you're up you're drawing in a way that she makes all American very proud residents\nTrump says he has a number of people under consideration and it leaves replacement will be announced\nIn the coming weeks this Fox News\nMind Clinton\nNow traffic on the Patriot am eleven fifty\nGood afternoon when the crash working in mid city area the ... boulevard this ... right now that's an east on his stacked up from Robertson Boulevard\nTraffic is sponsored by in and out burger and there's no room for compromise when you're making quality French fries and that's like in and out uses with a sinus whole potatoes available ... and then cooked\nFresh right when you order them that's quality you can taste you are listening to the patriots and London fifty tonight you're listening to the patriots am eleven fifty\n\n\n\n\nWith us in Joplin, Missouri I see on my screen your debt free congratulations okay very cool how much will be paid off\nThirty five thousand dollars\nHow long did this take about twelve not good for you and your range of income during that time\nI think the ... a thousand cool what are you all do for a living\nI Am a middle school teacher\nAnd I delivered medical\nCool and what kind of that was the thirty five thousand\nIt when he didn't loan\nAll of it yes you kicked all ugly Sallie Mae out usually on law the kicker another car\n[laughter] she's gone well done well done so what happened twelve months ago they put you guys on his journey\nWell they've and goes a little bit farther back then that ... dollars in aid ah we went through financial piece that are stronger and we actually had about eighty thousand dollars and that at that time and we never attitude that since then but we never really got intense not getting rid of it\nSo you know ... I'm Sorry you took the clash ten years ago and flunked it\nWe didn't know okay\nWe did during the last time I think that we had enough that we paid off their remaining very I thought OK\nOkay she knew what to do but you're just reached a point you got okay we got to knock this out now exactly sure what what caused that final conversation four months ago\nHe there we were making too much to be in a situation that we are in\nOkay show whose idea was issued who said we're going to turn up the heat you or town it was mine [laughter] okay so temp she walks in and goes hey whereabouts all of a sudden get serious what'd you say\nOh God that sounds like a great idea to do and I think it it kind of click to that point I think one of the bring it up and she brought it up and we went out to\nCool what do you tell people the key to getting out of\nDebt is a thing you do get a thing commitments focusing on the go and have a commitment to do whatever it takes to get rid of that are\nGood for you gosh well dawn housing feel great very finely there don't you wish you'd done at five years ago\nOh exactly that's the hardest part of the whole thing is nine we cut down a long time ago\nAmazing amazing oh very cool good for ya\nWell done we got a copy of course ... book for you retire inspired\nThat's the next chapter in your story to be millionaires and are outrageously generous as you go alone or well done you two very proud of you Jim and Daphne Joplin, Missouri thirty five thousand dollars paid off in twelve months making sixty or Seventy do\nCounted downloads zero debt free scream\nVery\nWell\nUm is to say what they have done in the past\nOver a long period of time is likely to be what they will do in the future over a long period of time plus or minus\nWonderful and tragic events\nOkay guy which we can't predict those so if the economy booms in other words you can't predict that exactly\nIf the economy tanks you can't predict that exactly if somebody fires missile at us and it changes the economy you can't predict somebody's last a couple of airplanes into a couple of towers you can't predict that but it will affect the economy so\nWhat we have to just give our best shot on that but the old saying you've hurt you know a past our results are not indicative of future returns horse crap but\nOf course they are otherwise you would buy and they buy a house in a ... crummy neighborhoods instead of a good neighborhood right yeah and so what we have here is what's known as a crummy neighborhood\n[laughter] gold as as not got a good track record long term as a matter of fact it sucks as an investment over a long period of time and so what's this gold and silver worth today if you catch it all in\nAround a hundred thousand so if we call a hundred thousand dollars in the military but would you buy gold and silver coins with it no no [laughter] okay for the same reason that you wouldn't buy them again you would sell them today\nNow let's decide what we're going to be a hundred thousand oh you'd like to pay down the mortgage sure I'll go with that but they're ... they're separate decisions do you see what I'm saying\nKind of and to me that confusion as Matt I don't need the gold and silver like we can just plod along paying our mortgage and they'd gotten three and a half years\nNo no no no no it's not about the most [laughter] it's not about the only one more time hundred thousand dollars cash hundred dollar bills laying in the middle of your kitchen table uh-huh are you going to buy gold with it I don't need that money but are we going to buy gold with it\nYou know\nIf you keep this by tomorrow it's like you bought it again do you understand that mathematically yeah making the decision to keep it as the same as making the decision to buy it\nI could tell other people that when it comes to things like I'm OK Byron come that far away ... capital markets like they have no other implication like sitting there okay\nYou know it does have an implication forget the mortgage\nMortgage can't pretend like we were going to go to Disneyland but the money I don't I don't care what we're doing the money the point is the way you properly analyze whether to keep this goal is to say I have a hundred thousand dollar sitting in the middle of the table would I buy gold with it\n[noise] heck [laughter]\nAnd if you keep it tomorrow you bought it again and if you keep it the next day you bought it again\nEvery game keep something it's as if you made the decision to purchase it again for its current market value\nAnd there's nothing wrong with that as long as you don't mind buying it so let me give you an example if you if you and I both thought or if you thought gold was going to double in the next year and you had evidence to make you actually believe that\nYeah we were going to turn a hundred thousand two hundred thousand and one year and you all and you and I both believe that are just you believe that and we had a hundred thousand dollars cash sitting in the middle of the table and I said would you buy goldie Hawn crappy ass 'cause I could turn a hundred and the two hundred\nRight yeah but we're making the decision then not based on what we paid for it or making the decision based on what we think it's going to do in the future okay the\nDecision to buy or sell or hold theirs is based on the future not the past other than we use the past to project our future but even when we do that with gold it tells us to sell\nYeah ... satellite take your last take your lumps you might have dumb investment you lost a bunch of money that stupid tax now you've got a pile of money in the military but what do you want to do with that money well modeled path mortgage what the heck\nOkay different stations are two different decisions are two different buckets to do proper proper critical thinking on this Jonah is in Dallas texas Hi Joan how're you\nHey there how are you better than I deserve what's up\nI'm I'm a college student uh I have about ...\nBetween eight and ten thousand dollars a year that is coming in that I don't have anything to get paid for with how are you making for having um a merit scholarship so that I get a bunch of extra money\nOkay good for you very cool man for a merit based based on what your your grades or your citizenship or what\nUm my national merit pets I I'm an actor Matt\nScholar OK and can you do anything to mess up\nUm I can but it's pretty it'd be very high\nWhat's that ... well could you do that would mess it up if my GPA drops oh oh well that that's not that hard that's fairly easy okay yeah you can drop a GPA pretty easy\nOkay so what would I Do if I were in your shoes I Would pile up that money in a savings account as an insurance policy to ensure that I finished school with no debt you are your best investment no I Would not invest this money\nOkay\nAnd and uh because you're you're the best investment mathematically what are you studying wrecked\nEconomic\nTop yeah you're a great investment you're going to do really well and and you're right you got all these great ... scholarships so you're you're a smart guy so yeah I I don't need them I don't need you to have the money that the eight\nThousand dollars would make you during the next two or three years I Do need you to graduate with these honors in this wonderful degree field and pay cash for with no debt that is a very very very important and that's exactly what I Would do in your situation\nThank you for the call open phones a triple eight eight to five five two to five day but I'm thinking about getting financial ... going in my local union you have to be at a baby a certain baby step to be\nNo we try not to have perfect people being our coordinators and we would prefer you to be wherever you is\nIf you're just getting started you want to be a coordinator you can coordinate a clash all we want you to tell the truth\nDon't go in there acting like you some kind of dead gum rich financial person got all your act together if you don't just tell the truth I'm learning this with you people I don't know so many people are at a me I even got my first baby step my first thousand dollars you can lead a clash\nIf you love people you can put chairs in a circle and lead of discussion and stick to a plan that somebody else gives you then You're welcome to lead\nAs a coordinator financial ... anywhere you want to lead it we'd love to have you\nGet in touch with our team and we'll help you get that set up Patrick and thank you thank you thank you for following us on Twitter you can also follow us on Instagram we got about a million folks there we got about four and a half million five million base\nBook dot com ... Dave Ramsey the Dave Ramsey show on YouTube has exploded as well a lot of you but a million of you're watching that now a it's a live stream every day you know YouTube Live streaming stuff nowadays you can watch the show completely free on YouTube every day\nUm you can listen to it on a podcast\nEvery day about five and a half million of you do that [noise] thank you for hanging out with\nUs you can listen to it on real radio which is where the whole thing started there was just under ten million of you're doing that\nThanks for being with us on real radio and good stuff out her baby won't six hundred a ... for radio stations run out during the show was pushing for being with us Dr Charles is our producer code or social pressure and phones for him on Dave Ramsey your host we'll be back\n[noise]\n\n\nHey it's Kelly Daniel associate producer and fast runner for Dave Ramsey shall [noise] did you know Seventeen Dave Ramsey shown listeners paid off the million dollars in debt that's pretty impressive you this year is listening to morning Theresa\n[noise]\nListen up leaders if you want to be a better leader if you want to thrive not just survive in today's market I got some great news on November night we're live streaming our entree leadership one day\nThat's right onto our leadership one day live stream is a full day leadership event that you can stream from anywhere you'll see me along with every day millionaires and retirement expert Chris organ pastor and founder of the ... version Bible lap Bobby Grunwald and founder and CEO of charity water Scott Harrison\n... and can't we have average kid that\nWon the mortgage and then the second thing our car mhm and and I haven't any white\nAnd feels that the ... the car and I am just\nUsing it as a little bit more sentimental and wanting to go toward something a little bit more sentimental and I'm Wondering if the incorrect it kind of you that money as kind of like a final gaffe getting Shaq just kind of take away the emotions can just go towards that\nShow you want to buy something with it\nWell yes like I needed a new as a sweet as anti appliances for all nine of kind of been around for way too long and every hardly working in the first place so and my grandmother and when that taught me ... I mean for me that would be kind of a more final gift\nI guess I Would say that my husband if I have we have the extra money like twice a car and get back pay down\nOkay how much money's involved\nAt just on the line to an All right\nUm\nWell I analyze these things through the sentimental limbs as well and uh the way I Would ask myself this is okay grandma was obviously good with their money is is that she left her grandkids\nAnd kids nine thousand bucks okay mhm um show grandma sitting in heaven looking at a grandbaby what makes her smile because her granddaughter did this with the money and I'm not thinking a dishwasher does that\n[laughter]\nNow I get the tie into she taught you to cook and I might take a thousand dollars and buy some cooking utensils so that every time I use that set of\nPots and pans or knives or whatever\nThat I thought a grandma and I'm like what the rest of it on my car but I think grandma probably with somebody that hated debt and she might be smiling if you pay it off the debt I gotta agree with your husband\nOkay um but it's not that I'm not doing that through the lens of I'm calling your sentiments silly\nI'm just laying so I'm I'm just saying you're sentiment you can actually use that to try to say okay this is you know the the character of this woman she was a frugal person of saving person she was careful with their money my guess is she hated debt\nIs is does that sound familiar I mean\n[noise] [noise] Oh yes\nYes fail they paid off on that lounge real estate and made it pretty much as their retirement\nYeah so I mean I think she'd be smiling it'd be paid off your car but also think should be smiling if you spent you know a grand on some stuff to using the kitchen I get to enlist balances out a little bit how much do you own a car\nAt the we come back I think twenty four twenty five thousand dollars talk on the guy ... what's your household they wouldn't pay it off they just get what's your household income\n[noise] a white editor added ... here\nOkay All right well it's all going to get taken care of British in any way so more than anything it's just an emotional discussion I don't I mean yeah as long as you don't um\nWell the ... or you know what what would they have ensuring Ramsey do we would look at it through the lens of what what is wise and that would also be pleasing to grandma and so I probably would buy you know I'd probably say share and let's go get a really high end amazing set of\nCooking pots and pans and knobs or whatever drop a grand on it I don't know something like that and then let's throw the rest of it at this in\nHonor of grandmother because I think she'd be smiling about both things um I think you you know you're honoring her life or tradition the way she saw it\nAnd believed and that is something\nDo whatever you want there that's just the way I think through it and\nThis is that Iran\nCan you believe this real estate market home shopping has become so competitive there's a flood of new buyers in the market and bidding wars are the new normal folks are under a lot of pressure to offer more money to get into that house don't do that get certified instead\nThe Churchill mortgage certified homebuyer program is a game changer\nYou can quickly position yourself as a more reliable buyer and you get an upper hand in during the ...\nThey go she Asians enclosed two to three weeks faster than your competition so called Churchill mortgage today and get certified they've helped thousands of listeners an team members here at my office when the bidding war without having to bust their budget\nCall AAA alone to hundreds or visit Churchill mortgage dot com\nBusiness a paid advertisements and email us id won five nine one ... consumer access dot org equal housing lender seven sixty one old hickory boulevard Brentwood, Tennessee three Seventy wrote to seven\nChristian having affordable incredible way to meet their overwhelming healthcare costs it's Christian helped him in a sea he original health\nCosts sharing minutes saying I better Business Bureau credited organization CHEN members share in each other's medical town not insurance Christian financially and spiritually supporting each had our it's like the tennis stand for over thirty five years more at the age ministries dot org sat at the age ministries dot org\nChristian healthcare ministries have sorry Dave Ramsey live events\nJessica on Twitter asks if certifications or trade schools are a good alternative to college well Jessica they absolutely are but even better is getting career\nFocused training from my friends at career step career step all first training to quickly\nPrepare you for a career in health care that will get you a job you may even get to work from home and get this careers that helps with job placement for a special offer visit career step dot com slash Dave\nWant to keep going you want the success or do you want to tune in put on your television and hearing Nancy Pelosi speaker Chuck Schumer the Senate majority leader they have NO PLAN to make your life better nothing they are proposing nothing to make the lives of Americans better they're running on have Trump\nThey're running on pay Kavanaugh they're running on hate hate hate and all they wanted you to\nVote Sean Sean Hannity tomorrow afternoon on the major ... am eleven fifty [noise]\nNow traffic on the patriots am eleven\nThat afternoon we have a crash in the city of industry six o five yards on AT T sixty looks like the transitions to the sea east west on are still shut down in right now is has gets packed up to roast fans have sponsored by the estrogen temporal standards are monitor ready\nFor Assad flu season knowing when it's the fleas can make a big difference and knowing when you call your doctor to the best way to tell is that the flu\nBrings a fever so be prepared with at the monitor you contrast the ex urging temporal scanner backed by more than Seventy clinical studies\nYou're listening to the Patriot and eleven fifty ... you're listening to the Patriot am eleven fifty\nBoom ... Mm\nThank you for joining us Solomon is with us in Atlanta Hi Solomon ... Ramsey show Hi Dave how are you better than I deserve what's up\nAll day long story short ah I'm I'm a doctor graduated from medical school just finished reading the tea\nAnd I have about three hundred and eighty thousand in student loans mainly all from a medical school on most plenty I was planning to do or the public service loan forgiveness program no to pay it off however um\nThen kind of fall too with my current and I'm just trying to figure out\nThe will do a good way to to pay this off into so\nAnd death actually come to create a financial burden\nOkay just for a future reference thirty thousand people have no applied for the a loan for the federal loan service forgiveness ... service forgiveness Ninety six have been granted it\nBecause there were all worried about trying to make an extra point or two on the money instead of Kurt treating it like it's insurance insurance is ... is an expense money tied up at one percent you would agree is an expense 'cause it sucks it's a horrible right of return\nIt could be invested in making more\nBut in that portion that five or ten or twenty thousand dollars or whatever it is is just sitting there just as a barrier\nBetween you and the life\nAnd that's all it's for it's not an investment it's insurance investments make money insurance costs you money to protect the things that make you money and dishes insurance some good question though that that's the whole reasoning behind that thanks for calling him open follows a triple eight\nEight to five five two to five yeah when you have fun you know why it's gone on\nIn your better having an umbrella coming\nTogether get ready for this is the day Ramsey show [noise]\nSomebody tell you a story about two families that are very much alike and a lot of ways both families have two working parents and a couple of young kids each is dead and the struggle to make ends meet but they're starting to make headway with their budgets and smarter decisions with money\nThey have dreams and plans and the only real differences that one family is the right amount of term life insurance and the other doesn't\nBig difference if one of the parents die\nAnd that does happen their wellbeing would be destroyed paying for the mortgage\nUtilities food and other bills would be impossible let alone saving for education or retirement\nThat's why every day I talk relentlessly about getting term life insurance just go to sand or insurance dot com or called eight hundred three five six forty two eighty two and see how inexpensive it really is the the family that takes those deliberate steps to be different and responsible\nIt really does make you the hero of your story and it puts you on course for\nBetter things ahead Democrats on the streets of hysteria over Supreme Court justices because they need this or else what happens to their project of\nPulling the entire country away from God and further and further to the left into a destructive of fish they can't get enough of us to vote with them so they get is mandated by legislators in black robes on the Supreme\nCourt violating what he's constitutionally meant to be and replacing it with what they would like you to block sexting\nTonight to sit on the patriots am eleven fifty\nThree storm with winds of one hundred twenty miles an hour is expected to make landfall along the Florida Panhandle around noon tomorrow go to Rick Scott urging residents to heat evacuation orders\nJust drunk and kill you remember during the storm first responders they can't come out in the middle of the storm they can't come out and said\nMichael is pushing a deadly storm surge and expected to bring torrential rain to the region even Texas rescue crews continue searching for for people who disappeared when floodwaters tore through an RV park yesterday\nUS ambassador to the U.N Nikki Haley announcing her resignation today President Trump says you'll be considering several candidates for the cabinet level post in the coming weeks I've I've heard a lot of that while the bunker Trump's name came up as a possible UN ambassador Kennedy the first daughter tweeted tonight she would not be\nHaley's replacements this Fox News [noise]\n[noise]\nNow traffic on the Patriot am eleven\nAnd then we do have a crash working right now in the downtown LA area this soon to be on the one that won southbound before the one time it is blocking the right lane that Hollywood Freeway south by south and go from our streets traffic is sponsored body estrogen temporal ... cold and flu\nSeason knowing please can make a difference in knowing when to call your doctor the best way to count is that the flu brings a fever so be prepared with their mom and her you can try the actors in temporal scanner backed by more than Seventy clinical studies\nYou are listening to the patriots and eleven fifty ... ... am eleven fifty [noise]\nSolutions Steve and Cindy\nOur weather's hey guys have welcome welcome where you're from Elvie in Colorado which is new here just north of Denver okay cool and your hair no free scream in Tennessee yeah you don't want to be paid off\nWe pay it off three hundred and sixty three thousand six hundred and Ninety One dollar\nHow long did it say that I got six years one month in a Latin day\nAnd I love law and your range of income\nA time it was just fluctuating during that time sixty nine eighty nine\nWhoa okay and we all do for a living and I'm In the ministry and assessed that for the car company and I'm not calling area manager very cool good stuff fun so four hundred and sixty four thousand over six years I'm guessing that might include your mortgage ... ...\n... you know\nWhat's his house worth\nI'm Steve a five hundred and\nFifty thousand advertise [laughter]\nI Love at all or you do I am fifty one today part of it I'm fifty two days well happy birthday to you know prayed thrill\nPhenomenon how did you ever think you'd have no more mortgage payments\nNever in a millionaire is\nSix years ago you didn't you just started working on it and what happened six years ago\nUm well I'll tell you sound a little bit before that day if um I heard about you probably I Want to say back in two thousand five possibly when our our youngest granddaughter was born um you are on PBS at that time when I first heard of you and I called to get your cat and I was told that they don't take credit cards\nUm so I was a little taken aback by that 'cause I didn't understand the concept of the whole thing at that time and then two thousand twelve um we had heard about in in church again and I just see if we had to make some changes and um I was all in um it took a little while longer\nThough [laughter] okay so you signed up for the class and he said you didn't yeah that's exactly how one eventually I went kicking and screaming okay so what stopped the kicking and screaming when you go to class wanted to change your\nWell I took the first week that I did not go I knew that she was signed up to the class she asked if it was okay to sign up but you know it's fine\nSo that it came the evening of the class and she said she's getting ready to go if they have a good night she goes you were going together as a when you signed up for the class I didn't sign up for the class who was reloaded ammunition I went ahead and did my thing was stubborn next week I went with\nHer and eventually we became coordinators oh wow you know like yeah\nProbably half a dozen times I thought he was ... there are you reloaded ammunition she took off and loaded hers [laughter] I I\nLove it very ... very fun well congratulations you guys take her out for you all very proud of you\nSo and then you've been coordinating she got cheerleaders all around your people going to be a way to go\nWatch in the video they're going to love this right here you got people all around your screaming for you right absolutely I Love it yeah very cold anybody think you're crazy along the way over the hill calmly more of those are okay they're out there yeah everybody's got an arrow ready don't do like a ... right right or you join that Ramsey cold\nWe definitely made your name a cuss\nWord [laughter] it's happened before [laughter] that's so great art you've gotten out of debt you're in your ... your fifty years old you're paid off your house and everything you're coordinating classes that guy\nWho stayed home during the first class shows up at the second class he's you but now he's coming to your clash you know what I'm Talking about right what do you tell him the secret to getting out of that is why did this work\nWe had to be on the same page and obviously the first week we weren't on the same page with the class started here was about an eventually she got me on the same page Mm okay\nBut I mean what do you do you tell them the key to getting out of that it'll be on the same page what else\nIs follow the baby steps now okay very cool you know work together yeah you got to tell your classes your story if you don't I mean you should this is great I mean the whole the whole story the loading damage to stay at home that's that's real\nIf you don't know what we're talking about that's okay it's free you can come watch and figure out what we're doing on this coaching thing again text the word coaching to thirty three seven eighty nine Robert's with us in Atlanta Hi Robert welcome to the Dave Ramsey show\nHigh bay thanks for having me on sure what's up\nA one to ask you I'm retired I Am still work full time so I have a double dip you have a actually another small town and besides my retirement that come full Medicare I mean Social Security ... next February\nAnd I was thinking at sixty six so tight that they try to reinvest it uh any gross more\nA cushion for my wife who's younger than me I think I've got enough money to live on but I Want to help her out a little bit cause she got a\nKind of a bad early retirement contributions to marry a ...\nA car early both put the end the maximum a law that we can into her retirement to employment mhm so I'm actually twenty four or five apiece starting this year mhm so I'm Wondering what you thought about taking Social Security is sixty six like that\nNo problem at all especially going to run and reinvest it\nWell we'll we'll have to pay for the taxes on it we don't qualify for oil but oh well I think we still put me on a regular ... you know\nWhat you would qualify for a Roth if you continue to earn at least five thousand dollars a year\nAh well I Am a misunderstanding or there's a upper income limit on the\nOther is yeah yeah you can do not make over two hundred thousand dollar household income do you\nDo okay All right then you can do what's called a back door Roth I'd do that every year I make considerably more than two hundred thousand\nAnd the back door Roth is a at over fifty I'm over fifty you're over fifty we can put in sixty five hundred each six thousand five hundred each if we want to\nI'm into I put it in the good growth stock mutual funds for me and for my wife saw Thirteen thousand dollars each January I Move into a what's your news you move it into a\n... and after about four Tom sorry before tax\nIRA traditional I write\nBecause that way you haven't had taxes taken out on it you didn't take a tax deduction and then you roll it to a raw instantaneously in on the same transaction it's called a back door Roth IRA I talk to your broker about it if you don't have want to see one of our smart best approach they can show you how to do that\nBut that that's the Roth IRA issue but you can invest your Social Security money\nWhether you do a Roth or not you just put it in a mutual fund but if you're going to just take and spend it I mean you can do that too but you don't need the money you got plenty of money so I mean yeah I Would go ahead and begin to draw it because I'm\nYou know the the faster you take it out when you turn around reinvest it the more you're going to end up with\nA more than you would have in the difference in what it pays you by waiting\nUm so the only difference is if somebody's just consuming it\nAnd you're nowhere near that are then you might run the calculation differently but if you're going to pull it and invest it answers always pull it as soon as possible and start investing it because you're going to end up with more alive and more dead by doing that a\nMillennia is with us in Austin, Texas how can we help today\nDavid [noise] hey what's up for taking my call sure [noise] I Need to ask you a ... ticket and in fact you know [noise] not\nUnless it's to avoid bankruptcy or foreclosure are you in bankruptcy or foreclosure\nNow paycheck by pay tank and we have two cats and wondering what the Catholic id accept our home and found it might not my forte\nBut only where's the thing you're not out of debt when you do that you just move the debt term and get rid of it so what kind of debt if you got\nAbout thirty pounds and credit card can\nClown and tiny and hard about fifty fifty thing [noise] okay or\nTwenty on a car loan what's your household income\nCame home I mean I Do about forty and I have the thirty thirty two cars awfully expensive game\nConsider selling that but for sure you guys need to get on a budget and all my plan and the two of you need to start paying attention to money and making it all but have you just kind of been existing and you're starting to feel like a rat in the wheel and you're looking for a way to get off the wheel and you just select", "show_name": "The Dave Ramsey Show", "year": "2018", "city": "Los Angeles", "day": "09"}