{"month": "10", "state": "CA", "station": "KEIB", "content": "And the best is K. E. I. B. and Los Angeles streaming audio and patriot dot L. A. is preempted due to force programming\nK E R B will resume streaming audio at the conclusion of the game for best is Katie I'd be Los Angeles streaming audio patriot dot LA's preemptive due to sports programming\nKatie id will resume streaming audio at the conclusion of the game best is K. E. I. B. Los Angeles dreaming audio patriot donnelley's preempted due to sports programming ... I'd be will resume streaming audio at the conclusion of the game\nPasses K. E. I. V. Los Angeles and streaming audio patriot dot L. A. is preempted due to sports programming can eat id will resume streaming audio at the conclusion of the game\nMasses K. E. I. B. Los Angeles streaming audio at patriot data LA's preempted do the sports programming ... id will resume streaming audio at the conclusion of the game\n... I'd be Los Angeles streaming audio patriot dot L. A. reinstitute a sports programming ski I be evil resumes streaming audio at the conclusion of the game and\n[noise] this is Kate I'd be Los Angeles streaming audio and patriots dot L. A. is preempted do the sports programming geeky I'd be evil resumes streaming audio at the conclusion of the game and passes K. E. I. B. from\nLos Angeles streaming audio at patriot not LA's preempted do the sports programming Kiki I be evil resumes streaming audio at the conclusion of the game [noise]\n\nBasses K. E. I'd be Los Angeles streaming audio patriot dot L. A. is re him to do the sports programming Katie id will resume streaming audio at the conclusion of the game\nThe\nBest is Kay eat I be Los Angeles and streaming audio and patriot dot alleging preempted due to sports programming ... E R B will resume streaming audio at the conclusion of the game\n... I'd be Los Angeles streaming audio and patriot dot LA's preempted due to sports programming and Katie id will resume streaming audio at the conclusion of the game the best is Katie id Los Angeles times streaming audio and patriot dot LA's preempted due to sports programming\nAnd the\nBest is Kate I'd be Los Angeles and streaming audio and patriot dot L. A. is preempted due to sports programming K E R B will resume streaming audio at the conclusion of the game\n... I'd be Los Angeles streaming audio and patriot dot LA's preempted due to sports programming and GE id will resume streaming audio at the conclusion of the game the best is Katie id Los Angeles streaming audio and patriot dot L. A. preempted due to sports programming\nGeeky id will resume streaming audio at the conclusion of the game\nAnd the best is K. E. I. B. Los Angeles streaming audio patriot Don LA's preempted due to sports programming ... id will resume streaming audio at the conclusion of the game\nPasses K. E. I. B. Los Angeles streaming audio and patriot John Elway he's preempted due to sports programming\nEat id will resume streaming audio at the conclusion of the game the best is K. E. IP Los Angeles was streaming audio and patriot dot L. A. is preempted due to sports programming can eat id evil resumes streaming audio at the conclusion of the game in\nThis case I'd be Los Angeles and streaming audio at patriot dot LA's preempted due to sports programming K. E. R. I. Beagle resumes streaming audio is the conclusion of the game\nBand is Kay eat I'd be Los Angeles and dreaming audio patriot dot L. A. is preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game and\nThe\nBest is Kate I'd be Los Angeles streaming audio and patriot dot LA's preempted do the sports programming K E R B will resume streaming audio at the conclusion of the game will\n[noise]\nBasses K eat I be from Los Angeles streaming audio patriot dot L. A. is preemptive due to sports programming GE id evil resume streaming audio at the conclusion of the game\nIn this case I'd be Los Angeles streaming audio and patriot dot L. A. preempted due to sports programming GE id will resume streaming audio at the conclusion of the game\n...\nBest is Kay eat I'd be Los Angeles streaming audio at patriot dot LA's preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game\nIn this case I'd be Los Angeles streaming audio at patriots LA's preempted due to sports programming for GE id will resume streaming audio at the conclusion of the game\nThe bans is Kay eat I'd be Los Angeles streaming audio patriot dot L. A. is preemptive due to sports programming for ... id will resume streaming audio at the conclusion of the game\nAnd bans is Katie I'd be in Los Angeles streaming audio and patriot dot L. A. preempted due to sports programming\nK E R B will resume streaming audio at the conclusion of the game\nPasses ... I'd be Los Angeles dreaming audio and patriots LA's preempted due to sports programming kinky id will resume streaming audio at the conclusion of the game\nIs ... I'd be Los Angeles streaming audio at patriots LA's preempted due to sports programming\nKiki id evil resumes streaming audio at the conclusion of the game\nAnd the\nBest is K. E. icy Los Angeles streaming audio and patriot dot L. A. is preempt into the sports programming Cheney I be evil resume streaming audio at the conclusion of the game\nIs Kay eat I be Los Angeles streaming audio and patriot dot LA's preempted do the sports programming Katie I'd be evil resume streaming audio at the conclusion of the game all\n[noise]\nBest is Kate I be Los Angeles streaming audio at patriot dot L. A. is preempted due to sports programming ... I'd be evil resumes streaming audio at the conclusion of the game\nThe\nMasses K. E. I'd be Los Angeles\nDreaming audio at patriot dot LA's preemptive due to sports programming Katie id will resume streaming audio at the conclusion of the game will basses K eat I'd be\nNow Brian and Karen they run Lone Star transfer dot com\nHow many have you pay high yearly rage maintenance fees for a time share that you'd never use that you thought you were going to use you want to get out of your time share\nAll they're helping thousands of Americans just like you get out of them legally ethically quickly and you're saving money\nWon't start transfer has a a plus rating with the better Business Bureau Brian and caring family owned business they will make sure your experience is pleasant and fast\nSo don't let another year go by paying those high fees give them a call no obligation you need to go to a Lone Star transferred dot com or use your cell phone hit pound to fifty and use the key word say the key word timeshare pound to fifty on your cell phone say the key word time share\nOr just go to a Lone Star transfer dot com you won't regret it\n[noise]\nThen gumbo Sean Hannity is bad for America [noise] on Hannity [noise]\n\n\nJohn Gibson\nHere President Trump defines leadership the first major tax reform a Thirty Years' unemployment at an Eighteen year low jobless claims lowest since Nineteen Seventy three the Dow highest ever milestone achievements and now noble goal his men did an exclusive collectors being twenty twenty President Trump freedom point\nOne side in the image of Donald Trump\nOther side lists all his major achievements\nThe commemorative one ounce coin is the only presidential Trump coin made him Ninety nine point nine percent silver not silver plated [noise] and it's IRA approve this the price of silver rises so will the value of these coins\nGo to the Trump coin twenty twenty dot com use the code calling to say five dollars per call or text coin to five eleven five eleven\nSo the Trump coin twenty twenty dot com for this silver twenty twenty President Trump freedom coins available for a limited time only go to the Trump coin twenty twenty dot com today standard tax rates may apply\nNow traffic on the Patriot am eleven fifty\n... been doing some research here to the center divider this on the one on one free wing north bound between ... road and liberty can you run the the listening to shut down for that repair\nDamage from yesterday's plane incident in ... it is making poor or slow down on the freeway itself north one oh one into a global hills also near echo park\nWhen Winfrey way south bound around bitten way big rig broke down one of the middle ... links blunt and you've got Jim in there from Melrose self ... from Hollywood toward downtown a delay and in east LA five freeway step into the ten freeway connector stole then a little bit earlier this report sponsored by compassion international sponsoring\nA child with compassion is the most effective way to an extreme child poverty released a child from poverty when you become a compassion sponsor choose your child now with compassion dot com slash radio do your part to release the child from poverty today I'm Richard turn in Geneva eleven fifty the patriots\nWednesday October twenty board wants new today on the free our radio I\nVery it was only I our radio ads on radio ... minute reaction between the Dodgers Zach\nWith the radio every ESPN Radio wherever\nYou are your story baseball gloves with rich history of the championship for the\nSeries on ESPN Radio on the\nGroup of you know the American work at general is when they were to subject credit for some ...\nGet a lower payment on a larger alone now if you've been told no on a jumbo purchased a refinance the show town says yes a chore French Sean Hannity here that maybe you got one of those quote interest only loans that's about the double\nOr maybe you simply need some cash out well after almost three decades processing loans Michelle knows how to go outside the box and find a program that work specifically for you\nThat's right John we just helped one of your listeners who had been turned down by four major banks because they didn't fit neatly into their box he had too many right up\nWe were able to close at one point three million dollar refinance by substituting his bank statements for his tax returns we saved him over a thousand dollars per month\nAll must show with a town group before interest rates go up just say Sean Hannity told you to speak directly to the girl will get that done all eight three three my jumbo loan ask about her fourteen day closing guarantee call a three three my jumbo loan eight three three my jumbo loan\nAnthems wellness Wednesday is here with a healthy did did you know a few steps can take you far no really walking two and a half\nHours a week to cut your risk of heart disease down by thirty percent it's also been shown to reduce the risk of diabetes and cancer as well as lower your blood pressure additionally studies show that a walk at times can be just as effective as some anti depressant\nWellness Wednesday is brought you buy anthem\nHey it's three am in the ticking clock scenes is louder than Jack hammer and instead of dreaming about marshmallow crowds and I don't know running with Anna lobes having\nNight sweats and worried about your parents and their medical bills they're older you're stressed I get it but losing sleep over a few questions about medical bill isn't going to help what will\nIs knowing your parents have Anthem Blue cross they provide real people to talk to can help right then and there on the phone it's just really crazy notion anthon likes to call doing the right thing to your parents will get the care they need you'll feel more confident than ever and those animals while they're about to get their running partner back\nFor all the things that keep you up at night and the Medicare has a solution real people empowered to get you on the right track so you can rest easy Anthem Blue cross rest easy to learn more visit rest easy dash anthem dot com\nBlue Cross with the trade name a Blue Cross of California independent licensing of the blue cross association this is the Patriot am eleven fifty\n[noise]\nGoing to wrap things up and say we had an amazing Hannity tonight nine eastern on the ... I Am going to point out I Will I Am going to lay out just what a bunch of phony hypocrites\nThe left the media Democrats are and they're hypocrisy today on full display we've got Eric Trump look what his family's been through we've got\nNewt Gingrich and Henry Michelle mountain that nine eastern that your DVR candidates site on the Fox news channel thanks for being with us we'll see it to my backyard tomorrow\n\nDid you know you can show your life insurance policy even a term policy for an immediate cash payment call coming tree director one eight hundred five on oh twenty eight hundred and ... ... ... murders a carpentry direct dot com to learn more\nWe found a way of plant carefully for our retirement but we quickly realized we needed a way to stop them at our income or from sold their policy to help pay their medical bills and I got me thinking maybe selling our policy could help with our retirement I did some research and called country director\nWe learned we can sell all of our policy or keep part of it with no future payments who knew we sold our policy now we can relax and enjoy our retirement as we unplanned\nDid you have one hundred thousand dollars or more life insurance you may qualify to sell your policy goal country director one eight hundred five on oh twenty eight hundred a we're visiting carpentry direct dot com that's Coventry direct dot com ... one eight hundred five on oh\nTwenty eight hundred governor redirect redefining insurance ... country director of marketing companies were different qualified policies twins disaster\nFor Elizabeth Warren is all three networks mock Native American claim this is the last thing that she expected it happened the news media cannot carry her water they were more than willing to promote it\nPropagated do whatever they could they knew full well that fishing is bogus and it was nothing more than an attempt in political trick and they gave it their best shot\nRush Limbaugh tomorrow morning at nine on the Patriot am eleven fifty [laughter]\nWednesday October twenty board wants new today on the ... her radio I\nVery interest only I our radio ads on radio ... minute reaction between the Dodgers in ...\nWith her radio every ESPN Radio and wherever\nYou are you a story baseball gloves was rich history the championship for the\nSeries on ESPN Radio on the\nMade a man\nMean on the jury I mean I mean Los Angeles [noise]\nDemocrat and CNN do York headquarters boxes ... has the latest line\nBut a hundred twenty five thousand uh by you're pretty good rental house in the St Louis market\nAnd if you don't mind the idea of that and working with a renter and making sure that you know they don't tear up stuff and uh that you're you know you do a good job of a screening them vetting them before you come in and you you know you're kind to them but you're from with them they're going to pay your you have to move 'em out and you do all that kinda stuff real estate and making good money\nAh especially paid for real estate it's very very nice got much of it but if you don't want to do with all that and I just get I Would pick some good mutual funds and go that way\nBut at the point is there's no shame and your game by keeping it simple\nSomehow people have the idea that primitive or simple is bad\nAnd the contrary to the contrary it it the truth is the contrary to that the truth is is that the typical person who builds on net worth of up to about ten million dollars or does keep it very very clean and very very simple\nSarah is with us in uh Seattle, Washington Hi Sarah how are you\n[noise] I'm doing well thank you Kelly taking my call\nWe'll we'll let Kelly answer your question if you want [laughter] what something Sarah [laughter]\nUm I'm trying to get a little bit of advice and how to advise my parents to get long term care insurance my daddy\nIs sixty seven and doesn't qualify for health issues for my mom just turned sixty a couple of months ago a couple of months ago and we're talking and my dad says well\nNow for them change doesn't fit in our budget and my mom says that short term thinking mhm and I think they need at the budget\nWhich there how income\n[noise] um [noise] well that's a good question they are retired missionary power they have not made a pilot and my dad tomorrow are tired of my law Marquette receptionist I don't know exactly what he\nMight outfit in their budget okay I mean there may have to buy very very limited policy if they don't have hardly any income why what's wrong with your dad that he doesn't qualify\n[noise] um he has made us have had a kidney transplant\nAnd so he's a told him to get it in the past and hasn't been able to\nSome I've tried to do what you said the Potter back cooler or whatever you know say you know what works for me to fathom\nMhm really doesn't get to get in front I got to get fat I mean I'm like last year I encourage them to look into that and they talked about al ... I think today off at that point out there\nSo if you if you can't talk about this what are they going to do it or not I mean how can I help\n[noise] well my mom called me and told me all that I think she's on board of trying I guess my question is um [noise] how can I have had to convince them that according to\nYour mom already knows it's important not only question is I don't know if they've got the money to buy much of a policy sounds like they're pretty broke to me\nUm with what you're describing I don't know I mean some people come off of mission field not broke but but sometimes I don't and so you just got to you know um it it sounds like you're trying to fix something a lot harder and they're trying to fix it you can't make them do this\nAnd so I think your ... your mom's question in the yeah I mean if there's any way I could get it into my budget I Would get it into my budget um but it sounds like his health is he's an older than her about Fifteen Years and he's are no I'm Sorry about seven years you're saying but I'm In his health is worse\nAnd typically Seventy five percent of ladies outlive their husband\nThe statistically nationally um and so the one that I'm most concerned about going into nursing home and eating up everything as him and we can't get him covered apparently so uh\nDon't know what to say other than just try to coach your mom from afar but there's no magic pill make them do what you want them to do this is the Dave Ramsey show [noise]\nWhy in the world would you trust some random guy in a Q when getting your mortgage\nYou really think he cares about your long term ... doesn't\nThose companies care about getting you and do whatever home loan program they're pushing that week when it comes to ordering a cheeseburger the meal deal works fine but let's get real people were talking about the largest investment you'll probably ever make so don't be naive and trust in order taker who pressures you into a pre packaged alone\nMy friends are Churchill mortgage I'm helping my listeners for over twenty five years\nCalled Churchill mortgage and got customs solutions from an expert within ten minutes it's simple they'll shoot straight with you and quickly show you the real way to save money call triple a loan two hundred that's AAA alone two hundred or visit Churchill mortgage\nDot com business paid advertisement and then when I signed the ones I don't want anyone less consumer access dot org equal housing under seven sixty one will agree boulevard we went to the sea three Seventy five to seven\nOn crucial to argue finances out of control is the paycheck to paycheck like leaving you fill in panicked and insecure our debt payments keeping you from accomplishing your financial dreams you work too hard to have nothing left to show for it taking control of your money is easier than you think and I'll show you how\nI'm heading onto or this fall to bring our world class smart money over there and to a town near you just visit ... Ramsey dot com and click on the vets to find a show mirror you that's a big Ramsey dot com we'll see you there\nI Know it's back to school season but that doesn't mean you have to stress out about what's for dinner for almost ten years I've been telling you about my friends had emails who make meal planning and shopping virtually stress free you can even have your groceries gathered for pickup ... delivery right from the emails that\nIt's the smartest way to save money every month and you'll be a hero is your family each delicious healthy dinners together\nSign up for a free two week trial today at emails dot\nCom that's easy meals dot com\nWe cannot engage in chaos we cannot engage in outrage we must reach for to fight the sport and the walls around\nReason and I know that if we're going to save the western way of life then we must go to the principles that the western way of life was founded on and that is a reason and logic and yes the teachings of Jesus Christ\nGlenn Beck morning it's harmless\nTraffic on the patriots am eleven\nLaura Caltrans doing some fence mending the left lane is shut down in ... north down between last hills road unlimited Kenyan road\nDue to a guardrail repair and this was damaged in yesterday's plane incident counter ins were groups been working out there for awhile and traffic is still accordingly a little bit of extra slow elsewhere\nSigned free way South Bend it the ten freeway connect you in east LA van broke down and traffic starting to stack up there when a teen freeway you spend a receipt a boulevard to stall pushing to the right shoulder is\nReport is sponsored by DEA take back day within ... take ... dot com\nYour unused prescription drugs could end up misused voice tells me\nShe's in a national prescription drug take back then\nSaturday October twenty seven signed a connection sang Ki ay take that back time\nI'm Richard ... you're listening to am eleven fifty the patriots\nHow would you like a second source of income without having to work a second job does that sound just about too good to be true\nWell my friends would only training academy can show you how other people are doing this every day\nYou see they have a pet decor strategy that can help you follow what Wall Street is doing\nAnd show you how profits are being made when the market goes up and even when it goes down right now they're offering a free Wall Street insider catch so you can get started right away just called eight seven seven nine four to trade you'll get to on line classes instructional videos and a guy that will help you learn to build that second income\nIt's all free college seven seven nine four to trade they will even throw into free tickets to an upcoming workshop so you can ask questions and learn more the market is making all kinds of moves are you ready to move with it ... seven seven nine four to trade\nEight seven seven nine four to T. R. A. D. E. eight seven seven nine four to eighty seven twenty three you're listening to the Patriot am eleven fifty\nOctober and we're told thousand dollars away from chicken Sallie Mae out of the house and we'll be done are so proud of our debt free screen next hopefully not burning hell\nWe're on our way and by that we are a coordinated our third financial piece class and get one of the things that keeps coming up that we're trying to figure out and also help advise others as you know were single income family and all that stays at home or health insurance costs outrageous sure\nAnd and last month I had known as anybody else on a wig laugh my way to go or and they're all ... up again and we're we're spending like twelve hundred dollars a month to carry the family and work insurance and your co pay of parents by an everybody in the area of the all of that are called ...\nTo them why would that be well question answers itself talking about the Democrats\nRush Limbaugh tomorrow morning at nine on the Patriot am eleven fifty\nUse I'm Kathleen Maloney federal officials are investigating multiple suspicious packages that we're Central High profile Democrats in several states\nEach package is similar in a parents and contain potentially destructive devices all were mailed in manila envelopes with bubble wrap interior a fixed with computer printed address labels and six forever stamp Fox\nIs Jared helping in Washington to people are dead after a shooting at a kroger's grocery store outside Louisville, Kentucky a witness describes how he hid in a room during the gunfire\nWhen we open the door you know we had barricaded were furniture and we can see a stream of police officers\nThey just asked us put our hands up and health is out of the room and him and walked out\nPolice say they do have a suspect in custody I sell off on Wall street the Dow dropping six hundred eight points NASDAQ and death and the also down this is Fox News [noise]\n[noise]\nNow traffic on the patriots am eleven\nAnd a ... some fence mending has been taking place to live in for free way one oh one north found between last hills wrote in liberty Kenyan rode\nThe sender divider is being repaired by Caltrans and this is damage from yesterday's plane incidents a one on one north ... and ... and traffic is a little bit extra\nSlow on the main portion of the freeway also on the one oh one freeway southbound just passed bitten weighing approaching downtown stole big rig one of the middle east bloc their east LA find something to the ten a crash this report is sponsored by Covered California\nYou're unique and Covered California offers free expert help to choose the health insurance plan that best fits your particular health names visited covered C. A. dot com to find help and it rolled today life can change in an instant be covered when it does um did you turn in Geneva eleven fifty the patriots\nThis report is paid for by no one prompt sick stop the attack on bridge in road safety\nTemperatures isn't allowed in the seventies the beaches this afternoon and it's mostly ...\nProp six eliminates five billion and transportation funding and kills local traffic relief projects already under way please vote no on six more generally when Santa Monica has a high Seventy three [noise]\nIn California there's a pothole around every corner and traffic is a nightmare proposition sexual make things even worse for to subject credit for some ...\nGet a lower payment on a larger loans now have you been told no on a jumbo purchased a refinance the shell towns says yes hate your friend Sean Hannity here that maybe you got one of those quote interest only loans that's about the double\nOr maybe it's simply need some cash out well after almost three decades processing loans Michelle knows how to go outside the box and find a program that work specifically for you\nSean we just have one of your listeners in that exact situation they were in a seven year interest only loans that was about to reset we were able to secure that may fully advertise Fortier alone that will also say them five hundred dollars per month\nOn the show with a town group before interest rates go up just say Sean Hannity told you to speak directly to the girl who get that done all eight three three my jumbo loan or go to why Michele town dot com that's Michele with one L.\nM. I. C. H. E. L. E. Y. Michelle town dot com ask about her fourteen day closing guarantee call a three three my jumbo loan eight three three my jumbo loan\nNothing small about your your passion your hours your reputation all huge their partnership even bigger\nWhat does my business technology advisor you'll get the tax advice and one on one partnership to help your business ground\nBecause with a reliable down these with intel core processor you can focus on what matters most getting business down\nSeven seven by down to speak with an advisor today\nTo eat them seven by down\nWhen the need for senior care arises there is no place like home your loved ones should never have to give up living at home\nVisiting angels will provide home care for your mom or dad at home up to twenty four hours per day including personal care meals and light housework you'll select your professional caregiver with visiting angels look up visiting angels dot com or called eight seven seven\nThree seven four Liz that's eight seven seven three seven four live franchises are available visiting angels America's Choice in senior home care is is the Patriot\nAm eleven fifty\nOf Ramsey delusions Toby and Christie are where the guys how are you\nGuys welcome where are you from\nIllinois near ...\nVery good well welcome to Nashville\nAnd all the way here to do your debt free scream yes I Love it how much of it paid off\nTwo hundred and Seventy five thousand wow how long did that take six and a half years\nGood for you and your range of income during that time\nWe started out about a hundred and eight hundred thousand and now we're just over a hundred and Seventy thousand cool what I'll do for a living I'm an assistant professor mhm\nAnd I'm a shop manager about auto body shop\nVery good cool cool so I'm guessing with the size of that that ended up being six and a half years you're paid off your house yes I did\nThere were a ball [laughter] good job of you guys well done well done very cool so that's house and everything you got no payments in the world\nRight how's that feel awesome\nNot bad so tell me the story what happened six and a half years ago they put you on this journey\nWell my sister in law was telling me about the financial peace university class she was attending and she was telling us about budgeting and hang out credit card and I kinda just pass\nIt off at the time because we already followed a budget\nAnd then I catch it on the radio show a few weeks after that and um I really liked her no excuse attitude for paying off debt so I came home and suggested they told me that we should go to a total money make over one day event and so we did that and we decided to give it a try and so we\nWere where was that have been held Kansas City okay very cool very cool and I got you guys going you\nKnow we started to do that and we finished baby steps to in three ... and we had just finished baby steps three in October two thousand and twelve and then just a few short weeks after that our entire world kind of fell apart\nAnd when he was diagnosed with for brain tumors whoa\nSo at that time we went into survival mode for a year or so while he was in and out of the hospital having surgeries um during that time we also cash load about Fifteen to twenty thousand dollars mhm and medical debt\nAnd medical bills mhm and we also made the difficult decision to sell the family business are posted at the time and so we liquidated that and we've got about fifty thousand dollars from that sale\nAfter he was back in good health and working full time we sat down and looked at our budget and how much we had to pay off on the house and we just knew we had to finish it with his health history so we just made the commitment and kept moving forward\nWhile she'll go ahead and just be brain tumors in the process yeah\nGood for you it's like you will on man that is awesome ... gonna do it without these guys I'll bet I bet you guys are fall to some real stuff and paid off ... Italy before\nVery very cool well life does happen while we're more making other plans doesn't it and uh you you just push pause for a little while and took care of business and then push play again right\nRight so good for you what do you tell people the key to getting out of debt is\nA lot of hard work and perseverance this discipline mhm\nHer disappointed pointed her for that I Can't see through your radio yeah very cool great ... and so you've got a the line up with your the ghettos whether you give me their names and I just\nWe have Kelly sixteen ... bank Megan will be Fifteen next week mhm Carmen is ten and Taylor a seven\nHour right very cool so uh the ghettos and and they've struggled through this whole thing too with you obviously have they learn anything in the process\nI think so I Hope so\n[laughter] good [laughter] okay well congratulations you guys were very proud of in congratulations on beating the rain to him room and that's an incredible story thank you very cool and I hear your set with a paid for a house yeah what's that thing worse\nI it's probably three fifty to three eighty\nBearing not union and insurers so [laughter] it's years by the way nobody's going to get that one though is yours I Love it the that's a different feeling\nFolks that I've never been there it's a different feeling after you've been through stuff like you guys have been through or German I went through losing everything and nobody's coming into my house\nIt's mine is paid for very well done you guys very well done we got a copy of Chris ... book for you retire inspired\nNumber one bestseller that should be the next chapter in your story millionaires that is what we're going for next and outrageously generous along the way so congratulations you guys thinking like you don't have the girls were practicing prescribe their last year or two anyway yeah OK teenagers or to go there All right\nI think you're already preparing yourself for your financial future Seventeen years old you actually know the day Ramsey show exist go figure\nSo I mean that that alone is is um put your way ahead of the game and most people say you know what to do and and and you're obviously observe some things you don't want to replicate from your dad even though there's probably some things that he does that are good\nThings not necessarily the money but but and he's probably got some good traits that you do have a really Kate and carry forward\nUm so uh um well the first thing is is that you learn to stay on a budget you learn to stay out of debt you learn to save money for emergencies and invest for the long term\nYou don't spend more than you make 'em you don't get credit cards and carry them around so that's how you prepare for your future and obviously you're gonna have to handle your own\nA school ah and you know on the show you have a lot of work ahead of you but that's okay you'll be fine as far as you go now as far as him on there's not many men on the planet that will take financial advice from their Seventeen year old middle son\n[laughter] absolutely\nYou have the powder ... syndrome once someone has powder but they really don't want your opinion about money or sex [laughter] and so he's not looking for your advice even though he knows he's probably wrong uh so you're probably not the men to speak up and caused this to happen that's my guess\nShow what are we going to do well there's a couple of things you could do um one is is there a person in his life uh particularly another man that he respects is their\nBusiness ability their money ability or even they're just they're spiritual walk\nA well definitely our pastor in the past there have tried to helping them in the past but it seems like no matter who's talking to him or what or how they're trying to al ... and he just doesn't seem to either comprehend any of it or want to replicate any of that and he's very stubborn and being his own man\nMhm okay well I think if I were you ever talk to your pastor again\nYou know I I find people every day I've been doing this for a lot of years and I found people every day who\nTwo years ago ... wouldn't listen but now they listen or five years ago they wouldn't listen but now they listen so all of us you know the stubbornness comes and goes with all of us and be in our own man comes and goes but if the past or you know just a leans in and and I think\nI'm most pasture as if they're going to make an era where it would be on the side of being too soft not too hard\nAnd so I might if I were you ask your pastor to turn up the heat is just a little bit more\nAnd just spending time with your dad and push on your data on this subject\nAnd not mentioned that you are involved because you're not involved\nYou can't fix it and you keep your mouth shut down you're not going to anything but make things worse very true yeah 'cause he's gonna he's gonna do whatever he wants to do\nAnd then uh you know at the end of having done everything you can do I mean you know if you wanted to give him a total money make over ... book or something you can do that but you can't be ... I was thinking\nAbout doing that probably Christmas or something I Would\nJust say this is something I read that I liked I thought you might enjoy it because you like business or something like that not like a hey you're really fat here's a book on how to not be fat [laughter] that doesn't work\nRight that's insulting yeah fall on me and it's so you know instead you would just say I'm just kind of blow it off and make it not might not make it a big deal oh daddy would change my life I Would feel so good if you would read there's no don't do any of that crap\nJust yeah it's kind of keep it nonchalant and just go hey I read this I thought you might like it 'cause you like business stuff or something like ...\nAnd and just see if he picks it up he may throw it away he may put it on the coffee table as a coaster for the next two years and then open it we don't know how this was going to work but at least on a minute outside expert your pastor is an outside influence that does have or could potentially have the credibility for him to listen to\nSome people aren't listening to anybody and so you have to be willing to go I Love my dad in spite of his um incompetence than this one area of his life and I'm just gonna love him where he is it's all I can do\nAnd you made that you may do that your whole life you you know he may go to his grave doing this\nAnd and so your love is not conditional upon you know whether the handles money well or not your respect for him it's not even conditional on that\nBut you're not gonna take financial advice from somebody that's misbehaving with money so he's not going to speak into your life on money issues but that's all that's all you know I don't speak into people's lives on growing hair 'cause I Can't seem to do it on top of my head so I don't tell people how to grow here\nSo if you can't do something you shouldn't tell people how to do it right\nYou shouldn't have even have an opinion this loud about it but people try all the time so just kind of keep that in the back of your mind their joy hey thanks for calling in ... open phones a triple eight eight to five five two to five Jay is in Jackson, Tennessee Hi Jay how are you\nI I Am doing slightly better than out of there and working on getting better God how can I help [laughter] oh I just wanted to say first off I'm a lifelong ... or ... thanks to my mother and my grandmother always playing you in the car when I was a kid wow at I now to you as an adult\nHave not always practice as good as I should have but I'm working on that that was gotcha how can I help today\nAh well I'm actually calling to ask about that but I'm working on hang\n'em up like Maggie I doubt it at work Seventy hours a week and actually deliver pizzas and ugly okay I have called the office to make an offer on there that they have given me a counter offer ... Seventy five percent of the balance\nWhich I Know is a little high that never had anybody hurt anybody asked you about a debt over a judgment on an addiction which is what this is over mhm no I understand that may be a little bit for it yeah it is but they have refused to give me a written agreement on the\nOkay um so you want to bring them a check they will not hands you an agreement\nA he said if I come in to their office I Will get a receipt but they will not give me I have an agreement beforehand\nAnd that's fine that's fine but it can get a receipt I get a a a statement that says this judgment ... this this eviction debt is one hundred percent clear it upon this payment not ever seen that as you pay the money a receipt to says you've paid money doesn't mean that you paid Seventy five percent you still owe twenty five percent\nOr what he had stated as it would be a he called and they were the but also saying that that what would be sent to the county clerk or to mark that it is I often\nDon't as long as you have something in your hand that says the debt is settled in full and it's in writing\nYou would you be fine okay so ... and Seventy five percent on an old eviction that it sounds to me like you're dealing with an individual landlord not a corporate landlord\nI'm dealing with a law office that has representing the arc of that yeah you probably got about all you're going to get [noise]\nHow can I take the deal and and I'm willing to pay that amount that you know totally fine go go in there and pay 'em and get her done you know but get it in writing this as the debt is settled in full and this payment means I'm no longer a winning money and it needs to say that real clearly were you understand it and you can see\nIt or don't give them a check and you know that that's how it works and they know that if they're in a law office you don't let them loose that Iran's show\nHey guys this is James child's producer of the Dave Ramsey show I'm excited to announce the we're now hearing it on six hundred radio stations across the country to find one near you had to Dave Ramsey dot com slash show [noise]\nOperators if you want to be a better leader if you want us to arrive at not just survive in today's market I got some great news on November night we are live streaming our entree leadership one day\nThat's right onto our leadership one day live stream is a full day leadership event that you can stream from anywhere you'll see me along with every day millionaires and retirement expert Chris Hogan\nPastor and founder of the ... version Bible lap Bobby Grunwald and founder and CEO of charity water Scott Harrison\nDiscover what these top leaders due to disrupt the market place you can download the event workbook interact with other attendees through a live feed and get all the same great content as if you were attending in person know travel required may get a day for you and your team to watch to gather registered today\nRamsey dot com ... or text anyone be twenty Eighteen to forty four to twenty two for more information\nBe Los Angeles this Tuesday patriot am eleven fifty broadcasting throughout the south land and all over the world I hurt radio [noise]\nReport suspicious behavior I leave till the town of Fox News the highest priority for the FBI that is what director Christopher Wray and saying about the theory the homemade bombs that were sent a high profile Democrats including former Presidents Clinton and Obama\nMore yeah more or less or look at a lot of people look at you like a babysitter you know but they weren't you know yeah but but\nThere's no shame and work all workers honorable so I think Rachel really hit the nail on the head if you didn't have the fear of peers and you weren't worried about the money will see the money was there and you could take care of kids and make the money you need to make you'd be pretty darn happy when you\nYeah you know you're over thinking it I think you are clear and I don't think you need to justify you in your mind\nOr that that being a nanny is okay I think you need to say it's awesome I mean uh you know again maybe one day she opens up her own daycare I Would dream was in this passion ... writes dream what could\nBe what I was going to even say because we have help with our two girls so that I can work and travel and all that and so to have someone in your life that as walking with you and your kids that you trust your and valuable to family like that role is not just a babysitter like that and if and if the family are working for\nTrade so like that like that's that's a cause I can tell you they're going to help us we were like we are all the time like we could not do this life without you like she helps us so much and so\nFiguring out a family that fits you and that in that vein and trying to find the money for it so like maybe you say hey here's my here's my max like if you want me as a nanny and I'm the best man it you're going to find I've been doing it for twelve years I Know exactly what to do\nThis is what I cost you know what I mean and kind of have that concern to your tennis\nIn Columbia South Carolina I can tell you actually that if you stay with it and look long enough and hard enough with twelve years meaning experience there some wealthy families that would need you to do maybe a little bit more than just maintain a threat where maybe you're just doing some light cleaning laundry hoping\nEven as I say life assistant ointment then\nAre you on me and you can make more than forty yeah home for more than forty yeah I think you got to own that this was what you will have to do and find the best place to do it\nThat's a game changer and having the confidence right All right you just you just detect\nA little shame I'm thirty one kid and Rachel and I'm a nanny mhm wait a second\nI mean this is he does the shift yep and you know think about oh pears you and I have a mutual friend will show her name Sonya and remain nameless guess who is very wealthy and has a new pair really pay that lady big dollars yet so again you know there there there are some limits to what you can do they're really really can\nAnd even like for families that are looking for that kind of not to drive goes on but but it is such a vitamin I cannot come presence it's exploded because people are in need of that so even if you started a service where you had been working for you that you helped train that's right I mean let's say that that the options are inland it's great creative\nAll right let's go to a social media question from Facebook Angie types and I'm not sure what to do and plugging away and my first snowball which is which has thirty eight hundred dollars left on a loan and then some smaller medical bills are coming in and do I put those smaller bills in front of the thirty eight hundred dollar loan on the debt snowball list\nYes as as more loans\nAre coming in and just go ahead and reevaluate that isn't the new comes in that okay where's this with the thirty eight hundred and put it in a place that you can keep knocking it out for and\nWhy is that why because I think the question is very calm and they go and work on the snowball nuggets of so let's say it's a four hundred dollar medical bill yeah well I Do that\nTo go ahead and get it out of the way you know it's still momentum yeah you're still building the idea of okay I can do this and if that thing is just tagged along at the end you know what I mean like there's no purpose for it you know if you have the money you're going to have the money at that point you're got snowball especially if you're almost done with it you're going to have some cash to be able to throw at it and pay it off and then probably still put money on to pay off the other day that\nOkay this is a little bit shocking Baltimore put this out there next segment we're going to talk about this are you ready for this Rachel the current total of us consumer debt as of June this year was three point eight seven trillion dollars that's trillion\nOkay unbelievable but here's what we're about ready to share a new study out reveals what people are willing to give up in their life in order not to have the debt you're not even gonna believe it it's shocking to say the least\nI don't get it we're going to break it down plus we'll take your calls ... eight to five five two to five can pull the rich grew sitting in for the Ramsey says they registered\n\n\nOne question I get asked all the time is do I need life insurance was in the whole point of life insurance is to replace your income for someone who counts on your show if you have a spouse or you have kids yes you need term life insurance is the only way to protect them until you're out of debt and build up your\nWealth you're only digging a deeper hole if your waste money on cash value plans says it robs you of the ability to make real progress and that's why I send you to ... her insurance from my house for Twenty years that's where I get on my insurance and they only offer the plans I recommend\nIt is not expensive it's not complicated and sand\nOr will be there as your guide every step of the way visit ... dot com recall eight hundred three five six forty two eighty two you need to get this taken care of I can give you the advice and I can tell you where to go but it's really up to you to take an important step\nTo get your family protected that's ...\nDot com or eight hundred three five six forty two eighty two\nChristian having affordable incredible way to meet their overwhelming healthcare costs it's Christian healthcare ministries the original health cost sharing ministry better Business Bureau credited organization CHEN members share to pay each other's medical\nThem if not insurance it's Christian financially and spiritually supporting each other it's what the damage is done for over thirty five year learn more at the age ministries out or that the age ministries dot org person healthcare ministries ... author of Dave Ramsey live events\nHere some exciting news simply savers now valued at one billion dollars folks this company used to be just five guys working together now they protect over two million people and here's what simply say ... system is easy to use and takes just minutes to set up there are no contracts are hidden fees and twenty four\nFour seven monitoring is only fourteen Ninety nine a month visit simply say direct dot com my listeners get free shipping and free returns that simply say direct dot com\nNothing is\nSacred to these people their minds have been poisoned by this loop of MSNBC and all the rest of the CNN Washington Post New York times demise of employees they think that they're smart when they talk about the president has to be removed by the twenty Fifth Amendment they think they are savvy when they discuss the coming fascism in this country\nThey're hysterical in muscle [noise] but they're also getting dangerous and they are really destroying some of what holds us all together in this\nRock sex there might be on the patriots am eleven fifty\nNow traffic on the patriots am eleven fifty\nVora Caltrans doing some fence mending the left lane is shut down in the Gore won Winfrey way north found between ... road and liberty Kenyan wrote\nDue to a guardrail repair this was damaged in yesterday's plane incident countering work Ruth's been working out there for awhile and traffic is still recording leave a little bit of extra slow elsewhere and find free\nWay South Bend at the ten freeway connector in east LA a van broke down and traffic starting to stack up there when a teen freeway you spend a receipt or BLM or to stop pushing to the right shoulder is report is sponsored by DEA take back day with info and da take back dot com\nYour unused prescription drugs could end up misused or so\nShe can have them out and buy a national prescription drugs take back that\nSaturday October twenty seventh and find a collection find pang da take back doc time\nI'm Richard turn into you're listening to am eleven fifty the Patriot\nBut it's only a question of time something happens that'll make Donald Trump self destruct it never happens instead we keep watching his\nCome into Mozambique Avon upgrades big and small the game you're ready for a holiday celebration\nRight now you can get up to\nLove to have a quick way to refresh do look at your home in time for the holidays\nBlind on the interior paint brands around including\nPrimary in one options for him to be home by sure when William why showcase an infinity\nCritic self destruct Trump's opponents melt down now practically every day over the fact that Trump is melting down by melt down over the fact that they can maybe\nPrevent um select appliance special value perfect for giving your kitchen a quick refreshed or swapping out your old washer and dryer\nTrump meltdown Rush Limbaugh tomorrow morning at nine on the Patriot am eleven fifty put your best foot forward\nPercent in stockpile purchases of a hundred and fifty dollars or more all projects have a starting point\nFor over nine decades craftsman tools have been found in tool boxes and garages across the country after all these years and they finally found their way home and your local low\nTrusted in the hands of everyone from the home improvement weekend more for the pro who needs tools they can rely on day in and day out you can be sure you can trust them in your hands too so whatever\nYou're listening to the patriots am eleven fifth\nBoth provide an easy one code coverage you design inspired colors starting at just thirty four Ninety eight per can you can give the\nConversation on the day rams are showing\nSitting in for their friends in the shower and joined by Rachel cruise we're taking your calls about money life career so we talked about when we come home and show and the Rachel proof show we're here for you triple\nEight eight to five five two to five triple eight eight to five five two to five somebody's calls a day you need some help you need some clarity today's the day make the call\nNow before we went to the break I told you that I had some shocking information Rachel I cannot I'm beside myself all the excitement to let you react to the people don't notice you and I love a good spirited public conversation you know whether it be politics sports was we enjoy a\nGood ... if we can have another radio show that wasn't really revolves around money couriers target that we have a current event that would be good so she is a current survey yes\nAll right now here's or at least set the scene as of June two thousand Eighteen according to the Federal Reserve\nIn America the consumer debt was three point eight seven trillion dollars oh that's a lot of debt or to the point that some Americans responded to a survey from my bank tracker\nWe keep watching his critics self destruct Trump's opponents melt down now practically every day over the fact that Trump is melting down by melt down over the fact that they can make Trump meltdown\nLimbaugh tomorrow morning on the patriots am eleven fifty\nFox News I'm Kathleen Maloney one person or group is suspected of targeting high profile Democrats in several states with packages containing crude explosive devices\nWhat's key I'm told is that there are a number of very striking similarities with the packaging of the devices so that same sort of excessive postage or that sort of excessive yellow packaging Fox's\nCatherine heritage all of the packages were intercepted before they reached the recipients New Jersey health officials are investigating a deadly virus outbreak at a nursing and rehab center\nCan be difficult to impossible to know how the virus got to the facility what did source was her what a specific mechanism of spread is from person to person health\nCommissioner Dr Sharif el ... says seven children have died from the ad no virus this is Fox News\n[noise]\n... [noise]\nNow traffic on the patriots am eleven\nCrowded now along the four oh five north and south down between the one thirty three and jam or erode north side of the four or five is back from the fifty five up to seal beach boulevard Chevy get sponsored by ... take back that time your unused prescription drugs could end up misused or children\nShe's him safe enough to take them back at the national prescription drug take back then\nSaturday October twenty seven and find a collection signed and be a take back doc time you're listening to the Patriot am eleven fifty this reporter sponsored by fresh brothers\nPartly cloudy tonight with Lowes in the fifties tomorrow will be sunny and warm and windy with high in the eighties Sears\nOr fresh ideas reorder your Halloween piece of fresh brothers and get ... percent off your entire order but that's at all when you pick up on Halloween you'll get a treat because for free pizza pre order ... nice to have fresh brothers dot com\nDon't know how much clear I can make this but there is only one name to trust if you want to face or neck left without surgery Dr wrestler I go there and I put my name on it because I've seen the results Dr wrestler and the team in L. D. I have gotten for me so I Know that they can do the same for you I wouldn't trust anyone else with my face plain and simple tighter scanner on your\nFace snack even those lines around your mouth or eyes L. D. I. is the place\nIt's now tightening her skin is one thing but that's just the beginning of what else I can do for you how about removing those random brown spots and block you scan or the sun damage from all that California Sun oh and all those unsightly broken blood vessels LD I can help the combination of technology at L. D. I. is not available anywhere else in the U.S\nAnd if you or your child is struggling with acne Earl Daphne scars just call L. D. I. and book you're one hundred percent free consultation tall eight hundred six six six thousand eight hundred six six six thousand it's eight hundred six six six thousand or a book on line get L. D. I. dot com\nThere's nothing small about your business your passion your hours your reputation all huge\nTheir partnership even bigger\nWith small business technology advisors you'll get the tax advice and one on one partnership down through business ground\nBecause with a reliable down these with endemic or processors you can focus on what matters getting business down\nA seventh heaven by down to speak with an advisor today that eight seven seven by down\nWhen the need for senior care arises there's no place like home your loved ones should never have to give up living at home\nVisiting angels will provide home care for your mom or dad at home up to twenty four hours per day including personal care meals and light housework you'll select your professional caregiver with visiting angels look up visiting angels dot com or called eight seven seven\nThree seven four live that's eight seven seven three seven four live franchises are available visiting angels America's Choice in senior home care when it\nComes to retirement people often wonder do I have enough to retire and how can I maximize my retirement income at money matters our retirement specialists can help answer your questions visit our website at money matters dot net are called eight hundred nine nine four oh three oh two to meet with one of our trusted financial advisors\nIf you suffer from dry associated with primary Schober an syndrome you may be eligible for a clinical trial the trial locations are in Glendale Torrance juice and garden grove please go to your solution dot com again your solution dot com to learn more about this investigation all new treatment for dry\nThis is the Patriot am eleven fifty [noise]\nThem about your life and your money I can show serious XM Ramsey solutions\nAlso city in Studio with me this hour is Rachel cruise host of the original crew show and author of the best selling book love your life not there's we're taking your calls this hour about money life career it's all open\nMaybe today's your day Tripoli eight to five five two to five triple eight eight to five five two to five get clarity that you need she can confidently step forward and courageously stay on the path let's go to Chris who is on the line in Miami Chris how can we help\nAnd thanks for taking my call jerks order the original fake it\nGo ahead how can we say\nOh well I'm just a little bit of a ... I'm calling for career advice I'm twenty eight years old I've been working in bank on which are there are several years and I've been able to narrow down my passion which is a new furniture coach hoping people go blow\nBut in my current role my comfortable on the line with uh the ones that work um ... thanks are\nWe back it's very heavy on language and sometimes I don't think that the right thing for for everybody [laughter] so I find myself talking to people how to read another teacher ... and my question is how can I pursue like crash of the financial coach without a huge cricket\nWell what do you make right now and he thought well OK so first of all I think you need to to a deal with the guilt\nI absolutely love where you're coming from and your values and I understand you're having to sell something that you don't believe in\nBut in in the temporary a you know don't take on this massive guilt what you want to put your interview on right now is\nHow quickly can replace that eighty thousand dollars so that I can step over into the uh financial coaching space or or like one of our smart investor pros your Dave Ramsey fan you're part of the tried you know about are smart best prose and I think one of the first piece of advice I Would give\nIs to go sit down with one of those folks locally in uh Miami area of all those folks are listed on the website I'd find two or three of them tell them you're Dave Ramsey fan tell them your situation just the way you laid it out to us and and say can I take it a lunch or take you to coffee and learn the best path\nTo get where you're at to do something similar they're going to give you some very very practical\nOr knowledge and some next steps then you can do your own homework\nHow much training how much qualification certification whatever that is that you need to be able to do that that's something you can do and then once you know that you say OK how much is that going to cost me from a financial standpoint and then from a time standpoint these are basic\nResearch questions\nAnd so once you get the answer to that you've got the formulation of a plant and so you take that wisdom and knowledge from somebody who's actually doing what you want to do and then go do your own homework on what is going to take and you've got yourself a timeline an action plan and and then to to the extent that you can go work for one of those people\nAre and go work in a space like that and get in proximity and learned the process and get good at it uh and when maybe you're doing your own thing one day is that something you'd ultimately like to do is have your own business\nThen I think twenty eight I Would do it for somebody else for a while and work your way up and are you wanting to be a financial planner or a financial coach a parent or coach\nCoach okay 'cause a financial planner you'll have to go get your CSP and like there's a lot of that stuff\nDown the ... said that start you want to go down totally agree but the financial coach it's more almost like a counseling you know type of situation\nA cause you'll have to get referrals and all of that so I Would definitely say we have a lot of those that have gone through our financial training our financial um master coach training here ... I Would say that's a great first step to uh to come here go through that training Chris Hogan teaches a lot on that and it's phenomenal\nAnd so go through that and and try to figure out people in your area that are doing that and then even get connected like even some churches some places that will have\nPeople in the family that need this specific help that that they can give you the referral a cause that would be huge as well so that that takes a little bit of time to kind of build up your book a business that I read that financial coach but it's totally doable and to make that money for sure and salad I definitely would go through our training on that route\nAnd I think you bring up a good point racial Chris at twenty eight I think you do need to look at the differences even if they're somewhat nuanced somewhat specific between the coach\nAnd the plant or because I think you can be a financial planner and make that money a lot faster and it's still a coach me Dave says all the time\nWe go sit down with Jeff do bonds and his team that's that's one of our local guys if I sit down with Jeff and I we want to know that he's got the heart of a teacher well that's ... right so I Do think you've got to do some specific research there Chris to be able to determine what does it look like day to day what do I want to be doing day to day that fulfills me\nAnd at twenty eight you have plenty of time to get there are but in the meantime while you're pursuing the plan I Can't say this enough you're not being dishonest\nWe spent the entire episode talking about everyday millionaires so what does it look like to build wealth millionaires look like the mists around that the truth around that and it's so great like we even sit and George Campbell our very own one here at the day Ramsey show out in the streets nationally asked people I have to like for instance your job\nWhat do you think a millionaire what had our jobs are and it was like doctors lawyers movie stars right like all the answers but the truth\nIs so different it's all in the book every millionaire so I was just really encouraging like you said everything from their job their salaries these people they are not what you would think are the millionaires but the average a millionaire millionaire out there in America looks a lot different than what you probably have in your mind and so it's really close to the whole episode yeah we have fun talking about\nDid you how to be ... because when I was on your show it was used they used to hang it for ... for the first woman bring you\nKnow about and he should've brought me money what if the millionaire show me a million dollars in a crowd in this will be ready for cash ... original crucial [laughter] so you if you pay I'll I'll give you\n... are you too far far too too far but you Gilbert\nCheck it out sorry and you'll see when Facebook where workers yes maybe you Amish and your shows going well too\n... down one Twenty one two hundred and thirty ... sorry ... percent back to your calls Tripoli eight to five five two to five triple A. D. too far far too too far is the number Lauren is up in Atlanta Lauren how can we\nThink that they want to call Cher well my husband and I learned more young I'm twenty four twenty effect and I only get less than ... by some family and so we don't have any that our houses paid off all that stuff we don't know what to do next [laughter]\nAren't you earn a spot where do you say that what do you mean you don't know what to do the Irish are saying well what does it means what your next goals are that what you're asking\nYeah yeah I mean we don't make a ton of money on a teacher and he's a ... or so yeah our but our family hid grandmother really financially sound\nVery cool so is this a financial cushion or career course you know finance or thing in our careers [laughter] okay ...\nOkay well I Would say are baby steps learn if you know is passed baby steps three which is to say three to six months of expensive and the bank do you guys have that cash available\n... okay so you have thirty six months of expenses so that's done so then I Move on the baby steps four or five insects forests are funding retirement whatever you guys make than than you know start going into funding retirement so you're a ...\nA four oh three ... is that whatever if there were ... if your husband's church as a pastor has a retirement plan plug into that but the Fifteen Percent into retirement and then what do you guys have kids\nYou do yes that yes no no no kids I'm Sorry no cats okay so then you skip baby step five which has kept college you'd skip baby steps six 'cause it's done which means are near um baby step seven right now so that is just knowing wealth and giving which is a pretty awesome spot to be so what I Would say for you guys is funding out retirement\nBut then also have similar goals that you guys want to me because I'm you know there's there can be this monotonous state that you get in\nWhen you don't have any debt or a house payment none of that and you're just putting money away\nAnd savings and it's just kind of like okay it's just there so you need something exciting that you guys want to do whether that's a vacation you want to take maybe at ... we went to upgrade our home in five years and can we cash flow that can we go next Kobe are upgrade of our house we are going to complete we're never going to go into debt like bless your grandmother is like I say\nWe're going to know that if we sell our house put money towards that so still have some things are working towards because that makes the saving money fund versus going just those black hole account and so for you guys to your lifestyle keeping in check like you don't need to go strap against\nMaybe you know you could up at a few a few percentage points each year as your income grows that's totally fine enjoy that because you guys are at that spot I'm but have that savings gold went there and I'm\nYou know we we definitely have a couple now we're like okay what do we want to save toward because again like I said it can kind of be monotonous of just putting money in savings so having those goals for you guys as a couple and as a family is huge and last but not least learn and it's the first thing we always talk about but it's true as gifts\nYou're at a position that you have to do some really cool giving because you guys have no payment at all not even help paying that much of anything goes out in a while do really the big things you can do now invest safe for something in the short term that you guys are looking forward to and ...\nWe know cross over and talks a lot about this or do you do as well I think we need to do next is go to a very nice dinner\nCandlelight dinner and take a pad of paper and dream all but they're very me because essentially what you just laid out was dreaming yet and I think they're in the position of actually really dream\nAnd even about giving and then maybe your homes to was that your deal you want to buy when and what happens is now that you're in such a great position you're going to get their way faster than you thought but this was a season to dream\nAnd it and for anyone out there like this is something that couples especially if you're married ... if you're\nIf you're like us which I think you are you have three kids one but it's like every day it feels like your alarm goes off you wake up you drink your coffee you get ready for it you get the kids up to get them out the door and how low toward my roof you come back I mean there are things like that you know you go home you get kids going to throw in the bath tub ones running out naked you're trying to get him back in the ... mine are\nLike fast foods they\nLike it is and you finally get 'em in bed and you're like oh\nWhat did happen like and you can live in that state for years and you never look at a couple of like what we want to look like in five years and that's the fun part Chris does it and it's true isn't it fun marriage you guys like you get to build your future together so\nLauren her husband need to do that debt free but also if you're in that still have those three meetings and dream 'cause that's fun to be able to like what do we want to do even if it's our dreams to be out of debt and Eighteen months that's an awesome dream go for it\nYeah and if you can make a very key key point I Want to drive is home to folks some of the out there don't have a lot of hope and it's because you're not focused on a vision\nSo there's a psychology study up there it's very well known and uh it's it it shows that the brain what it focuses on we tend to see you notice when we didn't see before and here's an example of the study that most people get when you go buy a car\nYou buy that car lot you drive it out and how many times have you done this and you see it everywhere for the next game have you noticed oh yeah totally so that's real it's a real effect yet and what's happening is is the brain has been so focused on his new car purchase you want to do you look forward to it so much then you go buy it and you're so excited about it\nAnd then all of a sudden you never saw before\nBut it's materialize in front of you it's always been there but you weren't focused on ... so to your point\nThat applies to this idea of even if you're just just completely covered up and debt right now maybe your baby step one you just got to know Dave and you're you're doing the steps\nIf you can have the meaning that you talked about ... what it does is it allows you to see the end of the baby steps and when you can see and focus on this desire future phrase reuse around here all the time yeah then your brain will begin to see the baby steps in the sacrifices me opportunities to do the long haul stuff to get you there\nThat's the key it's not just as fun romantic dream searching each practical it's what keeps you in the game\nOh absolutely and I said earlier on and say it again because I'm about ... around here it is literally be like okay well we're the feet you're you guys were you know wherever she said twenty twenty three you know thinking about Thirty years when you're fifty three like what do you want it is great\nOn my mom a big thing George crews were hanging out with me on thank a teacher James child our associate producer ... Manuel and most of all\nSo much to show [noise] [noise]\n\n[noise]\nYour dream job", "year": "2018", "show_name": "The Dave Ramsey Show", "city": "Los Angeles", "day": "24"}