{"month": "10", "state": "CA", "station": "KEIB", "content": "It's a bad when you run out the costs to capitalize on the car fleece and you find out the average person who could pay cash for carbon instead is placing the car their costs to Capitol translation their interest rate is up or to fourteen percent on a typical car place and that someone with a one credit\nAnd so the math is bad so bad product\nThat comes from report smart money magazine my calculator will tell you the most expensive way to on the cars to police it right and so the math is bad so if you sell those things and you know the math is bad that put your morals and your ethics in jeopardy\nIf you don't know and you're just honestly stupid and you're just honestly stupid I've been honestly stupid\nTime or two in my life been a long time I don't do that I certainly don't do it anymore but I mean I've done some not that many things that I didn't know they were bad\nFor I Believe they were good and I'm telling everybody go do and I don't go borrow your mortgage I did that when I was Eighteen years old I'm a real estate license go get your thirty your mortgage what I was there but the math is bad and bad advice from an Eighteen year old over engine run it\nHey you you want to actually ocean right [noise] and all that stuff oh God do them I got to do the math ...\nRamsey showing them with you before you know it in the meantime remember there's ultimately all\nThe financial base and and that's the one day be priced you ...\nHey guys like confidence senior executive producers they were able to show this hour the show is over but don't forget about her YouTube channel where you can submit show questions or\nIt's part of our commitment to make a show of\nAll it takes is one emergency trip to the dentist to blow your budget quickly now I'm not a fan of dental insurance I think it's a waste of money but there is another option it's called one dental and it's not dental insurance one dental as a discount program that functions like a membership clubs think of it like Costco\nYou join for a small yearly fee and you say big time every time you use it I'm Talking discounts on all procedures from routine cleaning ... all the way to root canals plus\nYou can choose from tens of thousands of Dennis from all across the country including orthodontics for\nKids and adults and if you've already been told by a dentist that you need a procedure but you haven't gone yet it's not too late to say join one dental schedule your appointment with a one dental provider and save big instantly know waiting just instant membership and\nInstant savings folks one dental is a smart decision for you and your family start saving debate at one dental dot com that's one dental dot com\nK. E. A. B. Los Angeles this is the Patriot am eleven fifty broadcasting throughout the south land and all over the world I heart radio [noise]\nSounds or a confirmation vote I'm rich Dennison Fox News emotions are running a high a heck of a critical confirmation vote on Supreme Court nominee Brett Kavanaugh\nDueling activists converged on Capitol Hill supporters urging senators to stand with red\nAnd the other side critics are calling on senators to cancel Kavanaugh\nAngry but Senate majority leader Mitch McConnell says lawmakers will not be intimidated\nCan only be scared about all these people rampaging through all\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAnd bans is Katie I'd be in Los Angeles and dreaming audio and patriot dot LA's preempted do this for the program a\nK E R B will resume streaming audio and the conclusion of the game ... I'd be Los Angeles is dreaming audio and patriots LA's preempted sports programming kinky id will resume streaming audio at the conclusion of the game\nIs ... I'd be Los Angeles streaming audio patriots LA's preempted due to sports programming\nK. E. I. V. evil resumes streaming audio at the conclusion of the game\nThe\nBass is K. E. IP Los Angeles streaming audio and patriot donnelley's preempt into the sports programming kinky id will resume streaming audio at the conclusion of the game\nIs Kay eat I be Los Angeles streaming audio patriot dot alleging preempted due to sports programming\nCan eat I'd be evil resume streaming audio at the conclusion of the game all [noise] best is Kate I be Los Angeles streaming audio patriot dot LA's preempted due to sports programming\nKatie id will resume streaming audio at the conclusion of the game\nThe\nMan is K. E. I. B. Los Angeles or dreaming audio at patriot dot L. A. is preemptive due to sports programming Katie id will resume streaming audio at the conclusion of the game will best is Kay eat I'd be Los Angeles streaming audio and patriot dot LA's preempted due to sports programming\n... id evil resumes streaming audio is the conclusion of the game\nBasses eight I be in Los Angeles and streaming audio and patriots LA's reinstitute a sports programming\nK. E. R. V. will resume streaming audio at the conclusion of the game band is Katie I'd be Los Angeles\nDreaming audio patriot dot L. A. is preempted due to sports programming K E R B will resume streaming audio at the conclusion of the game the best is K. E. I. B. Los Angeles streaming audio at patriot data LA's preempted due to sports programming\nOr Katie id will resume streaming audio at the conclusion of the game fast as ... Los Angeles and streaming audio patriots LA's preempted due to sports programming Kiki ivy will resume streaming audio at the conclusion of the game\nAnd the men\nThis K. E. I. B. Los Angeles streaming audio at patriot LA's preempted do the sports programming K. U. I. V. will resume streaming audio at the conclusion of the game\nAnd the best is ... I'd be Los Angeles streaming audio and patriot dot L. A. is preempted due to sports programming\nGE I'd be evil resume streaming audio at the conclusion of the game and\nThen this ... I'd be Los Angeles streaming audio patriot dot LA's preempted due to sports programming K E R B will resume streaming audio at the conclusion of the game\n[noise]\nBand is Katie I'd be Los Angeles dreaming audio patriot dot L. A. is preempted due to sports programming\nK E R B will resume streaming audio at the conclusion of the game best is Kate I be in Los Angeles streaming audio and patriots dot LA's preempted due to sports programming K E R B will resume streaming audio at the conclusion of the game\nBest is K. E. R. I. B. Los Angeles\nI'm streaming audio patriot dot L. A. is preempted due to sports programming Kiki id will resume streaming audio and the conclusion of the game fast is K. E. I. B. Los Angeles streaming audio patriot dot allies preempted do the sports programming\n... id evil resumes streaming audio at the conclusion of the game [noise] best is Kay eat I be Los Angeles streaming audio at patriot dot LA's preemptive due to sports programming\nKiki id will resume streaming audio at the conclusion of the game\nIs Kay eat I'd be Los Angeles streaming audio patriot dot allies preempted due to sports programming K. E. R. I. B. will resume streaming audio at the conclusion of the game\n\nBest is K. E. I. B. Los Angeles streaming audio at patriot dot LA's preemptive pseudo sports programming\nKatie id will resume streaming audio at the conclusion of the game for best his case I'd be Los Angeles streaming audio at patriot dot L. A. preempted due to sports programming K E R B will resume streaming audio with the conclusion of the game\n... ... fans is Kate I be Los Angeles and streaming audio patriot dot L. A. is freedom to do the sports programming\nKatie id will resume streaming audio a different conclusion of the game\nFor the best\nIs Kay Ivey Los Angeles streaming audio at patriot data LA's preempted due to force programming K E R B evil resumes streaming audio at the conclusion of the game for best is Kay eat I'd be Los Angeles streaming audio patriot dot LA's preemptive due to sports programming\nKatie id will resume streaming audio at the conclusion of the game best is K. E. I. B. Los Angeles dreaming audio patriot dot L. A. is preempted due to sports programming K E R B will resume streaming audio at the conclusion of the game\nPasses K. E. I. V. Los Angeles streaming audio patriot dot L. A. is preempted due to sports programming can eat id will resume streaming audio at the conclusion of the game\nMasses K. E. I. B. Los Angeles streaming audio patriot dot L. A. preempt into the sports programming ... id will resume streaming audio at the conclusion of the game\n... I'd be Los Angeles streaming audio patriot Donna LA's reinstitute a sports programming occasionally I'd be evil resumes streaming audio at the conclusion of the game\nAnd\nThen there's ... I'd be Los Angeles streaming audio and patriots dot L. A. is preempted do the sports programming geeky I be evil resumes streaming audio at the conclusion of the game and passes K. E. I. B.\nLos Angeles streaming audio at patriot not LA's preempted do the sports programming\nKatie id evil resumes streaming audio at the conclusion of the game [noise] basses K. E. I. B. Los Angeles streaming audio patriot dot L. A. is preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game\nThe\nIs Kay eat I be Los Angeles and streaming audio and patriot dot alleging preempted due to sports programming J E R B will resume streaming audio at the conclusion of the game\nPasses K. E. I. B. Los Angeles streaming audio and patriot dot LA's preempted due to sports programming ... I'd be evil resumes streaming audio at the conclusion of the game the best is Katie id Los Angeles streaming audio and patriot dot\nA preemptive due to sports programming K E R B will resume streaming audio at the conclusion of the game and bad ... I'd be Los Angeles streaming audio at patriot Donna LA's preempted do the sports programming ... id will resume streaming audio at the conclusion of the game\nBans is K. E. I. B. Los Angeles streaming audio and patriot dot L. A. is preempt into the sports programming\nTo eat I be evil resumes streaming audio at the conclusion of the game and the best is K. E. IP Los Angeles streaming audio and patriot dot L. A. is preempt into the sports programming kinky id evil resume streaming audio at the conclusion of the game\nIn this case I'd be Los Angeles and streaming audio patriot dot LA's preempted due to sports programming K. E. R. I. Beagle resumes streaming audio is the conclusion of the game\n[noise] best is Kay eat I be Los Angeles dreaming audio at patriot dot LA's preempted due to sports programming Kiki id will resume streaming audio at the conclusion of the game and\nThe\nMasses K. E. I. B. Los Angeles for streaming audio and patriot dot alleging preempted to to sports programming Kiki id will resume streaming audio at the conclusion of the game will\n[noise]\nBasses K eat I be Los Angeles streaming audio expatriate donnelley's preemptive due to sports programming shaky ivy evil resumes streaming audio at the conclusion of the game\nIs K. E. I. B. Los Angeles streaming audio patriot dot ... preempted due to sports programming GE id will resume streaming audio at the conclusion of the game\nThe best\nIs Kay eat I'd be Los Angeles streaming audio patriot dot L. A. is preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game\nTo make certain that they ride herd on this particular vote we want Kavanaugh to come through last week\nFreedomworks we had two thousand people on the Capitol Grounds pushing through not only Jim Jordan who I can be the next speaker of the house but also we wanted those elected officials who should be responsible\nTo the American people for the opposite they old to make sure that they go and do the job that we sent them to do it's a long way from when I was president of the N. double ACP twenty seven years ago\nTo where I Am now and that plantation that Reverend Peterson was talking about the jets the lady was talking about by the way Jesse leaves in my movie runaway slave or just\nLeave on why am I not in your movie what's up with\nYou and I have to make the next film together Sean we have to make the next\nI don't know I I'm just wondering why you picked Jesse and you didn't pick your friends Sean Hannity\nYou're about to go about it you gotta come on the show real so what that plantation was real I grew up during that same Jim Crow era it's very real but many of us have run away from it\nAnd we encourage many more at this point in time in America and the president is giving us all the caliber of it's necessary to run away from that type of in slate but if this nation that following up under\nYou know the attitude at the beauty of what President Trump is jarred is that because he lack fear he's put country first he's not afraid to really deal with people is not afraid to use social media to put the truth out there and just credit isn't cars you know a lot of men and women\nFetch and those are good to stand up and speak a fight for their country fight for what is right\nAnd when they saw this attack on judge Kavanaugh his wife\nHis daughters while they're saying that they care about women they care about children we actually love compassion for the judge and his wife his children I got to have to deal with these allegations\nThis whole thing has the now we've got to get through the vote tomorrow and I am cautiously optimistic that judge Kavanaugh gets to be on the court that he deserves to be on\nWhat if we don't deal with the these tactics the willingness to tear down bludgeon destroy men families kids are obviously impacted by it if if they can't even have the most simple as the civility on these issues\nYou know the American people need to see it no it get it understand it embrace what they would be voting for it's horrible you know destroying people it's horrible how many more people have to go through a Clarence Thomas judge Kavanaugh Robert Bork\nHow many Republicans are falsely accused of being racist and wanting to kill their grandmothers it's ridiculous at this point\nAnd they do it with literally with them to ... but that is total immunity for them there are no repercussions for the conduct anyway Reverend Jessie Molly Peterson thank you Robert CEO Brian thank you and uh we wish you both the best\nAs the countdown now continues we'll know almost a this time tomorrow the judge Kavanaugh get on the court looking a lot better than it did earlier this week\nUh earlier in the wake alright let's not want to remind you about the USCC a look if you are responsible gun owner you need to get from them they're free shocking true stories\nOf self defense it's an audio book you get a free also they'll give you their critical self defense survival guide and you can get a just by ... the word free F. R. E. E. to the number eight seven to two to tax the word for it to the number eight seven to two to true stories about how\nLaw abiding American citizens were able to thwart violent attacks and by the way you'll be more shocked to discover what happens in some cases after\nBecause one mistake to make the difference between freedom or a jail cell for the rest of your life don't leave yourself vulnerable learn the rules about being a responsible\nGun owner when you can and cannot shoot what if you're involved in a shooting somebody breaks into your house what do you say that the police when they arrive how do you deal with the legal aftermath\nAnd don't forget the also give you their bonus deadly force checklist right three lifesaving tools one hundred percent free text word free F. R. E. E. too the number eight seven to two to ... to eight seven to two to eight seven to two to\nStay on and you knew someone was going on here this is Sean Hannity show [noise]\n\nPresident Trump and congressman Kevin McCarthy are working together to keep the Republican majority in Congress together we must protect the house instead of giving you back your money with historic tax cut your jobs was drunk or trade deals and your security\nWith tough border enforcement the Republican Congress is taking power and money\nFrom Washington and giving it back to you but Democrats think your money belongs to government the ones who raised taxes protects criminals was things were cities and reverse the twenty sixteen election within beach but that's\nThe Democratic agenda the only way to keep these Democrats from raising taxes is to do your part vote for Republican Congress on Tuesday November ... President Trump and congressman Kevin McCarthy for ... house pits majority to for a for a for a for more information that's majority to Laurie Laurie Laurie\nStandard data and message rates apply many package responsible for the content of this advertising on the committee and not authorized by working just make one more I hold on the ...\n[noise] by hand\nAny tonight nine eastern on Fox All right so the vote so they're off I'm not trusting anything until the votes are cast\nA Senator Lindsey Graham Senator Ted Cruz a break Jarrett Sarah quarter Janine peiro match slapped Tammy Bruce Herman Cain all coming up Hannity unimportant opening monologue tonight how the brutality and the blood Janine needs to end nine eastern on Fox hope you'll join us [noise]\n\n\nIf if you owe any money to the IRS you need to call this toll free number right now eight hundred five one one to zero eight for that eight hundred five one one to zero eight for Uncle Sam has the power to make your life miserable\nYou could stop the collection process right now by calling eight hundred five one one to zero aid for that's eight hundred five one one to zero eight for when you call the tax support group you'll get free information on how you can reduce your back taxes including penalties and interest\nYou could also be helped if you have an found returns attack saline wage garnishment bank levee board if you have entered into a payment plan and can't make the payments\nStop Uncle Sam right now make the free called that could help you and the worry today eight hundred five one one to zero late for that eight hundred five one one to zero eight for eight hundred five one one to zero eight for eight hundred five one one to zero eight for\n\n\nThose are two of votes I'm rich Dennison Fox News the Senate scheduled to vote tomorrow on the confirmation of Supreme Court nominee Brett Kavanaugh whose path to the Supreme Court appears to be assured after two more senators say they'll vote confirmed the judge boxes Jared helper and joins us live from Capitol Hill\nGo to class nobody takes Romania there's nobody looking over your shoulder\nYou can like be a grown up if I could just get the college I'd be happy then and and then you get to college and you go man this is hard\nIf I could just get out of college and get married and have to point three kids and buy a house on the street with a picket fence and start my life I'd be happy then you get out and get married to a to point three kids you know I Want to go back to college that would be happy [laughter]\nHave you ever noticed that happiness is a bully in the schoolyard as soon as he draws the line with his toe in the sand is just cross this and we'll fight you step across that line he backs up and they draw the line\n\nYou cannot buy happiness with money you can even chase it down 'cause it's always moving you can buy fun it is a\nBomb on to go on a really nice Cruz is bomb on to go to ... bay and dive one of two underwater national parks the other one's key Largo in the nation\nIt is fun to see the Hubbard Glacier in Alaska it is fun you can buy fine\nBut you can't buy happiness\nThe most powerful financial principle you will ever learn in a culture that is full of angry people\nIn a culture that is full of is ... sexism racism is ... everywhere in a culture full of mean angry disjointed toxic people\nThe most powerful financial principle you'll ever have\nIs this one contentment\nWhen you are content to just be then you're not at the Beck\nAnd call of a bunch of people telling you how to live with the way they live on Facebook they're highlight reel is on Facebook nobody really lives that way\n\nYou don't have to do what other people think you're not driven by other people's opinions and you're not chasing happiness\nWhich is a bully in the schoolyard when he draws a line in the sand he'll back up and say I'll be happy when I get to a new car I'll be happy when you want when I get to go on vacation I'll be happy when I get to quit work and stay home with the kids know you won't\n\nHappiness is not a destination you can buy a fun with money and I don't mind you're doing that\nBut we're you'll get in trouble is if you get confused because if you get confused between fun and happiness you will never achieved contentment and if you never achieved contentment you will always be in debt because you'll always be buying stuff with money you don't have\nStuff you don't need with money you don't have to impress people you don't even really like 'cause I'll be happy when\nI'll be happy when famous last words of broke people\nContentment content people once you reach a level of contentment you can get out of debt pretty quick because you certainly don't care what other people think and you certainly don't even care what you think you're just like it's going to be OK I'm All right\nWhen you reach contentment your generosity goes way up because you don't feel like you have to have that money to be happy when when you reach a level of contentment you're investing level goes way up and the weird thing is is your wealth level will go up you have a higher propensity a higher probability statistically of being wealthy by\nThe content was not being wealthy [laughter] bedroom\nWith a savior able to avoid that you're able to increase your generosity\nAnd you don't live your life in this costs the state of dissatisfaction saying\nI'll be happy when [laughter]\nThis is the divergence [noise]\n\n\n\n\n\nJessica on Twitter asks if certifications or trade schools are a good alternative to college well Jessica they absolutely are but even better is getting career focus training from my friends at career staff career step all first training to\nQuickly prepare you for a career in healthcare that will get you a job you may even get to work from home and get this careers that helps with job placement for a special offer visit career step dot com slash Dave\nHey this is Rachel ... that is always drilled into us that you can buy quality things and they'll get a great deal that's why I loved tough needle mattresses ... offered amazing matches it's for every budget\nAnd now they have a brand new mattress called ... they took their best mattress and made it even better it's incredible tried tested needle for a hundred nights risk free at ... dot com that CNN dot com I don't remember it's tips for free at the end dot com\nWe use the phrase part of a teacher to describe our real estate ... because we only endorse agents who care more about helping their clients that are earning a commission\nBut you don't have to take my word for it here's what Paul one of our listeners from Boise had to say about is a Yale be part of a teacher is the perfect description for Matthew the E. L. P. I used to sell my home\nHe helped me through the frustrations of working with an uncooperative bank and addressed all of my concerns in a respectful and compassionate man or a display great integrity and did what he promised when he promised he would do it is positive attitude and infectious spirit\nLifts everyone interacts with your email be far exceeded my already high expectations about can we take our endorsements seriously\nAnd we only recommend the real estate agents who will far exceed your expectations go to Dave Ramsey dot com and find the real estate he'll be in your area\n... Senate Democrats up for reelection this year in deep red state space a nightmare decision on how to handle Kavanaugh vulnerable Democrats are hoping\nRepublicans will force him to withdraw his nomination allowing them to avoid politically device seem much this is an important point it has not been stressed enough capital won't came and a number of arrows they have in their quiver ... is the wind link\nRush Limbaugh he's in the mornings and not on the Patriot am eleven fifty\nNow traffic on the patriots am eleven fifty\nSimpler it's been issued in North hills for the north bound for a size that Roscoe we've got a wrecking the carpool in fast things in a back up to ... Catholic sponsored by ... valley nursery little valley nursery\nThe largest box the grower in America is now offering up to Fifteen Percent off on the order just include free planning on all that's an inside treats past warranty in the industry in a free design consultation\nMove valley grows the designs and plans for sale details visit moon valley nurseries dot com you're listening to the Patriot andme eleven fifty am eleven fifty [noise]\nWas glad you are here but NASA in Miami, Florida five an hour you\nHave to pay them when they're far thanks for taking my call sure what's up [noise] so I've been here that's how we find our children I'm from Florida prepaid college\nPlanned and my husband and I were both making more money at that time and since then our income has gone down and we added another child and we've gotten into San credit card debt and they have a car loan now\nUm we can take the money out and we have invested over the past three years without penalty should we do that or should we just have hard that can leave that money and continue country\nInto their prepaid grand how much is in there [noise] um about eighty six hundred\nEighty six hundred dollars and how much do you own your car\nWe at a time dad Ronnie and what do you own your credit cards a bipartisan\nOkay and um are you guys on a budget in reducing debt already\n... and that's and I realized when you get that and he got out of order like having a pan ... pan and then I don't know what to get that point gotcha okay [noise] um and your household income as well [noise]\nI wouldn't do that personally and if somebody asked me as a financial so that they do that I Would say no\nSo I I Would take the majority or all\nThanks for calling in to the news to have a blessing like that so\nThis is the Ramsey ... [noise]\n[noise] I get a lot of calls from listeners not knowing what to do with their timeshare I don't care of the reason you want out is because you were duped you can't afford it you inherited it the smart thing to do is just get rid of it they're horrible they never live up to the expectations\nThe resorts sat and the only way you're going to exit you're timeshare safely legally and forever is with time share exit team they have offices all around the country where you can sit down face to face and review your contract to find a solution they've accepted thousands\nOf timeshare owners this year alone they're the best in the business because they simply have more options for exit than anyone else it\nCould be a long process but there with you every step of the way and timeshare exit team is so confident in their exit service\nThat if they don't get you out you get a full refund called eight for for nine nine nine ... and schedule a free consultation eight for for nine nine nine ... or\nTimeshare exit team dot com\nWe predicted that has never graduate on the on that is fine with what they asked for they ask for an additional week um FBI investigation they got it immediately after getting a base that uh we wouldn't be long enough\nThey don't we bring it to what everybody comes back and change the Democrats are going to say it's tainted because they didn't do a thorough enough investigation everything that we've redacted is\nComing to pass on the Democratic side\nRush Limbaugh he's in the mornings and I found the Patriot am eleven fifty\n[noise]\n... Brent Kavanaugh becoming the next Supreme Court judge Maine Republican Senator Susan Collins will vote to confirm saying she believes Christine Blasey Ford was sexually assaulted but doesn't think there's enough evidence to show was camping on\nTheir final nano legal ... ... a bad deal traffic has\nStepped in and and fair that guilt bear on night things\nHave to send an owns the confirmation both tomorrow starts in the lord but the Dow closed the bumped its worst levels the down down a hundred and eighty points to ... report played a role although\nThe jobs are hard Keenan lower than expected for September there were a number of jobs created for July August are further behind the economy is still going strong bunkers\nChristina parts of the ... the NASDAQ fell Ninety\nOne the U.S in the last six Steve this is Fox News [laughter] [noise]\nNow traffic on the Patriot am eleven fifty\nEncourage than we've got a record in the south down four oh five an Avalon vilified clarinet as far left lane has got traffic jam from the window five this traffic censored by Walgreens protect your world\nGet your flu shot today at ball dreams and receive a coupon to earn ten dollars reward on your next purchase of thirty dollars or more reward valid on future purchase vaccine restrictions apply turns and restrictions apply to coupon\nYou're listening to the Patriot am eleven fifty but you go this is the Patriot am eleven fifty\nJake he follows me all the way to Dave Ramsey eight hundred thousand\nOf you do what's your opinion of buying a vacation home with cash in than renting it out when you're not there [noise]\nNothing wrong with it at all with cash and your debt free everything about that when your homes paid for everything else is paid for a vacation home is a wonderful extra as you start buildings from wells but basically what is it it's a very large toy\nVery expensive toy that goes up in value hopefully and if you rent it it might make you some money\nMy family not me my family the rest of them most of the rest of them including the grandkids just spent a week down at um\nWas Rosemary beach Rosemary beach the other day and I rented a house on the beach really nice big expensive multi million dollar house for the week and obviously some people on that and rented out by the week I'm here's the thing about resort rentals\nVacation home rentals um you're going to make some money on it but you're not gonna ... you're going to make usually enough to\nAfter you pay all the fees for the maid service and the you know resort rentals aren't like a traditional rental where you know for ten percent or something you can get the property management usually take half of it to manage it and that covers you know made service and that kinda stuff and then there's a whole bunch of the time it's not rented\nAnd so while you do get a great rate per week during a high season with a ski house or your house and the mountains for ... for snow skiing or a beach house or something along those lines\nYou're you're not going to get rich on rent it out you really not I mean it's not gonna it's not really a great investment property it's more of a way to offset some of your annual costs of your toy\nIf you look at it that way you won't be disappointed but if you actually run the numbers out you're not going to be thrilled with it as an investment you're better off to just buy investment property it'll make you more money per ... per dollar invest it\nAnd it's not as volatile and you don't come in and you know runners and you know vacation runners haven't torn up your stuff or spilled want on your carpet or whatever\nAnd I know that there is a deposit and I know this stuff gets fixed but I also know people are living in their sleep and in your bed\nAnd you just have to think about that you know and you know\nIt's just it's the way it is an even a nice home and he'd been nice people like the Ramsey staying in your home we weren't we didn't tear up stuff we're not like he wasn't a frat party in there it was you know babies and\nGrandma ... and that kind of stuff in there so he running like that but you know stuff I I don't think we broke English stuff gets broken and you just got to know that and for for some people\nAnd we put it this way for Sharron Ramsey to walk into the place where she wants to go on her second home as a vacation and someone else to have been in there and some of the stuff is out of place or broken or dirty it would kind of take a lot of the joy out of it for vacating there for her\nAnd so you have to think about that yeah that's a price you pay to rent it out\nAnd ah all of that to say it's not an ideal investment property it's more like a way to cover some of the cost of your way if you want to rent it out we've got a uh like house we don't rent it out we've got a condo in another city we don't rent it out\nAnd um so it has to be a our income and our assets have to be large enough that we can accept that thing just sitting there in the months that are weeks that we don't use it\nAnd um but it is in both of those cases there are a very small percentage of my overall net worth and so there are toy it's just a toy that happens to go up in value in both of those cases that's kind of a nice part of the toy but it goes up in value and I still have to do the maintenance on it and fool with it\nAnd you know going in you know the the condo the other day we stopped in there are going to get a condo over in Knoxville in one of the ball game over there and the he narrows out so it was hot air conditioner was\nVery well done sir you are way ahead of the curve congratulations thank you well what we teach folks is to follow a plan we call the baby steps we think it is the shortest rate shortest route to wealth\nOkay and a baby step one is a thousand dollar saved too is that free but the house you've obviously done those three as an emergency fund of\nThree to six months of expenses you've obviously done that\nFor five and six you do simultaneously that's Fifteen Percent of your income going into retirement is maybe step for five is kids college doesn't apply here six is pay off I'll surely so that brings us into our question now\nThe way I look at paying off your house with a non retirement non emergency fund money which sounds like if I heard you right you've got fifty five K. and miscellaneous investments that some non retirement and not your emergency fund is that right\nTrack and you oh eighty on your house did you say is that right\nYup okay and um\nThe uh the way I look at that is if you owed\nThirty thousand bucks on your house\nWould you go borrow fifty thousand to invested in stocks and bonds and my answer will quickly be no\nYeah and in essence if you do a column of your assets and a column of your liabilities and boy you own and what you owe that's called a balance sheet you probably heard that before\nAnd uh uh the balance sheet says that those things offset so it has the same mathematical effect as if you had borrowed on your home to buy the stocks\nThat I buy that if we if we don't if we don't use that money to pay down on the house now I Would not to clean out your emergency fund I Would be willing to take it down a little bit to three to six months of expenses it you know twenty three thousand or twenty two thousand or whatever it was might be a little sick\nI might pull that down to pin or something you'd be safe as a single guy making safety with a ten thousand dollar emergency fund\nSo I'd probably pull ten or twelve Thirteen out of that and I take the fifty five throw it at the house and you have that house paid off in a year what something else worth\nOr if they were about a hundred and ...\nThat's not bad it's only two that only three years old with a paid four hundred and ten thousand dollar house\nIt'd be pretty nice\nYou know and then take and then you take that old payment you used to have and all of the freedom that you have mathematically now in your budget and you use that that fifty five will be back in twenty minutes\nYou'll be amazed how fast you can rebuild and how fast you can build investment portfolio when you don't have any payments at all and that's the reason for doing it plus here's what's kind a weird you've made really unbelievably wise decisions for twenty two years old I mean you you're just you're killing your head\nAnd a ... you know what all else will happen is when did you remember when you signed the mortgage\nDid you feel emotional weight\nUh yeah ... I started off with I've actually already refinanced once\nI'm done I mean when did the original deal the first time and you went from debt free young debt free with money in the bank to now I got a mortgage do you remember feeling the weight on that oh that\nYeah especially when it said Thirty years and\nYeah that's what I'm Talking about it because there's more going on here than simple math there was a complicated math that entails risk\nAnd and even even relational and I'm spiritual things the borrower is slave to the window that's the weight you felt Thirty years I Can't stand this I got to get rid of this well the same thing will happen in reverse but on the positive side of hey when you don't have any\n... no wait nothing on your shoulder it changes the way you play it changes the way you do you're investing it changes the you get so I got I got so enthusiastic dude when I got free with my investing and with my generosity both\nThat both of them went into outrageous mode very quickly and so yeah I don't get that fifty five back so freaking fast\nThat it it'll it'll it'll come back faster than in the first time you've got a lot faster it's not gonna take you five years this time I'm ... but you got more income now too so that's not fair but I mean you mathematically relation Lee spiritually emotionally\nWhen you're free you just do better\nAnd you make better choices and you're already making really good choices so all of that to say yes I Would\nCash out the investments that are non retirement yes I Would take that emergency fund down to about ten or that doesn't quite get us there so you got to lean in and out of your budget and cash flow out the rest of that thing and finish it up within\nYou know four or five months be debt free on this whatever it is for six months whatever it takes and then when the house has done than you than you if you want to build up that emergency fund a little bit ... but then kick those investments in the bud get them going again and you will prosper you are on your way sir\nHonor to talk to you very very well done\nWine is an Indianapolis Hi Wayne welcome to the Dave Ramsey show\nThanks Dave I just want to first say God Bless you for all the work you do it's really made a difference in my life\nWill thank you ... today\nWell my wife and I have been a leading the life of ... for about two years now and uh we've pretty much become that for other than our student loans which we're working on and then we ended up getting a now I got pregnant with her\nFirst child in April so hey we take your advice and I stopped putting everything toward their debt snowball and started a bank\nIn all of that is good and a ... month we we now have enough for her to take her for a month maternity leave um pain free for us which is a great time and that but the problem that the Murphy has decided to strike at\nThat last week we got a bill in the mail from our city here and they replaced and sidewalks here on our lots and or the bills for forty four hundred dollars and a with a baby on the way here and another a few months we don't have that kind of money and our cash flow to pay that off and twelve months before they put a lean on our home so\nMy question is um what would you do it in that situation that we eat we eat the plea are maternity leave fun and pay that off or what do we do when somebody do a better\nThan the beginning of December\nOkay well the game plan that will usually outline for folks is push paws on your total money make over your debt snowball Kobe becomes pile up the cash when baby comes push play again and take all that cash and throw it at your debt\nCorrect as long as baby mama come home and everybody is cool but the cash is just to make sure everybody's school there is no issues and we're not it's not really for maternity leave unless you have to have it to eat with but I mean it's not um it it's so that we can use it so how much cash will be got piled up or will you have piled up by decide what\nWhat ... Seventy five hundred dollars this month and like I said she is knowing that she's wanting to take the three months off the bond with the baby on such and we can't do it on just my income alone so um that's why we are smart about this and it set that\nGoal to make sure that you know so we got from now until December to continue to save right threat and what other debts do you have in your debt snowball how much I'm just about a hundred and fifty dollars a month because what we have that um other than our car payments and you have you have actual that balances you need to pay off\nTime no not on your car and material on your car alley\nOn and on the dollars you know well then the four thousand would be your most that you pay it off out of this guy and then all of the bar is set aside enough for her to things and re month so you have the cash\nYou should take guys this is James child's producer of the Dave Ramsey show I'm excited to announce the we're now carried on six hundred radio stations across the country to find one near you had to debut dot com slash show [noise]\nLet me tell you a story about two families that are very much alike and a lot of ways both families have two working parents and a couple of young kids each is dead and the struggle to make ends meet but they're starting to make headway with their budgets and smarter decisions with money\nThey have dreams and plans and the only real differences that one family is the right amount of term life insurance and the other doesn't\n... is it a guilt under her name\nHas alligator exactly exactly okay tell me a white guy for time got that that was like a flaw or restaurants like hey Lenny that actually passed over the payment to me and I said okay without getting myself and kale\nPayments are included in paying payments Oh nice okay right after the story sucks [laughter]\nSo I'm now two years later a\nFlash ear see I got my job and she gave me the payments and I realize that even I don't get started off in the corporate world I don't make enough to\nTo pay credit card so am I so I kind of like a lady that called the NFL I Know you're guideline that I'd have to get rid of the car I don't know how to go about doing that yeah it's not our off though thick yeah and it also takes so\nShe ... she mentally unable to make legal decisions\nNo she's not mentally eight she's mentally able she has a Pakistan if they credit so that's why he was able to get the car when I get painted actually they\nShow it here's the thing she tried to do a nice thing for you and she did it in a really stupid way and so now you're both stuck\nRight because\nYou she ... she owes more it's not gonna hurt your credit at all your credit not involved it's her credit that we're worried about we want to do a nice thing for her 'cause she's sick and not able to deal with this show a ... she probably knows more on this car than it is worth I'm guessing\nIf they care for it at our adding Kelley Blue book steady was a work\nAround a close to twenty thousand it sent me on the left\nIt's worth close to twenty thousand would have voted against it\nI Want to travel by ... points out now\nOkay or does your ... to have any money\nShe retired but not really so she couldn't afford it okay All right\nWell I'm sure you guys are in a pinch is very uncomfortable because there's what needs to happen she needs to sell this car because her niece can't pay the payments and when she sells the car she's going to lose seven thousand dollars on it what are we going to do with that\n\nDo you feel obligated to pay that\n\nYou're not legally are away I\nDon't think I mean I Know what I Do get the kind of accepted it I Know yeah I'm at fault for not ethical yeah\nHow old are you I'm trying to fight it what do you make like ... cheese\nOkay well someone's going to find the seven thousand dollars to put with the twenty thousand dollars that you get from your that she gets from her buyer to pay the car off so that the buyer can get the title\nAnd that's going to leave you and her ... is going to leave her seven thousand dollars and the whole if you want to help with that you can um and where I mediating this I Would say you both did something stupid and I would ask you to split it\n... that she each thirty five hundred and thirty five hundred and let's get the car so if she's too sick to handle the transaction have her sign of power of attorney over to you for the the title\nAnd then you get the car sold and um how have her come up with three thousand five hundred and you go borrow three thousand five hundred\nAnd that's your penalty for being engaged in this in her penalty for being engaged in this because the other option as you stop paying the payments and she gets ... doesn't sound really scared of the credit yeah that does that doesn't sound like a good plan to make because she's going to end the\nSick old lady's going to get sued for trying to do something nice but she did it in a stupid way so I think you both splits sales and that's just the fairness thing it's not a legal thing [noise]\nBut it's what I call stupid tax when I Do something stupid and it costs me money like all the facts and anti and you are both do patients stupid jak\nThis is today Ramsey\nAll it takes is one emergency trip to the dentist to blow your budget quickly now I'm not a fan of dental insurance I think it's a waste of money but there is another option it's called one dental and it's not dental insurance one dental is a discount program that functions like a membership clubs think of it like Costco\nYou join for a small yearly fee and you say big time every time you use it I'm Talking discounts on all procedures from routine cleaning ... all the way to root canal ... plus\nYou can choose from tens of thousands of Dennis from all across the country including orthodontics for kids and adults and if you've already been told by a dentist that you need a procedure but you haven't gone yet it's not too late to safe\nJoin one dental schedule your appointment with a one dental provider and save big instantly know waiting just instant membership and\nInstant savings folks one dental is a smart decision for you and your family start saving today at one dental dot com that's one dental dot com\nOn crystal national best selling author and personal finance expert I'm excited to introduce my new book everyday millionaires how ordinary people built extraordinary wealth and how you came to my book reveals the real truth about what it takes to become\nAn everyday millionaire we did the largest study ever with over ten thousand millionaires and the results will shock you pre order everyday millionaires today for twenty dollars at Chris will be three sixty dot com and get over fifty dollars in free bonus items\nI Know it's back to school season but that doesn't mean you have\nStress out about what's for dinner for almost ten years I've been telling you about my friends that he meals who make meal planning and shopping virtually stress free you can even have your groceries gathered for pickup over delivery right from the emails that it's the smartest way to save money every month and you'll be a hero is your family each delicious healthy dinners together\nSign up for a free two week trial today at emails dot com that's easy meals dot com\nI got an email Mr Limbaugh question wage growth has hit a Seventeen month type job growth has hit a seven month time the stock market has hit\nAnd another record high service industry growth Mr Limbaugh and hit another record high end trade deals recently negotiated my Trump are helping everybody particularly farmers Trump is doing all this does anybody know what good question\nLimbaugh mornings and I found that patriot am eleven fifty\nNow traffic on the patriots am eleven fifty\nSounds sounds to paint a Kenyan before PCH we've got an injury accident blocking lanes and we sing about a mile back at this trafficking sponsored by western hotels and resorts seniors had disrupted traveled the media will be you have any\nNutrition menu here so we were hearing how well can you show in writing on the west in\nMuch rice learn more at western dot com you're listening to the Patriot andme eleven fifty [noise]\nFive to two new job and we'll talk about your life and your money Taylor's with us in Hartford, Connecticut Hi Taylor how are you\nGood how are you better than I deserve what's up\nOr just you know first of all thanks so much for taking my call I've been looking for like eight years now um and I had a question regarding retirement and college Miami for my one year old mhm\nI'm I'm I'm Thirty years old I'm among baby step for I'm about Seventy thousand dollars cash mhm um I Know that other than my house\nUm which has about a hundred and twenty thousand dollars left on I'm On a third year mortgage and when I bought it I put Ninety thousand dollars down on so I have no equity in it\nShe says after reviewing his judicial record and allegations of sexual assault she is guided by a presumption of innocence\nI Do not believe that the charging ten hair they heard bad\nJudge cabin uh friends are on the court\nCollins says she believes Christine Blasey Ford was assaulted but says the accusation against Kavanaugh lacks any corroborating accounts\nBunkers during open democratic Senator Joe Manchin was also born wavered on his boat says he too noble line up behind cabin on calling it quote by justice former Republican vice presidential candidate Sarah appealing hitting in a tweet that she could mount a primary challenge against Alaska GOP Senator Lisa Murkowski if she opposes\nKavanaugh's nomination this is functioning [noise]\n\nNow traffic on the patriots am eleven fifty\nIn Norwalk Conn that sounds sounds ... they've got to make clear in front of the far right lane ... from the east LA interchange this traffic sponsored by Walgreens protect your world\nGet your flu shot today it's all greens would receive a coupon to earn ten dollars reward on your next purchase of thirty dollars or more reward salad on future purchase\nVaccine restrictions apply turns and restrictions apply to coupon you are listening to the Patriot andme eleven fifty\nFiber optics move crazy amounts of data and even crazier speed and ... is the one hundred percent fiber optic network with files get get the report is sponsored by del\nSlows me in the sixties tonight and it's partly cloudy to my sunny and warm with highs and the upper seventies lower eighties\nDown small business technology you know there's nothing small that's why we offer one on one partnership and reliable feeds into court probably\nConnection you'll get the fastest Internet available download speeds up to nine hundred and forty ... TB phone added to your price guarantee over Seventy nine Ninety nine per month on line with a two year agreement plus get two hundred dollars toward a range of Google and that's smart home devices and a one hundred dollar visa\nProfessors to help you get down how a seventh heaven by doubt\nSmoking always affected my daily life because I was a closet smoker so I was always hiding or trying to find a place to do it when somebody smell me afterwards it really sort of controls my entire day\nI switched to you'll because my boss recommended that I went to a store and I talked to one of the sales reps there and there were lots of options but he really felt like the ... the best thing for me it just feels really great to get into a car that doesn't smell like smoke\nGet out of my close at the end of the day and not smell smoke [noise]\nI Would tell anybody who's even considering tried to\nDo is the vapor alternative that delivers nicotine satisfaction without the mess of cigarette ash borer lingering order make the switch today that Joel dot com that's J. U. U. L. dot com you don't smoke or they don't start\nWarning this product contains nicotine nicotine is addictive kind of diabetes\nHigh blood pressure anxiety meds everyone's on them if you own a fifty year old male maybe a bit Porgy and you may even have type two diabetes a million dollars of term insurance may only cost you about two hundred bucks a month\nCalled term providers speak with big Lou it eight hundred five five five twenty eighty five big we will find a term life policy for you even if you have tied to diabetes are overweight or at high blood pressure\nGerm providers helped thousands of people like you think they can't afford term life insurance\nTo buy a million dollars of affordable term life for you all you need to do is call big Lu at eight hundred five five twenty eighty\nFive Lew will make sure the scales are tipped in your favor call eight hundred five five five twenty eighty five big Lu we'll answer your call and work to fit you went to a term life policy that you can afford remember big lose like you\nHe's on meds to call eight hundred\nFive twenty eighty five eight hundred five five five twenty eighty five\nSo I just discovered dazzle me dot com it started out as the jewelry department at the consignment center and now their entire jewelry collection one of my rings is there as well that's on dazzle me dot com from the big name luxury brands and you know which ones I'm Talking about to the unique designers that you just can't\nFind anywhere else all at a fraction of the price\nAnd with free shipping visit gasoline dot com today see what the ... is all about I'm going back on gasoline dot com tonight now back to Dave Ramsey\nOn them Adrian am eleventh [noise]\nMaybe joining us from our land you are here over the phone's a AAA to five five two to five Jill is with us from Phoenix Hi Joe how are you\nHi Dave thanks for taking my call and I'm listening to you for a while\n[laughter] I I have a problem that I'm hoping you can help me with my daughter who is bipolar just had a baby two weeks ago and she was living with a man\nWho had a family or his wife had died and he had three small boys to do to make it short she\nFind a way a lot of things that you shouldn't have one is taken out a couple of title loans on her car a road rubber checks as credit card debt so to make a long story short she's got quite a few collection agencies after her\nShe can't be here with me right now about how much she really does I don't know I Believe I'm guessing it's over four thousand and less than eight I'm not I'm not sure but she's racked up a lot of debt since last year\nShe is almost thirty four she will be next month [laughter] my my question to you is she has no money I Do not want to pay her death\nUm what did she say to these collection agencies I mean literally she has nothing\nNow nine year old is she still living with this guy you know he's\nIn a halfway house he was on drugs\nWere not as kids\nIf kids are now with one of his sisters and his mother\nSo she now has a single mom with a new baby on her own\nRight DCSS in Arizona gave myself and my husband uh the responsibility of taking care of the baby now and go wherever she wants that baby stays with me\nOkay now moved in with you yes she's living with me to go the baby on the mother correct\nOkay good good that's good news okay good so here here's the thing that um ... what you do the collection agencies is is that she has nothing and so for now they will get nothing and the she's dealing with bipolar and you know you they she is what we in the business called judgment proof\nOh absolutely can sue your pants off but they can't if you don't have any pants [laughter] that's what it amounts to okay\nWell that's what I was thinking that she wasn't you know her boyfriend has said to me well I didn't make Leah find anything that she wasn't aware of it but she can't make those decisions is what I've told them\nWell she she you know we got to come back to that in the second okay let's assume the debt is valid for\nUs it's not that much and it'll probably be good for her work her way through it when she gets back on her feet\nWell she might even got a job right now I Know yeah\nI Know what I said when she gets back on her feet mentally emotionally is working\nYeah we're going to let her let her uh probably reap the rewards of her stupid ... in the middle of bipolar okay now having said that I work with we work with bipolar for years people who have bipolar always end up in financial counseling goes\nAlong with off from it for the past year and I realized she probably had her biological clock ticking going well mom and dad have always told me I shouldn't get pregnant armies mad because she's on two different mints every day so she's been off it for a while the bottom\nLine is random line is is that with good counseling and with a proper balance of medication not over medication but not under medication um that that she can live a very normal life and make good decisions about everything child rearing financially and everything in a bi\nEver have you know but it can happen it can I have no choice on what happens\nIs is that she's got to stay plugged into a properly balanced medication regime and plugged into counseling she has to want to be well\nYeah and if she does that then she can\nForm a very good life and we have folks do that but to the extent that a bipolar person doesn't do those two things you are never going to have a financial situation is solid yeah because when they go manic they just go bananas\nOh I Know I I Know that I was in control of her checking account for most of her life and because of that I was able to gather enough money when she was working and she was able to buy a car a couple of years ago\nThat never allows her to be anything except dependent upon you\nWrite I actually last January took myself off\nOf of her checking am because\nHeart when you vote for and gotten more and more friends obviously not a bright boy show 'em\nWhole life companies don't sell cheap term insurance\nRight guy I contacted Vander ... last week\nWhen you get your term insurance in place you can just cancel with the company directly if you want to call the agent you can call a model air but you know their job is to save the sale\nJob is to run in and rescue you from yourself and so there's no reason to have the insurance review doesn't serve any ...\nI wasn't going to have an Irish you're going to regret can't no matter what you know but I didn't know there are certain that now that if I didn't take I Would leave out on getting them the most out of the cash value whatever they're\nNo there's no difference at all all you do as you just call them and get caller eight hundred number or whatever the name of the company isn't your customer care on the line customer service on the line and you know ask them if there's something they need you to sign or if there's anything we needed extra expedite this but we need you\nQuickly to get me my cash value what's the fastest way I can do that but no you really", "show_name": "The Dave Ramsey Show", "year": "2018", "city": "Los Angeles", "day": "05"}