{"month": "10", "state": "TX", "station": "KTDH", "content": "Drink for any size event OH MS Kathy dot com\nSupport for high plains public radio is provided by double L. transport of Turpin Oklahoma hauling bulk commodities in the H. P. P. R. listening area\nThis is Dave Smith hosted those are pilots radio we have a very special chauffeur you this week as we feature concert with world renowned Scottish fiddler Alister Frasier and the amazing\nShow is Natalie costs down in the vault mark joke just dusted off recording and one of our fight us dance butlers and folklore as an author Brooks blood months will take us to an ill fated Ozark theme park this week an Ozark highlands radio\nSaturday Night at nine o'clock central [noise]\n\nDa Silva supply planes public radio available everywhere at H. P. P. R. dot org\nYou can help ensure the reliable operation of our Web stream by serving a signal monitor to Inquirer or volunteer just email us at H. P. P. R. at H. P. P. R. dot org or coal eight hundred six seven eight seven four four four\n[noise]\nHello welcome to what the folk here on member supported high plains public radio\nI'm your host Mike fuller today uh the show is all about the music objects and brown Jackson turned Seventy years old this past week or so we're going to begin with a\nSomething off his most recent record on the record is called standing in the breach this it's called yeah yeah [noise]\n\nWell you know I don't really you know uh you know uh\nYeah yeah\nUp to me to to you or did you see do you uh\nYeah yeah [noise]\nWhere it is you get it\nMean you know we have a\nYeah yeah\nJohn menus there's\nWhat's on your face you\nIs to have to leave me alone\nTo be ...\nKnow uh don't lead you know a ... a\nYeah yeah\nDestruction black or not\nYou see these standing\nStewart along the ... the the\nYeah yeah\nThat keeps you hanging on\n...\nYeah\n\nI don't feel that\nThat's you know\nWe were in\n\nThis you\nKnow then then the young boy who are in\n\n\nLow ball\nGame oh no no\nIn yo\n\nLa\n\nJob you know\n\n\nMan yeah\n\n[noise] yeah\nWere\nNa\n\n\n\nBoth of\nAnd\nAnd [noise] na\nNa na na na hey that's\nThat the way\n\n\n\nNa na na\n[noise] and\nUm\n\nNa\n\nNa na answer\n\nNo\nDrilled you\nWe would love to\nDisease\nNo longer going yeah the\nName Caroline\nSays it's\n\nJust ...\nAm ...\n\nReyes ...\n\n\nAnd you need a\n\nSun ...\n\n\n\n\nIt was new to the music of Jackson Browne this week on our show you're listening to members supported high plains public radio\nThat is a Jackson and Ray Davies from the kinks\nRe put out a record several years ago called see my friends was a collection of do at a every song it was it was a different person that is their version of water sunset or before\nThat window run stat an Emmy Harris from their records together called the west wow that was their version of for a dancer and before that Bruce orange ... version\nChris from their records together called the western wall that what's their version of for a dancer and before that Bruce orange ... version of I'm Alive we are going to take a quick break we'll be back in just a moment\nThis is folk singer Michael Jonathan tune in to our show this week on this radio station which country music artist and acclaim songwriter Aaron ... plus the sound of Kentucky\nAll the all the rules say\nYou know the ... dream is\n... ... ... ... ...\n...\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n[noise] [noise]\n[noise] [noise] ...\n... ... ...\nThat's been\n... ...\n\n...\n...\n\nMe\nThat\nThen\nThe\nEaster Bunny dean na\nNa na na na na\nNa no way to\nMan [noise]\nIn my opinion the na\nStrong man he knew\nHe was two and\n[noise]\n\nIn my city Stanley\n\nThis week on what the folk we are listening to the music of Jackson Browne who turned Seventy this week\nThat's Allison Kraus in Union Station from their record paper airplane that is called my opening farewell which was a song on Jackson's very first record before that the league Jimmy looked save from a tribute record called looking into you see his version of for every man\nAnd before that Jackson's these days from the for every man record that song has been recorded dozens of\nTimes uh but I included Jackson's version because of David ... guitar work is just amazing just beautiful beautiful song Jackson was about sixteen years old when he wrote it\nYou are listening to members supported the high plains public radio the radio station is quiet at the moment there's no one there but the Internet never sleeps and you could go at any time you could go right down to our website H. P. P. R. dot org\nAnd pleasure support or if you're a member thank you are an additional gift would be wonderful or you could even get the gift membership or someone in your family who's not a member and if you are not a member yet then by all means uh\nGo to the website H. P. P. R. dot org become a member now we'll talk a little bit more about that are coming up in just a little while\nGetting back to the music I'm here is a track 'cause ah from Jackson's record time to conquer Scott going down to Cuba\nSince record time that Congress is going down to Cuba\n[noise] [noise]\n... times I get to see the you\nKnow\nWish I could just pick up in\nA new change in order to be made these bad\nToss the or the ...\nNot sure who makes it come and go [noise]\nThere it is again reading music when you\nMove your message to go\nI'm going down to ... is probably the Caribbean bloom\nIt's been too long since I've been\nAnd see so much rain down there the randomness here\nHappened when and where it got team\nYou are listening to members supported high plains public radio if you're just tuning in this program is called what the ... my name is Mike fuller I Am your host it is time for us to take a little break be back in just moment\n\n[noise] this is Ninety One point five Katie ... eighty nine point three Katie da di di ... radio available everywhere at H. P. P. R. dot org\nThe availability of H PBR Web stream is due to the long term financial support of individuals all across the country you can do your part to keep the service going by becoming a new member today at H. P. P. R. dot org\n\nLower um\n\nGuy named ...\nAnd\nAnd\nAn age staying in the way through the\nUse new news\nIn a way from the way\nThe regime change them um you know on\nThe news of a sudden she was the\nYou know being\nNo names and then you\nKnow normal\n\nMe age staying with the way to really move your show me\nAway from the way\nShe no longer\nMaybe they\nDo ... do you well\n\nAnd then\nChange you've been listening to know them\n...\nThink you know being in the\n[noise]\nReach the all\nThe way a little\nRoad yours to\nKnow\n...\n\n[noise] [noise] [noise] [noise] [noise]\nNo not really I don't\nThey pay [noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\nI yeah I\nMean he didn't need that\n\nAnd I didn't know how far is\nNot I\nSee [noise]\nI\n\n\nI just know\nThat they needed to be out\nI can ...\nKnow\nThe game you know and [noise]\nJury\nOur [noise]\nDie down bomb on na na na na\nI wanted to know\nWhat I Do I go and maybe you saw that nothing in a way\nWe have a dog that I can rely on\nNow that I\nHe\nNot that I bought a new ...\nWant to know\nDo I go and do I have\nTo do just ball and\nThey're not to began to rise to\nAnd he had been gang menu alive to\nCome by you\nHe he\nTo be done by\n\nHe\nThe da da\nDa da da da\nNa na na na\nKnow I Know\nDo like oh I thought maybe I Am a\nBig thing that you know the the ...\nWhen the goal is done Mm Mm\nMm she could see under a\n... ... ... ...\n\n... knows\n\nThe studio inside\n\nAnd I'm I'm ...\nUh the\nUm the\n\nIn the ...\nAnd\n\n\nAnd\n\nAnd\n\n\n\n[noise]\n[noise]\n... ... ... ... ... ...\n\n\n\n\n...\n\n\nStructure Brown's version of a John Lennon tune into all my love that appears on the Amnesty International benefit record called instant karma before that the birds of saint marks a song that Jackson wrote when he was living in New York when he was about Seventeen\nDidn't show up on one of his records until his latest record standing in the breach and before that the fairest of the seasons are from a knee goes Chelsea Girls record\nWhich uh Jackson was guitarist on that record and wrote that song as well as to others on the album you are listening to member supported high plains public radio we're going to take a short break we'll be back in just a moment\nKnow that's what you need\nThe number that you know two or three months from now and and just come to me that he is so\nHave you ever ...\nA month\nAnd a ...\nA ... year the ... let me go from one to me and you know with ...\nHidden in the middle man\nKnow stop the\nNews business owner and\nThat's still on the other\nYou know\n\n\n\n\n\n\nI haven't seen a loan\nOr the [noise]\nI'm Single\nBut to go for\nA\nDo do do we do in ... ...\n... ...\n... ... ...\n... ...\nThere's the ...\nCheese the yard\nThose for the\nDon't do the ...\nThe day you know even though the ...\nAnd it's\n...\n\n\nMm Mm", "show_name": "What the Folk?", "year": "2018", "city": "Dalhart", "day": "14"}