{"month": "10", "state": "TX", "station": "KTDH", "content": "Pete Pete are listening area\nSupport comes from St Andrews Episcopal Church Sunday services at eight and ten thirty AM and six PM Wednesday's at five thirty PM the Episcopal Church welcomes U. S. T. Andrews Amarillo dot org\nThis is Dave Smith posted it was dark islands radio will be exploring the movement of great songs book olden modern across musical genres on this week's show keeper the bolt mark Jones is found in archival recording of a traditional song was re imagined in the nineties by grungy rock band\n... water will follow the journey of a traditional songs from Ireland to America and back again this week on Ozark highlands radio [noise]\nSaturday Night at nine o'clock central [noise]\n\n[noise] this is Ninety One point five Katie ... eighty nine point three Katie de ... uh service the high plains public radio available everywhere at H. P. P. R. dot org\nThe availability of H. P. P. R. as Web stream is due to the long term financial support of individuals all across the country you can do your part to keep the service going by becoming a new member today at H. P. P. R. dot org [noise]\nWelcome to what the folk number supported high plains public radio my name is Mike for your host\nToday's theme is all about the compass north and south and east and west in some places in between we're going to begin with Graham Nash and David Crosby from their ah self titled record this is called southbound train [noise]\nThen she gets no\nMe the dogs\nAnd then I'm like you have\nTo this day should be at a\nTrained go away and\n\nWell let me try\nSaid they are\nYou go and we\n\nDamn\nYeah those in\n...\nShe is and\nDrain doorway\nNa na\n\n[noise]\nRicher than a day and decide\nIn the in the ... the bad guy in the\nRain and although they do they live way out\nNews\nAnd\nCall on the ground\nAll the way in na\nNa na na\nNa\nNa\nNa\nAnd things on the breed no kids to do with ...\nSon is ... ...\nWe sang in the morning\nJob let's see the stars on\nOf the first\n... be ... to me\nThe stand and you're shut\nStranger to remove\nMe for some ...\nRings in my view it's a boy so he just more\nI suppose it's been a ...\nAnd remind us\nI saw this law\n... or\n... speech\nYears is no\nShame is on the three\n\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n\nMarathon watershed\n\nThe the ...\nAnd in the air and the housing and\nYou can see from now we've been courting but then he was\nFrom ...\nWhere\nCan up all around me you know when the ... the random watershed\n\n... a\nI'm a ...\n\n... ... ... ...\n\n\n[noise]\n\n[noise] [noise]\n\nOur ... and I feel\n[noise] our good care of the biggest change in my ear to appeal\nLine can now be used to go back to the the there's a lot about the long way bottom very cold there there's no no no no no\nNo no [noise]\n\nServed for gifts for them out of the Arab over there\nAnd I never found out I think they\nNeed to\nTell them well they're not sat down and just be weightless\nAnd you know the average person would be no\nTree [noise]\nCharge and\nAnd that's my big dream crashing down\nAtmosphere [noise] magic nation Jim you raise an article on back\nAnd here today [noise]\nLock their child\nTo learn to get in there and\n[noise]\n[noise]\nNo\n\n[noise]\n\nWe're listening to songs about points on the campus today on what the folk that is a around the brand again who was born and raised here in Amarillo great\nA singer songwriter that's called north in outer space before that the late Nick Drake that is northern sky and David Wilcox western rich was and to that\nWe're gonna take a quick break we'll be back right after this\nThis is folk singer Michael Jonathan inviting you to tune in to this week's broadcast if we have the Austin trio the troll smash years and the son of the legendary John McHugh and\nJonathan McEwen his son when he both artists music in conversation on this week's broadcast\n[noise]\nAt ten o'clock central\nNow you yes you are listening to one of the biggest members supported radio stations in the country here at high plains public radio your contributions help sustain the programming you hear every day each PBR it's getting down to the wire for the October goals\nIn the country here at high plains public radio your contribution helps sustain the programming you hear every day H. P. P. R. it's getting down to the wire for the October goal so help make a difference and become number today at H. P. P. R. dot org and hey thanks\n[noise]\n...\n... was a\nTo know that is a sign on to my ... let's say there's train\nSound a little bones and Don ...\nShe was a big choose a new study and she says you [noise]\nJust ... you know why the caged spine\nIt was the is telling us\nYou know a lot of attention 'cause my\nIt was me is telling us\nThat it's in New\nOrleans is\nDone ...\nIn ... as much money on\nDuring the day we were on the\nLine and then a voice but money\n\n...\nKnow\nWhen there's no reason why but can\nWhen a told me\nThat on it and shouldn't say\nThen\n\nI Do believe me I have to go\nPicture to\nContain than ten thousand\nThe the ... on the rise\nStone the\nFrozen\nUp and takes me across the border to\nA hundred to do for us to really do\nThe\nFan now\nWhere\nThe northern plains go by\nGo get your room\n[noise]\n\nThere's to lead singer's from too great a Canadian bans Ellen oil from great big sea and Jim cutty from a radio that is called northern plains that's from Ellen's record a boy in bridge before that Chris Isaac from the boss sessions that is so so the border\nTim O'Brien's into the west was that did that and we begin that said you all my brothers band and their brothers and sisters record that is so profound you're listening to member supported high plains public radio coming up next year she'll grow\n... ... ... ...\nE a G ... meeting Lee's\nSon who's been near me I'm ... I'm\nWith all the young women in the in the ...\nNa na\nNa\n...\n\n... ... ...\n... oh\nNice to meet you in your Judy than\nThose um and I get\nThe with the\nMe on that one day maybe young children that have\n... a\nMan you know we're sending\nBed no blood and treasure did manage them certainly\n\n\n\nGoing to\n\nBe a um\n\nThis program is called what the folks here at every Saturday Night we are going to take a little break we'll be back in just a moment\n[noise] this is Ninety One point five eighty ... eighty nine point three Haiti da da Silva supply planes public radio available everywhere at H. P. P. R. dot org\nYour business or organization can support public radio in your area by becoming a community sponsor and receiving frequent on air recognition for your support look under the support jab at H. P. P. R. dot org for details\n[noise]\nFace just a\nThat wages\nFall in\nFaced interest but\nI'm ...\nIn my state\n\nFace and a\nLong way then\nI\nGot my\n\nOwn\nI'm never down in the mile mile oil space\nWell no space and\nThose\n\nFaces seems a\nLittle ball with one\nAnother\nEach\nUm fall on one\nLevel\n\n\nAnd then when you go to\nDream how she um\nDo you\nGo to this\nDay and they do in\nAnd now you will love\nThe way the issue and\nNumber ...\nDo you have meant that range\nThey gave me that the sun\nWe still don't understand\nNo oh no no\nNo no\nNo\nNo no no no no no no no no no\nNo no no no no no no no no I don't remember them then you know when you go to agree with them\n\nMake\nUm\nStay in\n... the ...\n\n\nOh well\nYou know a ... year old is a real new\nWho do you well the\nBulls oh no no\nI didn't do\nOf that a law where there\n\n... years\nMan over by a guy\nNamed ... way of you know the guy we be down so much not much game in\nA long way and all of\nMy really is going to have\nGum me Shane [noise] um no no no no doubt they bang my\nThe way it is a shame and\nDown and let me on a valve valve rain in the old are you going to be saying\nThat shame\nOn about ...\n\n\n...\nNo need to be read things on gay read lord knows the name out there that you're\nAll the money on a doll bound train in\n\n... ... ...\nAnd then they may be based\nBig march in the\nMurder you breathe the moon and on a\nThe lonely nine\nA\nLeave when I answered\nAnd wouldn't be on a downtown rain in the old up here and um our ozone obey the thing to do there is a hard or made all may make that\nA lot about bound train\n\n... and ...\n\n...\nAnd\n...\nA I'll leave this ... wrote me I I was a little better\nWhere I Am going\nAnd then ... will\nAnd then she will\nLie beneath the\nA ...\nI'll say my prayer\nKnow the\nWhen he\n\n[noise]\n[noise]\nIt's a little farther west from well Wilkins from his record a good ramble before that furry dogs yeah Amarillo based band that cold so\nFrom well Wilkins from his record a good ramble before that the prairie dogs and a Amarillo based band that is called so it's been trained from their record prairie fire you're listening to member supported high plains public radio we are going to take a short break\nAnd we'll be back right after this which yes\nHere including I think for the high plane public radio\nEnergy and environment reporting comes from I ... the great plains and the corporation for public broadcasting\n\nThis is Dave Smith posted it was dark highlands radio will be exploring the movement a great song spoke olden modern across musical genres on this week's show people or the bolt mark Jones is found in archival recording of a traditional song was re imagined in the nineties by grungy rock band\n... water will follow the journey of a traditional songs from Ireland to America and back again this week about Ozark highlands radio [noise]\nSaturday Night at nine o'clock central [noise]\n[noise]\nHello my name is Ben I'm pretty good line Kansas high plains public radio is good for your height cute [noise]\nAnd being a\nMan and\nBall he na\nReading\nI [noise]\n\nStanding in love the counting oh the navy is passing the um\nSt e's\nBy one day in and out of\n\nDate is a bad day and\nThat and they do that a kid drugs\nI Am the a bomb\nI Would be a bomb and [noise]\n\n\nBeing a\n\n[noise]\n\nAnd [noise]\n\n\nMusic that talks about points on campus today on what the folks that is the bone Burnett it's called east of east before that Afridi Johnston from his record never home that is western sky barefoot from the doors and windows record before that that is called northward bound\nAnd we began that set within acoustic version of but I guess to the south side of the sky this is member supported plains public radio\nHere's Roseanne cash on\nThe ... the ... ... ... ... ... ... ... ... ... ... ...\n... ... ... and you know ...\nMaybe you know we'll ... we'll\nNa\nNa na na na na ... no one then then\nAll the yeah the bill in ... he was ... you know in ...\nHat do and did did\nYou go home and do not oh\n[noise]\nMm ... Mm well\n... you\nGod ...\nMm Mm Mm\nNo God they hug foods and I live\nIn ... ... ... ... ... ... ... de ... skin Illinois ... you live in the game you\nKnow it's a\n... ... ... ... may be ...\n... you know\nIt's like\nI don't know that God created man\nIf she was a\nBig and then why he found it played you bring you need to do ... ...\n... ... ... ...\n... ... ... ...\nMm\n\n\n\n\n[noise]\n\n[noise] [noise]\n\n\n\n[noise] [noise]", "show_name": "What the Folk?", "year": "2018", "city": "Dalhart", "day": "28"}