{"month": "10", "state": "TX", "station": "KTDH", "content": "More at eight oh six three five five five nine nine one support comes from United Wireless providing coast to coast service with plans to fit your budget stores in agents across the region coverage you deserve service you expect details at United Wireless dot com\nThis is Dave Smith hosted ... radio we have a very special show for you this week as we feature concert with world renowned Scottish fiddler Alister Frasier or the amazing show is Natalie ... do the volt mark joke just dusted off recording and one of our fight us danced pillars ... author Brooks blurb and we'll take us to an ill fated Ozark theme park\nThis week an Ozark highlands radio\nSaturday Night at nine o'clock central\n\n[noise] this is Ninety One point five ... eighty nine point three Katie da\nDa Silva supply planes public radio available everywhere at H. P. P. R. dot org\nYou're listening to high plains public radio on line right now is made possible in part by the financial support of the community sponsors you hear mentioned on the air please finding occasion to thank them for their support\n\nWelcome to what the folk number supported high plains public radio my name's Mike for your host\nToday's theme is all about the compass north and south and east and west in some places in between we're going to begin with Graham Nash and David Crosby from their self titled record\nThis is called southbound train\n[noise]\nThe ... you know\nThe the dogs that it'll bring home the lesson is that I'm like you have\nThis day and he had a\nDrained go away\n\nWell they have dry\nIt may be\nA yet\nYou go way\nWhen\nIn\nYeah the ...\nAnd they and\nNah\n\n[noise]\nWritten in a day and by\nAnd then this will be a bad\nDay the\nRegime you know the man to walk away\nToo and and\nCall on the ground\nBaldwin na na\nNa na\nNa\nNa\nNa\nThings on the breed and get to do with the text is right in\nSun is the ... and ...\nWe sang in the morning\nHave to get there as well\nDo let's see the stars on\nAre the first\nTreat the movie down to the\nDisband and your shuttle\nThree and ...\nMe for some ...\nWas brings in a year it's been what was the ... more um\nBrings in ... it's been a ...\nRemind us\nI thought this line\nI'm a student who was\nShould sided speech\nNews is no\nChange on a breezy\n[noise] [noise] [noise]\n[noise] [noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n\nMarathon watershed\n...\n... ... ... ...\n... and ... and ... you can see now we've been courting now over the news the\nNews business side\nOf the ... ... you know\nWhere to end up all along you know when they're ... ... where the watershed\n\n... a\nOn a\n\n... a ... [noise] Mm\n\n[noise]\n\n[noise] [noise]\nOur ... and I ended up being built\n[noise] our kitten their dream and in my head up in\nThe back of your mind to know where to go back a trip to the there's a guy out the way that I'm very cold there there's no no no no\nNo no\nNo in the [noise]\nFirst love for your first time I've ever there I never found out how to take a plane [noise]\nTell them around and I'm sad down to just be weightless there\nIn in the airports to the will be no\nYour age [noise]\nIs ... ...\nTo exchange crashing down\nBeen the atmosphere [noise] imagination carry me you waited ... come back here today [noise]\nLock their child\nTo learn to be bad in [noise]\n\n[noise]\n\n[noise]\nStage [noise]\n\nListening to songs about points on the compass today on all the folks that is a around the brand again who was\nBorn and raised here in Amarillo great a singer songwriter that's called north in outer space before that the late Nick Drake that is northern sky and David Wilcox western ridge was\nThe end of that we're going to take a quick break we'll be back right after this\nThis is folk singer Michael Jonathan on the next ... songs broadcasts were celebrating the music of a legend Django Reinhardt with the best the best hot club of San Francisco imagine his music played on a hammer dulcimer with Andy young and grant flick\nIt's all of this music and conversation on the next broadcast\nEvening at ten o'clock central\n\nMy favorite aspects of high plains public radio\nIs the living room concert\nVenues where you can go and hear music that you may not be exposed to\nIs the living room concert\nVenues where you can go into your music that you may not be exposed to otherwise and their lives their intimate and they're always always entertaining\nHello this is Rick Scott I'm from Amarillo, Texas and I'm a proud member of high plains public radio\n... ... ... ...\n\nThat's ... ... was a\nKnow that either side on\nMy ... let's say this train\nSound all the bones and Don ... she was a big shoes or do you spend that you know you\nFor her time no why would I change his mind [noise]\nFor the state\n... know why I changed his mind\nIt was me is a\nLot in the navy and\nThe whole rest of the\nDynamics in\nIn ... was plenty of money on\nThat during the day when he was all day\nUnder\n\n... ... ...\n...\n... ... more than a bike\nShould send a told me\nThat ...\nTerm and through\n\nI Do believe me I still go ... picture to contain than\nThe fan files\nThe the ...\nStone to\nFrozen\nIn case we crossed the border to\nA hundred to do for says the ...\nSaying I'm\n\nI Know other Swain drove by\nGo get should rule\n[noise]\nMe so far\n\nThere's to lead singer's from too great a Canadian bans Ellen ... oil from great big sea and Jim cutty from a radio that is called northern plains that's from Ellen's record a boy in bridge before that criticize it from the boss sessions that is so so the border\nTim O'Brien's into the west was that did that and we begin that said you know my brother's band and their brothers and sisters record that is so ... you're listening to members supported high plains public radio coming up next your seals across\n... ... ... ...\nE a G ... meeting Lee's\nSon who's been I'm much more um\nWith all the young we don't get that in the ...\n\nUm being in young women that ...\n\n\n... ... ... ...\n... oh\nDid you did you read in\nThose ... and John like\nWe were the\nNeon sign one day maybe young children that have drawn\n...\nMan you know we're sending a\nNo no no then says ... certainly\n\n\n\nGoing\nTo\nBe a um\nWants to be western New York and headed that shields and crops from summer breeze record that is called east of ginger trees you are listening to members supported high plains public radio\nThis program is called what the full ... here at every Saturday Night we are going to take a little break we'll be back in just a moment\n[noise]\nThis is Ninety One point five eighty ... eighty nine point three ... service the high plains public radio available everywhere at H. P. P. R. dot org\nThe cost of operating H. P. P. R. Web stream or underwritten by community sponsors you here recognized on the air we thank them for their support and hope that you will patronize support and thanked him as well\n\nFace and says\nI'm almost half the wages\nThat\nSpace is just the other\nI'm ...\nI'm never run another job model state\n\nFace in the\nLong have we\nDon't know I mean God Bless\nFace of the\nPhone\nNumber down and miles and miles space [noise]\nWell do fish since\n\nMeans that long\nSo\nI'm On the line\nGod Bless\nSo\nI'm Paul I'm applying\n\n\n\nAnd English they knew full full\nDream home she um\nDo you\nGo to this\nDay and they do in\nAnd now you will love\nThe way the issue and\nAgree that we're hearing\nA harmony either knew what are we getting mixed up this Sunday\nEastern us and\n\nKnow what you're doing you know\n\nMhm mhm mhm I\nRemember the name of them are going to go and then my living room to run and let's go to agree with him\n\nFor men\nUm\nStay in\nLet me in trouble if they\n\n\nOh\nNo I'm going to do with the new\nDo you well know\nBode well do you learn\nA new law\nA law where there\nI\nDidn't even ... years and now\nMan by a guy\nNamed ... way of you know to be be down so much we do not mind again [noise]\nHow long gay and all of\nMy really is [noise] na\nVe Shane [noise] I'm gone down the street they bang my\nAway there's evolved Shane [noise] paying me down and believe me on it now vows rain in the old are you in a mall is going to be the same\nThat are a\nLot of doubt down saying [noise]\nNice\nRide no need to be read ... read lord knows I mean I'm Out there that they are all\nThe money on a doll bound raining or\n\n... ... ...\nAnd then they may be you\nBig macho men no need\nTo learn the breeze coming on to\nThe lonely nine\nI\nKnow leave the guys and\nThey stay down\nAnd put me on a downtown to rein in old up here and I'm a\nBe staying there is a hard or made on may make that\nA lot of doubt bound train\n\n\n... and ...\nAnd\n...\n...\nYou know\nAnd I'll leave this ... wrote me I I was a little bit better\nWhere I Am going\n...\nThat she will\nLie beneath the\nTurn\nTurn my\nOut the much\nKnow the\nMe\n\n... ...\nIt's a little farther west from well Wilkins his record a good ramble before that furry dogs yeah\nIt's a little farther west from well Wilkins from his record a good ramble before that the prairie dogs and\nUh Amarillo based band that it's called ... spent train from their record prairie fire you're listening to members supported high plains public radio we are going to take a short break\nAnd we'll be back right after this which yes\nSupport for high plains public radio comes from Amarillo wireless locally owned and operated and offering residential Internet connections in rural Amarillo Bush led and wash burn more in Amarillo wireless dot net\nThis is Dave Smith hosted those are pilots radio we have a very special chauffeur you this week as we feature concert with world renowned Scottish fiddler Alister Frasier and the amazing ... do the bulk mark joke just dusted off recording one of our fight us dance butlers and folklore as an author Brooks blood as well\nTake us to an ill fated Ozark theme park this week are those are pilots radios\nSaturday Night at nine o'clock central\n\n... this is ... and you are listening to a high plains public radio\nAnd be a\nMan\nBar he na\n\n[noise] [noise]\nStanding in love the counting oh they is\nPassing\nThe palm trees cheese\n\nBy one day in and\n\nLady on this day and [noise]\nAnd just drug made\nI Am\nA bomb\nI Am a mom and [noise]\n\nBang\n[noise]\nYeah [noise]\n\n[noise]\n[noise]\n\nMusic that talks about points on campus today on what the folks that is T bone Burnett it's called east of east before that Afridi Johnston from his record never home those western sky\nBarefoot from the doors and windows record before that that is called northward bound and we began that set within acoustic version of but I guess to the south side of the sky this is member supported high plains public radio\nHere's Roseanne cash on the\n... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ...\n... ... a man you know there was ... maybe ... well ...\nNa\nNa na na na\nNo money and then\nKnow all the yeah the ... ...\n... oh yeah ...\n\nDid did you go home and do not oh\n...\n... Mm well\n...\nMm Mm\nGod he lives in ...\nIn ... in ... ... ... ... you know live you\nKnow it's\nA ... ... ... not in the ... ... ...\n...\nMm I don't know if God ... the man\nIf she was a\nBig and then you know why he's played do when you\nNeed to do ... ...\n... ... ... ...\n... ... ... ... ...\nMm Mm Mm\n\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n\n\nMm", "show_name": "What the Folk?", "year": "2018", "city": "Dalhart", "day": "21"}