{"month": "10", "state": "MA", "station": "WFCR", "content": "Streaming of New England public radio was funded by you and killed ... architects a forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com\nJazz automotive next year on any PR where it's a minute before age this is New England public radio WFCR in Amherst Springfield Hartford in partnership with UMass Amherst than in any PR dot net [noise]\n\n\n\nMm\n\n\n\n\n\n\n[noise]\n\n[noise]\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gee CVS dot org\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gene CVS dot org [noise]\n\n\n\n[noise]\n[noise]\n\nStreaming of New England public radio is funded by un day path university graduate schools and I say in creative non fiction writing enrolling now for August twenty seventh applications at bay pass dot edu [noise]\n\n\n\n\n\n\n\nThat's a little small cure on any pure clean April in Paris it's a Nineteen sixty four recording of the song composed by for him to do some of the Columbia Records released simply titled monk\nThat was ... at the piano with Charlie Rose on tenor saxophone Larry Gail some decent Ben Bradlee on drums April in Paris ...\nSmokes one hundred first birthday anniversary leader in the hour we'll hear among cleaning songs by George Gershwin and Duke Ellington ... to ... nice work if you can get it I didn't know about you and I saw\nThis is ... doing to public radio I'm Tim ... thanks for joining me for this Wednesday nights is on the mood for them do you smoke\nWill devote a couple of such this evening the Chicago born Eunice junior meant celebrating his ninetieth birthday today in St Louis junior man's playing Louis is monks boulevard blues as well as Creole loves Cole Minnesota's regret singer book bulls\nAnd about twenty minutes from now will hit the legendary Vogel is Lee wildly was songs from her landmark some book series tunes by George Gershwin as well as Cole Porter in Rogers and hearts\nLet's continue here in eighty five with ... Reed is a wonderful singer and composer what are the most dynamic figures I've ever seen on a stage she said scholars in Boston on Saturday and on Sunday\nStreaming of New England public radio was funded by you cute little architect of the year legacy of commitment to community design celebrating the next generation of leadership a cute little dot com\nAnd here's Renee from her recent to release so to ... with a nice arrangement both attributed it to you Charles ... singing her original joy ...\n[noise] [noise]\n[noise] [noise] [noise]\n\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see ...\n\n\n\n[noise]\n\n\n\n[noise]\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional and education that's most health sciences psychology a ice sheet dot edu\n[noise]\n\n\n\nAnd\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\nStreaming New England public radio was funded by us valley solar local ... designed the installation helping household secure state or federal incentives and live carbon free and the poor one three valleys solar dot solar and\nWind or\n\n[noise]\nMhm\n\n[noise]\n\n[noise]\n\n\n\n\n\nStreaming of New England public radio is funded by you add the hotel Northampton offering six meeting at a vet spaces from boardroom to ballroom with a the equipment at the end house catering hotel north Hampton dot com [noise]\n\n\nNo one does\n\nWell [noise]\nMy family's new well my knees this row\nYeah the day when I got my pay high when do up oh God no\nDo\nIn the weather does grow [noise]\nIran I mean\nI don't know what was not but they didn't learn\nFrom God Knows where all\nThat grow without ... the wisdom and work is\nBut it's too late for me\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gee C. V. S. dot org ...\nKnow is I'm only\n\n[noise]\n\nTo\nPrevent the [noise]\n\nGod no way\nGrow raised yeah some of renewable never get in the morning as na\nNa man just like I was in\nA lot of what they know\n\nOh\nMaybe maybe not nice\nMakes\nFun of me\nBut a case like my\nNieces that shows\nEasy\nFees\nNot\nKidding no rain\nThing or a ...\nStreaming up the waitlist public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students that would roll lick for fall gee C. V. S. dot org\nNa na\n\nNa again for every day and age you know I'm I'm a big name\nAgain we can't you see\nA man\nI Know they live\nAs long as the\nAh the cities you\nKnow these guys who have other than go\nI didn't know\nThat I Am\n\nA man\n[noise]\nNo\nNo no no he got arrested three um\n\n\n[noise]\n\n\nHow many men did in ...\nWould be happy to see\nWhat you think\nYou are my reason this is a sin\nStreaming of New England public radio is funded by you and the hotel door Sampson offering six meeting at the vet spaces from board room to ballroom with Avi equipment and getting house catering hotel north Hampton dot com\nMy knees brazen and roll on the\nOne you or I should never never no\nIt's not going to try to act we knew who\nHe sees me\nFive\nGot up to ... maybe\n... all day and I know I\nYeah me too\nIs that we know\nThey're not good for which no not so\nGood\nThat you know a\nLot of ...\nWe could no well I don't mind a huge boon\nFor well let's ask God I'm not the\nNorm [noise]\n\nNa na na\n\nNa na na\nDa\nDa da\nDa\nDa da\nStreaming of New England public radio is funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall genes CVS dot org\n[noise]\nNa na na na ve\n[noise]\n\nLevi Lee here on any pure singing I've got a crush on you\nIt was composed by George Gershwin for the Nineteen thirty musicals trying to ban and recorded here in Nineteen thirty nine by le ... in a band that included fats Waller it's piano ... we brussel on clarinet Lee widely I've got a crush on you\nAnd it was preceded by leasing the Herald Arlen classic I've got the world on a string Lee widely saying Cole Porter's hot House Rose that was ...\nIt ... singing songs by Rodgers and heart glad to be unhappy and babies a week now\nFor the whole book albums that leave while he recorded for liberty music shop in New York and the leak thirties early forties they've been reissued by audio file records\nLevi Levi Levi went on to a record an album of Irving Berlin songs and an Eighteen fifty four she team with the ruby breath and ...\nFor a reprise of songs by Russia's heart yesterday was the ... at least one hundred tenth birthday anniversary\nStreaming of New England public radio was funded by you and they passed university graduate schools and I say in creative non fiction writing enrolling now for August twenty seven applications that they pass dot edu\n[noise]\n[noise]\nStreaming of New England public radio is funded by you and they passed university graduate schools and asset applied data science enrolling for October twenty second applications that bay paths dot edu\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\nStreaming of New England public radio is funded by you add the hotel Northampton offering six meeting at a vet spaces from boardroom to ballroom with a the equipment and in house catering hotel north Hampton dot com\n\n\n\n\nI still don't smoke you're on any tiara playing I didn't know about you a song composed by Duke Ellington introduced in the early forties by Ellington with Johnny Hodges under the title sentimental lady with the lyrical above ... became better known as I didn't know about you\nAnd recorded here but it's only a small to mid sixties for the ... street no chaser it was Charlie ... and Ben Bradlee on drums the ... I didn't know about you\nEver heard monk playing songs by George generic Irishman the brilliant solo piano rendition of nice where keeps you can get it it's in the ... time and we begin with the looney as playing ... so all the ... to rollerblade they with Charlie Brown slavery gills and been rightly so do you still don't ... one hundred first for the anniversary\nThis is New England public radio WFCR in Amherst Springfield Hartford in partnership with ...\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences at psychology a icy dot edu\nMORNING EDITION between six and nine all things considered between four and six thirty Nuzum NPR in New England Public radio right here at eighty eight five and ... are not pets\nBut it tonight we'll hear I'll do the ... glass enclosure and a brilliant do performances ... loco by the ... trio\nLet's continue here at ... junior meant today a celebrating his ... birthday June immense was born on our trip pretense Nineteen twenty eight in Evanston, Illinois there was a piano in a in the federally home his father showed him to ... and ...\nAnd junior ... was working as a semi pro or Chicago a buddy Egypt ten is be sitting in a European assume the Chicago area to demand is one of the great blues men among modern jazz greats\nYou'll hear a couple of sets of his music in the evenings ... let's begin with ms oldest regrets here's a song by Cole Porter\nThat said you demands recorded in Nineteen eighty three on an album that featured the sex what a stupid fat hit Newman along with Martin reviewer on base and Walter Bolden on drums sending out a happy ... birthday greeting to gene demands ... oldest regrets\nStreaming up the waitlist public radio was funded by you add Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students that would roll like for fall gee C. V. S. dot org\n\n\nWell\n[noise]\n\n[noise]\n...\nStreaming of New England public radio is made possible by you and by the keys garage in Williamsburg offering foreign and domestic on the repairs and he asked each certify technicians Massachusetts state inspections she keeps garage dot com\n\n\n\n\n\nStreaming of New England public radio is funded by you and they pass university graduate schools and asks and applied laboratory science at operations enrolling now for August twenty seven applications that they passed dot edu\n\n\n[laughter]\n\nStreaming of New England public radio is funded by you and they have to go to ... graduate schools asset applied laboratory science at operations that rolling now for August twenty seven applications at bay paths dot edu\nBang\n\nHis junior next year on any pure ... bono chance the jazz original by re branch recorded vote junior Manson Nineteen Seventy two for the album that loving skill and that was ... Crenshaw on these Harold white on drums relative Donald on percussion in junior man said you know ... bono chance\nEarlier today I was searching the YouTube for junior man's footage and I found a nice filled proponents of junior Henry Brian ... Blue Book and it was junior managed\nStreaming of the way when public radio is funded by you and killing rental architects a forty year legacy of commitment to community had designed celebrating the next generation of leadership at ... riddle dot com\nPlaying Duke Ellington sunset in the mocking bird a beautiful song by do from the queen's sweet here from the Nineteen Ninety four performance recorded in Munich it's from the album softly is in the morning sunrise Judy man's with Jimmy wouldn't Bobby Durham ... sunset and the mocking bird\n... she recorded fats Waller is great song on a Nineteen sixty to release called happy time it would again that said would you demands plane ms oldest regrets that was David fed had Newman on tenor saxophone which junior Manson in Nineteen eighty three session made for a beehive records\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional and education business health sciences at psychology hey I see dot edu [laughter]\n[laughter]\n\n\n\n\n[laughter]\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional and education business health sciences at psychology hey I see ... you\n\nStreaming of New England public radio was funded by you and cute little architect of the year legacy of commitment to community design celebrating the next generation of leadership vacuum read all dot com\n\nAnd turning\n\nNot\n\n\nAnd\nOf\nStreaming of New England public radio is funded by you and cute little architect of the year legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com\n[laughter]\n\n\nYou're\nAnd on\n\nMm\nMm Mm\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\nMm\nMm\nMm\nMm Mm\nMm\nAnd\n...\n...\n\n[noise]\n\n\n\nMm\n[noise]\nStreaming of New England public radio was funded by you added American International college offering low residency graduate programs for the working professional in education business health sciences and psychology A. I. C. dot edu\nNa\n\nMm\n\n\n\n\n\n[noise]\n\n\n\n\n\n\nMm\n\nStreaming of New England public radio is funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gee CVS dot org [noise]\n\n\n...\n\nHe\n\nHe\n\n\n\nIt's up to do that you became here on NPR with Glenn is enclosure\nThat beautiful arrangement and performance of both polls close enclosure with all due the ... and that was the ... ... email to Keith loved his son center Jason marshal on baritone and Andre merchants in on trombone\nGlass enclosures from the sunny side records for these two thousand ten ... blue is that he received ... eighty fourth birthday\nAnd we're hurting ... loco there would be interested in ... I'm On a new release some steeplechase park ... Upper West Side Story\nThis is New England public radio WFCR in Amherst Springfield Hartford in partnership with the most ... N. E. T. R. dot net but the latest news to me now to the b._b._c. World Service Sunday indeed PR news network at ... am six forty\nStreaming of New England public radio is funded by you and they passed university graduate schools asset applied data site that's at rolling for October twenty second applications at bay paths dot edu and\nStay tuned in the evenings jazz on mood we'll hear Harry Allen as well as Harry sweet citizen\nLet's continue with another sort of junior man studies his ... birthday the pianist born in Evanston, Illinois on October tenth Nineteen twenty eight still making music around New York I've seen the new mantra a couple of times which goes back a half a dozen years or so at the cafe loop on west thirteenth street to in New York\nAnd here's junior on the floating jazz festival in two thousand\nAnd your culture devoted to the music ... smoke this group includes the elite creed baritone sax with his ... along with Peter Washington on base Mickey broker on drums\nAnd a Jew demands here at the piano please don't let me just amongst ... boulevard we'll lose our\n\n\nHa ha\nHa ha ha ha\nHa\n\n\n\n[noise]\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences at psychology hey I see da da da\n\n\n\n\n\n\n\n\n\nAnd I\n\nAnd I\n\n\n... for\nOr ... or ...\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall Gees easy S. dot org\n\n[laughter]\n\n[laughter]\n\n[noise] [laughter]\n\n\n\n\n\n\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at the vet spaces from board room to room with a the equipment and inhouse catering hotel north Hampton dot com\n\n\n\n\n\n[laughter]\n[noise]\n\nMm na na na\nNa\nNa\nNa\nNa\nStreaming up the waitlist public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students that would roll lick for fall Gees easy S. dot org\nThat makes\nThen\n\nNa\nNa na\n\nStreaming of New England public radio is funded by you add the hotel or without offering six meeting at the vet spaces from board room to ballroom with a the equipment that house catering hotel north Hampton dot com\n\n\n\n\n[noise]\n[noise]\nMm\n\n\n\n[noise]\n\n\n\nStreaming of New England public radio was funded by you and valleys solar a local company installing roof ground amounts and do all access trackers helping households live carbon free and the four one tree valley solar dot solar\n\n[noise]\nNew\n\n\n\n\n\n[noise]\n[noise]\n\nStreaming of New England public radio was funded by you and they passed university graduate schools MS in higher education administration enrolling for October twenty second applications that they pass dot edu\n...\n\nAnd ... and you don't just and\nThen\nThen when\nIn\nAnd\n... and ...\n\nAnd\nAnd that is one day and\n...\n... Maine been\nIn a minute\nStreaming of New England public radio is one that brought you out of the hotel Northampton offering six meeting at the vet spaces from board room to room with a B equipment around the house catering hotel north south on dot com\n\nAfter\n\nIs\n\n\nNa na na", "year": "2018", "show_name": "Jazz &agrave; la Mode", "city": "Amherst", "day": "11"}