{"month": "10", "state": "MA", "station": "WFCR", "content": "Streaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gee CVS dot org\nIs on the mood is next year on NPR where it's a minute before each this is New England public radio WFCR in Amherst Springfield Hartford in partnership with UMass Amherst than at any PR dot net\n\nStreaming of New England public radio is funded by un they that university graduate schools MS and applied data science enrolling for October twenty second applications that they passed dot E. D. na\n\n\nVe\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology a icy dot edu\n\nStreaming of New England public radio is funded by you advocate that university graduate schools asset higher education administration enrolling for October twenty second applications at bay pass dot edu [noise]\n\n\n\nThat's really Hargrove you're on any pure ... months the two was composed by the Texas on sugar kitty Durham and played by really Hargrove on his ... savannah this was the most Latin Janice oriented of Roy ... grows recordings\nIn one of the Grammy Award for best Latin ... performance in Nineteen Ninety six\nDays a week ... native Roy Hargrove forty nights growth they he was there on shut that with a group that he calls his crew saw crews sold the Spanish word for crucible the melting pot\nAnd it's a band that included the Cuban ... to show up all day is along with ... the sexual tell your scary borrowed scent of each Sanchez\nThat was a Russell blown on guitar jump in each to his base in El negro Horatio ... son drums Roy Hargrove when moms\nWill hit more Roy Hargrove over the course of this evening's jazz on ... to celebrate his forty nights for the\nState to for her group with Roy ... Steve Davis Sonny Rollins Oscar Peterson in surreal and they will hit really hard road to a plane love for sale and cool walk I Wish I knew gross groove and these foolish things\nStreaming of New England public radio is funded by you killed riddle architects a forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com\nAnd it's just sort of it as we celebrate degree trigger Roy ...\nNa\nNa na na\n\nNa na\nNa\n...\nTo him and he didn't know ... and ... oh she na\nNa\nDreaming is kids kids kids\n\nI ... ... ... then my\nKnees you know who does\nA\n\n... a new ... new\nRenewed ...\nI\nCome back ... ...\n... ...\n[noise]\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school public online cage to twelve school personalizing education for Massachusetts students now would rolling fall gee CVS dot org\nAnd you can do to\nHere's they get any PR is offering a special treat sale deal on tickets for our jazz baby already party going us for an evening advancing thick helpful taught sex\nIt's sipping some bubbly our side car in the ski see at the hotel north happened on Saturday December first few clients with an early bird discount before Wednesday October Seventeen\nGrab your tickets now at any PR [noise]\n[noise]\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu [laughter]\n[noise]\n\nIt's like you to do that right here on any pure played Mario lose dream\nWas composed by ... euro who's their own base itself ... recording phone tango\nAnd that was ... and clear it it\nWas ... and ... and ... Murray Hill is dream from post you know there are there a phone tango ... plays the Academy of music in North Hampton on Saturday Night at seven thirty headlining this weekend's north Hampton jazz festival although the details are north ... stone or\nWhere it tests who's suitors singing the more Ghana king\nStreaming of New England public radio is funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students that were rolling for fall Gees easy S. dot org\nOf his uh suitors brand new release called picture in black and white and we begin with the trumpeter Joe mega really playing remember Irving Berlin song with a nice arrangement so if there's a new release ... it's called magic trick\nThis is an eighty eight fun doing good public radio stay tuned to know if it's a ... put on a ... Louis Armstrong with Oscar Peterson singing just one of those things and send a cannonball out all these spontaneous combustion\nKennedy ... al ... is one of the jazz greats seed with Lenny Bruce set of television clips that says circulated over the weekend and posted on the jazz blog at any P. R. dot net Saturday was Lenny Bruce his ... birthday anniversary\nThere was a lot of buzz about Lenny around Facebook and social media and this wonderful loan on earth thing of of this footage\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at the vet spaces from board room to room with a the equipment and the house catering hotel north Hampton dot com [noise]\n\n\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\n\nMm\n\nAnd\n...\n\n\n\n\nStreaming of New England public radio was funded by you when they got university graduate schools MSA creative non fiction writer and roll and go for August twenty seven applications that they pass dot edu\n[noise]\n\nUm da\nDa\n\n\nStreaming of New England public radio is funded by you and they have to go to ... graduate schools and asked and applied laboratory science at operations that rolling now for August twenty seven applications that they pass dot edu\n\n\n[noise]\n\nHere's NPR's offering a special pre cell deal on tickets for our Janice baby holiday party going us run either going to help folks taught sex\nIt's sipping some bubbly are slide card in speaking to who killed on Saturday December first few clients with an early bird this ... before Wednesday October Seventeen\nGrab your tickets no at any PR that\n\n\n[noise]\n\n\n[noise]\n\n[noise]\nHere's NPR's offering a special Korean Sylvia launcher origins baby holiday party on Saturday December first grab your tickets no at your nose\n\n[noise]\n...\nAnd her and\n\nAnnabelle\n\nStreaming of New England public radio is funded by you and valleys solar local ... design at installation helping household secure state or federal incentives and live carbon free and the four one three valleys solar dot solar\n\n\n[noise]\n\nIt's sunny ... was really hard grew clean I Wish I knew\nThat's a Nineteen Ninety One recording of the song by Harry born in ... Gordon really Hargrove was a twenty year old when he joined Sunday rolling son this milestone records released here's to the people\nIn nearly Twenty years later her group was still be young ... when he joined Rawlings it's Sundays idiots birthday coming through the the beacon theater in New York where relatives other guests included Ornette Coleman Jim whole enrolling ... really ... with Sonny Rollins mark ... playing I Wish I knew\nThat he is really hold grows forty ninth birthday\nWe heard mark soft skin on a brand new performance of glorious stiff the beautiful\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences at psychology a icy dot edu\nWest side story several years ago I posted a blog feature on Scotland follow the great basis to it comes to prominence with the bill Evans trio and who was ... tragically killed in a car accident in Nineteen sixty one at the age of twenty five\nMy blog is about the beautiful more written by Scott ... sister lean and published about a decade ago you can find it on the ... blog archive at any P. R. dot net\nAnd we've also produce that feature on Scott ... series which you can download an apple ... P. R. dot net\nI'm Tom ... thinks of joining me for this Tuesday nights ... this is New England public radio W. M. C. R. Amherst Springfield Hartford in partnership with UMass Amherst than it N. E. P. R. dot net\nStay tuned to laugh at your Korea play music but both Powell glass enclosure and tip is future it'll hit more of early Hargrove with Oscar Peterson and the focus of surreal it may\nWell let's continue a shock ... cheese appearing on Saturday afternoon at the north Hampton jazz festival right in the new now or twelve thirty to one thirty of the ... street in downtown Northampton it let's hear gates no singing a tune called the different thing she ... heard here on five per phone and Tony ...\nAnd ... only us lately a in she recalls the days the challenges he faced as a singer trying to sit in on premier Jim sessions around New York city ... it's a different thing [noise]\n\n\nWhere are you making the scene just trying to get hurt really you know what I mean the ... century house member\nA [noise]\nThe answers are saying you can\nHey\nStreaming up the public radio was funded by you Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts do now with rolling fall she sees E. S. dot org read\n[noise]\n\n\n... or ...\nOr ...\n\nDing\nDay\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now one rolling fall gee C. V. S. dot org [noise]\n\n\n[noise]\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see ...\n[noise] turned\n[noise]\n[noise]\nNo\nI don't know what's going\nAnd more\nStreaming of New England public radio was made possible by U M ICQ's garage in Williamsburg offering foreign and domestic on the repairs A. S. E. certifying technicians Massachusetts state inspections she keeps garage dot com will\nInto my\nWhat to do this and that was the one who worked in the first one in\n\nOn\n[noise]\nStreaming of delinquent public radio is funded by you and killed riddle architects a forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com\n[noise]\n... ... ...\n... ...\nAnd\nAnd and\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at the vet spaces from board room to room with a the equipment and in house catering hotel north Hampton dot com oh\nAnd\n...\nAnd ... and\n...\n... ...\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional and education business health sciences psychology A. I. C. dot edu [noise]\n\nOoh ow\n\n\nMm\n[noise]\nMm\n[noise]\n\n\n\n\n\n\nMm\nStreaming of New England public radio is funded by you add the hotel Northampton offering six meeting at the vet spaces from board room to room with a the equipment that house catering hotel north Hampton dot com\nThen it any new na\nNa\n\n\n\n\nStreaming up the waitlist public radio was funded by you add Greenfield commonwealth virtual school public odd like eight to twelve school personalizing education for Massachusetts students now would rolling fall gee C. V. S. dot org\n[noise] Mm\n\n[noise]\n[noise]\n[noise]\n... ... ... ... for\n\n\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school public online cage to twelve school personalizing education for Massachusetts students now would rolling for fall gee CVS dot org\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gee CVS dot org\n...\n\n\n\n\n...\n\n\n\n\n\n\n... uh-huh\nOh\nHere's they get any of the earth is offering a special treat failed the tickets are are jazz baby oh buddy party joined us for an evening of dancing to help folks taught sex\nIt's sipping some bubbly our side car in speaking the in the hotel non happened on Saturday December first few clients with an early bird discount before when they are Seventeen\nGrab your tickets no at any PR job\n\n\nDo\n\n\nStreaming of New England public radio is funded by you and bay path university graduate schools an ass and applied laboratory science at operations enrolling now for August twenty seventh applications at bay paths dot edu [noise]\n\n... Korea here on any Europe playing music by both Powell was tip is huge it preceded by glass enclosure\nAnd here from the Nineteen Ninety seven recording called remembering ... in France was Christian McBride and Roy hands while those ... Garrett and Josh were written in Korea and the piano tip is huge and glass enclosure [noise]\nThis is New England public radio WFCR in Amherst Springfield Hartford in partnership with UMass Amherst tended in each heat or not it\nFor the days latest news tuned in to the b._b._c. World Service in the ... news network at ... am six forty in Ninety One Ninety ... FM in Hampton Kennedy and an N. E. P. R. dot net\nOf archaea sixtieth birthday of terrorist Howard old and an tomorrow night's ... hearing Howard play a set of Duke Ellington classics including dancers in love and cut until ... jubilee stumped well Dexter Gordon tomorrow night with Donald bird clean Tanya\nWe also have done breeding organics quartet with guitarist Dave striker\nAnd a classic some piggy Leon believe our McCoys Heinrich looks at Brown\nAnd Lester Young including clip of Brown's beautiful Jim session performance of hold him in New York that's the line up that I'm starting to put together for tomorrow night's ... as we celebrate the sixtieth ... good tourist Harvard old in Iran New England public radio\nWell tonight we're featuring ... music it's Royce forty ninth birthday in areas with vocal this real MA in small so New York city a band that also includes the great center player Joel from and spike will there at the piano it's just a real ... singing Cole Porter's love for sale [noise]\nI was among the wing\nThat is the minimum\nI mean when we started banning\nWay they have been aware\nIn the near a big man I mean\nIs oh\nWait a minute now and\nThe age when the grid and finding it when the Germans want\nJust one of those things [noise]\nA judge in one of those please\nStreaming New England public radio is funded by us cute little architects of the year legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com\n[noise] he's one of\nMy\nOne of those fabulous [noise] our trip in\nThe mood I'm In\nIf we ...\n\nWe started streaming down\nWe've been aware\nShe was making\n\nStreaming of New England public radio was funded by un cute little architect of forty year legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com\n\n\n\n\n\nDid\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology a icy dot edu\nSo here's they get any ER is offering a special treat sale deal on tickets for our jazz baby already party join us for an evening advancing Kelso taught sex\nAnd sipping some bubbly are aside car in the ... the hotel do happen on Saturday December first few clients with at early or discount before Wednesday October Seventeen\nGrab your tickets now at any PR that [noise]\n\n\nI\nDon't\nYou\n\n\nYou know\n[laughter]\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gee CVS dot org\nNow and\n\n\n\n\n\n\nSo here's a tip any PR is offering a special treat failed the tickets for our Janice baby oh buddy party on Saturday December first grab your tickets no it's any PR net [noise]\n\n\nMm\nAnd\n\n\nDreaming of New England public radio was funded by un cute little architect or to your legacy of commitment to community a design celebrating the next generation of leadership vacuum riddle dot com\nNa\n\nNa\n\nNa na\nNa na\nNa\nNa\nNa\nNa na na\n\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gee CVS dot org\n[noise]\n\nAnd\nNa na\n", "show_name": "Jazz &agrave; la Mode", "year": "2018", "city": "Amherst", "day": "17"}