{"month": "10", "state": "MA", "station": "WFCR", "content": "Streaming of New England public radio was funded by you and the path university graduate schools MS and applied laboratories outside operations on roller no for August twenty seven applications that they passed dot edu\nMe PR Week nights at seven fresh air on any PR is funded by U. N. Z. Hartford symphony orchestra celebrating its Seventy fifth season opener with pictures at an exhibition with Carolyn ... conducting October fest through seventh Hartford symphony dot org\nI'm Beck's Taylor and on this Tuesday nights jazz Ala mode which is next at eight on New England public radio WFCR in Amherst Springfield Hartford in partnership with the UMass Amherst and that any P. R. dot net\nEnter now to win a very special day in Boston from any PR we have two great seat at the Boston opera house when Hamilton comes to town the hottest show ever on Broadway is hitting the road and you could see it in Boston on Saturday October thirteenth so you don't even have to wait that long\nYou'll be treated to a wonderful dinner at eastern standard kitchen and drinks and Ken more square the Boston eatery known for its amazing service in creative cuisine has donated dinner for two to our contest we're giving away these tickets to Hamilton tomorrow at the end of all things considered\nTo make sure you're in our drawing enter now while you're supporting any PR call eight hundred six three nine eight eight five zero or enter online at any P. R. dot net\nForecast for tonight chance of showers and thunderstorms some could produce heavy rain Lou around sixty tomorrow patchy fog in the early morning they're mostly sunny highest in the mid seventies\n[noise]\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology hey I see dot edu [noise]\n\nStreaming of New England public radio was funded by un June ... architects oh forty year legacy of commitment to community design celebrating the next generation of leadership a cute little dot com\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology icy dot edu\n\n\nHer she had the piano withdrew grass on base and Tom rainy on drums that with the un gee which stands for upper Manhattan medical group\nAnd that was composed by Billy stray horn and un jeeze also where straight horn received cancer treatment in New York City Fred Herschel will be encountered solo at the piano this Friday October fest at U. Conn\nOn ... on this Tuesday nights John Dillon mode\nAnd jazz only mode on any PR is funded by you and WFCR partners Amherst Hampshire Mount Holyoke in Smith colleges in the University of Massachusetts Amherst and celebrate Holyoke\nA local music festival in downtown Holyoke featuring music food and art open to all this Friday through Sunday celebrate Holyoke mass dot com\nAnd Steve Lewis Subaru three Fifteen Russell street on ... nine in Hadley featuring all wheel drive vehicles for the ... valley since Nineteen Ninety eight Steve Lewis Subaru dot com ...\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology a icy dot edu\nPublic radio in New England Public radio are based on a very simple modeled we tried to do something essential and important really well and then we count on those who appreciate what we do to show us their support at New England public radio were dedicated to playing great jazz every day the best recordings from almost a century of amazing music\n\n\n\n\n\n\n\n\n\n\nNo\nStreaming of New England public radio was funded by us valley solar a local photovoltaic designed to the installation company serving people and wound up to live carbon free and the four one three valleys solar dot solar\n...\nStreaming of New England public radio was funded by you and they passed university graduate schools MS in higher education administration enrolling for October twenty second applications that they pass dot edu\nNo\n\nCarson on tenor saxophone and that's Ron Carter on base\nInterviewing two tickets to Hamilton from an e P R you could win two great seats at the Boston opera house and dinner afterwards that eastern standard\nAnd turned out any P. R. dot net\nFred Astaire was written by Dorothy Fields and Jerome Kern and Frank Sinatra also recorded\nThe way you look tonight in the mid sixties Houston Person is currently appearing with the north Hampton jazz workshop he has two shows tonight in North Hampton and uh the that the way you look to nice actually from Houston Person Enron Carter's new album called remember love\nBefore that we heard from tenor saxophone is Jerry Wheldon along with Kyle cold around the Hammond be three and we heard strangers in the night which is also associated\nI'm associated with Frank Sinatra and done tomorrow night's jazz Ala mode Tom rainy will be featuring Frank Sinatra and Count Basie tune in to eat to eighty eight five New England public radio tomorrow night from eight until eleven for the great sounds of Sinatra NBC\nStarted things off with Cyrus Chestnut and his trio in darned that dream which interspersed ... weasel that's from Cyrus chestnuts new album out on high no records called kaleidoscope\nI'm Beck's Taylor hosting tonight jazz Ala mode on New England public radio in Amherst in Springfield at eighty eight five also in Pittsfield that one oh six one and that any P. R. dot net\nWe funded New England public radio on the honor system listeners make their contributions because they know it's their support that keeps marketplace fresh air and jazz Ala mode on the air it's simple listener contributions are the single largest source of revenue for New England public radio without essential ongoing listeners support any PR would not exist\nThat's why your support is so important and powerful\nThe listeners of New England public radio choose to support the station and do so because they know how essential their support is\nYou can also enter to win a pair of tickets to see Hamilton in Boston on October thirteenth\nWe're giving away these tickets to Hamilton tomorrow after all things considered to make sure you are in our drying please renew your supportive New England public radio or make your first time contribution right now it's easy to do at any P. R. dot net or by calling eight hundred six three nine eight eight five zero\nMetal and pay route will be at the Academy of music in Northampton a week from today Tuesday October ninth pay rue emerged from the Latin Quarter in Paris where she bust when she was a teenager she earned immediate comparisons to the local styling of Billie Holiday from her debut album dreamland\nStreaming of New England public radio was funded by you add American International college offering law residency graduate programs for the working professional in education business health sciences psychology icy dot edu inroads on New England public radio\n\nDays do you keep from a\nI\nDo them okay yeah\n[laughter]\n\nStreaming of New England public radio was funded by un cute little architect or forty year legacy of commitment to community design celebrating the next generation of leadership a cute little dog call\nOne\n\n\n\n\n\n\nDreaming of New England public radio was funded by you and cute little architect or forty year legacy of commitment to community a design celebrating the next generation of leadership a cute little dot com [noise]\n\nZach Brown's along with Aaron Goldberg at the piano met Penman on base and Derek Holland on drums and that was monks dream which was composed by alone is monk and that's from Zach ... album almost never was that was a twenty twelve release on crisscross jazz records\nSack rock will be at the bing art center on ... in Springfield this Saturday with the ... project which is based on the\nCut paper collages of Matisse that were published in Nineteen forty seven is jazz\nBefore is that rock we heard from Madeleine pay roof from her two thousand and four album careless love we heard dance me to the end of love which was composed by Leonard Cohen and we started off the set with metal and pay route from her debut album from Nineteen Ninety six called dreamland\nWe heard ... which was the signature song of the little ... eat uh PF\nMetal and pay roof will be appearing at the Academy of music in North Hampton next Tuesday October night\nJazz Ala mode on any PR it's funded by you end up being art center in Springfield forest park neighborhood presenting jazz clubs Saturday at eight featuring the ... jazz project and Zach rock tickets at being Arts Center dot org and Greenfield commonwealth virtual school a public ...\nStreaming of New England public radio was flooded by Ewan Kunar riddle architects or forty year legacy of commitment to community a design celebrating the next generation of leadership acute riddle dot com\nEnrolling for fall gee C. V. S. dot org and paradise city arts festival two hundred and fifty jury to artists him makers from across America this coming weekend at the three county fairgrounds in Northampton paradise city arts dot com\nYou listen to jazz because it's something you love it's a it's an essential part of who you are\nJazz music that makes a difference to you and for you jazz is as essential to you and to New England public radio is essential to the cultural life of our community and you are in turn essential to New England public radio\nBecome a contributor right now it's easy to do at any P. R. dot net or by calling eight hundred six three nine eight eight five zero\nTrumpeter Joe ... is a native of Syracuse and moved to New York city in the mid eighties from his new album magic trick we'll hear magna really with John heart on guitar\nAnd just so long associated with not king coal L. O. V. E. net recorded it on his Nineteen sixty five album also called L O V E and it was actually composed by Burt camp for who originally recorded it for his album blue midnight as an instrumental\nOn the album that came out a year before Nat King Cole recorded his ... Gabler wrote the lyric L. O. V. E. on any PR\n\n[noise]\n\n\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences at psychology a icy dot edu\nDaniel\n\nThe\nThe show\n...\nAbout there's\nStreaming of New England public radio was funded by you when they pass university graduate schools MSA creative non fiction writer enrolling no for August twenty seven applications that they pass dot edu\nThen her ...\nFor\n\n\n[noise] [noise]\n[noise]\nMm\nMm Mm Mm Mm no ... [noise]\n... the ...\n...\nOne's\nHad\nA very\nVery\nFrom Nineteen sixty two Paul Desmond on Alto and Gerry Mulligan a baritone sax with hooky Carmichael star dust and that also had window marshal on base and county K on drums from their album to all of a mind\nStarted things off new music from Joe magna really he was there on trumpet with John heart on guitar bend will fund base and Byron landing on drums we heard L. O. V. E. that's from ... new album magic trick which is that an steeplechase records\nOn backs Taylor thanks for tuning in for jazz Ala mode on New England public radio WFCR in Amherst Springfield Hartford in partnership with UMass Amherst and daddy\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now are rolling for fall gee CVS dot org\nGreat seats at the Boston opera house when Hamilton comes to town the hottest show ever on Broadway as hitting the road and you could check it out in Boston on Saturday October thirteenth\nAnd then you'll be treated to a wonderful dinner at eastern standard and Ken more square the Boston eatery is known for its amazing service and creative cuisine and they donate a dinner for two to our contest\nWe're giving away these tickets to Hamilton tomorrow at the end of all things considered so make sure you're in our drawing enter now while you're supporting any PR call eight hundred six three nine eight eight five zero or enter online at any P. R. dot net\nForecast tonight chance of showers and thunderstorms some of them could produce heavy rain Lou around sixty degrees tomorrow Apache fog early in the mornings and mostly sunny highs in the mid seventies tomorrow night partly cloudy would lose in the fifties and Saturday partly sunny was hiding or eighty\nFrom the four CD box at that came out earlier this year Miles Davis and John Coltrane the final tour here's miles and trained with Wynton Kelly at the piano Paul Chambers on base and to be caught on drums would the standard all the view from march twenty first Nineteen sixty concert in Paris miles into trained on any PR\n[noise]\n\n\n[noise]\n\n[laughter]\nStreaming of New England public radio is funded by you and they have to go to ... graduate schools and asset applied laboratories outside operations San rolling now for August twenty seven applications at bay paths dot edu\n\nStreaming of New England public radio is one that brought you out of the hotel north now offering six meeting on the basis for a board room to room with a the equipment that house catering hotel north south on dot com\n\n\n[noise]\n[noise]\n\n\n\nStreaming of New England public radio was funded by un cute little architect or to your legacy of commitment to community design celebrating the next generation of leadership a cute little dog call\n\n\n[noise]\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences at psychology hey I see ...\n\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gene CVS dot org\n\n\n\n\n\n\n\nBrand new music from Erin Goldberg she's there at the piano\nWhereas my a ... pen men on base and Leon Parker on drums Aaron Goldberg new album is called at the edge of the world the talents Sunnyside Records and we heard isn't this might sound around me were tricked composed by Bobby ... originally\nAnd it was on his out Manhattan Blue Ridge which was a to whack with McCoy China are recorded in Nineteen Ninety three\nStreaming of New England public radio was funded raw you add American International college offering low residency graduate programs for the working professional and education ... health sciences and psychology a ... you\nKnow those Davis and John Coltrane started things off with all of you that was recorded in March of Nineteen sixty you can find that on a four CD set Miles Davis and John Coltrane the final toward the bootleg series volume six\nOn ... Taylor in on this Tuesday nights jazz Ala mode on New England public radio in Amherst and Hartford at eighty five also when Lee at Ninety three and at any P. R. dot net\nJazz Ala mode on any PR it's funded by you and the north Hampton brewery welcoming community friends and family to lunch dinner or just a couple of beers for over Thirty years\nAnd ... made in recital hall in stores Connecticut presenting jazz pianist Fred harrsion a solo concert on friday October fifth\nAt eight V. D. M. dot ... dot edu\nAnd ds pie shows in association with any PR presenting Madeline Hebrew at the Academy of music theater in North Hampton on Tuesday October nights tickets at the S P shows dot com\nYour enjoyment of New England public radio today was made possible by donations in the past\nYour donation today will make possible the great jazz at New England public radio will play tomorrow\nYour gift today plays the music forward into next month in next year it only takes a minute out of your evening ended vital to the station and jazz Ala mode become a standard by going to any P. R. dot net or by calling eight hundred six three nine eight eight five zero and don't forget we're giving away a pair of tickets to see Hamilton in Boston\nAnd time is of the essence we're pulling the winner after tomorrow's all things considered more details can be found at any P. R. dot net\nEighty year old tenor saxophone his boots the Barnes is still hard at work playing live dates in his native Philadelphia\nHe has also a coed Erie also co leads a dual tenor session with Larry McKenna and features Lucas brown on him and to be three this is the title track from their new album on cell or live records the more I see you on New England public radio\n\n\nNah\n\nStreaming of New England public radio was funded by us they have to go to ... graduate schools MS applied laboratory style set operations that rolling no for August twenty several applications that they passed dot edu right\nNow\nAnd ... na\nNa na\nNa na\nNa\nNa na na na\nNa na\nNa na na\n\n[noise] [noise]\nStreaming of New England public radio is funded by you and they have university graduate schools and asset applied laboratory science that operation that rolling now for August twenty seven applications that they pass dot edu [noise]\n[noise]\nUm\n\nEntered a win two tickets to Hamilton from an e P R you could win two great seats at the Boston opera house and dinner afterwards the eastern standard\nEnter now in any P. R. dot net\n... and ...\n\n\nNames of\nShe\n\nBeach oh\nBed\n\n\n\n\nEnd\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school public ... school personalizing education for Massachusetts students now are rolling for fall juice CVS dot org [noise]\n\n\nThe mark ... band with Marx original Serino and that's from their album days months and years and the interplay at the beginning of that chain between the saxophone reminded me of Jimmy Jew frame ... will be at the ... old ... Connecticut this Friday October fifth\nAnd we heard mark there on sex and John being on tenor sax much further ... at the piano and that was mark ... on guitar and Oscar satanic on drums and the ... days months years\nWe also her new music from boots the barns and to Larry McKenna two tenor saxophone is leading their group with Lucas brown on the him and be three in Byron land on drums we heard the title track from their new album the more I see you and that's at an seller live records and that title track was composed by Harry Warren\nJazz Ala mode on NPR's funded by you and the Hartford symphony orchestra celebrating at Seventy fifth season opener with pictures at an exhibition with Carolyn ... conducting October fifth through seven Hartford symphony dot org\nAnd ds ... shows an association with any PR presenting Madeleine pay rue at the Academy of music theater in North Hampton on Tuesday October nights\nTickets at D. S. P. shows dot com and ... village senior living Westfield offering assisted living and compass memory support with evidence based treatment for those with memory loss Mort arm Brooke village dot com\nA great jazz ensemble is more than the sum of its parts of the group effort and the support of listeners at New England public radio works the same way now's your chance to support jazz and your public radio station given any P. R. dot net\nOr call eight hundred sixty nine eight eight five zero you could show off your support by wearing the any PR ... disease available when you get thirty dollars a month\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now we're rolling for fall gee CVS dot org\n... on October thirteenth including dinner for two at eastern standard will be pulling the winner of the two tickets tomorrow at the end of all things considered entered the contest and donate to any P. R. A. N. E. P. R. dot net or by calling eight hundred six three nine eighty five zero\n[noise] earlier we heard something from the final tour of Miles Davis and John Coltrane the final tour had its official release earlier this year another official release in twenty Eighteen was the last album of John Coltrane\nAnd title both directions at once from that last album recorded in Nineteen sixty three ... three here's train on ... Jimmy Garrison and Elvin Jones was really a New England public radio\n\nEntered when two tickets to Hamilton from an e P R you could win two great seats at the Boston opera house and dinner afterwards that eastern standard\nEnter now in any P. R. dot net\n[noise]\n\n[noise] the ...\nFrom his album from Nineteen fifty seven called dial asks for sunny that was sunny clerk\nAt the piano and the title track from his album and that featured art farmer on trumpet Curtis Fuller on trombone heck Mobley M. tenor sax also Wilbur where I'm based and Louis Hayes on drums sibling recording dial ask for sunny\nBefore that we heard from John Coltrane recorded in March of Nineteen sixty three we heard really uh take three and that's from the\nAlbum both directions at once the last album Coltrane on saxophone and that was quite tenure at the piano Jimmy Garrison bass and elves and joins on drums I'm ...\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology a ... you\nUFC are immersed Springfield Hartford in partnership with the UMass Amherst and that any P. R. dot net\nYou can enter to win a very special day in Boston from any PR we're giving away two tickets to see Hamilton at the Boston opera house the hottest show ever on Broadway is hitting the road and you could see it in Boston on Saturday October thirteenth\nAfterwards you'll be treated to dinner for two at eastern standard and Ken more square\nThe Boston eatery known for its amazing service and creative cuisine has donated dinner for two to our contest\nWe're giving away these tickets to Hamilton tomorrow at the end of all things considered to make sure you're in our drawing enter now while you're supporting any PR called eight hundred sixty nine eight eight five zero or enter online at any P. R. dot net\nForecast for tonight chance of showers and thunderstorms some could produce heavy rain low around sixty tomorrow patchy fog in the early mornings and mostly sunny highest in the mid seventies tomorrow night partly cloudy would lose in the low fifties and Thursday partly sunny with ... eighty\nDiana crawl will be at the Hanover theater in West or the Saturday he or she is with Christian McBride on base and Russell I'm Alone on guitar and the standard all or nothing at all on any PR\n[noise]\nNever to you know to me [noise]\nNever good he to me\nThen I'd rather have nothing at\nAll I knew\nNothing at all [noise]\nIt's not very very you know in the brain wiring began and cry or something that might have been no I'd rather have none\nStreaming of New England public radio was funded by you and they passed university graduate schools MS in higher education administration enrolling for October ... second applications that they pass dot edu\nYou're so close to my cheek\nDon't mean to be on the\nGo\nThe to any ... I asked the judge and makes me a week and I mean grow does she see an end\nTo the\nNFL under the spell of your calls\nWould be caught in the\n... and so you see I've got to say no\nNo\nNo no I don't know who\nBody and they they they\nDo\nDo do do do do do\n\nDo do do do you do and\n\nDon't judge live so close to my mind she can ... does not mean to be gone for\nDo the kids didn't rise the judge of your hand maybe me weeks and then not much maybe grows dizzy and fall\nAnd spy fell into the town of your ...\nWould be God in the I'm\nThere to [noise] do you see\nAnd you're doing two tickets to Hamilton from and BP are you could win ... seats at the Boston opera house and dinner afterwards that eastern standard enter now in any P. R. dot net\nOr not\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n... ...\nYou know and it and\n\nMade\nAd in looking\n\n\n\nDreaming of New England public radio was funded by un cute little architect or forty year legacy of commitment to community design celebrating the next generation of leadership a cute little dog call\nNa na\n...\n\n\n\nNah [noise]\n\n[noise] oh no\n[noise]\nStreaming of New England public radio was funded by us valley solar a local photovoltaic designed to the installation company serving people apply to deliver carbon free one three valleys solar dot solar\n\nOh you know what\n[noise] and\n... ...\n...\n\nNa\n[noise] and\nHad a\n...\n[noise] ...\n...\n...\n[noise] and\n...\n\nNa ... Mm\nMm Mm how\nEntered when two tickets to Hamilton from an e P R you could win two great seats at the Boston upper health and dinner afterwards the eastern standard\nAnd turned out any P. R. dot net\n\n\n\n[noise] ...\n...\n\n\n\n\n\n\n\nMm [noise]\n\n[noise]\nThat ...\nYou\n\nStreaming up New England public radio was funded by you ... valley solar a local photovoltaic designed to the installation company serving people at the lead up to live carbon free for one three valleys solar dot solar\n... [noise]\n\n... ... you [noise]\nNa\nNa\n\nNa and AA and\n\nNa na\nIn\nMotion\nStreaming of New England public radio was made possible by you and by the keys garage in Williamsburg offering foreign and domestic on the repairs and you ask each certifying technicians Massachusetts state inspections she keeps garage dot com\n\n\nStreaming of New England public radio was funded by you and valleys solar a local company install like Ruth ground amounts and do all access trackers helping household live carbon free and the far one tree valley solar dot solar\nAgain and again\nMhm\nStreaming of New England public radio is funded by you and they have to go to ... graduate schools and asset applied laboratory science at operations that rolling now for August twenty seven applications that they pass dot edu\nShould be able\nAge and [noise]\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences at psychology hey I see dot edu\n\nNa na na na na na", "show_name": "Jazz &agrave; la Mode", "year": "2018", "city": "Amherst", "day": "03"}