{"month": "10", "state": "MA", "station": "WFCR", "content": "Streaming of New England public radio was funded by us base at university graduate schools MS in higher education administrator show enrolling for October twenty second applications that they pass dot edu\nI'm Beck's Taylor hosting tonight's jak all emerged Richard next eight on New England public radio WFCR in Amherst Springfield Hartford in partnership with UMass Amherst and daddy any P. R. dot net\nThere was a freeze warning overnight in effect right now through also tomorrow morning around nine o'clock it's going to end\nTonight the forecasts it's mostly clear on coal lives in the upper twenties tomorrow sunny with highs around sixty tried increasing clouds with Louis in the lower forties and Saturday partly cloudy with a slight chance of rain ... in the upper thirty\nI'm\n[noise]\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu [noise]\nA beach for\nShowed\nDa da\n\nDa\n\nDreaming of New England public radio was for the ball you a cute little architect or forty your legacy of commitment to community others are celebrating the next generation of leadership a cute little dot com [noise]\n\n\n\nHis album portrait in sound that's trombone Steve Davis and I'm old fashioned and we heard David hazel time there at the piano with Steve Nelson on vibes net Reeves on base\nAnd Joe Farnsworth on drums Steve Davis will be closing out this weekend's north Hampton jazz festival on Sunday at the hotel north Hampton jazz branch with vocalist Linda ransom and the jazz branches a fundraiser for the jazz and schools program which brings professional jazz musicians into the north Hampton public schools\nThe Jazz Fest kicks off tomorrow night with the friday night stride where many restaurants bars and clubs around north Hampton will host lab jazz combo throughout the night on Saturday mirror brag added Dominic eat\nKick off the day of performances at eleven AM at click workspace on market street others performing throughout Saturday or ... ... ... and Saturdays festivities close with ... D Rivera at the Academy of music more information can be found at north Hampton Jazz Fest dot org\nI'm ... sitting in on this Thursday nights jazz Ala mode stay tuned for nearest brag with easy living guitarists Cheryl daily basis\nStreaming of New England public radio is made possible by you and Boise cues garage in Williamsburg offering foreign and domestic all the repairs AS you certify technicians and Massachusetts state inspections excuse garage dot com\nI Bobby troops troop centennial is today jazz only mode on any PR it's funded by you and the hearts for school accepting applications for the twenty Eighteen Nineteen school years early childhood through high school programs clarity of dont want the heart and strength of purpose hearts Brooke dot org\nAnd the ... community serving older adults in the Quaker tradition since Nineteen eighty nine senior independent living in North Hampton in East Hampton in Massachusetts lease rep dot Kendall dot org\nAnd Thomas Douglas architects in architecture interior design studio designing education projects including the Smith College conference center T Douglas architects dot com\nPianist mirror bragging vocalist Dominique eat start off Saturdays festivities as part of the weekend long north Hampton Jazz Fest his mirror what the piano with the standard easy living a New England public radio [noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\nStreaming of New England public radio was funded by un June riddle architect of forty year legacy of combat but to community a design celebrating the next generation of leadership at ... riddle dot com Mm\nAnd\nStreaming of New England public radio was funded by you added American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\n\nDa\n...\nStreaming of New England public radio is funded by you when they got university graduate schools and asset applied data science enrolling for October twenty second applications that they pass dot edu\nSteve Davis cruising at a set of artist who will be have this weekend's Northampton jazz festival and we heard Nikki Dee from his albums for real that Saddam positron records came out in twenty fourteen and Steve Davis will be featured at Sunday's jazz branch along with vocalist winter ransom\nBefore that we heard from ... strum who's Harvey ass on a cruise ship basin Cheryl daily on a cruise to get tired and we heard blues an ass\nDreaming of New England public radio was ... you are on cue and riddle architect or forty or your luggage your commitment to community a bizarre celebrating the next generation of leadership a cute little dog call\nOut in twenty Fifteen there'll be appearing at the parlor room on Saturday for three Fifteen to four Fifteen before that vocalist Dominique eat\nWith moonlight in Vermont and we heard Ron Blake there at the piano Dominique eat will be appearing with mirrors brag on Saturday from eleven 'til noon they're starting they're they're the ones kicking off Saturdays\nUm performances and there'll be appearing again eleven 'til noon at click workspace on market street in North Hampton and we started things off with narrows brag and easy living from his two thousand and five album called opening\nI'm Beck's Taylor thanks for tuning into jazz only mode on New England public radio in Amherst in Hartford at eighty five also in great Barrington at Ninety eight seven and at any P. R. dot net she'd like more information or to check out the complete schedule of the north Hampton Jazz Fest you can go to North Hampton Jazz Fest dot org\nNew England public public radio is planning another jazz baby party\nThe hotel north Hampton which was built in Nineteen twenty seven is the perfect venue for this party don't miss this year's jazz baby\nLast year people turned out in their Nineteen twenties inspired finest and danced all night to kill so it was hot six the band is coming back up from New York City and stumped box trio will be playing downstairs in the speak easy where you can sample prohibition era cocktails you're invited to our Jazz Age themed holiday\nUh bash get your tickets now at any P. R. dot net\nToday is Bobby troops centennial\nThe pianist composer and actor was born October Eighteenth Nineteen Eighteen in Harrisburg, Pennsylvania\nNot only did he composed a well known get your kicks on route sixty six which was a hit for Nat King Cole trio he also wrote the meaning of the blues you're looking at me baby baby all the time and the lyrics to Ellington the feeling of jazz among many other songs\nAnd he starred in the Nineteen seventies TV show emergency as Dr Joe early and was married to sing or an actress Julie London who also start on emergency ... passed away in Nineteen Ninety nine at the age of eighty\nWill start off the set of Bobby troop tunes with a special recording from Nat King Cole Cole disbanded his trio and didn't really play the piano and many recordings after that in Nineteen\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gee CVS dot org Willie Smith once he's all stuffed Smith and also Harry sweets Edison\nHere sweets on trumpet with NASA can call it the piano and Bobby troops most famous and recognizable song get your kicks hundred sixty six\n[noise]\n\n\n\n\nI have a plan\nTotal west to\nWe take the highly you better check on a second [noise]\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology a icy dot edu [noise]\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gee C. V. S. dot org\nMoney oh\n\n\n\n\nMm\n\n[noise]\n\n\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education and health sciences psychology ice sheet dot edu\n\n\n\n[noise] [noise]\n\n\n[noise]\nStreaming of New England public radio is made possible by you among the cues garage in Williamsburg offering foreign and domestic all the repairs are yes you certify technicians Massachusetts state inspections excuse garage dot com\n[noise]\n\n[noise]\n\nYou're\n...\n...\n... ... ... ...\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology a icy dot edu [noise]\n[noise]\n\n[noise]\n\nMusic from Jeb Patton there at the piano along with David Wong on base and Rodney green\nOn drums that was royal guard and blues as well as Kelley Blue Kelly ... blue was composed by Wynton Kelly that's from Jeb patents a new album temp dish live in New York and that was recorded a four seller live records\nOn backs Taylor hosting tonight's jazz Ala mode on New England public radio WFCR in Amherst Springfield Hartford in partnership with the UMass Amherst and at any P. R. dot net\nJazz Ala mode on any PR it's funded by you and do you ... Center for the performing arts in stores presenting underground railroad featuring American soprano Kathleen Battle and pianist Joe Martin on friday October twenty six at eight\nAnd Greenfield commonwealth virtual school a public on line K. to twelve school personalizing education for Massachusetts students now in rolling for fall gee C. V. S. dot org\nThere is a freeze warning for most of our area overnight through tomorrow morning\nThe forecast for tonight mostly clearance cold lose in the upper twenties tomorrow Sunday with highs around sixty degrees tomorrow night increasing clouds would lose in the lower forties Saturday partly cloudy with a slight chance of rain lose in the upper thirties and Sunday mostly sunny with a high near fifty\nDon Brayden envy organics quartet will be appearing at the Unitarian society on main street in North Hampton this Saturday as part of the north Hampton jazz festival from their twenty Fifteen release loom in our city here's done breeding a saxophone with ... horns jazz standard Chelsea Bridge on any PR\n\nStreaming of New England public radio was funded by you a big university graduate schools MS at higher education minister racial rolling for October twenty second applications that they pass dot edu Mm\n\n\n\n\n\n\nMm\n\n\nOh\n\n\nMm\n\n\n\n\n\nStreaming of New England public radio is funded by you and they passed university graduate schools and that should apply data ... enrolling for October twenty second applications at bay past dot edu\n\nNew\n\nMhm\nMm\nOh\n\nNa na\nNa\n\n...\n\n\n...\n\n\n\nStreaming of New England public radio is funded by you and they pass university graduate schools MS and applied laboratory science at operations on rolling now for August twenty seven applications that they passed dot edu Mm\n\n\n\n\n\n\n\nMm\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see ... D you\nStreaming of New England public radio was funded by you and they passed university graduate schools and I say in creative non fiction writing enrolling now for August twenty seven applications that they pass dot edu\n\n\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology a icy di di di\n\nStreaming of New England public radio was funded by Ewan big university graduate schools am of creative non fiction writer and roll and go for August twenty seven applications are very past dot edu\n[noise]\n\nThe Steve Davis quintet and daydream that was recorded live at smalls in two thousand and nine Steve Davis they're on trombone with Larry will is at the piano and that was my ... on Alto sax along with Willie Jones a third on drums and Gerald cannon on base\nBefore that we heard from your steep on base and done great and on tenor sax and our love is here to stay and that's from their album conversations and that also featured mount Wilson there on drums\nAnd we started things off with Don breed in their own Tanner and Chelsea Bridge from the ... which was from Don Britain and the organics quartet and that came out in twenty Fifteen\nAnd Don ... as well as Steve Davis will both be at the north Hampton jazz festival this coming weekend and you can check out the schedule on line at north Hampton Jazz Fest dot org\nI'm backs Taylor thanks for tuning in on this Thursday nights jazz Ala mode on New England public radio in Amherst in Springfield at eighty eight five also Williamstown at Ninety six three and that any P. R. dot net\nJazz Ala mode on any PR is funded by you and WFCR partners\nAmherst Hampshire Mount Holyoke and Smith colleges and the University of Massachusetts Amherst and pleasant journey used cars in North Hampton offering pre owned vehicles with a twelve month twelve thousand mile warranty inventory of pleasant journey dot com\nAnd so let me appliance offering thirty brands of appliances including subzero wolf Milan and thermal doors since Nineteen fifty six so let me appliance dot com\nJoined us on Sunday evening at seven for debate between democratic Senator Elizabeth Warren and Republican challenger Geoff Diehl\nFind out what the candidates for Senate have to say about what are the important issues facing Massachusetts voters\nAnd there were only western Massachusetts debate before the November ... election WG be wise carry cell do will moderate that Sunday evening at seven on eighty eight five WFCR and on the stations of the NPR News network leak Conan will be at the side\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gee CVS dot org\nSaturday the twentieth from his twenty Thirteen recording for high no records costumes are mandatory here's Lee Curtis on Alto with Larry granted here on base and the standard body and soul on any PR\n\n[noise]\n[noise]\n[noise]\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\n\n\nNo no no no\nNo no\nNo no no no no\n\n\n\n[noise]\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now and rolling for fall gee CVS dot org [noise]\n[noise]\n\nThe league Conan Its court had with the standard Alone Together leave their on Alto with Kenny barren at the piano and that was Kenny Washington on drums with James Genus on base that's from the album jazz knocked turn which came out in Nineteen Ninety four on evidence records\nBefore that we heard leak on its own Alto and Larry granted here on base and this little do wet there between the two of them with body and soul that's from a\n... it says album costumes are mandatory which is out on high no records bleak on its core tent will be at the side door an old ... Connecticut for tonight's tomorrow night and Saturday\nJazz Ella mode on any PR is funded by you and the west or cultural coalition presenting allude to joy the west or course celebrates Chris shepherds tense here as musical director and mechanical on October twenty eighth programming on any PR it's funded by you and the corporation for public broadcasting\nWynton Marsalis turned fifty seven years old today a member of the young lions who arrived on the scene in the early eighties including markets Roberts Joshua Redmond Branford Marsalis in very Hargrove Wynton made his first recordings with the art Blakey big band and joined the Jazz Messengers\nFrom his Nineteen Ninety One album standard time volume two intimacy calling here's Wynton Marsalis on trumpet\nAnd when it sleepy time down south\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology a ice sheet ... [noise]\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now would rolling fall gee C. V. S. dot org\n\n\n\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology a icy dot edu [noise]\n[noise]\n\n\n\nWynton Marsalis with the Lincoln Center jazz orchestra from the other big train that was smokestack shuffle\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school public ... school personalizing education for Massachusetts students now are rolling for fall gee CVS dot org\nStarted things off with when it sleepy time down south from his album standard time volume two intimacy calling and Wynton turned fifty seven years old today who was born October Eighteen Nineteen sixty one\nIn New Orleans I'm backs Taylor on this Thursday nights jazz Ala mode on New England public radio WFCR in Amherst Springfield Hartford\nIn partnership with the UMass Amherst and at any P. R. dot net there was a freeze warning overnight through tomorrow morning and the forecast for tonight mostly clear and cold those in the upper twenties\nTomorrow sunny with highs around sixty tomorrow night increasing clouds would lose in the lower forties and Saturday partly cloudy with a slight chance of rain losing the upper thirties and looking towards Sunday mostly sunny with a higher fifty\nWinter in Marcellus his brother Branford is bringing his quartet to our area this weekend\nTomorrow night Branford will be mechanics hall in Worcester on Saturday the twentieth he'll be in Redmond Vermont at the paramount theatre and on Sunday the twenty first brand for drinks as quartet back down Ninety One and we'll be at the Bush now in Hartford\nHere's Branford Marsalis on saxophone with Billy straight horns un gee from his out in the trio gp on any PR\n...\n...\n\n\n\n\nHave\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional and education business health sciences psychology a icy da da da\nDa da\n\n\nDa da da\nDa\nDa da\nDa da da da\nDa da\n\n\nDa\nDa da da da da da da da na\n\nNa na\nNa\nNa\nNa na\n\nNa na na na na\n\nNa na na\nNa na na\n\nNa na na na na\n[noise]\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional and education business health sciences psychology a icy da da da\n\nDa da\n\nDa da da\nDa da da\n\nDa da\n\n\n\n\n\nDa\n\n\n\nDa da\n\nDa\n\nNa\n\nNa na\nNa na na na na\nNa\n\n\n\nShow\n\nStreaming of New England public radio is funded by you at the hotel Northampton offering six meeting at the vet spaces for a board room to room with a the equipment and the house catering hotel north Hampton dot com and\nWas in the shit\nAny\n\n\n\nSay no\nDreaming of New England public radio was funded by un June riddle architect of the year legacy of commitment to community design celebrating the next generation of leadership a cute little dot com [noise]\n\nJust\n\n\n\n\n\n\nBrand name is\nStreaming of New England public radio was funded raw you add American International college offering low residency graduate programs for the working professional in education ... health sciences psychology a ... D you\nOn base Josh Evans on trumpet market Strickland on sex and the sheet weights on drums\nAnd before that we heard from Branford Marcellus from his twenty twelve release we her tail and brand for their own saxophone with joy counter out so\nAt the piano or grievous on base and Justin fault in our on drums and before that we heard Branford Marcellus from his out in the trio gp we heard un energy\nAnd the Branford Marcellus quartet will be appearing tomorrow night friday October nineteenth that mechanics hall in Worcester and then Saturday the ... they are going up to roll in Vermont and there'll be at the paramount theatre and then they're back down in Connecticut on Sunday on the twenty first they will be at the Bush now in Hartford\nI'm Beck's Taylor hosting tonight's jazz Ala mode on New England public radio in Amherst in Hartford at eighty eight five also in Lee and Ninety eight three and at any P. R. dot net\nOn the sixtieth anniversary of Edward arm arose famous critique of American media Ilan Stevens and ray Suarez discussed the state of the media\nToday in a seven part in contrast a pod cast series and also in a two part radio special airing at two on Sunday October twenty first and the twenty eighth on the stations on the NPR News network you can find more information about the podcast and radio specials by clicking on\nThe what's wrong with American media banner ad any P. R. dot net\nToday a singer Anita oh days Ninety ninth birthday anniversary she was born October Eighteenth\nNineteen Nineteen in Chicago she joined gene croup is banned in Nineteen forty one around the same time as trumpeter right Eldridge joint and the group had a few hits including let me off uptown boogie blues in just a little bit south of North Carolina\nAnita O'Dea joins Dan ... bad after crew was disbanded and she recorded almost two dozen albums for verve records in the fifties and sixties\nFrom her Nineteen fifty six session with Oscar Peterson and ... and her bell is that resulted in the album Anita sings the most this is old devil moon on any PR\n\nStreaming up doing was Rob like radio is one of the ball you know the hotel doors now offering strict meeting the spaces record room to room with the equipment to announce catering hotel north helping dog call\nAgain we wish you play that\nGentleman that you know\nYou and your plans to make the romantic knew how to do and you\nLove me what the chair me Kashmir\nWay and\nIs not a real\nLuck to you every last\nHave a what I say do when\nYou up to ...\nTo make minority with a paddle\nWord may you may I\nMight\nNot really I'm the man here is\nThe map where I say and do head\nUp to the\nMe that he was a bad\nSay hey I may just made me\nMaine new fond de la ...\nDreaming of New England public radio was funded by un valley solar a local photovoltaic designed to the installation company serving people lined up to live carbon free and the four one three valleys solar dot solar gray\nShe\nFrom their Nineteen sixty two recording time for two that's needed all day long with count Jeter there on that lives with kill me a grape and before that we heard be which bothered and bewildered them their eyes and old devil moon all from the album Anita sings the most\nAnd Anita O'Dea is backed by Oscar Peterson at the piano herbalists on guitar ray brown on bass and John Poole on drums\nAnita days performance is also part of the classic film jazz and the summer's day which documented the Nineteen fifty eight Newport Jazz Fest and introduced Anita day internationally as well when that film came out and today is Anita oh days Ninety ninth birthday anniversary\nWill continue now with new music from the ... fishermen quintet\nWell here the title track so you say which was composed by fellow tenor player Doug Web who's also a member of the quintet and we'll follow that with Doug Web leading his own session through the Julie Stein standard that things we did last summer tenor saxophone is Greg fishermen and dug weather on New England public radio\n\nStreaming of New England public radio was funded by us they have to go to ... graduate schools and asset applied laboratory style that operation rolling now for August twenty seven applications that they pass dot edu\n\n\nNa na\nStreaming of New England public radio was funded by you when they pass university graduate schools MSA creative non fiction writer and rolling now for August twenty seven applications that they pass dot edu then\n\n\n\nStreaming up New England public radio was funded by un Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now would rolling fall gee C. V. S. dot org\n\n", "show_name": "Jazz &agrave; la Mode", "year": "2018", "city": "Amherst", "day": "19"}