{"month": "10", "state": "NE", "station": "KFAB", "content": "I Need help [noise] unless [noise]\n[noise] I ... I think that having someone who is going to help make it better [noise] whether or not he struggled with addiction and how to understand no one can get ... [noise]\nMy life changed because someone was there\nOne in seven Americans will struggle with addiction during their lifetime or\nWant to know how you can help and go to hear to listen dot com for tips and tools to help turn addiction around\nA public service announcement brought to you by the council\nI can talk for a long time [noise]\n[noise] I don't have a hang\nHang campaigns over and over and told one game and\nMet handling on me how I learned how to run\nEarly intervention to make a lifetime of different learning mine and onto the leaks that horn last\nWrapping by on the on the camera\nI'm probably okay to have one more drink before I drive home [noise]\nOkay I open the window to stay alert [noise]\n[noise] step out of the car please [noise] I probably made a mistake\nProbably okay isn't okay when it comes to drinking and driving you see a warning sign stop and kind of like have a car or a friend that's driving is drunk driving and method ... by ...\nThe average time a resume spends on an HR managers desk is seven seconds and most of them are tossed aside now imagine if one of those resumes belong to you as a man who was\nLiving in a shelter juggling three job I have to be resilient that something that you can't teach\nWe rely so much on a resume you could never tell the full story of someone who\nHas to be independent and taking a ship and that's how you handle every Patrick they get\nDiscover new ways to develop great talent grads of life dot org brought to you by ... and the ad council\nSix fifty five Sunday June hear news radio ... be crews from in pi pi de loop river and southern public public power districts are helping the O. P. P. D. cruise around one hundred O. P. P. D. cruise personnel working on the problem with\nThe lack of power electricity four thousand more homes with power this latest update with over ... ... what the outages down to forty one thousand homes majority of the al ... will be completed by this coming midnight news radio eleven ten K. F. E. bay\nAnd along those lines I was listening to ... Patel and I just want to say thank you um and that's I think you know you always say that if it were to save the nation that it'll be your audience to put a huge role in it and I think that's true because\nI think what history looks back if we do save ourselves during this that you are going to be a huge part of that and uh", "year": "2018", "show_name": "Battle Line with Alan Nathan", "city": "Omaha", "day": "14"}