{"month": "10", "state": "GA", "station": "WNGH", "content": "\nThank you for sharing your portion of your evening with Iran G. P. B. radio and Eighteen station\nThank you for sharing a portion of your evening with us here on G. P. B. radio and Eighteen station service of Georgia Public broadcasting up next the international American music show on CPB [noise]\nSupport for ... comes from generous listeners like you and Carlyle place and make in mind that doesn't help the fully accredited life plan community in central Georgia offering active seniors and maintenance free lifestyle and the security of having a plan\nShould healthcare needs change Carlisle place dot org GB has been honored by the Georgia Associated Press media editor is winning the top award for radio the pacemaker award we were also honored for best specialized reporting best anchor best newscast gp news stand with the facts [noise]\nNinety seven point seven FM double your G. P. B. S. W. A. G. P. H. D. rural part of Georgia Public broadcasting radio network [noise]\nAnd\nWelcomes her other spooky new addition to the international American to be secure weddings Michael park and this week with Halloween nearly a promise I thought I Would dress up as a special Halloween edition of the show because believe turn off the ... that have connections to go to schools and monsters and zombies and even\nLondon dwelling lake and soaps getting a journey started this week\nThis is Adam card for\nThrough the streets of Seoul\nHe was in ... I'm\nGoing to get a big dish of beef down main na na\nYour kids you\nJapan are not living in\nLittle early and it got new leader today last night\nGee they Harry in Japan who\nLately been over\nYou better stay away from him yeah repeal them down jail\nWell\nAdam carts cup rewards the classics where we'll just loved it and that goes all Adams debut album move things forward the original ... sold for two years old this year has it first appeared awards he feels like she's ... album excitable boy and he's another week\nProblem moving forward the original version of us always for two years old this year\nAs it first appeared awards evils Nineteen Seventy eight album excitable boy and he's another we took that so it actually came up by the suggestion feel ever at least one of the Everly Brothers after watching the original werewolf of London so suggested words even write a song based around that title to we did\nBut it was actually Jackson bribed who forced to perform to watch as for warns even themselves will he sadly passed away Fifteen Years ago this year\nLeaving behind for more than just one classic track if you want to check more because truly great soldiers and there was a great just to tell them cold where we'll supplements\nAs most of warrants best dumped on us for Adam ... well he's released for our lives today including one full of rather bluesy covers of songs\nIncluding is into the mistake welcome a wild cited staying alive which also reworking\nThe Bee Gees number at all of those covers or Adams album blueprints I'm so hello again and welcome against this Halloween edition of the international America researcher Michael ... as I Am suffering like so many of us at this time of year from a cold\nThat culturally I actually truly feel or say like what else to do with which is perhaps rather fishing at this time of year is on Halloween of going to be jak skeleton from the nightmare before Christmas I wanted to go this year and a giant inflatable eagle costume because it looked pretty funny to me when I saw in the store\nBut it doesn't fit the friendly theme according to my son and daughter are going to be a headless horsemen and does all the\nChrome ... respectively to walk up to go with something a little darker than a big bird and I didn't want to go all the way and hope for\n[noise]\n[noise]\n\n\n[noise]\n\n\nThink\nDoes\nThe moment\nThe woman\nAnd\n... down to this day and they didn't\n... you\nA\n\n\nAfrican singer show go to Oregon zombie celebrated the cast of colorful character who are part of the night life and Joe ... Joe seek a total recall sudden where she lives\nIn that song is on her to ... Thirteen album be brave after taking some time off to have a baby story made an album early this year I think plans referred to release it sure behind it\nThat lead to this year and I for what I'm really looking forward to hearing some new music by her in the coming months that I'm also looking forward to hearing some new shows by the artist are played before tore Simon steadily ward mainland\nAnd that song of his the monster assault comes from Asia one and only album today and part of the one that he released in two thousand in Thirteen I think it was a but in an email earlier this month so I've been told me his new album which he's made with his wonderfully\nNamed by the shadows of direct a Jew for release and they're not too distant future so we've heard tales of monsters zombies devils play which I'm wearables unless Halloween edition of the international America ... ... so how about some little dogs\nCapitals play which I wear will treat it should be punished for America let me try to buy some little dogs my\n\n\nSinger who had a very ... year judging by social media pages I was told by when weekly from England these armed onto the scene last year with is critically acclaimed debut album mean dogs my dogs which I just played the title track\nBut despite some effort on my part I have been unable to smoke to play that will do those plans offer so for release but given the overwhelmingly close to ... debut album\nReally hope he does have plans for what ... found one point to step in years to release a follow up to ... they are romantic ... led by northern Irish singer songwriter bank ... when the two sides of the night they released their critically acclaimed record America\nBut it was to tighten the sixteen before the next record chatter landscape by in part due to bad becoming seriously\nThey're released they're critically acclaimed Greco to America\nBut it was to type ... sixteen before the next record chatter landscape by in part due to bad\nBecoming seriously electric conducting Lyme disease I say he's a little after ... with a full recovery an earlier this year that he and the bad released their latest album I lost the sultan never made it on to any of your previous three albums\nAnd that is one of those tracks like track betray Bryan Adams no less they called the dark\nAround ...\nBetter a\n\nAnd\nAnd\nThe law would be a part of\n\nWay to shore to retire slowly and the devils Alberta permitted opponents album which came out one group to record breaking two segments fourteen in fact it was one of my records you had them before my time with Canadian Ben pretty Archie and they're so\nInspired by the lost treasure island that two things here first if you know come across pretty aren't you before the chicken to their debut album singles and love songs on which\nThat track appears but also their new album which is to act six weeks and secondly if you don't come across the story of old Ireland a treasure but it's supposedly very daring the tails of the main who've\nLived seemingly endless amounts of money to looking for it and indeed Google that there are several good website Tibet story I'm going TV series on the History Channel called the ... the next seat was about\nBut there are several good website Tibet story I'm going TV series on the History Channel called the ... guide to the next seat ... begins I Believe on November to teach them if you heard the show last month which are featured songs by some of the known American artists to were appearing\nAt the American music festival in Nashville this year than you may be introduced to the very first time in the streets I get called ... times and then I raised to backtrack from our we were at heart a peak cold to wind will also on her six ...\nIs the ... which is perfect for inclusion on today's show\n\nNeither go straight down\nChain Damien ma\nHe's God then they've\nNo\nIn [noise]", "show_name": "International Americana Music Show", "year": "2018", "city": "Chatsworth", "day": "28"}