{"month": "10", "state": "GA", "station": "WABE", "content": "Concerns is that uh this completely plausible allegation was not\nTaken seriously and they're really ... will represent a politicization of truth and on the court in ways that may be impossible to repair a Brian Fitzpatrick talked about term limits and it's I think those with wide rows right that that may be politically\nInfeasible to pass the alternative is\nCourt packing Democrats were already talking about changing the size of the Supreme Court\nIf they get to the White House and the Senate and uh it's that Republicans would retaliate by changing the size after that and we'd be back to the Eighteen hundreds of the civil war when the court was so politicized that neither side could converge around\nOur memory saying that's happened in the early history of the Supreme Court and the Jeffersonian days that's happened way back in the beginning of our country fried fitzpatrick one last quick comment from you before we go\nBut I think if both sides get their offices gored ah with this nomination process we might see\nBoth sides saying you know what we need to do something different so both of us can get the people that we want on the court and so I'm less pessimistic than Professor Rosen ... are the term limits might be a feasible alternative\nInteresting to see if that does move forward as a result of all of this Brian Fitzpatrick a professor at Vanderbilt law former clerk to the late Justice Antonin Scalia professor fitzpatrick we appreciate your time thanks for talking to us thank you Elizabeth larger the president of the constitutional accountability center Elizabeth thank you\nThank you and Jeffrey Rosen president and CEO of the national constitution center in Philadelphia and professor at the George Washington university law school thanks for being with us that you remember to send us your stories about how you're handling the personal conversations this controversy is triggered\nWill switch the phone's voice mail so leave us a message eight five five to three six one a one day\nThe show was produced by Morgan given to learn more about him and the rest of our team go to Phil won a dot org slash staff\nUntil we meet again I'm Joshua Johnson thank you so much for listening this is one ...\n\nSupport for NPR comes from this station and from Baird employee owned and independent Baird has kept clients by national interests first since Nineteen Nineteen R. W. Baird dot com has more information\nFrom visiting angels professional caregivers assisting adults in bathing dressing meals and delight housework nationwide visiting angels America's Choice and senior home care office locations are admitting angels dot com\nAnd from the any e Casey foundation [noise]\nThanks for joining us for one a member supported Ninety point one W. A. B. E. Atlanta\nSam Whitehead of your Monday Mornings opt to a great start here to stay tuned for a look at the Atlanta art scene with Louis right to Sun City lights up next eleven at noon to keep up with the top national stories of the day with here and now they take a deep dive into Atlanta news on closer look with Rose Scott at one\nWeather today partly sending with ties in the mid eighties that much of a chance of rain our time\nIt's ten fifty nine [noise]\n\nA survivor of the worst mass shooting in modern us history helps others confront the aftermath of their near death experiences that story this afternoon on all things considered from NPR News from four to six thirty on Ninety point one W. A. B. E.\nMatter how you listen to W. A. B. E. T. dreaming a tablet for each the radio we still need your help\nYour donations important it pays for shows like this American Life here now and we can edition and this fall you can hear more public radio because as soon as we hit our overall membership goal we and the campaign and your contribution now\nBefore the giant starts counts so help us out at W. A. B. E. dot org slash donate\nSex\nFrom W. H. B. in that last time lowest writes this and this is city [noise] permanent as modern Ballet Theatre maybe going into its second year\nThe co founder John well perhaps a lot of history at that lab how he'll join us to talk about the upcoming performing and\nSpecial knots\nIn ... near the end of the same to prom\nWill get a left looked at Vernon fares production of for forty eight\nBlocks with a catalog or has some songs one good thing or the field would be a household name\nDirector Adam Cole and\nRecognition to feel says role in the great American song for\nAll I have found city in the\nFirst [noise]\nLive from NPR News in Washington encore of a Coleman President Trump is to speak this hour at the White House and new train terms reached with Canada the agreement will allow candidates joined the revamped North American free trade agreement\nMr Trump will be in Tennessee tonight to campaign for a Republican member of the house who was seeking a seat in the Senate from member station WBUR P. L. answers you Martinez Deltron has more\nTrump's event in Johnson City will survive the route of the for us representative Marsha Blackburn the Republican candidate running to replace retiring Senator Bob Corker\nThis is the second time in five months that President Trump will visit the state to campaign for Blackburn who's running against Tennessee's former governor in a race that he's very close according to recent polls\nThe former governor Democrat feel British and us run his campaign as the moderate in a state that overwhelmingly supported Trump you have to avoid it endorsements from his party and has said he will not support the current democratic leadership if elected\nFor NPR News I'm set of ... done in Nashville\nDisaster officials in Indonesia say at least eight hundred forty four people have been killed from last week's earthquake and tsunami on the island ... NPR's Julie McCarthy is in ... and says rescue and relief efforts have been disastrously snarled including in the provincial capital pollute\nThe poll airport was closed today\nA one police major said four thousand people stormed the airport there they rushed a military transport\nFilled with aid and that shut down to the flights for the day so you know their chaos is emerging people are shown a standing on tankers siphoning the fuel power has been cut the hospitals are crippled\nPeople have moved outside where patients or been moved outside where the doctors are trying to administer them outside their NPR's\nJulie McCarthy there are questions over why warning systems in Indonesia failed after the initial powerful earthquake General Electric has fired its chief executive after a little more than a year on the job NPR's Jim Zarroli reports the move comes admitted declining profits for the company\nGE chief executive John ... had been on the job just Fifteen months he will be replaced by H. Lawrence called the former chief executive of the conglomerate Dan or her\nWho's now board member gee the company also said it's cash flow in earnings would be less than previously thought because of problems that it's G. E. power division\nOnce considered the essence of a modern cutting edge conglomerate GE has seen its fortunes and its share price fall dramatically and it's been forced to sell off divisions and lay off employees and a symbol of the company's decline GE was removed from the Dow Jones industrial average in June\nJim Zarroli NPR News New York\nOn Wall street the Dow Jones industrial syrup two hundred Seventy points at twenty six thousand seven hundred twenty eight ... forty four you're listening to NPR\nThe winners of this year's Nobel Prize in physiology or medicine or American James P Alison and ... of Japan\nThe Nobel Committee is honoring them for their work and discovering methods of cancer therapy they develop ways to use the body's immune system in a manner that can't arrest the development of cancer that research has led to major advances in cancer therapy drunks\nThe man at the center of a scandal that led to the cancellation of this year's Nobel Prize in literature has been convicted of rape it's all over guard has more\nA Swedish court has sentenced John cloud or no to two years in prison for the rape of a woman in two thousand eleven I Know he's married to a member of the Swedish Academy which awarded the Nobel Prize in literature and has long been considered a kingmaker in a Swedish art scene\nAllegations against him began to emerge in two thousand Seventeen when Eighteen women came forward to accuse him of sexual harassment and assault\nMost of the cases were dropped but the scandal sparked a crisis within the academy that eventually led to the ouster of its head and the subsequent wave of resignations by the two thousand Eighteen prize will not be awarded the academy has said it will choose to learn it in two thousand Nineteen for NPR News I'm silver guide in Denmark\nReports in South Korea say that north and South Korea have started to remove some landmines from their heavily guarded mutual border the ... news agency says that this action stems from the most recent summit between the countries to leaders\nConversation just by looking at you [laughter] so wouldn't were times ... yeah so\nWe're already like three or four steps in the conversation and we hadn't said a word and he says in the front of the room like going like what's\nHappening and we have to like oh yeah yeah we got to throw in the long run you along in this conversation okay Christie\nGot it yeah you never afraid that John Will drop you know [laughter]\nYou know all about\nWhat is your hobby doesn't it [laughter] but ah no no no\nYou know there's moments where we both you know have those little missteps and somebody does something wrong and the timing is that right and the one loses something that you know that's why you ... and that's why I earned things out so that hopefully you don't get the moment it geared to every ...\nEvery ... every relationship ... Smith\nBut this is liberal yeah you're right I live there's there's no receipts on you know well your performance\n... she mentioned for those who've never visited there and be would you describe just setting where you Dan Schorr I'm\nWe're actually just located outside of Sarah and be there's a there's a piece of beautiful property um where a couple of has allowed us to perform in which where you have stuck to a place called dear hollow it's a beautiful blend if you can imagine walking out of the woods and to just\nA matter of space that it kind of creates its own stage so to speak and brings you down into the into the element of being outside so but it's right next to Sara MB and Sammy is a beautiful place who whoever has not been it's a it's a it's a plant community that has really intentionally built out\nOf the community with the the emphasis on the arts and the environment and culture of being a way of life is not something that is just an extension but something that you live on a daily basis\n[laughter] dollars the setting their hollow\nIn form the choreography in anyway\nAll my gosh yeah absolutely it's it's interesting because he knew you know he's very well acquainted now this is the second time a choreographing outside he intentionally did not um finish a few sections of the peace because he really feels that it is an extension of the outdoor space that were at and he wanted to kind of\nBe in space as he created to make sure that it was a right feeling rather than trying to create inside a studio and then they made out and then yeah uh I think he kind of ... really intentionally want it to make sure that the choices he made were a natural sense of being outside and wanted it to feel right\nYou've also had performances in town it turned on the west and the high museum will you be dancing with in the city of Atlanta as well as Sandy this isn't\nYeah absolutely well I terminal west we haven't been there yet but um it would be a national extension um\nUh but yeah west side culture art center are ... that's okay [laughter] it's a natural fit and then I wouldn't be light of I haven't looked at that face already a website called Gerard centers are in town all in a home where we create and we work\nOn but we have a wonderful Premera coming up in November from uh New York city ballet corps out for naming Troy Schumacher um who is from Atlanta were thrilled to bring him in so that will be in November will have a weekend then and I heard that there will be original music and a light show\nYeah for that yes this is I'm I'm thrilled to bring this piece because it's um you know you think of New York city ballet and Balanchine rep that they bring that this is a really something that is truly unique to Troy and his work and his vision of dance and\nUh my what I loved about it it just fit into the idea of telling stories through dance for us and [noise] um is is really an immersive work where you walk into space and you're taking as a part of the piece itself so there's some really amazing projection lighting effects that are part of this peace can you\nTell us about any other partnership ... or um outreach you have plans for season to\nYou know one of the things that we took note of that our first season was the um the high museum show um it was a pop up show we did several other pop up shows and just the reception of the audience and the feedback that we got there's going to be a lot more in store for season too that we want to just kind of bring dance off the stage into a more\nAh can video atmosphere that we can have a conversation with the audience\nYou have said that term in this believe in the human language in there with no work spoken how ...\nHow it's interesting you know we ... our bodies are tools and we trained a lifetime to learn that technique of ballet and how do you communicate that within the story that you're telling and so you you come across the ...\nListen to classical repertoire of you know when you get to a certain level it's it's it's amazing to kinda get outside of those traditional classics and that you get to spread your wings so to be so to speak and you realize without anyone saying it to you is that you really you're just it's a language that you did and so\nHow we wanted to really kind of delve into that experiment that you know um that\nYou know with your body speaking with your body absolutely yeah as a very powerful effect\nWill congratulations on the beginning of season too and I think is a season models and the indicator there are marvelous things in store\nChristine Walker ... thank you very much for joining us some city law law is always a pleasure yeah our pleasure thank you\nJohn ... is the cofounder of turning is modern ballet theater Christine ... will join the company to begin their new season performances or friday October\nThrough October fourteen [noise]\nSupport for W. H. B. E. comes from Emory Schwartz Center for performing arts presenting the acclaimed Jerusalem Quartet for an evening are rarely heard string section that would make us ... on October tenth tickets at art stopped him re dot edu\nA survivor of the worst mass shooting in modern us history helps others confront the aftermath of their near death experiences that story this afternoon on all things considered from NPR News from four to six thirty on Ninety point one W. A. B. E. [noise]\nYou learn something every day on W. A. B. E. here's something you might not know W. A. B. E. pays NPR over a million dollars a year just to broadcast MORNING EDITION and all things considered and the member guide help pay for it so this fall and we're doing something new\nWhen we get to our goal of Seventy thousand Seventy donations that Dr Atkins and donations now will count so let's get back to learning something new contribute now at W. A. B. E. dot org slash\nDonate this has said he liked something W. H. B. E. S. lab is choice for NPR I'm Lois rights it's great to be with here\nAtlanta theater company for ... fair is tackling the controversial final work by British playwright Sarah ... [noise]\nIt their production of for for a psych coast producer Mike John spoke with director Sawyer estimates along with actors Aaron Boswell and Catherine Barnes a warning to listeners the following conversation mention suicide\nAnd some violent imagery\nSo for forty eight psychosis is um it's an intense piece of theater you can't really be separated from its creator can you tell us who Sarah king was\nShe was um a British playwright and writing in the nineties I Believe between Ninety five Ninety nine she was really disruptive in a scene because there is such a trend towards\nReceived form in pretty conventional British theater and she was part of this wave whether willingly or not and\nThe people who got group together under a bunch of monitors on new brutal lists or in your face gator on a lot of their work is characterized by innovations in form and a violence that gets kind of permeates through all of their taxed\nI mean can you give me an example of like ... ... ... when you say violence it\nVaries among her ... earlier ploys do with the more uh there was no way around the violence because it was written in the stage directions in very very plain English for instance and blasted um someone needs a newborn\nChild on stage and\nClimbs there is a man whose time has taken out of his mouth yeah it's just it's very violent and and there's a lot of backlash especially for people to saying oh that's too much why do you need that it's unnecessary\nYour games are busy work school errands kids had never stopped and the news never stopped either\nYou can keep up between MORNING EDITION and all things considered hearing now by Tom and Jerry house hearing that brings you breaking news developing stories and the latest in the arts and innovation tough questions I'm packing complex issue from across the country and around the world who joined\nMonday at new nine Ninety plus one W H\n... double UAB eat for ATM meets NPR I'm Lois right says thank you for joining me\nBetween Nineteen twenty eight ten Nineteen Seventy three that lyricist we'll learn about today wrote of four hundred song doesn't ... the songs were hit on Broadway and in Hollywood\nAnd flick distinguishes this particular there is this is the fact that she was a woman\nHer name was Dora the fields and director Adam Copeland of flying carpet theater company explains her role with in the great American song book\nWith proper recognition of her legacy\nDorothy Fields was one of the giants of the twentieth century musical theater she was a lyricist as you mentioned and she was also a little Brett assess she wrote the books for Broadway musicals and conceived of them\nShe ... her list of collaborators looks like a who's who of all of the important people in Broadway for the last hundred years she worked with Harold Arlen Irving Berlin Fred Astaire Duke Ellington Bob Fosse e Jerome Kern ... Cole Porter\nBill ... Robinson Richard Rodgers when ... and she says she knew everybody she worked with everybody they all respected the heck out of her when Obama gave his inauguration speech as\nThe forty fourth president of the United states he actually reference lyrics by fields he said in the speech starting today we must pick ourselves up\nDust ourselves off and began again the work of remaking America and this alludes to the song pick yourself up from the film swing time that she wrote the lyrics for\nSo why do we know more about why is her name not a household word I think you believe that sexism has something to do it that I'd say so\nI mean if we made a list of all of the people who were the important musical theater contributors as writers certainly there are a lot of great performers as women but if we made a list of all the folks who are on the other side of the foot lights there wouldn't be that many women who are part of the list and I actually\nThink that in some ways sexism has been hard baked into the American theater\nFrom its very beginnings in fact a lot of critics say that the first American musical happened in Eighteen sixty six just after the civil war and uh the there was of this show which\nThe reason is credited as being the first big musical is that it had a plot and then there were songs interspersed throughout throughout this show but here's some some other weird facts about it it it ran five and a half hours long\nIt was called the black crook\nAnd it was based on a sort of the house like tail of a deal with the devil in the sixteen hundreds all the critics said it was terrible the songs were from other things they were thrown in kind of haphazardly\nSo low is why was it the biggest hit of the year and in fact of the decade ran for four hundred and Seventy four performances because it could expand it since well\nThe critics panned it but the largely all male audience didn't get enough because there were a hundred ballerinas [laughter] showing a little bit of leg oh am I so you can make an argument that the the launch of the American musical happens\nBecause of\nThe objective vacation of women are the ballet gave way to feel it it's kind of started this tradition and so there's it's very common for women to be sort of up on one side of of the theater is kind of objects\nBut they're just hadn't been that many people who are making theater so Dorothy Fields comes along she is the daughter of a great vaudeville in a guy named Lou fields who was part of of vaudeville team called Webber and fields and they were famous for amongst many other jokes this joke that went something like\nUm who is that lady I saw you with last night and then the other one said that was no lady that was my wife I yeah it\nHas to let her daddy didn't want her in the U.S\nHe didn't he didn't in fact when she announced that she was writing songs for a review that was going to happen on Broadway he famously said that is no thing for a lady to do and she cleverly said I Know like I'm your daughter [laughter]\nOh that's great [laughter] well let's listen to the first song ... chairs and this date from the year Nineteen twenty eight\nWho may be popular [noise]\nMaybe they do they do\nNow you know [noise] and I know when you're not that that really do\nThink they do they get they get they get\nVery big and they get their mind they [noise] they don't think they get to your age are are they don't let her mom and dad and I\nThink it is I don't think they know [noise]\nYou'll just cleverness as lyricist was recognized pretty early she was in her early twenties and she started collaborating with some songwriters of the day we're working for\nCompanies that were trying to get their songs on tour and she got hired by reviews and then eventually by the cotton club which that was a big gig the cotton club was a major\nPlace where African American performers would present it and a vis vis number did they could do was meant for cotton club review\nWhen it premiered it's already got suggestive lyrics lyrics or things like you love me and I love you and when you love it's natural to dig it to do [noise] um but evidently the star\nThis um cotton club review actually put in even more suggestive lyrics kinda scandalous lyric so various fields with her dad I Love her you know who is this was you know going to be a proud moment and the columnist Walter wind chill that the you know it's a packed house\nAnd she whispers over to her father\nThose are not the lyrics that I actually wrote and evidently Lou fields right after the number ran up on stage took some applause because he was famous and said everybody I just like to announce my daughter did not write those live [laughter]\nBut it's an interesting start too long and remarkable career but what you're saying about um the cotton club picking this ... this is a milestone not only for feminism but also for race relations\nI think that they're they're ah had been a bunch of white writers for cotton club reviews and among some Harold Arlen who we've talked about before and everyone thought he was black yeah yeah and and uh I think the cotton club is a place where in fact\nThere were much more porous lines of collaboration and many of the other places in the U.S there ... there was more of a natural way of people just trying to put out good work\nThere was some controversy about the next song we'll hear\nI Believe there was a lawsuit on behalf of ... fats Waller ... that she actually composed the song and not Jimmy NICU but there was no to speak about the words that never came in to the complaints\nThe words were written ... or the fields\n\nNot being there and\nThey need to do this and\nIt is quite a testament to David said there is that I now hear him when I hear Billie Holiday [noise] um [noise] the sunny side of history\nSo that someone was written for review and um [noise] I think one of the things that is so interesting about it is that of course it's a standard in a classic\nShe was very young when she wrote the songs and she's already showing such a deft handling of phrasing she gets a tune and she's able to place very colloquial lyrics\nWent away when I was sitting in the witness chair I felt guilty [laughter] during my first one\nThomas U.S Supreme Court confirmation hearings in Nineteen Ninety One and which any to heal charge Thomas with sexual harassment Carson was still", "show_name": "City Lights with Lois Reitzes", "year": "2018", "city": "Atlanta", "day": "01"}