{"month": "10", "state": "GA", "station": "WABE", "content": "Mine had double ... or ... or by calling six seven eight five five three Ninety nine the gym I was struck by something mentioned in this last segment\n... was that is John Lennon was interviewed um seven her eight minute segment seven to eight minute interview which\nWas considered at length well ... here when you listen to W. H. B. E. when you listen to NPR News\nWe aren't constrained by like listening to Terry Gross and fresh air you half an hour of since the late in conversation we can provide you this because you provide us the funding\nAnd you do that right now with a pledge of support to six seven eight to five five three Ninety Ninety or W. B. B. E. dot org we know that if you're a music fan\nYou probably really enjoyed the last hour with Terry Gross and fresh air and it's a type of programming that you get every day not just with fresh air but absolutely with fresh air if it's the only program you hear all week\nWe're talking to you we need your support we need to get the support of seven thousand Seventy\nFolks who listen to W. H. B. E. no matter whether it's once a week or ten times a week or constantly through the week\nWe need to hear from you right now six seven eight to five five three Ninety Ninety or make a pledge online at W. A. B. E. dot org and anyone over twenty is considered part of the older crowd as the b._b._c. reference [laughter]\nThat that that was shocking to well\nThat must be because that was back in the decade when you were told not project trust anyone are for thirty eight so I guess you know people in their twenties thought well we're mature\nI think that doubled UAB he brings you the most trustworthy news source\nNPR and our W. A. B. E. newsroom\nAnd programming such as fresh air which is unique a hour of conversation with the likes of\nTerry Gross is not something you hear anywhere else we're able to bring it to you because you donate the money we use to pay NPR our to donate perhaps\nTwelve dollars fifty cents a month\nYou might not notice that missing from your wallet from your checkbook\nFrom your debit or ...\nBut we will appreciate that contribution that you make online at W. A. B. E. dot org or by calling six seven eight five five three Ninety nine day and you have something special to tell us about when you donate twelve fifty a month\nWhen you do that you can pick as a think your gift a pair of tickets to the Atlanta symphony orchestras fab four ultimate tribute live this is going to be February tent\nAgain that's twelve fifty a month the contribution to six seven eight five five three Ninety Ninety or online at W. E. B. E. dot org Lewis it's been an amazing our thank you so much for inviting me to spend it with you\nOwe it has been a joy you've the Beatles and Terry\nGross it's it doesn't get a whole lot better\nSupport for WABC comes from the Atlanta symphony orchestra Donald ... leads the Atlanta symphony orchestra and chorus and Benjamin Britten War Requiem Thursday on Saturday the twenty fifth and twenty seven details at a U.S oh dot org classical series presented by Delta Airlines and\n\nW. A. B. E. and that latter I'm Lois right this and this is the line [noise] Alvin a dancer Hope's Boy and talks to us about turning Martin Luther\nPeople who watch the last episode of Roseanne in may\nABC developed Connors as a version of its Rosanna revival without Roseanne Barr after the star center racist wheat in may that prompted the network to cancel the sitcom bar issued a statement criticizing the decision to kill off her character as quote grim and more than Eric Deggans NPR News as a lottery\nJackpots go this is a big one the mega millions jackpot may have to be classified as ... billion lottery officials estimating today the prize less than a day after another drawing without a when there is now up to nine hundred million dollars\nTo she'll say no tickets matched all six numbers last night that means friday's drawing good to be the second biggest lottery prize in us history the biggest jackpot ever was a January twenty sixteen Powerball prize at one point six billion dollars\nGo to a futures prices fell today crude down three by three percent to end the session at sixty nine Seventy five a barrel on the New York mercantile exchange\nAnd we had to\nHave a very similar idea of what the work\nWas trying to say and what we wanted it to say separately and together music and movements and I feel that that it was easy for us to draw in and and be on the same path you know walking down the same street parallel and with with the idea that Dr King was passing forward to us\n[noise] choreographer and Albany league dancer hope boy can\nHer work revolution dream was inspired by listening to Dr King's speech while visiting the center for civil and human rights here in ... you're listening to cities like San W. H. B. E. at last huh\nI'm Lois writes a peer reviewer in my ... in the midst of our pledge drive\nWe hope that if you have not yet donated you will do so today Thanks to all of you who already pledged which do by calling six seven eight five five three Ninety Ninety or\nTouching on line at W. H. B. E. dot org and\nJust this hour we have a limited number of Taft in ... gift card five of them are already gone\nFor Fifteen more people who make a donation at our basic membership level or higher our basic membership of five dollars a month you will receive funding these gift cards [noise]\nHope pork in creative work\nSupport for WABC comes from dancing goats coffee bar featuring locally roasted backdoor and brought some coffee voted best coffee in Atlanta by the AJC serving their espresso drinks and pastries in midtown ... market Decatur and their news location now open up the exchange and book kid\nIn July I spoke with Kris most is the director of education and associate artistic director of the alliance about how they kept the simplicity and Winnie the Pooh the musical\nUh in conceiving the peace we wanted to make sure we honored the simplicity of ... and and shepherd that was paramount to everything we did and\nWhen you entered the illicit illustrator cracked\nAnd especially given that these beautiful sketches are right or on campus at the high museum of art we had to make sure that we matched the simplicity and the elegance of those in our design and in the performances as well\nUm so it was really about reducing reducing until we got to the truth of these characters\nUm and the music is interesting because he thinking of musical the old adage is when the emotions become so heightened that's when you have to break into song because spoken word is no longer a\nAdequate um but with Winnie the Pooh it seems when the emotions get heightened he gets still and quiet so [laughter] it would be sort of counterintuitive to have him break into this Broadway song and dance so we wanted the music to have a much more\nContemplative element and I'm Still in Frederick is our music director and he arranged the songs we ask them to really think about the way children sing in their ... visit tore pure beautiful way when they'll just break into a song and sing it over and over\nSo that's the quality that we tried to get to to\nLow people into this meditative state that I think ah the sketches and the stories do so beautifully there are multiple\nStories of ... air and his friends it's banned the years what is the focus of this specific story you are bringing to the state\nSo it it comes from the the first volume of ... and I'm In ... it's tracking a few different stories that that tied together um one is your losing his tail poor your\nUh one is Cangus arrival and the hundred acre wood and she is a newcomer to to the the wood and is scares rabbit so there's a plot to I'm trying to scare her out of the woods at first and that's all part of the framework\nUm there's also mention of the ... and that certainly worries little Piglet quite a bit and then it it's tiring all of these different stories together\nA light bulb just went on is that\nHe's supposed that's where the game and that tail on that don't originated it's so\nFunny you you mentioned that we do a reference that at the end of our show and and we're not sure we need to to do some more research but it was again it was that\nLight bulb for us in the rehearsal hall when the director Lee or and Morris realized wait a minute we must end this play with a guy for advocates surprise party for or\nAdult part of the the ... song and dance of the ferry\nAs director of education I Know you take this roles is very seriously what do you think children take away from ... [noise]\nBut nothing happened for months I just watched it sit there and then slowly one day I walked up and there were eight tiny cats [laughter] all pointed at the door as though they were waiting for someone to feed them\nOne that is a lot of cats yeah [laughter] it's about enough that there was just one cat\nBut there were eight and they were arranged perfectly and it I mean it boggles my mind and made me really happy and very curious and then I watched for months after that as more and more things appeared and one day\nA tiny newspaper about the tiny door appeared was a tiny Atlanta Journal constitution and I got really happy and that's when I open the Instagram and that's when I thought well maybe I could do one more mhm you know and now the doors only go where their request it\nIn the past some of the doors have been damaged seemingly on purpose and seemingly in response to a they're openly pro ... be GQ imagery um I remember seeing I remember seeing you posting on on ... the one on the crowd total a got a\nCat and they've all at some point seen some kind of vandalism\nUm could you talk about the importance of making that sort of personal political statement was with these with these works\nSo as a queer woman it it just was important to me that I stay true to myself and this and the doors are not gay doors and they're not straight doors doors for everyone and part of being for every one\nIs that it's going to need to I Need to make it speak to myself\nAnd to the people around me and for me the door door number two specifically which is on your old forth worth skate park on the line has a rainbow around it and I we did it for pride a few years ago\nAnd then it kind of stuck kind of became the rainbow door and because of that commitment to the rainbow it has been vandalized more than any other door for sure yeah I remember\nJust kind of being amazed seeing the something that\nSmall could get that big of a reaction mhm somebody I'm I'm Amazed also [laughter]\nI mean\nI I I'm not sure that there's really a question here but like you how do you how do you process that kind of reaction\nSo it depends on if I feel like it's incidental or purposeful if I feel like someone just had a can of blue paint and they decided to highlight the door and highlight a bunch of stuff I go okay and I go fix it if it's beaten in with Iraq or you know something I keep 'em I keep a lot of\nDoors on reserves in the studio and I go replace them pretty instantly runners are my favorite because runners will send me pictures immediately when something\n[laughter] um and I\nAnd I go fix it um\nSo how process it is one time I was talking to the people who run art on the line and I said how many people are on the line on a weekly basis she sat on the east side trail sees about twenty thousand people a week well and I said okay so if it's these twenty thousand people a week on an average week one of the outline doors needs\nSignificant repair\nThat's not that bad and even then it's not usually that significant it's little touches up it's a hundred and three paint jobs under number six but it's you know to me I Try to remember that more often than that there are so many pictures that I see on Instagram using the hash tag ...\nPeople caring about them and feeling like they belong to their neighborhood and it really keeps me going\n[noise]\nKaren Anders send the tiny ... speaking with our producer my job [noise] tiny doors celebrated for years this summer and you can find a map of all the doors had tiny doors ACL dot com now you can find doubled UAB\nAnd make a donation where we need to hear from several more of your at six seven eight five five three Ninety Ninety or\nDonating online at W. H. B. E. dot org if we are to reach that our leading number of thirty four pledges received\nWe know that so many years you have already contributed to W. H. B. E. many of you are sustaining members thanks to all of you now we look forward to hearing from you if actually if you enjoy and appreciate\nThe kind of arts coverage arts and culture stories and interviews you hear on city lights [noise]\nWe have a limited number of why the five dollar cafe Internet so gift cards that thank you gift\nIs available to six more of you who they are made at six seven eight five five three Ninety Ninety or online at W. H. B. E. dot org [noise]\nDonating at the basic membership of five dollars a month or sixty dollars a year this is now their premium it's a complementary gift you can still get whatever W. H. B. E.\nPremiums you suck my calf is by on those special edition Seventy eighth anniversary socks\nWell we have to her I Am a clock because just about twenty minutes remaining in the program for us to hear from twenty more of you\nHelp us reached that goal in fact if we hear from enough folks\nWe could even end this Dr early right now will settle from hearing from twenty more of you know I hate to nine if he and I love this\nIn real time this reality radio her mind is reality rate hey six seven eight five five three Ninety Ninety or W. H. B. E. dot org\nI I really love a speaking with with Karen Edison was was a real joy you can you can hear her\nBubbly personality just pouring out of the radio this she's really like that she has all of this this this energy and this wonderful positivity about her\nUm it really her persistence at our positivity are really inspiring it was a way that she talked about carrying around a bottle of paint with her everywhere and it touched on my doors leaders and like the door and\nBeing John ... it's not an ominous store oh these are very these are very cutie works of art and care and talked about uh she talked about talking to communities and to the neighborhoods\nThat she goes into to find out how it is that they want to be representative represented and representation isn't an important part of what we do as well\nAnd you can help support that mission of sort of holding a mirror up to Atlanta as art scene a by making your pledge of support at W. H. B. E. dot org or by calling six seven eight five five three Ninety nine and we've heard from so many of you this hour we need to hear from about Nineteen more of you but so far\nThank you so much to Murphy Dixon said ah from Atlanta thank you surely ... thank you Patricia gram of Roswell have we heard from you yet\nGive us a call six seven eight five five three Ninety Ninety or W. H. B. E. dot or whether\nIt's the sweet and lovely tiny doors ... various neighborhoods or by taking a hard work\nCarol walkers paper cut outs inspired by the ... Stone Mountain which was just that installed at the high museum this past I Can't wait to go see the ...\nNow here on city lights we're proud to bring you stories about the broad array of arts and culture offerings and land and we can do it because [noise]\nListeners contribute to the money we need to operate here uh WABC it's that simple will you be one of the Nineteen we need to hear from in the next sixteen minutes at six seven eight five five three\nNinety Ninety or online at W. A. B. E. dot org thank you\nWith your new sustaining donation of Fifteen dollars a month or a single contribution of one hundred eighty dollars you can choose a one year digital subscription to the New York times this gift as our way of saying thank you edit includes access to all of their digital content it's yours as a new monthly sustaining member at Fifteen dollars a month\nSo please make your tax deductible donation online uh WABC that or or with a call to six Seventy five five three Ninety Ninety six\nAnd remember if you donate now while they laughed in addition to whatever other thank you gift you will receive a complementary twenty five dollar gift card from Cathy in ... will come to be here\nThank you cafe Internet so won't you donate\nOnline at five dollars a month or more by calling six seven eight five five three Ninety Ninety or online at W. H. B. E. dot org\nAnd caffeine in them and so has locations and done what he midtown out Avalon in Alpharetta and in the center of concourse at Hartsfield Jackson international airport so if you happen to be heading out of town to want to grab one of their delicious kept she knows or\nA dessert or a lunch or you can do that at the airport and I always hope that our flight is from concourse bitter that very reason [laughter]\nBefore we wrap up I'd love to hear from one end to go what races you're watching most closely particularly races you think might be billed weather's for the country that might tell us something significant or one of which races are you watching most closely\nSo one of the races that I'm watching really closely is right here in ... right outside of Washington in Virginia ... congressional district if the race between Barbara Comstock the incumbent Republican and she's got a challenger and state Senate for ... Jennifer ... and the reason why I'm so interested in that race is that I I really feel that the road for control of the house of representatives is going to run through\nDistricts where there are a lot of suburban women voters this is a district that has been under Republican control\nFor three decades but in recent years it's grown more diverse with college educated young people Latino than Asians moving there which has changed the makeup and made Democrats really see it and reach for the first time in years it's a district Hillary Clinton won by ten points and twenty sixteen\nAnd and the ... test I had the Democrat route north and beat egg lucky by twelve points in a very expensive race so far right now I'm the last five or so polls\nShow Jennifer Wexton ahead but Barbara Comstock has really been trying to make that local focus that we talked about earlier talking about all the things I've done for the district\nAnd medical before we go what do you watch you\nKnow I'd say I'll say on that that a bay area because Virginia actually is an early early poll closed time state so we look at another state that's an early ... time said that might tell us something about how the rest of night will go I'm looking at Kentucky and the sixth congressional district to Kentucky of Amy McGrath\nA former fighter pilot who's running against Andy bar the Republican incumbent if a Democrat can hold up and when as a challenger in Kentucky the rest of the night is going to be a big night for Democrats\nNPR's their medical months in or one of summers with the Associated Press teeny centers of politifact thank you all for being with us today show was produced by page Osbourne to learn more about her and the rest of our staff was the one a dot org slash stuff\nThis program comes to you from W. A. M. you part of American University in Washington distributed by NPR I'm Joshua Johnson ... tomorrow for the friday news round up this is one [noise]\n\n\nSupport for NPR comes from this station\nAnd from Subaru featuring the all new three row was sent with feeding for up to eight and a choice of second row captain's chairs love it's what makes a Subaru Subaru learn more it Subaru dot com\nFrom fidelity investments taking a personalized approach to helping clients grow preserve and manage their wealth\nLearned more it fidelity dot com slash wealth fidelity brokerage services ...\nAnd from Americans for the arts\n\n\nFor joining us for one day and members supported Ninety point one W. A. B. E. Atlanta\nI'm Sam Whitehead it'd be Thursday morning is off to a great start\nBe sure to stay tuned up next a look at the Atlanta art scene with lowest writes us on city lights mess up at eleven it'd be a be easing in middle well rather close to the end of our fall membership campaign here we are here the second to last the penultimate day of this campaign was a great time to become\nA member of W. A. B. E. and support the kind of programming that matters to you and an extra incentive today anyone who joins us by becoming a member of W. A. B. is going to be automatically entered into a drawing to win one of two Edison electric bikes all you have to do is give you can do that six seven eight five five three Ninety Ninety\nYou can also get securely on line at W. A. B. E. dot org\nWe can expect mostly sunny sky today with ties near Seventy\nIt's ten fifty nine\nSupport for W. H. B. E. comes from the brain museum presenting bearing witness remarkable stories from the Holocaust featuring survivor Helen Weingarten telling her story of resilience admission is complimentary this Sunday at two more agreement dot org\n\nFrom W. A. B. E. and that last time lowest writes this and they see city design\nLuminaries ... kids leave funding yes say it's David sit there and reflect on tumors turtles\nAnd his name being used as a match to\nJon Huntsman takes us to the beach which is both vacations\nInland ocean is cold it's made of hate and it wants to kill you it sounds are made of rocks and knives why would anyone go by\nPerformance from Matthew Sweet\nTo queens Phoebe Robin sitting on her new book everything trash but it's okay [noise]\nAll I had um city lie after\n\nLie from NPR News in Washington on corporate Coleman in Afghanistan the police chief of Kandahar Province has been killed by his own body guards the provincial intelligence she was also killed in the local governor was wounded\nThe attack and candor car came as they attended a meeting with senior U.S military officials the BBC's signature ... has more\nGeneral of the result was chief of police in Kandahar Province and a puff it opponents of the ... according to local media reports he was killed in a shooting targeting a meeting at the governor's house in Kandahar city a number of other senior Afghan officials said to be an injured\nThe come onto the NATO forces in Afghanistan is believed to have been at the meeting but his unharmed\nThat thought about his claims responsibility to the attack\nComes amid escalating violence had to today's elections\nThe BBC's ... the first three thousand Honduran migrants traveling north and pass through Guatemala and reached the Mexican border angering President Trump re emerging report a lot of ... and U.S authorities are trying to discourage them from traveling farther\nThe leader of the migrants march former Honduran lawmaker ... this was arrested in what the ... as President Trump threatened to cut off us aid to end the Central American country that didn't stop the march still hundreds of migrants have made their way to the Mexican border\nThe U.S ambassador to what the other side of yoga issued a statement in Spanish urging the migrants to return\n... it'll sift also needles new ...\nIdea that the U.S border has never been so protect those who tried to enter legally will be arrested and deported he added he understood people flee to lack of opportunities and that the U.S is investing millions of dollars to change that for NPR News I'm ... and\nPresident Trump heads back to Montana today for another campaign rally it's his third visit to the states in July as Montana Public Radio's Eric Whitney reports Trump is supporting the Republican who was hoping to take a Senate seat away from Democrats\nThe president will appear in Missoula a famously liberal enclave in his state President Trump won by twenty points\nA counter rallies being held seven miles away while Republicans are popular in Montana democratic Senator Jon tester won't be easy to beat he's raised more than four times as much money as his Republican opponent Matt Rosendale Rosendale cheap\nAds feature clips of the president's earlier Montana campaign stops\nA vote for John tester is a vote for Chuck Schumer Nancy Pelosi\nBought data fighter\nThe nonpartisan cook Political Report recently shifted its forecasts of Montana's Senate race from leans democratic to toss up for NPR News I'm Eric Whitney in Missoula\nOn Wall street the Dow was down Ninety points the NASDAQ is down more than fifty five you're listening to NPR\nSupport for NPR comes from NPR stations other contributors include progressive insurance what the name your price tool offering a range of coverage and price options to choose from now bats progressive more at progressive dot com or one eight hundred progressive and the corporation for public broadcasting\nSupport for WABC comes from a village theater celebrating Halloween with the sketch comedy show ghost swag on Friday nights at eight PM through November third tickets available for go swagger village comedy dot com\nFrom ... in the last time this is city\nI'm Lois writing says thank you\nHave some\nVery Sunday at this hour on TALK him then we'll talk\nHow he dropped his ... now you\nKnow it all her so now some ...\nFor his memoir vacation last\nOne comedian Phoebe Robbins joins us live in Studio ... today\nYou are listening to city lights um W. H. B. E. S. laughter we're members supported radio I'm Lois right says this is the penultimate day as a drive for such a good public radio worse here with my John's\nHoping that more of you who enjoy listening but haven't yet donated willing to show by calling six seven eight five five three Ninety nine to eat or donating online at W. H. B. E. dot org if it were not four and ...\nDavid so there has would not be a household name\nYou may have heard him on MORNING edition twenty five years ago as a grumpy hilarious department store elf observing this drained\nJust things are about all things Christmas Day the popularity is thanks to listeners and W. H. B. E. brings you the ... like David said there is because listeners help pay our operating expenses it's that simple\nWe need your pledges of support pleased donate by calling six seven eight five five three Ninety Ninety or donating online at W. A. V. E. dot org my\nTwenty two of those pledges to put a fine point on it we need we're trying to hear from twenty to view this morning we're turning listeners into members turning members into sustaining members turning sustaining members into additional gift givers\nBoys becoming men men because the whole the whole nine yards F ...\nIt's a and you we can we can make these these magical transformations happened by calling six seven eight five five three Ninety Ninety or if you go on line to W. H. B. E. dot org you can make your pledge\nA securely and quickly right there we've heard from a number of people already this hour thank you so much for calling in and want to say a big thank you to some Maya Berra to Craig Frankel to Steve berets or Catalina ... more thank you all so much for your pledges of support to help keep\nW. H. B. E. strong have we heard from you six seven eight five five three Ninety Ninety or W. H. E. dot org ... public radio is um is it's a place for for book lovers to take a deeper dive into their passion and we we're just we just heard from a\nFrom David said there is who is in to talk about his book clip so maybe you've added calypso to your reading list now\nW ab ... helps connect you to the books until the authors that enrich your life your your financial support helps to make that possible so contribute now for all of the great reads that you discover on W. H. B. E. and help them you know keep them coming in for another year called six seven eight five five three Ninety Ninety\nThat's once again six seven eight five five three nine zero nine zero or you can contribute online\nAt W. H. B. E. dot org and another book Mike and I'm most highly recommend that to your reading list is everything's trash but it's okay\nFive Phoebe Robin and we'll talk with her a little later this hour we are so excited about that conversation we're also bringing you\nConversations with Jon Huntsman and in just a couple minutes songwriter Mac suite\nWe can do this thanks to your support donate online at W. H. B. E. dot org or by calling six seven eight five five three Ninety Ninety and\nUm there's special incentive today yes\nUh because uh because today is the next to the last day of the drivers of the penultimate day of the drive I'm going to put this right in front of me that uh the ... the drive or anybody who donates today is being entered into a drawing to win one of two\nEdison electric bikes all you have to do is donate now W. H. B. E. dot org or by calling six Seventy five five three Ninety Ninety once again slower for those of you are writing it down to typing it into your phone\nSix seven eight five five three Ninety Ninety save that and your phone this is courtesy of Edison bikes and ... which is based right here in Atlanta will choose one existing sustain her and one brand new member who joined us today so that there's an incentive for you both\nThat once again to be entered into that competition to win a a an Edison electric bike six seven eight five five three Ninety Ninety or W. A. B. E. dot org\nSupport for WABC comes from the center for civil and human rights in downtown Atlanta exploring the question what our human rights uh Seventy days of beauty HR provides the answer through programming content ... tickets and schedule at civil and human rights dot org ants\nThe Decatur wine festival November third twelve thirty to four thirty in downtown Decatur on the square you can taste more than five hundred wind soundbites from Decatur eateries proceeds benefit the Decatur arch alliance tickets at ... dot com\nThe power pop song writer Matthew Sweet broke through about a writer's block with Esther he released to album send the last two years featuring songs written in a huge burst of creative energy\nHe also took time to read issue some of his classic albums on vinyl\nMatthew Sweet joined us along with his band while he was on tour this summer to play some music and the wound up reminiscing about a formative trip he took his young man\nI\nHad the ... and the image I'm both visual and audio I guess or all of it being in Liverpool in the early sixties I feel like this this\nGuitar playing this feeling this I'm ... and you went and that's it must it felt like\n... that's so kind of you of course I Love the Beatles and in fact when I was in high school\nUm my math teacher was in the lions clubs and they had a\nI don't know what you'd call it a lottery or something where you could write somewhere you wanted to go in the world\nAnd if they picked you they paid for the whole thing and I wrote I Want I Want to go to Liverpool and see where the Beatles you know started out and\nI really didn't think anything would come of it and then I got chosen to go on this trip with a bunch of other kids and we all flew to Amsterdam for a day or two and then everybody split up and went to their host countries\nAnd I ... a ... a initially lived in um Liverpool actually in a suburb called foreign be that's up along um the water like a little bit south of I Believe Blackpool is that when we're the\nThere's like a carnival there and everything and uh the guy who I stayed with is not the actor but at the fellow named uh\nStewart Granger there was an actor named Stuart ... members around this guy was a a barrister so I guess some kind of lawyer\nAnd he knew Mike McCartney and was able to you know drove me all around to see you know strawberry fields and you know places where they first prater used\nTo hang out and um that it was an incredible time then I went and stayed with another family in London\nAnd uh they sort of gave me the keys to their house and I went in and saw shows and did all this stuff on my own which is crazy 'cause I was a teenager\nAnd then I got a ... year year round trustworthy one I guess like I think my parents are like so hard to imagine letting your child do what I did I had a ... year rail pass and spent three weeks\nGoing through Europe after all this so it was an incredible experience but it was my chance to get you know a little closer to the Beatles and where they came from\nWell am I here at ... at ... and ... that is so last week would like to think of it as destiny you were men will liver for all of these I guess so and bring it all back this has been such a joy [laughter] which you play one more song yes for\nSure we're going to play one I'm off of altered east it's called time capsule cool\n\nAnd [noise]\n\n\n\n[noise]\n\n\n[noise]\n\nNah\n[noise]\nThank you well yeah I mean both making eye a word were taken under the wing by Ira Glass of this American Life at different times in our careers and I are at Ohio so much Ira in terms of learning how to shape a story\nSo Mike is an amazing story teller and after I finished my third book of fake facts and I wanted to continue telling stories on stages I had been doing\nBut I I felt I needed to go in a new direction I didn't know what that was going to be\nSo you know Mike was the one who told me\nWhy didn't you do what I Do which is go down in the basement and in park slope Brooklyn it's a basement performance space and union hall or not far from my home and his and uh and just get up on stage and start telling stories and see what comes out\nAnd so I I did a weekly residency there for a couple of years and these were the stories that came out and I I I own a debt of gratitude to him for that experience and suggesting it and for reminding me that knowing what we're thinking about and knowing what we're preoccupied with\nIs not easy sometimes you have to scare it out of your brain\nIs standing on stage in front of a bunch of strangers\nThat was the author and former Daily Show correspondence um tops and talking with me his memoir vacation land true stories from pain full beach it came out and twenty seven teams [noise]\nSpeaking of men in the house no I'm Talking in the studio that Mike the amazing ... hot\nI thanks for having me oh you guys and excited\nAnd well we're pretty excited to do we have to take this pledge break\nLet let's do a really quick one child so that you know because we're still in the pledge drive it's something that we got to do ... just going to give out the number really quick just so that you have it right up top six seven eight\nFive five three nine zero nine zero is the number to call or you can use your phone as an Internet and go to W. ABC dot org and make your pledge of support to help you know to help us do stuff like talk to Phoebe Robinson on the radio [laughter] [noise]\nIt's amazing about how public radio shows\nLike this American Life having effected media giving us talents like they've been sent to Eris we heard from earlier and ... and then my bird they lay out\nNow WNYC is producing a pair of pot cats featuring TB Robin sin and and not invite comedian Michelle\nWe do who is the third do yes weight is allowed to have very very good chance that you first heard some of your favorite writers\nOr comedians on public radio now's your chance they give it back\nSix seven eight five five three Ninety Ninety or W. H. B. E. dot org I have not left out loud [laughter] this loud they really reading a book yeah since I read Tina Fey it's memoir and Mindy ... last book\nOh my God that is the best compliment well his I'm obsessed with both of them because they're not really an GI yeah okay so how so they\nCame to mind reading everything is trash but it's okay but your style Phoebe the way you play with language is yours alone\nThey would read the porch and I'm beginning home page one thirty ... absolutely thing here of course\nThis is like the first time I've read today so I Hope they don't ship over any words um okay so this is the essay that I wrote called some thoughts on interracial dating from someone who was a mother flipping pro\nAt it [laughter] great start [laughter]\nFull disclosure I've been single for two years and while there are tons of plus it's a single dumb I can do what I was wondering what traveling the world so Lowe's empowering\nAnd rocking nature's long Johns ... a leg here that's as long as ... here during the seventies\nChiefly warm during winter I'd be lying if I didn't admit it's sometimes difficult to be out in these dating streets in my early thirties that's thirty ... by the way [laughter] for one my eggs are dying now when I say that people are quick with like\nNo you have to move\nTowards priest the positivity folks but let's get real my eggs are dying that's just a biological fact sure it's not over for me not by a long shot I'm thirty four however let's not pretend I'm walking around with farm fresh eggs they ate [laughter] uh\n[laughter] I'm ... now remember that I Do remember when I read a lot of them like\nThis is so silly [laughter] um my inside or like a leftover frittata from Sunday Brunch that's been shown in my fridge so I sniff it him on the fence about whether I should eat it\nBut then I remember how good it was when I first had three days ago so I told myself that I don't need to see how The Handmaid's tale ends roll the dice a eat it anyway [laughter]\nOkay so ... you know every woman comes to mind up at every woman has a brain and the mind like this but you are oh being so candid so I'm just saying things that\nMany of us feel and believe but couldn't possibly say inception ingenious way this is what's so endearing but this word play Phoebe\nSearch boats free you know do they appreciate when did you begin adding to the English language\n[laughter] oh I Hope my words makes it into the dictionary one day I'm maybe like in high school\nBecause I think my parents like are always like to you just use a complete word so we know what you're saying they're confused half the time\nUm and I just always thought it was funny and you know I haven't really sort of like read any sort of blogging or writing that sort of sounds like this all just kind of like go with this instinct to just sort of abbreviate things and I\nI Do it all the time instincts really now like I was I got to meet bottom not to bring up on it but of course they will bring up on our life yes and I last time I hung out with him I was just talking I was like oh Bob on and he just started laughing like black and it just came out and so like now I call them ... and he's okay if\nI may I quote your yes at the risk of being ... um you said that meeting bomber twice where's your reparation\n[laughter] it is yes it is their duty is my\nBand and of course in that day I was like sort of joking around but I really I think I've been very lucky\nLucky to meet my heroes and have them be really awesome and generous and sweet and like sort of you know a lot of ways him an Oprah have inspired me to like be more philanthropic so to like have these moments with them as really impacted my life I think for the better\nOr tear one of the chapters is touched by an Oprah yet [laughter] you know with the chapter I think okay this is the funniest yet and then there's more [laughter] would you talk about Julia Roberts teaching you how to swim yes that is um\nSomething I Wish everyone could experience [laughter] I just wanted to say it was pretty magical I'm\nI'm a stereotype I Do not know how to swim\nUh we we just weren't a beach family growing up we never just like went out to swimming pools or whatever so also Lake Erie was polluted water yeah yes we're not going to swimming pool is going to watch [laughter] it's not a good place to learn so I just like entered my third's as you will and I still haven't been able to swim and I was shooting a movie for\nNetflix caught a visa and I'm\nStarting myself and that's ... Jacobs and Julius husband Danny motor was the director photography\nAnd you know Julie and the family would come out to visit and I think everyone was like pretty chilling for nothing I were like so thirsty 'cause we're like love and Julia\nSo we're like always making brunch plans [laughter] it'd be like yeah let's do barrage Lee she does he like so cool down to earth awesome and\nWe would make these planted in like Julia will show up and she's like oh my God you guys like look so great and we're like we went to ... and shocked\nThat looks so nice\nThat anyway one day [noise] Danny was like hey the fans come to town down his or her yes and he was in that we were like yeah let's see somebody finally he was like um maybe we can get a yacht and I've\nAlways wanted to be on ... but I was like this we part needs to be a huge part because I Do not have money for ya homeboy\nUm and yeah so they looked it up and it was super fun they were all like jumping off the boat and\nHaving a good time and are just getting the water's going as Croatia like this is great water going to be super boy it so I just like jumped in and Julia was like hold him in her arms as I was like kicking and screaming being like this is horrible and she was like laughing and it was actually kind of like the\nCutest way to spend an afternoon I think yeah it was fun are you in touch so\nEvery once in a while you know ... and I will trade tax messages um and she's very she like she seemed like a birthday message or like the other day I was telling her about my boyfriend 'cause he's a huge romantic comedy ...\nTo remember that my father came from a generation where if you put a roof over your head and food on the table your father of the year my father also you know my dad didn't also have a dad my father's father died of tuberculosis when my father was two years old\nSo there's sort of new age the notion that his dad is also a pow that that was not in ...", "year": "2018", "show_name": "City Lights with Lois Reitzes", "city": "Atlanta", "day": "18"}