{"month": "10", "state": "GA", "station": "WABE", "content": "Tomorrow in fresh air we'll talk about the crisis at Facebook serious data breaches and the Russian disinformation campaign and twenty six team\nUp with the company and its founder Mark Zuckerberg under scrutiny as the mid term elections approach\nWe'll talk with New Yorker staff writer Evan ... about the data breach and about how Facebook became vulnerable to spreading disinformation I Hope you'll join us we'll close today show with music by trumpeter and percussionist Jerry Gonzalez who was a pioneer in blending jazz and Latin music\nHe played in bands led by dizzy Gillespie look like diner Eddie ... and in one of the leading New York South Sudan's go hunt deliberate\nHe brought both music worlds together as the leader of the Fort Apache band\nJerry Gonzalez died on Monday in Madrid from smoke inhalation caused by a fire in his house he was sixty nine\nFresh air is executive producer is getting\nOur engineer today is Adam Spanish or associate producer for digital media is Molly ...\nWhat branch PR terms from ... and from western hotels and resorts western is committed to their wellbeing travelers with offerings like having me back a super boots are recommend near and dear lending for would work out here is left behind it home west west rise learn more western dot com\nWith more than five hundred retire models from twenty to manufacturers\nAnd an online tool for finding tires based on vehicle meets budget and brand tire rock dot com helping drivers find deliver and stole\n\nYou're listening to Ninety point one WABC Atlanta where each ... each NPR\nSupport for W. H. B. E. comes from ... to pest management protecting Georgia homes were half a century from termites mosquitoes roaches and all critters if it ... or ... or do you stop them inside and out B. R. E. D. A. write a pest dot com\nOn the next fresh air the crisis at Facebook and the scrutiny it faces as the midterms approach\nWe talked with Evan us now is a staff writer at the New Yorker about Facebook's recent massive data breach and about its role in disseminating disinformation I've noticed his latest article is titled can Mark Zuckerberg fix Facebook before it breaks democracy join us\nTomorrow afternoon issue on Ninety One WABC [noise]\n[noise]\n\n\n... W. H. B. E. and that the last time I'm ... and ... is sitting July envelopes repertory theater is presenting a battle of ...\nWhen productions that taming of the ruins delicious drama care I can travel and we'll ... we'll tell us about that\nMurray's intimate tete bringing the earth is bent south for Begich\nWe'll hear from memory film scholars the are\nThe heart and he didn't career a box or dreams of a heavyweight\nChampion in the wrong on stage now at the after ... we'll talk with the director and leave that to happen\nThe new\nLive from NPR News in Washington I'm jak spear the White House is pushing back against a New York times report accusing President Trump and his family of engaging in tax fraud is NPR's Asia Roscoe reports Trump is denying the allegations\nWhite House press secretary Sarah Sanders says the New York times story is an accurate but declined to go into specifics\nTotally false attacks based on an old recycled news story I'm not going to sit and go through every single line of a very boring fourteen thousand word story\nSanders referred additional questions about the article to Trump's personal lawyers\nShe is not aware of any plans to release the president's tax returns truck broke with decades of tradition when he declined to make them public while running for president T Democrats say they will request this tax records if they gained control of either chamber of Congress to act in the mid term elections Ayesha Rascoe NPR News the White House\nFive police officers were shot in Florence South Carolina today and a suspect is reported to be in custody\nGoing to a city spokesman police and sheriff's deputies were responding to an incident when they came under fire sheriff's department officials say three county sheriff's deputies in to city police officers were shot according to the county corner one of those shot a city police officer a since died it's not clear what motivated the shootings in an upscale neighborhood in the western part of the city\nThe occupational health and Safety Administration is finding superior refining company more than eighty three thousand dollars for eight worker safety violations connection with an explosion earlier this year the injured thirty six people Daniel ... with west costs in public radio has more\nOcean found the company which is owned and operated by husky energy failed to inspect and test equipment to make sure it was picked for service the agency said those measures could've prevented the explosion that constant evacuation for much of the city as superior in April ginger jewel with the activist group twin ports action alliance says the ... is a slap on the rest\nOf our first time this company that Syria refining company has been cited for some of the serious issues file shot on how she really wants to be a good neighbor to our community they'll make a commitment that they will not continue operations like as\nA husky energy's spokesman says in a statement that the company has continuously improving safety programs for NPR News I'm Danielle ... in superior Wisconsin\nSecretary of state might palm pay was cancer meant treaty with Rhonda dates all the way back to Nineteen fifty five move coming on the heels of a ruling by the United nation's highest court or in the U.S to lift sanctions against Iran that affect imports of humanitarian goods bump pale telling reporters day the ruling is disappointing but also lost for on\nThe court denied Iran's attempt to secure abroad measures to interfere with us sanctions and rightly noted runs history of noncompliance with its international obligations under the treaty or not nonproliferation of nuclear weapons\nRun alleges sanctions imposed by the Trump Administration after the U.S withdraw from a nuclear deal violates the treaty on Wall street that I was up fifty four points this is NPR\nMotors and Honda are announcing they'll team up on development of self driving vehicles technology as both major automakers and tech giants race to be first in was expected to be a growing space\nOn denounced labeled and best to point seven five billion dollars in a town of vehicle unit run by General Motors GM cruise all according to the companies is to develop a timeless vehicles are going to be produced at a high volume unsold globally\nHarvard students alumni we'll get to a test to find a case set to go to trial this month that alleges the college discriminates against Asian American applicants member station WBHM\nBoston Kirk Carapezza reports a federal judge in Boston made the decision in court today\nThe group suing Harvard students for fair admissions had tried to block students and alumni from taking the stand saying their perspective would not relevant\nFederal judge Allison boroughs dismissed that idea and granted eight of them the right to testify they're expected to support the value of diversity on the other side students for fair admissions that none of the anonymous Asian American plaintiffs suing harbored are prepared to testify the college help them to higher standards and unfairly denied them that mission\nThe trial begins October fifteenth for NPR News I'm Kirk Carapezza in Boston\nNew government study is finding one in three adults eat fast food on any given day roughly eighty five million people the Centers for Disease Control and prevention released the numbers today those findings are based on a survey of around ten thousand adults\nSo he found little difference between men and women but it did find that higher income families ate fast food more than lower income\nBecause he's so it's fifty shades of cage\n[laughter]\nBut the idea is that um she's in control of whether she does this or not a homicide she wants to that's the approach that I'm taking\nA and so we have to sort of fill this world with a certain that it's it's sexually charged for sure and we make reference in crops in costumes and in the behavior of the actors to this sort of lifestyle in order to give us the basis for her eventual submissions\nAnd how that's going to make sense in the me too era\nSo this is not take your kids to shakes\nNo I wouldn't um actually my young son has attended a few rehearsal and and uh he actually came backstage when I was just 'cause you know babysitters and then he became backstage one day and said we're not to do this scene should you get him it's like yes\nI Am [laughter] so\nUh so yeah he hasn't gotten to see much of it and we're recommending it for audiences Eighteen and I um I'd say at a mature sixteen year old could probably handle it\n[laughter] I mean they're probably likely to have read it in your school oh sure\nThere are so many other great Shakespeare plays even say he's a ... men and women and their roles and certainly they were always getting mistaken or trying to do this guy's each other um\nDisguise themselves with true as problematic as it is what is said you still find\nWe're going off to war and putting it on stage [noise]\nUp because this is a struggle between men and women are continues and probably always will um\nI you know I absolutely believe in the quality of the sexes but not the equivalency or we're not the same and even even though many of us are all over the place in terms of the spectrum of gender identity\nSupport for WABC comes from dancing goats coffee bar return locally roasted ... brought some coffee serving there are ... drinks and pastries in midtown parts of the market indicators dancing goats coffee bar will be opening sooner the exchange and book it\nWas twenty five hundred years ago and I think uh I think was the straw to is to um an end was uh strata has some really you know base jokes I mean we had to ask our sound designer for a collection of\n'em [laughter] I guess by say we'll say [laughter] so I mean NATO shouldn't crime I as I grow to the [laughter] not to mention the the various props I had to build so um\nYeah if there again the there as contemporary they speak to us um we're still in these struggles today so I I think both of them are as contemporary as they are classical\n[noise] this has been such a delightful discussion I'm from the very top at lightning as well\nI thank you so much both of you artistic director Kara control and director ... ... what a lobby thank you very in my house in Asia you\nImpulse repertory production of taming of the shrew opens tomorrow and will run through the nineteenth at the little windmill art factor in East Point list a strong ... follows quickly after it running from October six through the twenty if\nThere's more information at in polls wrapped\nDot com [noise] finally\nOctober um this weekend a month or so but it's with lots of awesome wide music we have Atlanta as premier hip hop festival it's like the south by southwest of hip hop with a three day festival and why your server in a restaurant could be the next big thing singer songwriter it happened to me so you have to do for\nFun Mary's music mix tomorrow six forty five and eight forty five AM and just after three thirty pm on mighty going one W baby\nNo matter how you listen to W. A. B. E. smart speaker mobile apps for a radio we still need your help\nYour donations important they pay for programs like marketplace wait wait don't tell me and fresh air\nAnd this fall you could hear more public radio because as soon as we hit our overall membership goal we entered the campaign\nAnd your contribution now before the dry starts counts so help us out at W. A. B. E. dot org slash donate thanks\nThis is W. H. B. E. city lights are low it's rights is thank you for listening for his genius and the thrillers Solyndra Alfred Hitchcock is known as the master of suspect\nEmory universities to park in the film and media studies\nIs devoting it's send them a tax theory free public film screenings and tire leader Hitchcock this semester\nThe series curator professor Michelle Schreiber and professor Matthew Bernstein joins me in Studio to talk about\nWhy Hitchcock and why now\nUh so I think that it's Hitchcock just remains his films from Maine timeless examples of great filmmaking and I think why now I mean I I Would say we should always be looking at Hitchcock's phones\nYou know look at what the women and his films such as to ... and the birds is is undergoing Janet Leigh Janet Leigh yup exactly and\nUm she part of what he addresses in his films this obsession I mean that's definition of vertigo 'em and neurosis the voyeurism and we're window you know which is a brilliant film because it\nStars all American Jimmy Stewart who we really like but this man is sick\nAnd I think you know new would've though and I know I'm ... for a moment just to say his use of actors who is casting of actors and is directing of actors\nContrary to this idea that he thought that role like cattle or he gets amazing performances from his actors but my larger point going back to your question is about\nIs Hitchcock massaging as perhaps on some level but he is also\nOne of the foremost filmmakers up his time who picks the vulnerability of women under patriarchy that if women are victims in his films it's because he sees them in a very traditional Victorian way is the most vulnerable members of society\nIt's not purely that but that element I think is is in an otherwise he could not make films that are so sympathetic to heroin like Rebecca like notorious like suspicion uh and and many others\nI think one of the cornerstone pieces of feminist down theories sort of got that area of the field started a which is Laura ... visual pleasure and narrative cinema written in Nineteen Seventy three\nUses it essentially her the premise of her arguments is its base in psychoanalysis I'm not going to go into that but it's essentially like the language of cinema is patriarch on that women Are Forever the objects of that cinema they're never in control of the gays they are always objects that the gays\nAnd she uses her to go anywhere window as her examples to for example to illustrate that point and talking about for instance how the character ... played by Grace Kelly and we're window is always is there to be looked at she's there to be seen\nAnd you know she works in the fashion industry and she's parading around and these gorgeous out sets\nBut there have been opposing perspectives on that argument which is sad but at least that's the one who gets it done I mean she's the one who goes over and I kind of giving away parts of the year she's the one who is actually moving getting things accomplished she's\nThe one who goes over to the lord throat while department and so I think it's just important to keep these two perspectives in mind 'cause I think they're both\nValid I think they're both they you can certainly make a very convincing argument on on both sides and this is one of the reasons why as a feminist film scholar um I find his work so fascinating and it's always fascinated me because there's just there's so much complexity and there's so many different ways you can approach that's\nOne of the overarching themes in Hitchcock film so I mean you could say that's involved drama is power who has power and which characters have power over which couch how do they how do they manifest that you know and we're window Jeff has power because he spent spying on his neighbor once one neighbor is aware of him power shifts so on and so forth\nBut power is also his technique it's his power over the audience and in that very broad sense technique and seen are United and Hitchcock is a very classical filmmaker his best films which were showing are very classically structured I mean Shakespearean structure um everything fits\nEvery decision he makes you know when we teach intro to film and we analyze that film a students will say do you think the director really thought of all this detail for certain directors including Hitchcock the answer is yes he thought of every detail every camera angle every bit of lighting\nA an story board at all as he found shot by shot so\nSo would you say that Hitchcock was successful as a director of both entertainment as well as our\nYou know for a new and I think in certain sounds he tends towards one\nSide like vertigo for instance which if I Am athletes already talked about that\nBut he's definitely airing towards the art more the artistic side there because that is I found that isn't classically constructed and to contrast that with your window which I think I I always tell my students this is just a perfectly constructed found every thing visually narrative lead us introduced at the beginning\nGets resolved at the end sound even sound motifs I got introduced at the beginning and the opening sequence get resolved at the end\nI mean in that case it's both art and entertainment but I think vertigo for instance as I found that was a not well received when it was first made because it was so far afield from just a classically constructed film I mean at the film operates\nOn yes this this idea of obsession and desire and it's very circular\nMy students have said it's like there's multiple movies and one and that is not ... and I think that's why people didn't respond to it very well initially but now it's become it I'm ... and the and the latest sight and sound pole of the best films ever made um it took a number one position away from citizen\nKane professors Michelle Schreiber and Matthew Bernstein\nEmery university Hitchcock film series continues tonight with the screening of ... or if that's in wide hole at seven thirty PM admission this free\nWABC began serving the community Seventy years ago at the start or mission was to educate ... people\nEspecially teachers raise such a ... were folk songs and I don't think there is so hot they know the way we're evil National Public radio and television and my and we\nGrew into what you know today this is Audie Cornish from NPR News we know you rely on W. A. D. Atlanta and they rely on you know this is double UAB serving Atlanta\nSince Nineteen forty eight\nThis city lights on W. H. B. E. S. lab his choice for NPR I'm Lois rights is thank you for listening\nSat in the Jim Crow era African American box or J. the sport Jackson has a dream of becoming the heavyweight champion of the world\nThe upcoming play the royale highlights the events that took place long before the fight in the twentieth century this play is loosely based on the real events of heavyweight champion\nJack johnson and here to speak with us about the ...\nOur director Patrick Harris and Garrett Turner the actor who plays shape Jackson welcome thank you so those are good to be here is a great to have fewer here so please tell us about\nThe real life character who inspired this\nTruck Johnson was a\nGreat American you know we put it on the line in their place is not going to be written in black history of where she is she's gone ruining in sports history and I like the learning to play because it's it's American history and if there's one a neutralizing thing that we had in the time or sports the kind of British people just are great entrepreneur or ... fighter\nA great American average visionary yet obvious charisma things that he really did so you'll just exciting to export his life your boxing wasn't too for us to know him but just a great\nI thought absolutely he was simply one of the most incredible\nFigures and our country's history because to be a brazen free free will and jive talking black men\nWho at a time when black men could be Lynch even looking at a white woman was marrying white women taking pictures in public writing flashy cars wearing these big suits and then knocking out the strongest white men in the country and the ring while smiling at the crowd\nIs just an incredible personality and persona to embody\nI read some thing um that immediately made me think of why you would be wonderful for directing this play Petra I'm\nA declaration of satisfaction per se out of this perfect sleep proportion giant and I'm looking right now is Garrett Turner\nDelivered blows to himself and to the pound into has surprised him by giving almost as good as he gets\nWe're making music bowl and pat too I wondered with your music and dance and and all that has informed your career how was that one line we're making years\nI'm resonated with you and and with your direction\nI think every culture has music you know and how they move the rhythm of their lives but if a certain kind of music and playwright or Marco Ramirez has given up these clap since I'm saying we have like a whole\nPhysical soundtrack the ... comes out of the actress so they clap for transition they clap for these things so it's it's perfectly in my warehouse ... music and\nUsing movement after language like the moving word in essence you know and I just it's really great and these actors are so wonderful when they know they work pretty hard work the hell out of them but they give you a really good job of staffing and stumping and\nUnderstand that Mark Zuckerberg in his own conception of his place in history believes that no change happens painless Lee and that change is difficult and in in many ways it's like his inspiration Augustus Caesar he he believes that he's made trade offs that", "year": "2018", "show_name": "City Lights with Lois Reitzes", "city": "Atlanta", "day": "04"}