{"month": "10", "state": "GA", "station": "WABE", "content": "Sir sir I Know we're low on time but I Wonder where you see this going from here so have suggested that Congress\nNeeds to take some action to react to this we've also seen a number of business leaders were pulling out of this Saudi investment conference the C. E. O. J. P. Morgan Chase Jamie diamond bill Ford who is the executive chairman a Ford Motor company Larry fink who's a CEO of a gigantic investment from black rock\nHave withdrawn from this conference before we have to wrap up here and I wonder what you think the pushback\nTo all of this might be just as we look to government to push back to business to make it so felt a little bit of both what do you think\nI think the pressure on businesses going to grow because the activists that we learned that there are more likely to intimidate a CEO than they are to intimidate an American president into action\nBut I think the bottom line in the end is that turkey and Saudi Arabia will\nCooperate if the oil [noise]\nAh to make this\nSomehow ambiguous and us what will happen is that Congress will and arms\nOf for use in intelligence cooperation in the war in Yemen but not a\nLot more that will still have the U.S Saudi security relationship it will be cold but it will hold\n... houses senior fellow at Harvard's bill for Center for science and international affairs former publisher of the wall Street Journal and author of on Saudi Arabia its people passed religion fault lines and future Kevin thanks for talking to us thank you and Sarah Leah Whitson executive director of the middle east and North Africa division of human rights watch thanks Sarah\nThank you this hour was produced by Denise ... tour to learn more about her and the rest of the staff visit us on line at the one a dot org slash staff this program comes to you from W. A. M. you part of American University in Washington distributed by NPR\nUntil we meet again I'm Joshua Johnson thanks for listening this is one ad\n\nSupport for NPR comes from this station and from the financial services firm of Raymond James offering personalized wealth management advice and banking into capital markets expertise along with the legacy of putting clients financial well being first learn more at Raymond James dot com [noise]\nAnd from the three I O T providing a software platform that enables organizations to deploy artificial intelligence predictive analytics and diabetes solutions and industrial scale [noise] learn more at sea three I O T dot AI\n[noise]\nFor joining us for when a on member supported Ninety point one W. A. B. E. Atlanta\nI'm Sam Whitehead thanks for joining us with your Monday Mornings opt to a great start to\nBe sure to stay tuned for a look at the Atlanta art scene with Louis racist on city lights up next at eleven noon to keep up with the top national stories of the day with hearing now than take a deep dive into Atlanta news a closer look with Rose Scott that's out one this afternoon now this is the kind of programming that helps you get through your day\nWhich will remain part of the new prime minister may wants to put all solving the difficult problem by keeping the u._k. inside the customs area but the European Union for that period of time\nBut he was a long term guarantee that will be no hard border ... staying inside the customs area would tidy case hands to try to negotiate new lucrative trade deals with other countries\nIn Northern Ireland democratic union party which is propping up ... government is threatening to pull it support may scheduled to meet with her cabinet tomorrow\nFrank Langfitt NPR News London\nOn Wall street the Dow was up twenty three points at twenty five thousand three hundred and sixty three the ... down fifty three points you're listening to NPR\nIconic retailers Sears is filing for bankruptcy company missed a debt payment if one hundred and thirty four million dollars today it's struggling under five and a half billion dollars of debt\nMassachusetts Senator Elizabeth Warren is releasing the result of the DNA test that suggests she does in fact have Native American ancestry from member station WBUR GBH in Boston Adam Reilly reports it's another sign the Democrat is eyeing a twenty twenty presidential run\nOrange claim to be part Native American has been derided by her critics for years but now she says an analysis by stand for DNA expert Carlos Bustamante shows she's right to senator is treating that result as a political event releasing a Youtube video in which in bustamante discuss his findings\nNow president wants to call my mom a liar what are the facts and we have a Native American ancestry and your editor\nTwo weeks ago warrant said she would quote take a hard look at running for president in twenty twenty she's also seeking reelection to the Senate next month for NPR News I'm Adam Reilly in Boston\nThere had been torrential rains in southern France triggering deadly flash flooding friendship visuals now say at least Thirteen people have been killed several months worth of rain dropped in just a few hours\nMy father shook his head that doesn't even sound like a read the he said\nShe looks pretty good I said clutching at straws\nMy father looked at me like I had lost my mind then realized that I saw and heard it too but was more prone to denial that he was he smiled at me gently the really sad thing he said is that she was singing better when she was with that do to use to beat her up all the time\nWell I said I'd rather that she never seeing another note than have to go through that\nMy father looked at me again and shrugged gay he said I guess but she used to really saying she used to really saying\nOh [noise] so many discover you\nAnd I I think that that that his response to to my concern about her personal life and her personal safety is response to that was something that so many people that love for music have which is we don't really want to know about the pain\nWe want to love the music playwright and author Pearl clay\nIn Atlanta here last week Pearl flag was honored with a governor's award for the arts and ...\nYou're listening to city lights um W. H. B. E. at lattice choice for NPR I'm Lois rights is here with you and producer Mike John it's\nWe're in the midst of our pledge drive if you are listening now why not flinch now if you have an ad on so called six seven eight five five three Ninety Ninety or online at W. H. B. E. dot org we\nJust got to hear some Pearl ... beautiful and inside some writing her point at the end that we don't really want to know about the pain of her beloved artists that we only want to hear the music\nIs heartbreaking and still ring true well one thing we can offer on city lights is a platform for artists to discuss both the pain and that music\nOr the sculpture or the dance or the ...\nWe want to hear all of it because we believe that appreciation of the heart\nCan come from knowledge about the people who make it that knowledge and connection is why you tune into city lights and that commitment is worth a commitment in return\nYour donation at six seven eight five five three Ninety Ninety or online at W. H. B. E. dot org\nYeah the hearing that uh that story hearing Pearl ... read that I'm from ah I ... I Believe in out of print collection of of stories that she published a long time ago\nUm it really it brought me back to being in Detroit in the ah growing up as a kid and it it just put me it put me right there in the same it's really remarkable having\nYou know having had pearls into read that story I remember that you reached out to her as soon as we all heard the news about a Reese's death and\nUm I remember at first she has declined she was very sorry she did she was busy writing a new play [laughter]\nUm but then she called you back ... hours later maybe the next day I'm after she thought about it can you ... what was the do you remember what the circumstances were\nSaid could I change my mind that ... ... ... it's it's a trick question [laughter] and yes she may have time for us to tell this amazing story about this gut wrenching heart breaking story of ... so\nCalled ... the Reverend flag for uh Mohammed al ... or so it couldn't come up so that I have a heavyweight champion of the world could come beat up or has [laughter] now\n... is just such an amazing friend for the show to have a less persons\nYeah and and she's been a guest more I mean more times than I can count 'em and you know that we have\nThat sort of access to her um is is a testament to uh to you blow it is I mean your ties to the arts community it's a gift\nUh that we get to pass along to the listeners and if you value what we do and what we can bring you one city lights\nWere just asking you please consider that and make a donation six seven eight five five three Ninety Ninety or W. H. B. A. dot org it's quick it's easy and in the end you'll feel good knowing that you've done your part to help keep this beacon of the arts in the city strong\nWith your new sustaining donation of Fifteen dollars a month or a single contribution of one hundred eighty dollars you can choose a one year digital subscription to the New York times this gift as our way of saying thank you and it includes access to all of their digital content it's yours as a new monthly sustaining member at Fifteen dollars a month\nSo please make your tax deductible donation online and\nThe rabies eat out or or with a call to six Seventy five five three Ninety Ninety six [noise]\nComing up in just a little while Amy Ray of the Indigo Girls will join us live in the studio to perform songs from her new solo album holler Mike\nHow can we motivate listeners us a call now so we can have a pitch free segment with a me\nWell I mean I think it starts with us just saying any re over over out but we so we have any re coming in were about to hear a word in in just after the break we're about to hear from her bandmates emily's failures we're having an Indigo Girls day on city lights um and you know since ... because we've had a\nYou're both of the Indigo Girls on as guests now uh it's I think that\nThat just goes to that goes to further show what we were just talking about how you know we have access to the uh you know we bring the arts of Atlanta to our listeners and that's you know that's something to really to really think about value where we're trying to reach\nA seven thousand Seventy people by the end of this drive and uh just trying to keep chugging along this hour to get as many or any many pledges in ah to keep us you know to keep a strong and on on on track\nTo and we need to hear from Fifteen view if team I think that we can do that I certainly think there are more than Fifteen of you listening who love what you hear\nIn daily arts coverage on city lights so won't you donate now if you have not yet done so six seven eight five five three Ninety Ninety or online at W. H. B. E. dot org thanked\nSupport for W. H. B. comes from fernbank museum where the science exhibits extend to be outdoors with Seventy five acres of nature trail a canopy walk and adventure Ford and children's play areas tickets at fernbank museum dot org\nAnd from leap frog celebrating Twenty years of offering managed IT Services and solutions to businesses including disaster recovery an interim service packages leap frog services dot com wheat fraud extraordinary IT Services\nAnd we think it's extraordinary that we can provide you the days of the arts and culture show if you agree and you know you do you're listening now if you haven't yet donated please do so online at ... UA B. E. dot org\nOr by calling six seven eight five five three Ninety Ninety we're hoping to hear from Fifteen of you're donating\nAt a level of five ten twenty dollars a month whatever works for you beginning at the very manageable five dollars a month we appreciate [noise]\nDo you have something you've been meaning to do but haven't gotten around to it yet\nWell Emily failures had been kicking around the idea of a solo album for about thirty year now she's already built a thin nominal career as one half of the folk popped you are the Indigo Girls\nDon't wait for her first solo record it and it didn't Wendy Seventeen when she released moderation aged\nEmily joined us the day the album came back to share her new music\nAnd tell us the idea behind the title well ...\nHas a flock of starlings and I've always been drawn to birds I'm not sure why particularly blackbirds\nAnd I saw a video footage of him or Asian of starlings and they do all the shape shifting fluid movement in and out of each other no one really understands why and even if they think they do and I still don't think we know\nBut they think maybe it's to ward off pray but anyway it's this beautiful soaring togetherness of this flock I saw it as a metaphor but what's happening in this country as groups of people form together in their communities and their movements\nWithout the hierarchical structures of power telling them what to do and some were flocking together for social change and for understanding and a time in our country where there's so much to this\nMm [noise] your colleague and I'm almost sister soul sister\nAmy Ray was a ... and she also had this uplifting message of we can work together and we can do this and we can do this trend sending our\nYou and producer my job I\nThink you'll notice yeah that that that conversation was was was really great I remember ah the lead up to the conversation because it was you know it's\nA hectic morning there's we have lived guests coming in and we you know doing her last minute stuff to prep and\nGet ready for for for it and ah you know it's oh it's you know big important guests several senators from the from the Indigo Girls is a big deal and uh and then she walks in the studio door and uh her lowest hug like they've known each other for decades because indeed they have you on TALK a little bit about how\nYou know ... years well\nHer mom Jane say has yours was our family librarian at me and our family librarian Madison right is it is but at highland branch of the Atlanta public library [noise] and so I'm\nBoth em Ali and Amy we're young girl sweat and we already knew Mrs failures and um we heard about the Indigo Girls career I mean beginning when they were in college\nIt's a very special connection Emily ... grew up listening to W. H. B. E. and now\nThey are friends of the station and the show and we are so honored the way to show your ... for what W. A. B. E. provides especially in the form of aid daily arts and culture ... is with a donation\nAt six seven eight five five three Ninety Ninety or W. H. B. E. dot or you\nKnow I I I Love the fact that I mean you know you you are forever or Chicago in I Would never want to take that away from you but the fact that Emily failures mom babysat your kids is one of the most Atlanta things\nDidn't exactly babysit but she curated ah their taste in literature you didn't have beginning when they were three and six and videos and um I Love that fortunate we are okay\nSo yeah like I think that we can say to our listeners um you know if if if Emily and Amy or on our on our team you know that's that's good company to be and and you can join them as sustained errors as members\nBy calling six seven eight five five three Ninety Ninety or going on line to make your donation safely and securely there at W. E. B. E. dot org yeah I mean the city lights is your source for what's happening in the arts in this town ah 'cause we have a voice that artists and creators trust we uh they\nThey come to us when they they want to announce that they have a new album coming out they come to us when they when they want to talk about there the the latest play they've created and I think that that speaks volumes to the sort of trust that the community puts in us and I think that that sort of\nAs you said earlier in the hour that that sort of commitment is worth a commitment return if\nSo we're trusting you to donate and we are trusting that we haven't heard from at least Fifteen of you and in just a moment Amy Ray lives\nThis fall W. H. B. is turning to our sustain us for help\nYou've no doubt noticed are increased coverage of the environment urban affairs and politics\nWe now have an investigative desk and WABC recently started offering pod cast like Barry truth and political breakfast this all comes at a cost so if you're a sustain or we'd like to ask for your help with an increase of your monthly sustaining gift an additional seven five or even three dollars a month will really help\nLeaves understand how much more WABC is offering Atlanta and increase your monthly donation online uh WABC dot org slash sustain her that's WABC dot org slash sustain her\nThanks support for WABC comes from Margaret Mitchell house presenting the C. I. B. C. private wealth management author series Christian konger and Carolyn urban discussed on lady like a field guide to smashing the patriarchy in claiming your space on October sixteenth Atlanta history center dot com and from taste of Atlanta a three day\nBut if it were to happen if public radio didn't exist if it had never existed what would that be like and the people of public radio where would they be now\nFrom ... it's the new test", "show_name": "City Lights with Lois Reitzes", "year": "2018", "city": "Atlanta", "day": "15"}