{"month": "10", "state": "PA", "station": "WPGP", "content": "Nine seven one said that eight eight eight nine seven one seven to for three Eldorado ... you know what's on your mind\nYou Larry this minute Houston I'm just wondering what it is what these Democrats you got uh some type of identity crisis you got this is Rachel does all this white woman who uh represent ourselves as a black for years ahead of a in\nA local chapter of the end they'll lazy he got as they do oh roared who was actually Robert Francis O'Rourke\nOr you know he's good Irish men but he thinks he's debate though he thinks he's Hispanic Warren\nElizabeth Warren's thinks she's a chair in the end what is it in the water or whatever these Democrats inside you Larry\nKing bonds there is always drivel eight nine seven one as a late night for the ones that we do for his written Larry elderly veterans on museum [noise] coming up to a black\nMan wearing a make a hat and was challenged by another black man and they ended up having a discussion going to have that for even [noise]\n\nOne more comment before I go to the phones about the uh [noise] from praising the congressmen body slammed the reporter article\nIn the New York post January twenty seven two thousand four headline Al Franken knocks down dean heckler referring to Howard Dean\n\nWise cracking funny man Al Franken yesterday body slam a demonstrated to the ground after the man tried to shout down governor Howard Dean the tussle left Franklin's trademark fix ram glasses broken but he said he was not injured\nSan Diego AAA\nNine seven one S. A. G. E. triple late nights have been one Seventy four three very elderly factor dot com studio let me get to this cut right now this is a man\nNamed y G night storm and he's in a store wearing a mega kept in a black man season where the cat doesn't like it and they have the following discussion [noise]\nGod about what happened to me in the grocery store while I was rock and the American way myself in a while almost sandwiches and the juices and food for the week and I'm standing in line and I wrote in front of me\nHe he wrote off on this motorcycle it was real cool motorcycle by the way people standing in front of me and she couldn't help but notice about this for two three hundred bucks\nThe pound man rock in the ... American\n[noise] you know\nThe front of me and he didn't get crazy he made a\nTrump arrangement syndrome he didn't come at me crazy or nothing but he simply put her for a while and meanwhile I'm just still rocking moment bowl you know looking at Facebook and all this stuff waiting in line\nAnd so he did he built though [laughter] enough courage and he said [noise]\nWhy rather [noise] why\nAre you when that is this race this man is against everything we as black people stand for and I just cannot believe that a black man will where that red Mac and ... and\nEverybody looked at a you know because it was a mixed crowd and there was some white people there are some black people there and everybody around to see my response and I didn't get upset or actually likes the fact that he wanted to engage in compensation\nAnd I said I'm so happy that you asked me why I'm aware of this this this lack of cap is because yes you're right it's symbolic is symbolic of American exceptionalism\nAnd let me tell you why and I said many many many years ago when I was twenty six years old I was actually homeless and sleeping\nOn the streets I was like gotten by everybody over the loan was Rob that was being up and literally urine and you know I had\nNothing man and I started to work and I was determined to change my circumstances so I'm praying and you know I saw it a crisis and I pray that the father give me\nThe the the energy and the passion to change\nMy life because I Want things better I'm tired of being homeless oh it's only on another really why I was homeless way back there twenty six years ago when I was a very young man well let's just talk about now so in a way I was homeless on a parade\nAnd by hard work\nAnd also the support of a lot of people fellow American citizens black and white Jew or gentile everything you know I was able to overcome that situation but as\nI was going I remember when I was a young and I was getting food stamps\nWhen there's nothing wrong with getting food stamps if you need it\nBut I was getting full steps him because of the soldier I just got through from being homeless I elevated forbid flip it on the streets the sleeping in a crack house than adult boy whose credit cards I was with me he got arrested\nAnd they're so then I had to find another place and I were to have like three or four jobs working working working an elevated from the crack house\nTo a house that was pet rats roaches in being an elevator to an apartment we just had roaches in it and then I elevated to an apartment we just had mold and then I elevated the telephone go when they kept on going and then finally\nYears years years later after having seven wonderful children being a dad\nFound my American Dream through hard work patience persistence and the grace of God and the support of\nAmerican I said this spirit of American exceptionalism is what to make America great it's all of them and the greatest things happened to me financially you know when I first started making big money but the day the government told me\nThat I made too much money for bone stance\n[laughter] why\nShe got all these jobs are making so much money\nYou do not qualified\nTo be on both stuff assuming the law so you have to get off and they say no you must acquit for millions off and just keep one job you'll still basic keep your benefits and I started crying LSD many many years ago I was a young man\nAnd the young lady who was working\nWith me my my mom or a worker she said don't worry if you just quit these jobs you could still qualify as I said ma'am\nMistaken believe it or not tears of joy because\nKnow you're paying for you to feed me [noise]\nThe spirit of American exceptionalism push a passionate person eats just become the greatest version of yourself through the grace of God and through hard work and the support of many of the American citizens\nBlack white Jew or gentile everything in between this is what makes America great and this is what Trump is talking about and I'm so happy you asked me that and that's why\nI was wrong in the ... the cost of what it represents and so he didn't really have a comeback or feel\nLike a bright man you know I'm I'm getting my groceries\nThan a ... or of course he didn't say he didn't argue with me but against the chance to civil discourse didn't agree with what I had on and that's fine that's why America the greatest country in the world we can agree to disagree we\nDon't have the white the same things but if he wanted to continue to be a liberal that's fine I was a liberal for a long time I have nothing against liberals I'm not saying that the evil it's just I decided to walk away from it because I\nNeed to attach myself to philosophy\nOf that is always taught me that I'm always the ... don't always need the government to take care of me and my family when God has given me two very\nPowerful arms and legs and a really hard in my chest while I can go out and work and do the things I have to do to clutter myself financially emotionally mentally spiritually man\nAmerica's greatest country on earth yes we have issues and problems that need big thing but I traveled around this world as a speaker and there is no greater place with the best opportunities to become the greatest version of yourself\nAnd there's nothing stopping you but you\nBest right here is the greatest mind the greatest muscle and they use it to amplify who you are free zone because guess what the American Dream is beautiful ladies and gentlemen and then I Love being a conservative I Love being a Republican\nAnd this message just everybody Democrats\nOr Republicans liberals conservatives independents aligned to nothing wrong with loving America there's nothing wrong with being patriotic and there's nothing wrong with standing up for the principles of lawyers\nWho represent\nUs getting past all the harsh this\nAnd the and the danger that was coming together because it's going to take all of us to make America great boom\nAll of us so that storm a little\nDrive like the videos round\nTo maternal check me out on a nice long dot com and you know interested in reading the comment let's keep a civil well let's move forward as an American family does brothers and sisters continuing to motivate each other to become my greatest sales\nBecause making America great starts with me and it starts with you\nKnow God Bless I Love you\nAnd I'll see you next time and a lot of this all the red among Rob the black and blessed to keep it going man God Bless their body and I love your America by\nMy goodness another house [noise]\nThe negroes don't read write\nUp a late night an S. H. G. triple eight nine to the one to the to force raped by him Larry Larry over all\nOne of the things I've understood at the Democratic party a quite an absolute spring will hold on the black man now and the mind that uh for about six years and they had no intention of ... with it and it's like what you've done among like them to get out of their selves\nAnd and so\nBut but to my point you you had a caller asked you how many legal\nImmigrants are accepted into this country and um and I happen to know living in San Antonio I'm married to Hispanic or met her family is from Mexico we as a country per year except about one million legal immigrants ... of which about six hundred thousand\nOr residency change it I don't know maybe they have dual citizenship and they're moving to America I'm not sure what situation it but that leaves you with about ... hundred thousand ... so that boils down to almost eleven hundred per day okay legal citizens that we are accepting into this country and at this point in our\nHistory we have the most legal immigrants that we have ever had in that thirty seven thirty seven no if you if you estimate our population at\nYou know you and do that math\nThat goes up ... percent of our population ... illegal immigrants mhm so you know to make the argument and this is through not only democratic uh you know president for Republican and that is very old and has been going on for a long long time um but\nYou know I wanted to ask you you mentioned earlier on your show that Mexico has\nThat when you call it a little buddy who entered the country illegally that's right my my bigger question my bigger question is if Mexico is and from what I hear they have a blockbuster and the willingness to help you you said that there are pretty much just escorting them and kind of\nYou know I'm ... I wear my whatever they're doing and how would these people are not rounded up by the federal rally needy or at least\nA medium that they can't for the integrity of Mexico ...\n... ... ...\nIf they're if they're entering legal you know so why should they why should you know if they're ... they're agreeing to help us and we just went on to a new trade deal with\nThem and things like that they're mainly ushering me people to our border and then they're going to see how we had\nThat is exactly what's going on why do you think Trump is so upset what do you think they're so angry [noise]\nBecause the Mexican government allows the so called caravan from central and South America to come on through their country because they know they're coming up to hear [noise]\nWhy do you think Trump is so angry they could stop it [noise]\nThe federally stop it [noise]\nThey don't want them to come into their country illegally I'm Larry Larry we'll be right back\n\n[noise]\nWhat is already News I'm Rhonda roster of President Trump in uh Illinois this evening on a campaign stop says the deadly attack by shooter on Pittsburgh synagogue earlier today shows anti Semitism must be confronted anywhere and everywhere it appears\nThe president's also speculating the death toll would have been curbed at the building had an armed guard prison and condemn the attacks in it resulted in a lot of people being killed\nMeanwhile Mr Trump says the hearts of all Americans are filled with grief this evening following the killing Mr Trump told the crowd is the political rally Murfreesboro earlier that the evil anti Semitic attacks an assault on all of us eleven people died six injured at the tree of life sent a God the shooter\nIs in custody meanwhile the man arrested in mass shooting Saturday at the synagogue appears to have made a number of heat it anti Semitic posts on various websites this was that sarin news\n[noise] let's talk about your business for a minute [noise] thinking that I'll be things you're doing to attract\nThe mentality between networking event than referral bonuses you're probably spending plenty of time and money to find the right people know what was your office\nNow they're trying to get him to leave it ain't worth voice is noble and get one and all that he designed around the way they weren't there that makes it easy [noise] married standing ... solution help you create an active for state employees can ... happy and healthy and more productive\nActive office products are constructed with Marshall Brain injury and requiring real simply said they're easy to that happened in companies of any size can happen buried ask ask if one state voting simple shipping free and I said he they guarantee means if you don't mind they will pick it up for free about their active\nWith state solution dot com crash medium to me and I gather dot com crash medium\nFor fifty the answer whether [noise]\n\nTonight will remain in Chile with breathing drizzly times especially when you when you're forty then tomorrow for word grace guys and some rain especially in the afternoon ... forty [noise]\nDigital rainy times tomorrow night with loaves again you're forty Monday starts out what the leftover shower then it turns out perfectly sunny with on your mind media bump just ranks right on the um twelve fifty the answer\nIs coming to six\nThe most important mid term election in our history\nWe knew we had the votes but do we have the moment the mainstream media just president for everything they got\nThey want to destroy this presidency is everything\nTo change things\nStick with us to find\nThe answer [noise]\nYou about to be double for roof replacement repair if you haven't called windows or us you just might many companies were overcharging area homes and businesses nearly doubled\nWith over fifty years and home remodeling ... windows are ... more than a window company they'll the areas for me or exterior replacement company recite indoors gutters downs felt and roof replacement and repair factory certified by north America's largest roof manufacturer of windows or a hospital never overcharge\nYou'll love there no pressure sales approach straightforward price in the fastest turn around in the business right now is zero interest for twelve month one of his twenty thousand dollars windows or else will match any competitors price you know hidden fees more surprises haver schedule\nFree move inspection today mentioned they import fifty for an exclusive ten percent off why pay double visit the areas for me it ... your replacement\nCompany windows or else more than a window company visit windows or us Pittsburgh dot com\nJust to say um twelve fifty theater [laughter]\n[noise]\n\n\nAmerica we have a country to say that now here's Larry Elder\n[noise] of\nA caravan law and order and Tom is\nWhat is that it is very for our last friday was guard the deck ... regards Nikki Haley as opposed to use your voters candidate your job is handling the game is that she was day in the political\nExpert six years somehow for more name recognition call with an age this Trump's his fleet and you're the lists that says presidents from\nNikki Haley Amarillo says now they can job she knows the ... of the things in the White House and then she the forms of vice president candidate flip along with my sense is\nForty forty four this reform you could game is known as the war while the ... has they play solitaire I say yeah he's he's safe jak grade you eat drink to that Larry [laughter]\nYou're buying one S. H. D. V. simulate mentioned the ones that are too for three Larry over relief after\nThat comes to the Muslim there'll be a member of my fellow a very special deal for older listeners fifty percent off the Fort pack which includes two premium to listen to go anywhere so and so if you're looking for an amazing night sleep now's the time to make you remove eight hundred eight nine ... Eighteen forty three be showing these comical Larry or go to my pillow dot com and again you quote unquote\nLarry in a few minutes I'll be on the Hannity show long with a Sean Spicer we're gonna be talking about this caravan Russia's gonna be talking about a a a statement that Chris formal made about the Trump audience as soon as like being in a Roman colosseum\nAll of that and more Megan is in Fort Worth Texas making your malarial to show\n[noise] Hi Larry just won the follow up and I thank you or the wonderful audio like your previous caller I think it would get mentioned that mhm regulations on amazing how shall I really enjoy it but\nUm I Believe that the government that that he had been all over the world that they have the speaker right and I was just curious ah you know if you had any more details on him because he seemed like a really\nVery that speaker and I found that story so inspirational what just love to hear more about his story you know where he spoke and then what do you fix on and say\nWell maybe he's got a website called his name is y G night storm and night is spelled in Y. G. H. T. S.\nT. O. R. M. Y. G. night storm in Y. G. P. G. H. T. excuse me N. Y. G. H. T. and then storm S. T. or in WWW night storm\nAnd Canada everybody pays according to your wages talk here making ten dollars an hour you might have thrown a twenty five dollars a month if they're making thirty dollars an hour you're gonna pay maybe eighty nine hundred dollars a month\nBut everybody is covered now we don't have a doctor's waiting lists it's because\nWe already have thirty six million people that live in our country\nRight how many doctors are you going to ask for thirty six million right and because doctors are limited to okay if you break a leg you only get five thousand dollars for that like if you got a heart oh you're going to get twenty five thousand five heart\nDoctors move away from Canada because of the capitalism that's down air well hey I can make\nMore money if I come down here and there's a need for\nA and Dave are you critical or you were you supportive of the Canadian system\nAre supportive of the Canadian system because I think when they came up with Obamacare there I said why are we doing Obamacare when we already have Medicare right everybody's paying into it\nRight so if we can get the doctors on board and get rid of the insurance companies that are just making money right\nAt how each state has their own radical\nI don't see why it won't work the whole world is on medical you know except for\nWell they've uh obviously I see a very differently I'm a free market guy and I think medical health care a is a commodity like anything else like fixing a car like a toaster like anywhere in the more competition to better quality the ... and the cheaper the prices\n[noise] ... yeah I agree with that\nWell I'm a I'm not I'm not sure we're about to David Obey the rules for the call I appreciate it star is in Newport Beach California arguing all very able to show\n[noise] I I guess God I'm an idea because my husband has been a harrowing popped up or forty years he talk a lot of combat medic and a lab tech but are people going into the emergency room but what about going to handle that core bopper whom we're supposed to talk until they come in\nAnd say you are merging the you know that way you're not an emergency Yoel Fink doctors over here on this side of understanding how boring work everybody how old were you going to lay out\nA lot of billing worked for doctors so doctors to go according to the\nWhole whole will come into play you know so much but that has no choice as to what I'm Out the different insurance company and so the answer might like\nOh well well it's hard to modern twenty dollar we only have one party called article ... like that all doctors are well when I started I did three and a lot more\nYou do we lose her oh I'm\nSorry we lost or your ... what's about to wrap up your point I appreciate that you would think you very much fiction must have been a shooting star making very much for the call I appreciate it Don Lemon shocked that President Trump called himself a nationalist I'm a nationalist\nUse that word we're going to talk about that word tonight it is a favorite of the all right and is loaded with native is and racial undertones and global world globally out loud had been used as a slur\nDon goes [noise]\nGone\nDone one of your colleagues Chris Matthews\nJust conceded most white people would never vote for somebody they thought he was racist\nSo why would President Trump himself as a white nationalist racist when one of your colleagues on the left who probably knows more about politics and you do used to be speaker to do a\nUsed to be the present retiree to speaker O'Neal you wrote a book about uh about politics and he says the average white person\nMost white people in this way is already put white people come and most of them would not vote for somebody if they thought he was a racist actually said if he if he thought they were racist but I changed the pro now to make it medically correct if he wrong\nIdea of how white people think given the fact that he's been on the White House life and be in politics all his life\nTrump was using that word to describe somebody who's proud of America and a national is as opposed to a global is as opposed to somebody who's willing to subvert our sovereignty to some shade court that's\nFree and\nOne nation and all of human history was built on that bedrock\nHours in the Republican of the people by the people in for the people\nSelf government requires freedom\nJust as freedom requires in individual willingness to self governing\nFreedom is made America exceptional but\nIt can only last as long as you and I see has expressed by the laws of nature and nature's God you can only laugh if you and I used the actors people's character [noise] forging character has been the pursuit of he'll do college in Eighteen forty four\n... comments for just carrying elevates the discourse moves on campus and nationwide [noise] to find out how you can take their free online courses for them to see the complimentary subscription to the primary monthly speech digest business deal freedom\nDot com that's Hillsdale freedom dot com\nThe average person considers estate planning just for the wealthy attorney Michelle Conti coastal counties law honesty planning for the everyday person there's a\nLot that goes into it he don't take more time making our car they're going to buy where they're going to go to dinner as opposed to what happened\nTo my children the state will dictate who gets why if you don't indicate to is to receive near south of money in passing we want to make sure we land appropriately so that they get the best of both worlds they continue to receive the benefits and they get the inherent in\nThe other thing you have to think about is planning we tried to be proactive in the approach\nThat we minimize any type of tax consequences when somebody dies depending on the value the state these taxes range anywhere from four and a half\nHour forty percent so we tried to make sure that the beneficiary ... as much as they legally are able to\nHear more on countries law Sunday Morning at eight thirty here on the answer for immediate visit county law P. G. H. dot com boom\nEveryday roughly ten thousand baby boomers turned Seventy and a half and what does that matter because that's the age Uncle Sam decided we have to start withdrawing money from our retirement account there called required minimum distributions or are Indians for sure\nAnd if you're like most people you have questions about what they are other calculated how you can plan for them that's why Kevin Bach from integrity retirements solutions is hosting an R. M. D. seminar to answer these and other questions joined him Tuesday October thirtieth or Thursday November first at the Greensburg garden and civic center\nSeminars complimentary includes refreshments and deserts\nReserve your seat by calling seven to four eighty three seven thirty five fifty three Seventy four\nEighty three seven thirty five fifty three or visit integrity retirement solutions dot com Kevin Bach has not affiliated with the IRS or any government agency insurance at a duty officer Kevin Bach Pennsylvania insurance license thirty five twenty eight nine AM twelve fifty\nThe answer\n[noise] [noise]\nIn a\n", "year": "2018", "show_name": "Jay Sekulow Live!", "city": "Pittsburgh", "day": "28"}