{"month": "10", "state": "AZ", "station": "KJZK", "content": "You dot org global village is a production of cammie W you're listening to the Arizona community radio network cage eighty eight eighty nine quake types Jake cage ACP Ninety One credit in Haiti Kay lady point seven in ... with the plants the week I Pretend there's campus grass the most the Jessica ...\nPerfectly and the landscape wall stocks of hybrid clubs health tall above the boiling green foliage waters garden center Eighteen Fifteen iron springs road in Prescott for people who love I breed grasses they love to shop\nFor the Arizona community radio network is provided by\nKeepers of the wild nature bark at animal sanctuary invalidate Arizona thirty miles east of ... historic route sixty six she over whatever jeopardy by rescued exotic animals lions tigers cougars dancers leopards monkeys are more open every day to divide except you de clawed historic route sixty six\nBy useful information all the public radio programs that you enjoy that and for entertain educate added a lighter plus a link to worldwide Web stream at kj Z. A. dot O. R. G.\nHa ha\n\n[noise] boom boom boom boom boom boom boom\nBoom [noise] didn't do much to the beach\nBecause people leaving boom boom boom boom boom boom boom\nBoom boom boom boom boom boom boom boom boom they may be good to be able to be the baby\nBoom boom boom boom boom boom boom boom\nBoom debate to be able to get something\nWe can do the\n...\n\nIn the movie in the middle east in the in the [noise]\n\nNa na na\n\nDa da\n\n\n\nDa da da da da da de la ... on clarinet she also arranged that song which is by morality and the song writer named ... solo for this recording called happy saw also be drink percussion in Durham worked from James chip and Anthony can see on\nA tune called African from Art Blakey Jazz Messengers\nNa\nNa na na na na\n\nNa\nNa\nNa na na na\nNa\nNa\nNa\n\n\nNa\n\nNa\nNa\n\n\n[noise] ...\n\nThem\n\n\n[noise]\n\nThey can can you know\nYou\n\n\nShe [noise] she\nShe\n[noise]\n\nShe\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise] [laughter]\n\n\n\nLate does go that far away\nAnd blew the\nDream\nBut non he meant by\nThat's it and then come tomorrow\n[noise]\nVanguard and shining a spotlight on the drummer Lawrence leather is in her trail here is Jean ... and the group he called the gene machine\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\nYou're listening to the Arizona community radio network on kj ... by Drake K. J. D. P. Ninety point one Prescott and kj became Ninety point seven can lend\nSupport for the Arizona community radio network is provided by\nMartin slimy Chrysler dodge cheap ram and key at twenty six twenty east any divine in Kingman you can depend on ... mind selection of new and pre on cars trucks an SUV more quality cars and trucks really do cost less the inventor and shop online at ... dot com\nSupport for the Arizona community radio network is provided by uptown United drug where you'll find friendly knowledgeable garbage that with more than ... years of combined experience or important Health News discount do botch key medication information or to refill your mail order prescription log onto uptown you not to draw dot com\nServing Kingman a golden belly\nBy the public radio programs you enjoyed that in poor middle aged editor Jane logo due June in radio dot com at church or ... at the Arizona humidity radio network that listen any time on your smartphone\nFrom composer David Bloom and a ranger clean up the album that they put out in two thousand Seventeen is called ...\nA particular piece featured the vocal extraordinary works works ordinary book work you might say I'm Sheryl Wilson right here on jazz when they'll transfer\n\nHe\nThe the the new\nWhen some of them by now there's been a\nSpike and simple that then you have to work and then you can say\nYou will be persuaded even feel we're in this day\nJust simple and you tend to go\nAre you an Internet good now there's\nTo get that kind of your fee and all you need to\nIt [noise]\n\n[noise]\n\nIf you took your dream and never see just how fun change his daughter that anyone has\nTo do oh\nYour dreams come true\nThere's no way of ... tell\nUs your dream we'll take your\nSearch to find to happiness another take over\nSome want you to do that is the head\nMe me me me me\nThe only you know you need to\nTo a a", "show_name": "Jazz with Neil Tesser", "year": "2018", "city": "Kingman", "day": "23"}