{"month": "10", "state": "AZ", "station": "KJZK", "content": "[noise]\nI\n\nWay\n\nYou're listening to the Arizona community radio network on kj da ... cage ACP Ninety One percent in Haiti the K Ninety point seven came with support for the Arizona community radio network is provided by\nMarch twenty Chrysler dodge jeep brand than the twenty six twenty east any divine and can you can depend on twenty family dealerships refined selection of new and pre on cars trucks and SUVs march twenty four quality cars and trucks really do cost ... sees it tore and shop online that can dot dot com\nRadio in the dino premier this Saturday they feel it's a funny show you like funny it's also full of valuable advice ... tried\nGreen chili on moral\nDo not like a moving train\nHow'd you how to do with all the time so that the central drought\nJoin us for radio in San Diego Saturday at eight PM\nFind useful information all the public radio program that you enjoy that inform entertain educate add it all I was a link to or lie Web stream at kj Z. A. dot O. R. G.\nThis from Kevin ... into another hour of jazz with Neal tests or we do something unusual to open up with a band that was based in Chicago about a decade ago when combined electronics than electronic effect when more acoustic instruments the ban was called the ...\nOn\nThe phone bills\n\nBills and\n\n[noise]\nTo\nGo to\nThe\n\n\n\n[noise]\n[noise]\nI'll be home to\n\n\n\nUm [noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n[laughter]\nNa na\n\nNa\n\n\n\nThe\nAnd I'm no money he\n\nUm [noise]\n\nI'm I'm I'm\nMore on our on our ...\n\n\n\nAnd\nThat's the band called me from their album magnetic flux oh\n\nA\n\nThat Jerry burgundy here's another recent album from another fire breathing ... ... ...\n\n\n\n\n\n\n\n\n[noise]\n\n\nJamie de la\nWeaken Shane\n\n\n\nWhat\n\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n\n\n\n\n[noise]\n\n\nSome old gold from out those back on a sunny Chris you're on jazz Neal pets are this is the highest in the home not jazz orchestra\n\nNa na\n\nAll\n\n[noise]\n\n[noise]\n\n\n\n\n\nYou're like me can you hear any community radio network ... cage eighty eight nine ... BP Ninety ... Haiti detained Ninety point seven keenly for the Arizona community radio network has provided\nBy data makes wireless in ... he was local reliable source in Mojave county for wireless Internet and under ... cut the cord by bundling you communication services Patty telephone to your high speed why network keep your phone keep your number look more by calling ... three three tonight the ... century three eight to nine\nPoint for the Arizona community radio network is provided by\nJoyce hotel when traveling on interstate forty Jews quality in Flagstaff take the ... ... that go up the driveway on the hill to quell the income for that quality yet I forget I Seventeen you're in a new reservations at seven seven for eight seven seven one\nFine public radio programs you enjoyed that didn't for middle aged ... to June in radio dot com the church for ... at the Arizona humidity radio network that lives in any time on your smartphone\n\n\n\n\n\n\nNa\n\nNa\n\n\nThat's really a drummer Willie Jones the third and a tune that he wrote entitled early morning from an album under his name on his own label don't you know labels called W. J. three for Willie Jones a third the song early morning featured buster Williams on base than ever agreed that the piano\nAnd rough more on tenor saxophone and you heard it here on jazz Neal tester ... with\n\n...\nI hear you about this guy named Charlie Parker and\nActually do on\nThe team and she said you know the new\nThen and then in the damn\nAdmissions during my read the scrap meals my little\n... to ...\nYou know\nI'm In charge on\nThe movies and\n... the standing\nCommittee made all my mind and I ...\nThe\n\n\nThose na\nNa na na na na na na na\nNa na na na na na\n\nNa na na\nNa na na na na\nNa na na na na na\nNa na na na na\nNa na na na na na na\nNa na na na na\nNa na na na na na na na na na na na\nNa na na\nNa na na na na na na\nAA and uh\n\nI\nAm\nNow [noise] [noise]\nAnd she died last may so\n\n[noise]\nOn\n\n\nOn\nSure\n[noise]\nOh\n[noise]\nNa na na\nNa\nNa na na\nNa na\nNa na\nNa\n\n\nNa\nNa na na na\nTo be\nTo go to\n\n[laughter]\n\n[noise]\n[laughter] and I'm\nNa na na na na na\nNa\nNa na\nNa na na na na na na\nNa when\n\n\n\nThe ten or triangle a route Lama Eric Alexander attached show when the ... than riding a trio the funding hinged sex tests oh\nWas\n\n\nHave\nBeen\n\n\nA job [noise]\n\n\n\n\n\n[noise]\n\n\nNo no no\n\n\n\n\nDing\nDing ding\n\n\nDing\nDing ding\n\n\n\n\n\nDing ding ding\n\n\n\nDing\n\nUs Charlie Parker with Miles Davis on Trump to just before that Gerry Mulligan with chip maker a trumpet this is something reason from the ... the lift the\nBan and\nThey\nMay\nThey\nThe\nAnd\nThen\n\n\nFor any\n\nAny of\nAnd\n\nNa na na na na na\n\n\n\nNa na\nMm\n\n\n\nHe have\nHe ...\n\n\n\nHave\n\nNa\nNa\n\nTango the St Louis blues played by fats Waller in\nNineteen thirty nine\nYou're listening to the Arizona community radio network on kj da point I drank K. J. C. P. Ninety point when Katie's eat cake Ninety quaint salmon king when\nSupplemental message listen to radio ... pm that's not supplemental you just said it right that the limit how are you sure yeah do you have to do it like that it's\nAn awesome but how many women in my district and the radio when you do this better data ... pm my ear on the Arizona community radio network\nI kept with the times when we\nHad our fire alarm retinal with a name\nLike fire alarm you'd expect large red plans that take up fire has to put the growing pedals out this fire alarm mom comes back again for even bigger shadow next year waters garden center Eighteen Fifteen iron spring groomed in Prescott who people who love\nThey just shot\nBy useful information all the public radio programs you enjoy that inform entertain educate and didn't like it was a link door lie whipped cream at kj Z. A. dot O. R. G.\nO. come into another hour of jazz with Neal tests or would do something a little unusual to open up with a band that was based in Chicago about a decade ago when combined electronics than electronic effect when more acoustic instruments the ban was called the ...\n\n\n\n\n[noise]\n[noise]\n[noise]\n...\n\nBad\n\n\n\n\n[noise]\nTo do\n\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise] [noise]\n\n\n\n\n[laughter]\n\nWay\n\n\nAnd\n\n\n\nHe\nAnd he sees me\n\nAnd [noise]\nAnd um he\n...\n\n[noise]\nAnd\nThat's the band called link from their album magnetic flux\nIn\n\n\n\nDa\n\n\nDa\nDa\n\n\nDa\nDa da da da\nDa da\n\n\nDa\n\n\n\n\n\nMonth she\nWears God's will know\nWho wants to do the\nJob is when they\nWhole new meaning and she goes oh\nLittle guy\nThe ball game I'm I'm\nWith him and [noise]\nEven though she got\nBlown\nTo date and one of the\nI\n\nThat's music from one of the loop courtesy of ... and indeed here is Ramsey Lewis\n[noise]\nYou\n\nBoom\nThe with Nicholas Payton on Trump and\nHere's the most recent release from pianist Gerald ...\n\nRight uh\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n[noise]\nAnd\n...\nUm\n", "show_name": "Jazz with Neil Tesser", "year": "2018", "city": "Kingman", "day": "11"}