{"month": "10", "state": "AZ", "station": "KJZK", "content": "\nBroadcasting from the campus of Arizona western college this is border radio I Thirteen twenty am ...\nAnd border radio is the dot org we also broadcast on the Arizona community radio network at eighty nine point five FM kj ... Williams Ninety point one F. M. K. J. C. P.\nYou're listening to the Arizona community radio network on K Jaycee a painting I played by Drake cage ACP Ninety One percent in Haiti the K Ninety point seven kingly\nItem Cyrus or not this summer absolutely casting porters orange plane dragon has been ruined exclusively pretty Prescott area dragons or in natural about garden with auto blooms\nInto bloom again in spring\nWaters garden center in Prescott regarding cyber snap passively fun to play what\nAre the easier and whether it's eight or here's your evening forecast for ... hours of donors drugs tonight or that low sixty four guys be willing to risk it bothers you about it ... hours at a possible under storms early evening that low fifty four degrees at ... hours and do this job does she think overnight low forty eight degrees but that you can\nFind useful information on the public radio program that you enjoy that inform entertain educate ... Bush a link to or lie Web stream at kj Z. A. dot O. R. G.\n\n...\n\n\n[noise]\nYou know the power\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise] oh\n\n\n[noise]\nOh\n\n\n\nThat's from John easily and the big band he calls monk kiss dreading the reason the calls that that is because they play his arrangements of the ... months music\nAnd take them well into the twenty first century without losing I think the essential monkey two of those composition I don't know that's the word but it is a word it isn't that we're now ... and so this is a long history of him to John ... who you heard on the Oregon the trumpet work was from Brian Schwartz\nAnd the June was monks light blue\nHere's another month competition for the latest album by young Joey Alexander\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise] well\n... [noise]\n\n[noise]\n[noise]\nAnd\n\n\n\n\n\n\n\nAble\nDo than [laughter]\n\n\n\n\n\n\n\nCouple of recent releases here for you on jazz would Neal tests are just been listening to drummers Steve Smith that his group called vital information\nWhich as constituted on their most recent album called the heart of the city includes many Valentino on guitar marks skin on the coup stick and electric piano and Baron around a base\nThat they were joined by Andy first go I'll do saxophone a tune that was written there by any Valentino is called ...\nAnd before that we heard Brian sure at the title track from his most recent album on the steeplechase label it's called back up\nAnd on it Brian ... leads a trio that includes drums and piano so it's his hand and be three organ play and the piano work of Henry Hey who\nHas a law resume he was a musical director for George Michael he worked with David Bowie so he'd been in and out of the jazz field he brings the different energy to this album from Brian ... and also be joking record on drums we got music from the Seattle, Washington based band called the ... chewed up next\nThis is thirty twenty forty radio ... oh essay and border radio easy dot org a service of Arizona watching college for more than forty five years\nThe WC foundation WC alumni association and the Mexican consulate in Yuma upper taste of you must duty fast it's a chance to sample local cuisine while enjoying entertainers celebrating Mexican culture\nFriday evening October fifth from five till eleven details at foundation dot easy western dot edu\nShowers and human tonight below around Seventy five with some possible thunderstorms mostly cloudy tomorrow at the high end you're eighty eight and sixty percent chance of showers tonight in Kingman sixty percent chance of showers cloudy low around sixty four tomorrow Seventy percent chance of showers ... guys hind you're Seventy eight\nIn Prescott tonight showers and thunderstorms all around fifty six tomorrow chosen thunderstorms with some possible heavy rain falling behind you're sixty six\nIn Flagstaff tonight showers and thunderstorms slow around fifty two tomorrow chosen thunderstorm time you're sixty to\nArizona western colleges asking for feedback on the student experience at a pill UC\nPizza in swag provided for everyone who the tens you do your opinion and get pepperoni for your thoughts tomorrow afternoon from three thirty five in the liberal arts building room one oh wait on the MIT campus for more information call Kay till you see it three or four four seven six nine zero\n\n[noise]\n\n[laughter]\n[noise] [laughter]\n[noise]\nDidn't go to in the two [noise]\nAnd then boom boom boom boom\nDa da da da da\n\n\nAnd they\nDo not have na na\nNa na na\n\n\nIn\nThe latest music from drummer doing jak here's the latest music from the ... in\n\n\nAh a\n\nWe're going to go for you\nAnd for her but\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\nThe\nOr the Miles Davis Quinn Seventy some years earlier\nWas Mr gone and you're attuned to jazz with neo pets are\nVicious border radio K your wife age Thirteen twenty am and to order radio ... got to work a service of Arizona western college\nWe also broadcasts on the Arizona community radio network at eighty nine point five FM J. J. D. A. Drake Williams Ninety point one F ... you'd be pressed catch and he points out but I Am ... the cake came in and\nYou're listening to the Arizona community radio network on kj ... nitrate K. J. C. P. Ninety point one granting kj became Ninety point seven kingly\nSupport for the Arizona community radio network is provided\nBy Martin's funny Chrysler dodge cheap ram and key at twenty six twenty east anti divine in Kingman you can depend on ... fine selection of new and pre on cars trucks an SUV where quality cars and trucks really do costs less the and the terrain shop online at ... dot dot com\nSupport for the Arizona community radio network is provided by uptown United drug where you'll find friendly knowledgeable garbage that with more than eighty years of goodbye to experience for the board of Health News discount coupons key medication information or to refill your mail order prescription log onto uptown you not do drug dot com serving pigment a golden belly\nBy the public radio programs you enjoy that and for middle aged editor Jane won't go to Judy in radio dot com that church for ... at the Arizona humidity radio network that looks at any time on your smartphone\n\n[noise]\n\nThen\nAnd\nYou know\n\nIn an animal\nPlant\nAnimal\n\n...\n... or\n...\n\n...\n...\n\n\nNa\nNa na na\nNa na na na\n\n\nNa\nPowell recorded at the end of Nineteen sixty one and a tune called myth that featured a buck Powell along with the French ... basis beer ... this was recorded in Paris and three other like but how expatriate amounts\nThe unbiased on tenor saxophone Kenny Clark on drums and you're hurt either through their mind with the trumpet solo we've got another about composition coming up and just a little bit first though the latest from piano Johnny O'Neill\n[noise]\n\n\n\nNa na na na na\n\n\nThe show\nTo cash in\nVoters\nThey went\nAnd then those better than\nBond sometimes faster\nTrumpeter Bruce terrorists here is a ... [noise]\n\nThat's a lake relieving singing her lyrics to the Dexter Gordon melody entitled Saudi Khalifa\nThat's from her album cities between us that also included the fine fellows from Carmen staff on piano Steven Riley on tenor saxophone ... ski on corn that\nJust before that we heard from trumpeter Bruce Harris the atlas called beginnings that's among the reasons I think that it is his debut album\nAlso I haven't seen his name at the top of the uh the recording before this so let's assume that this is the debut album from Bruce Harris and if so it is a fine beginning\nNa na na\nNa na\nNa na\nNa na na na na na\n[noise]\nAnd [noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\nMy\nLong\nNow not talk\nAnd we\n...\n\n\nThan our parents in our\n\nThe ...\n... ...\n\n... but let\nTo John\n\nNa na na na na\nThat's Gerry Mulligan at the helm of a pretty intriguing I tip that record it back in Nineteen fifty seven\nA jury Logan had the first of the baritone saxophone solo the other me here baritone saxophonist was al ... better known for his tenor saxophone play also you're hardly call it started out those ... he was the first of the shows but the other Alto saxophonist was Alan eager better known for his terrorist acts of all the way\nAnd the tenor saxophonist that you heard was do since at least I think that's how it lays out\nIt's a little difficult to tell because there's five guys there and together they play about nine different saxophone also pretty green guitar Henry grinds on base and they basically are drug\nAn unusual recording the Gerry Mulligan song book from which to turnstile came it's unusual in the sense that it is all Jerry well again compositions but not arranged by Gerry Mulligan who was first and foremost known\nAs a ranger before he became a baritone sax appalled star instead the arrangements for Jerry compositions were turned over to build Homan another pretty greater ranger\nFan so just before turnstile we heard an album\nTrio founding terrific were that the ban on drums and re brown on bass and the two called six and for\nThose things Iran jazz with Neal cancer with music up next from the latest album by the clarinet is not going this is her I think fourth or fifth album inside of the year but each of them has featured a different group this is a ten be banned that she leads into the title track from the album called happy song\nOh\n\n...\n... ...\n... you know young my [noise]\n\nThank you for listening to what they ... Thirteen twenty am as well as border radio ... dot org\nA series of Arizona western college we also broadcast on the Arizona community radio network at eighty nine point five ... Williams Ninety point one FM Jay Jay Z PE Prescott Ninety point seven\nYou're listening to the Arizona community radio network on kj da da da da da de Ninety putting my credit and Katie he paid Ninety point seven king\nThe king the center for the arts is a nonprofit company committed to promoting the art sinking the group is renovating the Beale Street theater which will be a Center for culture creativity and community\nIf you'd like to contribute time or money please visit Beale Street theater dot com or call Christina Mickelson at three eight five three one nine five to three eight\nSupport will the Arizona humidity radio network has provided by cable one providing TV Everywhere get more out of your cable GB experience with TB everywhere standard cable customers have access to fifty plus cable networks that you can enjoy watching from your computer your tablet or smartphone to learn more go on line to cable one dot net\nThat's cable one in ... county\nBy useful information all the public radio programs you enjoyed that and for entertain educate added like Bush a link to or live with stream at kj Z. A. dot O. R. G.\nEarly warm and from the fad Jones Mel Lewis orchestra\nAnd this from us actually want to stay many shots about who's put this album out under his own name the album is called short notice and it features a rhythm section led by the Israeli born Australian pianist Powell Colin on a tune called the green mountain on\nA\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\nGood luck to bone as many as shot the ball from his album called short notice and the drink towel Cohen at the piano or doing the jazz with menial tasks or and here's something from the latest by by Bruce ... Ben ...\n[noise] [noise] [noise]\n[noise]\n\n\n\n\n\n\n\n\n[noise]\nThat's the Ben Merkley big bad in Denmark Lee is the pianist and uh his album that came out in the middle of two thousand Seventeen isn't titled a clockwise it's subtitled the music of cedar or walk and\nWho is the composer of all of the tune that bad marquee has arranged for this recording including that won the title track\nClockwise which also featured the trumpet work a John lake cabin towards the end a guitar solo from a fellow name Steve cope out check\n... many of the names in the band mark Lee big bad are not that well known or ... or at least not yet but I I some of them are and I imagine we'll be hearing more from these guys because he's a talented ranger\n\n\nThe ...\nDay one of the things change you read the\nTo hold the data\nMaybe [noise]\nDanish vocalist names to not eat can she is actually where she is widely knowledge to be the finest jazz singer working in Scandinavia today I think I might expand that to Europe\nAnd a couple of more attracts you may start to argue with me that perhaps we are thinking too small it's an e ...\nLatest recording from hers called dreams and features an all American band except for the pianist Jacob Christopher ... who has worked with her for many years but you also heard Larry Coons on guitar and Joey Baron on drums and Scott ... on bass\nMan that's good just before that where the latest from Dave striker his quartet free drinks the Nelson on vibes along with Jared Gold on Oregon and Kentucky hunter the drummer the album called strike and a half from which we are the Wayne Shorter tuned footprints and before that\nI turn called counter clockwise from the album that the re released in the fall of two thousand Seventeen by the tenor saxophonist Lena block and a rhythm section that is really wonderful with Ross last thing on channel camera and brown on bass than really meant um drum\nDoesn't jazz with me Neal hamburger and this is Kenny Baron", "year": "2018", "show_name": "Jazz with Neil Tesser", "city": "Kingman", "day": "02"}