{"month": "10", "state": "AZ", "station": "KJZK", "content": "You're listening to the Arizona community radio network on kj da ... by Drake cage ACP Ninety point one credit in Haiti the K Ninety point seven came with\nSupport for the Arizona community radio network is provided\nBy Americans twenty Chrysler dodge cheap ram and key uh twenty six twenty east anti divide in king that you can depend on Chinese refined selection of new and pre on cars trucks and SUVs where quality cars and trucks really do costs less see in the draft shop online acumen dodge dot com [laughter]\n[noise]\nBut it was just going to start or did I miss an hopes the new roadhouse for new music to bury the classics new orders to to the old favorites are to an hour every week and the road house with the point is blues you never heard referred to listen to the wrote down the road\nTops Saturdays I'd Seventy yeah\nFind useful information all the public radio program that you enjoy that and for entertain educate add it all I was a link to our live stream at kj Z. A. dot O. R. G.\n\nH. teenagers change change change when you can find a\n\n\nInteresting to me and you can see the need to be told\n\nTo get on gender saxophone Charlie Bird on guitar and the album that they may together in Nineteen sixty three called jazz samba which was really the beginning of Americans love affair with the ... thank God\nYou're doing the jazz when Neal cancer here's something reason from a Brazilian saxophonist and composer ranger his name is Jay will [noise]\n\n\n\nWhoa\nWhoa whoa whoa\nWhoa whoa whoa\n\n\nSwim and Dr Jay her album and reasonable you feature her versions of\nSongs in the green American song book here's another written by Cole Porter as was that one from van Morrison\nThe route go how\nAre the ... the man was\nSoon be she knew what\nDoes a ... ... ...\nTo smile to gain\nA machine\nThe water\nI'm getting to know how we'll rent na na na\nNa na na\nMan to be\nI don't play\n...\nThe uh the um um\nI don't know\nSense\nHa\nHa ha\nHa\nHa ha\nHa\nHa ha\nHa ha\nHa ha ha ha\nIt's only a paper lunar that's terrific solo from Lester Young on tenor saxophone so terrific is so low that any ... later put lyrics to it and share\nA\nNot to mystery a report\nWho said he\nMay Dona\nEarly ... I\nHave an air but there's\nGod you know now I see them as a car\nAt all\nThat it [noise] so how many\nHow many are you here on the jump the mode\nAnd now\n\n\n\n\nNow\n\n\nA\n\n\n[noise]\n\nNa na\nNa\nNa na na\n\n\nNa na na na na na\n\n\n\nNa\nNa\nNa\nNa na na\n\nNa na\n\n[laughter] [noise]\n\n\n\n\n\n\n\n\nNa\n\nNa na\nNa na\n\nNa\n[noise]\n[noise]\nThat's Art Blakey Jazz Messengers and one of the best albums that that that group recorded and remember that group includes many different chapters are like huge Jazz Messengers was banned from the Nineteen fifties\nRight through the late Nineteen eighties and there were many great musicians who were part of it in different ensemble fall under the name Jazz Messengers but even so you're going to make a list of the five or six best Jazz Messengers albums this one should be on it it's called the big beef\nIt's from Nineteen sixty with me Morgan on trumpet Bobby Timmons at the piano Jimmy merit on base of course was Art Blakey on drums\nAnd a wing shorter on tenor saxophone who had recently joined the band at the time of this recording in Nineteen sixty those wind shortage composition called Leicester left town which was written in honor of Lester Young who had\nPassed away a Thirteen months before this recording session so it was too young died in Nineteen fifty nine in Nineteen sixty nine when shorter recorded this to for the first time with Art Blakey Jazz Messengers Lester left town at the beginning of that set up three we heard Charlie Parker one of the Lester Young was great proteges\nAnd a recording of lady be good for Nineteen forty Charlie Parker would the James ... or ... one of the earliest recorded so Lowe's\nIn his ... and in the middle of the ... as I mentioned a radical transformation you could call it a a metamorphosis\nOr the two lady be good but actually the guys who wrote is called the mood of the more emphasis when they had it at at the ... led by James Moody the tenor saxophone us\nA for this recording with James ... modernist seems really didn't play a solo on it as it turns out they burned the trumpet solos was one of the co writers and you also hurts Cecil pain on baritone sax\nThose things here on jazz menial center I mentioned earlier if you were listening that the the v J higher album called that far from over featuring BJ IRAs sex tat had been named the album of the year in the NPR jazz critics poll a here's a good example of why\n\n\nYou're listening to the Senate community radio network on cage eighty eight eighty nine point nitrate K. J. C. P. Ninety point one parent can kj became Ninety point seven kingly\nSupport for the Arizona community radio network is provided by came in regional medical center fall means cooler temperatures football and\nThe flu this flu season get vaccinated help protect yourself and the most vulnerable members of our community asked you Karen see provider if the flu vaccine is right for U. K. R. M. C.\nSupport for ... Public Radio's provided by data makes wireless and ... you were local reliable source in Mojave county for wireless Internet an unlimited boy services cut the cord by bundling your communication services by adding telephone to your high speed why network keep your phone keep your number learn more by calling John Waters seven ... three three eight to nine ... century three eight to nine\nBy the public radio programs you enjoyed that in for a middle aged editor Jane won't go to tune in radio dot com that church for ... at the Arizona humidity radio network that looks at any time on your smartphone\n\nNa na na na\n\n\nNa\nNa na na\nNa na\n\n\nNa\nNa\n\nTwo generations represented on this album from Harold me burned the pianist who was in his eighties as is the drummer Jimmy cop\nMatt Reeves and the terrorist acts bonus Eric Alexander are both the ... mid forties\nPerhaps hitting fifty\nIs around may burns album cold to love and the love is the title track you're doing the jazz but Neal cancer and this is the Baylor project\nThe next to me [noise]\n\n\n\n...\nA a show called ...\nNa na\nRich and then nine\n\n\n[noise]\n\n\n\nNa\n\nThe pretense Miller quartet with the John Coltrane composition Liberia here's ... Brad field and who tolerate from his album African flowers\n...\nBurgers burgers burgers and versus the wrong\nPerson to person on the on the third person who does that mean to be the deeper in each other in the early ... for me to do\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\nAnd Janice Justin Coughlin from their duo album synesthesia which came out at the end of two thousand Seventeen years I'm not going\n\n\n\nIn\n\nHaving to do it again\nAnd again [noise]\n\n\n\n\n\n\n\nYou're listening to the Arizona community radio network on kj da ... pi Ninety point one in Haiti Nikkei Ninety quaint salmon king\nThe king the center for the arts is a nonprofit company committed to promoting the arts in Kingman the group is renovating the Beale Street theater which will be a Center for culture creativity and community\nIf you'd like to contribute time or money please visit Bild street theater dot com or call Christina Mickelson at three eight five three one nine five to three eight\nSupport for the Arizona humidity radio network has provided by cable one providing TB everywhere you get more out of your cable TV your experience with TB everywhere standard cable customers have access to fifty plus cable networks that you can enjoy watching from your computer your tablet or smartphone to learn more go on line to cable one dot net\nThat cable one in ... by county\nBy the public radio programs you enjoy that and for middle aged editor Jane ... to June in radio dot com that church or ... at the Arizona humidity radio network that looks at any time on your smartphone\n\n\n\n\n\n\n\n\n\nHave to be\nOf\nThe [noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\nThat's\n\n\n\nDe ... trio comprise Amy out the facts about the Missouri the bases Matt ... and on drums Jeremy Cunningham they are called the album triangular him\nIt was recorded in Chicago where all those musicians live and you're right here on jazz with menial tasks or where we have some more music from Chicago for another trio coming up next\nThis one led by pianist Paul ... the album is called flow\n[noise]\n\nOh\n\n\nThe\n\nA chaplain Medina here's Ron Miles\n[noise]\nA\n\n\n\nKnow and and\n\n... and\n... and\n\n\nNo no\nNa\nNa na\nNa then\n\n\n\nAnd ... and\n\n\n\nOr\n\n\nAtlanta\nAnd I think they're very\n...\n...\n... ...\n\nAnd ...\nAnd I'm and\nI'm ...\nNow\n\n\nAnd\n\n...\nAnd ...\n\nAnd on and on\n\n\n... the\nMet a\nMan\n\nNamed ...\n... ... ...\n... ... ... Mm the\nOrder on and on and on\nAnd on\nAnd\nAnd on\n\nA\n\nSunny Rawlins from an album called Sonny Rollins next album it was so title because the people who have been wondering when is Sonny Rollins going to release says next album this one came out in Nineteen Seventy three\nAt the end of a period of several years was one of the study rounds is periodic sabbaticals and he had been away from using people were wondering whether they be back well he came back\nFor that album which creature George tables on piano bar crunch on base and David Leon drums and the dining and is exquisite version of skyline so the rounds was famous for those on a company contends is either at the beginning or end of a tune that version of ... had\nA company to Denver on both ends some swath of the reasons it's really a what a great recordings and sunny rounds and just got graffiti they're doing the jobs will be able to answer here is Jerry burden [noise]\n\nOoh [noise]\n\n[noise]", "show_name": "Jazz with Neil Tesser", "year": "2018", "city": "Kingman", "day": "30"}