{"month": "10", "state": "CA", "station": "KALW", "content": "Silicon Valley tech companies that made it Research Center released a devastating report today documenting the censorship of conservative speech by silicon valley's tolerant tech giants\nAnd especially sort of Twitter and Facebook being accused of bias against conservatives\nAnd gab sort of came out of that controversy was started by a conservative programmer in Silicon valley who was sort of set up with what he saw as excessive political correctness so he started this website\nAs a result of the fact that it had very few rules there were no rules against hate speech they were doing a ton of of censorship is pretty much anything goes a lot of the more prominent people who'd joined were people who had been kicked off of other platforms for being too extreme and\nFlocked there because gab would allow them to stay pretty much whatever they wanted their other\nPeople on gap to obviously they have something like seven hundred thousand members but\nThe most visible stuff on the site was always the kind of shocking racist anti Semitic far right content that was being shoved off of more popular platforms and what about ... hours what have you been able\nTo learn from his postings on gab\nHe joined the site in January\nAnd we've been able to recover some of his post they'd been taken down but we had an archive none of them\nAnd going through them it's sort of gives you the impression that he was obsessed with anti Semitism I mean substantially all of the posts that he posted and re posted were about Jews were about conspiracy theories about Jews controlling the world he was critical of\nPresident Trump because he thought the President Trump was too accommodating of ... so this was powers Kevin\nWe leave making use of gab as it was designed\nTo be used as a far more lenient platform than Twitter then Facebook well\nRight before this shooting we had another act of\nDomestic terrorism which was this male bombing bombs sent through the mail some prominent Democrats and news organizations like CNN and the suspect in that case this guy from Florida Caesar say Iraq\nHe also use social media to post sort of extreme and divisive content but he didn't in a different way he was using Facebook and Twitter which are the big mainstream platforms and he was using them to\nInto fights and attack people and engage people who he just said\nAnd was that everyone was there and you can find his enemies and communicate directly with them\nWhereas Robert Bowers seems to have flocked to gab for the opposite reason because that was where the people who agreed with him or and that was where he could find a community of people who shared his views who he could communicate openly with without sort of the watchful eye of the platform getting in the way\nKevin you and I have talked about the fact that social media sites like Facebook and Twitter\nNeed to be stronger about policing this sort of speech that we're talking about\nBut I Wonder if your concern that what we're seeing here with gab\nA consequence of that any crackdown at all\nPushed people with more extreme views\nOn to a smaller and less public and more fringe the social media sites\nWhere inevitably there's less oversight\nMore people who hold equally extreme or more extreme\nPerspective and is that\nA problematic outcome\nI think one thing that we do know for sure is that when people get kicked off of Twitter and Facebook and other large social media platforms they don't just stop posting they don't go away\nFind some place else that will\nTolerate them more turn a blind eye\nI think we have to get comfortable with\nThe reality that one of the trade offs of having ... our biggest and most influential social platforms be healthier and less toxic is that a lot of the worst stuff is going to get pushed into these smaller\nMore private enclaves and there might not be any way to avoid that even if it shuts down even if something else takes its place\nKevin what have you been thinking as you've been reporting on all this\nIt feels like for many months we've been talking about the divisions on social media\nMostly in terms of politics what they meant in twenty sixteen what they might mean for the midterms\nIt feels like the events of the past week had sort of exploded that idea that the stakes are actually far higher\nWe're talking not about how this divisiveness might affect people's\nVotes would have about how it's getting into people's psyche is\nYeah I think for the last\nSeveral months I've been covering social media with a focus on what affect all of this behavior happening on social media would have\nOn one set of elections\nAnd when I'm realizing is that it's far far bigger than that because what we're really seeing is the kind of\nBreakdown of the dividing line between\nOnline bad behavior and real world violence is for a while lots of people thought that\nThreats or abusive language were happening on the Internet that it was somehow less real name was less threatening to receive a death threat on Twitter than it would be to receive it\nOver the phone or in person right\nNow we know\nTrue that often this stuff is one in the same that the threats and the conflict and the polarization that erupts\nOn line and in the media\nCan bleed over into real world violence and are doing it pretty frequently and in ways that are horrifying the consequences of all of this of this stirring up of anger\n[noise]\nOoh ooh\nThing what's going on\nIn our country frankly it all over the world [noise]\nSomething has to be done\nPresident Trump denounced the synagogue shooting in Pittsburgh even as the death revive question about what signals that intentionally or not to extremist across the country\nOr have you ever asked him to please not use that type of language when referring to other people for the case of civil discourse in the country\nEveryone has their own style and frankly people on both sides of the aisle use strong language about our political differences\nBut those around the president including vice president Mike Pence rejected any linkage between Trump's language and the ... of isolated extreme in\nBut I just don't think you can connect to the threats are acts of violence on and I don't think the American people connect to the American people believe that those who are responsible are are the people that actually conduct these threats\nWe'll be right back\nThe daily uh supported by babble at language at that teaches real life conversations in a new language like Spanish French German battles ten to Fifteen minute lessons are available in the app store or online at ... B a B B. E. L. dot com\nAntibiotic or money when you shop bank stream video on line that Dr my for Twenty years after my has been dedicated to helping the wealthy Todd Bryant deliver faster reliable and secure digital experienced it said that customers on other vices\nI can buy a K. A. M. A. I. dot com\n[noise]\nYou're listening to the daily on local public radio K. A. L. W. a number of local food establishment provided color retreats for volunteers and staff during our recent membership Dr including go he'll pizza patrol hills oldest restaurant for sour dough pizza [noise]\n... luxury for a freshly prepared sandwiches salads and ... if you'd patronize either an establishment pleased back then for support and KLW next to them and our other from donors can be found on our website KTEL W. dot ORG [noise]\n\n[noise]\nWords from I'm Nineteen [noise]", "show_name": "The Daily", "year": "2018", "city": "San Francisco", "day": "30"}