{"month": "10", "state": "SC", "station": "WLTR", "content": "[noise] if you're away from uranium listen online to South Carolina public radio at our website South Carolina public radio down and learn genes [noise]\nHi this is David Greene for MORNING EDITION and I have a simple message for you take your money and give it to South Carolina public radio not all your money I'm not even asking for half your money I'm Talking like five bucks a month as a sustaining star you know it's worth it you listen to all the time\nPlus right now you will be one of those rock star human beings who helps cancel the fall pledge drive go to South Carolina public radio dot org or call one eight hundred to five six eight five three five\nScience South Carolina public radio dot ORG\n[noise]\nHi this is David Greene for MORNING EDITION and I have a simple message for you take your money and give it to South Carolina public radio not all your money I'm not even asking for half your money I'm Talking like five bucks a month as a sustaining star you know it's worth it you listen to all the time\nPlus right now you will be one of those rock star human beings who helped cancel the fall pledge drive go to South Carolina public radio dot org or call one eight hundred to five six eight five three five\n... here in the instinct to South Carolina public radio W S C I F ... Charleston at eighty nine point three an HD won W E PR Greenville in Ninety One and WNPR Colombia and Ninety One point three\nAnd\nJohn deliberate do and you're hearing that goes coming up in the south a lot of new music and as I could do a classic from fifty years ago\nMusic by ... chronic artist from Sweden and we'll hear something new by now see stars also have a group called the A. C. S. ... T. E. S. C. H. E. S. [noise]\nThey are a husband and wife duo out of Austin perform their musical lives on which TV every other day they just released his six on a piece that they call ... songs more women\nWe won\n\nWe won new music by ACS I've also got a flashback fifty to the second album by then I became a progressive rock giants it's coming up on that goes\nC. H. E. S. [noise] they are a husband and wife duo out of Austin perform their musical lives on which TV every other day they just released six on a piece that they call ... songs on\nThe new one\n\nOnly one new music by a C. S. I've also got a flashback fifty to the second album by then I became progressive rock giants it's coming up on echoes\nLive from NPR News in Washington I'm ... beer or tired Supreme Court Justice John Paul Stevens says he has changed his mind about the Brett Kavanaugh nomination to the Supreme Court because of Kavanaugh's performance last week and the second round of hearings NPR's Nina Totenberg has more\nStevens who has praised Kevin ... in the past said he had changed his view and confirmation not because of any question about Kavanaugh's intellectual ability but because of his performance last week accusing Democrats and liberal groups as a partisan plot on behalf of the Clintons to destroy his nomination\nThose comments Steven suggests it would force Kevin to recuse himself from many cases before the court in the future\nFor the good of the court it's not that healthy they get a new justice you know only a ... a part time job\nNina Totenberg NPR News Washington\nUpwards of three thousand protestors gathered outside the Supreme Court today to make their feelings known to lawmakers Adam tomorrow is expected procedural vote on Supreme Court nominee Brett Kavanaugh\nFBI report clearing the last remaining hurdle for a Senate vote on the nomination among the demonstrators was a large contingent from Maine calling on Susan Collins a key Republican to vote against the nomination Collins is not get said how she will vote but did say that\nIt's not that healthy they get a new justice you know when they do a part time job\nNina Totenberg NPR News Washington upwards of three thousand protestors gathered outside the Supreme Court today to make their feelings known to lawmakers Adam tomorrow is expected procedural vote on Supreme Court nominee Brett Kavanaugh\nFBI report clearing the last remaining hurdle for a Senate vote on the nomination among the demonstrators was a large contingent from Maine calling on Susan Collins a key Republican to vote against the nomination columns has not yet said how she will vote but did say that it appears the FBI conducted a very thorough investigation of the sexual misconduct claims against Kavanaugh\nThree hundred protesters were arrested at a Senate office building today\nThe Trump Administration unveiled a new start planning for combating terrorism today NPR's Scott Horsley reports it's the first major rewrite of the planned in seven years\nOf land calls for beefed up border security a culture of preparedness and international cooperation to fight with the White House says is an increasingly complex and diffused terrorists threat\nNational security adviser John Bolton who oversaw the planning process says one big change from the previous blueprint is the focus on what he calls a radical Islam is the ideology\nGets a longer than the president's view that without recognizing that we're in an ideological struggle that we can't properly addressed the terrorist threat\nSupplant also addresses homegrown terrorism and the process by which people already living in the U.S can become dangerously radicalized Scott Horsley NPR News the White House\nThe U.S has not been invited to a summit in Canada aimed at saving the world Trade Organization Dan carpeting truck reports the U.S has been left off the guest list of with the Trump administration's disdain for the world body\nCandidates international trade diversification minister says the hope is that the Thirteen like minded countries who will attend a two day summit will come up with ways to reform the WTO and ultimately persuade Washington\nDress the terrorist threat supplant also addresses homegrown terrorism and the process by which people already living in the U.S can become dangerously radicalized Scott Horsley NPR News the White House\nThe U.S has not been invited to a summit in Canada aimed at saving the world Trade Organization Dan carp and truck reports the U.S has been left off the guest list of with the Trump administration's disdain for the world body\nCandidates international trade diversification minister says the hope is that the Thirteen like minded countries who will attend a two day summit will come up with ways to reform the WTO and ultimately persuade Washington of\nIts continued value but he says the best way forward for now is without the U.S President Trump is long divided the WTO and even blocked appointments of new judges to its dispute settlements buddy\nReporter Dan carpet in chalk on Wall street the Dow was down to hundred points this is NPR\nThe death toll from an earthquake and tsunami that struck a central island in Indonesia has not risen to at least Fifteen hundred\nIndonesia's disaster agency further boosting the death toll nearly a week after the disaster or French rescue worker says his team using high tech scanners has detected a person believed to be still alive beneath the rubble of a hotel\nThe magnitude seven point five earthquake caused massive devastation after hitting last friday countless people are still looking for loved ones with the death toll expected to rise further\nIn Los Angeles ... mobile Marian ... night was sentenced this morning or twenty eight year prison term stemming from a voluntary manslaughter case David Wagner from member station KP cc was in the courtroom today\nThe former C. E. O. F. death row records ran down fifty five year old ... Carter with his truck in twenty Fifteen night originally said it was out of self defense but now he's pleaded no contest to a charge of voluntary manslaughter the victim's relatives wept in the courtroom as they described how the incident has affected them after the sentencing\nExpected to rise further in Los Angeles ... Mogal Marion shoot night was sentenced this morning go twenty eight year prison term stemming from a voluntary manslaughter case David Wagner from member station KP cc was in the courtroom today\nThe former C. E. O. F. death row records ran down fifty five year old Terry Carter with his truck in twenty Fifteen night originally said it was out of self defense but now he's pleaded no contest to a charge of voluntary manslaughter the victim's relatives wept in the courtroom as they described how the incident has affected them\nAfter the sentencing daughter ... Carter said she's relieved nights case is finally over\nHe's shown our ... matter of fact he made himself the victim over and over again\nNext sentence as part of a plea deal to drop to other cases one involving robbery and another in which night allegedly threatened the F Gary Gray the director of the twenty Fifteen film straight out of Compton for NPR News I'm David Wagner in Los Angeles\nCritical futures prices took their biggest plunging roughly seven weeks oil dropping to point seven percent today to end the session at Seventy four thirty three a barrel on the New York mercantile\nExchange I'm jak sphere NPR News in Washington\nSupport for NPR comes from Americans for the arts committed to transforming America's communities through the arts and arts education supporting the nonprofit arts industry which employs four point six million people nationwide learn more at Americans for the arts dot\nHearing that goes on John deliberate coming up go to great new tracked by ... than a nice ... called the incident out\nLet's start with Lisa riser album and abandoned or good host was number one on the best of it goes two thousand Eighteen is so far list detract from a called that\n\n\n\n\n\nThe\nNa na na\n\n\nHe would\nBe\n\n... ...\nDay and that would let me\nGive me give me on the Iowa when\nThey get no one can make them want to me and the ... late\nLast friday\n\n\nThey say ...\nUm and\nWho who who who\nIn ...\nAnger\nAnd the day care\nAnd\nWho who who\nWho who [noise]\nWho\nWho do\nSo\nThe when you start getting one story five and a blue whale on line\n\nWe want a ... ... ...\nTo live on that\n\nWho who\nWho\nWho\nWho\n\n\n\nWho\n\n...\n... ...\n\n\nOr others\nAlbum from ... fields our doom and that came out of the speed at which they spelled E. E. S. E. A. S. Monday the name of that track from the BP calls\nWell I'm from ... fields our doom and that came out of the eighth seat as which they spelled E. S. E. A. E. S.\nClemente the name of that track from an e P called six songs pretty cool tune ... before that he gets better with every album his latest is called the incident and we heard the title track off of that one\nIn London Grammar ahead of that was under the stars of songs they contributed to the soundtrack for high skilled giants and other top one of our favorite artist this year to lease a rise or album and abandoned or could house coming up in the next\nHalf hour we're going to take a mini lash back fifty to pink Floyd second album a saucer below secrets you like what you're hearing today on that goes and want to hear it wherever you are whenever you want\nTo sign up for it goes online streaming subscription music service where you can hear the show twenty four hours a day on demand as well as exclusive online only echoes streams just go to echoes dot org to find out more stay tuned as that goes continues\n\n\n...\n\nNice electronic trapped by gold lounge or playing several pieces off of this album called floating in this one was Jupiter light an app waste before that she has a new one called warm eight we're it's every logic off of that one\nOf the top pink Floyd taking us back fifty years to June twenty nine Nineteen sixty eight\nIt's second album saucer schools secret so we heard at the controls the heart of the sun I have to admit I always report the live version on on the go to the studio one\nComing up I've got some new music by car Weingarten a great outlet features a bass player Michael memory but first is Warren Harris and you may not remember the name but he was part of\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n...\n\n\n\nOr\n\n\n[noise]\n\n\n\n[noise]\n\nMore at the center dot org\n... music called resetting takes me to the river with New Orleans folk are at the beach so like jazz or the ... the tickets are available now with the box office in Charleston music called dot com\nBy Jeff handling\nEvery week jazz happening now connects listeners to today's fibrous jets from emerging artists to the living legends still playing and recordings joined me for jazz happening now Sunday nights at seven Iran South Carolina public radio [noise]\n[noise]\nSouth Carolina Public Radio's no pledge drive pledge drive underway\nThe programs do you listen to all the time on the station depend on your financial support it's time to get at South Carolina public radio dot org\nMm [noise] you're listening to South Carolina public radio W S C I F em Charleston at any point\nThree an HD one company NPR Greenville at Ninety point one and WNPR Colombia and Ninety One point three [noise]\n\nIt's fascinating to follow the history of the tune all the way down to its origin to uncover parts of the story that folklore may have missed [noise]\nYou can just imagine a young refund Williams growing intoxicated and the stories behind old folk songs he collected throughout his life Mm\nThis is from his six studies in English folk song and saw the way less than Fifteen minutes music detects you all around\nIt's fascinating to follow the history of the tune all the way down to its origin to uncover parts of the story the folklore made mis [noise]\nYou can just imagine a young refund Williams growing intoxicated on the stories behind old folk songs he collected throughout his life [noise]\nThis is from his six studies in English folk song and saw the way less than Fifteen minutes music detects you all around England both geographically and emotionally those sorts of piano concerto number nine is on the way in the hour as well [noise]\n\nLive from NPR News in Washington I'm chase Stevens judge Brett Kavanaugh has written a commentary defending his tone and demeanor at a Senate Judiciary committee hearing last week as NPR's Kelsey Snell report Kavanaugh says he was more emotional than usual but remains an impartial judge\nKavanaugh writes in an op ed published by the wall Street Journal that time of his testimony regarding sexual assault allegations against him reflected frustration\nHe says he lives wrongly accused and his answers reflected his deep distress had what he described as an unfair process Kevin right to the judge must be a quote neutral and impartial arbiters who favors and political party he says he revered the constitutionality if confirmed would keep an open mind in every case\nSome Democrats say his performance was part is an end to disqualify the Senate is that for a procedural vote on his nomination on friday Kelsey Snell NPR News Washington\nHandful of US Senators say they have not decided whether to support Kavanaugh's nomination\nHe says he lives wrongly accused and his answers reflected his deep distress said what he described as an unfair process Kevin right to the judge must be a quote neutral and impartial arbiters who favors and political party he says he reviews the constitution and if confirmed would keep an open mind in every case\nSome Democrats say his performance was partisan and should disqualify in the Senate is that for a procedural vote on his nomination on friday Kelsey Snell NPR News Washington\nA handful of US Senators say they have not decided whether to support Kavanaugh's nomination Maine Republican Susan Collins is among the undecided show is retiring Senator Jeff flake\nA frequent Trump critic who was instrumental in getting the president to order the FBI investigation into sexual misconduct allegations against Kavanaugh a confirmation vote on the nomination is expected by Saturday\nUs defense secretary Jim Mattis says the night it states is ready to help NATO allies fend off cyber attacks by Russia's intelligence services speaking in Brussels mad as as the G R U and other Russian agencies must be held accountable\nDespite denials from the Kremlin international community clearly she's the reality in the United states and shoulder to shoulder with our judge and British and all NATO allies\nMattis calls the attack on the international chemical weapons watchdog reckless irresponsible and not surprising the same lot was conducting tests to determine if a deadly nerve agent was used poison a former Russian spy and his daughter in England\nAnd upcoming summit in Canada aimed at saving the world Trade Organization will be notable because of the absence of one country Dan ... reports that the United states was not invited\nWashington has been left off the guest list for the two day summit because the WTO is one of the organizations derided by president Donald Trump Canada's international trade diversification\nIt's called the attack on the international chemical weapons watchdog reckless irresponsible and not surprising that same lab was conducting tests to determine at the deadly nerve agent was used poison a former Russian spy and his daughter in England\nAnd upcoming summit in Canada aimed at saving the world Trade Organization will be notable because of the absence of one country Dan ... reports that the United states was not invited\nWashington has been left off the guest list for the two day summit because the WTO is one of the organizations derided by president Donald Trump Canada's international trade diversification minister Jim cars says ministers from Thirteen like minded countries will attend\nAnd he says the hope is to ultimately persuade Washington of the continued value of the WTO but the Trump Administration has gone beyond rhetoric and its disdain for the Trade Organization and even blocked appointments of new judges do its dispute settlement body\nCars says modernizing the world body is the best way to reestablish of rules based system something that would be more difficult if I Do I have not preserve the dispute resolution mechanism\nIn the new free trade agreement for NPR News I'm Dan carp and truck in Toronto you're listening to NPR News\nThe Pentagon is exploring the possibility of deploying insects to offer plants genes to make them more resilient and to protect the nation's food supply and opinion piece in the journal science suggests more study is needed since other countries may view the project is a potential biological weapon\nMilitary Research Agency says the state department has been briefed to ensure that the work does not violate international treaties State Department says the project is for peaceful purposes while the agriculture department says it's being conducted in control laps [noise]\nTo the south Carolina police officers wounded in a standoff outside a home in St Lawrence when they are out of the hospital South Carolina Public Radio's touch underwear reports that the city's police department has more\nIn peace in the journal science suggests more study is needed since other countries and they view the project as a potential biological weapon\nMilitary Research Agency says the state department has been briefed to ensure that the work does not violate international treaties State Department says the project is for peaceful purposes while the agriculture department says it's being conducted in control laps [noise]\nTo the south Carolina police officers wounded in a standoff outside the home in Florence wins they are out of the hospital South Carolina Public Radio's Todd Underwood reports that the city's police department as morning an officer who was killed in the incident\nAt a press conference Florence police chief Alan Hi or had only praise for sergeant tyrants Carol way a thirty year veteran of the force killed by a gunman in an attack which injured six other officers and a person in the gunman's residents hydro described carried away as a stand up police officer\nHe was the epitome of a community believes will you love this community you gave it as all with more than Thirty years he didn't have to do this job but this was his life and this is what you want to do\nEither sector away was a giant of a man but the proverbial gentle giant and I loved him for NPR News I'm ... Underwood in Columbia South Carolina\nOn stock markets in Asia shares are mixed up one percent in Shanghai following a down day on Wall street then as that composite index fell a hundred and forty five points I'm Shay Stevens NPR News in Washington\nSupport for NPR comes from dream wave maker of luxury massage chairs from Japan with Shiites who pointed faction and sixteen programmed massages including warning night and stretch sessions retailers nationwide more a dream wave chair dot com and the ... foundation\nSix studies in English folks\nAn index sell the hundred and forty five points I'm Stephen ... NPR News in Washington\nSupport for NPR comes from green wave maker of luxury massage chairs from Japan which she got to point detection and sixteen program to massages including warning night and stretch fashion retailers nationwide more ... chair dot com Andy any each case the foundation\nSix studies in English folk song by refund Williams is on the way plus the piano concerto number nine by Mozart\nBut John Scott plays the organ next with the city of London sim phone yet and Cambridge Singers John Ritter at the head of it'll get real forays son of genres seat\n\n[noise]\nFrom on the phone from his\nOwn\nWho\nIs going to be in a\nLong long who\nDied\n\n\n... ah\n[noise]\n\nA ...\nAh a\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMm\n\n\n\n\nSix studies in English folk song that's by refund Williams Doris literate playing the viola and Jude Mullen our heart [noise] we have time for one more it's a piano concerto number nine by Mozart it's coming up in just a moment\nOn the next one Planet Money the United states of America had cave pool of cheddar cheese we visit those cheese caves in Kansas and explore how the U.S government tried to help Americans farmers in the Nineteen seventies by raising the price of milk and how I built this will be Steve mad he took high am shoe designer\nGave them low in price it's it's an hour of economics and innovation on a lot of money and how I built this from NPR\nThis evening at seven\nTimes\nDo have that same\nCan you make sure you're hurting through psycho if you use it as a professional asset for ratings son can locate the spot your ex occupies in your brain through fmri scanning rapper singer and author ... after ... ...\nBill Bishop mean Steve mad he took high end shoe designer\nGave the low end price it's it's an hour of economics and innovation on a lot of money and how I built this from NPR's\nThis evening at seven\nTimes the size of the show you how\nCan you ensure you're hurting your ... if you use it as a professional asset for writing a song can locate the spot you're actually occupies in your brain through fmri scanning rapper singer and author deaths I had an actress\nFaced questions and she answered some of them in a non for it as soon as the next World Cafe\nThis evening at age [noise]\nGood to have your company for this hour of classical music I'm Scott Blankenship or the piano concerto number nine in June on music by Mozart's with imaging Cooper playing the piano the northern sim phone yet and the conductor is Thomas said mare [noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\nIn\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise] [noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\nMm\n\n[noise]\n\nMm\n[noise]\n[noise]\n\n\n\n\n\n[noise]\nAnd if you surf over to your classical dot org you can download free music each weekday and today it's a chorus of countrymen and hunters from the seats\nAnd if you surf over to your classical dot org you can download free music each weekday and today it's the chorus of countrymen hunters from the seasons by us to fight in\nSouth Carolina public radio weekly and daily programs schedules are at our website South Carolina public radio dot ORG\nSaturday on weekend edition contentious Supreme Court Erin's chaos in the west wing and what happens when you're when when when they get taken down by ...\nBut I also have to continue on and\nTry to be the best of what I can possibly be\nCoach Rick Pitino comes clean and news from around the world Saturday on weekend edition from NPR News\nSaturday morning at eight [noise]\nYou're listening to South Carolina public radio W S C I F him Charleston at eighty nine point three an HD won W E PR greenvale Ninety point one and WNPR Colombia and Ninety One point three [noise]\n[noise]\nYou remember the story of Martin Luther nailing his religious dissent stood at church door that had been led to the Protestant Reformation\n... W S C I F em Charleston at eighty nine point three an HD one W. E. P. R. Greenville and Ninety point one and WNPR Colombia and Ninety One point three [noise]\n[noise]\nDo you remember the story of Martin Luther nailing his religious dissent stood at church door that have been led to the Protestant Reformation movement as well as this music [noise]\nIt's Felix Mendelssohn spit symphony he wrote for the three hundredth anniversary of one of the reformation movement key documents religion meeting music in a really interesting way [noise]\nTo work is nicknamed the reformation symphony and you'll hear it later this hour I'm Garrett McQueen music Mendelssohn and more coming up on music through the night [noise]\n\nMy from NPR News in Washington ... Stevens retired U.S Supreme court Justice John Paul Stevens says he's changed his mind about Brett Kavanaugh's nomination to the high court NPR's Nina Totenberg reports that Stevens made his comments and into bed hosted by retirees in Boca Raton Florida\nStevens who retired from the Supreme Court in twenty ... Ninety noted that he had previously held Kavanaugh in high regard but he went on to say quote I've changed my views for reasons that have no relationship to his intellectual ability I feel his performance in the hearings ultimately changed my mind\nI'm ... Stevens retired U.S Supreme court Justice John Paul Stevens says he's changed his mind about Brett Kavanaugh's nomination to the high court NPR's Nina Totenberg reports that Stevens made his comments and an event hosted by retirees in Boca Raton Florida\nStevens who retired from the Supreme Court in twenty tended ... Ninety noted that he had previously held Kavanaugh in high regard but he went on to say quote I've changed my views for reasons that have no relationship to his intellectual ability I feel his performance in the hearings ultimately changed my mind\nA lifelong Republican Stevens was appointed by President Ford but his votes reviewed as more liberal overtime in comparison to the increasingly conservative Supreme Court majority Nina Totenberg NPR News\nWashington judge Brett Kavanaugh acknowledges in Wall Street journal op ed piece that his tone at a Senate hearing last week was Streisand but he says it's because he forcefully and passionately denied sexual misconduct allegations against him a five day supplemental FBI investigation turned up no evidence to back up the accusations\nA hundred senators and a handful of aids have a chance to review the report before an initial vote on the nomination friday morning\nPresident Trump was back on the road Thursday telling a political rally in Rochester, Minnesota that life in America today is good and getting better jobs\nWages are rising\nOf Americans working right now today\nHas reached an all time high in our history [noise]\nTrump also told the crowd than economic gains will be reversed in government regulations will increase if voters choose Democrats over Republicans in next month's elections the president also said that rage over Supreme Court nominee Brett Kavanaugh will boost GOP turnout New York's attorney general's office\nBetter jobs\nWages are rising\nRight now today\nHas reached an all time high in our history [noise]\nTrump also told the crowd and economic gains will be reversed in government regulations will increase if voters chose Democrats over Republicans in next month's elections the president also said that rage over Supreme Court nominee Brett Kavanaugh will boost GOP turnout\nNew York's attorney general's office as President Trump's charitable foundation repeatedly violated state and federal laws NPR's Jim Zarroli reports that the state filed papers Thursday\nAsking a judge to let a lawsuit against the foundation proceed attorney general Barbara Underwood sued the Trump Foundation in June the suit said the foundation had soliciting money from donors and then used it for campaign purposes and to settle legal claims against Trump's company among other things\nIn August the foundation asked the court to dismiss the suit saying it was motivated by politics in her response Underwood argued that the foundation was miss stating the claims against it and\nAsk that this should be allowed to continue she said the Trump Foundation was a show corporation that functioned as a checkbook from which Trump's businesses made payments Jim Zarroli NPR News New York stock markets in Asia shares are mixed up one percent in Shanghai\nFollowing it down day on Wall street you're listening to NPR News\nChicago jury has begun deliberating the fate of the white police officer who fatally shot a black teenager four years ago a video of the incident was a key part of closing arguments in the case defense attorney said officer Jason Van Dyke killed the quantum McDonald because he felt threatened when the teenager refuse to drop the knife prosecutors\nThis is made payments Jim Zarroli NPR News New York stock markets in Asia shares are mixed up one percent in Shanghai following him down day on Wall street you're listening to NPR News\nChicago jury has begun deliberating defeat to the white police officer who fatally shot a black teenager four years ago a video of the incident was a key part of closing arguments in the case defense attorney said officer Jason Van Dyke killed the quantum McDonald's because he felt threatened when the teenager refused to drop the knife\nProsecutors say the video shows McDonnell was being shot sixteen times while walking away\nA French rescue team is lost hope of finding life beneath the rubble of a hotel on Indonesia's ... ways the island sensors detected like their Thursday but rescuers got no response friday morning\nThe disaster claimed more than fourteen hundred lives in displeased tens of thousands others a week later the BBC's Marie ... oil report that power has been restored and some shops are open again\nHere in the city is how do we actually got electricity back up last night also hurt than we did I said that it could take weeks to get hit restored and intense that fit in with that we've been talking about\nHow the virus was struggling to get hold of them at all week but we are starting to see quite a lot of them on the street people fell I think the selling it on the street as well at the same time the last push defined by that is continuing\nAnd all that the recovery at forty\nThe BBC's Rico ... reporting from Honolulu Indonesia an earthquake shook parts of northern Japan's Hokkaido Ireland friday no injuries were damage were reported Japan's meeting or logical agency says was an aftershock of a quake that sort of landslides in damage to power plant in the same area last month\nThis is NPR News in Washington support for NPR comes from\nI saw I think they're selling it on the fate as well at the same time the last place to find they survive they have any length and all that the recovery has plenty\nThe BBC's Marie ... reporting from Honolulu Indonesia an earthquake shook parts of northern Japan's Hokkaido island ... no injuries were damaged ... reported Japan's meeting or logical agency says was an aftershock of equate that sort of landslides some damage to power plant in the same area last month [noise]\nThis is NPR News in Washington\nSupport for NPR comes from the Jack Kemp the Koch Foundation providing scholarships throughout the nation to exceptionally high achieving students with financial need from middle school to college more information about cook scholarships is available at J. Casey yeah for dot org and Americans for the arts\nDo you remember ... maybe you still use it but it seems like you don't see\nIt that often anymore at least I don't\nKnow I can remember my mom constantly refreshing her ... around the house seemed like an unnecessary repetitive sort of chore to me but you know mother knows best [laughter] well there's a musical form of ... too and it's anything but repetitive as you're about to hear\nAs you listened just remember that the form very specifically works against repetition so you'll hear new material throughout this has ... on themes of Mozart by composer Louis ... for his performance features the academy chamber ensemble\n\n... works against repetition so you'll hear new material throughout this is ... on themes of Mozart by composer Louis ... just performance features the academy chamber ensemble\n\n\n[noise]\n\n[noise]\nMusic you could describe as having a beautiful aroma pope hurry on things of Mozart's music of Louis spore still to come Mendelssohn spit symphony and it worked described by composer has already been that's next\nSo hungry ... can't pass the decision to make sushi support capital\nMusic you could describe it as having a beautiful aroma pope hurry on themes of Mozart's music of Louis spore still to come Mendelssohn spit symphony and uh worked describe bites composer as a re being that's next\n... honey ... campaigns of decision to make sushi support Kavanaugh will improve she's on the side of the president and you\nBegin pro Trump North Dakota democratic senator up for reelection is under pressure over the Brett Kavanaugh nomination will she stay aligned with the president and vote to confirm Supreme Court nominee that's on the next MORNING EDITION from NPR News this morning and find [noise]\n[noise]\n[noise] I'm Jeremy ... just over four weeks until the mid term elections will look at Minnesota congressional seat that's up for grabs\nSo we offer the opportunity to ah to stand with our president to stand for the issues we believe in what we're trying to present a very clear choice you can vote for an extension of the Trump Administration here or you can vote for an independent voice\nThat's next time on here and now [noise]\nThis afternoon it one [noise]\n\nIf I say the word around ab into you what comes to mind\nI immediately think of a Latin and flying carpets my alert earlier this week that a radiant horses or I think to always something new to discover well here's the moravian music by composer ... today got it's called the Arabian Caprice\n[noise]\nThis afternoon it one\nIf I say the word around ab into you what comes to mind\nI immediately think of a Latin than flying carpets my lord earlier this week that a radiant horses are I think to always something new to discover well here's some Arabian music by composer Francisco today got it's called the Arabian Caprice\n\n\n\n[noise]\n\n\n...\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAround the middle of the twentieth century classical guitar so huge revival I even have a classical guitar at home that I play on when I'm sitting on the couch watching TV well one of the ...\n[noise]\n[noise]\nAround the middle of the twentieth century classical guitar such huge revival I even have a classical guitar at home that I play on when I'm sitting on the couch watching TV [laughter]\nWell one of the professional guitarists to really feel this revival was a man named Julian Bream he's in his mid eighties and still at it you just heard him\nThat was Julian performing to re being ... by ...\nAnd ... McLean thanks so much for joining me\nMaybe you're a religious scholar or maybe you know what it's so you surely heard at the Protestant Reformation movement it's the source of many of the Christian sects and denominations that still exist today\nIt's also the source of the symphony by Felix Mendelssohn ... symphony number five nicknamed the reformation symphony\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n[noise]\nWe're going\n[noise]\n\n\n[noise] [noise]\n\n\n\n\n\n[noise]\nYou\n[noise]\n\n\nMm\n\n\n... auto leading the London symphony orchestra and the performance of Mendelssohn symphony number five she's reformation symphony ...\nIf your organization that I received notice of job opportunities at South Carolina public radio\nPlease send the name mailing address or email address of your group to job opportunities at at the public radio ten forty one George Rogers boulevard in Columbia South Carolina to nine to zero one South Carolina public radio it's an equal opportunity employer\nAre Margaret warm in the world bring a global take on the day's news we check out what's happening beyond our borders and its effect here in America joined us on the world this afternoon a three year on South Carolina public radio [noise]\n\n... ... you're listening to South Carolina public radio WSBIU FM Charleston in eighty nine point three an HD one don't even eat PR Greenville in Ninety One\nPublic radio it's an equal opportunity employer [noise]\nI'm Margo were meant the world brings you a global take on the day's news we check out what's happening beyond our borders and its effect here in America joined us on the world this afternoon a three year on South Carolina public radio [noise]\n\n... ... you're listening to South Carolina public radio tells us he I asked him Charleston in eighty nine point\nThree and Eighteen one don't even eat PR Greenville in Ninety One and WNPR Colombia and Ninety One point three [noise]\nBeethoven was really great at music of course but also networking among the folks he rubbed elbows with during his life where kings queens and even Russians ours he wrote this piece and dedication to one\nThat look he's our was Alexander the first he didn't need Beethoven's help to be any more popular but\nHaving a set of chamber works a dedicated to you doesn't hurt does it [noise]\nYou'll hear one of the works and that sets in about five minutes I'm Garrett McQueen Beethoven's violin sonata number six and more coming up a music through the night [noise]\n\nLive from NPR News in Washington ... Stevens as protesters gathered outside Senate office in Supreme Court buildings Thursday US Senators took turns reviewing it\nYou'll hear one of the works in that set in about five minutes I'm Garrett McQueen Beethoven's violin sonata number six and more coming up a music through the night [noise]\n\nLive from NPR News in Washington ... as protesters gathered outside Senate office in Supreme Court buildings Thursday US Senators took turns reviewing an FBI report on sexual misconduct claims against Supreme Court nominee Brett Kavanaugh Virginia democratic Senator Tim Kaine calls the process a sham\nThey're letting senators come in for our long walks guess what there's not a hundred hours between when they made it available at eight AM and when they want to do the ... south\nCarolina Republican Lindsey Graham suggests it's time to move on senators who requested the\nThe ... Senate votes friday on whether to end debate on the cabinet nomination and proceed to a confirmation vote by Saturday the ... has unveiled a new strategy for combating terrorism NPR's Scott Horsley reports it's the first major rewrite of the plan in seven years\nThe plan calls for beef up border security a culture of preparedness and international cooperation to fight with the White House says is an increasingly complex and diffused terrorists threat\nNational security adviser John Bolton who oversaw the planning process says one big change from the previous blueprint as the focus on what he calls a radical Islamist ideology\nGets a long banned the president's view that without recognizing that we're in an ideological struggle that we can't properly addressed the terrorist threat\nAlso addresses homegrown terrorism and the process by which people or\nGoals were beefed up border security a culture of preparedness and international cooperation to fight with the White House says is an increasingly complex and diffused terrorists threat national security adviser John Bolton who oversaw the planning process says one big change from the previous blueprint as the focus on what he calls a radical Islamist ideology\nGets a long been the president's view that without recognizing that we're in an ideological struggles that we can't properly addressed the terrorist threat\nSupplant also addresses homegrown terrorism and the process by which people already living in the U.S can become dangerously radicalized Scott Horsley NPR News the White House\nA top Russian diplomat warns that us allegations of cybercrime just by the Russian intelligence agency could escalate tensions between the two nations\nThe Justice Department is orange seven Russian military intelligence officers with hacking anti doping agency's and other organizations the indictment says Russia's military intelligence targeted supporters of a ban on Russian athletes\nDays after a settlement with the securities and Exchange Commission former Tesla chair Ilan must mocked the agency on Twitter as NPR's Emily ... reports it's how must landed in trouble with them and the first place\nAnd a tweet said yesterday afternoon Musk called the agency the short seller enrichment commission\nThe SEC accused mosque securities fraud in September after he tweeted he secured funding to take a Tesla private\nAs far as the SEC is concerned you can't say that if you don't actually have the money in a lawsuit they called the statements false and misleading and asked him to step down it's Tesla chairman must ... called the lawsuit unjustified but in a settlement agreed to resign he will still be the EEO\nSettlement also requires tests Latin mosque to pay twenty million dollars in fines each and for Tesla to play stricter oversight on mosques communications Emily Sullivan NPR News\nSecurities fraud in September after he tweeted he secured funding to take a Tesla private\nAs far as the SEC is concerned you can't say that if you don't actually have the money in a lawsuit they called the statements false and misleading and asked him to step down it's Tesla chairman must ... called the lawsuit unjustified but in a settlement agreed to resign he will still be CEO\nSettlement also requires Tesla andme asked to pay twenty million dollars in fines each and for Tesla to play stricter oversight on mosques communications Emily Sullivan NPR News\nFrom Washington You're listening to NPR News\nFormer rap mogul Marion should night has received a twenty eight year prison sentence for killing of Southern California businessman but this car David Wagner from member station KP cc was in the courtroom\nThe former CEO of death row records ran down fifty five year old Terry Carter with his truck and twenty Fifteen night originally said it was out of self defense but now he's pleaded no contest to a charge of voluntary manslaughter the victim's relatives wept in the courtroom as they described how the incident has affected them\nAfter the sentencing daughter ... Carter said she's relieved nights case is finally over\nHe's shown remorse matter of fact he made himself the victim over and over again\nNights sentences part of a plea deal to drop to other cases one involving robbery and another in which night allegedly threatened F Gary Gray the director of the twenty Fifteen film straight out of Compton for NPR News I'm David Wagner in Los Angeles\nThe Mormon church is joining Utah lawmakers the governor and others in supporting compromise legislation to legalize medical marijuana the deal follows months of debate head of November ballot initiative on whether to allow marijuana use for certain patients\nGovernor Gary Herbert says you will call the special legislative session\nSentences part of a plea deal to drop to other cases one involving robbery and another and which night allegedly threatened F Gary Gray the director of the twenty Fifteen film straight out of Compton for NPR News I'm David Wagner in Los Angeles\nThe Mormon church is joining Utah lawmaker is the governor and others and supporting compromise legislation to legalize medical marijuana the deal follows months of debate head of the November ballot initiative on whether to allow marijuana use for certain patients\nGovernor Gary Herbert says he'll call the special legislative session after the midterm elections to enact the compromise regardless of how the ballot initiative turns out\nOn stock markets in Asia shares are mostly lower uh maybe concerns about rising interest rates and after vice president Mike Pence accused China of meddling in the upcoming us midterm elections ... NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the state of Jones beach rock who's request serves as an enduring investment in the future of public radio and seeks to help NPR producer programming that means the highest standards of public service and journalism and cultural expression\nWhen it comes to chamber music that features a solo instrument the collaborative instrument and musician\nAre all too often left out of the conversation in my opinion\nYou're about to hear one of Beethoven's violin Sinatra's but you'll hear that the piano is an equally important part of it the two instruments even sound like they're in conversation with each other and lots of this you'll definitely hear that in the opening this is they send out for a violin and piano by Lou Dick van Beethoven\n[noise]\nWhen it comes to chamber music that features a solo instrument the collaborative instrument and musician or all too often left out of the conversation in my opinion you're about to hear one of Beethoven's violin synonymous but you'll hear that the piano is an equally important part of it\nThe two instruments even sound like they're in conversation with each other and lots of this you'll definitely here that here in the opening this is the sonata for violin and piano by Lou Dick van Beethoven\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise] [noise]\n[noise]\n\n[laughter]\n\n\nMm\n\n[noise]\n\nMm\n\n\n\n\n\n\n\n\n\n\n\n\nMm\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\nAnd\n[noise]\n[laughter]\n\n[laughter]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou don't Kramer and mother are rich there in the ... not a number six by losing some Beethoven\nToday's classical music is supported by west in hotels and resorts dedicated to empowering your wellbeing while on the road with signature wellness programs designed to help you stay in control while traveling west and let's rise more at West in dot com\n\n\n\n\nA [noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n... there but the Indianapolis symphony orchestra you just heard him perform the nursery sweet by sir Edward L. gar I'm Garrett luckily\nThis week on all things considered here the latest news judge Kevin uh gave ... forceful cigarettes defense what I mean\nI Do wonder if the big three it's just pretty sick too many cakes and maybe they're not each getting the attention they deserve\nEven things that are set theory I got my first paycheck\nMaestro Raymond leopard there with the Indianapolis symphony orchestra you just heard then performed the nursery sweet by sir Edward Eldar I'm Garrett Micheline\nThis week on all things considered here the latest news judge Kavanaugh gave a forceful vigorous defense\nWhat I mean I Do wonder if the bakery is just British activity cakes and maybe they're not each getting the attention they deserve\nAnd even things that parts of Syria I got my first paycheck for my screw it I'm going to get attached to\nListen to all things considered to hear the bigger picture every afternoon when NPR News\nThis afternoon at for\nThe economy is more than just dollars and cents you know stories about the people who make it work on ... joined me from marketplace this evening at six thirty or South Carolina public radio\n... you're listening to South Carolina public radio W S C I F em Charleston at eighty nine point three an HD won W E piano Greenville at Ninety point one and WNPR Colombia and Ninety One point three [noise]\n\nWhen ... mom enough\nWas around he ended up in the United states well he spent much of his time thinking about his homeland of mother Russia [noise]\nThis piece of music was born from some of those ideas it's described as a summation of his entire catalogue it uses rushing him as well as excerpts from some of his earlier works completed in Russia\n... enough\nWas around he ended up in the United states will he spent much of his time thinking about his homeland of mother Russia [noise]\nThis piece of music was born from some of those ideas it's described as a summation of his entire catalogue it uses rushing him as well as excerpts from some of his earlier works completed in Russia\nYou'll enjoy this American perspective of a Russian homeland and about six minutes rock modern ups symphonic dances and more coming up on music through the night\n\nLive from NPR News in Washington ... Stevens the U.S Senate is poised to hold its first vote today on Supreme Court nominee Brett Kavanaugh all three key Republicans still have not announced what they will do but NPR's Scott Detrow reports that one of few undecided Democrat says she'll vote no\nNorth Dakota Democrat Heidi Heitkamp is in a tight race for reelection and it's one of the incumbent senators most in danger of losing a seat\nBecause he represents such a conservative state hike camp was seen as a possible yes on cabinet I Can't voted for justice Neil Gorsuch but told North Dakota TV station WD a wide that she's not supporting this Trump nominee\nThe process has been bad um but at the end of the day you have to make a decision and I've made that decision\nAnd that decision will be what senator I Will be voting no one judge Kavanaugh that leads West Virginia Senator Joe Manchin as the lone undecided Democrat with everyone else in the party voting no Scott Detrow NPR News\nLosing a seat because he represents such a conservative state hike camp was seen as a possible yes on Kavanaugh I Can't voted for justice Neil Gorsuch but told North Dakota TV station WD a wide that she's not supporting this Trump nominee\nThe process has been bad um but at the end of the day you have to make a decision and I made that decision\nAnd that decision will be what senator I Will be voting no on judge Kavanaugh that leaves West Virginia Senator Joe Manchin as the lone undecided Democrat with everyone else in the party voting no Scott Detrow NPR News Washington and\nWall Street journal opinion piece Brett Kavanaugh acknowledges that the tone of his remarks at last week's Senate hearing was harsh but he says it's because he was forcefully and passionately denying sexual misconduct allegations Kevin ... says he remains an impartial judge\n... says the U.S is ready to help NATO allies spend all cyber attacks by Russia's intelligence services speaking in Brussels masses medicine at the G R U another Russian agencies must be held accountable\nDespite denials from the Kremlin international community clearly sees the reality in the United states in shoulder to shoulder with our Dutch and British an all NATO allies\nAnd it's called the attack on the international chemical weapons watchdog reckless irresponsible and not surprising same lab was testing the poison used to attack a former Russian double agent and his daughter in England earlier this year\nBritain blames the attack on Russia which now has any involvement China's foreign ministry is accusing vice president Mike Pence of slander he's responding to remarks Pence made to a Washington think tank NPR's Scott Horsley reports at the vice president accuses China meddling in the U.S political process\nPresident Mike Pence still doesn't Institute China wants to undermine President Trump has accused the Chinese government of using covert action\nAnd not surprising same lap was testing the poison used to attack a former Russian double agent and his daughter in England earlier this year Britain blames the attack on Russia which now has any involvement\nChina's foreign ministry is accusing vice president Mike Pence of slander he's responding to remarks Pence made to a Washington think tank NPR's Scott Horsley reports at the vice president accuses China meddling in the U.S political process\nVice president Mike Pence told ads and Institute China wants to undermine President Trump has accused the Chinese government of using covert actors and propaganda to sway us public opinion before the November midterm elections as well as the presidential contest two years from now\nAs a senior crew member of our intelligence community told me just this week what the Russians are doing pales in comparison to what China is doing across this country\nFences charge of election interference was part of a broader critique of Beijing's growing power and assertiveness and says the administration has responded with terrorists investment limits and to build up of the U.S military Scott Horsley NPR News the White House on stock\nMarkets in Asia shares are mixed higher in Shanghai you're listening to NPR News\nNew York's attorney general Barbara Underwood says her office can make a strong case that the Trump Foundation violated state and federal laws under which to the foundation in June but a new court filing alleges the organization was a shell corporation that misused charitable donations\nTrump's attorney said any rule violations were minor and that the suit is politically motivated they've asked a judge to dismiss the case\nNearly one week after an earthquake and tsunami in Indonesia the official death toll from the disastrous risen again to more than Fifteen hundred but NPR's Lauren Frayer reports from thousands more are still missing\nDeath toll is mostly in highly with city of more than a third of the ...\nViolated state and federal laws under what should the foundation in June but a new court filing alleges the organization was a show corporation that misused charitable donations Trump's attorney said any rule violations were minor and that the suit is politically motivated they've asked a judge to dismiss the case [noise]\nNearly one week after an earthquake and tsunami in Indonesia the official death toll from the disaster has risen again to more than Fifteen hundred but NPR's Lauren Frayer reports from thousands more are still missing\nThe death toll is mostly in ... city of more than a third of a million people and as a barely functioning airport where relief supplies are trickling in food clean water mosquito nets fuel and camping gear because tens of thousands of homes have been destroyed damage or cut off\nBut outside the city limits huge areas have yet to receive any ate it all\nDozens of people have been arrested for looting things like fuel and farm equipment which they might use to clear landslides are collapsed buildings in rescue loved ones most landlines an Internet or down Australia is among those sending a plane load of supplies and dozens of doctors Lauren Frayer NPR News Jakarta\nFirst lady and millennia Trump is in Kenya visiting a national park in Nairobi to learn what's being done to preserve elephants and rhinos Mrs Trump is also scheduled to go on a brief safari and visit an orphanage and see a children's performance on a national theatre Egypt is scheduled to be the final stop for Africa trip\nOn chase Stevens NPR News in Washington\nSupport for NPR comments from NPR stations other contributors include visit St Petersburg Clearwater along Florida's Gulf Coast offering artistic draws including St Pete's Dali museum but your who your collection and the museum of fine arts more er visits saint Pete Clearwater dot com\n\nTo go on a breach the far east and dissident orphanage and see a children's performance at a national theatre Egypt is scheduled to be the final stop for Africa trip on chase Stevens NPR News in Washington support\nFor NPR ... other contributors include visits St Petersburg Clearwater along Florida's Gulf Coast offering artistic draws including St Pete's Dali museum it's your who he collection and the museum of fine arts more busy St Pete Clearwater dot com\nComposers thinking about modern enough was very well traveled he was born in Russia traveled and perform throughout Europe and even found themselves here in the United states toward the end of his life\nWhile at a honeymoon estate outside of Long Island New York you decided to musically sum up his catalog with the work that showcased a few of his favorite styles anesthetics from Russia the states and beyond here's that peace is symphonic dances each ... leads the Minnesota Orchestra\n[noise]\n[noise]\nYeah you\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\nMan\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise] [noise]\n\n\n\n\nNa\n\n\n\n\n[laughter]\n[laughter]\n\n\nYou don't hear from the saxophone that often in classical music but chicken ... with sure to include a few ... and that music of is you just heard that was his symphonic dances more musical dancing in the form of a sweet next I\nHold made a movie about surviving Thanksgiving when your family can't stop talking politics\nYou don't hear from the saxophone that often in classical music but chicken Rocky Mount an awful is sure to include a few ... and the music of is you just heard that was his symphonic dances more musical dancing in the form of a sweet next\nI Baron holds made a movie about surviving Thanksgiving when your family can stop talking politics [noise] you can relate\nI was the guy who sit down at dinner with some friends first I Want to talk about can you believe that this is insane and I didn't have that thing where I was like I don't understand how people are not talking about is what is the bigger\nThe channel that energy into his new film the oh a political satirical thriller next time on it's been a minute for NPR [noise]\nSaturday morning and thanks\nReporter Jason ... like driving down the highway listening to sports talk radio when he noticed something\nThey seem to be targeting somebody hears me ... and\nThis week on only a game why sports talk radio still doesn't love him\nSaturday morning and seven ...\nI'm Garrett McQueen thanks for joining me here\nWhen it comes to Shakespeare what are you most familiar with I think it's safe to say most folks know Romeo and Juliet right but his play Midsummer Night's dream has an important places will\nIn the classical music repertoire you can find lots of pieces inspired by that play and its ferries including this next one by composer Henry per so this is this\nSaturday morning seven ...\nAnd ... McLean thanks for joining me here\nWhen it comes to Shakespeare what are you most familiar with I think it's safe to say most folks know Romeo and Juliet right but his play Midsummer Night's dream has an important places will\nIn the classical music repertoire you can find lots of pieces inspired by that play into its ferries including this next one by composer Henry per so\nThis is this music from your way back in sixty Ninety choose the score was lost four mini e on but it was rediscovered at the beginning of the ... century it's called the very queen sweet the New York chamber musicians perform here\nUh\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\nUh in\nA\n\n\nA [noise]\n[noise] [noise] [noise] [noise] [noise]\n\n[laughter] [noise] and\nDouglas and Ryan ... Peterson the bill Myron Patrick Scott find out what's new this week on pipe dreams from American public media a Michael Barone I Hope you'll be listening\nSunday Morning at five [noise]\nJoin us for classical performances from across the Carolinas I'm Caroline alive Sunday Morning said sex on Tuesday evening seven on South Carolina public radio\nHere in South Carolina Public radio WSBIU FM Charleston in eighty nine point three an HD one don't even eat green dealing with my\nAnd WNPR Columbia Ninety One point\n\nWay back into baroque era of classical music improvisation was huge this off the cuff style is one more associated with jazz these days but it still is in a way on the classical side in the form of fantasy [noise]\nMusical fantasies like this one by did you see we're meant to sound like the soloist is improvising\nThe notes are indeed written on the page but it's fun to hear what composers like WC came up with\nBill here this performed by Johnny today and about ten minutes I'm Garrett McQueen ... seats fantasy for piano when orchestra and much more on the way\n\nFrom NPR News in Washington ... Stevens [noise]\n\nLive from NPR News in Washington ... Stevens [noise]\nSome US Senators are still reviewing a report on the espionage supplemental probe into claims of past a sexual misconduct by Supreme Court nominee Brett Kavanaugh a handful remain undecided although the initial vote on the nomination is set for today\nRetired U.S Supreme court judge John Paul Stevens says he no longer believes the judge Kavanaugh should be confirmed NPR's Nina Totenberg reports that Steven sites Kevin O's performance on the Senate hearing last week\nStevens who has praised Kevin in the past said he had changed his view on confirmation not because of any question about Kavanaugh's intellectual ability but because of his performance last week accusing Democrats and liberal groups of a partisan plot on behalf of the Clintons to destroy his nomination\nThose comments Steven suggests it would force Kevin to recuse himself from many cases before the court in the future\nFor the record it's not a healthy they get a new justice you know what they do put a part time job\nNina Totenberg NPR News Washington\nPresident Trump told a rally in Rochester, Minnesota last night than anti Kavanaugh sentiment will boost Republican turnout in the November midterms Trump says another factor will be the strong economy [noise] jobs\nWages are rising and the number\nOf Americans working\nRight now today\nHas reached an all time high in our history [noise]\nI'm a gains and deregulation will be reversed if voters to Democrats over Republicans next month us nuclear energy company Westinghouse as it was not compromised by Russian hackers as NPR's Geoff Brumfiel reports adjustable\nNuclear energy company Westinghouse as it was not compromised by Russian hackers as NPR's Geoff Brumfiel reports the Justice Department names Westinghouse as one of a number of targets attacked by Russian military intelligence agents\nWestinghouse makes nuclear reactors and fuel for those reactors it's recently been supplying that fuel to Ukraine and that appears to be wide Russian hackers targeted the company\nAccording to a federal indictment released earlier today back in twenty fourteen in twenty Fifteen the hackers use spoof to emails and fake Web sites to try and steal logging details from Westinghouse employees\nSeveral employees clicked militias links but a spokesperson says the company's security was never breached the indictment also claims hackers targeted numerous other organizations including a chemical weapons watchdog and the world anti Doping Agency Geoff Brumfiel NPR News Washington\nArizona based meat processor GPS will send his recalling more than six and a half\nMillion pounds of beef that could be contaminated with salmonella at least fifty seven illnesses and sixteen states have been linked to roll beef package between July twenty six and September seventh and shipped to retailers nationwide this NPR\nDuring deliberations resume today and the murder trial of the white Chicago police officer who fatally shot a black teenager forty years ago\nA video of the incident was a key part of yesterday's closing arguments defense attorneys say officer Jason Van Dyke killed Laquan McDonald because he felt threatened when the teen refuse to drop the knife\nProsecutors say a video shows McDonald's being shot sixteen times while I'm walking away the newspaper company trunk is shedding its futuristic name as NPR's David Folkenflik reports the company is returning to the name Tribune Publishing next week over it's two years as trunk the ...\nStick name as NPR's David Folkenflik reports the company is returning to the name Tribune Publishing next week\nOver it's two years as trunk the company faced a series of crises at the Los Angeles times the editor in chief departed after newsroom insurrection the papers publisher was shifted to a corporate job after NPR reported paid settlements of to pass sexual harassment lawsuits against him and the new staff overwhelmingly voted to unionize\nTrunk sold the LA Times and response newsrooms at the Chicago Tribune into Virginia papers also join unions NPR's reporting led to the ouster of the top news executive of the New York daily news for sexual harassment too and the company laid off half of that tabloids newsroom\nIn addition trunks controlling owner Michael ... was also accused of sexual harassment executives did not say what led to trunks rebranding reports suggest possible buyers are circling David Folkenflik NPR News\nTravelers and New Zealand can be fined the equivalent of thirty two hundred US dollars from using to unlock an electronic devices for examination by customs officials the law which took effect October first also gives authorities the right to copy data found on ... devices they search this is NPR News\nSupport for NPR comes from NPR stations other contributors include home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major re models homeowners can read reviews of local pros and book appointments online at home and ...\n\n... or ... once said inspiration is an awakening a quick inning of all man's faculties and it has manifested in all high artistic achievements\nI think that quote goes really well with this work of his you're about to hear the way this piece of grows from beginning to end is very reminiscent of some sort of artistic awakening this\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\nMm\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\nMm\n\n\n\n\n", "show_name": "BBC World Service", "year": "2018", "city": "Columbia", "day": "05"}