{"month": "10", "state": "GA", "station": "WUWG", "content": "To overnight says the last state of registered to vote in the November election you can register online at the Georgia secretary of state's website in person at your local department of drivers services or you can mail in your application\nFor secretary of state's website is also where you can go to check your voting precinct see are elected officials and a sample ballot for federal state and local offices if you want to request an absentee\nWhere you can go to check your voting precinct see are elected officials and a sample ballot for federal state and local offices if you want to request an absentee ballot you couldn't do that on line as well the election takes place in November sixth for GDP News I'm Stephen Fowler in Atlanta\nAnd overturn livestock truck spilled a herd of cows on to to eighty five in Atlanta earlier this morning backing of traffic and causing at least two wrecks that killed two thousand injured at least one driver\nIt's the third time this year a cattle carrier has lost its load and the Atlanta area and made ten cows were killed in an accident on Seventy five\nAnd in June forty cows spilled onto I to eighty five\nSports the Atlanta Falcons lost the third game of the season yesterday I went to the Cincinnati Bengals thirty six thirty seven thirty six after a touchdown by former UGA receiver AJ green with less than ten seconds to go in the game ... quarterback my Matt Ryan spoke after the loss\nWe've got ... got a long road in front of us and we got to get football team and um he learned from these experiences and hopefully the next time we're in there and be better for it\nFor more gp be news visit GB news dot org and follow us on Facebook and Twitter\nSupport for ... comes from our monthly sixteen years and the Atlanta symphony orchestra presenting rebels love letter to Greek mythology the luxury in ballet death in the set Chloe October eleventh and thirteenth tickets in details that asked so dot O. R. G. classical series presented by Delta Airlines\nAnd Georgia State university TPP Atlanta is license to Georgia State university a major contributors to the economic and cultural vitality in downtown Atlanta and the metro Atlanta area more information is available at G. S. U. dot edu\nLine from NPR News in Washington encore of a cold and the FBI and spending a week reviewing sexual assault allegations against Supreme Court nominee Brett Kavanaugh Delaware democratic Senator Chris Coons told NPR's MORNING EDITION the FBI investigation needs to be broader and should include more witnesses and documents\nI'm working hard to encourage my colleagues in the Senate principally Jeff Flake from Arizona but others um to speak up and to say the whole point of this week\nIs not to have an ... an open ended or an endless investigation buddy credible I'm short but purposeful investigation of the sexual assault allegations against a judge Kavanaugh that are in front of the Senate now\nSenator Flake Republican had initially announced he would support Kavanaugh's nomination but friday called for the FBI and\nKavanaugh that are in front of the Senate now\nSenator Flake Republican had initially announced he would support Kavanaugh's nomination but friday called for the FBI investigation\nPresident Trump says he'll speaking about an hour at the White House about the new trade agreement reached last night with Canada it will include Mexico and will replace the north American free trade agreement the U.S and already reached agreement with Mexico on a trade deal the negotiations with Canada and dragged on for weeks\nTo scientists will share this year's Nobel Prize in physiology or medicine for discoveries that have led to a revolution in cancer treatment NPR's Richard Harris has the story\nThe price will be split by James Allison who's currently at the empty Anderson Cancer center in Houston and ... at ... University in Japan the to work independently they were both exploring how the immune system works to ward off diseases including cancer\nThe immune system needs to rev up and it also needs to apply the brakes at times\nAlison and Joe discovered they could interfere with this process and release the breaks that makes the immune system more effective at attacking some cancers and their discoveries lead to a whole new class of drugs called checkpoint inhibitors which are widely used today Richard Harris NPR News\nThe jury and a Chicago police officers murder trial could hear today from a psychologist he'll try to explain the officers frame of mind when he shot a teenager from member station WBFO easy chipped Mitchell has more\nPolice dash cam video shows Jason Van Dyke opening fire as ... McDonald walked away from officers\nPolice reports save and I thought a Seventeen year old who's trying to kill them with a knife in his hand now the officers attorneys are planning to put Florida based police psychologist Laurence Miller on the witness stand Miller writes about changes in vision hearing and time perception when cops shoot\nIn twenty sixteen he gave Van Dyke a psych exam\nThe prosecutor wanted Miller barred from the trial he argued only Van Dyke knows what was going through his mind when he fired for NPR News I'm Luke Mitchell in Chicago\nOn Wall street the Dow Jones industrial average is up two hundred thirty two points at twenty six thousand six hundred Ninety to announce that 'cause it more than fifty to a point that eight thousand Ninety nine the U.S and the five hundred is up twenty this is NPR\nSupport for NPR comes from ... other contributors include Jones Day and integrated partnerships collaboratively providing legal services for more than a century forty three officers five continents serving clients\nInclude Jones Day and integrated partnerships collaboratively providing legal services for more than a century forty three officers five continents are serving clients as one term worldwide learn more at Jones Day dot com\nGood morning and thanks for joining us here on G. P. B. where it's generous listeners like you that make one day and all of the programs you listen to possible I'm Tom Barclay thanks so much for listening and most importantly thank you for doing your part to keep on coming to you on G. P. B.\nWe're now in the final days of our phone driving as we head toward the end of the drive it takes all of us together including you\nTo make sure the public radio in Georgia remains strong so whether you're listening in Savannah make in Atlanta please me the next listener who joins or public radio community you can do that by going to G. P. B. dot org and clicking the green donate button at the top of the page or by calling eight hundred to two to four seven eight eight here with me is Cindy hill\nAnd we're so glad you're with us today for when ... when he support CPB now at ... dot org or eight hundred to two to four seven eight eight everyone to automatically be entered into are drawn to win a vacation to Callaway resort and gardeners\nAs get away include the tonight stay admission to the gardens and tickets to fantasy in lights for up to six people fantasy in lights as spectacular southern holiday tradition and it's one of National Geographic's top ten holiday light displays in the world\nYou can start a new tradition with your family or friends if you are lucky winner of this get away to Kelly resort and gardens but he's got a G. P. B. dot org or give us a call at eight hundred to two to four seven eight right now with your contribution and thanks for your support and good luck on the drawing\nAfter the winter you're going to love you and your family going to love staying at the Callaway resort\nThat were a member of the cost of bringing you worldwide coverage from NPR and the state wide coverage from GB is rising every year and that's why we encourage more listeners to support gp be\nAnd why your participation in this fund drive matters even more than the amount that you choose to contribute please join us with your first time contribution or increase your support today we make it as easy as it can possibly be you go to ... dot org click the green donate but at the top of the page\nYou fill out your contact information decide how much you want to give and whether you want to thank you get boom that's all there is to it or if you'd rather you can call us at eight hundred to two to four seven eight eight and thanks [noise]\n\nSeven eight eight and thanks [noise]\n\nThis is one day I'm Joshua Johnson in Washington if you feel a bit breathless today you're not alone after the testimony of Brett Kavanaugh and Christine Blasey Ford the nation has found it hard to catch its breath [laughter]\nMillions of Americans held their breath during the dramatic testimony on Thursday millions more shouted themselves horse at what lawmakers on both sides of the aisle said and did in Kavanaugh's confirmation battle\nThere were also private conversations about personal pain a vote by professor Ford's testimony conversations that used to only be whispered but now in this me to moment to finally be said out loud\nThose stories of sexual assault matter and we will spend a lot of tomorrow's program focused on them today let's focus on what happens now with Kavanaugh's nomination what's going on with the FBI investigation afford accusations and how this reflects on our national politics we'd love to answer your questions\nAnd get your take we're taking your calls in voice mails at eight five five to three six one a one a let's say five five to three six one to one to email us one a at W. A. M. U. dot org comments on our Facebook page or tweet us at one a\nJoining us in Studio is Jeffrey Rosen president and CEO of the national constitution center in Philadelphia\nHe's also a professor at the George Washington university's law school Jeffrey welcome back to a great to be you're speaking to us from Harvard is Brian Fitzpatrick a professor at Vanderbilt law school and a former clerk to the late Justice Antonin Scalia from two thousand one to two thousand two professor fitzpatrick welcome thank you for having me\nProfessor Rosen let me start with you and the confirmation hearing it seems like one of the big\nComplaints about the hearing was just the way that it was done that it was public at all as opposed to behind closed doors the timing of when the allegations from professor for war investigated I'd love to get both your sense professor fitzpatrick sense of just the structure of the hearing itself\nAnd how that might affect the big decision that needs to be made about whether or not to put judge Kavanaugh Supreme Court [noise]\nYes as you suggest I think it's fair to say that both sides think sets the process was unfair uh Republicans complain the allegations were brought out at the last minute Democrats say they're not being investigated properly and it's remarkable how little we've learned since\n... G. P. B. right now as a powerful gesture it means you're willing to stand up and be counted count it as the next donor and are growing public radio community during this fund drive or looking to hear from everyone who listens individuals like you who care about their community who value unbiased reporting and who are committed to supporting independent meaningful news coverage\nGive us a call right now at eight hundred to two to four seven eight eight or donate online at G. P. B. dot org that eight hundred to two to four seven eight eight or G. P. B. dot org and thanks for your support\nSupport for deep ... comes from generous listeners like you and metro Durham PC providing skin cancer detection and treatment and offering skin care services three offices in the metro area Metrodome encourages annual skin care checkups metro Durham dot org\nAnd the world affairs council of Atlanta providing a forum for informed discussion of global affairs that impact metro Atlanta and inspiring Atlanta to lean globally for more information visit their website is W. A. C. Atlanta dot org\nSupport for NPR comes from the station and from bona with the bone a certified craftsmen program a network of hardwood flooring contractors committed to expertise and customer service contract to locate her and more information or a bona dot com\nAnd from the Newseum committed to changing lives through math by building math achievement problem solving and critical thinking skills for thousands of students every day in nine hundred franchise locations math Newseum dot com slash NPR\nThis is one a I'm Joshua Johnson we're talking about the Kavanaugh confirmation and its impact on the nation we're speaking with Jeffrey Rosen president and CEO of the national constitution center and a professor at George Washington you can university's law school as well as Brian Fitzpatrick professor at Vanderbilt law school we'd love to speak to you to comment on our Facebook page\nTweet us at one a email one a at W. A. M. U. dot org and we're taking your calls and voice mails at eight five five to three six\nFacebook page tweet us ... when a email one a at W. A. M. U. dot org and we're taking your calls in voice mails at eight five five to three six one a one a speaking of calls let's get to one now from Florida David is on the line Hey David what's on your mind\nBy Joshua how are you good what did you think could be a hearing last week\nBut the impact of the nation are you just said the impact on the nation that's the ACA exactly what I Would comment on I feel that uh I'm actually glad that the um\nThe hearings were made public because it allows us as a nation to weigh in on what exactly is going on in Washington worth of our politicians and how they're making decisions\nFor us or with regard to these things so uh I think it was very important that we all ... a chime in on what's going on your ... or or political aspirations uh I myself\nHave a they also at the alcoholism in my past a fire found recovery in Nineteen eighty five I I understand the struggles of alcoholism but I also understood stand up uh in my youth when I struggled with alcohol as I grew into adulthood\nI uh was able to me\nThat was able to hide or my drinking and to justify my drinking and it's a characteristic of alcoholics they\nAre very adamant about defending their drinking and also at the same time said knitting that uh they do not have a problem so um\nI think it's very interesting for us to see um individuals or come to terms with our past and how it affects their future and how that affects the future of all of us\nDo you think how do you think this will affect the confirmation battle though I mean I hear you about these other conversations I Need to be had in terms of whether or not Brett Kavanaugh makes it to the Supreme Court or not what impact do you think the last few days might have\nOne particular clip I saw on CNN when I'm One\nOf the senators was questioning him about er an FBI investigation and he refused to answer he falls silent he he he explained that he was hoping to what the committee or would a welcome however hit he personally would not call\nOh after he ... he explained that he was hoping to what the committee would a welcome however I hit she personally would not comment on whether or not she would accept an FBI investigation and it was very interesting to watch is why our response to him because when he was\nAnswering that question was staring at in very sternly and I always also wonder what exactly what she's thinking when he refused to answer this question regarding you know FBI investigation your your that\nYour friend that Senator Durbin of Illinois puts it right out of\nIt and there's nothing to hide we should be open to any possibilities\nYeah David appreciate your calling in thanks very much and that was the question that Dick Durbin of Illinois put to Brett Kavanaugh and he paused for a long time and then Chuck Grassley who's the chairman of the committee a Republican chairman of the committee jump back in and then after that Rachel Mitchell the question or for the G O P basically lost her job and then the GOP senator started jumping back in [noise]\nLet me get to some more of your comments David thanks very much for talking to us Catherine emailed\nAs a woman listening to Kavanaugh defend himself last Thursday I didn't find his presentation appropriate\nIt smacks of bullying and intimidation aside from that conspiracy theories like revenge from the Clintons aired and Senate testimony is a major disqualify or in my eyes but when we bring in our next guest professor ... Patrick ... if I could ask you to respond\nTo Catherine particularly whether or not someone who began by making a partisan broadside can be trusted to sit on the Supreme Court at administer equal justice under law\n[noise] well um you know I think we have to be realistic about all of this our Supreme Court justices come from the political world they work for president of one party and I'm often times or they have other experience in politics they are\nTo some extent partisan or in their outlook but they try to put that to the side as best they can when they get on the court\nAnd focus on the statutes the constitution the administrative regulations and I think they do a pretty good job obviously people's world view influences their decisions to some extent but\nI think we'll find that if judge Kavanaugh's confirmed he is a successful justice well liked by his colleagues just like Clarence Thomas frankly is today if you ask\nHe is a successful just as well liked by his colleagues just like Clarence Thomas\nFrankly is today if you ask\nThe justices if they like Clarence Thomas they they they will tell you I don't just like I Love him so and so when you're sort of my or came to Vanderbilt last year and talk to her students and she said that I Love Clarence Thomas and so I think we'll get beyond this um but they're certainly going to be some awkward moments for a year or two\nWithout another voice to our conversation joining us now in Studio is Elizabeth why drove the presidents of the constitutional accountability center of public interest law firm as think tank based here in D.C Elizabeth walk free trade with you let me start with a question that I Begin with for\nProfessors Rosen and fitzpatrick just your general sense of the hearing both the structure of it and the testimony as we heard from professor Ford and judge Kavanaugh but how that might affect the ultimate big decision about whether Brett Kavanaugh should become an associate justice of the United states but I\nThink you know harkening back to what the caller uh just uh your your um listener just mentioned about the\nPresentation that judge Kavanaugh made and talking about revenge of the Clintons you know there's definitely been a divide between those who are centering Dr Ford and the other survivors of sexual assault and as we saw judge Kavanaugh's opening centering the political\nTalking about the Democrats talking about uh whether or not they should have leaked her letter and disregarded her request for anonymity you know I think that uh whether or not you think Senator Feinstein should have\nTried to raise this another way earlier she was trying to respect that clear request for anonymity from this\nTraumatized survivor and maybe it's telling that Republicans would have just leaked it anyway and disregarded her request but Senator Feinstein was trying to give her the respect that she and her experience deserved and I think that trying to\nMake this part of a political gain game like she came up with this decades long come on to try to stop judge Kavanaugh from getting to the Supreme Court is frankly offensive it's offensive to her and her experience and\nTo the many many many many others who have experienced sexual assault and\nHave not come forward because of fear because of shame because they worried frankly that what\nAny others who have experienced sexual assault and have not come forward because of fear because of shame because they worried frankly that what we might see in this case would be true for them that they would finally find their voice and the courage to come forward and it would not matter\nI Wonder Elizabeth if there was any way around the politicking of this if it was just bound to happen no matter what I mean we got a lot of comments very critical of the Democrats alluding to what you just kind of reference there have emailed the Democrats are showing their ugly side and the people see right through their deception they should be ashamed\nBut that would require morals which they lack\nIn Joe emailed I'm a moderate conservative as are most of my friends we've discussed the Kavanaugh hearings and Democratic senators behavior extensively if the Democrats think their behavior will go unanswered I'm afraid they're mistaken this entire process needs to be overhauled\nAnd the amount that you give doesn't really matter what matters is that you give to G. P. B. I. G. P. dot org or eight hundred to two to four seven eight and remember when you do you're going to automatically be entered into our drawing to win that vacation to Kelly resort and gardens and fantasy in lights were up to six people\nIt's easy to overlook just how much GB as part of your life to take just a moment to think back over your day how long have you been listening help make sure gp becomes part of your day\nForever and part of our entire states day by supporting it financially you can contribute online at ... dot org or give us a call at eight hundred to two to four seven eight and thanks for your support\nSupport for TB comes from you our listeners and we'll start health system a proud member of the Mayo Clinic care network will start doctors can consult with male and complex cases keeping patient care at home\nWell star dot org slash male will star and Mayo Clinic working together working for you and Georgia State parks as days get shorter and temperatures start dropping there's no better time to huddle around a campfire at Georgia State\nParks information and rates available at visit gee a state parks dot org\nFor NPR comes from this station and from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial well being first learned more at ...\nFrank personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial well being first learn more at Raymond James dot\nCom [noise] and from Boehner\nWith a bona certified craftsmen program a network of hardwood flooring contractors committed to expertise and customer service contract to locate her and more information\nOr at bona dot com [noise]\nWe'll continue this conversation tomorrow focusing on some of the more personal revelations that this confirmation process has triggered\nWe know that a lot of you have stories like professor Ford's to share some of which you shared with us we are so humbled that you would tell us and kind of sad that we cannot air more of them just because we received so many\nAnd that's kind of what we need your help with figuring out what to do when someone tells you their me two story how have you dealt with these revelations among people in your life\nOnce the story is shared\nLeave us a voice bail eight five five to three six one a one a\nIf someone told you their story of being assaulted or harassed or if you shared your own story with others what happened then to help the healing process or are you still struggling for the ride response\nTell us your story you can email us one a at W. A. M. U. dot org or use our app wanting vox pop to send a radio quality audio file and to keep up to date on future topics and we'll share some of your stories tomorrow on one egg [noise]\nBack now to our conversation with Elizabeth wider Jeffrey Rosen and Brian Fitzpatrick before we had back to the phones professor fitzpatrick let me give you a chance to respond to Elizabeth and then we'll keep going [noise]\nWell I I Do think that the academic research on implicit bias suggests that we tend to see events through a political prior commitments now there are some Americans that aren't strongly\nPartisan there the independence and and so they're not going to see things through the same kind of bias and so I'd be curious to see what the independence think about but Brett Kavanaugh that may be our crews test of of who's more credible and these allegations let's\nKeep doing on the phones now Jake in North Carolina is standing by hey Jake what's on your mind [noise]\nHey Joshua or I was just wanting to bring up something that I've been seeing talked about a lot on line but I haven't heard in your show so far this hour or really aren't a lot of coverage\nI was just wanting to bring up something that I've been seeing talked about a lot on line but haven't heard in your show so far this hour or really on a lot of coverage on NPR\nUh and that's the the idea that a Brett Kavanaugh it should be barred from this job primarily because of his ah\nLive that he has told while giving testimony\n[noise] um or any major killer and Jake that stood out to you\nSorry what was there any statements in particular Jake that stood out to you\nAt the the foremost is towards the end of his testimony he was asked if he was watching Dr for its testimony a and he\nVery clearly said no and I have seen multiple accounts or putting him in a room watching it from a monitor or and that that seemed like a a demonstrable all that but just we can't let slide\nTo drink I appreciate your calling in with that and actually a Jeffrey Rosen a Senator Richard Blumenthal of Connecticut asked\nJudge Kavanaugh about this legal principle a jury instruction Latin is false in who know focus in on the bus which basically says if you lie about one thing we can disregard what you said about every ...\nHow much should that way in to Brett Kavanaugh's confirmation remembering that this is as we've said not a court of law\nYou're absolutely right about the senator Blumenthal and it was very impressively pronounced as no surprise over the weekend I have a nice\nUm and pick folks are tweeting an opinion that judge Kavanaugh road involving Guantanamo Bay detainees where he embraced the same principle and said if you lie about one thing you lie about others\nNow are ... Democrats are promising that if Kavanaugh is confirmed and they take the house they will hold impeachment hearings on the alleged misstatements in the confirmation hearings and they range not only from\nHis testimony involving Dr Ford and his college classmates insistence that he was a heavy drinker even though he says he wasn't and so forth but also about alleged misstatements and the first part of the hearings where he said he didn't know about a female's involving lower court confirmations shutdowns ... programs and the evidence tested he did\nSo regardless of whether the Senate chooses to decide that a small misstatement as evidence of a larger one the Democrats are determined to press these and they're not going to go way\n[noise] who's your mom but tweeted sometimes the partisan lens is overrated I Am a moderate Republican women\nTo press these and they're not going to go way\nWho's your mom but tweeted sometimes the partisan lens is overrated I Am a moderate Republican women and so many women that I have no experience to solve like Dr for describes a friend from my church a high school friend a cousin a neighbor we believe her because we have been her [noise]\nPamela tweeted this is an impossible situation I feel deeply sorry for Ford is she was obviously sexually assaulted by someone and they spent her life trying to get over it I also feel deeply for Kavanaugh as I have a father and brothers there was no way to prove his guilt or innocence\nI should also note that we've been getting a number of voice mail messages about this from across the country\nAnd even from around the world already in Hamburg, Germany left it snowed in our inbox\nKavanaugh hearings have caught the attention of the German press beat the suit and tie to him what each side the opinion though is uniform\nIt's an absolute shock at the lack of respect being shown by the Republican Senate toward the Supreme Court on its own history as the world's greatest deliberative body [noise] the shock is not\nAt the partisan tones of deer in\nThe right left battles or less gripe battles happening here too [noise]\nBut what's shocking is the tenor with which the Republicans have been speaking to the Democratic colleagues on the tenor with which the nominee himself he used to address the Democratic senators Thursday\nAlready thanks very much for commenting to us in just by way of context to ... ... is a major paper in Germany if you remember our conversations about the Panama Papers the big international investigative report about money hidden in offshore bank accounts to do which is I took was one of the major papers that helped drive that for\nA a wonder professor for Patrick what's your take is on what all of this means for just America's image around the world how the world is reflecting on us because of the way we're handling\nThis well after last presidential election I'm not sure image can get any worse um but uh you know I think that it is a shame that the judicial nomination process has become so broken parties and\nUm and you know the Republicans are just as much to blame if the Democrats what they did to Merrick Garland after Justice Scalia passed away was unconscionable in my view and I frankly don't blame the Democrats retaliated\nIt did to Merrick Garland after Justice Scalia passed away was unconscionable in my view and I frankly don't blame the Democrats retaliating um with this nominee uh and so uh I really think that in in order to make the system\nWorked better we're going to have to come up with some major overhaul and and I think the one solution\nTo kind of restore the dignity tore judicial confirmation process is it's a big change but I think it's necessary change I think we have to ask do we think Supreme Court justices should have life tenure\nIf they didn't have served forty years it wouldn't be Armageddon every time someone retires and there's a replacement presidents had a knowledge that every two years they would get a Supreme Court nomination we would normalized this process and it would become more I'm\nSane [laughter] I'm In law professors have been proposing this Eighteen year term for Supreme Court justices yeah time\nI've I've I've heard it was with I was just gonna ask you about that I've heard that suggested that if it was Eighteen years you know there are nine seats and you know every two years basically would come open kind of like clockwork\nThat this might not be quite so much like oh we're making this decision that will look like and our children and our children's children it would still be a big deal but you know Eighteen is less than thirty or forty the question is whether or not that's politically viable", "year": "2018", "show_name": "1A Plus", "city": "Carrollton", "day": "01"}