{"month": "10", "state": "GA", "station": "WUWG", "content": "\nThat had done\nIt for a minute before ten o'clock Andre Dawson thanks for joining us or to be on duty port five she'd be Atlanta and she'd be news dot org she'd be Atlanta is license to Georgia State university largest University in Georgia and one of the largest in the nation\nSupport for G. P. B. programs comes from our listeners and the world affairs council of Atlanta providing a forum for informed discussion of global affairs that impact metro Atlanta and inspiring Atlanta to lean globally for more information\nAnd the world affairs counsel Atlanta providing a forum for informed discussion of global affairs\nThe impact metro Atlanta and inspiring Atlanta to lean globally for more information visit their website is W. A. C. Atlanta dot org TBB has been honored by the Georgia Associated Press media editor is winning the top award for radio the pacemaker award we were also honored for specialized reporting best anchor and best newscast\n... stand with the facts\nFrom the University of west Georgia Ninety point seven F. L. W. W. W. W. H. B. Gerald Ford of Georgia Public broadcasting radio network\n\nBrett Kavanaugh out of those words feel\nHowever you feel you're probably feel strongly\nAnd you will for some time\nFrom W. A. M. U. and NPR in Washington DC is one ... [noise]\nHey they're an Joshua Johnson today on on a Kavanaugh confirmed the bitter protracted fight used over to make the judge or justice\nSenator Mitch McConnell led the charge for Republicans to secure a conservative Supreme Court majority Democrats cold out Kevin O's demeanor his jurisprudence is alleged involvement in a sexual assault but they did not have the votes to stop him\nToday we get your thoughts on this political battle what it says about our nation and how it might affect your vote next month call it five five\nThree six one a one a comment on our Facebook page or tweet us at ... ... [noise]\nLive from NPR News in Washington I'm nor rom the national Hurricane Center expects tropical storm Michael to become a hurricane by tonight as it approaches the Gulf of Mexico it's on track to hit the Florida Panhandle later this week\nGovernor Rick Scott issued a state of emergency for more than twenty counties and he's urging residents to get ready\nGet you two to four inches of rain in some areas might see five inches of rain [noise]\nTropical storm Michael was bring dangerous storm surge to many years even those out by the pack\nScott has put more than five thousand National Guard soldiers on alert as advise people to be prepared to leave their homes the Nobel Committee today awarded it's twenty Eighteen prize for economic sciences to to economist NPR's Nick fountain reports their work focuses on innovation and climate change normally today economist or what\nEconomic sciences to to economist and the eyes Nick fountain reports their work focuses on innovation and climate change\nNormally today economists are waiting by their phones early in the morning hoping they'll win the prize but NYU's Paul Romer\nI got two phone calls this morning and I didn't answer either one of them because I thought it was some spam call so I I wasn't I wasn't expecting it deprives\nRumors work is about economic growth and how to keep economy is growing his insight governments need to create the right incentives for innovation strong pat and systems for example\nHe shares the prize with William Nord house of you whose work is on how economies interact with the environment and climate and similarly he says governments have to get the incentives right for example with a carbon tax\nAnd people have been listening his work has been used by the EPA and the UN's inter governmental panel on climate change\nMix down to an NPR News New York\nAnd international panel of climate change scientist says preventing an extra single degree of heat and the next few decades had made the difference between life and death\nMost nations have set a goal of reducing global warming to nine tenths of a degree Fahrenheit the panel says if world leaders could make that one point eight degrees half as many people would suffer from lack of water\nThe president of Interpol me young hung way is being detained in China being investigated on charges of bribery NPR's Rob Schmitz reports\nChina's public security ministry gel picture of the investigation and among on Monday he knows been comes more than a week after among was reported missing by his wife in the on France where Interpol is headquartered\nFor its part Interpol hastily announced among has resigned as president of the international police agency and we own grace among said she'd received threats and at the final tax from her husband said wait for my call followed by a ... knife\nObservers in China say the fact that Beijing is willing to jeopardize its diplomatic relations bite attaining a high profile officials suggest the stakes are high\nMine was appointed vice minister of China's national police by Julian ... trying to former security czar who was in prison after she didn't paying became leader of China Rob Schmitz NPR News Shanghai\nAt last check on Wall street the Dow is down Thirteen points the bond markets are closed today and this is NPR News\nFrom the TPP news remind them unwind hearts sitting in for three dollars [laughter] the two candidates for state school superintendent had differing views on whether teachers should be allowed to carry guns in the classroom TPP Steven Tyler reports on the plane to press club debate\nSuperintendent had differing views on whether teachers should be allowed to carry guns in the classroom TPP Steven Tyler reports on the Atlanta press club debate\nDemocrat older Thornton said teachers should not be armed in schools need to tackle things like mental help to prevent gun violence\nImagine the years that we've wasted and not provided no services and causing ... and not addressing the mental associate emotional needs ... students incumbent\nRepublican Richard woods agreed more needs to be done but the so called wraparound services but it's up to local school districts that aside incumbent Republican Richard what's agreed more needs to be done but so called wraparound services but said it's up to local districts to decide\nThis was not a mandate would've not mandate any teacher from being arm so that has to be a choice on both ends\nThe debate is on line at gp be news dot org for G. P. V. News I'm Stephen Fowler in Atlanta\nTiny island officials say they aren't sure what killed the large number of bees in may the state department of agriculture tells the savannah morning news that the report was inconclusive\nMay die off was the second in just Thirteen months after Chatham county mosquito control failed to warn beekeepers of the plan to thousands Seventeen spray\nAnd support the Atlanta Braves kept their seasonal live last night with a six to five win over the LA Dodgers\nThe Braves were led by twenty year old Ronald ... junior who became the youngest player in baseball history to hit a grand slam in the playoffs Atlanta must win back to back games to advance in the playoffs all the Dodgers only need one more victory to end the series the teams will play a game for today starting at four thirty\nSupport for NPR comes from Viking dedicated to bringing the travel are closer to the destination Vikings new custom built ocean fleet offers a small ship experience with all veranda state rooms and short excursions in their report Viking Cruises dot com and the any each case the foundation\nOn this day there's a chance of showers and thunderstorms this afternoon otherwise mostly cloudy skies behind your eighty five the chance of rain is thirty percent\nChance of showers and under storms tonight mostly cloudy with a little\nThen tomorrow at twenty percent chance of showers mostly cloudy\nKeep your eye on hurricane Michael\nWednesday and Thursday\n\nThis is one day I'm Joshua\n\n\nThis is one day I'm Joshua Johnson in Washington [noise]\nSergeant at arm's will restore order and the gallery [noise]\nIt was unusually noisy in the Senate chamber on Saturday as vice president Mike Pence shared the official confirmation of America's newest Supreme Court justice it's been a noisy few weeks as senators debated whether Brett Kavanaugh was right for the job\nKevin was confirmed by a vote of fifty to forty eight the closest vote in more than a hundred and Thirty years\nHe was sworn in hours after the vote for the ceremonial swearing in takes place this evening at the White House the Kavanaugh hearings have energized Americans on all sides and the midterms are less than a month's away what is this confirmation mean to the court and the country and more importantly for us\nWhere's your head at today now that this battle is over\n[noise] joining us in Studio to discuss it is Ellie on Johnson White House reporter for Politico Elliana welcome back to a great to be here also glad to welcome back motive sharing syndicated columnist and senior fellow at the ethics and public policy center motor welcome thanks Josh\nAnd you know step in senior contributor at the federalist ... thanks for making time for us they found any we also like to make time for your questions and thoughts\nAbout what the confirmation of judge now associate justice Brett Kavanaugh means for this country and what it means to you we're checking voice mail so pleased would give us a call eight five five to three six one a one a comments on our Facebook page tweet us at one eighty or email one a at\nW. A. M. U. dot org today is one of those kind of got checked days where we just want to check and see where people's heads rat answer questions dispel misconceptions [noise]\nBut maybe the first place to start is like where are we now it feels like this has been America's one big story for weeks now a Elliana Johnson what's your sense of just kind of where we are right now\nWell I think that ... not ... nomination and now confirmation will have some at lasting effects and I think as we get further away from it it sort of easier to see with clarity\nSupport for ... comes from generous listeners like you and the College of engineering and computing at Georgia southern university hands on preparation for high demand careers and engineering construction management manufacturing computer science and I teach more uh Georgia southern dot edu slash the E. I. T.\nT. P. bees been recognized by the Georgia Associated Press media editor for best spot NEWS Best feature reporting best documentary or new special programming and best general reporting\nCPB news stand with the facts [noise]\nRecently supported gp during our fall fund drive thank you were already putting your dollars to work to bring you the programs that matter to you on CPB if you didn't get a chance to donate during the drive and your online contribution now will still make a difference [noise]\nPlease take a couple of minutes to go to G. P. B. dot org and click the green donate but not the top of the page thanks so much for your general supportive G. P. B. and the service we provide every day [noise]\nSupport for NPR comes from the station and from bona with a bona certified craftsmen program a network of hardwood flooring contractors committed to expertise some customer service contract to locate her aunt more information or at bono dot com\n[noise] and from it less than a collaboration software company empowering teams around the world committed to providing the tools and practices to help teams plan track build and work better together more at at Lausanne dot com\nBust has won a I'm Joshua Johnson we're discussing Brett Kavanaugh's appointment to the Supreme Court and what it means for the country and for you\nWas on a chair and syndicated columnist and senior fellow at the ethics and public policy center\nYou know step and senior contributor at the federalist and Eliana Johnson White House reporter for Politico we'd love to hear from you too comments on our Facebook page tweet us at one a email one a at W. A. M. U. dot org and we're always checking our phone and voice mail at eight five five to ...\nIt's on our Facebook page tweet us at one a email one a at W. A. M. U. dot org and we're always checking our phone and voice mail at eight five five to three six one a one a this has not been a quiet few weeks including here in D.C\nBill you am used Patrick Madden was there on Saturday as hundreds of people protested on the Capitol Steps about a hundred sixty four people got arrested [noise]\nKind of reflects when we heard from Paul in North Florida who tweeted we better vote like our lives depended on it in November and not let anything go to the Supreme Court if we can possibly help it\nShare and emailed I was behind judge Kavanaugh from the beginning of his confirmation for his stellar record and I am overjoyed but he's now an associate justice I Am one of the many many pro life women that the mainstream media seems to always minimize both our numbers and our positions as women\nJohn brought on our Facebook page you can't soft sell this anymore was unwavering support for Duncan Hunter junior Kavanaugh and Trump Republicans are OK with philandering and sexual assault\nThe only reason was Ford was not believed was because she was testifying against the Republican nominee the right didn't even listen to her and the FBI quote unquote investigation was a total sham and John ... investigation in quotation marks on a chair and I did want to ask you about that in terms of\nWho was believed in this whole process set aside for a moment but evident cheery question of whether the Senate should be thinking beyond a reasonable doubt like in court or you know preponderance like all set that aside for for just a moment but just\nThe visceral way in which some people seem to be more believed than others what did you make of\nThat [noise] so this episode like so much in our\nHighly highly polarized society is two completely different world views so when Democrats um both parties in Democrats any way I look at what happened with Kavanaugh they see a Republican Party that is ... that doesn't believe women that diminishes charges\nA sexual assault doesn't take them seriously\nAnd um they have some things in their in their quiver they can point to the Roy Moore episode end to end to the president himself and so forth so that's their view on the Republican to you is that\nIn their quiver they can point to the Roy Moore episode and ah and to the president himself and so forth so that's their view um the the Republican view is\nThat the allegation a of Christine Blasey Ford was even though it was held until the very last moment and they're they're very angry about the the processes um I Know she was saying but they also point to the fact\nThat this accusation the blazing forward one was taken seriously was listening to but then it was roped in\nBy many Democrats on the committee with two other allegations that were so absurd that they should not have even pass the laugh test um the the one by Julie sweat neck which she immediately walked back\nYou know that that there was some sort of raped gang going on in a in in that says to Maryland and the Nineteen eighties and to the students in that she is a college student was attending a lot of high school parties and saw Kavanaugh spiking the drinks are girls with ... and then attacking them well of course she she walked all of that back but\nUh and of course the Ramirez story too was quite thin so thin that the New York times looked into it and we refuse to publish it [noise]\nSo um [noise] so so the the problem was that when Michael ... sort of\nColored sweat neck and dragged her forward and included her absurd allegations in with Boise Ford's more um believable accusation it had the paradoxical effect of ... of um\nMaking sleazy Ford's case all the um weaker because it was seen to be part of this political hit\nAnd um and I think of an ... ah may have a lot to answer for from his Democratic colleagues\nWill the president did also make some political wish Christine Blasey Ford's case or her story as well let me here's part of what you said at a rally on Wednesday in Mississippi in an act of what he said was to help defend Brett Kavanaugh and he was unfair treatment here's a bit of the president\nKind of characterizing washing cars are generous word what professor Ford said two Senate\nDid he get home I don't remember how you get or don't remember when I don't remember how many years [noise]\n\n\nI don't know\n[noise] I don't I don't know [noise]\n[noise] I don't I don't know what I don't [noise]\n\nI don't know\nMan a man just shattered\nPart of what the president said his rally last Wednesday in Mississippi it's worth noting that the president is incorrect in his assertion that all the professor Ford remembered was having one beer indeed she said that seared into her hippocampus totally a psychology professor was the fact that she was laughed at\nDuring the assault yes she also remembered that it was upstairs I mean she remembered many things that President did not cover himself a glory in that moment where he was mocking current diminishing her of course a that was that was disgusting on the other hand um there has been a tremendous amount of behavior on the left during this process that was also I'm really\n... um stopping people in restaurants and and a driving ah people ah from the public square um uh you know accusing someone of a absurd\nCharges and not taking into account his whole life you know if judge Kavanaugh where the monster that ah that some of the Democrats had been portraying you would think that somebody would have picked up on it at some point in his adult life\nWell and that's kind of what I'm Wondering in a way I hear you on that Mona El Yon also kind of noticed that\nOne aspect of the debate of brown Brett Kavanaugh did seem to not get a whole lot of mentioned in the final analysis didn't get a lotta mentioned from Susan Collins of Maine when she gave that like fifty minutes exploitation on the floor of the Senate which was actually\nRather fast moving towards hearing if you haven't heard it\nIt's just how Brett Kavanaugh handled the accusation I mean if someone accused me of something that awful but I Know I did not do\nI think I Would hope that I'd be able to say listen this is an awful thing that happened it sounds like a tragedy I Wish I could give you the closure you're looking for but I'm not the person who did it like something about temperament in this whole discussion kind of\nFell by the wayside [noise]\nYeah I Do think that\nOnce the additional allegations came out in ... not ... in his testimony had to answer not just for a lousy Ford's allegation but also for the other two allegations and and he was upset\nA lousy Ford's allegation but also for the other two allegations and\nAnd he was upset\nAngry in tears enraged are\nOutraged Democrats sort of their their arguments became one not about necessarily guilt or innocence but one about temperament and did he have the appropriate temperament sit on the bench and it\nTheir argument necessarily uh it it became one not about do we believe her but that he doesn't have a judicial temperament and Republicans answered in turn that Democrats have said he was to ... and the Fox interview and to detach and then when he got angry they thought that wasn't good enough\nGood a G. P. B. dot org and click donate thanks so much for your support of Georgia Public broadcasting [noise]\nSupport for CPB comes from you our listeners and the George alliance lighthouse foundation the lighthouse office and Shibley features a fully outfitted optometry clinic served by local volunteer medical providers\nFind out more about their onsite clinic at lions lighthouse dot org and room CB and the rooms symphony orchestra presenting master ... featuring music ... and she makes her state debut in Georgia's Rome ticket information at Rome's symphony dot org [noise]\nAnd make the ... coming up with an excellent point we're broadcasting from Philadelphia and we'll take a deep dive into Pennsylvania's adventures and ... district day we'll have a special report from the state's newly created congressional districts and what impact those races could have the balance of power in Congress that's coming up with an excellent point from NPR's\nJoined his fur on point this morning eleven if you're on the eighty eight point five daisy be find something you can also listen live online and GDP and Donald work\nSupport for NPR comes from this station and from the main office of tourism offering traveler as an opportunity to explore and discover their very own main thing to be inspired the original and be yourself a visit main dot com\nA fraternity to explore and discover their very own main thing to be inspired the original and be yourself I visit main dot com\n[noise] from progressive insurance suffering it's home quote explorer so shoppers can evaluate options in one place when buying home insurance custom quotes in rates are available on mine learned more progressive dot com and from the listeners who support this NPR station\nThe Kavanaugh confirmation has been a massive national story tomorrow we love your help was another big conversation that kind of got the clips to buy all of this this time about law enforcement\nYou may have heard that a Chicago police officer is awaiting sentencing on second degree murder charges\nIn the high profile shooting of a black teenager officer Jason Van Dyke who is white was convicted of second degree murder for killing that scene look long McDonald it is yet another case that raises questions about police accountability and one of the few that has ended in a murder conviction\nIs this a turning point and water police relations like where you live leave us a voice mail eight five five to three six one a one day we would love to hear from you if you are a law enforcement officer or an activist or just someone trying to say stay safe\nTell us your story eight five five to three six one a one a where you can use or app won a vox pop to send us a high quality audio file and to keep up to date on future topics will share some of your stories tomorrow on one day\nBack now to our conversation with you know step in LA on a Johnson and motive Sharon ... let me let you jump in and respond to comment before we could go\nEarly on I mentioned that that Republicans I suffer in the midterms and that was a political sacrifice worth making I I actually think that the opposite I mean I'm not in that political prognostications business I think after twenty sixteen and that's a dangerous business\nBut I don't think they'll suffer at all in fact I'm especially among Republican women there's been a big jumping enthusiast and there's a twelve point upward swing\nAmong Republican women and that's because the left doesn't actually owned the voices of women\nOn for a lot of women out there this this hearing about fairness\nIt was about fairness for their husbands their fathers their sons on that a lot of blame moms who are are really scared about the standard that Mona mentioned right the idea that a single accusation without any kind of corroborating evidence is enough to destroy a man's life I think there are a lot of women who\nStandard that Mona mentioned right the idea that a single accusation without any kind of corroborating evidence is enough to destroy a man's life I think there are a lot of women who see a problem with that standard as well and they are also energized taken out to the\nThis is no doubt very very visceral for quite a lot of you including gene\nGene emailed urging contacted us in road we're more concerned with the men who were falsely accused two to five percent of the time\nThan the women who are raped Ninety five Ninety eight percent of the time when one in four women in America deal with rape and tens of thousands of rape kits remain untested there are bigger issues than your panel is talking about our justice system is broken the women on your panel or making my blood boil\nAre we losing sight of something larger here [noise]\nUh well the um the problem of rape has always been with us as long as there's been human civilization\nAnd when you when I I hate to interrupt you but I just want to clarify something from the comets comments wrote that one and for women in America deal with rape Senator Dianne Feinstein and the shearing said that according to federal statistics it's one in three one in three women will deal with sexual violence it was a not rape that that's way overstated sexual violence of sexual\nSo and that's a very very broad description gr includes even just being funneled over your clothes against your will\nSo right to be careful with the number yeah go ahead and\nGo okay so yeah the number is is is a is not not right but look at the problem of of male sexual aggression or has been a problem throughout human civilization all civilized society seek to cope with it\nAnd it's also one of the most difficult crimes to prosecute because in most cases there are only two people it happens in privacy there are no witnesses um it's very hard to show proof if there was no actual if there were no wounds on the woman's body et cetera et cetera\nSo it is you know when people say well we're not being believed it's because of the it's it's very hard to prove and also we have to recognize that the consequences of finding of guilt at finding someone guilty of rape mean\nYears and years and years in prison and so of course we do need to be careful about how we evaluate rape accusations it's it's it's an awful thing it's it but I don't see any way around you know keeping in mind our standards of justice in fair play now see any way around\nThe difficulties inherent in these kinds of accusations\nI feel like well this is one of those moments early on as there were a lot of women including several who commented on this program not that I think that the show\nThe difficulties inherent in these kinds of accusations\nFeel like well this is one of those moments early on as there were a lot of women including several who commented on this program that I think that the show is a perfectly representative sample of the country but\nA preponderance of the woman who commented on this program have essentially said I don't want to hear it\nWe've been waiting for all of human history for our society to deal with the fact that men can treat women like pieces of meat and get away with it with impunity that day is over yesterday so fix this or we will shut you down until you do I hear you Mona but\nIt's that emotional visceral part of politics so we are not I I don't think that the political will is there especially among women who have been assaulted to say okay I'll take a breath and wait another term for this to get better [noise]\nWell I think there are two challenges the first is that we have a justice system based on a presumption of innocence and the cabin are confirmation presented another challenge which is that he was not being tried in a court of law and the question raised in it was should he a\nBenefit from the presumption of innocence and we had a lot of senators saying no he should uh had the presumption of guilt and he should have to clear his name and not seem not to go over a well there was a political backlash on the right to that\nAnd so I think that there certainly is energy on the left but it is met\nWith equal force from energy on the right with people who feel that that's\nGreatly unfair but the cabinet confirmation and saying that uh men should base a presumption of guilt when an accusation is leveled\nWas sort of met with an equal and opposite energy from the right and emailers and callers can say that that makes their blood boil but covering this as a reporter that is simply a sort of what we saw\nI Do want to move on and talk about the impact on the Supreme Court but I should note that this has left some of you just regardless of your politics feeling very cynical about the process over all I mean this was very high political theater in some ways when you get down to it and that was kind of the reflection of one listener who just left a note in our inbox\nMy name is art I'm calling from Cleveland, Ohio I'm very disappointed check and our current course and I'm very disappointed with the United states at this time being an African American woman I really do feel that it was all up the joke that they what\nPointed within the United states at this time being an African American woman I really do feel that it was all up the joke that they what they hiring doors and said okay but if the country a good show they already know what\nThey were going to do it's not a government are the people on Oh yes it is only up to take care of a group of people\nFor us to appreciate your calling and sharing your thoughts with us let me get to a few more comments as we continue Tina in Grand Rapids Michigan emailed\nI'm so sick and tired of people talking about Kavanaugh's reputation in life being ruined but it's absolutely ridiculous he's a wealthy privileged white man whose life is nowhere near ruined obviously now he's been confirmed and will be on the Supreme Court her life is the one that has been ruined if anyone's life has been ruined\nThe me too movement has not been weaponized for political gain and I'm Upset that your guest just said that on the air so angry right now this is real for women\nWomen in Arkansas emailed so we'll Kevin uh really take the court to the far right I've been hearing conflicting views from the right where some say he will do so and others say Kavanaugh will actually be moderate he missed that meant just gets to something that senator Collins of Maine Susan Collins of Maine\nTalked about in her long exploitation explaining why she was going to vote\nFor Brett Kavanaugh and some of his background particularly as it relates to dealing with presidents on the Supreme Court she mentioned roe versus Wade very specifically what what's your read on whether or not Brett Kavanaugh will track record kind of as Irwin suggested to the far right look", "year": "2018", "show_name": "1A Plus", "city": "Carrollton", "day": "08"}