{"month": "10", "state": "NH", "station": "WEVN", "content": "Keen Ninety points to W. E. B. C. Gore won all seven point one W E v J Jackson I mean I ... W E Z s\nOver Ninety point three W. E. B. Q. little since Ninety One point nine and online H. P. R. dot org [noise]\nMarketplaces supported by the financial services firm of Raymond James offering personalized wealth management advice and capital markets expertise with a commitment to putting clients financial needs first more Raymond James dot com I mean this is a smart thing to do but it's also\nA little depressed [noise]\nI don't discuss what the future as I say what is the worst\nAnd the c._e._o. of dripping Morgan Chase on the program today from American public media\nThis is market for [noise]\n\nMarketplaces supported by ... online test prep for the AC the SATs G. R. E. N. G. mat that's designed to improve scores\nStudents can get video lessons practiced questions and experts support on line and ... hand by sea three I O T addressing the world's most challenging problems that the convergence of artificial intelligence coyote tend to last a cloud computing\nMorrissey three I O T dot AI hand by intercom business messaging platform who's chap automate manuals sales and marketing tasks my qualifying leads and scheduling demos learned more an intercom dot com [noise]\nThe Los Angeles I'm Carl result is Wednesday today the third of October is always to having a long everybody Jimmy diamond coming up and just a little bit more minutes from now ... but we are going to begin today with a well one hesitates to use the word and wonky someone will hedge by saying slightly weedy economic fundamentals\nIt comes to us by the New York times expose and President Trump and his family finances the times reports the president took part in quote dubious tax schemes and another quote outright fraud but let his father transferred to the president\nAt least four hundred and Thirteen million dollars and that is in today's money and in the process minimize the tax burden or for the president we should say denies any claims of tax fraud or tax evasion and in a tweet this morning the president said\nQuote the failing New York times did something I've never seen done before they use the concept of time the value of money and doing a very old boring it often told his piece on me out of court\nSetting aside for just a moment the old boring and often told a bit what exactly is the time value of money and what does the president think it has to do with the times piece on him and his taxes marketplaces Mariel cigar gets who's going\nThe value of money is well I'll let Jennifer ... explain she teaches tax law at University of Kentucky\nThe basic concept is that a dollar today is worth more than a dollar tomorrow for\nA dollar next week\nYou can do more with that dollar if you have it today than if you have to sit without it for a week\nYou could invest it in the stock market put it in a savings account or an interest use it to buy real estate times ... teaches business at Cornell and he says the time value of money is fundamental to business decision making let's say on a manufacturing company you're deciding whether to expand and existing factory or build a new one\nThe new factory might take longer to come up and running but then maybe it has higher returns in the future\nSo you need to think about whether those higher returns will make up for the last time when the factory is being built and your investment isn't making money Jeffrey fossil men at the wealth management firm relative value partners says this concept matters to individuals to he says sometimes clients want to keep money in cash rather than risk losing it\nAnd you're talking about the merits of investing versus not investing there's a cost associated with not investing and that is due to the time value of money\nIt's not clear what President Trump was referring to when he tweeted about the time now you of money he wasn't specific and the story doesn't mention it the writers did adjust all their numbers for inflation expressing them in what's known as today's dollars but\nThat's a different concept ... for marketplace\nOne hopes would explain it to guys right I mean right anyway self driving cars are the future as we know the only question really is how much that future is going to be worth and we've got a hint of unanswered today Honda announced this morning it's going to invest seven hundred and fifty million dollars in GM's autonomous car unit with another two billion dollars coming over the next twelve\nGoing into products that right now at least are more fantasy than reality is marketplace adjusted reports\nThe next generation of autonomous cars not something you can turn out by your company's next board meeting Michelle Krebs an auto traitors as self driving car projects need serious investment\nThis isn't really expensive venture we don't know when you get with us and profitable\nHonda is investing in GM self driving car unit which isn't working on driverless taxi and delivery services Krebs says the partnership is meant to look more Silicon Valley than Detroit that brings in more funding auto analysts Marianne ... says other car companies have been following suit\nIt seems like you wake up in the morning and yet another announcement of a collaboration for something with someone\nToyota's working with her on a ton of his cars Chrysler's partnered with way mo Keller says auto makers need partners to both invested in the future and actually manufacture cars and the president\nThey cannot forsake continuing investment in their current model\nBut hunters partnership with GM could give both companies a competitive edge to Stephanie Brownlee with ... market in Detroit\nGeneral Motors as one of the players in the face\nShe says GM made a smart move like hiring the driverless started cruise even before hundreds investment and GM attracted billions and venture capital and bring Li says Honda brings expertise and engineering\nThey have a track ability in terms of packaging and finding space inside that vehicle\nHead of GM self driving car you said it's cars could have things like giant TVs and many bars that would need a lot of space in New York I'm just into for marketplace\nWall Street is Wednesday you know sometimes I say forget stocks watch the bond market well today is one of those days yes there were record highs in equities stocks in other words but that was where the action was will have the details when we do the numbers [noise]\n\nTwo Seventy Park Avenue in Manhattan is about a six minute walk from the marketplace New York bureau over on third avenue ... was drizzling last friday and when we headed over to the headquarters of J. P. Morgan Chase security guy ministers up to the forty eighth floor where we called our heels for a little bit waiting for Jamie diamond that's on us we were early\nSo we had a chance to poke around a little bit lots of sports memorabilia on the shelf business and management books to interestingly enough bank history stuff as well diamond showed up pretty much on time we did the usual chitchat as we got settled\nTalked about how we got into banking he's the son and grandson of stockbrokers by the way and then we got down to it\nDo you think um\nPeople understand banks in this economy like you understood banks when you were a kid\nI sometimes people those same things as a consumer so you know if you've taken a mortgage rubber checking account tip of business need alone if you're a large corporation you have to show equity your debt that they understand\nDon't necessarily see in the inner workings of a bank does it matter what does to me but I don't I don't think it should matter to the customer no but the customer wants to do a good experience and you know good credit card and a good yeah\nYeah but does it matter whether American consumers understand the way the financial system works\nI think you're I think it matters to understand how business in general works so if you don't have a financial system you don't have an economy\nSo defense this was just part of his great economy America has the widest deepest most transparent but now it's more of the world's ever seen in total I'm including private equity venture capital the formation of business the transparency of our capital markets\nAnd no other country the world has or it's not even close this kind of it's kind of a part of the engine that makes us the most prosperous economy in the world\nYou come to that we I guess come to that not without some scars right and we get to the crisis or a little bit later on but but what do you think um the financial\nSupport for any guys live stream comes from you our listeners and from castle in the clouds lots and borrow\nExperienced the beauty of odd I'm In New Hampshire found high up on the castle on the states what a trial or take half of used by dining on the task open through October twenty five cats on the clouds dot org\nBeing facetious I was looking at Nineteen Seventy four Nineteen eighty two Nineteen eighty seven Nineteen Ninety\nAnd ... and one of things that makes me cautious as knowing all that\nI always always always wanted to run the bank that we can survive anything show that were there in good times and bad times and more more important in bad times for clients\nLots in there and we're going to get to the crisis in a second as I said I I Want to talk for a second about I'm a corporate social responsibility which you are and this banker believer you talk about that a little bit\nI go I I've never believed it only seems to maximize shareholder value in fact I don't know any CEOs were that way I think these\nCompanies wait so sorry how how come everybody thinks all companies just want to maximize should I like it\nIt just becomes a narrative it gets repeated over and over companies have to do a very good job over an extended period of time to get customers back ah companies that take care of customers succeed if they rip off customers they don't to me if you don't take care of your employees you don't take care of your customers you will not have financial success\nWith Peter below during all things considered with higher risk doll during the marketplace and of course with Michael borrow coming up at six thirty with the daily because you love this public radio station it's your time to support it it's quick and easy to do\nOrg or give us a call one eight eight eight eight zero five six four seven seven\nSupport for an age PR comes from listeners like you and from service credit union from commercial lending to fundamental banking needs banking services design for businesses were ready to grow more grow with SCU dot com\nFrom fidelity investments were associates volunteer their time and expertise to help New Hampshire increased financial literacy among students and teachers and from ... committed to combining legal strategy with the Russians you to address coins legal means with offices in New Hampshire and throughout the north east\nI think we owe and dot com\nThis is marketplace I'm Amy Scott in for Congress do after big storms like last month's Hurricane Florence recovery is not only slow but expensive some estimates put the damage at twenty to thirty billion dollars for Florence and a portion of that will go to repairing the beaches affected\nThe U. S. government spends a lot of money repairing coastal communities after big storms Lisa song is a reporter for ProPublica and wrote about the high cost of beach re nourishment\nAnd how that money is divvied up welcome Lisa\nThanks for having me at least that can you tell me what beach nourishment means well\nIt's basically when the government comes in and they pump a lot of sand onto your beach\nTo a fix the damage to the beaches that have occurred there were Russian or through storm damage\nAnd the reason why a federal state and local governments will fund this is that without beach nourishment some beaches in the U.S particularly on the east coast and the Gulf Coast are just getting smaller every year um they're retreating\nAnd so the people who own property on the beach obviously want the beach to stay where it is and those beaches are very important to the tourism economy\nHow much does all this cost and where's the money coming from\nIt costs a lot um so many of these projects are mainly funded by the federal government particularly the Army Corps of engineers and FEMA in total cumulatively the U.S has been about nine billion dollars to rebuild beaches since Nineteen twenty three\nAnd when we looked at the north Carolina data after Hurricane Florence we found that in that state alone federal state and local governments have spent more than eight hundred and twenty eight million dollars cumulatively for those beaches\nWow and what is the argument for spending that money\nSo the local residents would argue that they need that money to keep their tourism economy going to keep their properties up and that you know people from all over the country coming enjoy these beaches so the government should help fund their economies\nThe people who benefit the most from these projects are actually the property owners of ocean front properties so these tend to be the second homes or vacation homes oftentimes they're very large a pricey mansions right along the beach they're the ones who get most of the benefit from these projects\nWhy is that who decides which beaches to protect in which to leave alone\nThat this is sort of decided on a case by case basis some communities actually find most of this work themselves through local and county taxes\nAnd so in that case the federal government isn't really involved but for many communities it's the Army Corps that decides which communities get funded and the way the Army Corps makes these decisions\nThey use that economic formula that ends up favoring more affluent communities and the reason that is is that the corps tries to see which projects can they find where they'll get the most out of every dollar spent so in essence it ends up\nJust affluent but predominantly white right\nYes um so the analysis we did in North Carolina we looked at about sixteen communities that have received funding for these projects and the average uh demographics in those communities but something like Ninety four percent white\nAnd you found that the effect is that they're the same beaches just keep getting rebuilt over and over again can you talk about an example tell me about rape spill beach\nSure right still beach had been rebuilt I think more than twenty times in its history and uh this is a community we found where you know some of the properties right along the ocean are easily worse millions of dollars\nTo lease a song she wrote about beach nourishment for public thank you [laughter]\n\nHey there is Danielle Kurtzleben and the rest of the politics team here to talk to you about becoming a new member of the public radio community the twenty eighth team mid term elections are coming up and frankly we're excited because of the last year has just been so\nBoring director James ... Michael Flynn Mitch McConnell as Chuck Schumer quote I mean nothing much really happen fire and fury new tax bill increase ending government shutdown the medical even got to take a nap two weeks ago worse it OK so\nObviously I'm being sarcastic but other people and stories aren't so transparent\nOur job here on the politics team is to help you sort through all the information that's thrown out into the world every day and to make the news clear joined this public radio community by giving for the first time today we're counting on your support no jokes [noise]\nNo joke it's so\nEasy at an H. P. R. dot org or call us one eight eight eight eight zero five six four seven seven\nHelp pay for the programming that you listen to each and every evening whether that's all things considered marketplace or the daily which is going to begin in just a few minutes become a sustained air for as little as five or ten dollars a month at an H. P. R. dot org I'm I'm like working with me now is Todd looking and\nWhen you contribute you'll be entered to win the final giveaway of this drive the grand prize recorded a once in a lifetime trip\nFor two people to Australia or New Zealand you'll get the choice this opportunity to be entered ends when the fund drive and and that's on friday a prize includes round trip airfare from Boston and a combination\nFor eight nights either New Zealand or Australia the best way to give is on line through your checking account or your credit card\nFive dollars ten dollars a month you pick the amount that works best for your budget and H. P. R. dot org\nWe've had a few new programs added to our a weekly line up we have the take away a when I started a just about two years ago um and of course we have the daily which is coming up at six thirty and perhaps you've recently discovered the show\nAnd it's clear to you that its mission is to tell stories more deeply into an incorporated new kind of transparency and to the way those stories are told\nThe unique approach of the daily provides you and me with an intimate and human looked at the news offering a deeper understanding of the world that is necessary in these fast changing times\nIt's a new show as I said on an H. P. R. and it's made possible with listener contributions so you can join your family and friends and coworkers and people you have never ever met\nA across New Hampshire and by becoming a monthly giver today it's so easy to do at an H. P. R. dot org the money we spend\nOn an H. P. R. it comes from members\nThis happens because thousands of listeners like you took a really important step they became the first time members\nHelp ensure that an H. P. R. has the money it needs to pay for the programs that you love listening to become a first time giver and contribute at the ten dollar or maybe Fifteen dollar a month level contribute right now at an H. P. R. dot org\nMaybe you've been a member of an HP are for a while maybe you've been at that ten dollar a month level well then consider increasing your contribution to maybe twenty dollars a month\nAnd helps pay for NPR News it helps pay for the news from around New Hampshire your guest means a lot especially since you and members like you provide the most important share of the money that pays for everything you listen to\nLend you contribute twenty dollars a month you can choose as a thank you get to a pair of tickets to see NPR's one a host Joshua Johnson he's going to be in Congress on October Eighteenth and yes will also make sure your receipt and each ... knew a beautiful red mug so do you make that gets now an H. P. R. dot\nOrg and H. P. R. it stays with stories stories like breeder greens ongoing reporting of mix misconduct by professors at Dartmouth College or the work that our state of democracy team has done looking at the influence of money in New Hampshire is political races as we lead up to the midterms\nIn each PR offers deep coverage by reporters with deep knowledge of the stories that they are into a this is thoughtful accurate reporting\nAnd it's made possible by you when you support New Hampshire public radio the best way to support us is with a monthly contribution you can make your gift right now at an H. P. R. dot org recalled one triple eight\nEight oh five six four seven seven\n... support", "show_name": "Marketplace", "year": "2018", "city": "Keene", "day": "03"}