{"month": "10", "state": "NH", "station": "WEVN", "content": "W E s now she was eighty eight point three W. E. D. H. head over Ninety One point three W ... keen Ninety point seven Deborah\n... one of the sudden point one\nW E v J Jackson Ninety nine point five W E v F cobra Ninety point three and W. E. V. cute little in Ninety One point nine and on line and an H. P. R. dot org\n[noise]\nMarketplace is supported by the financial services firm of Raymond James offering personalized wealth management advice and capital markets expertise with a commitment to putting clients financial needs first more Raymond James dot\nCom number one bonds not stocks number to read it and number three elements ladies and gentlemen is back in the building\nFrom American public media this is marketplace [noise]\nMarketplaces supported by hacker one helping organizations reduced risk of a cyber security incidents by partnering with trust that hackers to find him fixed software vulnerabilities before criminals can exploit them\nMore and hacker one dot com and by Charles Schwab is Charles Schwab believes in asking questions and being engaged Charles Schwab on your tomorrow to learn more and Trump dot com than high vantage partners a consulting in training from helping companies advance by aligning transformational strategies with the\nPower of collaboration vantage partners dot com\nIn Los Angeles uncommon result is Thursday or over the border is always to have you on\nEverybody this has been a day of big numbers on Wall street most of them printed or\nDisplayed on screens anyway in red ink triple digit losses on the Dow at one point eight percent drop on the NASDAQ but we are going to get going with a technically smaller but arguably more revealing number than either of those to the yield on the ten year treasury notes the benchmark ten year I should add\nSits right now it's three point one nine percent that's the highest that you'll the interest rate that that bond pays the highest it's been since two thousand eleven we got marketplaces Rebecca Shaw on the phone from New York to talk all things\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhat's it would be employer to do in the search for those new hires marketplace adjusting how has that one\nYou don't have to tell stories that workers are hard to come by jak Klein hands with the national Retail Federation says just look at when retailers are posting holiday jobs this year\nThey're announcing these openings much earlier than what we've seen in the past\nHe says stores are starting to raise wages to attract seasonal workers they're also offering incentives like signing bonuses digital training in more employee discounts\nI Believe one of the companies out there was even thinking of providing a four one K.\nBut even though the unemployment rate is so low there are still plenty of people willing to take on more work seasonal workers are often people who are working second or third jobs as economists trees do your duty at the new school she says stores no that higher wages will bring in people who need the extra income\nIs really no such thing as a labor shortage in economics higher pay\nCould cut into profits for retailers and make gift buying more expensive for shoppers but look these are good problem to have the national Retail Federation said holiday sales are expected to jump by more than four percent this year economists Sarah house at Wells Fargo says workers are benefiting to\nDecide this week with Amazon increasing their minimum wage leasing target and Walmart increase the level that they're bringing in workers'\nShe says retailers could ask employees to work longer hours instead of bringing more people on that would be good for existing workers if they need those hours bad for shoppers you'd have to wait longer lines at the checkout counter with fewer employees around New York I'm just into for marketplace\nOn Wall street today well we did that right well the details when we do the numbers [noise]\n\n\nThere's been an interesting day in the U.S China economic relationship a big story and Bloomberg Businessweek maybe you saw this about how the Chinese army had hacked into computer hardware used by some of the biggest tech companies in this economy those tech companies by the way the night we should say\nLater vice president Mike Pence said in his speech this morning that he expects joined it to be more proactive than ever in trying to influence us politics and also some fresh understandings what the new NAFTA is going to mean for the global supply chain under the terms of the new deal and yes I noticed technically the U.S MCA\nManufacturers are going to have to get more of their parts from the three member countries to avoid tariffs United States Mexico and Canada of course the thinking from the White House is it that will force supply chains to shift back to North America which is to say shift away from China marketplace Jennifer pack has the reality check on that from Shanghai\nEarlier this week President Trump declared the deal would provide a big boost for North American businesses and jobs\nThat are being manufacturing powerhouse that allow us to reclaim a supply chain that has been off shored do the world because of\nOn fair trade issues and the president might be on the right track\nSays Henry ... a trade expert at Singapore management university yeah the new impact or would it be a re sharpening of the supply chain is to the detriment of China some companies have already shifting production out of China\nBecause of things like increasing labor costs and heavy regulation to us tears and knew us MTA deal\nHave just accelerated the process says Alberto that already with the then Sheera and associates affirmed that advises foreign investors in China he says about ten percent of his manufacturing clients are starting to set up production line outside China but are they as President Trump once relocating to the U.S\nListen McGee is awesome it's well but you really want to win the trip to Australia and New Zealand that's the thing we're all looking for right right we want to win this incredible trip you can get yourself entered and you can grab yourself a mug while you're at it when you go on line to become a sustaining number at an H. P. R. dot org you can also give us a call one\nEight eight eight eight zero five six four seven seven\n[noise]\nBut it's got to resolve the host of marketplace every once in a while we get out of the studio and we visited businesses making a go of it in two days ago and yes one\n... story is usually okay so here's my out in the world interview with two women they run a brewery in Inglewood, California right here near Los Angeles by the name of three rivers one of those places where you can sit and have a beverage and get a direct view of words Bridget Fonda bar\nI started off by asking room after Alexander no most logical of first questions to ask you go to Bruce\n... we're going to be [noise]\nI like I pays although okay oh honestly it was a reader [laughter] it's a hard question to ask for a my tastes changes I I I pretty\nMuch want us to get those are all the time [noise] ah do you lose you know like movie directors and fruits and stuff in the back and watch their film whatever was going on as men do that yeah yeah yeah yeah I Do um go work and what people drink uber\nSomeone I wouldn't say lurk [laughter]\nSeems like a really really a way to put things but yeah in some ways I Do I Will look at bars occasionally I Know a lot of accounts that may not know me and they give you just completely an adult traded feedback and pray because a lot of the memory or those people don't know that I'm the brewer oh people can say bad things about the beer there is nothing\nI mean tasted so subjective that that's great I'm Sorry if someone doesn't like the beer but there's like twenty other people who love it\nOr um how did you wind up doing the brewing in general\nEyes 'cause you're not your average been working on my beard and having a hard time going in and\nI I studied it in college I actually as an elective in my senior year so I kinda felt for the art the science\nThe whole ... I don't want to hit those too hard but it and and and I won't after this button and it ... ... when you go to LA brewer conventions or national or global brewer conventions you're probably the only woman in the room real close to it\nThat's changing is good yeah I'm over my the course of the time that I've been in this industry was about ten years now and it looked different earlier than it does now there are far more women we're still a vast minority of like the crowd in the room but it's it goes all the time yeah\nA shoulder or just yeah\nI Am caught Hi Lynn Weaver told me or my name is Lynn Weaver I'm the founder and CEO of three we referring company\nWhy did you start this company I was at home at that point in time with my three daughters who are the three leaders and I was bringing home at that point in time so\nWhen we actually started going down the road of opening up a a brewery realize that my strengths lay much more on the business aspect then brewing so I\nI get that you're still early on in your business is life and and maybe the answer to this is I don't know yet but but when did you know you were going to make it\nI always knew I was going to make it\nUm I plan out Alex ... over there and she can she ... she's seen my projections that's why sure what what are the production so we constantly update them within every three months um because our growth has been going I'm much faster than we anticipated so I'm having to adopt them you know on a quarterly basis\nHow hard is it for you with a great growth profile quarterly that you both believe in [noise] how hard is it for you to restrain the\nGrowth demand is always good over supplies bad\nRight now we just happened to be very lucky\nAnd also fortunate that we started in Los Angeles in California\nUm California is the sixth largest economy in the world Los Angeles is the largest a beer market in the United states people talk about a Bible but it it's not it's not like real estate well you have manipulations and interest rates and and like the fed controlling in that manner right\nIt's a natural progression of how an industry you will like grow\nWhat is the end goal here do you guys want to ... golden road is you know it'd be in bed rights\nWere not on that path um it's it's become very much of a family and I think that land and I feel responsible for what's going on in our employees live so uh it's a labor of love and even retirement ruining industry does it mean that much so I\nLike to quote one of my former employers John Martin of breaks and he says his on game is pine box and I think that that's very true for a lot of brewers and including ours uh\nI Would like to buy some of your best ideas for what it was more than ...\n... yeah what's it called it's called expatriate I\nGive you about your stories about interesting people doing interesting things and creating jobs in this economy and yes fear to please consider making a donation to your local public radio stations during his fundraising drive and you're about to give help here is somebody to tell you how to do to\nPay its really\nCourse of course you can give us a call at eight eight eight eight zero five six\nFour seven seven most people these days though go on line it's quick and easy and convenient for for most folks it's also cost effective for us to so go on line um again tomorrow\nIs the last day of an HP ours fall fund drive we want to reach our goals but we can't do it without you if you're not a member yet\nOur primary purpose is to build our membership base during this campaign so you can contribute any amount yep we're asking every listener just like you to act now you can join\nYou can renew or you can make an additional gift and and the easiest and best ways to give on line and use your credit card or or um enter your checking account as a sustaining member as well I'm Deb Turner here with Emily quirk\nAnd we're just so hard and by the amount of people who have stepped up during this Dr ... and who have done their part to support and H. P. R. thank you to Jill and Huffington she says and each PR as my constant companion while driving working around the house or just hanging out\nAsking very little from me it entertains informs engages my mind who could ask for more well I agree with Jill\nAnd if you have a if you appreciate being entertained being informed being empowered by the information you receive from not only are reporters here in New Hampshire but from seasoned journalist across the nation and around the globe then it's time for you to do your part and support\nThis fantastic community organization it's yours so help pay for it and H. P. R. dot org\nIt is a place where you\nGet context where you gain understanding where you are able to digest this complex crazy world that we all live and it really is hard to make sense of things these days but\nThanks to the reporters at an age PR what we're hearing on on marketplace and of course coming up the daily which is just a fantastic new show that we have are\nHere at an age PR we keep you informed we help you understand all that's going on in the world and how it might impact you and your community and and really what we do here is depend on you to invest in the coverage that you rely on so we can keep bringing it your way it's easy\nAnd it's convenient when you become a sustaining\nMember of an HP are easy to do at an H. P. R. dot org as Deb said the daily is coming up at six thirty and we have several new programs here on an HP are including\nNot only the daily but the take away one a is only about just under two years old now and you know this sort of knew programming is made possible by you guessed it listeners support so if you'd like to support or the new innovative content that we bring to the Granite State if you want to support\nThe old favorites a long time favorites like MORNING EDITION marketplace and all things considered you can do that too it's so quick and easy to do at an H. P. R.\nOr you might be wondering how or a monthly contribution of ten dollars is enough to bring you the programs you count on think about this the programs here listening to is on the air because thousands of people like you support it and your ten dollars a month combined with bears adds up now think about this\nTen dollars a month you can choose a special thank you get that celebrates your support for N. H. P. R. and that is a new heart phones T. as a thank you\nYou'll love it you know it's it's a great great T shirt you can see a picture of it on line at N. H. P. R. dot org and it's got that great big heart with a headphones listening it's gray and you can choose us choose it and let us know what size you'd like\nChews on line at an H. P. R. dot org and you can choose whatever\nInto this fantastic giving away that we're getting away tomorrow at seven o'clock that trip for to chip in a lifetime our yard choice of Australia or New Zealand but you have to be in it too when it to make your get now ... an H. P. R. dot org thanks [noise]", "year": "2018", "show_name": "Marketplace", "city": "Keene", "day": "04"}