{"month": "10", "state": "NH", "station": "WEVN", "content": "Natural he point three W. E. V. H. hadn't of Ninety One point three W event keen Ninety point seven W. E. V. C. ... one of seven point one W E v J Jackson Ninety nine point five W. E. T. F.\nHolbrooke Ninety point three and that he will eat the cute little ten Ninety One point nine and online at an age PR dot org [noise]\nMarketplaces supported by fresh works customer engagement software design to streamline processes and filled with the end user in mind more and fresh works dot com\nOf workers get a raise from Amazon but how far to Fifteen dollars an hour really go in this economy\nSupport for an HP our live stream comes from you our listeners and from revision energy a local employee owned company helping thousands of granted staters go solar\nRevision energy is currently growing their team of electricians and plumbers learn more at revision energy dot com slash careers\nOver forty five hundred small businesses have chosen guideline for his modern retirement plan that automate the heavy lifting reducing the cost of a four O. one K. guidelines four oh one K. dot com [noise]\nHand by intercom a business and such a platform who's chats on autumn aids manual sales and marketing tasks like qualifying leads in scheduling demos learned morning intercom dot com\nFrom the studios at Colorado Public radio in Denver today I made me Scott in for Congress do It's Tuesday October seconds good to have you with us before we get to the Amazon news of the day it's worth going back to last month and a bill introduced in Congress by Senator Bernie Sanders\nHe called it the stop bad employers by zeroing out subsidies act also known as the stop Bezos act\nAs in Amazon CEO Jeff Bezos the bill would tax big companies whose employees rely on federal benefits like food stamps Medicaid or subsidized housing which is reportedly true in some states of Amazon the idea is to encourage those employers to pay higher wages\nWell Amazon announced today that as of November first it's raising its minimum wage for us employees to Fifteen dollars an hour we got Abigail Wozniak on the phone to talk about all this she's a professor of economics at the University of Notre Dame welcome to the program\nThanks for having me trying to understand the impact of this though the minimum wage in Seattle where a lot of Amazon employees live is already more than Fifteen dollars an hour\nWhat kind of employee do you think this is going to have the biggest impact on\nSo Amazon apparently has argued that a lot of their full time warehouse workers are fulfillment center workers are already making on average over Fifteen dollars an hour so you're right that they already have quite a large swath of their workforce who would not be affected by that\nThey specifically mentioned part time and temporary workers ah they almost certainly will see some changes there those tend to be lower paid positions than a full time positions\nAnd they should also apply to whole foods cashiers\nAnd average wages for cashiers in general in the whole United States was about uh about ten dollars and sixty cents so for those folks this is likely oh a raise but it's very unlikely that this is touching a large set of their core fulfillment center workers Amazon and its\nAnnouncement also said it's going to lobby Congress to raise the federal minimum wage which is just seven twenty five an hour but even without the federal wage increasing this likely puts pressure on their competitors to do the same right I mean Wal Mart only recently raised its minimum wage to eleven dollars an hour\nThat's still a quite a bit less than Fifteen does this sort of speed up the the movement in that\nDirection really I think a skilled warehouse worker is already earning more than a cashier um so that's kind of wanting to keep in mind is that Amazon is not quite in probably exactly the same labor market\nAs Wal Mart is by the same token a lot of other firms are already announcing these types of bigger wage increases so for example it's hard to do so I didn't want it to get to Fifteen by twenty twenty and Costco right in saying fourteen so I think Amazon is in some ways just keeping pace with that\nThere are lots of places where Amazon has employees that have lower minimum\nWhat kind of impact do you think this will have on communities where suddenly a lot of people are making more money\nCertainly there are places where this raise we'll have more buying power for the employees who are affected that in general should be a good thing for those local economies\nIt also does put some more pressure though on firms that might not be at a point where they are ready to pay wages that are quite that high so I think definitely watching for effects on smaller businesses\nOn their ability to recruit and retain workers and those kind of local markets\nA would be an important thing to follow up after this announcement we're\nGoing to look at how far Fifteen dollars an hour really goes for an average worker but what kind of impact do you think this could have on the larger economy Amazon has what two hundred fifty thousand employees plus another hundred thousand seasonal workers as you've said a lot of them are already making at least Fifteen\nBut fewer of those employees are relying on public assistance they have more money to spend I mean do you see a macro effect from not just Amazon but this larger trend when\nPay expands for workers we have more in kind of a total wage bill that can cycle back through the economy that's good in general for growth um we also going to want to keep in mind what's happening with inflation\nIf wages go up generally that's great but we have been experiencing some uptick than inflation and want to kind of keep an eye on the real purchasing power of these raises for workers\nAbigail Wozniak teaches economics at Notre Dame thanks so much Thanksgiving\nAs the professor and I were discussing Amazon isn't the only retailer raising wages and more could follow suit meanwhile more cities and states are raising their minimum pay closer to what worker advocates call a living wage\nSo what's it like to live on Fifteen dollars an hour marketplaces Renata Sago talked to some of the people who would know best Alex\n... is twenty two years old and works two part time jobs in Florida he makes sixteen dollars an hour as a community organizer and nine fifty at a fast food chain he says he's able to pay his bills and bus fare but earning Fifteen dollars an hour full time with health benefits would help\nWhat I'll just leave it just a permanent job which foods are miles but actually I can talk to your show every week or more than that will be alert show much\nSharon ... Peterson is forty two years old and lives in Utah she's made Fifteen dollars in the past working odd jobs and said she was able to manage as a single woman now that she lives with her husband and his raising two kids she relies on renting out rooms in her home and her parents chip and money\nIf we hadn't bought this house when we did we wouldn't be able to survive on Fifteen dollars an hour there's no way\nBack in Florida Alexander Saunders who works at a community center received a raise last month after a few years of making a little over Fifteen dollars an hour the twenty eight year old credits that wage with and being able to pay off his debts\nI actually just paid off last year at a car loan\nBut he says he wouldn't have been able to do that if he hadn't been living with three roommates\nSplitting rent some orders and Ormond show\nWhile cities like New York Los Angeles in Seattle are mandating Fifteen dollar an hour wages the fight for Fifteen as it's known continues and now Amazon employees across the country will get to see how far the Fifteen dollar wage will take\nThem I'm going out of say go for marketplace we have another slice of the Amazon story on line today and explainer on monopoly sunny try saying that five times fast and why the term might relate to Amazon on Wall street retailers paid a price for the promise of higher wages will have to eat\n[noise] cheese cheese\nAnd new NAFTA or as it's officially now in the U.S Mexico Canada agreement reached over the weekend is already raising some complaints from North of the border Canadians are worried their drug prices will go up\nAt because one piece of the deal gives years of extended patents protection that is monopoly protection too high end expensive drugs known as biologics that means the trade deal could delay the time it takes for cheaper generic to get to market\nFrom Washington marketplaces Scott tongue reports biologic\nDrugs are complex medicines made in living cells they ... him into suppressants anti inflammatory is very effective in very pricey this trade deal would give biologic makers ten years of patent protection Canada and Mexico which is longer than they enjoy now Bryan popper heads action for trade representing pharmaceutical makers and others\nNot entirely up to what's in the United states but I think the industry thing this is a real when\nA when because it would fend off competition from generics for a few extra years then of course means a loss for makers of lower price ... known as ... similar in Canada they'd have to wait an extra two years to get to market\nAnd call us right now at one eight eight eight eight zero five six four seven seven or online at an age PR dot org\nOver the last few months you've heard outstanding coverage from an HP our newsroom on the free state\nBy Taylor Quinn be there's also done it in that series on contamination at the Coakley landfill site from Annie Ropeik this kind of local coverage is unique to engage PR and helps us all understand that people and events of our state\nYou share our mission to stay connected and now you can share the financial responsibility of making it available to everyone\nThe best way to support an HP are is with a monthly contribution at an age P. R. dot org\nYou know every contribution whether it's large or small it's treated with respect and we will say thank you make your gift right now at an H. P. R. dot org or by calling one eight eight eight eight zero five six four seven seven support\nFor an HBO ... comes from listeners like you and from ... committed to combining legal strategy with efficiency to address clients legal needs with offices in New Hampshire and throughout the northeast ... dot com\nFrom service credit union from commercial lending to fundamental banking needs banking services design for businesses who are ready to grow more I'd grow with\nSCU dot com and from New England duplicate or in Manchester an on demand digital printing printing service provider catering to businesses large and small since Nineteen eighty one learn more on line [noise] this is an age we are [noise]\n\nI Want to take your mind back in time a little bit to the growing cities in the early twentieth century back then rent strikes were common tool to protest conditions and crowded tenements\nNow it seems to practice is making a comeback in Los Angeles and other cities with tight housing markets Cape ... not to know go report\nIt was bad news when Joe wanna uh chores landlord told her back in January that her monthly rent would go up by a hundred dollars but the alarm bells really started going off in April when the rent went up again another two hundred and fifty\nDollars and everybody said thinking whoa this is so much the same thing happened to virtually all the residents of the Burlington apartment a two hundred unit complex just west of downtown Los Angeles built in the late Nineteen eighties Eli has rent control a lot of the Berlin apartments for two new to qualify\nThat is one of us tennis started we like to know something is wrong this is that right and then that's what started getting information and that's when we started to strike\nA rent stripe to pressure the landlord into negotiating rental rates and addressing neglected upkeep tenants in about eighty here it's just stopped paying rent on a recent summer evening about two hundred residents and activists marched through their neighborhood\nIn protest [laughter] [noise] you have tenants who have been living in deplorable conditions for for many many many years and now the landlord is raising their wives and it's it's caused a crisis with tennis\nPrinted that releases a volunteer with the Los Angeles tendency to the group teaches ranchers their legal rights like how in California they can withhold rent for landlords fails to properly maintained a building\nAll they have or their rent checks and so they use that because really they don't have any other recourse\nIn a written statement landlord representative FM male management said that rents have been raised to cover operating costs LA's not the only city to see red strikes a chunk of the Web turned up similar actions this year in San Francisco New York D.C Houston and Portland\nThese are all places that you would expect them to be if you're Michelle Wild Anderson a Stanford professor who studies urban poverty\nThese are places that are we could think of his job are rich and housing poor\nThat is metro areas that have added many more new jobs and residents than housing unit the classic recipe for high rent\nRent levels and the housing conditions have gotten so far\nOut of whack with each other that\nPeople basically start yelling from their windows\nBurlington resident re Estrada gave me a tour of the complex\nRotting walls are soft touch recently painted surfaces or crack showing mold underneath in the parking garage\nResidue from sewage overflow clings to the walls and the pipes then he took me up\nTo the roof certain areas here that are very high interrupted him before he could say soft I can I can feel it walking on the beach or something a lot of the roof squelched\nWhen I walked on just one of the reasons that straw to worries a lot about the structural integrity the buildings were not complaining or we just want to get free rent no we want to pay your rent but we want to live in a safe environment\nIn its statement FM ill management says that all maintenance requests are handled immediately but rent strikes don't come without risks in the case of the Burlington apartments the landlord moved to evict the striking tenants they dropped most of those suits in September after tendons agreed to pay what they could impact rent\nBut at least three tendons were evicted in Los Angeles a match [noise]\nKnowing what's happening in the mid term elections before you vote in November is important\nBut what about what's going to happen in December or January Hi I'm Lauren jolted housing in policy reporter for any GR when you give each month as a ... you will an H. P. R. and NPR cover the entire election what happened for what's going on now and especially what's coming next to be a part\nOf what comes next becoming an HP our standard to that\nYou can become as I say in her today by going to an H. P. R. dot org or by giving us a call at one eight eight eight eight zero five six four seven seven it's really easy takes just a few minutes\nPrograms like marketplace um and the daily which is coming up are your sources for the news that you can trust I'm here to remind you that support from listeners like you make programs like bees possible at now during an HP arts fall Dr\nMake a gift through your checking account or credit card at N. H. P. R. dot org I'm Erika Janet can here with more is Todd buck men\nYou know there is a great reason to give right now in any amount because it's going to be matched dollar for dollar you can become an an HP are sustain or a current member when you become in an age of ... a current member\nOf an age group leadership circled they're going to measure contribution dollar for dollar so let's say you give a monthly gift to five dollars or more\nA current member will match that five dollar gift will become ten this is a great time to give the dollar for dollar match that was only in effect until seven PM so we're starting to to tick down here this is your chance to make your support go even further don't wait give now an H. P. R. dot org\nWhether it's World Trade developing economies are tariffs and trade conflicts international coverage is one of the things that programs like marketplace do best your financial support helps pay the cost to make this coverage possible that's a pretty good exchange rate you\nWeren't able to listen to market place right now because thousands of people supported and HP are in the past pay it forward make sure it's here in the future become a sustained are at an H. P. R. dot org\nYou know a free a free press plays a a really vital role in a democracy it holds leaders accountable for the decisions that they make it also encourages participation of citizens it inspires them to raise their voices to raise their concerns\nAnd HBO has always been in the central part of this area's free press for for nearly four decades now employs exceptional journalists to report from all around the region public radio is supported by those who listen monthly gifts of five dollars or ten dollars from listeners and ...\nBe independent and balance to be the free press that you rely on contribute right now at an H. P. R. dot\nOrg Maggie and look how many as someone who has contributed and she said that she loves and H. P. R. for its trust it unbiased news she loves great programs like one a and fresh air I also love being able to here in New Hampshire specific subject matter whether it be politics or the real story here that's my little comment there\nThe squirrel population as honest as the hot story it is continues to be on a hot story click bait [laughter]\nMaggie's contributions together with yours and other listeners provide ongoing news and programs please join them by making your contribution today\nMaybe you've been a member of an each pure for a while we'll consider increasing your contribution\nTo twenty dollars a month it of course will help pay for NPR News the news from around New Hampshire or your gift will also get you a pair of tickets to see NPR's won a host Joshua Johnson he'll be in Concord on October eight ... so you get\nTwo tickets to see the host of one day that's that's a pretty cool get along with those tickets you will also get\nA an HBO his new trust worthy love worthy read mug this is a red mug that has the words trustworthy and love where the on the side of it it's pretty cool mug maker gift right now twenty dollars a month at an H. P. R. dot org\nIn today's political landscape the most heated debate aren't just about the changes happening in Washington or the policies of our government there about looking ahead and making decisions about the future of the country\nAnd H. B. R. helps you take part in these conversations there are many ways to be part of the conversation at an age PR and one very important way is to go on line and contribute at an H. P. R. dot org and thank you [noise]", "show_name": "Marketplace", "year": "2018", "city": "Keene", "day": "02"}