{"month": "10", "state": "NH", "station": "WEVN", "content": "W. E. B. yes now sure they'd be a point three\nW. E. V. H. Hanover Ninety One point three\nW E v end keen Ninety point seven W ... one of seven point one W. A. B. J. Jackson Ninety nine point five\nWCBS Colbert Ninety points three and W. E. V. cute little ten Ninety One point nine and online at an H. B. R. dot org [noise]\nMarketplaces supported by constant contact with hundreds of customized several emails template for small businesses can\nReach customers where they are every day there inbox learn more in constant contact dot com [noise] this is\nGonna sound radical I Know but what if\nWhat if people making policy actually listen to the experts\nFrom American public media\nThis does market for [noise]\n\nPlaces supported by Drexel University Drexel University is academic modeled prepares visionary leaders to address the challenges of a changing world more at Drexel dot edu slash ambition campaigns\nBy guidelines for oh one K. over forty five hundred small businesses have chosen guideline for its modern retirement plan that automate the heavy lifting reducing the cost of the four oh one K. sidelined four oh one K. dot com\n... addressing the world's most challenging problems that the convergence of artificial intelligence ... tend to last a cloud computing\nMaury see three highly teeth out\nIn Los Angeles times on Monday the day the age of October is always to be a long everybody's sometimes\nThat I Know it's rare but sometimes various threads in the news come together in interesting ways and today is my guest is one of those days last night us time we got a new report on climate change and it is bleak very bleak a group called the Intergovernmental Panel on climate change thousands of climate scientist basically\nSay the earth's temperature has risen to one degree Celsius about one point eight degrees Fahrenheit if you do the conversion since the industrial revolution and if we can't keep that global warming below about three and a half degrees Fahrenheit\nOceans could rise an extra four inches grain yields unavailable drinking water would plummet it wouldn't be bad as I said it would also be the group says expensive eat to Fifteen trillion dollars\nWell good thing then and here's the other threat that the Nobel Prize in economics was awarded this morning to a guy who spent his life marrying up environmental science and economics William Nord house of Yale is his name so in his honor marketplaces got tongue gets going with this what if\nWhat if ... that is all things being equal what if we could see climate change and its solutions in economic terms\nSay you're at a dance of PHD's and you force all the earth scientists on one wall to dance with all the economists on the other that's what William nor the house has done he asks how does economic growth effect pollution and vice versa USC economist Matthew Kohn\nQuote causes greater greenhouse gas emissions but greater greenhouse gas emissions intern lower economic growth\nFor instance climate change lowers crop yields and raises air conditioning bills nor has made models for policymakers to find the best approach to climate and economic growth\nNot because we're environmentalist but continue economic growth and the overall improvement in standard of life\nAnd build Nord houses world the optimal answer is if the or attacks on polluters based on the damage they do this is largely accepted in climate talks so he changed the debate two economists Michael Green stone at the University of Chicago it's no less about right and wrong and more about math\nWithout bills incredible work climate change really could have become very firmly a moral issue instead of an issue that reflects trade offs and the problem with the moral issues is at my morals aren't your morals\nBut like any good academic north house gets into fights\nHe thinks the world can handle five degree Fahrenheit rise which is much higher than many others economists Noah ... at Columbia explains that's because no one has assume something about future generations\nPeople today don't care very much about what happens is a hundred years from now and I think that's where there's a big disconnect between north houses model and the way that a lot of people work on climate change the the issue\nJust gets in the weeds of quote discounting the future but it means that climate debate on an economist terms I'm Scott Tong for marketplace\nOr theme today of what if continues with the second half of today's economic snow belt which went to Paul Romer of NYU's stern school of business for to\nTechnological innovations into long run macro economic analysis so what if once again the people making the policy to rumors work into account marketplaces replenish or has that one\nPoll rumors big breakthrough with us he took models of economic growth an added a missing magic ingredient\nPaul Romer put the production of ideas at the center stage of economic growth\nIdeas Scott's during teaches at MIT ideas are special they're different from a lot of other goods because they don't get used up\nEither I eat an apple or you eat the apple but we could all use calculus\nSo sharing ideas like the technology behind the Internet creates growth but ideas also need to be protected at least a little to reward people for coming up with them so you have things like patents on new drugs for example Romer put all this together in a concrete model with a major implications ... is a former colleague rumors and a professor at Stanford\nEconomic growth is the result of these innovative efforts by entrepreneurs and scientists and researchers and so anything that influences their effort can therefore affect our living standards in the long run\nGovernments have the power to promote or discourage innovation through policy Joshua ... is a professor at the University of Toronto he's known Romer for Thirty years\nOld I was ... helped to make the case for promoting science by should in ways that had previously been ...\nAnd yet maybe that message hasn't totally sunken here's Rome or at a news conference this morning\nI've been really disappointed that we just haven't had a kind of political environment where we can think about you know speeding up to college for progress\nThe U. S. government's share of all basic research funding in the U.S is the lowest it's been since World War two in New York I'm Sabrina short for marketplace\nA quick plug here for our interview with Paul Romer from a couple of years ago after he'd written a paper that said basically mackerel economists have been doing it all wrong it's a marketplace dot org link you need is mentioned on air and yes I Know it's not technically the Nobel Prize in economics don't at me\nWall Street today pretty good amount of bouncing around actually will have the details when we do the numbers\n\n\nOil flows basically even today Seventy four or so dollars a barrel for benchmark west Texas intermediate and given the way the oil markets gone for the past five years the industry is going to take that oil and gas out in Kansas\nIs mostly small independent producers so even small changes in that price can have big economic impacts and when the price crashed a couple of years ago if you remember that a lot of companies just stopped drilling and shut things down\nBecause Brian grim if the Kansas news service reports oil on the rise has producers nervously starting to turn the pumps back on which is affecting the rest of that state's economy\nSo everything clean fun a wet misty morning and I feel that in Kansas\nThree guys are working in a mix of mud and oil to pull pipe from a well with them is working part time case he asked one of the worker ... for an update so what are you guys going to do here to an actor and a job and we're going to find a case that\nMaintenance work like this is among the signs that the Kansas oil and gas industry is beginning to a lake from it's nearly four years long slumber this crew works for expressing well service repairs oil and gas wells\nThey're slowly helping to restart in industry still anxious about recent losses the company has a growing list of service request Tom Casey is a supervisor and express\nJust thankful the that we made it through that a cat our blessings every day we're still here\nWhen profits tanked and twenty Fifteen oil companies turn off the ...\nThe work for companies that service those wells but that's changing Casey says express has so much work now there's a growing backlog and while he says he has enough rings to get the jobs done he's having a hard time finding enough people to work on that\nThe unemployment office uh work with have ... minutes later and they're all saying there's just not hardly anybody out there looking for a job especially hard job like ours\nExpresses even offering to pay employee health care premiums as an incentive despite the staffing challenge the go to work as a welcome change for a company that had to lay people off\nAnd significantly cut ours a few years ago and late twenties fourteen the price of oil was more than a hundred dollars a barrel or two years later it bottomed out right around twenty six dollars a barrel nobody thought it would last three years ... ...\nHe works in production for shack oil\nEverybody thought it would be over and a couple you know ten eleven months but\nOnce it hit that first year and then second year it was tough\nStarting last year oil prices have started to creep up words that were touching right around eighty dollars the rising prices up tempted many in the Kansas oil industry to get off the sidelines the number of request to drill new wells has been steadily increasing from a hundred and forty one request in April\nDivision to it your Google Glass anybody right I mean that's where you know it's hard to hardware is hard truth of or Mali which is always the marketplace ... thanks Kay ...\nSupport for HP eyes live stream comes from you our listeners and from castle in the clouds Milton burl\nExperienced the beauty of autumn in New Hampshire from high up on the castle on ... what a trails or taking colorful views while dining on the terrorists open deli through October twenty first castle in the clouds dot org\nBureau says it needs to hire hundreds of thousands of temporary workers for the twenty twenty cents as we're just going to be your for you know and and it's not going to be as easy making those hires as it was last time around from WBFO saying in Pittsburgh marketplaces are comparisons that one\nTen years ago David Macko more had just gotten laid off from a decades long job as a newspaper reporter in San Antonio Texas unemployment was high and\nThere were many\nHe spotted a sign of his unemployment office and along with nearly four million other Americans apply for a job as a temp workers around the time of the twenty ten cents is\nThere was the man for the work that many jobs available\nTen years later the sensitive reaching out again for field workers and others to help gather information but it may be hard because the economy is in much better shape than national unemployment rate has been low and fewer people are out of work the census is already making videos to explain what it does\nI think I have to participate and says it's\nPlanning to do extensive outreach by partnering with local organizations to publicize job to bail ability putting out public service announcements using social media But Rachel Franklin a demographer at Brown university points out today did economy jobs out there may pay better or offer more flexibility like working for a ride sharing\nIt could be in your own car choosing what ours you work um and when you are\nBut at tight labor market overall doesn't mean a tight labor market everywhere Juliet Cora NATO economist at the University of Texas at Austin says the economic recovery of the last ten years has been characterized by growth in urban areas but in some rural spots\nThey might have an easier time tracking that workers than in a urban areas\nAnd in those rural areas there are a lot of people to be counted the census has already posting it's county by county hourly pay rates for different states hoping to entice workers that competitive wage in America ... the marketplace [noise]\n\n\n\n\nThree point seven percent unemployment is tricky for companies in this economy tried running one with the jobless rate at less than two and a half percent two point four percent actually\nWhich is the state of the labor market in Japan for every one hundred people looking for a job over there there are one hundred and sixty job openings think about that for second next thinking lord board to a declining birthrate\nAnd aging population and also general wariness of immigrants in that economy one response from the government which is not without controversy filling Japan's labor gap with foreign insurance ... reports [noise]\nHad a fish processing plants in combination Japan twenty six year old when he's on standing near conveyor belts were stream of silvery mackerel move by one of the time she grabs a fish in with a pair of scissors flips off the tail and since she's been working here for two years but his originally from Vietnam\nA long way to come for a job\nHeard Japan is a wonderful country so I wanted to experience it\nTons is one of nearly two hundred and fifty thousand workers\nIntern training program officially its purpose is to bring folks from neighboring countries\nAnd teach them skills they can apply when they returned home after a few years after you get to to owns the fish plant he says business is good but Japanese workers are hard to find so he hired insurance he says that about ten percent of his factory staff\nOr some of the not only filled with labor shortage but they're very young so they're energetic\nThe intern program started in the nineties today more than thirty five thousand businesses use it even though it's billed as technical training many say it's really a thinly veiled effort to fill jobs in a country where talk of immigration is political dynamite ...\nIt's a war way of trying to get laborers to come to Japan ... runs a nonprofit in Tokyo called the solidarity network with migrants Japan he says a lack of oversight has allowed the program to devolve into a kind of\nIndentured servitude was when she seems to know\nEvery few days he says his office gets calls from insurance complaining of wage theft harsh conditions or even physical abuse from employers he\nSays it's not just a few bad apples is going to go to or who did he mean Monday on the system itself is structurally wrong and there is some data to support that view in twenty sixteen the government investigated more than a thousand companies that host interns\nAnd found nearly three quarters of them in violation of some labor or safety law cuts are you ... is what the government agencies set up last year to regulate the program\nMy impression is that those who are going to go on the program they tend to exaggerate the programs\nHe says serious violations are rare and nobody's forcing people to come indeed many interns willingly pay a small fortune to brokers in their home country just to get a spot when ... who came from Vietnam a couple of years ago says he paid roughly eight thousand dollars us for a chance to make good money in concrete construction\nFifteen people let us know sin\nBut soon he says he and other interns were tasked with doing radiation clean up at sites affected by the twenty eleven melt down at the Fukushima nuclear plant at the time he says his employer never explained to them what they were doing so she said in the nose into those who've had we known it was related to radioactive stuff we wouldn't have never done it\n... has since left that job and staying at a shelter for displaced interns\nDespite his troubles he says he wants a new internship and does not think the program should be shut down neither does the Japanese government right now lawmakers are considering doubling the length of time in turn can stay for five years to ten I'm Adrian ma for marketplace [noise]\n[noise] [noise] [noise] [noise]\nThe son of load on the way out today courtesy of the wall Street Journal the paper pointed out this morning some of the perks that Nobel Prize winners get there is the cache of course hair over a million dollars this year split however many ways the prize is split\nParking spots at their universities always welcome I Am sure here though is the best one after news bored of Denmark when the ... Nobel in Nineteen twenty two he was eventually given the house the founder of Carlsberg the Danish brewer had left\nTo be the residents I'm a notable Dane in the fields of science literature or the arts here comes the best part the house came with an exhaust the bowl supply of Carlsberg it's a pills nerve but I'll allowed [noise]\nLike if I just find that goes on line ... G. R. E. N. G. math that's designed to improve scores students can get video lessons practiced questions and experts to force online at ... dot com [noise]\nPlatforms who's chats armies manual sales and marketing tasks like follow find leads and scheduling demos learn Lawrence intercom dot com and buy T\nRowe price offering a strategic investing approach that examines opportunities first hand since Nineteen thirty seven T Rowe price index with confidence\nOur we've got to do the belly up thirty nine points today about attempt present that give up fifty two points about six cents per cent has to be five hundred was basically flat or doing production Jim include ... horse\nDrawn can reduce your blog posts and Phoebe ... special projects desk who tell me Andres ... is a producer on our wealth and poverty desk\nI'm drawing a result we will shoot ... [noise]\nThis is APO [noise]\nThe rising stars award recognized outstanding young professionals and innovative companies around the state [noise] I'm Keith McDermott data and investigations reporter and H. P. R. we're partnering with stay workplace to celebrate this year's class of New Hampshire's rising stars will be the courier museum\nIn Manchester on to this day October ... with delicious food entertainment raffles get your ticket that an H. P. R. dot org [noise]\nIt's six twenty nine in the daily is coming right up here on an H ... n Peter yellow support for H. P. R. comes from listeners like un from Tufts health freedom plant and northeast tilted dental\nPartnership created for better or all an overall health right here in New Hampshire learned more AT T to toes dot com and familiar travel and all we're company who's goal is to help crap to life with liberty and the pursuit of happiness information at noon travel dot com", "year": "2018", "show_name": "Marketplace", "city": "Keene", "day": "08"}