{"month": "10", "state": "TX", "station": "KTRH", "content": "That's six issues of a Mac celebrated magazine and it's all part of an a Mac membership get your copy of the latest edition of the a Mac advantage magazine by joining right now a Mac dot U. S. A. M. A. C. dot U. S.\nAre you worried your identity could be held hostage you should be because ransomware does exactly that this is Tom Kelly studio of my id care making every American safer from the effect of R D served as a tall order but that's my goal so here's a tip the best things you can do to help protect yourself from ramps and we're just a buck up your computer often\nIf you have questions about identity theft and even if you're struggling with fraud today my I Do care can help\nGet Fifteen Percent off at my id care dot com slash mark my id care dot coms last mark\n[noise] the the Houston is known for him after the beard Matt Mack humidity\nTex Mex awful traffic and we're known as the place to go for beating that awful traffic\nDrive and I tell him you know we use radio seven forty\nKatie our age hey it's Ramona Oliver ding yes that ... will now benefit you let me tell you how there is a new app it's called the get upside app\nGet upside you can download it from the app store or the Google\nPlay store ... easy to use I use it this weekend I figured it out you can't do it gives you up to twenty five cents per gallon cash back every time you\nFill up for gas you turn the apple on it shows you nearby gas stations and it shows you the discount per gallon of gas at each station it's easy to use open the app choose the gas station with the offer you want to claim upload your receipt and you get cash back you get it back quickly within twenty four hours using pay pal or you can request to check in the mail or if you're like me you're just gonna let that baby right so Christmas Time and then\nYou get a little extra scratching time for Christmas and you can use it on top of the other loyalty programs here's where the dean comes in download the free get upset at a news promote coding D. I. N. G. for a bonus twenty cents off a gallon on your first fill up that's up to forty five cents off per gallon cash back\nThe get upside app\nEnter key word being the I. N. G.\nWhen your company has a benefits experienced that stands out so he you renaissance provides a smarter way to offer employees' dental vision life and disability insurance starting with top notch customer service ask her broker about renaissance is a renaissance family dot com today\nNow for your wellness minute with Dr Steve haute see most of us know someone who's had breast cancer we all want a cure but why\nDon't we focus on preventing it in the first place here some simple tips to lower your risk\nBalance your female hormones with natural ... which protects against breast cancer avoid counterfeit home was like for him or in print pro or birth control pills these\nDrugs increase your risk for breast cancer use natural desiccated thyroid if indicated to strengthen your immune system\nThis cancer protective dramatically reduce sugar and simple carbohydrates in your diet ... green vegetables lean meats and fish be sure to take high quality vitamins and including iodine vitamins I C D E fish oil and the antioxidants selenium and Alan ... of prevention is worth a pound of cure I'm Dr Steve hopes the\nHead of the health and wellness center has reinvented the wellness experience college today too late one six Ninety eight seven ... seven and receive Dr ... best selling book to eight one thick nine eight seven seven fat and it's another Randall\nFor celebrate twenty five years in Houston letting our customers and their needs first time\nI talked to my for applying for best deal ever bring our twenty fifth anniversary get Texas ... like twenty thousand off MS or be on a new ... F. one fifty ... funny thousand authentic voice\nRecognized by forward as the most overweight and winning dealer in their history and pointing to rein in the way the way\nYou know it's not smart job sites that overwhelm you with tons of the wrong resumes by you know what is smart zip recruiter dot com slash Levin L. E. V. I. N. unlike other job sites zip recruiter doesn't wait for candidates to find you\nZip recruiter finds them for you it's powerful matching technologies scans thousands of resumes identifies people with the right skills education and experience for your job and\nActively invites them to apply so you get qualified candidates fast no more sorting through the wrong resumes and Omar waiting for the right candidates to apply it's no wonder that ...\nThere is rated number one by employers in the United states this rating comes from hiring sites on trust pilot with over one thousand reviews and right now\nMy listeners ... recruiter for free at this exclusive website zip recruiter dot com slash love in that zip recruiter dot com slash L. E. V. I. N. ZIP Code or dot com slash live in ... the smartest way to hire\nBoy swimming [noise]\n\n[noise] Houston police arrest us suspected serial rapists but believe there may be more victims\nFor the top of the hour news radio seven forty Katie R. H.\n[noise] the headlines you just can't make a [noise] Trump's whoa said cursing\nOr angry Kanye and Oval Office as America's suffers with a hurricane\n[laughter] [noise]\nKanye West's making every liberal freak out I guess it's because they they realize that they're losing control\nOf their democratic slaves African Americans that they feel like they own as slaves\n\nYou have so many African Americans that are walking away from the Democratic party and they don't know what to do they don't know how to handle it they don't understand what's going to happen here\nSo they say things to do great they say things like this\nIs what happens when they grow don't read 'em and then we have this now and now Donald Trump is going to use it in perverted and he's going to have somebody who can stand with methane pictures [noise]\nIt to me and the individual\nTell people they've gotten mental health issues tell people they are unstable\nHelp people\nAnd MSNB envy MSNBC how's dumbfounded after ... the White House saying quote that was an assault on our White House how is Kanye West giving his perspective on life on a salt at our White House\nThe same people I I ... I mean you're talking about salt was talking about the assaults on our intelligence on how many hours you given to Michael having that in a porn star\nYou're talking about to solve assaults on my intelligence [noise] fine I'm Out of\nTime I want to say once again thanks demarco Venice same for me fell and I hope you guys enjoy that you can follow me on Twitter about Ferguson show Facebook vent Ferguson there as well God Bless America hopefully I'll see a bacterial ... Marshall then we'll be back with you next week have it right now\nDid not watch you know it's you know\nI this is Jerry rental car broke and I spent over ten years in Houston making sure\nI personally know every single day there was this car pro certified we're serious about having an outstanding car buying experience and getting special corporate pressing then go to court pro USA dot com now for your VIPs certificate to see my friend Charles ... said VW or the woodland\nRow you live\nI this is Jimmy bird for Bill a bunch of dot com if you have a cell phone pay TV electricity Internet our home an auto insurance you really need to listen up because every week bill advisor is winning for hundreds of our listeners there now so crowded they doubled their savings guarantee from one hundred fifty to three hundred dollars if they can save me at least we hundred bucks you get everybody back\nNo set up the still just all ... sorts of me right now takes the word ... geo to twenty three twenty three twenty three or go to bill advisor dot com and click start saving fall is on and\nIt was a busy season ahead you want your home to be comfortable that's why you need an atheist furnaces them they can handle the unpredictable system whether\nAmerica's most trusted age back you know\nThe way they live up to Fifteen hundred\nThis mortgage special financing offers with credit\nDeliver detail that useful train dot com that used to see our any dot com defined your independent trained covers especially\nAre you an independent electrical contractor merit shop electrical contractor that is non union you need help with manpower assistance independent electrical contractors association and help you with that you want a an an apprentice program someone to come in and help you with that\nSo you can bring good people into your organization independent electrical contractors can help you with that continuing education for your entire workforce compliance with all the new regulations independent electrical contractors association seven won three eight six nine Nineteen Seventy six\nWe all have some pretty cool friends is a very good friend of mine's on more than other call I got as a friend of mine there is one person we'd really like to be friends with you on a leap\nMy friend of mine Katie R. H. dot com\nThe leaders weather\nFurniture made in America studios this his views radios seven forty Katie R. H. bused in orange radio station [noise]\nThis life is you know it it's life is you know and now live in and have lived it you will have to live once more and the numeral times more and there'll be nothing new in it but every pain and every every joy and every\nThought inside and everything out of a notably small or great in your life will have to return to you all in the same succession and sequence even if this spider and this moonlight between the trees and even this moment and my and I myself eternal hourglass existence is turned upside\nDown again and again and again and you with\nIt speck of dust so when you look at me just concept [noise] you know and you say to yourself\nYou know things are happening over and over again you've seen this mirroring process this darker mirror that we're looking at and whether or not we have a demonic power that is there to steal your government away from you or to take over your government when it's most vulnerable I mean what if this power\nWere were were brought back and you didn't recognize what his power was and the power was beer ads a directive okay some ... or whatever it is a directive to control\nA populace just confused and frightened and what this would do if we look through history which we see that\nA frightened populist divided populace a welt tried and true results come from that all\nThe same succession sequences does other moments in history\nThe times of Hitler's ... Soviet Russia Mao's China and as I talked about many times we argued time dirty war\nSo what if something happened that we treated small uprising or a big surprise me and that uprising turned into full on civil war\nI keep in mind that insurrection combative and revolutionary events in history had small skirmishes before the big ones are up to this is why now we\nShould take a page from history and understand that we're about to witness the return\nOf what would be called the mob or the mob rule or the vigilante justice or perhaps even something a lot worse\nAnd the reason why I said this is because of the fact that a couple of nights ago I did a show called new a new justice no peace\nAnd uh I attempted to point out that ... the traditional way we think of civil war in this country has crowding the fact that we're already\nIn one and while no one will attribute school shootings to pizza gate shootings Las Vegas attacks the symptoms of civil war in progress our leaders both left in writing knowledge that violence will be an inevitability in this country after the after the November election\nPresident Trump warned\nThat there will be violence if the Republican Party loses the November's midterm elections and he stated that the rights of the American people were under threat from violent people and I'm sure he mentioned he did mention that they were on the on the left many people have told me the left or violent Clyde you gotta start talking about how the left or violent yes they are violent\nI've seen it myself here in my own home town I seen it all over the country now this type of rhetoric do the Donald Trump talked about the violence if we don't when\nHe's now being foot noted in being pointed out by the news that you know they basically saying we'll see you see you see he wants violence\nYou see the arguments are such that they can be both ways and extremism\nBecame even more intense after CNN's Christian um and poor sat down with the interview with Hillary Clinton I'll listen to what Christian ... said she talks about\nThe mirror and the black nearing or the dark mirroring and the idea of a vast left wing conspiracy against Donald Trump and listen to what Hillary Clinton's response was\nCayenne Conway the presidential advisor talked about this process and she said it ... left wing conspiracy it echoes what you said about when your husband was being pursued by investigations back in the Nineteen Abbas white right wing conspiracy\nFirst of all your comment on that mirror language and secondly\nDo you have any way even a conservative think who I was speaking of yesterday said the only way to repair America is to try to get back to some divinity and just try to make it even if we have political disagreements we're not going to war with each other we're not trying to destroy each other\nWell certainly I Would love to see us return to civility listening to one another I'm working out are different that is not the Republican Party that exist today and that is certainly not the administration that we have in power right now [noise]\nWhen the Republican Senate\nDenied the right of President Obama to have his nominee for the Supreme Court Merrick Garland a Kurd\nI think anything that they stole a justice from the ...\nI think they did I mean to keep it in the court said open for a year\nOr two denied distinguish Jared they could have voted down they could've said well for ideological reasons philosophical reason that we're not going to vote for him but no they don't ...\nAnd that was such a breach a horn of Africa and the constitutional responsibility of a planet to advise on can harm on nomination [noise]\nThat you cannot be criminal with a political party that wants to destroy what you stand for what you care about that's why I Believe if we are fortunate enough to win back\nHouse band or the people that went to the lady can start again [noise]\nSo she says when we get the Senate back that's who's civility we'll start again but until then civility or instability if you will will not continue\nYou cannot be ... with the political party that wants to destroy what you stand for and what you care about and that's why she said I Believe we're fortunate enough to win back the White House in or the Senate that's when civility can started getting there you have a declaration of civil war and a license for violence\nDonald Trump said violence if the Republicans don't get the vote Hillary Clinton says violence until we get the boat or we we haven't sensibility until we get the votes so\nThe motive of course is getting what you want by any means necessary not not that their vote matters just how much trouble intimidation and instability you can create\nIn order to change the direction of the votes and that's\nThat's very disconcerting and it's on president I mean while while the media will say that Trump's words are to be expected they failed to expound upon the comments she made Hillary Clinton made no one not even her interviewer\nChristian I'm a poor\nCheating stopper and say wait a minute wait a minute are you saying\nYou know civil war would continue or it's really ... I mean she didn't say this is reckless shouldn't say you're fueling the fire you know the fire it's already been started consequences be damned a civil war has to happen in order to take over the ... that's that's what I'm getting from both Hillary Clinton and Donald Trump\nI mean her claim disability can return would Democrats have power is it a mission at the ends justify the meat\nI mean this is at a time when Republicans are being shot stabbed docks beaten mailed a merry mailed rice in powder or run out of restaurants\nSent death threats I mean Hillary Clinton urges Democrats to be even more on civil [noise]\nI mean [noise] what is it [noise]\nI mean I said two nights ago that this is a civil war New York post yesterday said this is these are words the civil war [noise]\nAnd now hearing Hillary Clinton I'm beginning to think well look if they're gonna keep being angry and keep doing these problems up until the the vote and then they changed the boat and then the Republicans get violent [noise] what what are we in\nWhat is it true beliefs except at three thirty seven hundred that's AAA six Seventy three thirty seven hundred will be back [noise]\nNews radio seven forty Katie our age [noise]\n\nPro scouts came to a bunch of games where Lawrence was playing\nTo conceive them a lot of money on ... so he didn't say\nThis your story has a happy ending after all\nThis holiday season impressed everyone who visit your home with brand new made to order custom blinds from blinds dot com\nGet inspired by before and after pictures read reviews and get the latest trends and colors and patterns of blinds dot com and right now you can save up to thirty percent plus take an additional five percent off say why when you use ... code light\nThat's up to thirty percent plus take an additional five percent off say why the blinds dot com blinds dot com criminal code light rules and restrictions apply\nAre you considering a safe to secure your valuables or firearms let's face it seeps are not very attractive they usually end up getting stuck in the garage or in a closet wouldn't it be great if there was a safe that had the look of a beautiful empty so you could display it in your living space as an air a little while also having easy access to it while there is check out the rhino\nLeaning overnight construction zones to be aware of I forty five the Gulf freeway southbound\nAt the ... in South loop also crews working along the doors freeway ... six ten and cross timbers asshole aside to in east bound lock would ban roadwork also schedule on the south and East China to eighty eight\nLike rocks in the Gulf Coast one dose dot com twenty four hour traffic center [noise]\nOne of the shuttle forecasts mostly clear cool overnight lows in a low to mid sixties for tomorrow mostly sunny plan on\nIs only in the lower eighties right down is somebody to clear skies to keep your age west side north side Lexus twenty four hour weather center it is to thirty one in our top story while at least six people\nAre dead from hurricane Michael at its remnants of the storm blew through Florida yesterday and making landfall is a category for hurricane or people died in Florida is gaps and county\nThere were also storm related deaths in northern care in North Carolina and Georgia Michael's moving over Virginia and it's expected to head out to the Atlantic overnight\nPresident Trump met with rapper Kanye West and football legend Jim Brown in the oval office today to discuss a myriad of issues guardian told reporters the president's inspired him an even dropped a few uh of cities while discussing the issues\nAnd the mega millions jackpot is now the ninth largest jackpot in us history officials say ... pot has grown a five hundred and forty million bucks because nobody has one since July twenty four players who by two dollar tickets every long shot at winning with ... being one and over three hundred to ... million\nOr next updated eleven o'clock time now for more of ground zero with Klein Lewis I'm Eric sharp on his radio seven forty Katie our age\nCan come November and that makes us caught in the middle\nTalk about\nNews radio station forty ... G. R. H. this report is rocky or by half price book\nPrice book knows the teachers can ignite the imagination and instill other learning with ever shrinking school budget educators are spending more than ever from their own pockets at price supports educators and encourages you to say thank you for your teacher today ...\n... it's not watch you know it's not you know\nI this is Jerry rental car broke and I spent over two years in Houston making sure\nI personally know every single this car pro certified we're serious about having an outstanding car bang experience and getting special carpet processing then go to corporal usa dot com now for your VIPs certificate to see my friends they deem that greenway bombs\nTo row you live\nYou need to replace your front door your side door you're back door and you want to quality solid wood door you wanna forged iron door\nSouthern front dot com to eight one eight nine oh fifty eight sixty two eight one eight nine oh fifty eight sixty Houston owned and operated family owned and operated southern front not gone front door on the run a country club front door on my house quality doors great people\nSouthern front dot com to eight one eight nine ... fifty eight sixty fall is on and\nWith a busy season ahead you on your home to be comfortable that's why you need an aide in front of them they can handle the unpredictable Houston whether\nAmerica's most trusted age back now right now they would combine rebate them up to Fifteen hundred dollars on call my mortgage federal financing offers with credit\nThey deliver detail is it useful trained dot com that Houston DRA any dot com defined your independent trained covers especially\n[noise] neurotic\nDuring you an angry mob we refuse to be generated by the mob of people know the mob rule I\nCannot be several when they political party that wants to Troy when you're banned for what you care to have that ... we are sports there now [noise] to win back the house and or the Bataclan civility can start again [noise] the people like Ted Cruz getting\nChased out to rent or buy a mom you know\nYou're not going to use the library and hopefully a mom and it was ...\nI don't know whether we're now getting to know\nWhat Mr Trump accused Democrats are using Bob behind\nIt and they said the Democrats are an angry mob brand name Democrats as an angry mob Democrat and the woman bond that law the mom a lot of an angry mob mob\nMob mob mob mob mob mob mob mob mob on the Democratic Bob the mob and the ... part of an angry mob an angry mob fad what about the people who were at\nThe marine corps banging on the wall [noise]\nMajority in the country and\nMade out to be violent and disrupt dead\n[noise] I mean it really wasn't a mom I\nThink the last of the angry while I was just ridiculous\n[noise]\nPrivate protesters and the mob at the fat\nWhite guy the guy down\nAnd it's funny because I Try not\nTo talk of a mob rule and so on I mean look at him have you been to a Trump rally\nDown some of them I think it was hard boiling liberals\nAnd the angry dangerous not actually a tactic that Hitler you when you're dealing with an ideological party\nThat has driven by the left or power that is funded by corporate wind of government that that the bidding [noise] you think the purple [noise] but you can't but they\nYou know my mom\n\n\n\n\n\nI'm quite Lewis Jewish or to ground zero mob rules AAA six seven three thirty seven hundred that's triple a victim injury during some and Andrea\nHillary Clinton said what do you make of what the president said both are saying hey violence either way more incivility don't want to take Hillary Clinton\nOut of context now do I no no she said we cannot be civil and the thing is is that whatever her civil definition is\nI've noticed what disability and instability is in my own home state of Portland, Oregon I I Am at home town of Portland, Oregon I've seen what this whole idea of being in civil meet the means blocking traffic and he's calling people names it means scratching the doors at the Senate during the Kavanaugh hearings it means harassing people that's what it means\nIncivility violence maybe\nTrump said violence he said well you know what's going to happen this this this and this so uh you know I don't know it just seems to be this is what they're talking about and so then when people started commenting about the whole I uh what Hillary Clinton said\nAnd what Donald Trump said basically goes in and says oh we've got to stop this eight hundred people eight hundred sites gone\nAnd then Google turns around leaks a memo and says oh by the way we're not going to shadow certain sites my politics alone we're just going to do it a ... because ... you know we don't want to or we don't want to ruin anybody's but we didn't we don't want to start any fury\nWill just eliminate them by their tone so now it's back to the pot believes it's back to the algorithmic five police again this time it's for your tone it's more how you deliver your message is not about don't it's it's not about what you're delivering but how you deliver it now\nBecause all of a sudden they changed their tune who maybe we are causing some problems maybe we need to kind of settled down a little bit so we don't have a war to go to Robert in Washington\nI Robert on ground zero\nTo acquire a um I read about this algorithm\nAll day that Google has and it's a it's a a ... for the military and they you give your code what job you have in the military and and then\nThe military I mean as we will find you a job but we're the spirit was talking about today I go you know I recall it was a better story if one of them Alex Jones or client list is talking about this Google and I I was at a call ... said yes you call this a can of spray is is\nReally the algorithm or what what what I think about it is that girls gather information all the time but not really for our good but if the if the Chinese have a you know the ... it would be really easy for them to figure out what our forces\nGet full details on the example policy of flood hotel complex commercials or mice can vary depending on your health and human company in fact I remember when I was the\nMessage and to raise ... burning your degree from one of the top business schools in the country might sound impossible to fit into your workload but what if there were a business degree that further your career and give you access to world\nRenowned faculty leaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders\nAnd what if you could earn that degree in his little less sixteen months one hundred percent on line\nTo find out more text prepare to seven nine six four or five\nThat's P. R. E. P. A. R. E. to seven nine six four or five star to your online NBA information\nManagement or business analytics master's program from the W. P. carry school of business at Arizona State university today learn more about the W. P. carry business graduate programs online text prepare to seven nine six four or five\nThat's P. R. E. P. A. R. E. to seven nine six four or five\nDanny Danny ... relocate\nGhettos breakfast is served sugar cereal again that and you are here to switch your cereal it's rained very serious with onyx Oregon a special grain that's better than whole grain of wheat alone\nFor tons plus more antioxidants in any other serial fruits or vegetables ah your kid\nTo look very narrow it down with amazing I mean I think a Corey diamonds\nAnd design the folks I use when I'm buying a gift for my mother or for my wife they do a wonderful job\nAnd they can design for you if you want if it's your thirtieth wedding anniversary\nAnd you have three kids and you want your wife to have you know a stone to represent each of those three children and the grandchildren they can do all of that you will love these folks according diamonds and designed to eight one for a two forty seven fifty five\nThere's healthcare been there as well cared Texan plus well cared Texans last believes in a healthier and more well balanced you that's why we're proud of water Dallas Fort Worth healthcare plans that fit your needs will care Texan plus beyond healthcare a better you learn more and well cared for T. X. dot com\nSouthern front dot com has your front doors you're back doors are solid wood doors your forged iron doors proud to have one on the front door of my house it's a Ford darned or you can see out but it's perfectly safe\nWe have it at the door at the rent a country club we have it at the Wii our door threatened that country club for darn doors are fantastic\nYou need a door southern front dot com Houston owned and operated family owned and operated to eight one eight nine ... fifty eight sixty all your life you're told what to do any trash\nTo get on your and your wife well now it's your turn back time your home town like to plant K. C. R. H. I. hard radio oh you should lose a few pounds oh come on hockey\n[noise]\n\n[noise] [laughter]\nThe dawn in Tennessee I got on your own room [laughter] but I Do the men\nGet in on I'll just watch it if they hear the other like a\nOf anything did not many but history shows that that he had a boat or last night alone I ... and it was going against certain groups\nCertain opposition a boat like eight thirty six or eight thirty a good you compare what the Democratic Party is doing to the Christians are late white males\nThat's going on today could you compare that you know not in a ballot as it is right now I mean the thing going on where you're at and it's you know ... and I was just all and it it can see the parallels\nTo you know I could tell you that now I don't think we're seeing the\nDemocratic Party doing anything not see I'm sure that I'm sure the Democratic party or people who are representing a the the left wing will say that everything the Republicans are doing or not see I mean calling out of Nazi or calling Nazi here and not see there's kind of if God when argument and it certainly dumped tales everything into a soup of not of nothing this and it makes it less effective\nBut I Will tell you that's about all this oil no I Do like let me finish I'll tell you where it's\nGoing well you have a mayor in this town that is corrupt and deserves to be arrested in fact today I came to work wondering how I could organized group to arrest him he needs to be arrested or on many reasons many reasons he's arrested because he is not holding together the rule of law in this in the city not at all ah\nIt it's like you know the same list as right without the violence but we still have the same layer in the ... you know I don't know if he's seen as a solo before last they shut a major bridge going across the river to live as\nWell what we do when we have okay well we have\nGroups that are ah basically blocking traffic a and they're and they're abusing people\nAnd the police look on the police are told not to do anything so their their arms are tied their hands are tied\nWhen it came on the ice when there would be a ice takeover here the icy takeover in ah Oregon\nSame thing happened in fact they were saying that what he did was unconstitutional in and would be a and I think there is somebody actually suing him for what happened there but we also have a governor here is very corrupt she's actually a bear a lot of things that she's doing right now but in my opinion\nUh would would probably born arrest as well for some reason we have two very corrupt leaders\nA mere Portland is a corrupt leader and the mayor in a in a new governor of Oregon and super corrupt and both of\nThem are in power right now and so either they're going to wait it out to the elections but in my opinion [noise] something's got to be done sooner than later and a half and this is why we're in the position we're in right now\nAnd I you know I don't normally I don't normally talk about local politics I leave that up to a guy that I work with the Mars Mars than it was amazing without these conservative very staunch conservative but still you have a handle on Portland politics and a lot of ways\nAnd I keep telling them every day what are you going to do\nTo get people to start talking about arresting our mayor Ted Wheeler and tell him look you don't you don't allow this type of thing a lot of crime to run in this in this in the city and I think that uh you know is being well known across the country now his reputation and what he's doing and what has been happening here in Portland, Oregon\nThey sent me poor prepare for anything\nAnything can happen in anything is happening right now so as I say it's best to be prepared I'm not calling for civil war I'm not asking to run in the streets I'm asking to throw up your hands and scream and yell all I'm saying is be prepared for anything will be back [noise]\n\n[laughter] I'm On banks for closing on how they even have documents that I signed for a home equity loan only what\nShe's the victim of a devastating crime called mortgage fraud\nYour ... title and mortgage are kept on line with these foreign and domestic hack them it's simple they forge your title and borrow every penny of equity you have in your home like this police officer I Know about title fraud so I register with home title walk and discovered some faith had already taken over title\nThank God I found out in time no bank identity theft program or insurance protects you hope title lock will for pennies today hold tight lock puts a barrier around your homes title and mortgage the instant it detects tampering there on it helping to shut down\nFind out if you're already a victim of title fraud get your hundred dollar shirt free with sign up this at home\nTitle lock dot com home title luck dot com\nBusiness can you know in junior high and US Coins and jewelry we would personally like to invite ... listeners to send up one on one confrontations for your gold and silver purchase visit our website at using points dot com and set up an appointment at a time that's best for you [noise]\nUh this is Jimmy burned for Bill advisor dot com if you have a cell phone pay TV electricity Internet her home in auto insurance you really need to listen up because every week bill advisor is winning for hundreds of our listeners there now so crowded they doubled their savings guarantee from one hundred fifty three hundred dollars if they can save me at least three hundred bucks you get everybody back\nNo set up he still does all ... sorts of me right now takes the word go that's geo to twenty three twenty three twenty three or go to bill advisor dot com and click start saving\nThis report is rocky by Walmart have Houston want what's been working behind the scenes to bring you something fresh there's bruising at stores in the area and dumped dating their services getting ready to take your shopping experience to a new level\n[noise]\nThe leaders whether\nFurniture made in America studios this his views radio seven forty Katie our age he used and and I are the radio station\nA rare illness confirmed here and the Houston area I'm Eric sharp it is eleven o'clock news radio seven forty the our age with traffic and other\nWill look at tone will have a hate scale well we'll run the site to the algorithms in the heat scale and we'll see just how it measures up out of it and it turned out that they have it turns out the box thinking algorithms to you have a lot of hate hate speech in your and your Web sites we won't post them\nOnce again the robot determines whether or not you're a racist based on their criteria you don't you're constantly getting these hints\nAbout war civil war and license for violence and the motives of course getting what you want\nHe was demoted\nYou know we want so many people to go out and vote but we don't want certain people to win and if they win will keep being on civil to one another if they if they lose maybe there'll be more violence\n\nAnd of course the media says about Trump when he said about the GOP violence of Georgia wow that three expected you know he's a he's a fear mongering narcissistic blah blah blah blah blah blah you do that anyway but then Hillary Clinton says\nConsequences be damned we need to have instability in Philly\nWell we want\nAnd claim of civility could return when Democrats have power is this measure the ends justify the means\n\nMeanwhile she said this when we got Republicans are being shot stabbed docks be mailed a\nA rice in powder run out of restaurants sent death threats and yet she says\nWe got to be an siblings we get what we want well who's giving the chilling response is right now\nSome guy again or maybe two hundred pound bombs you want to detonate on election day one guy said he was going to do is motives were born in the news Eric Holder's are basically said I'll probably the quote somewhere Eric on the streets we said we need to kick them talking about the Republicans we need to kick them when they're low\n\nThese are words warm\nAnd I know people don't want to know what they want to admit to it but they are so what do we do well you've got to be fighting a civil war which many people were saying I'm doing why don't we take the ... these people are making these statements including President Trump\n\nYou know we we stop blaming the Russians were meddling now we're doing it wide open\n... or there's meddling going on the media is battling Hillary Clinton is battling now Donald Trump says well the that's meddling too\n\nThat's voter manipulation in my opinion is motor manipulation\nRegardless of what you think of your president regards what you'd be able to Clinton back is voter but if you only should\n\nSomeone who just sit down with him and say you know you just did what you about your ... your manipulating the boat Hillary when you said that the ... vote\nI'm sure they don't care\nI'm sure many of you don't care that I'm telling you this because you're thinking well card delivering a card the concerns are are neither I basically telling you what is\n\nIt is what it is\nTo go to Sarah in Oregon Hi Syria Iran ground zero of the day for the heat that do that than the main street [laughter]\n[noise] okay there's one thing you haven't touched on now [noise]\nI'm going to preface this by saying that red\nAs it stands nothing Hillary Clinton said actually suggested violence really early\nIn the opposite of civil is not violent it is rude now I Know that they're being very push ally and dangerously rude but they are being rude nonetheless not violent not yet ... does not have a party ...\nA lot I don't think anybody realized that they don't have a party\nThey don't even have a left right there are a black bloc [noise] okay that I didn't call to talk about any phone [noise] what has been done\nBy Hillary in the service of whoever's\nPutting out lots and all the other thing is a lot more insidious than simply saying we cannot be violent anymore we have to be violent now that's not what she said [noise] ... member that most you you prove this the other night when you did your show that\nMost Americans have no idea what the word civil war me [noise] it does not mean a civil war\nNo not necessarily all means no not necessarily not at all\nCivil means state Sable civil means within the state or city or something else it it means [noise] within state instead of with other states that is what civil war means and that was civility nothing however\nHillary said the exact opposite of go go up the pilots said the civil [noise] what she did no one is realizing is they use of the word civil\nSuggesting exactly the opposite of what she is saying\nShe's calling on all the people who don't understand what civil war means and using that word as I said it's a dog whistle itself settled that you didn't pick up on it wow\nShe all she had it was dropped that word because it confuses too many people and that way she's not saying anything bad she's nine citing any violence she's just saying I'm don't be nice but she's using that word because we don't understand it and it has a lot of connotations\nThat we don't even understand\nBut in that case then she's going to have a backfire on her\nWhen you agree [noise] where do you mean well I mean if she was you know if it was a dog whistle and you've seen or how you know people have acted towards the conservatives you've seen you know like Ted Cruz being harassed I'm not in ... you know\nI'm I'm not sure she knows what she did I'm not sure she goes to cheat I think somebody encouraged her to say that\nWell but it is obviously you got the New York post printing out newspapers said or the owners are going to just declared civil war\nThat's right that Hillary doesn't doesn't a controlled post no the post controls Hillary I'm mia controls Hillary and media controls Trump because the media is controlled by those who wants to civil war and the media doesn't know it\nThe ... he doesn't know what the beast or help doesn't know it to the deeds they basically are you using the media to manipulate civil war and they're using both Trump and Hillary\nAs pawns in in in the whole matrix that's the main you know I yeah I hate the word hate or deep state but yes what you're saying well do you think is real I mean come on we want to call man I got ... ... what they\nWhat are the other term for you beep beep stayed for ... or ... million or does really a darkness or whether we would want to call it\nMy bedroom and we got talking about the big long time ago when my little by this or is it\nOkay well well that was really good point really it really was it'd be it'd be just as scary as what I probably a little bit more intelligent but they're all yet\nBecause it it goes deeper than Trump's Hillary this goes deeper than Democrat Republican this goes Jody we don't know where it's originating\nGoes back to when I said the other night about all the factions want war it's not about right or left [laughter] sorry [laughter] we got to go I Know I got you in it so a guy who took your [laughter]\nTo really six Seventy three thirty seven hundred [laughter] so we do a draw leaves eggs every three thirty seven hundred will be bad\nNews radio seven forty Katie our age\n\nAre you considering are you considering a safe to secure your valuables or firearms much space it seeps are not very attractive they usually end up getting stuck in the garage\nTo run a closet wouldn't it be great if there was a seat that had to look up a beautiful antique so you could displayed in your living space as an ... while also having easy access to it while there is check out the rhino\nIron works safe had rhino safe dot com\nAmerican Made an antique styled our Shapes Our part art part furniture and all security\nAnd if you like the classic look I'm are rhino iron works apes we also read your beautiful matching tool chest and furniture with hundreds of thousands of satisfied customers and a huge network across the U.S we've built our reputation on having the best build best looking and most convenient\nSakes what great service and warranties and you can get on line financing so go with the best\nAnd style convenience security and true peace of mind with rice\nFlorida governor taking a tour of the damage I'm Eric sharpest eleven thirty a news radio seven forty keeps he already strapped again whether together\n[noise] most of it is a long ...\nSouthbound al Franklin street had an earlier crash near\nThat has been cleared traffic his movies well through the area we have some overnight work zones to be aware of the forty five the Gulf free way south ... south loop also I forty five north freeway six ten up the cross timbers should I ten east about their luck would\nI'm like ... twenty four hour traffic center\nForecast mostly clear cool lows in the uh motivated sixties overnight for tomorrow mostly sunny highs and the lower eighties right now Seventy one and clear to keep the outrage west side there were ... twenty four hour weather center to your age do Chinese eleven thirty one our top\nStory Florida's governor touring some of the hardest hit communities\nThat were damaged by hurricane Michael the worst damages in Mexico beach but there's also a lot of damage in Panama City Scott said that more than one thousand people are doing search and rescue operations in the states panhandle region\nRapper Kanye West is staying true to form during his visit to the White House west at least a tirade about a host of issues during his meeting with President Trump in the oval office and even drunk a few obscenity along the way he praised President Trump is being among the group of new be as people who inspire him\nAnd more breast cancer cases are being reported for men who lived or worked near ground zero or am I a Michael a barrage go who represents that all of them tells the New York post the numbers have doubled from Fifteen to thirty in the last month\nOr next updates at midnight I'm Eric sharp news radio seven forty Katie our age\nMid term October baseball politics can have your weather\nInformation station every facet of life youth Radio's seven forty\nThis report is rocky you by half price book's\nPrice book knows the teachers can ignite the imagination and instill a love of learning with ever shrinking school budget educators are spending more than ever from their own pockets half price book supports educators and encourages you to say thank you to a teacher today [noise]\n[noise] Hi this is Jimmy bird for Bill advisor dot com if you have a cell phone ATV electricity Internet her home in auto insurance you really need to listen up because every week bill advisor is winning for hundreds of our listeners there now so committed they doubled their savings guarantee from one hundred fifty to three hundred dollars if they can see me at least we hundred bucks you get everybody back\nNo set up the still just will not unite promotes searched me right now takes the word go that's geo twenty three twenty three twenty three or go to bill advisor dot com and click start saving\nLook above the business that Seventy one of those six maple ridge in Houston and you'll see the United states flag the business just ... like the light poles used in the leader in residential commercial and business legs and banners drawn to\nHear your service and moved to the jump right no matter the size they have a tremendous selection of American Made US flag steal your support for our troops ...\nThree to one Ninety two twenty to log on to ...\nHates Ramon one of the most frustrating things that I've ever experienced is when the roof leaks you think you had somebody come out and did a good job only to find out it's not so good and they don't stand behind\nTheir work and oh yeah they're not local or they don't return your calls all things that will put a company out of business well there's good news spring when quality roofing these guys have been here for forty years that's for decades they will be there when you called them they stand by their work\nFree no obligation estimates too late one for eight zero roof joy one for eight zero roof\n[noise]\nAll about that one word that one yeah I don't do\nLeading question first\nGoogle already knows you're a liberal about the problem\nYour evening when we want to read\nProblem by ... I I I'm Sorry you're\nOn a mountain and those were shattered um [noise]\nReally early on uh on on on our on our honeymoon [noise]\n\n[noise] [noise]\nThem and\nSaying like you're automatically here you're automatically the enemy and [noise]\nI'm quite Louis\nYou are listening to ground zero you know I Hope that [noise]\nHaving this dialogue in demonstrating what is happening here will avoid a civil war or some sort of horrible civil people that's\nThe point of the show tonight because I Want to point out for you how it's done and\nWhat they're doing and this is how it's setting up using react to it the way you want to react to it or you know you can say hey I'm not going to buy into this crap I'm not going to buy into dividing my country allowing you to be conquered by some global is\nYou know infrastructure it's not going to happen it's going to Bradley in Pennsylvania Hi Bradley on ground zero\nIt hey did you you mentioned that you mentioned the holder said about the public in a video pulled up\nA little bit sounds good over the phone yeah we'll do it oh go ahead go ahead [noise]\n[noise] [noise] [noise]\nThat was\nWhen we go low you when when they go low we go high but instead we will they go low we kick them\nYet that's what he said he was at a national he was supporting dual national candidates Stacey Abrams in Stockbridge, Georgia [noise]\nSo okay let me let me a ... there's a clarification I got to read the clarification this is from the Washington Post ready for\nThis so they're saying about what he said uh after holder said when they go low we kick 'em this is one of the Washington Post claimed he then said but he's not advocating anything illicit when I say we you know we kick them I don't mean we do anything inappropriate we don't do anything illegal holder said but we got to be tough\nWe have to fight for the very things that civil rights leaders John Lewis Martin Luther king Whitney Young you know all those folks gave to us so the kinda clarified that because he really is I think what he said\nYou know so there you go the thing about that I think there's there's there's there's idiots cause that all these people have said they stay all these things and that oh wait I didn't but there's a park this crazy is already believe that that is what they're passionate\nWell it's like what Sarah said the dog whistle with the dog was it like you know they say it and like you said the people that are radical here at me leave they go oh yeah\nThat's what we do we keep being a you know getting in people's faces until we when you see they don't say that is what Trump things they oh Trump's advocating violence no this is ... this is something we're not doing but it is it's dog whistling their dog whistling their people to kick them when they're low their dog whistling their people to be an civil until everything\nYou know goes down the way they want it to\nAnd then what happens is immediately both ... and the guys that Google Groups groups there we better we're going to make some ... soon because I think maybe we don't want to be held responsible if there's a civil war so\nBut the thing about that anyone who says Hillary Clinton does not know what she's dealing with I'm Sorry to that woman is called you yeah idiots Hillary Clinton knows one hundred percent ... ... what she is [noise] and there's no one that can convince me otherwise\n... okay friendly things for the call you will\nThe good out of breath in Michigan Hi Brett you're on ground zero try him in [noise]", "show_name": "Ground Zero with Clyde Lewis", "year": "2018", "city": "Houston", "day": "12"}