{"month": "10", "state": "WI", "station": "WOGO", "content": "And it was confident athletic director association\nW O O G o highly Chippewa falls Blair [noise]\nFancy Cady\nOh gee\nRadio news [noise] I Love our country and our country has taken seven seconds\nLook at the laziest and nobody knows it better than\nMe I'm not you know some of the worst deals I've ever seen but we're hearing all of our wealth or money for other countries and then they don't treat us far from where we're protecting feather rich country is very very rich countries including by the way a country that happens to be very much in the new Saudi Arabia [noise]\nImmensely wealthy and we're taking care of the military for a fraction of before not fair to the U.S\nPresident Trump going into a little bit more detail about his comments last night at a Houston rally where he said I'm a national is the one point six billion dollars mega millions jackpot drawing will be tonight at eleven o'clock eastern time and the Dow was down one hundred and twenty five points to close the day at twenty five thousand one Ninety One\nThis is usa radio news\nI folks was when the clocks back sixty years\nFood was different food provided health and nutrition\nAnd using supplements was minimal unfortunately now we have chemicals GMOs herbicides pesticides that can be quite lethal in the name of our food supply and of course the ever loving dollar supplementing our diets can be very important to stay healthy cleansing from daily intruders to the body\nMight be critical live strong and take charge logged on to get the T dot com are herbal tea is a great way to cleanse from intruders when your health is not up to par go to get the T dot com no GMOs no fillers an organic and very helpful in keeping you at the top of your game\nEverybody knows including me that life changed tea is that the that makes you go visit get the T dot com for a limited time and used promo code us hey I'd get free shipping I get the T dot com used promo code USA I get the T dot com\nCould the Catholic Church be considering a huge change for the priesthood here's usa radio networks Chris Barnes\nThe Vatican appears to be laying the groundwork to open formal debate on an issue that has long been taboo opening up the priesthood to married men in at least certain parts of the world where clergy are scares\nPope Francis has convened a meeting of South American bishops next year that will focus on the plight of the church in the Amazon\nA vast territory you served by too few priests during that meeting the question of ... married men of proven virtue so called very pro body is expected to figure on the agenda this week a two hour documentary on Italian TB is also likely to contribute to the conversation\nThe choice priests and love profiles over a dozen men and for European countries who are grappling with the issue in different ways\nPresident Trump will have dinner Tuesday night with senior military leaders this is usa radio news\nLook you've hurt me talking for a year about how much I Love my pillow you can get one to now it's a better deal than ever you go to my pillow dot com click on the buy one get one free special you promote usa you'll get one free pillow when you buy one at regular price plus shipping\nAnd don't forget now you have until march first to return it if you're not absolutely in love with the go to my pillow dot com you promote usa our call one eight hundred nine five one ... one seven five but do it now\nClinton herself will start game one of the world series tonight for the Los Angeles Dodgers ... isn't just one of baseball's best pitchers buddies also someone who's very outspoken about his Christian faith\nOf course all sat down with the IM second dot com which has released over one hundred and twenty five films with over one hundred million collective views of people telling their stories of faith [noise]\nPlaying for the Dodgers and I was just saying it's really amazing traditional prayer I said before I go up there in fact you know knock out you know what I mean whether they're gone you know tell me to go to guy just be with [noise]\nWith all the people in different cultures and different\nKind of just kind of I mean come on you know want to try to keep reminding yourself that you're supposed to stand out and you're supposed to be exposed to act only to point not is\nNot a great conversation starter sometimes\nBut you know it is worth\n... also talks about an orphanage that he plans on opening with his wife and the next year to year and a half to help bring light to people in a part of the world that they don't usually see it no game one of the world series is set to begin here coming up in just a few short minutes for usa radio news I'm Tim Burke\n\nMay have\nHad one of three point one FM whether sponsored by swamp river automotive Ruben Baron will have a first guy the rest of the way most willing to twenty five sunny and forty eight for your Wednesday tomorrow then partly cloudy Wednesday night down to thirty five thirty percent chance of rain in the afternoon Thursday cloudy forty eight fifty percent chance of rain Thursday night whether sponsored by one grave or\nFinancing Cady\nOh gee\nI didn't miss it from ...\nTo go in with another couple of\nMonths just to solve the horrible ministry you and your friends break\nThe site for the results so the puzzles discovered the secrets to mentioned high keeping people is sixty minutes before the guards cook the\nSecond time this get one on one Jews your room and sign up to play and technical escape one oh one dot com\n[noise]\nWe won't allow my right no you're not right he's peanut butter and yes there will be Joe was they hate us because they think that that's not what it is yes you know it's not they hate us\nBecause we as us and what we use doing this terrible they\nCan have good they are saying that because I don't think that's what they said it's a nice coffee shop it don't say it again [noise]\nHe's\nHe's he's gonna hate ... getting aid\nThat is not an actual thing people saying this is what you do ... you just\nFollowing this has been ready to DC for politically correct it mentioned dismayed learn so let's say Larry Elder bay\n\nLarry over here that said from South central the union is Loren I'm at the rate ... don't orange zone welcome to the program no question about because we've got a country to St Louis guaranteed [noise]\n\n[noise]\nSome go ripple\nEight nine seven one S. A. G. E. triple eight nine to them in one Seventy four three marry older relief Becky dot com studio we've been talking about this migrant caravan that according to a Mexican newspaper has now reached fourteen thousand people Van Jones CNN\nI think it's much more likely that Donald Trump is paying for this them for ... to be paying for this is exactly the worst time I think they'd be happening or in a moment like this because what it does is it gives a now they're talking points Donald Trump look at these invading hordes of folks that I Do want to say one thing\nJust because someone is Middle Eastern of course there are no Middle Eastern people there\nBut that doesn't mean that there are bad doesn't mean that there are terrorists how do you know that we were in this world now where Trump can say Middle Eastern and everybody then immediately somehow began to think of terrorists of most of the terrorists that we are it's just that we've had the United states are not being committed by Middle Eastern people by Muslims\nThey being committed by right wing extremists in our own country but I just do this to lie on top of lie on top of lie wrapped up in live and then with life on top of it\nSo we should just let fourteen thousand people come here so and if fourteen thousand more when it comes they can come to\nThis is outrageous\nWhat country would put up with this with Mexico put up with a caravan of fourteen thousand Guatemalans trying to get into their country are you kidding me\n\n[noise] now according to the Washington Post\nQuote for now Mexican police have merely stepped aside as a caravan his past watching first migrants took raft across the river to separate the country from Guatemala and then it continued by foot along the main highway chanting thief a poodle or yes we did get\n\nThe Washington Post continues the response appears to him that response appear to have been conveyed to the White House and now once again Mexico's most important bilateral relationship appears to be on shaky ground okay\nTrump tweeted sadly it looks like Mexico's police and military or aren't able to stop the caravan heading to the southern border of the United states\nFoot office area has great access to Eau Claire Chippewa falls in Lake County\nIncludes do much more for details cassette and went by seven to three one zero three seven or go to W. W. I. B. dot com or tax the word rent to Seventy seven thousand or a link to our website\nHi this is Dave states like I've been with WW IBM W O jewel radio since Nineteen eighty seven in these sales and advertising department\nThe radio ministry is touched\nFamilies are touched couples and such marriages brought home to people and that's really what I'm all about that's what my wife and I are all about working with my advertisers they do get results from advertising on W. W. W. W. O. G. O. radio is still I mean they get you gain that relationships of friendship with\nMany people that don't even go to church [noise]\nYou know and they'll ask me to pray for him to be able to share our base\nMight be with them being pray with them about their knees [noise] that that's an ultimate\nPie as well join day in and sharing the ministry at W. W. I. V. W. O. geo radio we've just open up an opportunity to join our expanding advertising filthy send your resume to sales at W. W. I. B. dot com W. I. B.\nW. O. G. O. is an equal opportunity employer\nMm\nDo\nAnd we've all been in the road but no I'm In a in\nA while going back to the pain relief factor dot coms studios it's the same Larry Elder\nVery I Would like to confer basis in particular the award to Democrat Sherrod\nBrown and at the base when he can see their running for all the and the Ohio Senate race when they asked about the court record and then there are court records proving that brown was a kid that's difficult and then a\nMental abuse by his former wife she feared for her safety and the safety of their children are after voting against Kavanaugh Jerry Brown snap back with a shame on you for you know and I'm just\nMentioning that and and you don't hurt my family\nDribble they mentioned one if you want to where we go to a respected are constantly [noise] you know about those allegations against the senator from Ohio [noise]\nThere's some uh anonymous letter written by a man claiming that Cory Booker had an encounter with him that he did not give permission for [noise] a completely anonymous NO NAME a four page letter now\nIf you want to follow the uh\nFour page letter now if you want to follow\nThe uh Dr Ford scenario somebody makes a allegation NO NAME attached to it which is what what her was at first new cooperation or they may we have an NPR investigation into this allegation against Cory Booker and that would be absurd NO NAME no nothing\nBut this is where we are\n[noise] triple eight nine seven one S. A. G. E. triple eight nine to one Seventy four three Mariel to release factor dot com studio there is a elementary school in Decatur, Georgia the changed their\nBathroom policy they now have a transgender bathroom policy so if a kid feels that he identifies with the woman he can go into the girls restaurant which is exactly what happened when a five year old girl was assaulted by a boy in her restroom here's what a dictator parents about this\nWhen you send your daughter to school you have a level of expectation that you're you're not going to be worried about you know they're not going to be you know exposed to something that you're not aware of as a parent I learned about the transgender policy for my wife she just happened to be on the Facebook page of the superintendent and got windows\nPolicies that there were an acting that was going to uh open bathrooms locker room for teams overnight lodging to both sexes\nAs I mentioned is a transgender policy led to this five year old girl being sexually assaulted but for alliance defending freedom stepping in and helping the parent who knows whether or not they would have even launched an investigation but they finally did now this is the same organization alliance defending freedom represent people like Baron Hill Stutzman\nWho is a florist has been forced to do a floral arrangements for a gay wedding she refused and now it's being\nBeing sought after by the state of Washington and there's been another incident with subject Philips now this time everybody knows what's his values are his views are\nAnd steal someone came in and asking them to bake a cake to celebrate a transgender he refused and now the authorities in Colorado where after him again\nAnd fortunately alliance defending freedom is backing him up\nBut free legal assistant costs money we're asking for your help today\nPlease call eight six six four three five two to five to eight six six four three five two to five to or go to Larry Elder dot com and click on the ATF banner\nRight now or whatever you get will be doubled by a generous benefactor so if you give a hundred it'll be doubled two hundred two hundred four hundred and so forth do this for the kids eight six six four three five two to five to what Larry Elder dot com click on the alliance defending freedom banner\nPresident Trump today in the oval office was asked about Saudi Arabia here's what he said\nYes Mr ... the idea was\nThat when you tell us what you can also or was it a while he was\nPretty rough on Saudi Arabia I Am but I haven't gotten a phone recap as you know I have people in Turkey and I have people in Saudi Arabia and other places and they're all coming back as we speak to have you back of hell no\nI think everything in a very short period of time it's a bad situation but uh certainly president or the one was not complementary of what happened that was a terrible thing that ever get yes ma'am go ahead [noise]\nOr so and\nSee the facts first a look Saudi Arabia has been a really great ally there'd been one of the biggest investors maybe the biggest investor that our country that they are doing hundreds of billions of dollars worth of\nInvestments and you know so many jobs so many jobs thousands and thousands of jobs and if you look at the other side\nIran you look at what they've done to people vicious horrible and that's no excuse for what happened was I had been no excuse whatsoever but do you take a look it's a rough part of the world it's a it's a nasty place it's a nasty part of the world\nBut if what happened happened and if the facts\nCheck out something that's very bad at the same time they have been a very good ally of ours they've been helping us a lot with respect to Israel they've been funding a lot of things uh [noise]\nI Will tell you that Russia\nAnd China would love to have that military order\nI mean I can say it's a Democrat friends do I mean they would love this is a hundred and ten billion dollars worth of military and Russia would pick that up very quickly and China would pick it up very quickly and France would pick it up very quickly France makes a lot of military equipment it's very competitive market\nI did a great job where I told him I that's why I went to Saudi Arabia first I went to Saudi Arabia on the basis that they went by\nHundreds of billions many billions of dollars worth of things and the ultimate number is around four hundred and fifty billion dollars a hundred and ten for military four hundred and fifty billion\nI think that's over a million jobs a million to over a million jobs so we do that which is hurting ourselves\nWe just started ourselves and I know that from\nA certain standpoint you could also say well\nIt doesn't matter because it is a terrible thing but uh we wouldn't be really hurting ourselves would be hurting our companies would be hurting our jobs and uh so we'll see what happens but I should have a pretty good for a couple of seconds I should have a pretty good report very said yes I just thought\nWell I made this point yesterday those who are outraged at Trump's alleged soft response to the death of this Saudi Washington Post journalist or some of the same people that were perfectly OK with Obama signing the Iran deal\nA deal that gave the number one sponsor of terrorism a path to getting a nuclear weapon no problem with that whatsoever sane people yelling and screaming at about the Iraq War claiming that George W. Bush made an error by ... somebody who was serving as a counterweight to Iran\nWhat do you think the Saudis are that\nThey hate each other different religious sects they can't stand each other\nBut we're supposed to completely cut ties with them because of this and there's a\nCaller pointed out earlier today recall what Jimmy Carter did\nTo assist in the toppling of the shah of Iran by demanding that she released these political prisoners basically terrorists into their society how did that work out [noise]\nTriple late night for the one S. H. G. E. AAA Atlanta one to the to forge and come back\nThe scene a pest control spraying chemicals in your home it makes you wonder if they come and go so safe then why do they shoot up and wait and respirators only to leave you to walk back in unprotected\nToday I'm Scott from plug in Pittsburgh and I'm here to tell you there's a better way\nIn an age where we now have the choice to drive electric cars you too can electronically read your home or business of unwanted rodents and pass the answer is plugging past free one hundred percent chemical free plug in Pittsburgh ratio safest bet for your family and pets\nHow best seller plugging in past very pro will cover up to four thousand square feet\nNow that's fed income so audio listed I had to go past free dot com use primary ... saved twenty to twenty percent off plus free shipping and a sixteen day money back guarantee that go past free dot com primary card save twenty nine spraying regret plugging in forget\nGo free dot com today\nIf you are an unhappy timeshare owner getting out of your time shares properly at the top of your to do list Mariel to here and now that's the annual maintenance either coming due you'd probably wish you had a way to get out of that burdensome inexpensive timeshare thankfully my\nFriend the Lone Star transfer can help let them do for you what they've done for seven thousand others in all fifty states\nThey're process has done legally and ethically and best of all quickly Lone Star transfer also has an a plus rating with the better Business Bureau Brian and cheering run a family owned business and will personally make sure that\nYour experience is a pleasant don't let one more year ago by with your maintenance speed skating you and your pocketbook give my friend to call for no obligation consultation at eight three three five nine four O O seven\nSix to eight three three five nine four O O seven six eight three three five nine four O O seven six or online at Lone Star transferred dot com that's Lone Star transfer dot com\nPeople this is our biggest point Johnson Europe\nOkay if you look at the cue for projections news I Know we can make the game in but I Need to hear you say you love me I I [noise]\nSo that's one non than I care will not yet I was extra weight [noise] my name's should I put it in the order tired\nIt's not about the power you sleep it's about the quality of sleep you're getting that's why you need them I below with my below no matter what position you sleep in your head\nNagging shoulders are boarded into line do you get into that the rebels leap faster try ... sixteen ID and if you don't want to get your money back at right now the mogul uh mogul back\nWhen you use criminal code W O G O n my pillow dot com I Won my bill premium get one free with promo go W O G O good in ...\nFor\nMy pillow dot com robo code W\nO O G O sleep better I mean sure his toys don't have any sharp edges telling her what to do when the smoke alarm goes on you know money to keep your giants\nSafe but are you using to write currency for ...\nCar crashes are leading killer of children ages ... to Thirteen [noise] protect your child's future at every stage of life for information on the right seat for your child does it say for ... slashed the right seat\nA message from the national Highway Traffic Safety Administration and the ad council\nWhen it comes to your home why it's all about unlimited streaming stronger connecting marches\nMarking on my side from twenty four seven which are fashion isolation from the first you'll have private here connection with parental control my average every\nCorner of your home cyber fast everything the twenty four seven\nAnd why is it W. W. dot technology together we make it [noise]\n[noise] oh long\n\nAll across America Larry Elder show good morning Mary from Oakland the main threat of the caravan coming into the United states is that these people are not holding their\nImmunization records in their hand immunization history is sketchy at ... at best um need those just was brought into the United states from a child in Israel there's no cases of measles the medical person I feel like this is a real issues\nUm we ... we don't want\nYou don't want me so many things have been wiped out of the United states and the second issue what is happening with I'm Keith Ellison I haven't heard anything about him are still running for um a that position in Minnesota and also a no one's talking about the types of them that since George Soros says oh\nThis is one of the ones that are worth remembering\nThat he's running for in Minnesota in general but the way I Want to think macro service [noise]\nMy brother was a [noise] ... [noise]\nThere's a movie you see before the civil election loses dancing\nThere's this little election and they're there for the nation from most of them up to you to your fire undecided voters to the action\nOf the nation in the wake up call for every American available on DVD ... thirty or forty recovery to do there for the nation movie\nDark comments bare ... movie dot com you don't you wish you a muddy news use an executive with the ... are you union and in two thousand nine after Obama got elected\nHe talked about the desire for comprehensive immigration reform why because two thirds of these immigrants turned voters would likely vote for our quote progress which in which give us the governing coalition for the long haul\n... she she she ... she she she\nShe she she she she ... ... ... ... ...\n... ...\n...\nWhen they voted in November voted overwhelmingly progressive community\n...\nYears ago [noise]\n[noise] which\nWas ...\n...\n... ...\n... ...\n... in Minneapolis Petra malaria will show\nYes Hi actually interested in what the fellow just said\nI'm I'm I'm thinking there that want to see what you think about the strategy like this\nAs far as letting these and a lot of them are young man young adults\nMany many of them maybe even some military I understand some\nAnti government kinds of action in their lives and military action of censored I'm thinking maybe it's possible to let them in and to make them you know say that they can stay\nBut first and we would take care of their medical on their room and board and all that kind of stuff but we were uh they would have to be willing to\nServe six years in the armed services\nMaybe even in Afghanistan might be a nice place for them to\nBe and then most of the military if I'm not mistaken they developed discipline they have a certain set of values and many of them vote Republicans I think it would help the Republican cause\nIf we asked us these men if they wanted to stay at that they would help out the United states by serving in the armed forces for six years the women to serve maybe in the domestic capacity that in a\nOn in the battle line but the men some of them probably had military experience is coming from the places that they've come from and maybe retraining them with the values and all of that that the military has\nAnd turn them into Republicans Len I'm Wondering if they all know that they're going to be having to serve in the army here for six years before they come\nTalk radio six eighty W O O G o Halley Chippewa falls over ...\nWay of saying the\nGenes\nFor usa radio news I'm Wendy king President Trump is seeking his head over the apparent murder of Saudi critic and Washington Post contributor to mark ...\nSomebody really messed up that the worst cover up ever\nAnd word should've stopped is at the deal standpoint whether they thought about it because whoever thought of that idea I think is in big trouble\nAnd should the Saudis faced any consequences in\nOf what we ultimately do I'm going to leave it very much in conjunction with me up to Congress and that means Congress votes\nIn conjunction with me up to Congress and that means Congress both Republicans and Democrats\nSouthern California is bracing for a possible flux of Central American migrants and thousands of people make their way through Mexico there's concern this caravan meat overwhelmed the already stressed out court system and the U.S border you're listening to us say radio news\nHi I'm way dollar route health care in this country is a disaster\nHealth insurance is completely an affordable and it covers very little but there's a better way I Am living proof I joined myself I'm a liberty healthcare member exercise your freedom with liberty hill sheer living healthier as a community of people who voluntarily share one another's medical costs everyone loves liberty a right to come from God that from government\nLiberty believe people should make decisions for themselves and their family members were able to take back the freedom to make their own decisions about their health care you have the freedom to direct your health care not to be dictated to by big government or insurance company bureaucrat stop letting others tell you what to do exercise your freedom joined liberty I'll share\nYou went today there are no windows no limited role in that period no penalties you can join liberty hill shared anytime\nThree hundred sixty five days a year I did my family is a member of liberty so free at eight five five Fifteen liberty for more information that's eight five five Fifteen liberty or online at liberty healthier dot org that liberty hill chair dot org\nThere's a brand new kind of credit score coming UFOs Chris bonds reports\nFight go which created the scores most people are familiar with this new score will consider how you manage your checking in savings accounts along with other financial activity\nAnd they say it could help some people obtain new lines of credit thanks to what's being called the ultra ... score a pilot program will get started next year\nFor usa radio news I'm Chris Barnes\nFormer U.S Supreme Court Justice Sandra Day O'Connor has announced he's withdrawing from public life as she deals with dementia\nIn a public letter released by the court will Conor writes since many people have asked about my current status and activities I Want to be open about these changes and while I'm Still able to share some of my personal thoughts\nO'Connor was the first woman to serve on the Supreme Court he retired in two thousand six he's currently ... years old you are listening to us ... radio news\nWith the recession ending if you've been putting off building your business now is the time to act general steel will meet or beat any price on a pre engineered still building of the same size and specifications act now before steel prices go up so call us today for free information call\nEight hundred nine six five twelve Ninety eight hundred nine six by twelve Ninety eight hundred nine six by one to nine zero\nPresident Trump was in Houston stumping for Senator Ted Cruz with more here's USA's Robin ...\nNobody has helped me more with your tax cuts with your regulation\nAll holding military are bad for the\nPresident Trump fires up the huge crowd at a make America great again rally in Houston for Texas senator conservative Ted Cruz\nTech jobs when\nCruz says Republicans delivering on promises\nElections choices if gun grabbing liberal well the Democrats have given\nMuch of the nation is glad to see decreasing gas prices will has stuck to sixty nine dollars per barrel John Clements has more\nDecreasing oil prices of sent the national average down over four cents a gallon in the last week with the exception of the west coast Patrick John and gas buddy dot com as the national average\nThe national average in the last week has dropped by four point four cents per gallon to about two dollars and eighty four cents a gallon that puts it just one point five cents higher than amongst the lowest it's been since April\nHawaii has the highest average that three eighty seven a gallon of South Carolina the lowest at two fifty five a gallon I'm John Lennon\nFor USAID radio news I'm Wendy king [noise]\nHave\nHad one oh three point one FM whether sponsored by swap river automotive Ruben Baron will have a first guy the rest of the way most falling to twenty five sunny and forty eighth for your Wednesday tomorrow even hardly cloudy Wednesday night down to thirty five thirty percent chance of rain in the afternoon Thursday quality forty eight fifty percent chance of rain Thursday night whether sponsored by one grave or\nSafety\n\n[noise] are you tired of your old lighting fixtures changing involved in trying to find jail paper for your special productions do away with all that has come and see if the speed of sound\nLet us show you the latest in LAPD into your ... your lady had more control color and flexibility while enjoying cost savings and much less maintenance there's the speed of sound on Facebook\nOr stopped by at Twenty one Thirteen ... St Clair or give us a call a three Ninety eight zero to one speed of sound [noise] [noise]\n[noise] why don't read the newspaper because the garbage in garbage are you kidding me we're fighting today for me I'm a man\nWho's been ready to DC for politically correct detention dismay learn so it doesn't say Larry Elder bay\n\nLarry over here the said from South syndrome the print the union bizarre and I'm In great health ... DOMA runs on the program no question about because we've got a country to get her to eat\n[noise]\nSan Diego ripple eight\nNine seven one S. A. G. E. triple eight nine seven one Seventy four three very old released actually dot com studio Michael ... not a good mood this morning\nJudges entered a four point eight five million dollar judgment against Mr ... I'll talk about that later on [noise] we're gonna be talking to Sally pipes of Pacific research Institute\nAbout Bernie Sanders Medicare for all and how up two hundred and fifty million Americans would lose their insurance under this plan Ross going to be talking with congressman Dana Rohrabacher who's in a very difficult race here in California there are about seven races here in California\nThey're considered bi toss ups and many people feel that the road towards either losing or retaining the house goes through California [noise] speaking of which vandals have thrown a giant boulders new representative McCarthy's office window\nAnd the Margaret caravan you're still growing and growing and growing and the Mexican police by what they said are stepping aside and let it grow\nBut first [noise]\nFormer President Obama\nUm [noise]\nForeign President Obama is taking credit for the economic growth and is taking place under this president\nBy the time I left wages were arriving\nOn insurance rate was falling\nPoverty was falling\nAnd that's what I ended up like that [noise]\nSo but when you talk about economic merit goes right now remember who started it [noise]\n[noise]\n\n[noise] what I find interesting about that assertion is it implies\nThat what Trump is doing with the economy is exactly what Obama would be doing with the economy or a Democrat will be doing with the economy really you'd be cutting for regulation for every new one that you are inactive\nReally you would have a gotten is out of the wall street deal with President Trump did really you would have pulled out of the\nAgreement and updated it the way president has\nAre you serious when president\nYou're not that busy just take the kids to school for that night and soccer practice\nAnd band were poor and buy groceries to take the dog to the vet put gas in the car grab dry cleaning go to the dentist but you're not busy\nHoney the Carney tired you can take this job tomorrow right when\nYou need tires but not another thing to do call PSI mobile tire the tire shop that comes to you car truck or SUV home office wherever you may be called PSI mobile tire\nEconomy furniture inch of all of that\nSo last June gym but the betting John envy you don't have to wait for me the median\nEveryday low rise of the best friend's day is and we finance it in history and the two of\nUs in Nineteen fifty economy voter me [noise]\n[noise]\nDo do do do do do do we do\nGo all the Larry Elder show now with eight eighty nine seven one say eight eight eight nine seven one seven to force the rain in Eldorado slim Larry know what's on your mind there\nYou go in and you're off the wrong Ronald ... rather than I Am the higher up a little bit larger group of people that go out and find out who's paying as the people in the caravan to do what they're doing\nStop calling that ... that some of the nation from Latin America that what it is at mob dance from my shower Obama am wrong because they're the ones that started it\nThere's other people either ... or Guatemalan Mexicans coming through a ... it's even from Bangladesh David Caroline they get over there somehow\nAnd enjoying this caravan than it does really bad we have a lot we need legal immigrants they no longer a country where any immigrants\nCome in they have to be background check it happened to be legal for lazy elaborate on that\nFebruary that caravan the heading this way for the border needs to stop and I understand sympathy\nAnd all that that is one of the big tools doesn't the Democratic party uses to try to push forward the answer to a progressive liberal agenda to overthrow our country but you must treat the caravan\nAs an invading army and uh so they could be five or ten thousand what happened when it gets many thousand and then those people are harmed once they get here [noise] I'm seriously they need to be the opposite of military needs to stop them or the United states\nNeeds to put it splits down and say no more you can come in under our rules or you don't\nCome in at all various stories I Want to learn\nWhen you look suspicious ... through often mixes\nAAA nice living one as a page a triple a nine to one Seventy four three very overly affected\nAre constantly on them as we were talking about this caravan of ... into the fall allergies can cause many of us to feel stuffy and even lose our voices from time to time but if parents lost legal voices and the ongoing\nThis from time to time but if parents lost legal voices in the ongoing march to force politically fashionable things like transgender bathroom policies on their children to elementary schools that's exactly what happened last year in Decatur, Georgia\nAnd but for life defending freedom stepping in who knows what might have happened [noise] listen to this Decatur, Georgia father\nYou send your daughter to school you have a level of expectation that you're you're not going to be worried about not they're not going to be you know expose this fucking that you're not aware of as a parent I learned about the transgender policy [noise] from my wife she just happened to be on the front page of the superintendent and got windows\nPolicies that there were an acting that we're going to uh open bathrooms locker room for two\nOvernight lodging to both sexes\nNow tragically a that transgender bathroom policy that his father in Decatur, Georgia was talking about lead to a five year old kindergarten student being sexually assaulted in her girls restroom\n\nBy a boy who claimed that because of his orientation he should be in her bathroom\nThis can happen in Decatur, Georgia it can happen in your child's school\nBut alliance defending freedom standing with parents nationwide offering free legal help protect their rights but free to them is not without cost\nFor asking for your health today so that the alliance defending freedom can continue to do what they do\nPlease call eight six six four three five two to five to or go to Larry Elder dot com and click on the ATF banner as the caller said yesterday she went online and found out that the Southern Poverty Law Center calls ATF a hate group are you kidding\nPlease eight six six four three five two to five to or go to Larry Elder dot com and click on the ATF banner we've got a generous donor who's matching every single\nDonor\nSo your two hundred dollar donation becomes four hundred dollars you're five hundred dollar donation becomes a thousand dollars and so forth but whatever you can give please do so eight six six four three five two to five to or go to Larry Elder dot com and you'll see the alliance defending freedom banner at the very top thank you so much [noise] Jorge\nRamos is defending the Mexican caravan the micro Tara banks use me\nMaybe they're only talking to people who speak English yes of course I've talked to some of them will have been deported but the majority of those days I started on his thousand meals on this I thought when I saw somebody else I was telling us also needles and you\nKnow not that might be in in the United states before so some of them yes helping deported without my daughter you know a month and something really important I Need that so you were taking their word for it above my area of these people are not criminals\nBy the way it wasn't Jorge Ramos in the country illegally for a period of time Mr McConnell I think he was for a while or or I think it's unclear there he's got dual citizenship now but I think there was a period of time when he was in the country illegally or could be wrong about that but I'll check it out no terrorists and they're not even immigrants they're active on that likely to be wrong which is why I said it but I'll check it out\nRefugees an asset nation in the United states we have to choose what kind of nation we are\nAnd treat them with respect to we we cannot pre Josh than we can say all of them are are criminals hall of fame I read is that is not truth or what we have to do is to listen to them here that cases and they just sort of political asylum then run it to them\n[noise]\nOh the Washington Post is saying about the ... I was thinking about Fox just what the Washington Post to say which is scary enough headline Margaret caravan could prompt a wider confrontation between Mexico and the United states quote for\nNow Mexican police have merely stepped aside as a caravan has passed watching first as migrants took rats across the river that separates the country from Guatemala and then as a continued by foot along the main highway chanting thief a poodle or yes we did\n\nQuote riot police have stopped to pose for pictures in their gear as it ready to combat the migrants letting international TV crews film them before retreating\n\nMexico's incoming foreign minister said Monday on Mexican Radio that it would be a big mistake for the Mexican government to use its own armed forces to try to stop the caravan it would be miserable and Mexico to use the army against these people we would not be an agreement with that at all and he does not believe that the government is considering that step\nThe\nPresident of Mexico Pena Nieto talked about the caravan on friday said quote Mexico does not allow people to enter our territory illegally and much less so violently\nClose quote what does that mean\nThe Washington Post continues quote that day on the bridge connecting Mexico and Guatemala Mexican police fired tear gas at the migrants closing the official border at film crews and photographers\nCaptured their actions but just next to the bridge police watched as thousands of migrants crossed the border illegally by raft settling in for the night\nIn the main plaza of the ... border city Ciudad\nBulldog all\nOn Sunday there was another test ... police officers were in riot gear had it for the ... the former barricade\nWe're here to enforce the laws and Mexico one officer said you can't just pass through without permission but when the markets approach the checkpoint officer played it for them to apply for legal status in Mexico when they did they stepped aside and let them through\nBottles several migrants yelled as they walked with a police checkpoint the police did not stop them instead officer through their riot shields in a bus and drove away the caravan continued undeterred into ... this is the Washington Post triple late night for the one S. H. G. E. on Larry Elder don't leave town\nKidding me\nWhen I talk to sell a pipe about the Medicare for all planned in just a few minutes here is what Julie said about released after\nI'm an artist and I'm In my studio I've got pain in my neck and it's getting worse I'm hearing ads about really factor and I'm thinking well I'm going to go ahead and order this two weeks later and I've got much better range of motion I'm able to carry these big campuses around and\nPut stuff away and pick stuff up and move it around very very grateful that I gave the product to try to keep it in my purse I keep it in my studio\nNow if you're having difficulty just doing normal things why then I mean rolling over in bed at night without pain bending over time your shoe without pain playing catch with your grandson without pain\nIf that sounds like you\nAnd maybe just maybe you might be able to do something about your information also known as the silent killer\nTried the freeway quick story it's only Nineteen donors in Ninety five cent Ninety five cents a day for pain relief and eighty percent of the people who buy buy it again relief factor dot com released actor dot com that's released factor dot com\nLive in the pain free release actors awesome video is a safe\nIf you're like most people and you see two gas stations and one ... gas for a little bit less you go to that one it just makes sense every little bit helps but here's what's weird though sometimes we save a few pennies here and there and ignore opportunities to save\nHuge money life changing money if you switch to a met his share for your health care it could be massive savings for you the typical savings for a family is five hundred dollars a month\nI think what you could do that over time just\nDoing the math of six thousand dollars a year that\nThe significant and yes people love it and they love it because it works it's believers who share each other's healthcare costs more than four hundred thousand people are now members of Medicare and it's growing like crazy fight on how much you could save\nAnd why men is shared is so popular go to med a shared dot com or call aid for for forty seven Bible that's eight four four forty seven Bible miniature dot com or aid for for forty seven Bible\nThat covers we cook our butter burgers pretty much the\nSame as you would at home only are three cut blend of fresh Midwest before this is Daniel need to master our signature press in Syria checking you may want to practice a few thousand times\nHad real Wisconsin cheese top with a lightly butter toasted buns and serve yourself with a big warned smile better yet come to Congress and leave the whole cooked order butter burgers thing to us welcome to delicious\nTasty treats where every season and always surf Russia for oh clearing Chippewa falls called birds [noise]\nInjury keeping you on the bench maybe you've been out of the game for years says bounce back and you're still with chip ... valley orthopedics in sports medicine doctor John drove her doctor toy Bergen Dr Ross Perot specialize in minimally invasive are suffering shoulder surgery doing what it takes to get you back in the game the active\nWith tip for valley orthopedics than sports medicine ... and ... says ovaries locations throughout western Wisconsin your\nWindow like any of the only game to work with a couple of times per month to get your kids wouldn't be wild about getting a ride to school when you feel like I'm doing to treat your body's how's that way it is a year round in Denver and the chip wouldn't alley family YMCA is here to help the why in the book there is fitness center open seven days a week we didn't get\nTo the gym waiting room cardio room are tragic thing is my personal training yoga and much more membership rape her among the lowest in the gym well not only did he say to the gym alley family YMCA and chip\nWhat laws just like everywhere else in the valley the seasons are changing a choice in fourth and that means it's truck see before the nineties arrive it's a great time to save on a twenty eight days now through months then would discounts in fact\nYour rebate you can save eleven thousand six hundred and fifty six dollars on a two thousand Eighteen Ford F. one fifty ... percent for sixteen months plus two thousand dollars on a two thousand Eighteen for ads with approved credits now is a great time to save but just outline of choices for dot com or stopping anytime a toy support and Chippewa falls\n\n[laughter]\n\n\n\nWelcome back to the Larry Elder show\nBy Larry this is Matt from Sun City or in regards to the situation of Saudi Arabia I Would just like to remind us all that demi Carter had some things that he objected to with the shah of Iran and so we took our support away from the shah and Iran fell and\nThousands maybe hundreds of thousands of people have died ah Iran is becoming a nuclear power with vowing to a fight or whether this has helped Korea and all that stuff\nThat we want to go into that again and I'd also like to remind us that we we're allies with the Soviet Union and World War two and maybe if we had moved them maybe we were the last that war and we'd be ... in German right now banks\nI Hope that if there is some\nFor long hair and that is ... ... for a lie and all it will survive ... this is why I feel like there will be that let's say within the lack of long term but not for economic and oil and ... sales\nI'm really for all her all the facility that Saudi Arabia provides or one of ... volatile reasons in the entire world and there's no one else I call over fiber law how Iran when that side of it is sort of sat her\nHeart or even straight from the United states will probably away the ... we would really see power scale in favor of on hold on\nTo believe and I said in one if you you mentioned the one Seventy four three from the oval office they talked about Saudi Arabia and what response he's going to have to murder of this Washington Post columnist more on that later on\nThis is an issue here about more than any other one is hitting pocket books with American families horror that's the outrageous costs to prescription drugs in a poll conducted by Frank once he got an earful words like greed gouging unfair\nDrugs in a poll conducted by Frank\nOnce you got an earful words like ... unfair kept coming up there were lots and lots of questions why does the cost of drugs to keep going up on your way to say about that\nWhy do people in Canada pay forty percent listen and medical was the whole system ... answered the big drug makers spend a lot of money to protect their process over a hundred and Seventy one million dollars to be fair but there's been lobbying American politicians was answer too and that's us\nWe want solutions to prescription drug prices before to building want them now it's time the whole drug makers accountable and put patients at a profit but they have their lobbyists and there are hundreds of millions of dollars but we have our voices are stories of all let's do something about this my next guest\nIs the president and chief executive officer resources to San Francisco based think tank founded back in Nineteen Seventy nine please welcome back to the program so we sell me how you doing\nI'm well thank you very how're you\nDoing great I'm Sally a Bernie Sanders wants to Medicare for all can you give us your analysis of what this would do\n[noise] yes it would be a complete disaster as if you know Larry I'm Canadian I grew up in Canada under a single payer\nI started a publication back in Nineteen eighty eight\nI'm I'm waiting to return a guide to waiting lists the average Canadian family um wait\nTwenty one point two weeks from thing a primary care doctor to getting treatment by specialist Bernie Sanders want the Canadian health care system as he said Medicare for all the time has come he wants the Canadian system but even more he wants to add vision care free drugs\nAnd um and and and and free dish and care and and um you know of course he he has a bill before the Senate which had sixteen co sponsors for whom wants to become president and of course he never talks about what it would cost and how it would be paid for\nBy the Charles ... center said thirty two trillion dollars over ten years\nAll private coverage under his plan Larry would be outlawed and you know a hundred and sixty million Americans have employer sponsored insurance and the polls show they like it they would all lose their coverage immediately and we would all be\nLike people in the u._k. under the national health service Canada under Medicare system the on waiting list or care would be rationed and our taxes would have to be increased significantly\nSo how would why why does a Medicare for all seem to test so well among Democrats\nWell I think you know Bernie started this back in twenty sixteen I'm Single payer has been around for Medicare for all for a long time but only in twenty sixteen when he was running against Hillary\nFor the Democratic presidential nomination he brought out his first single payer plan you know telling nightmare can people that would be free and they would have the best healthcare and all and so\nYou know the mainstream media picks up on this and plays it over and over again that you know who wouldn't want something that's free but as I say he never talked about how it would be paid for and how much it would cost and so and then he has of course is um new young sidekick Alexandria Ocasio Cortez\n... member of a democratic socialist with America she is going around with Bernie telling candidates you know promoting candidates who support single payer and so it's really a being a very big move to the left for the Democratic party and I think we're going to see in this midterm election on November six\nAre these candidates who are running to the left Ben Jealous or for governor of Maryland this I'm Andrew Gillum who is running against um [noise] the scientist for the governorship in Florida\nYou're listening to Michael that that show on western Wisconsin ... six eighty W. O. G. L. lake Halle ...\nUsa radio news President Trump on Wednesday called the potential explosive devices that were delivered to high profile democratic figures and the CNN studios in New York despicable accidents or the full force of the U.S government was conducting a major federal investigation the president also said\nDisagree just conduct is abhorrent to everything we hold dear and sacred as Americans we're extremely angry upset unhappy about what we would this this morning and we will get to the bottom of\nPolice say to people who have been killed in a shooting at a grocery store on the outskirts of Louisville, Kentucky police chief Sam Rogers told reporters that the suspect entered the store encountered demand fired multiple shots at him and left the suspect then encountered a woman in the parking lot and shot her as well\nBoth victims are pronounced dead at the scene Rogers couldn't speak to a motive and the shootings appear to be random you're listening to us a radio news\nAnd I'm Brandt so there's this guy didn't Jordan either healthy guy he's a dad of six and he works as a guide in Alaska and he goes to the doctor a true story goes to the doctor and he was diagnosed with cancer stage four\nAnd here's the thing he had switched earlier for medical insurance tremendous year where Christians share each other's medical bills so the question for Jordan and his wife Jenny was is this actually going to work our medical bills\nExceeded a hundred and sixty thousand dollars Medicare members shared all our bells\nAnd it was about more than just the money to this is a real community\nMedicare is is a family a group of people that stick with you through the hardest times of your life I just don't know how I could have done it without measure\nIt's worth looking into there's a reason is is growing so fast off if you want to find out more here is a number for you\nEight five five Ninety ... five five Ninety P. S. A. L. M.\nNBC News host Megan Kelly is apologizing for what she said about black face in usa radio networks Chris Barnes has the details\nMegan Kelly made the comments in a Tuesday segment\nChris Barnes has the details\nMegan Kelly made the comments in a Tuesday segment of Megan Kelly today and they immediately drew widespread criticism on social media here's a portion of them\nIt's really you do get in trouble if you are a white person who puts on or a black person that puts on weight when a kid that was okay as long as you're addressing other character\nThe network later releasing an email written by Kelly who says that she now realizes quote that such behavior is indeed wrong and that she's sorry\nHurricane Wilma was downgraded to a tropical storm no it is continuing to move across Mexico when we'll head up through Texas and the east coast eventually turning into a nor'easter this weekend and bringing rain and possibly even snow to parts of the northeast you're listening to us a radio news\nThe following up they just were drivers will pay too much for car insurance due to a DUI speed W. i.s tickets or anything else our company specializes in low cost us our twenty two auto insurance we know that mistakes happen and offered free quotes for very affordable auto insurance Mitt specifically for you the over paying high risk driver\nThe coaches free and we'll handle the filing so you could start saving money called eight hundred seven fifty eight oh seven twenty five\nEight hundred seven fifty eight oh seven twenty five\nEight hundred seven fifty eight oh seven twenty five\nOne of the big issues in the two thousand Eighteen midterm elections is pre existing conditions in pretty much every state Democrats are running ads that say Republicans voted against covering preexisting conditions\nBut is that the real story I had a chance to chat with Hadley heath manning she's the director of policy for the independent women's forum and the first question I asked her was if these ads are being truthful\nWell it's not and that's one of the biggest misperceptions about the repeal and replace effort and twenty seven ... made a lot of effort to try to include\nThose protections for people with preexisting conditions namely the Affordable CARE Act made it impossible for insurance companies to deny coverage or charge higher premiums on the basis of pre existing conditions and a lot of those protections we're going to remain in the law so that he would actually be pretty stop in terms of their\nYou know actual repeal of that portion and if you look at the polling seven and ten Americans think it's very important to keep those protections\nAre so I think the political pressures in her main on the G O P\nI keep those protections in place but I Hope that the yuppie we'll revisit the issue and really lead on it rather than simply you know racing the framework that the ... will lead in place\nThere better ways to protect people with preexisting conditions number of people with preexisting conditions that actually based barriers to coverage is a lot smaller than you know what the Obama administration had been saying that there's there's simply a better solution to this\nFor us in radio news I'm Tim ...\nDeath we can all get in and be to the members of the NFC see the national foundation for credit counseling can help you put dead in its place\nCredit cards changing my financial like and and it's the the credit counselor how we can tacking control I can charge it my\nStudent loans to follow me wherever I went in a sci fi financial advocate taught me all I needed to know mass to my students that\nWe want to deny our first home and weren't sure if we were mortgage ready Iran is the the housing counselor does make a plan we're on a path to our first home\nNFC team member agencies serve all fifty states in Puerto Rico convenient helpful knowledgeable nonprofit financial advocates there for you we put that in any place\nTo be one of five million people to be done by twenty twenty connect with an FCC certified credit counselor at your local member agency today the NFC\nC. dot org slash stopped it or call eight seven seven for one zero six three to to\n[noise]\nUh I I I understand they lost\nAll although\nAlthough I don't\nJust don't that don't just don't just [noise] do they just started\nYelling [noise]\nServed so so so so I wanted to sit down to a lesser [noise]\n\nJust say those are the feeling most people get when they are brought about his wife I felt this growing up my leg I well I don't have that too often\nDo you tell me what you're doing all the weeks has been ready to DC for politically correct detention dismayed learn something he said he held back\n...\nLarry over here the said from South central the union or in the ... the Marines are welcome to the program because we've got a credit to St Louis guaranteed\n[noise]\nLet me go\nDown and then they may be willing to\nSee if\nI still have to figure out a nickname for myself I think Larry stole most of them uh I I don't know maybe how about the rock of the rock and Roll Hall of fame so maybe something like that the rock and rock and roll capital that is that I wouldn't use that I'm going to build that in in into it in for why the heck not Merida\nBrands where they live from be pain free really factor dot com studios in forging one of the answer\nYes or no higher why oh why oh why oh indeed thanks for joining us\nAre sitting in for the ... from South central I see a ton of people are on hold I'll give you as quickly as I can at eight eight eight nine seven one stage that Tripoli nine seven\nOne seven to for three but I Want to have a conversation now a with a good friend who has a new book out and uh who is pulling no punches he does not pull punches in his writing\nHe does not pull punches when he writes columns for a town hall ... senior columnist there and he does not pull punches in interviews he also does not pull punches on Twitter and he got a lot to say which made me sick cooks liquor author of military normal\nRegular Americans over\nReclaim our democracy joined me on the one reality show\nAnd he said let's do this thing are good to have you back my man how are you [noise]\nHey man of great to be here\nBut I I there's so much ground to cover I Would like to do the pleasant trees and everything else I Want to talk about your book but I wanted to talk about all of these issues going on Tucson diving right in do you buy\nThe right wing pipe bomb conspiracy or with all of these things being center Soros Obama's Clinton's and CNN because trying weeks two weeks before the election Kurt I Do not buy it for one second national false flags being plan to go ahead\nI think it is more likely than not a right wing conservative outlier doing this work a it is one of three things at the right wing conservative outlier it is a nut who was a political and just wacky\nOr ... is uh someone uh allied with a lap attempting to do exactly what's happening now which is a conservative suburb violent Bob guys um\nExactly what's happening now which is a conservative suburb violent Bob guys um if you look at the evidence\nAnd save up to thirty percent promotion is going to look so good on you find out more about Marcos management services and get a free printing assessment Marco net dot com that's Marco net dot com [noise]\nIf you want to live longer you don't need to take every day when you exercise\nAnd get your sleep and just like your body your car performs best one needs properly cared for by courtesy auto in trucks\nCenter ASC certified pros who explain what your vehicle needs with their prices and free service loners plus quickly services on Saturday requested appointment courtesy auto in truck dot com and help your car live longer Curtis the auto insurance and just off highway twenty nine for\nThose guys going through that case you can't be fine national pediatric handler became playmates framing and smiled in most cities or possession carrying office handles the counting down the gays in there\nAnd they only pediatric dentistry two additional years a specialized training beyond dental school the are excited to see children at age one location and simple falls both Blair and rice lake stop in and check out smiles emotion pediatric dentistry genes [noise]\nCall in now and join the conversation eight eight eight nine seven one saying that a a nine seven on seven to foreign setting fire to the heroine\n[noise] and once again to offer and sitting in for Larry Elder on this Wednesday the twenty fourth of October the clock is still chicken counting the days remaining in the campaign to help alliance defending freedom\nAs we end of the final phase of this fundraising Dr we asked about friend who's ATF some vice president for public relations about the greatest satisfaction he he he and his team get from working\nAt alliance defending freedom getting\nTo know our clients jak Philips\nBurials stuff's been achieved Cochran in Atlanta and innocent in Kentucky uh they're standing up for everybody's freedom\nAnd they could have made it easy choice and just gone along with what the government was telling them to do and a compromise and their beliefs and they were not willing to do that uh I just get a great amount of satisfaction knowing each day that we get to stand along a and B offend\nPeople like that because what they're doing a is an example in protects all of us\nNow or a life defending freedoms mission of course is to provide free first class legal services to victims of discrimination based on their religious beliefs and without listeners light you there would be no ATF\nWe exist because of the tax\nDeductible donations that people like your listeners provide us and\nRight now there's a donor a friend of ATF who's willing to double match every gift is given during this campaign there's not that much time left in Raleigh fifty percent goal so at a gifted a hundred dollars two hundred dollars a thousand dollars right now will help alliance defending freedom defend your listeners freedom\nAnd provide the funds that are critical to fighting the battles for our most fundamental freedoms\nWas this is your turn to step up and joined this campaign we're asking for your help it eight six six four three five twenty to fifty to what Larry Elder dot com click on the ATF better every gifted aid doubles so your generous donation will go even farther thanks to that generous Matt from the ATF benefactor whatever you can give call eight six six foot\nFive twenty to fifty two or go online to Larry Elder dot com do it today do right now so you'll forget click on the alliance defending freedom batter and thank you for helping support our friends in ATF who are fighting for your individual freedom every day\nI Want to continue in our church slipped through the author of militant normal get it now on Amazon how regular Americans are rebelling against the elites to reclaim our democracy\nKurt our democracy are are Republican technically is under attack right now by about fourteen thousand illegal aliens to be who are steam rolling up from Central America through Mexico to our southern border the left says open the gate open the doors let them in their searching for a better life\nThey need asylum they need protection etcetera\nThey have no earthly idea of what one Donald Trump's election your or they cutting their own throats by supporting this thing is we had to the midterms\nOh I think it's ... it's a famous hat and fatty we talked about the last segment when they went over a voter who work in Haiti holders bark and one back right who didn't vote I don't understand the voters\nAre and they're proud to be American and they're not worth and they're not what I'm often they're African ancestors happened to come to find\nThe simple fact is they understand that you can't hear fourteen thousand corner coming to work harder and demanded the wedding and\nThey understand that you can't hear fourteen thousand corners coming to our border and demanded to lead in\nA ... and then just jump on the welfare gravy train which is clearly the desire for many of them\nAre not going to work and I think I think the fact that the that the liberal media having a chance to continue focusing on this that they chose to focus on a this is the bombing\nAnd that tells me that they understand it's a loser now have you heard\nAbout having or any other cats the characters since the ... not a word because ... and they they they ... they were sticking their hand on the on the stove top again with the caravan and I think I think we're at the same thing with the bottom you're going to overplay their hand\nAnd they're going to alienate the very people they need you know everybody says you know the Democrats were allowed to look inside themselves and and figure out where they're going so they can appeal to the American people but the as my book Milton normal available on Amazon\nIt teaches you can't do that because liberal leaders them\nYou know secular religion\nThey can't look at themselves and say it's been a cardiology is wrong these prejudices are bad we need to change these things it's all based on there a moral superiority and they can't question that and they won't and that's why they're going to lose two weeks from now\n[noise] perched lecture is my guest the author of militants normal she's a senior column town hall dot Tommy is also an attorney in Los Angeles California\nUh occurred I Want to hit the nationalism part of the story as well just to earn them choose me two nights ago in Houston, Texas a stumping for Ted Cruz in his race against ... or ... percent of a president said this\nWe're not supposed to use that word you know what I Am a nationalist sub [noise]\nCourse immediately you heard of Jim Acosta jumped up and said wait a minute yeah what did what did what job that's now Jim Acosta this gym as opposed to just to follow up on your comments about being a nationalist there is a concern that you were sending coded language for a dog whistle\nTo some Americans out there that what you really mean is that you're a white nationalist I'm no I don't know how you get white nationalist not asking list but what I mean honestly it's like he's playing the Google auto fill you started to type in the word Lazarus do you mean white nationalist and the left is going crazy ever since occurred makes a lot of water\nI first of all I Love it when Democrats take sides against Americans who say I love America more than other countries you free to hold back position going into the electric don't let me stop you go right ahead you won't be in that prior\nAn effort that you're really mean white nationalist there is a concern in white nationalist okay that's not true there is no concern meeting among really stupid people but the concern comes from liars\nOkay so you weren't either an idiot or do you worry liar or maybe boat you but we ... if you're starting there there's no other option because it's demonstrably ball and one that\nYou know you have a normal Americans won't you know I I like America I was in the jail I was in the air force for five years you know before I came home and I thought that hurts day and ... well I I I liked America I I'm proud of the American and they're telling me that makes me a racist\nI don't think I'm going to trust them with my vote ... or their wires normal militant normalcy just\nRegular Americans anyone who is ever so caller brought this up to me and my morning show this morning and said anybody has ever reciting the pledge of allegiance is reciting I'm a nationalist I Am pledging allegiance to this flag of this country\nNot to the un not to the rest of the world to this flag that means this is where my allegiance lives that's nationalism how did that become a dirty word\nBut look I don't know like when I when I uh first and lift and then became an officer in the army and I want to seven years right and\nI was not you know my my goal is to defend the United states of America yeah I I work with allies\nAnd are protected or and people are because that was in America's interest to do that with what my ... the the electric president ordered me to do and I did it gladly and proudly ... but I did it you know the war on my shoulder was the American why\nExactly that's what you fought for and that's the contribute to represent and that's the country that Donald Trump represents and he made that very clear as I pointed out before when he um a pulled us out of the Paris climate accord and said I'm worried about the people of Pittsburgh not Paris\nThat's nationalism and that's patriotism the book is militant normal regular Americans are rebelling against the lead to reclaim our democracy by ... get it now the militant normal ... thank you my friend [noise]\nMuch more coming up to ... marry older [noise]\nThe way you get your medicine prescriptions is now changing across America go go ... dot com can deliver your medicine right to your door here's all you need to do your doctor gives you a prescription you\nYour medicine right to your door here's all you need to do your doctor gives you a prescription you go online to go go ... dot com\nWithin your information and make sure to include the promo code Mike twenty eight dean to save ten dollars up to your first prescription your meds are then delivered to your home and you've saved money it's that easy no more waiting no lines no co pay each month and best of all\nKnow wandering around the store aimlessly waiting for your prescription to be filled go go med dot com the new way to get your medicine delivered right to your door remembered that giving your prescription bill now means never having to go to a store again\nGo go med dot com do go ... term use the ... go to Mike twenty Eighteen to save ten dollars up your first prescription that go go ... dot com Romo code Mike do zero one eight\nIt was shocking to me that the government would try to take away my freedom\nWhen he was my\nThat's jak Philips a masterpiece cake shop in Colorado who was sued for living out his religious beliefs\nAlliance defending freedom took his case all the way to the United States Supreme court which recently gave jak up big victory but apparently that when wasn't enough for the Colorado government because it is harassing him again yes you heard that right\nThis time we are taking the fight to the government you know we can't do this without your help right now your gifts of one hundred dollars will help jak an alliance defending freedom in this crucial fight against the hospital\nCalled eight six six four three five twenty to fifty to that eight six six four three five twenty to fifty two if it can happen to Jack it can happen to you or any of that values religious freedom collies six six more three five twenty to fifty two or flick on the alliance defending freedom banner ads Larry Elder dot com\nYou're not that busy just take the kids to school after that night and soccer practice and\nBand were poor and buy groceries to take the dog to the vet put Japanese car grab dry cleaning go to the dentist but you're not busy\nHoney the Carney tired you can take a job tomorrow right\nWhen you need tires but not another thing to do call PSI mobile tire the tire shop that comes to you our trucker SUVs home office wherever you may be called PSI mobile tire\nEconomy furniture that\nGym but\nEnvy you don't have to wait for the median\nPrices on the brand names and we find ended in history of\nNineteen fifty for me\nWhen you're thinking about a high visibility easy to find out if they are your business consider the communication center on business highway safety three ... right now WWE id down in jail for rent what's going on at the conference\nRoom and reception area this version more two thousand square foot off hysteria has great access to all Clair Chippewa falls in Lake County includes so much more ... said I went by seven to three one zero three seven or go to W. W. I. B. dot com or ... the word rent to Seventy seven thousand for a link to our website\nIf you could go back no not that far but what about\nThe auto in trucks in his body shop their commitments to the latest repair technology means that after an accident they will restore your vehicle was factory conditions for up your hands they\n[noise]\nYou can go back to sell your insurance company you want the best sell them you want the collision repair rose that Curtis the auto wouldn't truck center just off highway twenty nine in the door [noise]\nJust then young man [noise]\n[noise]\n\nThe\nAmerica countries [noise]\nThat is exactly what we're doing as we continue live from the pain free willy factor outcome studios and fourteen twenty the\nAnswer in Cleveland, Ohio this evening wherever you might be listening sixty minutes before the top of the hour\nTop brand sitting in for Larry Elder you know for many of you approaching or in retirement age there's no more important issues in your health care the candidates on the left are talking about one thing Medicare for all what does that mean\nYour Medicare is under attack your Medicare program you and millions of Americans paid into would be open to all Americans which is just Democrats run once again to socialize medicine right now over Seventy Democrats have their names on a bill that would turn Medicare into a single payer system European style\nAnd a bill by Bernie Sanders has the support of one third of Senate Democrats in his program kids would be enrolled at birth\nThese bills won't just change Medicare will destroy it the great massive rationing regimes a massive tax increase through your Medicare is on the ballot this November and only you can stop this golden don't touch my Medicare dot com now\nAnd take the a Mac pledge to bring a senior to the polls don't let them turn Medicare into Bernie care built you don't touch my Medicare dot com right now\nI Want to play this because I Want to make it very very clear when I was talking to coach looked er about us the left has condemned and criticized President Trump for his response to the um explosive devices or they could be would be might be explosive devices that have been sent\nTo a series of prominent Democrats from Brock Obama's household to it we didn't get to the court in the house it was addressed and it was in a nearby area but it never did get delivered but to the Clintons and ...\nTo the home of George Soros to CNN and more recently we just found out that something similar was sent to Maxine Waters well naturally as conservatives do we um we condemn these types of actions we condemn immediately any political violence committed on anybody's behalf and we don't even know who did it\nWe have no idea who was responsible for this but we condemn it unconditionally and that's what the president of the United states that Tibet\nIs agree just conduct is abhorrent to everything we hold dear and sacred as Americans my administration will provide additional updates as they become available and I just want to thank everybody for their understanding [noise]\nWere extremely angry upset unhappy about what we what this this morning and we will get to the bottom of it we will get\nTo the bottom of it and the president pledges we will find you and that is exactly what I Believe is going to happen in the meantime speculation as to who or what is behind all of this is all the left pass and there are blaming Republicans they're blaming President Trump\nNancy Pelosi and Chuck Schumer issued a joint statement saying that time and time again the president has condones physical violence number one we have no ice\nThe president has condones physical violence number\nOne we have no idea who is doing this number two we have no idea what their political ideology is maybe they don't even like the president number three how hypocritical is it\nFor the left leaders like below sea and Schumer\nWho have sat by in silence not condemning the calls for violence and intimidation and harassment expressed by their own members of their own party like Cory Booker like job Maxine Waters like Hillary Clinton herself\nOver and over and over again in current like Eric Holder kick up a like a Tim Kaine former vice presidential candidate take this fight to the streets\nThey're encouraging physical confrontations every day they do not disavow those physical threats\nThey do not just about anti was actual assault on people and now they're claiming that it's Trump who is condone physical violence in his responsible for these are potentially explosive devices being sent a prominent Democrats I don't buy a word of it\nLet's go to Houston, Texas will you're on the Larry Elder show it's Bob brand sitting in for will go running or for a Larry rather go right ahead\n[laughter] I have a friend and I do but I'm good I'm ...\nCook a couple of things man you know ... from from the words of Robin manual you never let a good something along the lines of you know let a good crisis go to waste right and and ... you know we see that with these these Democrats man and and they were or are trying to\nSlap to blame or on Trump for there's like you said we don't even know you know who who is on what their ideology is or anything I'm a ... a couple of quick things and I'm trying to try to get in a lot real quick you know the the the media man is is\nThe media and the lift in general they have made themselves ... the word police you know they tried to", "show_name": "Larry Elder Show", "year": "2018", "city": "Hallie", "day": "24"}