{"month": "10", "state": "WI", "station": "WOGO", "content": "You saw it on the Web at wild river sport dot com [noise]\nTalk radio six eighty W O O G o Halley Chippewa falls over ...\nSafety\n\nUSA radio news hurricane Michael made landfall in the Florida Panhandle on Wednesday the category for hurricane packed winds of one hundred and fifty five miles an hour Republican governor Rick Scott a Florida said now is the time for Floridians to come together\nFollowing the storm we must all come together and work together during disasters ... take care of each other we saw this after I mean Matthew Irma and Maria stories are strong earnings are resilient we will recover and will do it together Florida is unbreakable will get through this together hurricane Michael cannot break Florida\nThe last eight hundred and thirty one points to close a day at twenty five thousand five Ninety eight some people are attributing that to the raising interest rates President Trump before his rally tonight in Erie, Pennsylvania I\nYou're listening to us a radio news balance of nature's fruits and veggies in a capsule\nOr was diagnosed with congestive heart failure I went from being able to work\nFor ... hours a day with no problems or where it can barely walk and walk to the store or went on to the photo nutrients about six months ago and within a couple of months my medical doctor has dropped my prescriptions down in the U.S a little bit smaller dosage the next time I went back a month later I walked into the doctor's office and he says my gosh what's happened to you\nYou don't even look like the same person they looked at my legs on this roll and go and um my blood pressure was I'm living in a space is alters that I had on my legs for last four or five years because of the poor circulation role healed and I'm feeling for better\nWhen you called used discount code USA and we'll take thirty five percent off your first month shorter and ship it to your free call eight hundred two four six eight seven fifty one that's one eight hundred two four six eight\nSeven five one or go on line to balance a major dot com and used discount code usa\nA former big city mayor and possible presidential contender switches parties again usa radio networks Chris Barnes has more on the story\nFormer New York city Mayor Mike Bloomberg announcing on Instagram on Wednesday morning he's officially a Democrat again Bloomberg was elected twice as New York mayor as a Republican starting in two thousand and one before them becoming an independent for his third term as Mayor Bloomberg's latest move is widely seen as a prelude\nTo possibly running for the White House in twenty twenty to try to unseat President Trump's\nFor usa radio news on Chris Barnes\nNo one wanted the sixth largest mega millions jackpot drawing in history last night lottery officials say the prize reached over four hundred and Seventy million dollars but with no winning tickets estimated drawing for friday night will be five hundred and forty eight million dollars\nWith the cash option of just over three hundred and nine million dollars the Powerball jackpot for tonight is two hundred and eighty two million dollars as well this is usa radio news\nI've been telling you for a year how great my pillow is well guess what there is a great deal on my pillow dot com you can get four pillows about the price of one my pillow click on the four packs for when you go to my pillow dot com and our political usa\nYou'll get to my pillow premium pillows and to go anywhere pillows perfect for travel\nFor half up go to my pillow dot com click on the poor pack special ... usa but do it now\nPresident Trump directed the EPA to craft a regulation that would allow for sales of IV Fifteen year round it's currently prohibited in only available during the summer months due to air pollution and concerns department of agriculture secretary Sonny Perdue on what this means\nHe committed to protect the IRS asked the renewable fuel standard which provides for that that all the years that clean burning fuel giving customers more choices and that's what he's doing he's wanted to do this rarely frankly for several months what do you want to balance out the needs of the smaller refineries as well\nUh Georgia man says he had the police called him last weekend because he was beat W. B. babysitting while black usa radio networks Chris Barnes has that story that's crazy I Know in\nKorea Lewis runs a youth mentor program in ... county and he was babysitting too white children on Saturday ages six and ten friends of the family when a woman came up to him at Walmart and wanted to talk to the kids and said she was calling the police the woman later following them around and right into his neighborhood when an officer did show up\nI got to get them babies and we ate a subway or Walmart when guys some guys before that fucking about some probably lives okay\nThis from a video that Louis made when the cop showed up\nPlease assist lanes officer who is a Lewis is please\nThe children telling the cop that Lewis is a friend of the family and the children's parents confirmed it later in the day for usa radio news I'm Chris barns for usa radio news I'm Tim Burke\n[noise] one of those three point one FM six eighty am Wu whether brought you buy one grave or automotive group in there and we'll have about a thirty percent chance of rain the rest of the way lows will fall eventually I'm thirty six during the overnight with a breathing west southwest wind around ten to Fifteen\nThursday a slight chance of rain in the morning before ATM cloudy tomorrow the high forty west wins around Fifteen and then finally partly sunny forty two Saturday partly sunny forty nine whether Bronx you buy one grave or in Baron\nMom for some working wife I down\nOn my homework\nWait I've got to get this email sent if your wife by isn't everything your family needs to be twenty four seven in West Wisconsin telecom offers smart home why the signal to secure a strong and guaranteed form where you\nNeeded most visit W W T dot net for more information\nThat W. W. dot net twenty four seven in ... Wisconsin telecom life technology together we make it work\n[noise]\nSo what is your name [noise] I'm about ... Washington [noise] [noise] are you hearing from next door for [noise] for\nThe following who's been ready to DC or politically correct pay attention dismayed learns that said Mary held their base\n\nLarry over here that said from South in from the beginning of the union bizarre in common than ... dome neurons are welcome to the program don't make the Clinton allow because we've got a country to St Louis guaranteed [noise]\n\nSon go\nTriple eight nine Seventy one S. H. G. E. triple late nights them wants them to for three Larry Elder relief Becker dot com studio\n[noise] man\nA CNN panel has written off Kanye West as a\nQuote dumb negro close quote [noise] isn't that kind of a ...\nWhoops dumb negro close quote [noise] isn't that kind of a slur [noise]\nWow [noise]\nMostly something about hurricane Michael slammed in Florida as a category for storm just a little bit short two miles per hour short of being called a category five as of late afternoon the winds had dropped to a category three\nSo far one death has been linked to a storm authorities say a Florida Panhandle man was killed by falling tree that question to his home in Greensboro\nWill keep you updated triple eight nine seven one is a G. E. Kanye West of come out in favor of a President Trump is going to have a meeting and you're trying to arrange a meeting between Trump and Colin Kaepernick here's what happened on CNN\n[laughter] or maybe looked at it you know that All right maybe it'll work there well I don't know [laughter]\nAnd I were in the black community within black folks are about to train Kanye West and the racial draft okay they've had it with him he's not\nThat well although I Do I Do know that reference I Know that that is an old Dave Chappelle skit I Know [laughter] All right good luck going [laughter] wow\n\nSuch laughter they love to ridicule people's intelligence Larry Elder a colleague of mine who happens to be black I think it's only relevant because we're talking about racism here doesn't think Trump is only racism the CNN analysis interesting on black was will mean that he is aware and it doesn't mean that he is smart\nBut when a Donald Trump suggest Maxine Waters at a low IQ course he's racist\nBut Don Lemon can say that I'm not very smart and ... and ritual the intelligence of Kanye West\nProblem that we can only do that if we elect people who are going to back our agenda and fight for our values and that is why we have to defeat Nancy Pelosi [noise]\n\nAnd [noise] Maxine Waters a very low I Do individual\nMany people that don't even go to church\nYou know and they'll ask me to pray for him to be able to share our face\nMy face with them to be able to pray with him about her knees [noise] that that's an ultimate pie as well\nJoin Dave and sharing the ministry at W. W. I. V. W. O. geo radio we just open up an opportunity to join our expanding advertising sales team send your resume to sales at W. W. I. D. dot com ... W. I. D.\nW. O. G. O. is an equal opportunity employer\nWhen you're thinking about a high visibility easy to find office space for your business consider the communication center on business highway did see three one twenty four across some farm asleep\nRight now W. W. W. O. J. all have space for rent which for kind it off as a conference room and reception area this version more two thousand square foot office area has great access to all Clair Chippewa falls in Lake County\nIncludes so much more for details costs seven ... seven to three one zero three seven or go to W. W. I. B. dot com or text word rent to Seventy seven thousand for a link to our website\n[noise] Jew [noise] don't make it\nGo get a\nCall we're now in joining the conversation eight eight eight nine seven one stage that eight eight eight nine seven on seven to for three to setting fire to the airwaves it's very older show\nYeah Larry Page and you know we're taking these you know from a girl's here there are a lot of money or or not because of things over if she doesn't them for for a boy and then let's be known them that's got a horse humorous buffets um Dolly management and then I get into voting you know with with with the\nRest of the Democrats and that could end up with three more\nRepublican Senate seats that can November Donnelly voted against [noise]\nKevin [noise] most house voted against having all the Manson mentioned voted in favor of a\nDoctor for a temp at it that her recollection of the attack was that the second place in therapy sometime prior to the twenty sixth one presidential campaign Donald Trump probably a list of his pick for possible Supreme Court nominee Brett Kavanaugh name on it I'm Wondering why doc Ford\nCome forward if when that last was made public or at least after Trump was elected president had Kavanaugh removed from the less than one wonder how politically what doesn't it\nTriple eight nine Seventy one\nHow politically safe and what doesn't\nTriple eight nine Seventy one GE AAA country wants them to for three Larry older released after respected are calm studio [noise]\nNow for those of you who've stepped up to join me and supporting a minus defending freedom I really want to\nThank you [laughter] even talking about alliance defending freedom now for about two weeks [noise] and I'm trying to raise money for them [noise]\nI Will tell you that my expectations have not been reached so far you guys always rise to the occasion though [noise] let me tell you why I so strongly support this organization did offend people like Jack Philips the man who runs the masterpiece kick shop in Colorado for free\nI've interviewed jak Sacramento and I said ... what would have happened in a life defending freedom that come along he says I don't know I Would have probably had to close down I wouldn't have been able to ... to afford\nMy defense and keep in mind this case litigated all the way up to the Supreme Court that is extremely expensive\nAnd you can help right now with your generous gift every single donation you make today will be double by special matching grant right now one of the cases involves a man named Kelvin Cochran he used the Atlanta fire chief lost his job why she wrote a Bible study on his off duty hours got fired she said\nI Would gladly lay down my life in service to save another life because that's what firefighters do the one thing we should not have to sacrifice\nIs our God given freedoms the freedom of speech and the freedom of religion these freedoms for which so many in our nation's sacrifice suffered and died we shouldn't be forced to surrender\nAnd look at the pounding alliance defending freedom is getting the Southern Poverty Law Center has designated them as a hate group why he's what the\nSouthern Poverty leadership Law Center says on his website about the ATF they quote work to develop religious liberty legislation in case law that would allow the denial of goods and services to algae B. T. people on the basis of religion calls for old my goodness\nOh the humanity the idea that they would develop legislation that says if you're somebody who believes in traditional marriage you cannot be forced if you're a Baker to bake a cake for gay wedding\nStop the madness help alliance defending freedom help people like chief Cochran if people actually eight six six four three five two to five to\nAnd again today every gift you make will be ... double by ... spiritual matching grant eight six six four three five two to five to or go to Larry Elder dot com and click on the banner that reads I Want to defend religious freedom\nEight six six four three five two to five to eight six six four three five two to five to ... thank you so much\nFear Tucker Carlson and his guest is saves are Vargas using illegal alien who was employed by the New York times he's now described as a former illegal alien\nTwenty two million people a lot of people are you still forgiving\nAnd he's talking about the study that says no it's not all of them point three than everybody quote the euro studies says there at least twenty two million illegal aliens in this country for more than what we're told\nTwenty two million people a lot of people are you still for giving them all citizenship\nTucker thanks so much for having me happy and they do people stay up before we get to the politics of the issue unless you get three kilometers falling on that first\nAh ... let's make sure that the researchers clearly said that this is not an assumption oh implication that there's an outburst of undocumented immigrants here in the U.S second thing is based on a very basic principle they said that they take in consideration the initial population plus everyone who comes in\nPlus everyone who leave ... points directly to what they\nWant to say namely that\nIs a shadowy population and obviously we're not going to tell everyone so there's definitely an account and three most importantly is simply\nThe Saturday Night I needed to be OK equipment and then on his way sold ... million so let's understand the rebels who will be ... stop please I sign on politics I read this study\nIt's pretty clear they're the first people to look at the systematically and are far more than eleven million people in this country illegally the largest margin in the history of presidential elections in this country Nineteen eighty four was about Seventeen million\nSo they're more illegal aliens and there are voters who made the difference in the biggest blow out an American presidential history you're following me here with the math ... definitive so here I just want to know really quick if they're twenty two million twenty four million twenty million you want to give all of them citizenship and voting rights are you still for that you'll absolutely\nNo way to look at the economy was doing really well three point seven unemployment rate for point to economic growth if we want to be able to do even better look if we had twenty two million I'm not the immigrant oh now we're doing pretty well economically so I say ... to citizenship that didn't\nMake sure we will have it even better ... let's just talk a lot now what I saw that and so they're not paying\nWeight on your conceding that they're not paying taxes now I thought having talked to many times your argument always was they're paying into the system more than they're taking out which I suddenly ... than a week or more taxes will ... will not wait wait wait\nCitizens don't pay more taxes\nEverybody who works pays\nPays our tax rate so you're conceding that a lot of these people edition of break our immigration are breaking our tax law\nAnd they're using fake IDs I said there is an hour oh he'll let him million undocumented workers that didn't pay taxes\nThe eleven million on back and I thought they were the only way to pay taxes I said more taxes so if there is more than what we're dealing is plan and then let it let them pay more there is\nNot ... on the show because it doesn't even make any sense at all I certainly ... eleven million on that immigrants with what they're singing let let the ... eleven million pay taxes no\nVery simple math I'm not saying anything complicate it on and then they don't want to say your point is that illegal aliens are great they're better than us\nThey pay their full tax share okay you've always always said that you're going to twenty times on my show I'd say now you're saying well if we if we give them the vote they'll pay more taxes what doesn't even make that here's the bottom line I just want to hear was to understand what the agenda of lunatics like us I mean with all respect that I liked it personally but you're saying\nLunatics like you and I made it with all due respect [laughter]\nTwenty two million brand new voters\nIn our electorate okay out of nowhere here legally now they all get to vote that Ninety percent of we're going to vote for the Democrats [noise] what you're saying is that one political party all the hammer law on natural lectures forever [noise]\nAAA mentioned one F. A. G. AAA nice it once before we come back a union official at MIT immigration reform is about [noise]\nCan trash on the intellect of Kanye West it is so not a problem\n[noise] policy genius is about insurance you see life insurance it's really important but a third of people don't have it just because it's really hard to buy you have to work out what you need to do the research to make sure you get the best quote and hope you don't get\nRipped off along the way not a good way to shop for anything\nPolicy genius however has made the whole process a whole lot simpler policy genius compares quotes from the top life insurance companies to find the best policy for you it takes about two minutes to get a quote\nYou don't know the first thing about insurance they got all the tools you need to get up to speed learn the difference between term and whole life calculate how much current unique coverage on the east and you'll be sure you're making the right decision over four million people have used policy genius to shop for insurance\nIt doesn't just make life insurance easy they also compare disability home insurance auto insurance if you care about it they can cover it so whether you know a lot about life insurance and nothing at all start to research and policy genius dot com takes two minutes policy junior dot com the easy way to compare and by life insurance policy genius dot com\nLarry we'll be right back [noise] pick\nOne atom of nitrogen and bonded with one atom of oxygen boom you just created nitric oxide a miracle Monaco your own body makes the fuels your cardiovascular health keeping you vibrant but as we all age our bodies need help generating more natural nitric oxide super beach by human has heart is the power nutrient rich beats\nAnd created a super food that helps your body make more nitric oxide on its own\nThe core philosophy of human is to develop heart healthy products for your body one teaspoon just one teaspoon of super beach daily support your cardiovascular health and blood pressure levels giving\nYou natural energy without the need of a quick caffeine chick or sugar high that is why I take repeats every single day I have high blood pressure issues and it helps keep my blood pressure down we're talking real healthy natural energy\nEight hundred nine nine six thirty four oh six or go to elderly dot com and find out how you can get a free thirty days supply of super beach and free shipping with your first\nPurchase filled the one plus one equals boom affect the super ... called eight hundred nine nine six\nThirty four to six or go to elderly obese dot com today\nYour local volunteer fire department routinely answers the call whether it be a fire in traffic accidents forecast stuck in a tree foot because of declined and memberships departments have become understand\nYour local volunteer fire department desperately needs you can you direct traffic so smoke alarm health at a fundraiser matter what skills you have you can make a difference you don't have to fight fire to be a volunteer who will you answer\nThe call for more information you can help visits a volunteer firefighter alliance have support via the debt Oregon\nAnd the weather turns colder it's easy to forget to exercise movement but if you want to be fit and healthy next summer you've got to put in the time it's the same way with your long standard operation from Reno ways is with the added benefit of news the broadcasts will keep your lungs looking great even after a long Wisconsin winter\nReno waste a variation allows for the new seed water and nutrients to penetrate deeper into belief system which allows different varieties of rats to be added to your last keeping deter healthy strong and resilient see green oasis dot C. O. schedule your ration over seeding service today\nThe best talk radio wind up in the valley is heard right here I W O G O Hugh Hewitt Laura Ingram Dennis Prager Dave Ramsey Michael met that Larry Elder and Mike Gallagher make up the best talk radio line up in the ... but the most fun informed way to start your day don't miss ...\nFive day weekend mornings I W O G ... Laura Ingraham most listened to a woman and all of talk radio comes you're away from a so eleven weekday morning incredibly why is it and you're actually independent Dennis ... takes you through the day from eleven to why\nAmerica's most trusted voice on money Dave Ramsey assert live weekdays from one to three on W. O. G. L.\nThe cultural crusader Michael met that guy just through discussions on politics in pop culture weekday sort of three to six from six to nine week nights at this age from South central Larry Elder fallen\nFrom nine to ... by the happy conservative or you're might Gallagher talk radio wind up in the ... valley is her ... year I W O G O ... am six eighty and double T O G o dies house [noise]\n\nMm [noise]\nWelcome back to the standard that comes through to you if let's say to Larry Elder [noise] let\nMe see I was busy trying to corral the homeless people in Oakland Larry Oakland, California to move into her new ... newly opened the middle of the step to caught\nTwo windows to light and they're\nIn close thankful and\nShe was doing that she forgot than the men though to all of the gang bangers or down in ... when that were rent that many many guns were uncovered\nAnd many illicit drugs where we covered a complete set a fine job she was not able to send them the memo that sells for coming [noise]\nLindsey Graham done off another of your lines from the old days\nHere for the first grade [noise] ah this is what you get when you go to a dollar or something somebody Jay borrow\nIt didn't go over so well in a twenty Eighteen what were you thinking when you heard of\nThat [noise] I don't know you know I said a lot of things about life of ...\nOr that you know you know I said a lot of things about life of a joke I was tracking the joke was actually about ... hours and [noise] I don't think said Dr ... board strikes me as a kind of [noise] a little bit of difference whether that of a different deal yeah you know [noise]\nBut it's not always I'm always complimented before use some glad that you started growing up in the house and for him and they always like to have a lot to say as long as\nThey have\nMore people on the wall and they they want to keep themselves in that they want to cheat or to special interests you just time for us as Democrats to be as tough as they are to be as dedicated as they are to be committed to sail\nMichele always ask them all over you know my wife like really tight um which will scare me of raw [laughter] she always says you know when they go low we go low we can [noise]\n\nAAA sign some one S. H. G. tripling once in a two for three different just didn't believe that the dot com studio [noise] what's in the water up in Portland a journalist was talking about these left wing protests and says the cops literally are not doing anything just letting them do it\nSome of the footage showed was recorded over the weekend on Saturday by Brendan Farley\nAnd I was a protests organized by don't shoot Portland which has a black lives matter a type of group they were protesting the police involved shootings of a man who is a specter of shooting to people\nAnd um well the police here um take a pretty hands off approach much of the time with protesters and ah what you saw on Saturday and the video is a\nDemonstrated us we're allowed to take over a strange in downtown Portland and direct traffic and threaten drivers stopped tropic while the police slow song from a block away because they were afraid of offending flaming situation\nAs mentioned Tanya west has come out in favor of President Trump you know the Nike ad about common ... believe in something even if it\nMeans you're losing everything who do you think has more to lose Colin Kaepernick or Kanye West\nAnd ... has been called a token Nick ruin a dumb negro by the panelists on CNN Don limited called him that the rocky sellers a democratic strategist Kanye West is quote what happens when the girls don't read\nAnd of course he's been called a novel Tom\nLeads to the White House he's been terrific guy you know he loves what we're doing for African American jobs for somebody to snoop\nDogg called him an Uncle Tom you different things median income as you see that at all time high poverty\nWhich is a level at the fast rate meaning the lowest grade\nTicking time from his uh important work is being a game show host\nSo far as ... is a smart guy joker wild\nAnd he sees that and also coming what that means that you might have I bring Jim Brown big brown would even make it a lot of money today right he was ... I called him unstoppable\nGym rats that is a friend of mine he's been really with us because he gets he really gets it he sees a African\nAmerican and by the white Hispanics and Asians have never done better his his gun and he likes it\nHe also praised Senator Graham I'll tell you what Lindsey really stepped up over the last two or three weeks I thought it was fantastic so uh when I was on a first name basis with disease a popular guy Jim is a popular guy I think goes to people and Nikki doesn't have that in mind\nThat ah\nHe is somebody that never asked that question I think he's very happy where he is he's having a good time and it really sets it up he's doing great\nWhat about your bunker to take the place of Nikki Haley as UN ambassador\n[noise] W O O G o highly Chippewa falls old Blair\nJane Jamie\n[noise]\nFor usa radio news I'm Wendy king hurricane Michael\n... in the Florida Panhandle whipping one hundred and fifty five miles per hour winds National Weather service director Lewis ... so it's still a dangerous category ... storm on route to Georgia\nWe still have hurricane force winds gray circulation system moving towards a southwest Georgia is very dangerous\nAgriculture in Georgia is in jeopardy with high winds and sledding farmers could lose their entire crop most of which is spreading for harvest Florida governor Rick\nCould lose their entire crop most of which is spreading for harvest Florida governor Rick Scott says search and rescue crews are out looking to assist people wherever they can\nOr they're they're very aggressive and write down these teams are getting out there to to assess the damage and and and to provide any resources anybody needs\nAt least one death has been reported nearly four hundred thousand homes and businesses are without power\nYou're listening to us ... radio news\nI folks was when the clocks back sixty years food was different\nFood provided health and nutrition and using supplements was minimal unfortunately now\nWe have chemicals GMOs herbicides pesticides that can be quite Liesl in the name of our food supply and of course the ever loving dollar supplementing our diets can be very important to stay healthy cleansing from daily intruders to the body might be critical\nLive strong and take charge a lot on to get the T dot com are herbal tea is a great way to Clinton's from intruders when your health is not up to par go to get the T dot com no GMOs no fillers and organic and very helpful in keeping you at the top of your game\nEverybody knows including me that life changed the is the tea that makes you go visit get the T dot com for a limited time and use promo code you as hey I'd get free shipping I get the T dot com use promo code USA I get the pie dot com\nThe pope compares abortion to hiring a hit man with more here's usa radio networks Chris Barnes\nPope Francis delivering his weekly address at St Peter's Square tells worshipers quote getting rid of a human being is like resorting to a contract killer to solve a problem the positive also said parents\nShould not consider rejecting sick kids and complained that when parents discovered during pregnancy that their child's affected by disease they too often receive hasty advice to terminate the pregnancy\nA corner has concluded that Dylan Thomas the Georgia high school linebacker died late last month through the cardiac arrests caused by a head injury\nThomas was pronounced dead at a hospital on September thirtieth two days after he was injured during a friday night football game Amazon facing backlash from longtime warehouse workers who say it's Fifteen dollar an hour minimum wage for new employees won't benefit them\nWell now get a bigger pay raise themselves the company announced Wednesday they would be paying employees already making Fifteen dollars an hour an extra dollar twenty\nFive this is usa radio news but bundling up they just were drivers will pay too much for car insurance due to a DUI C. W. i.s tickets or anything else our company specializes in low cost us our twenty two auto insurance we know that mistakes happen\nAnd offered free quotes for very affordable auto insurance Mitt specifically for you the over paying high risk driver the quote just free and we'll handle the filing so you could start saving money called eight hundred seven fifty eight oh seven twenty five\nEight hundred seven fifty eight oh seven twenty five\nEight hundred seven fifty eight oh seven twenty five\nLike California Oregon and Washington and many other states Canada has now decided to cash in on the lucrative cash crop usa radio networks Chris Barnes has more on this story\nOn October seventeenth Canada will become the second and largest country with a legal national marijuana marketplace Uruguay launched legal sales last year after several years of planning it it's a profound social shifted in candidate promised by the prime minister Justin Trudeau\nAnd fueled by a desire to bring the black market there\nInto well regulated taxed system after nearly a century or prohibition\nFor usa radio news on cruise Barnes\nPresident Trump has signed in ... right to know prices that that will lower the cost for the estimated sixty percent of all America ... ... prescriptions\nWith more here's John Clements\nIn addition to the number of all Americans taking prescriptions you can also include Ninety percent of all seniors\nWho spend as much as three hundred and forty billion including forty five billion out of pocket year up until designing pharmacies were not allowed to jump patients about the best prescription pressures President Trump says progress is being made for all Americans using prescription\nTremendous progress has been met where we're making very obvious progress and you can see it is we are reducing prescription drugs and the cost of prescription drugs\nI'm John Clemens for USAID radio news I'm Wendy king\n[noise] one of those three point one FM six eighty am whether brought you buy swan grave or automotive grew up in there and we'll have about a thirty percent chance of rain the rest of the way lows will fall eventually to thirty six during the overnight with a breezy west southwest window around ten to Fifteen\nThursday a slight chance of rain in the morning before ATM cloudy tomorrow the high forty west wins around Fifteen famine body partly sunny forty two Saturday partly sunny forty nine whether ... vice one grave or embarrassed\nDon't wait until you're ... you know it needs something called Dan in the valley ... Iraq friendly and faithfully serving both old Clarence ... for more than three decades he'll get half not service from valley ... get it done costs seven ... seven to\nThree twenty four Seventy heart pumping out for commercial and residential no jobs too small depend on the bass bally's ethic and there were seven ... seven to three plenty for Seventy four\n[noise]\n[noise]\nI noticed\nThat come across somebody once in a while and [noise]\nThe following\nWho's been ready to DC for politically correct attention dismayed learn so it does say Larry Elder both\n\nLarry over here that said from South central the union bizarre and I'm a great ... don't origins though welcome to the program Bill Clinton allow because we've got to kind of you to say let's get her to eat [noise]\n\nGo\n[noise]\nWait seven one S. H. G. E. triple eight nine seven one Seventy four three Larry Elder released back to dotcom studio hurricane Michael updates [noise] how much are we paying every year for illegal alien birth [noise] Heidi Heitkamp that you oppose Kavanaugh's nomination due to his body language\nAt the hearing she says she turns the sound down sometimes and looks at somebody's body language that you could tell that he was visiting and nervous [noise] did you turn the sound down when Christine former testifying just asking [noise] but first yesterday I was making the point\nThat Donald Trump he's a fighter he's given spirit spine backbone to these Republicans are Republicans who would have folded like a cheap suit\nWhen the accusations of Brett Kavanaugh\nRepublicans Republicans who would have folded like a cheap suit\nWhen the accusations of Brett Kavanaugh surface but for somebody like Donald Trump being an office I think Lindsey Graham's raised his game as a result of Donald Trump being an office and I just saw a clip from Bill Maher show\nThat confirms my point although I don't think he realizes he was doing so\nI talked to you about how George Herbert Walker Bush with later on called\nA quote very lovely man or Nancy Pelosi after Bush left office\nMeanwhile she was right there when people were chanting Bush lie people died arguably the biggest defamation I've ever seen the president have to undergo\nSince ... LBJ how many kids have you killed that been have you with the kids you till today it's one thing to oppose the war another thing to accuse the president of lying us into it but there was Nancy Pelosi her party chanting it over and over and over again she didn't say jak\nAnd now George W. Bush was a quote really lovely man close code was anybody any nicer any more quickly than Mitt Romney when the reason he lost the race he thought he was ahead and didn't want to beat up bronco bomb and the third debate took his foot off the gas\nAnd here you have Harry Reid going on to the floor of the Senate and saying well the word out there is that he hasn't paid any taxes\nIn twenty twelve he used the Senate floor to accused Mitt Romney of not paying taxes even though he had no evidence\nTo find out how you too can lead with character\nFirst okay forest animals today is a new day kids are coming to the forest and it's up to us to make a visit a good one sparrow yeah have you practice the most popular bird songs for the year\n[noise]\nCatchy high like OK river ... tells the temperature refreshing fifty two degrees and perfect for a little riverside Jewish relaxation rock good how are you here cool who who can I Am look you know the drill sleep during the day scare the kids a night how much\nOf a ... treats are still in the same place so what's your last year that's what I like consistency well it's not like I'm going anywhere but the next couple of hundred years I Know\nI Love it a turtle turtle is not here yet man he's late every morning you'd think it would have learned by now to leave the night before meetings okay squirrels anybody\nSeen mister the forest has been preparing just for you visit a forest near you today to learn more about cool things to do in the forest visit discovered the forest dot org brought to you by the U.S Forest Service and the ad council\n\n\n\nAmerica we have a country to say and now here's Larry older [noise] I I guess\nBy now you've seen the Nancy Pelosi instructing people I had to do it's near a video [laughter] oh oh I tell you they're shameless diabolical people you know it's all it's\nAll the the ends justify the means no matter what including character assassination and maybe it regular that\nHey if I remember correctly are friends with the woman maybe all bright or something that said there's a special place in hell for women who don't support other women [noise] so\nWhat I'd like to clarify for does that mean women who fly over him he'll ... are women who um [noise]\nHow political agenda to a snare someone I I Know that not all but I think an over come out to get the could you clarify that because\nSomething to be at this point it's a lot to say as a special place in hell and the right thing as a central place and how some of not understanding what that will be going back to Larry I'd love to clarify\nWhy you're friends at this point not didn't age ...\nComment I heard that Nancy Pelosi today explaining in great detail about a rat I'm mayor\nAnd that you say faulted and then you have the press print them and that merchandise is then they knew had\nVenue close to press and that is a rap there I Believe the reason is identifying this and she said it's done in politics all the time is because she is associated with the letter of ms Ford and I think this is for her to come forward and say oh I was\nProtecting myth forward from having a rap mayor I Would never rap near any Patty and I think that's exactly so if you play anything about Nancy Pelosi and her rap\nExactly really play anything about Nancy Pelosi and her rap near a comment I think the kind of like a little deeper and can fit or why she might during this\nThat we have to pass the veil and find out\nWhat Larry this Randy from Ventura ... Harris is a former state's attorney general airing California she knows more than anybody about presumed innocent until proven guilty however she chose to ignore that\nAnd ah it shows that this woman has zero integrity [noise] [noise]\n[noise]\nTriple eight nine seven one as a GED AAA nice to have a bunch of two or three very old they're really factors are constantly you know for the last\nCouple of weeks we have been fundraising for alliance defending freedom that's that wonderful organization defended people like Jack Philips the owner of the map to peace kicks shot for free [noise]\nI interview jak I ask them I Would have happened if life defending freedom have not agreed to represent him pro bono he said I probably would have lost my business there's no way I could accomplish things all the way up to the Supreme Court now so many of you've already stepped up to join me in supporting alliance defending freedom and the number is eight six six four three five two to five to\nBut you have to understand why I feel so strongly\nIs because of eighty of clients like Calvin ... I interviewed him a few days ago he's in Atlanta fire chief lost your job for white riding a men's Bible study on his own off duty hours in his voice you can literally fear of the strength of character he got fired\nI Would gladly lay down my life in service to save another life because that's what ... do the one thing we should not have to sacrifice\nIs our God given freedoms the freedom of speech and the freedom of religion these freedoms but with so many in our nation have sacrificed suffered and that we shouldn't be forced to surrender\nYesterday I pointed out something else that organization the Southern Poverty Law Center\nGuess what group they've characterize as extremist alliance defending freedom I kid you not to claim their anti ill GB teach you community just because they supported a man who's release released prevented him from baking a cake for a gay wedding so therefore the alliance defending freedom is extremist\nBut the people that want to force somebody to violate his religious beliefs that they're not extremists it's outrageous\nBy providing free legal support people like Jack Philips his religious beliefs are under attack costs a great deal of money and you can help right now with your generous gift every single donation you make today I get this will be doubled by a special matching grant\nEight six six four three five two to five to\nEight six six four three five two to five to or I can go to my website Larry Elder dot com and please click on the banner that reads I wanted to fend religious freedom two hundred and fifty doubles the five hundred five hundred doubles to a thousand and so forth whatever you can give please do so\nEight six six four three five two to five to eight six six four three five two to five to\nOn we're going to talk about the laws that the governor of California has signed allowing a whole bunch of people prisoners including violent prisoners to get out\nAnd the reason is because of quote prison overcrowding close calls that's right we have enough money to build a bullet train we have enough money to have single payer which is what the a democratic candidate for governor wants to do\nWe don't have enough money to build prisoners keep bad people behind bars for the duration of their sentences no matter how much money it cost taxpayers when these people are out\nPutting bad people behind bars is a bargain considering these small percentage of people commit a great deal of crime putting them behind bars longer means that we actually save money over the long haul\nAnd a Fresno County da ... finally spoken out publicly against these stupid laws were going to have their forty later on the show triple eight nine seven one S. A. G. want to say one more thing about\nBill more before I get to Heidi Heitkamp\nWho says the reason he voted against Brett Kavanaugh's because he turned to sound down to look at his body language and didn't like what you saw\nI Know I Know back to Bill Maher bill Marr says fascist are for life\nActually bill there was an election you said you've been doing this twenty three years you know a great deal about politics than you know that we have an amendment that limits a president's term to two terms\nAnd these are elections in every four years we have an election and after your second term full term\nYou leave Obama left Reagan left you leave and a fascist by definition\nIf not somebody who cares about electoral politics so I really and then this rent you did on how the people like a Ford and others actually made something Walt Disney had a product and Mitt Romney doesn't make anything are you aware that\nSteve Jobs and Steve Wozniak credit a venture capitalist for their success in angel investor he was the second CEO of apple computer\nAnd without his early funding in\nManagement experience who knows whether or not apple would've ever gotten off the ground so all I'm saying is but for people with money like Mitt Romney companies like apple would never will not have been founded would not have flourished just just something to think about since you know so much about politics maybe you should learn a little bit about capitalism\nThe young people yes please ... because you know like really young like they say in the action movies that just got real yeah I Know you're young and idealistic so I've heard these young people on the news and they say things like Well Donald Trump I don't like them but Hillary I Can't vote for a liar\nI mean first of all it's just apples and oranges\nAn orange [noise] um [noise] really\nIf you received a letter or a bunch of letters from the iris it means that clock is ticking that means you're getting notices and they're going to garnish wages deliver your bank account and they made it\nThe IRS doesn't mess around you need to call my friends right now if Russia attacked resolution to protect you and to protect your assets don't try and do it on your own you're gonna get creamed now I Know these guys at rush tax the only company I trust in recommend not only that they have an a plus rating with a bb they have to get this and I heard a zero complained history\nSo many have you taken my advice and now your iris problems were solved one listener wrote a hundred and fifty K. I. rush settled four hundred dollars another thirty quay west settle for a hundred dollars\nEight five five Irish call right now for free iris transcript investigation and analysis a Fifteen hundred dollar value for free eight five five iris call eight five five Irish C. A. L. L. eight five five iris calling a rush taxpayer delusion dot com you're listening to the Larry Elvis\nIf you are an unhappy timeshare owner getting out of your time shares properly at the top of your to do list Larry Elder here and now that the annual maintenance fees are coming due you're probably wish you had a way to get out of that burdensome inexpensive timeshare\nThankfully my friends at Lone Star transfer can help lets them do for you what they've done for seven thousand others in all fifty states\nThey're process is done legally and ethically and best of all quickly Lone Star transfer also has an a plus rating with the better Business Bureau Brian and cheering run a family owned business and will personally make sure your experience is a pleasant we don't let one more year ago by with your maintenance fees getting you and your pocketbook give my friend to call\nFor a no obligation consultation at eight three three five nine four O O seven six eight three three five nine four O O seven six eight three three five nine four O O seven six or online at Lone Star transferred dot com that's Lone Star transfer dot com\n[noise] increase the value of your property see White City last today whether you're building your dream home or replacing your existing garage door glow pay garage doors offer many designs to choose from to make your choices look just right view projects can improve your homes curb appeal and add is much value as a new garage door\nSo make it a globe eggs see the area leader and seal the installation of both pay garage doors and live master openers White City glass theory has only authorized both the dealer White City glass [noise]\nThis is Greg I'm Talking with day George ... gymnastics and training center located at thirty two cells main street and rice lake\nBush's gymnastics and training center is a professional gym now it's twenty seven years\nAnd they welcomed new students called today for opening day and you teach gymnastics but that's not the only thing you teach that is right Greg we spend a lot of our time using gymnastics as a vehicle to teach kids character integrity leadership skills and a lot of the people skills so help them through life\nSo I joined the gymnastics our main goal is to help the kids grow physically mentally emotionally and spiritually for twenty seven years we've been growing kids in our gym through the art and supportive gymnastics and we're just encourage people to come and actually be part of our\nFamily there don't help their kids to learn gymnastics as well as all those people skills and Kirk joined our family at Georgia's gymnastics training center in key pleading with character first find us\nOn the Web adored just gyms dot com\nWant to keep your car running better longer here's a few tips from Bob Adam's Adam's automotive center in Oakland I think\nThe most important routine maintenance person can do is oil changes on their car inspection will catch a lot of small detail things are real changes will cover of the five course among synthetic oil filter Twenty one point safety inspections break inspection and the tire rotations\nDo in your view on your way in the\n\n[noise]\n\nLarry father staff sergeant random elders as hard when you get out of life what do you put into it and and now here's Larry Larry\nLet's say you're right now about President Trump fighting back out but the rest of them back I think it's wonderful that he's done that is taking it to them [noise]\nThey have to use the power that they have gotten for all the wrong things they want to keep themselves and they want to cheat or to the special interests\nIt is time for us as Democrats to be as tough as they are to be as dedicated as they are to be committed as they are\nThe shallow exists and show them all over you know my wife like really tight um would you say well he's ... [laughter] ... says and you know when they go low we know [noise] they go low we can [noise]\n\nSo like there was Eric Holder and members is\nNow the real answer to this is for gun owners to form a different organization that supports the second amendment supports their right to own guns used guns go hunting they'll target shooting\nBut stands against the absolute as [noise] of the n._r._a. you know the n._r._a. position reminds me of negotiating with the Iranian or the communist [noise]\nCripple eight nine seven one eight to nine seven one for them to read very elderly calm studio [noise] are you and I know\nThat off year elections are about one thing and one thing only and that is showing up this election most important off year election in decades your tax savings or on the ballot as are the American economy\nMost important off year election in decades your tax savings or on the ballot as are the American economy jobs your kids jobs your wages you're for one case and for small business owners your tax cuts are all on the ballot but the biggest issue of all\nWho's in charge of America's future politicians and bureaucrats in D.C where you\nKnow if you want to preserve the victories in the past two years I'm urging you to get involved this November going to tax cuts work dot com right now\nWill make it easy for you to do what you want to do which is to make calls and emails text knock on doors take a neighbor to the polls go to tax cuts work dot com will show you how to get involved because the only way we lose in twenty Eighteen is if we don't show\nUp if we don't turn out\nTax cuts work dot com do your part let's not get out worked in November tax cuts worked dot com right now that's tax cuts works dot com\nJames is in Royce is Roy city Texas Jane during the Mariel to show thank you so much for calling I appreciate it\nGet it and yeah I'm here that's what I've listened to Democrats Democrats Democrats stop somebody to step up\nAll all substitute my body or Donald Trump juniors fight against Michael ... but for every minute I'm In the ring he has to hurricane grand\nAnd that Stormy Daniels he took money from her he doesn't represent\nWomen were shown him what representing women's all about [noise] you know he was [noise] I didn't get it\nOff\nWith James it sounds good to me [noise]\n\n\n\n\n[laughter] [noise] [noise]\nNow I'm the opponent of Ted Cruz in Texas says he would oppose Kevin have you been in the Senate well because Kevin doesn't believe in voting rights doesn't believe in civil rights and\nEssentially Kevin all must be a ... he didn't use the word fascist you might as well as\nI Would not have were fifty is in the country as you said and voter turnout bar design on purpose some people not intended to vote when the Supreme Court justice who believes in voting rights in the state where you can be fired for being gay a Supreme Court justice who believes in civil rights a state that the epicenter of maternal mortality crisis\nA justice who believes in a woman's right to make her own this\nIs the interview we're going to push back and say are you saying judge Kavanaugh\nHas been on the bench for what twelve years doesn't believe in civil rights doesn't believe in voting rights isn't that just a bit much do you remember when Morgan\nFreeman was being interviewed a big was on CNN and he was just beside himself\nOver Mitch McConnell saying the best thing that we could do for our country is to ensure that Obama is a one term president that was just so disturbing he didn't call them a fascist\nTV his formative entertaining it's Michael my bed show on news talk sports six eighty W O G O they tally ... [noise]\nSay your radio news the Dow lost over Thirteen hundred points in the last to date economists and business professor at the University of Maryland Peter Morici joined Fox Business to talk about\nThe fed reserve give a fed chairman is a lawyer\nBasically doing this off the cliff notes and he's having Mac or economists from Johns Hopkins\nWhisper in areas those models are based on historical information they hardly incorporate the consequences of the financial crisis globalization you know in these kinds of things that we're experiencing now robots and so forth that looking back to see the future the French got the best rearview mirror in the world Thursday President Trump\nHad lunch and spoke with Kanye West in NFL hall of fame running back Jim Brown brown spoke outside the White House after the meeting\nI express my desire to bring a plan along with his plan for how to help people people knew to jobs people need education\nThis is usa radio news\nDo you want to more honest media\nHello my name is Robert thorough and I've grown tired of shadow Danny censorship and one sided reporting from today's knee and social media company that's why my concrete in right to voice dot com we don't push aside that's right\nThe number two and boy we don't push aside we include all of the sites that you can make a choice of what you read and say in what appears on your wall\nAnd we respect your privacy and don't start your data right the voice dot com it's the only place where you'll get all the news is usually one clicking joints or check us out today right to voice dot com\nWe don't push aside that's right the number two and boy we don't push aside we include all of the sites that you can make a choice of what you read and say in what appears on your wall and we respect your privacy and don't start your data right the voice that Tom\n\nWhat to look at the latest on first time on unemployment claims here's usa radio networks Chris Barnes\nLabor Department report says more Americans filed for jobless benefits last week\nBarnes the Labor Department report says more Americans filed for jobless benefits last week than expected and the number was above the previous weeks total now most analysts had been expecting the number to come in at about two hundred six thousand in fact there were two hundred and fourteen thousand first time claims\nAnd that was up seven thousand some of the week prior the figures higher but still out of near a half century low\nFederal officials say they have charged in New York man with manufacturing an explosive device saying he planned to set off the two hundred pound bombs at the national mall in Washington DC on election day killing himself and many others text messages or what ultimately caught Paul Rosenfeld who was arrested earlier this week his neighbors were dumbfounded that he could do such a thing\nWow wow\nLot of people take it I Love you know most of the block I Would say\nThis is usa radio news\nWith the recession ending if you've been putting off building your business now is the time to act general steel will meet or beat any price on a pre engineered still building of the same size and specifications act now before steel prices go up so call us today\nFor free information ... eight hundred nine six five twelve Ninety eight hundred nine six by twelve Ninety eight hundred nine six five one to nine zero on Thursday the panhandle of Florida I began to clean up after hurricane\nMichael as a Thursday more than six hundred and fifty thousand homes and businesses had no electricity former Arkansas governor Mike Huckabee joined Fox News and talked about the job that Rick Scott did and preparing his state\nGovernor Rick Scott did a magnificent job in staging assets in advance of the storm the preparations for it\nEven though there weren't that level of warnings it wasn't like we had several days this thing kind of popped up on Saturday Sunday\nAnd then it got much worse escalating to a cat for during the night before it actually gets so there was a fortunately a lot of preparation done in advance\nThis would have been a much worst storm in terms of loss of life had there not been the level of leadership on the part of the Governor Scott FEMA and a local emergency management officials\nKnow Governor Huckabee also has a home in Santa Rosa Beach Florida he talks about how he rode out the storm and help some of his neighbors out\nWe did have neighbors who sheltered with us because our home is a relatively new it's built to exceed the latest hurricane coach it's not you know something that you you're so foolish about to say well it's indestructible the people on the Titanic ball fat but as much as it is humanly possible to engineer a structure\nOr that is designed specifically to buy a ticket to withstand a you know by hurricane\nFor us to radio news I'm Ken Berger\nPlug in vehicles ... hurricanes will suddenly button used car market so as a buyer beware of vehicles are supposed to be dismantled usable parts or cost for scrap\nBook titled issue that down his car was on stimulus users will buy a fun yeah go clean it up again re titled\nWith no indication that was flooded on\nA short costs will be cleaned up by the owner sold on line\nAlso with no warning to the bar is ... to be true that is a good chance you're buying the limit make sure to check the damage qualify mechanic and ... you write a check three venture service and the national sharks caught hero is a good place to start to see if a car's ...\nGo to W. W. W. dot ... dot org to check it out and did you suspect or give us a call at one eight hundred a ... and I see the one eight hundred\nG. E. L. I. C. D.\nPublic services it from the national insurance crime bureau\n\n[noise]\n\nDress up as they put things in this world it's usually [noise] one of them happened to be another man's fry you remember that you live alone and healthy lifestyle\nI Am white so I Apologize for\nFollowing who's been rated DC or politically correct attention dismay learn so let's say [noise] Larry Elder bay\n\nLarry over here that said from South syndrome the print the union bizarre and I'm In the ... the dome neurons welcome to the program and allow because we've got a country to St Louis guaranteed [noise]\n\nGo relate\nNine seven one S. H. G. E. D. triple eight nine seven one seven to for three very able to release acted dot com studio next hour we're going to talk about how many persons who are not legally entitled to vote had been registered to vote if you're in California\n[noise] I Want to go back to what I was saying last hour we're going to get into what Kanye West that today in the oval office and the criticism to continue with getting being called an Uncle Tom by the likes of Snoop Dogg [noise]\nOne a democratic strategist black said Kanye West quote is what happens when negroes don't read close vote calling a black man and twenty eight team in equal [noise] he's a demeaning term [noise] and he knows it\nBut most people watching the program probably are aware of it [noise] that's how you're able to get away with the the only group that you can beat up\nOn the line attack insult more than white males\nWhite a white Republicans or a black Republicans\nNow what's the line we hear over and over and over again I watch a lot of MSNB hall so that you guys don't have to watch a lot of CNN to that you guys don't have to and I will tell you the driving theme is Donald Trump got elected by appealing to white racist\nDonald Trump got elected by appealing to white racist what a banjo say\nWhite last [laughter] that is a constant theme\nPresident Trump's of races present Trump's of racist because he said Maxine Waters have low IQ never mind is at the same thing about Robert Deniro last time I looked as not black but that's relevant\nPrinting from some racist\nPrison Trump question whether or not Obama was from Hawaii therefore he's a racist never mind Hillary first one who started this oh yeah it's always campaign did\nShe's the one who started the birther movement and somehow her hands are completely clean fingerprints left anywhere near remind her top intimate\nSidney Blumenthal went to the McClatchy Newspapers that then editor went public and said yeah he came to me and he told me that Obama is from Africa and we put a report on to track down the rumor turned out it wasn't true but but the Sunni Blumenthal ... said that to us from Africa\nSo here we started it and no one calls her a bigot because of it but Donald Trump because he picked it up is now begun the ... over and over and over again isn't it\n\nPresident Obama stirred up the racist based in the heart of American mostly American white males I guess and that's why\nRacist based in the heart of American mostly American white males I guess and that's why Donald Trump got elected never mind seven hundred counties I voted for bronco bombing two thousand eight in two thousand twelve of the seven hundred counties never mind that two hundred switch to Donald Trump did they become racist\nThat job was open up the doors again for ministry through a real miraculous way got open the doors for me to be involved in the ministry here at W. W. I. B. review and\nAs soon as I started he was the differences in the day\nI knew this was home joined game and sharing the ministry at W. W. I. V. W. O. G. or radio we've just opened up an opportunity to join our expanding advertising failed the stand your resume to sales that W. W. I. V.\nDot com WW ivy W O G O is an equal opportunity employer\nHi this is great choices are from toys in Fort\nAnd we're proud to sponsor local high school sports coverage and after sixty six years we had a choice in force just got a little more local to\nOur brand new state of the dealership is now open up highway twenty nine and see more gray and ships will fall we're proud to be the only car dealership and pull falls and we look forward to serving all our friends and neighbors stop in and check out all the great things soy says forward and our new dealership has to offer and our old slogans Phil ... today\nYou'll find a friend at choice informed [noise]\n[noise]\nAmerica we have a country to sing and now here's Larry Elder\nI came up with an idea for billboards the other day I got to suggest billboards all over the country the chosen family has been why public it's a dog\nThey're all happy and smiling the husband and wife are there's a table in the background with food on it a face full of flowers and her husband and wife are looking at their wallets and they're filled with cash and a line over that picture is\nIf you vote Republican some November\nAnd then right next to this other pictures same family now they're dressed in rags and tattered clothes the kids are said the dog moping around there's no food on the table the flowers or wilted they're looking at their wallets and Walter completely empty and the line or that\nPicture is if you vote for Democrats in November and uh you know don't just put her on billboards put it on postcards full page ads in newspapers go on the Internet put it on the youth who were in or do whatever it's called and when people say hey that who came up with that idea that's a great advertising campaign just say oh a listener to the ... program\nCame up with the idea yeah check out his program he's pretty good thanks Larry\nWhatever about working men and women are very mindful of [noise]\nLike I said we want S H late nights and we want them to for the very able to have a secular comes to the [noise] I'm looking at\nOur alliance defending freedom tolls and I want to thank all of the men and women were helping them reach our goal help this outstanding organization to fight for religious freedom if you don't know alliance defending freedom that the organization that defended jak Philips\nThe owner of masterpiece kick shop in Colorado for free\nAlliance defending freedom is a consortium of some three thousand lawyers all over the country\nBut representing somebody for free it's not I mean it's about cost\nSo please this is an organization by the way that's been designated by the Southern Poverty Law Center\nAs a extremist group as a hate group why well according to the Southern Poverty Law Center website the ATF its interested in making sure that\nMembers of the L GDP community\nCannot be forced cannot for somebody to bake a cake in violation of his her religious beliefs my goodness stopped the madness oh the humanity this is the pressure that this organization alliance defending freedom is under\nIt is second to none in defending religious freedom\nAnd you can help right now with your generous gift to the ATF every single donation today\nWill be matched by special matching grant\nOr donor I said whenever anybody contributes\nI Will match so please call eight six six four three five two to five to or go to Larry Elder dot com and click on the banner that says I Want to defend religious freedom two hundred bucks doubles to four hundred four hundred almost eight hundred thousand to two thousand but whatever you can give\nEight six six four three five two to five to right now or go to Larry Elder dot com and again click on the banner that reads I Want to defend religious freedom\n[noise] quite a contrast between the Chris Matthews had said this\nIs a party did it I just keep keeping the list they want more people to fry they love executions and they want people that don't have insurance to die on the gurney in the hospital they want that to happen and they want to forget about illegal aliens gay soldiers\nForget about and they're not they're they're they're they're being booed if you're homeless for clothes on and they have a home for clothes on the people if you're a teacher firemen are are are kept getting rid of the guy I mean this this attitude of causing cruel pain\nIt kept getting rid of the guy I mean this this attitude of causing cruel pain on people and getting cheers for it what's that about Howard how about Joe Biden oh they they don't they don't want black\nPeople didn't want by people voting Joe Biden to a black audience Mitt Romney wants to Unchained Wall Street wants to put you all back in chains Hillary Clinton this place to house is run like a plantation she says to a black audience at church and you know what I'm Talking about\nThat's their mantra\nThe Republican Party is racist Republican Party is appealing to races and then today Chris Matthews\nUnfortunately reveal the whole scheme is not true says Chris Matthews that most white people are racist she didn't say it that way but that's the way it came out Chris Chris Chris you've given up the game\nBut I Do understand President Trump did it as much as any of us do he only should the mon\nHey there's the thing it does the thing and they get in the contest of ideas in politics than the other people don't do areas sitting with a hip hop guy\nWho apparently is it's got some sort of bizarre politics that are fine I think it's also it's it's runs against the idea is a racist\nIt runs against the Trump like minorities that he's going after her Ronan going after a Maxine Waters going after the usual suspects if you will and politics and it's sort of a racial way and Harriet flipping it it can be used in people but mainly it's for white people\nBecause white people won't vote for a guy most of them if they think they're racist so if you show you're not in some plaintiffs\nCartoonish way you get them off the hook you know what I'm saying\nMost white people won't vote for somebody if they think he's a racist then he went to New York times thanks\nSitting with the Washington Post thanks that's not what Chris Cuomo thanks\nThat's not what Don Lemon thanks that's not what Jake Tapper thanks\nThat's not what Anderson Cooper thanks it sure as hell isn't what Rachel Maddow thanks or Lawrence O'Donnell or the other Yahoo's over MSNBC call that is their ... every single night you can sit in front of the TV set on MSNBC heart night and put out your stock watch\nSeven minutes will not go by before the race card in pulled\nSomebody will somebody will\nIn here you have one of the ringleaders he's been doing it and saying it for years admitting quote most white people won't vote for somebody if they think he's a racist quote unquote\nAnd of course we if it's true but for him to admitted\nIt's almost like O. J. Simpson said yeah I did it\n\nAre you kidding me I knew him pay someone if you're just not for just being who they are or were they have to do something wrong your entire station is built on that premise MSNB hall\n\nMSNB he was just\nTrudging along until Trump came in and uh\n\nThe ratings have never been better\nAnd former reporter for maybe she said that remember when uh\nBrian's do to get all upset he said you guys would be in the toilet if it weren't for Donald Trump and ... and Brian seltzer or CNN got mad and that's not true that you know that's not true okay let's not talk about CNN he says she's been sensitive topic let's talk about MSNBC MSNBC he said\nWhere do you think the ratings would be if they weren't beating up on Donald Trump all the time\n\nWhere would their ratings be if MSNB hee haw was not constantly be rating Donald Trump calling them a big\nWay to take\nOne of my friends had a neighbor a lefty she says MSNB huh is never office DTs I'd always have it all happened to be black thirty percent of the people that watch MSNBC or by the way are black\nThirty percent\nWhat do you think al sharp and just got a second day\nWhich is a guy who's never seen the race card he couldn't pick up [noise] has a show [noise]\nConstantly talking about racism racism racism and his colleagues down the hall is acknowledging that most white people would not vote for somebody they thought he was a big it while I'm Larry older\nThis is why this country is being torn apart but it's kind of age the Larry Elder fall through fall devastated [noise]\n[noise]\n\nI tell you a little bit about really factor here's a testimonial from Becky I have\nWell I tell you a little bit about really factor here's a testimonial from Becky\nI have experienced chronic pain and my lower back then Larry Elder show ... often shoots down my leg and overall stiffness it's common I struggled to climb stairs could not stand for long periods of time could not turn over there or sleep through the night I Can't even begin to tell you how this has negatively affected my relationship with my husband\nI've been to doctors chiropractors massage therapist try to control pain through diet and even like exercise costs bathrooms I use over the counter chores ... electronic simulation I heard a temp second commercial on the radio and call relief factor I've never purchased a quick fix products from an ad for my life\nIn desperation I dial the number after taking the product for two weeks my life has changed for the better\nLet me suggest don't mean to you the three week quick story is just Nineteen dollars and Ninety five percent or Ninety five cents a day [noise]\nMy business is at stake because the government told me I Can't live on my faith in the workplace\nI was arrested for handing out the U.S constitution and my college campus\nState law forcing me to advertise for Washington\nHi this is Larry Elder our fundamental freedoms are under attack\nWith the good news is alliance defending freedom is on the front lines providing free legal services they're arguing some of the most critical cases in our court today and protecting your free and the freedom of your children and grandchildren\nWhat they can't do it without your he'll go to Larry Elder dot com right now it's like on the alliance defending freedom banner your gift one hundred dollars to help ATF defend your freedom\nBy the necessary resources to fight these pivotal point\nAnd thanks to a matching grant you're gifted doubled when you do you have right now with the alliance defending freedom banner Larry Elder dot com called eight six six four three five twenty to fifty to sixty four three five to two by two\nCan\nWell I'm Glad you enjoyed it but it said had back in\nTime [noise] killing can sure Tamara\nLet's stick with mom [noise]\nIt'd be careful getting out of the boat it's\nI'm going to return the kayak\nTwo thirty three north maple fleece\nHits a short hair from your neighbor had the nature\nOf the fourth title to find a neighborhood park or green space here you also fun activities to deal like voting and biking more camping and hiking much more it's All right in your nature had\nGang [noise]\nPublic service announcement about Peabody at any point\nWe're enjoying a beautiful song northwest Wisconsin but eventually the cold weather will return the temperature drops\nSo does the air pressure in your tires in fact for every ten degrees dropped on the thermometer your tires will lose a pound of pressure being caught so late they come on indicating a low tire what should you do for you should pull out your ... tire irrigation\nYou don't have a job retired air gauge plus stopping and we'll give you one still retire self main street in rice lake\nWhen family does history and Chippewa falls has grown to serve you better suckered Daniel when and Dr any Gunderson delivery exceptional carrying the newly expanded facility\nFriday appointments for your convenience and an easy to find a location near St Joseph hospital experience of family differences when family dentistry the testimonials on Facebook or it when the family dentistry dot com\nWishing all our chai high end McDonald's student athletes a very bad when family industry or your hometown dental office in Chippewa falls [noise]\n[noise]\n[noise]\n[noise] really\nWelcome back to the Larry Elder show\nClearly bears Ginsburg wants to go to New Zealand when she told south Zarqawi as God when they want to go to South Africa sanctuary love your most\nAAA nine seven one S. H. G. E. AAA nights every once every two for three weeks after that comes through your [noise] they should certainly\nBe either by all the ... of his gone on for the end of World War two I Would love to us from if I was at ... at ... ... ...\n... to South Africa [noise]\nLate nights and one is a ... a AAA nights and the ones that are too for three my real relief at our country we've been talking about Kanye West visited the White House and has been hammered for daring to suggest that maybe just maybe\nIt might be a problem with the welfare state [noise] I Am the\nLarge number of black fathers were not in the home for daring to suggest in Ninety percent of the meteor liberal for daring to suggest that maybe just maybe black people\nWho ought to rethink their at least the Democratic party we talking about all of that and also a Democratic Party chair of Allegheny county has had to resign amid quote controversy Saddam from pulse and said I stand for the flag across all can't do that we're talking about that later on the program but first\nThe last two weeks or so we've been talking about a life extending freedom and I've been doing a fundraiser for them and I've told you that for every amount of money that you give there's a matching grant eight six six four three five two to five two so please please please joined the fight Kelly ... is\nAn attorney with the alliance and she's a member of their alliance with this ... very much for coming on the program I really do appreciate it [noise] thanks\nSo much now\nYou're working on another case uh we were talking about the jak Philips case with ... ... has been targeted a second time but there's another one a barren al ... is a small business owners tell me about ... Stutzman\nThat's needed a Seventy year old grandmother one of the get go your other me and she had a long time friend and customer robbing or so on she waited on heroin or nearly ten years I'm going to get paid for this law regarding marriage\nHe came in after two great powers and how great has their sex wedding because if I Believe he she told him that you know would be happy to of course we can't do any other than that you could see how rich for that event and we had a couple of girls are handed her a couple of others for it\nAnd unfortunately in an unprecedented fast and the Washington state attorney general found out about it for me and filed a lawsuit against her about her personal capacity at as a business as I see that there's a lot lot is on the line\nKelly her friend Rob is not the one that Institute of the action was the state of Washington the dude\nThat's why we saw that he did it happen that will be outside of the mountain biking\nFor a field you represented a couple of follow the second law against or for that came after but uh\nYou represented a couple of ... second lawsuit against or for that come after but that that's the perfect ... and get it at like that with the status that have lots of that so that's all that was really targeted her that\nKelly for work this is incredible her friend Rob whom she's known juniors they're friends she wants to her to create a floral arrangements for same sex when she said robbed a I Love you know you're a long time I can't do it he's okay he walks out and go somewhere else if the state of Washington the Brinkley action\nThat's right they hurdle for everything was okay and then the train down all the key to steal her\nAnd now he faces what truly tragic about that are simply declining won their client she could lose everything in her life savings\nIn to take everything away from her simply because she just called her conscience and that's really scared all of that no matter where we stand on any issue at the government has the power to come in and tell us what to do I think\nThan that they're pretty\nDangerous environment or any of that around with American\nI'm Talking to kill me for ... she's an attorney with alliance defending freedom I missed the dark I understand that she was actually hired a people who've identified themselves as gay\n[noise] that's right they're not serve every line doesn't matter who they are like a sexual orientation and she's also quite people who are gay that's correct I Can't really the most loving person could ever meet 'em and truly cares about about Rob but then I'm like who who who is now telling her\nAbout what she couldn't get Glen terrific talent to be a part of ... and ... that it went against her face and America we have so many different viewpoint or that the government should not punished I threaten there are very livelihoods if we don't necessarily tell the line with what they think is the proper point\nNow if you want people like Charlie for dark to continue doing her work for alliance defending freedom representing people\nLike ... and ... for free\nPlease you've got to help this organization right now we have a donor who's matching everything but you contribute eight six six four three five two to five to eight six six four three five two to five to ... or we have about forty five seconds left what does what does the ACLU said about this lawsuit against Baron Hill", "show_name": "Larry Elder Show", "year": "2018", "city": "Hallie", "day": "11"}