{"month": "10", "state": "TX", "station": "KTRH", "content": "Joy aunt Saturday October twentieth at ... he's part for the ... annual energy to one of ... the largest free family festival\nEnergy gay has music sued gain and fine enjoy over ... I think the interactive exhibits show ... science technology engineering and mathematics energy and careers don't miss out on the fine\nAnd mission is free\nTo you by the Olympic stick the\nConsumer energy education foundation and the consumer\nEnergy on land for more information does that energy day festival\nShale oil and gas business magazine is the one stop shop that'll keep you in front of the customers that you need to grow your business so let's start growing your business in Texas email is info at ... dot com again that info at shale S. H. A. L. E. mag M. A. G. dot com\n\nAnd we're back you're listening to end the oil patch radio show our guest today by Peter ... who is the partner for a DL and Bob and before the break we were talking about\nI'm ... and I'm a premium ... per operators an independent and and now let's move into capital because I capital is obviously one of the most important is destiny a four and a shell playing so\nLet's talk and get into feeding the capital machine\nOkay okay yeah I think um\nYou know obviously none of their growth in the army\nIs possible without a capital funding and if you look at the uh protected um development plans over the next five years it totaled up to at least a\nHundred billion dollars in additional capital\nA required to drill forty thousand plus wells bill the proper support infrastructure around those ... and and\nPlus far shale industry over the last decade is benefit is very much from the uh the low interest rates and the availability of excess capital seeking good investment opportunities and you're still is\nThat a lot of capital I'm from private equity um that is interested in and investing in a a resource place I think I saw a number over\nThe last quarter that around ten to Fifteen billion was going to be by private equity in New I'm ... [noise] but um\nThat's expensive capital and I think if we if you look at 'em into structure demand there there are\nSocial the capital that traditionally\nHave not been tapped to a large degree a or earning infrastructure within a within shale so insurance fund or ... or family\nOn 'em or two sources of a lower cost capital that are\nIn participating in long term projects that say hey I'm Single digit rate of return over a long period twenty plus years will power\nAs I talked about earlier in say a perfect example to think about where my other sources\nCapital ... death in order to um on some of that a a three hundred billion or three hundred billion pledged\nI think the other the other thing uh watching them do things that you share as interest rates rise\nAnd they have been steadily over the last couple of years that it costs the capital will tend to go up\nAnd just sort of a a point to watch is a ... that have any impact on the willingness of traditional institutions to invest in the number one I think are now\nThe rising price of oil has more than offset rising Boston capital but that is something that would be to be watched very very closely\nWell understanding that the Permian Basin is kind of just getting started and if you will and the projections for what's the potential to ... especially like in twenty twenty two and the amount of that of\nOil that's going to be coming out of Texas in New Mexico and um all of the yeah\nMillions of barrels they're going to be produced\nIt's a it's it's kind of mind boggling to think everything that half to get done and everything that ... that these operators are facing in dealing with to make sure that they're able to to get their barrels to market and of course and I'm looking at the stats and in which\nYou guys are discussing how um the Permian Basin alone she'd be equivalent to the second largest OPEC producing country Iraq\nAnd only trailing behind rush and Saudi Arabia these are some really amazing numbers to think about\n[laughter] Permian Basin and yes it is if you're not in there you should be an ... that are getting in there about that is all the time that we have before we leave where can someone go to get to your independent at your rethinking independence I'm white paper here\nSo we will we will host the short little ... on the on the little website ah I Would expect it should be up there oh by the end of this week\nAnd a website um you can directly contact a myself at our little ah like I can send you a copy as well that we will posted on the Web shit\nOkay and so just for the record it's ... dot com and of course our listeners our parents and I are they can email radio show make dot com as well and happy to go forward\nIn the copy at this white paper report very very good report Bob thank you for coming in we look forward to working with you in the future to try to get this information out that the Permian Basin thank you\nThank you thank you for the up and and yeah\nThanks again Bob for being a guest on our show today and congratulations because you're going to be a topic of today's trivia question\nBe the first person to email the correct answer to this trivia question ... ... dot com again that's radio at S. H. A. L. E. N. A. G. dot com and you will have a chance to win a Seventy five dollar gift certificate to chow\nBe amazing Brazilian steakhouse today's question is what is Bob Peterson's title with a D al\nRemember to email the correct answer to radio ... dot com and you'll have a chance to win a Seventy five dollar gift certificate ... child that Brazilian steakhouse if you are interested in keeping up with an oil patch radio show or the latest issue of shall magazine you can do that\nIt's free all you have to do is go to W. W. W. dot ... dot com again that's S. H. A. L. E. M. A. G. dot com\nAnd sign up for free for that is going to wrap up another great show we'll see you next week for more exciting and ... and then I have\nReally all that is where the other week four topics that affects us all in oil and gas business and in your community every week your host Kimball auto visit with the movers and shakers in this fast pace industry you'll hear from industry expert elected officials and many more right here on any of\n\nThe latest trend in local and national news news radio seven forty Katie our age [noise]\nGone over to Ninety nine point one age ... do you all\nAnd traffic on your radio Ninety nine point one of the two radios\nDRA in age the if it's time\nFor a new front door the thing people see when they first come up to your home and you want security and elegance do what I did call southern front dot com southern front doors full service sales and installation to a one eight nine oh fifty eight sixty\nWe got a wrought iron door glass in the middle but the way the wrought iron done you can't shake your hand through there we can even open the glass let the air coming in this time of year to eight one eight nine fifty eight sixty southern front dot com\nThank you were listening to cagey our age this is a Jimmy bird from Houston It's MORNING news remember you can listen to us anywhere that's why we created I heart radio I listen to all my favorite music and all my favorite stations all free download or ... radio up and try it free\n[noise]\nThe leaders whether\nFurniture made in America studios Steve Steve's radio seven forty Katie our age abused and and I are the radio station a\nGood week for President Trump I'm almost the galley it's nine o'clock on news radio seven forty gay P. R. H. let's start off with traffic and whether it together [noise] getting\nIn the in the day you can wake up refreshed knowing that last night show is waiting for you with ... as a member you'll have access to our monthly live ... with George ... and special gotten the coast insiders club is a must pass to\nBe true for all goes to go to a um listeners vivid coast to coast am dot com to sign up today [noise]\nHouston sounds good everywhere he okay Google Play Katie our age and I are draining\n\nWelcome back David boy you're with us his book tipping point of course they could be the beginning of a series of books you don't have it every time I meet someone from China\nIn this country they they love it they love our way of life they love the United states they love coming over here many of whom would love to stay some of them do\nThis is government to government because I think people the people nobody wants a war\nWorld War one yard yeah sure is I think everybody realizes that\nI think even the ruling elites um realize that war is a disaster but unfortunately preparing for war and skirting war I'm there can be profiting that sometimes\nI think so too are you my father was in World War two my daddy and I remember stories of the war effort David that you we literally changed the manufacturing structure in this country\nFrom whatever we were doing before to the war machine to get things for World War two do we have the might end the capability of doing that today\nWow that's that's the real question um the question is it just real infrastructure and the question also where do we need to build the same kinds of things that we used to build a I remember my mother worked or during World War two\nIn a factory there was converted to make bomb racks a picket may catch aware before but she made bomber acts were fighter planes [noise]\nUm my dad was off at war a but everybody was working in war industries usually\nA in factories that were built to build something else well okay so we don't really have that many factories anymore so how do we convert factories where you don't have factory that's the question\nGeneral Dynamics are used to build all kinds of tanks I assume they're still out there doing what they do building tanks they moved out of St Louis their headquarters were in St Louis\nAnd are there are right now the there in Virginia but I guess there's still a huge tank manufacture I just don't know they build them in this country anymore\nWell I mean my my information about taxes not up to date about ten years ago\nI understood that we could not cast tank Kirk from this country anymore we had to buy all the Kurds from Israel shut them over and then work on them here I'm not sure that's still true today but ah definitely our infrastructure has atrophied terribly\nSo as we look at these possibilities these strong possibilities of another war this time with China I'm over ... all the nations that are out there that we've had tensions with North Korea or Iran Russia China\nDo you think it's China that has the strongest possibility of of us going to war with\n[noise] um I Would say that right now it's probably the highest on my personal list at the same time I don't think we'll go to war with it has one single nation\nI think it'll be blocks of nation stressors has been in every major war in the past it might work for the lion out of North Korea China Iran Pakistan and man mark 'em and a lot of the patients are in China's orbit already\nOr the United states as Japan on its side South Korea the Philippines well the Philippines are kind of their ... at the moment and this park a car and oddly enough a Vietnam is firmly in the United states camp\n[noise] what would the United nations do with anything\nI don't really have them as a major player\nNo no they did I I there's a weakness there in a now China when you look at manpower far outnumber us we we can't put together the kind of just you know foot soldier military the ... that they have\nNowhere to be pretty crazy to try to fight another land or in Asia they they pretty much part of to expand the spill and Korea Nineteen fifty three and a and a and their their capabilities of increased tenfold shows that\nThere's also willpower the guts to want to do something like this with the American people support another more if it didn't hit the homeland here it didn't hit the country\nWell that's a good question uh we've supported a war in the middle east for how many years now\nAnd hit the country um\nWhich were almost immune to that is in a sad way\nWell you know war if not war like it used to be a will there's like wars on the periphery of empire sort of like the Roman empire used a war of all the time at the periphery of empire that were and they they were fine by legionnaires but really the people of Rome didn't have much to do with it\nSo would there be a strategic area that the war would break out in the end be contained in that is not in China not in the United states but it would be someplace else\nWell I see a horizontal escalation has the danger let's say that we're talking about the same Kaku is earlier let's say that war breaks out around the same cockatoos around Taiwan\nUm the temptation for both fired as horizontal escalation and I know you know what that means but I can elaborate on that for audience please\nThat means both sides would want if there's a stalemate in the central theater for they will start a an offensive in another theater of war in order to occupy the enemy elsewhere for example the Chinese could go the north Koreans to attack across the DMZ\nOr they could also attack India they could they pack Vietnam and other words they could attack our allies or countries that might be our allies all around their periphery that would be horizontal escalating\nAnd that's a possibility\nAbout what we would be doing at the same time of course is clamping a blockade on\nHave the NBA and um the Indian Navy as one of our allies and we could completely cut off all of China's our energy supplies most of which come through the south China Sea\nIf we cut off their energy supplies they either have to find their own suppliers or they have to build a pipeline to Central Asia or they have to do without\nWell and that's what concerns me too because when you uh paint a tiger into a corner it's going to come lashing out at you and would it not do it with nukes\n[noise] well I think first they would do it with conventional armies\nBecause that's where their main superiority lives we have escalation dominance and you know what that means but I'll explain that a little bit that means that we have the more bigger nuclear weapons and the Chinese to\nThrow it would not be their best advantage to say OK let's start loving mood cook the United states because we've got more and better and it would be very ... them to do that\nHowever they can start land fanfare was that we can't we can't respond\nTo no not at all\nYou know let's say they um they unleash the Chinese army on the east coast of South Korea at the same time the north Koreans are packed\n'em what would we do could we reinforce are very small contingent of us troops in South Korea what would happen would just lose them\nWhat do we have thirty five thousand people there\nUm your guess is probably about right I Would say\nLet's take some calls and go to Jacksonville, Florida the get things started Greg you are on the air with us go ahead Greg\nMorning gentleman I Greg a cross the United states there are more Chinese restaurants and take out any other type in the ah\nYou know food places around mhm and I think a lot of them will probably stay low China so I think there is a small Chinese army already in United States and in one restaurant\nI was looking around and looked to me like I could see three of the new Chinese well up weapons back here you can't get them in the United states so I Know they're here\nThe only thing I got to say people is a B ready yet our state budget line is I think there is a small Chinese sport's already in the United states and what they got the word they would come out are you guys have a good day\nWell there's always that possibility I guess David that a a Maureen nation would infiltrate a much because wars are different these days I mean we see what ISIS is doing\nSpace in Jacksonville met my wife in Jacksonville I Am very town great memories of Jacksonville green navy town\nThat we have the same concerns about the German restaurants in World War one ... a Japanese are farmers in Hawaii and World War two there were very few or treaters as I recall historically but there were some\nSome time and the next hour hour and a half than we do have the ongoing broke structure and forty five go free way north ... FM five Eighteen the area will be shut down until five AM ... Killian and the ... Gulf Coast windows dot com twenty four hour traffic center most of the county for tonight\nPrinting partly cloudy overnight you know twenty percent chance that ... that made big club sunshine boy you're Monday Columbus Day with them to ... percent chance of showers and storms were breezy hide Midwest Brady ... percent chance of getting started again on Tuesday hide mid eighties I mean just hogwash Weather Channel\nSeventy nine degrees and the woodland an eighty at the ... elections twenty four hour weather center ... nine thirty one or top story Florida governor Rick Scott is declaring a state of emergency for parts of Florida had a tropical storm Michael's arrival\nMichael is currently southwest of Cuba inspected to move north and could make landfall on the Florida Panhandle by Wednesday twenty people killed in a deadly limo accident about Seventy miles north of New York city\nThe limo rent a stop sign Charlene Caldwell of east Houston dead after being beaten to death with a baseball bat by her boyfriend this morning it was the biggest October movie weekend in history venom was the number one movie made eighty million dollars coming in at number two a star is born with Bradley Cooper\nAnd Lady Gaga in sports the Texans in cowboys at energy at the moment are tied in the third quarter Thirteen all\nAstros game three of the ... game season in Cleveland tomorrow will be on the ... day game here on sports talk seven Ninety John mostly on the news radio seven forty Katie\nR. H. back right now north\nWhy and what\nIs going on a good thing we know what's going on\nIt on to hear news radio seven forty J. D. R. H.\nThis report is brought you buy unbalanced dot org right now there are young people across the world facing a tough choice continue their dream of education or drop out to help their family put food on the table you can help change their future in a single moment see how far your support can go at ... dot org\n[noise] Hi\nThis is actually it was hard when you invite you to see Fleetwood Mac live going on in\nThe road when I was looking forward to the most is getting into the pool music demoted I'm communicating with other players on stage and that's when I'm really really [noise]\n... would max north Americans who are really looking forward to getting out of the\nOne we love to do my ticket that would match dot com\nAllied outdoors illusion if you want your out door area to look great the area around the pool for instance allied outdoors solutions can come out and make all of your heart's games look great\nWhen you drive into our property they did an area for me that's around the pool but also serves as a as a court for the basketball\nGoal but we can also Parker cars and it holds up to that\nAnd they design the whole thing I kinda gave him an idea of what the purpose of this war\nBut they made all the hard scrapes work you can go to their location to show room on at ten in the beltway and see it for yourself it's funny when I go over there people will come in and take off their shoes and walk around because you can be walking around on your feet they want to see what it feels like\nYou can and they'll come to you\nOr you can check 'em out online allied outdoor solutions dot com seven one three four six five four hundred seven with three four six five four hundred [noise]\n\n[noise] [laughter]\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\nFor were present coast to coast\nAnd the best George\n... hour we're going to talk about the bureau's realm so make sure you're part of that coast to coast program but also don't forget to watch our TV show\nBeyond belief available to you you can stream it and watch it on your flat screen if you have that capability simply go to this website WWW dot beyond belief talk on [noise]\nNews radio seven forty Katie our age [noise]\nMid term October baseball that they have you with\nInformation station every facet of life Youth Radio seven point\nOf people have life insurance through work it's a great short term benefit but is it enough a lot of those policies only cover a year's salary not enough to pay off mortgage is worse than kids to college things life insurance is meant for\nThat's worth select quote comes in select ... is your personal life insurance guide get multiple quotes to find you the best price from the highly rated companies they represent John is thirty six and an excellent how he got a half million dollar policy for under twenty dollars a month life insurance is about peace of mind about a false sense of security which are you getting\nAlso like cool now and one eight hundred eighty five forty six forty six\nThat's one eight hundred eighty five forty six forty six or get started at ... dot com one eight hundred eighty five forty six forty six so like\nWe shop you save your soul details on ... commercials replace could vary depending on your health issue in company you know the fact is not available in all states get\nThe low low loans door Chevrolet brides that's used his favorite choice for new Chevy visit ... today is to not you know and love zone the longest time jeopardy buying new roads sleep better\nOn any budget and mattresses ... Ninety nine he ran for three Ninety nine\nQueens and the only seven Ninety nine and ... that's for eight Ninety or nerve exaggerated delivered in these furnished your bedroom on any budget mattresses for last time the police and the only four Ninety nine five these resting that's only seven Ninety nine\nFor furniture master bedroom bridges thirty eight bucks a month\nOr Murphy bedroom best delivered\nThe coast to coast am ... years now available for Android as well as I ... it over the ability to download the most recent shows where you can listen to the ... the new impulse who has\nListen live streaming features most weekends ... upcoming ... ghost insiders with Android system board on June above war I'm check out our new ... the Google Play or I Do stores were linked ... [noise]\nHouston sounds good everywhere you know gay Google blight Katie our age and I are draining out [noise]\n\nThen we'll come back our final segment with David Porter with his work tipping point David and Charles Dickens classic a Christmas carol a Scrooge encounters Christmas yet to come the ghost\nAnd their peering through a window and he says are these things that will be or could be so I'll ask you that same question based on your scenarios outlined in tipping point or they events based on your best the thoughts\nThat will be or could be\nBy ... based on my worst thought George these are events that will will happen if we really screw up um fortunately um we do tend to screw\nUp rather on yes we do\nWe do in deed but they're warning signs for people aren't they kind of like wakeup calls\nBoiling you can see us responding already or remember three days ago the to be fifty to serve quote got lost arm quote\nYeah in the south China Sea have quote accidentally unquote flew over the Chinese occupied islands in this crowd lays\nA B. fifty twos don't get lost not have this\nReal or they take great pictures\nTo how that was a that was definitely a signal that was a signal that we're beginning to signal back you see the thing was um [noise]\nThe ah the period where we were sort of trying to get along is over the period where we were we were trying not to pick them off is over the period of alliance building has to be gone and the period of agnostic behavior is beginning\nWell that's no doubt that there's something else going on out there uh the big question David do we really have a star wars program yet\nA like a a satellite with a laser in orbit yes\nI think there was an experiment with that but I don't believe it was weaponized but really again that's an air force class trip I Am a navy guy\nYou are a navy guy let's hear in the navy [laughter] can I address us commander yes you can gosh we're year one more year I wouldn't have had a [laughter] but it's not too late\nHow about you what would you rank a captive I retired as Cal I should say ... to use in jeans or most or let's go to Florence, Arizona David's with us David go ahead or good morning gentleman wearing\nGood morning America [laughter] um I have I have a ... I have an extra fondness for China because my sixth grade teacher\nNamed Asher lived in China with her husband her husband her husband was an admiral stationed in China for a lotta years so I learned a lot about China and the sixth grade [noise] um I learned that she had a great fondness for the Chinese\nPeople mhm we need to distinguish between the Chinese people\nAnd then the government is the rules are dominated\nSyria we talked about that\nThere's another there's another type of power this program is about power but there was a there was another type of power that\nA candidate can win the day and that's the power of love Oh absolutely what it'll just talked about uh go ahead David\nIf if if it's surreal thing oh yeah I think the power of the power of love can overcome and I hope nothing that I said here remains or is taken that I don't wish Wilder China or to the Chinese people or that I don't wish for peace because I really do\nAnd I hope that my book is taken as a warning\nDislike um other writers who have written about possible wars they rode they wrote about them as um those warnings and I hope that's the way mine is taking\nYeah I mean there's no question nobody wants war nobody wants or what could be looming out there let's go to St Paul Minnesota hello Kevin Lutz squeeze un we've got time for a few more callers go ahead\n[noise] hey guys thank you very much is very interesting I'm kind of a almost ... backing out in the last caller I I\nDon't see any practical reason the United states or China would want to go to war with one another you know there are biggest supplier and what were their very best customer and they own a boatload of our debt I just can't see that would be\nBeneficial for either one of us I can see them trying to as you guys have to\nTake control of their a region and the thing that worries me just like the last caller sort of implied\nIs if there's a certain group of people and the Chinese government and our own government who see a few hundred million dead people as not that big of a deal and a winnable situation and\nI think um I think that's where the danger of oil really would come in\n[noise] okay well I mean I think that's a good question and I'll cook with her partner have you heard of a book called the great illusion [noise]\nIt was written before World War one and it's argument was because there was so much crave between Germany and Great Britain and because people were so friendly it was impossible for their ever could be a war between Germany and Great Britain\nAnd that was published just before World War one I don't think that the fact that there is a a water crave mean war cannot occur uh the second part of your question I think you're going to have to rephrase because I forgot what it was yeah\nI I think I think what your answer brings up really the the issue which is that there's a certain sector of people in our own government and probably in the Chinese government probably on the Russian government as well really don't regard\nThe welfare of the average person in their country as being the paramount importance or who they they see vying for power\n... and their own you know their own glory as excusable or taking entire countries to war and killing hundreds of millions of people and you know that that's just a little bit of a clip from the accounting or stop to be worried about\nI think you're talking about the military industrial complex and federal or President Eisenhower once route\nAnd uh the question is you know who put these people in power and I think the ultimate answer is we do and if we're going to acquiesce in what they do have if we don't like it or we need to remove them\nI think one reason why it appears that Donald Trump is so a popular right now David is that he is so off the beaten path um like mainstream America is fed up with everything he touches a nerve there's going to be an interesting election\nOh yeah well you know Trump or listen to it here pirates and the guy speaks his mind and that really like you say that ... nerve and it's kind of refreshing in a way I'm not one of is a big supporter but it's refreshing to hear somebody speaking his mind even if you disagree with what he says\nHe claims that he loves the Chinese and he knows how to negotiate with them I Hope he's right\nWell you know you sit down with a with somebody like that and are you may come away feeling like you got the better part of a deal and\nYou may find out how to get that you didn't exactly because they're\nThinking how many like Trump if you're thinking for the next quarter to show a profit attorneys are you thinking ... generation down and write up\nThat's right they've always done that David we're out of time have yourself a great Christmas with you and your family in a thank you captain for everything you've done\nLike Georgia after all your listeners\nDavid ... the name of the book tipping point up next we're going to be talking about\nThe spirit realm and don't forget live programs for you on Christmas Eve and Christmas Night live programs\nNo tape will be feeling lost not close to your radio grab your smartphone or computer and listen to I hard radio pick up the free I hard radio apps and the app store or go to I hard radio dot com [noise]\nNews [noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\nIt's not watch you know it's you know\nI this is Jerry rental car broke and I spent over two years in Houston making sure\nI personally know every single ... side we're serious about having an outstanding car buying experience and getting special carpet pressing then go to court pro USA dot com now for your VIPs certificate to see my friends they deem that greenway bonds\nTo grow you live\nMothers' day about comedy and Archie over\nDay I Know you've heard about ... and how can make you feel weak moody on motivated and less interested in sex but did you know that normal testosterone levels can still leave you with low T it's true it's energetic measure not just total testosterone\nBut also the level it's actually available for your body to use then they customize treatments W feel not just better but great costs energetic spray free low T test eight three three six low T\nH three three six low T or check out eight three three six low T dot com\nI this is Jimmy burned for Bill a bunch of dot com if you have a cell phone pay TV electricity Internet her home in auto insurance you really need to listen up because every week bill advisor is winning for hundreds of our listeners there now so competed they doubled their savings guarantee from one hundred fifty three hundred dollars if they can see me at least three hundred bucks you get everybody back\nNo set up the soldiers told Ninety nine per month starts at me right now takes the word ... geo to twenty three twenty three twenty three or go to bill advisor dot com and click start saving this report is brought to buy stand up to cancer\nOr I'm Tony ... Twenty years ago when my mom had lung cancer and she didn't have any choice do you do\nHave you been diagnosed with lung cancer\nWe stand up to cancer dot org slash lung cancer or\n[noise]\nFurniture made in America studios this piece of news radio seven forty Katie our age bused in orange radio station tropical storm\nMichael on the way to Florida I'm done mostly Downey it's ten o'clock on news radio seven forty Katie our age with traffic and whether together will\n\n\nGeorge and already back here coast to coast am tonight we're going to talk about the spirit route to the eyes of a hypnotists\nTim Barkley is that hypnotists de certified in quantum healing\nHypnosis therapy he's also certified in what is called accelerated resolution therapy we'll talk about that which of course as the eye movements thirty therapy timbers created data state therapy\nAnd that's a therapeutic and spiritual break to he has ten years of experience and is conducted thousands of sessions helping people eliminate\nEmotional habitual and physical disorders as well and here he is on the coast to coast I'm looking forward to this Tim welcome to the show\nIs George it's good to be here how what\nTo win bowl didn't hit the ...\n[noise] well my father actually was a pretty overweight and unfortunately he passed away a due to a second a heart attack back in Nineteen eighty five\nAnd that type of prompted me to want to put together like some kind of a product that would help people lose weight you know and get their health back mhm why did is I have this idea to put together\nLike a weight loss product based on subliminal messaging and hypnosis and a friend of mine said well you know if you're going to do that you should really become certified and hypnosis\nYou know to add some credence to cheer product that's right that's a you know I thought that was a good idea so that's what I did I went out and I uh I researched wheel the best schools in the country\nAnd I went through a lot of those schools\nAnd I tell you it live once I learned to I was just blown away I was so I I literally through eight hundred copies of that program in the garbage and I started to practice and uh that's what I've been doing ever since\nWhen people knew Shirley went to you to him as a certified hypnotists would they you know doing it for a way to smoking and anxiety and all these other things\nOver yeah ah it's it's you know emotional problems like a you know like self esteem\nOr post traumatic stress fears you know could be simple fears like I I Can't cross the British shot in the United states a depression anxiety things like that\nAnd then also like habitual types of things like alcoholism and the abuse\nOr I kind of place weight loss into that category as well and then um a lot of physical types of things like in especially ones that that are syndromes like a fibromyalgia chronic fatigue\nHonorable bottles restless leg syndrome\nUm people ... people mentioned that word syndrome work that really is it's like when you go to the doctor and they check you out you know they do blood work they do X rays from our eyes and if they come up with nothing that's why they created this word syndrome\nBecause they want to give you some kind of diagnosis you know so you can go back to your family and the people at work and you can say well you know I Do have you know your ... syndrome\nYet they can't really find anything at all inside your body so I'm\nUsing hypnosis you can clear those away really very quickly uh there's been you know many times\nI've worked with people that have had like let's say fibromyalgia and fibromyalgia is like pain points in the body [noise] also usually people that I have that they also have chronic fatigue\nOr they have a really hard time you know functioning throughout the day because they have like no energy\nAnd to um you know using hypnosis I've worked with people that have had that for like you know Twenty years Thirty years and their life is really pretty difficult in within even as short as one session but oh it's gone\nThat is it is I mean I've always heard Tim that people who can't people can't be told what to do if they don't want to do it under hypnosis but is is that true or can you really you know somebody to lose weight hypnosis might not help him is that true\nWell in regular hypnosis um yeah you really can't control people\nUh you know like if you look you know what it really is is hypnosis is pushing that thinking conscious mind to the side and then speaking more directly with the subconscious mind\nIn regular hypnosis the thinking analytical conscious minds it's still there\nSo like if you know I put you into hypnosis\nAnd let's say you're a Democrat and I'm going to try to make you a Republican or per se or I could do this big case you know and then when we're done and I urge you you're you're really not going to switch over because the conscious mind is still there\nHowever this new typos hypnosis that I created it's called the the state therapy that's what I call it a its roots are based on something called sleep hypnosis\nSo what that really is and we can talk about a little a little more later 'cause it's really I'm a breakthrough to be honest with you what it is it's guiding that thinking analytical conscious mind\nTotally away I mean it's gone so it's sleeping then what you can do is talk directly with the subconscious mind and your client is actually talking to you while they're sleeping now in that state\nHonestly it is possible to control people\nWant to bring it I'm Sorry what's that ...\nThat's a breakthrough that to be able to have them do that\n[noise] yeah actually the roots of that go back to the Nineteen fifties a there was a very famous hypnotists his name was Dave Alvin and what he did his his son yeah I think it was the asthma where it was a breathing disorder\nWhat he did his he's snuck into his son's room while his son was sleeping\nAnd he could see the hand of his south you know his son's hand and he went in there and very quietly and he said this is sad you can hear me but you can't wake up this is dead you can hear me\nBut you can't wake up and we kept repeating that very quietly and then he said when you can hear me raise your index finger and after a couple of minutes his son's index finger pointing it went out\nSo what he did he conducted a full blown hypnosis session going after this breathing problems and he did that a couple of nights in a row\nLo and behold his son's breathing problem disappeared also his son had no idea that he had done that\nSo he did and started doing that in his practice um in some other people have tried to do that through the years unfortunately it's like really really difficult to get somebody into that state\nAnd I spent the last ... I mean I'm Talking solid three years working on this and I'm I've developed a in a way where it's actually pretty easy and I get you know we have a ten people into that state\nThat's amazing when they're there that thinking conscious mind is sleep all it's not there at all so when a person is in that state you actually um you know could make them a Democrat or Republican\n[laughter] I mean what you said that's\nThe secret that's the secret that's what we need to do all of them change from\nYeah exactly like like conducting the weight loss sessions I don't know if you've ever heard of this it was a pretty big deal about six or seven years ago I had something called the virtual gastric bands so like a a regular person\nCan go you know to the doctor they can go through surgery and they can get\nKnow their stomach fitted with a band were writing on their clothes off the stomach\nAlmost like these little ... smaller or something like a\n... exactly exactly so so that person now instead of their stomach thing really large it's the site\nAs of like like a like a golf ball it's really small and they get fall very quickly therefore they lose a lot of weight a well\nYou can do that with that analysis or even a regular hypnosis but with this new way the south the to stay away or sleep hypnosis way what you say is fact so you put somebody into that state\nAnd you basically build this story up saying hey you know what your stomach is the size of a golf ball it just simply cannot eat more than five bites the food and what's cool about it is then you can tell them how happy they are to do it\nTraffic and whether together fears that Kilian\nBulbs on those were hit against the fourth quarter it is ... versus Texans everything's even up\nTo keep an eye did energy stadium because the south loop at Kirby and Bannon will be highly congested once that game gets out besides that ongoing row construction I ... it was bound between magnolia into Sheldon while the shutdown that construction is ongoing until five AM\n... billion in the ... Gulf Coast windows dot com twenty four hour traffic center\nAll the attention will be on tropical storm\nMichael out in the southern Gulf of Mexico looked at target the northern Gulf here where we could see some indirect effects as far as high waves are concerned more than I Do mostly part of the ... guy twenty percent chance or a stray shower storm low bloated step niece or ... percent chance of showers and storms Monday and Tuesday I mean does ... Weather Channel\nSeventy degrees up at the woodland in Seventy nine that the Katie our age top tax vendors twenty four hour weather center\nKatie are age ... ten thirty one well they're battling out over at energies they be um tonight bits are tied up\nAt sixteen all and it looks like they may be going into overtime to a settled the big game so we'll keep you posted on that side again the Texans and the cowboys are going into overtime they uh are tied at sixteen all\nAnd taking a look at us politics Sen Lindsey Graham's relieve the efforts to the rail Brett Kavanaugh Supreme Court nomination failed he told Fox News he's pleased the efforts to destroy your man he's known for Twenty years\nFell short Astros in Cleveland they're looking for the third and last necessary went against the Indians the pre game starts to deliver tomorrow morning any bill that game on sports talk seven Ninety news on the ... dot com or next updates going to\nBe at eleven o'clock\nI'm done mostly they only on Houston's news weather and traffic station news radio seven forty Katie are age\n... ready to unleash a world of information ball you asked to do is ask\nHe don't even have to ask night's sleep I literally have nothing else to do\nI like to placate G. R. H. I. arts radio\nThanks for asking this report is brought to you by Houston tram star it takes only ten minutes for the inside of a parked car to reach deadly temperatures don't let distractions get in the way of remembering precious cargo putting one of your shoes in the backseat near your child is just one strategy to avoid tragedy [noise]\nIs the nation's largest geek speed network\nBeyond that is the complete reliability of forty out to the fact\nThat means whether you're downloading the file [noise] life in credit card [noise] my email in your town team our customers\nYour business turns on line even if the power goes out when you're younger you need speed and reliability for a limited time to make the switch to compact fitness and get an amazing deal on facts reliable Internet\nOne more way you can take your beyond faster\nLiable Internet an ad voice for just twenty four Ninety five more for my call one eight hundred five oh one six housing today [noise] ... [noise] yawn fat\nOffer installed Twenty one Eighteen restrictions applying not available in all areas when did the one voice went under ... only to come to the customers fairly combination requires Comcast is the Internet that additional monthly\nCharge equipment taxes and fees extra and subject to change connection pro backup limited up to six hours\nHello I'm Nancy Phyllis I'm speaking to you today from my home in California you announced it indoors they don't work for\nA ski part of my car but yeah that should I Do I Swear in front of children in ride skateboard quite you've got to keep our Greece all over the floors well that's not all skateboard Greece set limits perspiration because I'm very sweaty well I guess I'd better call steam cleaning or you could go on line and do steam dot com set a date out [noise]\n[noise]\n[noise]\nPremier network so this is an encore presentation goes to goes to the Georgian or another milestone\nFor paranormal d'etat calm we're not over thirty three thousand members and it's clicking along so let's go for thirty four thousand jump on board to be up and signed up it's free to sign up at paranormal date dot com\nAnd also there is a companion site called conspiracy date dot com which is really cool for people who are really just into conspiracies and that's just great way to meet other people like that now also\nWe've got apps for paranormal date dot com you've got apps for the Android phone now in your Google Play store under paranormal date and you've also got the apps for the iPhone\nFor your apple devices right phones and you're right pets will take advantage of but those are free as well grab them have some fun in a again it's all free to sign up and uh she weren't takes you paranormal date dot com and conspiracy date dot com [noise]\nNews radio seven forty Katie our age [noise]\nThis is Sarah prior fend Houston's morning news liking us on Facebook actually put some useful news and your news feed like random selfies and pictures of what people are eating well sorry go to Katie ... dot com and click the blue like button\nBeing president is making me ... I Need a Diet Coke you should contact Rome refreshments and have them set up a micro marketing the White House freshman ... that\nLook there's nothing worse than having meetings that go through the middle of the day just to have employees take a break because they want to go out to Starbucks with Rome refreshments you could have a little convenience store set up right in the break room of your office and they even have Diet Coke ... an easy way to get a Diet Coke without walking in the public and actually\nTalking to people from our information go to Rome or fresh dot com maybe I don't say it\nEnough but I appreciate\nAll the you our listeners supporters sponsors do for our show I talked to ... a lot\nOwn a ... a design their infringement\nAnd they will tell me and they won't tell me who the people are because they think their lawyers or something that you give me details but they'll say you know we had a lady come in from bill in the blank and she bought her ... her husband came in and he did this thank you all for supporting Cory ... designed to a one for eight to forty seven fifty five\n[noise] you know we just talked in sprinkler in the winter months you loan me a lot less water has been shut me in the winter\nOn things like that and let me walk\nFor a moment even if it's not a hurricane knocking your power out it could be just an everyday storm here in Houston get peace of mind knowing that you will never be without power get your ... by generator now from generator super center to write one to five one sixty one hundred to eight one to five one sixty one hundred\n... news weather and traffic Alexa blade gay G R Adrian I R D radio [noise]\nWelcome back to coast to coast Tim ... Bartley with us as we talk about hypnotism tomb we were talking about how people can protect themselves so that these demons under hypnosis don't leak through tricky new taking over them in that you were talking about the white light for protection but elaborate a little bit more for us\nYeah basically before we get in to channeling any kind of spirit at all\nYou basically want to call in you know like God's white light so you want to fill\nA base really fill the person's body you know I have um imagine like a white like coming down hitting their heart center and then ballooning out and then basically in the developing them in like like a balloon\nAnd then the ... have like little tiny mirrors that only out or so of any kind of negative spirit tries to come in\nThere basically reflected out with those mirrors and actually that's a really good idea for like ghost hunters you know like you watch these goes hunting shows and sometimes\nThey'll go counter will go into like a haunted location\nAnd say okay if if you want to attack anybody you can attack me [laughter] you know\nWhich is ridiculous why would you ever want that right so um yeah setting a protection you know it's really important which uh you you don't want to have any kind of attachments ... home so to speak\nThat no that's absolutely right and it could be dangerous for you to him as the hypnotists for these things to leak through\nYeah exactly exactly and you know also you you you want to make sure that the spirit you know there's there's no doubt that you can channel spirits and talk to them\nIf you get a spirit that are not the nicest energy you know they could give you like Ninety five percent accurate information and then the last five percent they might be like yanking your chain you know how to I mean so are you really want to protect against that kind of thing as well\nUh yeah I wouldn't want to hypnotize someone driving you know per se but\nI mean would they get in an accident or would they be better drivers\nWell actually you know if you think about driving your car\nConsciously you're not really thinking about a whole lot you know you've driven so many years that that you know everything's automatic and the automatic part of that is your subconscious so a lot of people driving are in hypnosis but\nThey're they're not crashing you know they're not driving off the freeway so that's that's actually I don't know what the percentage would be but it's actually pretty common\nKind of it's almost like these uh automatic cars that they're going to develop\nA show it exactly exactly yeah\nCan you hit the ties someone for memory and recollection\nOr you can actually um I've had people that have forgotten ... I actually not too long ago worked with a high school students who had an altercation at school and for some reason I\nCouldn't remember the details of that\nOkay and and why why would they want you to hypnotize the person to pull out the details the police or the parents who who wanted that done\nYeah actually actually the child the one of that done really okay yeah yeah that I work with but um\nOr or I was once in a while to get someone that like the law something mhm\nOccurring are there and watch or something and uh you can trace breach trace their steps you know what's really call is your subconscious remembers\nEverything everything yeah like I can\nRegress people back to the ... you know and and they they they share people talking in the room um their own for obviously past lives\nI'm convinced him if you're at in a band speaking before two hundred people\nAnd you look out over the crowd your physical mind you're not going to remember a lot of people but your subconscious literally takes have photographic picture of that entire room and it's in there you just need to pull it out but it would recollect everybody who's in that room\nYeah exactly you know I've worked with a couple of people that have had multiple strokes\nAnd their short term memory which is in the conscious mind was horrible I mean they couldn't remember what what they did an hour ago and then you put them in hypnosis and they can remember absolutely everything\nSo that's really or is that you know your subconscious mind is really really powerful and your conscious mind is kind of Mr stupid that's really kind of wanted acquaintances too and um\nYou know the the the hypnotic state what you can do with it is so powerful I I really do believe as as time progressive um especially with like the sweet hypnosis there's so many applications for us\nYou know I'm you know like if if someone gets cancer instead of going in for chemotherapy first guess what you should pull out your spirit guide and find out what the heck's going on for years and a lot of times your spirit guy will will fix shoe\nOn a few things\nAre the spirit guide you in your opinion Tim ... is it their duty to make things good for you\nIt is what they do is they're talking to you all the time most people are ignoring now\nSo what fill them it was the ramped it up and moving in to the body\nSo you might like some kind of physical disorder and then if you ignore that then they ramp that at all and it gets worse and worse\nOr it might go to the point where you died I mean they ... and their perspective is different than ours because\nThey're on the other side of life and they're well they're really you know that uh we're just here down here you know down here on earth school to learn a lesson that's why we're here so I'm trying to get your attention\nAnd what's interesting is when you talk to spare guy\nUm I always ask them a couple of questions just see what the heck's going on I'm like let's say let's say somebody ... answer All right\nSo I'll ask them out they have a ... they sign up for this is this in their life charm you know like before they came here did they say hey I Would like to experience cancer\nWho would say that though to me what's there who would want to say that\nWell you have to think of it from the perspective of us here because you're coming down here to learn certain ... bay so working through cancer or something that's really the call\nYour it's so it's a left and it's a learning so you might you might sign up for that you might find for a couple of horrible Aaron\nYou know you sign up for stuff so I'll ask them did they sign up for it and they might say no and then I'll ask them if anything to do what\nHarm now karma is hey that yeah no yeah so so do they have to pay back anything because they didn't have anything to do with ... we've heard that phrase or we can't repeat on the radio\nYeah yeah so they might say yes or no and then I asked is this related choice past life\nAnd um oh I don't know maybe thirty forty percent of the time they'll say yeah\nAnd then I'll then I'll ask well do we need to go there and and look at anything and if they say yeah then we will then I'll take them back into that past flight into a specific or that has everything to do it for days problem um\nOr a lotta times they'll say yeah it has something to do with the past why\nAnd then I'll say well this person to hang on to that any longer and they'll say no and then I said well do you think you could go ahead and break that for them now and mostly most of the time they'll just say we've already down there we just at a\nBar and stay with us Tim we're gonna come back and take some phone calls and talk more about hypnosis if you've been hypnotized definitely check in with us\nTell us why you had to go through that and we're going to talk more about spirit guide CIA about the past lives\nMuch more with Tim partly on coast to coast they\nFind out more about tonight's gifts to log on to coast to coast am dot com\nWas I hard radio when Mike you just see Fleetwood Mac lives\nWe find is\nHis house was\nOf a success on their own income when you get\n... max north Americans who are\nFinding is that we wouldn't magnet uncommon\nJesse Kelly here for family owned and operated more security you can be sure she's Joe when jobs will take care of your family with the liberty safe check out more security saved dot com the mores and liberty saves American born American made\nYou guys can hear from the hip tied cast today's grows\nWho would win at three mile bicycle racing eleven year old girl or last year's winner the Tour de France\nIt all depends on the bicycle it depends on their vehicle both Senate ten speed in the ... gonna win every time but but the race around the trace Ikle and the eleven year old when every time you see it's not the driver it's the vehicle\nWhen it comes to generating revenue it's exactly the same if you have a job or a small business you are writing a tricycle you can only go so fast if you need to make up ... it's not going to happen on a tray sickle no matter how fast you pedal it's simply not going to win the race\nWhy do many people with no schooling in New advanced degree often become very wealthy simple they choose to only right ten speech\nWhen it comes to helping people create their next revenue model both for joining recommend income store as a can't miss when it comes to putting people in a ten speed could your household or business using additional revenue model that doesn't solely dependent and you have so you need to check out income store dot com that's income store dot com this report\nHas brought you buy atlas foundation repair\nOld friends of the ones you can trust like I'd listened Asian repair Houston has precedent listens Nineteen Seventy seven were foundation driveways sidewalk and under slap plumbing repaired atlas is the answer local experienced trusted endless foundation dot net\n[noise]\nFurniture made in America studios missed his use radio seven forty Katie our age used to and I are in radio station a primetime\nVictory for the Houston Texans I'm almost be down and gets a lot of the clocks on news radio seven forty Katie our age with traffic and whether together spheres that kill your\nJob is going to be a lot of happy Texan fans and a lot of disappointed cowboys fans leaving an energy park with the Texans winning the game Nineteen sixteen so south moving Caribbean fan and we'll be highly congested\nI think they did dominate the planet for a long time\nUntil Seventeen Seventy six because the founding fathers decided to form a new form of government one that was based on the laws that were eternal certain rights that people have that or an alien ... all the ... ball or the people that have ruled the earth shifted cool they didn't like that\nSo for two hundred and forty two years they've been trying to get it back\nAnd we America has had that the fight that we see going on right now\nDoesn't still feel out of kilter golf too you know there's something wrong\nA grand force is out there that need not just once they need to capture the soul of the world but\nI think they're going to win I don't think they're going to win [noise]\nLocal news weather and traffic Alexa Blaine Katie our age and I are draining out [noise]\n\n\nOkay well come back to coast to coast guard Lee with us we're going to get your calls in just a second year as well and we were talking about it in terms of\nPeople's ability to want to get hypnotized or not uh in what they have to go through but also what about their past lives have you done regression hypnotism at all\nUh yeah yeah sometimes people will spontaneously go into a path flyer and then of course other people you know come to me and they they they want to do past lives\nSo um yeah it it's pretty interesting and of course some time as what's going on in their lifetime right now is directly related to a past life um I worked with a woman won a she came to me for weight loss\nAnd she was pinching on food she just couldn't stop binge drinking on food and she spontaneously went to a couple of past lives both of which were she starved to death\nOr one she was imprisoned in jail or literally you know tied up with chains and they weren't feeding her and she died and another one when she was in a small boats and she was the last you know out at sea\nAnd she actually found land but she was so weak that she actually passed away before she could get to land\nSo um that actually happens it's pretty interesting\nWhat are some of the best stories that you recollect from doing a ... hypnosis or work with people\nWell I tell you one personal one I have is I used to be the worst public speaking I mean I Would get up in front of a group and my heart was racing and it was horrible and I went through a regular hypnosis session\nAnd it seemed to fix it because I was actually a seminar a seminar speaker for awhile and bought a while I was up there talking for oh twenty seconds\nTo a minute I Would get that that fear those\nTwins [laughter] and and\nAnd then along it it didn't last like twenty seconds it lasted for like three or four minutes so I'm like\nOkay I I've got to go and do another session so what happened there there's a way to do a half life\nWhich is really pretty cold there's different ways to conduct that kind of session but in this session you have the person imagine they're in a hallway and the wall and the ... is just a slew wall and the wall on the right is a series of doorways\nEach doorway represents a past life\nSo a friend of mine did this he says now I'm going to count from three down one asks account of one\nYou know either one doorway or several doorways will eliminate with life\nAny past life that has anything to do with this fear public speaking\nThree to one and three doors illuminated so I walked through the first door and I was I I Believe it was like the early Seventeen hungry\nI represented the government and I had gone to this town and the townspeople were gathering below me on the side of the hill and they looked like they were going to kill me\n[laughter] I'm Serious and and and back in those days that happened\nYou know so uh I had that here then I came back into the hallway and I've progress through the second door this time I was a woman\nAnd as strange as it sounds we actually do change sexes sometimes we're a man some times where a woman\nAnd I was in front of a group\nAnd it was like a room that was kind of half inside half outside and there was like fifty sixty people they're all these people that I knew my father was sitting there and they accuse me of feeling this this precious item\nAnd I knew that I had stolen before but I was appalled that that number one they thought I would've stole this I get off and that they actually were column young for everybody\nAnd then boom I step back and look a hallway that I went through the third door this time as strange as it sounds I basically was the caves ma'am [laughter] I was living in a cave\nA kind of like Fred Flintstone garb and the thing is though I was amazed theaters I weighed like maybe you know eighty Ninety pounds and I was laying on the floor of the ... have you know sick\nI heard these noises coming in from outside so I'd drag myself to the front of the\nCave and like all the like the tribes people were outside the cave like I'd look over to the left and there was like three women look over to the right and there was like you know five or six men and women there are there are all in front of me and\nI couldn't understand what they were doing I was totally confused and then a woman came up and handed me a gift which was like this box that was like a woven Fox that she made out of Reed\nAnd then it hit me like a ton of bricks what they were doing is this was a ritual to basically said farewell to someone that the dying\nAnd I'm telling you it hit me like a ton of bricks I'm like\nI'm like no no no I'm not I'm not going to die I'm sick but but I'm not going to die\nAnd then the hidden and just said well did you die and I'm like yeah\n[laughter] I Love them\nBut the interesting thing is is when you do past lives you don't have to do any kind of therapy you just have to see what the heck was going on and um after that session that's why I no longer got that twinge of fear anymore so that was pretty cool\nSounds like you're doing it the right way\nLet's go to the phones Lance in Abilene, Texas east of the Rockies hey Lance good morning\nMormon judge point Tim I'm already work about ... ... and it's like a chemical attack in the eighties\nAnd that I Would more and more of a the sessions I started doubting myself wondering how not to this is my tuition how much is my imagination and so I started testing these are\nThe guys I mean case would go with green I had a a stepfather had died of cancer that kept him visiting me so I planned my dream that I Would ask him what his mother's maiden name was because I didn't know it and I knew I Would be able to verify that Italy or time\nSo when he came in a we had an earthquake conversation or whatever and I have some so what's your mom was middle name and he gave her name and I do quite a number with the name was when I woke up but when I found out what her maiden name was I knew that it wasn't the name given to me in the green\nI happened to the second time and ask for Social Security number and you got apprehensive and when I found is these guys will be apprehensive with envy one question so I devised a couple of test um Bruce inside of a boss\nWho's girlfriend wouldn't have sex with him anymore because she said in the past life that she was with this it gets in print and that she was going to save herself for him in the next\nAnd south bound that area near energy stadium is going to be quite congested ... Kilian in the ... Gulf Coast windows dot com twenty four hour traffic center\nMost of the county for tonight training hardly Connie overnight no twenty percent chance would shower or stormed those buildings that may make clubs don't shine where your Monday Columbus Day with him to ... percent chance of showers and storms were breezy hide mid ... he's a bigger percent chance of getting storms again on Tuesday hide mid eighties I mean does ... Weather Channel\nSeventy degrees up in the lens and Seventy nine degrees at the west side north side Lexus twenty four hour weather center Katie or each news time eleven thirty one our top story\nThe Astros work uh getting ready for their big game tomorrow as the Texans tonight at a victory in overtime they beat the Dallas Cowboys Nineteen to sixteen\nAndy Andre Hopkins had one hundred and fifty one yard receiving by the way that a game tomorrow on\nWho's going to be on sports talk seven Ninety starts at eleven o'clock and it'll be a ... a will be doing the pitching\nBiggest October November ... October movie weekend in history a venom was number one it made eighty million dollars\nAnd twenty people killed in a deadly limo accident about Seventy miles north of New York city the limo ran a stop sign tropical storm Michael\nIs on its way to Florida the governor there is declared a state of emergency news on demand Katie are each dot com or to update at midnight I'm drawn wants to be on Houston zoos weather and traffic station news radio seven forty Katie our age\nIn my house whether your money and now let's hear your\nBused in the morning news with Jimmy marriage I share a prior tomorrow five to eight good life better lived in your life\nEvery day my news radio Devin for\nK. DRA this report is rocky you by Houston tramp star drivers risk their lives any time they get out of their vehicles on the freeway whenever possible move off the road after an accident otherwise the only thing separating knew from high speed traffic is up in white line\nIt's not watch you know it's you know\nI this is Jerry rental car broke and I've spent over two years in Houston making sure I personally know every single day versus ... certified beer serious about having an outstanding car buying experience and getting special corporate pressing\nThen go to Carl pro USA dot com now for your VIPs certificate to save my friend ... Murphy Fred how story over the world\n[noise] do you live\nIf you want to quality front door\nForged iron ore traditional front or back door we got the ... from my house southern front dot com locally owned and operated to eight one eight nine oh fifty eight sixty to a one eight nine ... fifty eight sixty good people incredible brought up\nTheir front doors I got to forge darned or so we can see out but it's safety first it looks great southern front dot com to a one eight nine oh fifty eight sixty\nWe created I heard radios you can put it in your pocket a ticket everywhere you go you can stream our station on your own laptop and on over two hundred other devices Paul your favorite music and all your favorite stations all free tired radio with them green eyes heart radio as you can type in the name of your\nFavorite artist as you've done some sober down we personally the stations have been you better\nBad easy type in the name of an artist and let us get to work as easy to use that phrase the radio and download our free I hardly ... today\n[laughter]\nLong gone nowhere\nLong way\nKnow\n\n\nReason to\n\nYou were listening to the best to George ... on the coast to coast again even\nThough Christmas is just a few days or way we're going to be keeping the door open for the holiday magical style\nCD [noise] the proceeds benefiting veterans you can pick it up I'm going to our website coast to coast am dot com\nAnd look at the highlight reel and click that picture we're going to keep this up for a few more days probably through January first and then uh take it down and maybe bring it out again next year but she's got a coast to coast am dot com\nAnd look for the holiday magic coasts ... style CD [noise]\nNews radio seven forty Katie our age [noise]\nMusic our years\nBefore you're wrong by their beer whether\nCrank up though forecasts radio\n...\nIs the nation's largest ski speed network\nBeyond that if the complete reliability of four G. al ...\nThat means whether you're downloading the pile [noise] biking credit card [noise] my email and your ...\nYour business turns on line even if the power goes out when you're younger you need to eat and reliability for a limited time to make the switch to compact fitness and get an amazing deal on facts reliable Internet one more weight you can take your bit beyond faster\nLiable Internet an ad voice protests twenty four Ninety five more for my call one eight hundred five oh one six housing today contacted the on fat\nOffering twelve Twenty one Eighteen restrictions applying not available in all areas when did the one Washington or be able to only the new Comcast fitness customers fairly combination be applying requires Comcast is the Internet that additional monthly\nCharge equipment taxes and fees extra and subject to change connection pro backup limited up to six hours\nHey Houston Maurice ... was red link\nI think about Houston in Texas I think among people who exemplifies\nThe American spirit angry that red\nLine cotton we to them the beard sewn into our bed sheets and\nWe'd grows a cotton in Alabama and it's completely manufactured in the U.S saying we invite you to Dr Powell will use them from Houston do you get twenty percent of voters two hundred dollars to just go to rent land cotton dot com that's ... dot com\nIs looking to sell your home Colin looking with ... June or Williams to read one he's six one forty six twenty four to eight one eight six one forty six twenty four more in line to Luke and group\n[noise]\n\n\nWalking back to coast to coast is is our final segment Tim Burton Lee with us our special guest as we're talking about the ... spirit Rome let's go to Los Angeles Shani is with us ... go ahead\n[noise] I think given the opportunity to ask a question and it's been on my mind\nFor a while so I'm grateful to have this platform with you um how do you feel about entering the realm of a hypnosis and the subconscious mind delivering information that he might have been\nProgrammed to forget not by a thousand people or you know not by on anything that may have happened on earth but speaking in terms of uh abductions\nOkay that's a good question you know some people get hypnotized said that they can remember is that an inclination\nThat they've then you know taken and then they get hypnotized and some of hunger is horrible or from you know I think it's all part of a Democrat but when you feel like I was close to remember this event okay I kinda think ... I Hope that says\nAnd then [noise] find some stuff out but I'm a little scared [noise] you'd be afraid of uh Tim\nI use very guy you know what you can\n... make you sick ... I I Want to know how to make us that we can can my parents' guides item like an ... ... and my second question and like if you get the ... and you can find\nOut why don't you can't\nGo ahead\nYeah sure um yeah basically\nI'm your spirit guys actually love you they're not really trying to hurt you or anything but they are trying to get your attention\nSo in order to get connected with them the best way\nYou couldn't meditate um but just you know maybe once a day or once in awhile quiet your mind and just see what pops up because they weren't very very very quickly there vibration all state is way faster than ours\nSo what you want to do is pay attention to those stray off and\nAlso like maybe you're walking outside\nAnd something happens maybe like a butterfly like flies in front of you were some some kind of animal or some kind of song comes on the radio and it's like oh well that's interesting those are the ways that they communicate with you\nAnd if you if you learn to pay attention to that\nThen it's it's like trusting your intuition\nIt's not like they're going to come down and say\nYou know you need to do with the you know it's not that direct that's not the way it works\nOr they also come to you in dream so if you wake up in New in like one of them that was kind of a funny dream kind of kind of think about what it was how does it relate to your life and you'll be again she can get those messages coming through\n'em and the other the other question you had about about demons ... they're going to get you\nWell I'm I'll be honest with you demons or just energy is like you and I I've actually gotten rid of a whole bunch of those off of people\nUm the way I Do that it's it's kind of interesting I tell them to look inside themselves\nTake a close look at themselves and once they always know what it is just a speck of life\nAnd then I say just keep focusing on that light all you have to do is recognize that they don't wait about ten seconds and the light basically begins to envelop them\nAnd asked her if it takes like two minutes so I mean it's real quick then all of a sudden they go from being like this nasty theme on it I'm going to hurt you kind of an opportunity to be in like the most friendly person you could ever talk to\nJust just fat queer seriously so like when you watch those go shows and you know you get a priest in the house and they're casting out the demon\nIn my opinion that's like the worst thing you could do because guess was\nWorse the demon going is going to show up next door you know number one number two you're not really helping that energy you know there are still operating under a bunch of lives really\nAnd it's so easy to change him into a nice city it's so simple they just have to recognize what they're really made off off and then they change into a very very friendly energy\nLet's go to Eugene Oregon Adriana is with those good morning go ahead\nOh good morning gentlemen George with us from dating show\nWomen in all\nThe points that you and your guest pun and how can I can just hiring and also anyway I had one guy and it's actually today's his birthday is twenty twenty two on he\nUm came into my life I um my mom unfortunately ... kind of like his whole brain\nCan learn a long long um [noise] um he came to me and then coming on I was explaining to her guy you know he this gentleman ... hoping long she said she would laugh\nOkay um well I I don't know how can you know so she won't go on about\nHip hop crumble for about ... ... that whole issue of how my mother at home or want to go you know I Know when they go out to get ... or ...\nOr ... or ... or like a hot air travel and viral and health issues with well why don't more on the ... or ... well ... find out why we're\nWell All right and I only have thirty seconds left Timmy go ahead [noise]\n[noise] yeah it's like I said before it's all the thing if I was working with them I find out how we feeling and what is the worst and then in session I Would play there I Would say that oh sure\nAnd I would read ... back to where it all started which is usually early childhood once we found that of that we would change their little directing gesture and that would be cleared away\nThat would do attempt might have a great Christmas my friend and thank you so hard on the program really enjoyed it Tim Barclay his website linked up at coast to coast am\nDot com [noise]\nFor ... go on the bubble Johnson Tom Dan Hi Lisa lion leaped Sloan who'd Sean modest shore Greg ... bishop Stephanie Smith Chris balls and George snap I'm George ... somewhere else or on coast to coast am we'll see you\nOur next edition until then be said for every one [noise]\nHi\nThis is misleading where there are ready with like you to see Fleetwood Mac and live such a\nHuge amount of material you've always go to imagine how it is ... I'm being part of the show would you be motivated would you be going forward would you be scientists would you be moved and I think that's really where\nWe would max north Americans who are\nBuying tickets and we wouldn't match dot com we used in really when he first to see the blue angel\nScreaming says much more fun for the whole family as a special tribute to veterans this year purchase your ticket to we used to dot com and type in the camp hope that one dollar ticket due to camp hope\nAnd our house nicer complicated either my wife is freezing or I'm roasting Hi I'm Scott tan and founder of bone branch makers of the world's most comfortable seats loved by three us presidents for a limited time are unbelievably soft warm and breathe herbal flannel banning is back\nBecoming fourteen stunning patterns and colors your shirt or find something you love go bowling branch dot com for fifty dollars off plus free shipping with promo code relief but one branch dot com promo code relief\nIf you have hard water the lime scale not only leads white spots plugs pipes and breaks down appliances costing you hundreds of dollars in energy and wear\nEliminate lines scaling other water issues like brown standing bad odors and lead with hydro care water products available from way home solutions waves affordable systems don't use salt or chemicals you'll love the way your water tastes smells and looks satisfaction guaranteed for more information go to good Clearwater dot com\nThat's good Clearwater dot com\nThis report is brought to you by Houston tram star drivers risk their lives any time they get out of their vehicles on the freeway whenever possible move off the road after an accident otherwise the only thing separating knew from high speed traffic is that didn't white line\n[noise]\nThe latest news\nFurniture made in America studios this piece of news radio seven forty Katie our age Houston and I are the radio station is a good\nNight at an R. G. stadium I'm mostly out of its twelve o'clock midnight on news radio seven forty ... each with traffic and whether we gather here is that Kelly\nAnd the Supreme Court talkative are coming cases there's also gamble versus the United states and here's what gamble versus the United states is about the day if the president hurting as you you can still be prosecuted by the states the president's part and it's only apart from federal offensive\nIf the president prepares you for federal offense you could still be nailed by a state court a gamble versus the United states could count the sort of multiple prosecution of double jeopardy and make it illegal\nSo the gamble case could random ... power the president currently does not have the power to grant an absolute pardon a burden that applies oppose the federal and state level\nThis extended pardoning power could be very useful with members of the Trump team like Paul Manafort or Michael Cohen and if the president decides to pardon himself\nIt could protect them from prosecution\nFor the tax Dodgers associated with the four hundred and Thirteen million dollars in New York Times reported on Tuesday the Trump received under the table from his father\nMany Democrats here that if he is cornered pardoning himself is actually what Trump will do and if he's challenge she has a court to in his favor like two judges who owe him a favor Neil Gorsuch and Brett Kavanaugh\nThe big question is Howard how will they react and how would they vote and uh I don't know I I tend to think that they will follow the path of the law but we\nShall see now is Dr John Curtis online columnist dot com John\nAs you with us no\nI don't think he is when we wanted to get John's reaction to the Neal cap on the situation but we did not let the is go on with some other news stories well we can tropical storm Michael for near the Yucatan Peninsula on Sunday and it's on track to wall up the United states it could hit us\nAs a hurricane well once again nature has dealt the deadly blow to Haiti at least twelve people were killed in a hundred and eighty eight were wounded after a magnitude five point nine earthquake struck Haiti on Saturday Night the country's interior ministry said they're getting rocked\nThe warning signs of type two diabetes may be detectable Twenty years before this diseases diagnosed elevated fasting blood sugar levels and insulin resistance we're seeing in people's years before they develop pre diabetes off in a precursor to type two according to study\nThe links with the flu season they vary depending on where you live with large cities in during longer periods of transmission\nAnd smaller cities experience shorter but more explosive according to a new study study doesn't asserts that one's risk of contracting the flu varies depending on the size of any given community rather it argues that in less populous places\nThe flu and needs the rights atmospheric conditions to spread more effectively let's chalk and check in with Dr Gary right now we're hearing what about the flu season this year what do you think\nOr the flu season this year are you in Ireland and discussing the flu for six years now and it gets even more confusing or the big flu virus now is called age three and two and the ... it's the big hitter especially on the the elderly but George\nThe numbers fly all over the place so the CDC is scaring us that a hundred and Seventy five children died last year but fifty percent of those had preexisting conditions\nIt look on the flip side twelve thousand children died in accidents like cars fires and so forth the confusion gets even worse when um the vaccine last year was only thirty four percent effective\nAnd now they've come out with a loving flu vaccines on the market and the CDC has picked up the shop gun and fired away\nWhen too many hey use any one of these vaccines I don't like that do you oh no not at all because your drugstore may be offering a vaccine would should be the cheapest one they can get a hold of that is true\nThere is no ... no one vaccine for everybody the nasal spray is back again after being denied for two years by the CDC and my confusion and it's you know as a doctor is I have to tell my patrons the risks and let them\nDecide ... because I'm I'm not a you know I can push this like this but you know the Cleveland Browns one today and maybe I'll get a shot and get lucky\nYou never know thanks Gary Dr John Curtis online columnist dot com is back with us from his reaction on the Brett Kavanaugh's appointments go ahead John\n... you know you know the most interesting thing about this is how the Democrats pushed and pushed and finally quite perpetually or to you know for an FBI probe but\nGuess what George and there'd been no FBI probe Susan Collins probably would have voted no and so it's quite right so the Democrats kind of a you know have this went on their own had even though Cory Booker today it's calling for the impeachment of cabinet\nAnd they're now they're calling for them to give the guy a chance now that he's in for crying out loud\nYeah I mean you know but again he's he's he's\nPreaching to the choir in Iowa you know as a potential uh twenty twenty presidential candidate but I think one of the things that they tried to turn this into what we want to really investigate his drinking behavior in high school\nAnd in college and this is where they think they have an ... an impeachable ... nobody interested in his drinking behavior they were making an allegation of sexual assault if there was no corroborating evidence even among the witnesses she named\nBen this is over and Susan calling gave very uh it was and comprehensive\nExplanation of why she voted for him because of the presumptive the presumption of innocence and our constitution gr innocent until proven guilty they have no proof\nWhen will this pass John\n[noise] no it won't ... this particular issue will pass but the bitterness and the rancor between the two party system will not pass you know looking at a government that is at loggerheads there's almost nothing on which they can agree\nAnd I think that we we really have to begin to rethink the two party system or certainly watching it grind to a halt like this and he at watching you know Democrats and Republicans at each other's throats\nOr I my friend John Curtis online columnist dot com if you're on Facebook and you might have gotten a a Facebook profile message that basically says Hi I'm actually got another friend request from you which I ignored so you may want to check your account again\nIt's a hoax message just be careful who knows what they're doing as their hacking away with all those things what an incredible sight today and I saw this he lawn mosque space X pulled off the first west coast launch\nLand the ... usable falcon nine rockets Sunday night lighting up the skies of California what a great view that was I mean it was amazing the rocket carrying an Argentinean satellites\nBlasted off from Vandenberg air force base near Santa Barbara around seven twenty pm Sunday time Pacific time landed on a concrete pad at the base about Fifteen minutes later\nJust truly remarkable all previous felt ... launches had been from Cape Canaveral in Florida a story we have coast to coast am dot com has NASA line was huge space craft somehow\nFlying by the international space station caught on their live feed no this was reported on September seventeenth but we just got the video\nGo take a look at it as coast to coast am dot com it's strange psycho man see him you know what that is it's a small enclosed area set up with a comfortable chair dim lighting in a mirror angle so not to reflect anything but darkness intended to communicate with spirits of the dead\nIn a moment Joshua ... born on coast to coast day yeah [noise]\n[noise] gotta late evening solely sort of\nThe house David your guy that has overcome a severe issue I have a light the light bulb went on and I started\nTo research on there and say ... I was going to capsules I couldn't get enough it made me feel so much better I can only tell you one thing\nThe product war and not only works in one way it works in a whole bunch of different ways because it gives me energy gives me like talent he\nCan and I have just have a better way of war I has build everything back into my body [noise] taken a while but you know on his back over there and I ... I Can't say I don't know\nThis is Richard Haass throw owner for carnival or research international call one eight six six eight three six eight seven three five that's one eight six six eight seven six eight seven three five or visit carnival rent dot com C. A. R. N. I. V. O. R. A. dot com\nCall now\nMessage ... burning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nBut what if there were a business degree that further your career and gave you access to world renowned faculty leaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nTo find out more checks path to seven nine six four or five that's P. A. T. H. two seven nine six four or five star to your online NBA information management or business analytics\nNorth and south bound right near ... is going to be highly congested causing about a two to three minute delay besides that ongoing road construction forty five go free way south battled coming up in ... six forty six bullet plane that will be close till five AM ... Kilian in the ... Gulf Coast windows dot com twenty four hour traffic center\nAll the attention will be on ... like\nA lot in the southern Gulf of Mexico looked at target the northern Gulf which is near where we could see some indirect effects as far as high waves are concerned more than I Do mostly part of the ... guy twenty percent chance or a stray shower storm load load and it set me up ... percent chance of showers and storms Monday and Tuesday I mean does ...\nSeventy degrees up in the woodland in Seventy nine Katie or each west side north side Lexus twenty four hour weather center was he mentioned tropical storm Michael with his sixty mile an hour ... wins\nHurling are hurtling toward the state of Florida the governor there has already declared a state of emergency the Texans worst accessible tonight at energies stadium they beat the cowboys Nineteen to sixteen\nAnd the Astros are in Cleveland they're looking for the third and last necessary went against the Indians it's a lunch game of the Astros pre game starts at eleven o'clock\nAnd of course you can hear that game on sports talk seven Ninety a reminder we're now into Columbus Day tomorrow or rather today is a federal holiday no mail no bank no federal offices shall be open biggest box office hit at the weekend was\nVenom it made eighty million dollars I'm John mostly Downey on Houston's news weather and traffic station news radio seven forty Katie are age\n\n... Houston is known for a barbecue gay day why NASA rodeo medical center out ... well the floods in hurricane and we're known as the plane to go to stay preparing for floods in hurricanes or whether I turn on the radio news radio seven point\nKatie R. H. this report Iraqi by Walmart have Houston Wal Mart's been working behind the scenes to bring you something fresh there's Bruce ... stores in the area and updating their service is getting ready to take your shopping experience to a new level\nI this is Jimmy bird for Bill a bunch of dot com if you have a cell phone pay TV electricity Internet her home in auto insurance you really need to listen up because every week bill advisor is winning for hundreds of our listeners there now so crowded they doubled their savings guarantee for one hundred fifty to three hundred dollars if they can't seem to at least we hundred bucks you get everybody back\nNo set up the still just will not Eli promotes starts at me right now takes the word go that's geo to twenty three twenty three twenty three or go to bill advisor dot com and click start saving\nMoney October re what's new today on the free our radio Harvey a\nFor decorating the house or just setting the Gehry move\nCommunism by the pilot has ... with the labor is wide when no after day\nIn swing mainstream break out all our great tailgate party playlists\nWhether you're at home or the stadium knew I our radio ... collection that come out now\nMonday October eighth what's new today on the free I our radio last\nFor decorating the house or just setting the dairy move our pumpkins by the pilot had Joe ... with labor in spite when no after day\nIn swing mainstream break out all our great failure party playlists\nWhether you're at home or the stadium knew I our radio ... collection that come out\nOwing [noise]\nThe news and local during the time and the bottom of the hour news radio seven forty Katie our aid [noise]\n[noise]\nGreen bean banging\nHand and [noise]\n[noise] [noise] [noise] [noise]\n[noise]\nI mean you know gas\nGoing down the main way made me\nLot to do is go to ... am with George Nouri\nClub or girls great job by the way I've never seen Gina dance so much in all my life to that song she's into that you can you imagine Tom dancing\nTo that song no no no no no hey are you a coast insider yet you can be is Fifteen cents a day it's a great way to become part of the program downloads and podcasting just a fun way to be a coast insider\nI Am a coast insider because now I have twenty four seven access to that show ever coast to coast\nAm right here I'd like to say because they show the St Louis I appreciate it gets very hot for insight it brings on a variety and had ... ...\n... ... ... ... ... and ... and they're\nLooking for an interesting Christmas present for somebody you care about just go to our website coast to coast damn dot com and sign up to be coached insider and we won't tell anybody you spent Fifteen cents a day for this [noise]\nThis radio seven forty taped ER age\n[noise] are you considering a safe to secure your valuables or firearms let's face it seeps are not very attractive they usually end up getting stuck in the garage\nOr in a closet wouldn't it be great if there was a seat that had to look up a beautiful antique so you could display it in your living space as an air a little while also having easy access to it while there is check out the rhino\nIron works shakes at rhino safe dot com\nAmerican Made an antique styled our Shapes Our part art part furniture and all security\nAnd if you like the classic look of our rhino fireworks apes we also feature beautiful matching told chest and\nFurniture with hundreds of thousands of satisfied customers had to a huge network across the U.S we've built our reputation on having the best built best looking and most convenient sakes with great surface and Warren G and you can get online financing\nSo go with the best and get style convenience\nSecurity and true peace of mind with rhino C. dot com today not sure I Know save dot com rhino safe dot com\nGoing resents I witnessed interviews with inanimate objects believing calling line on the other reason lightning or you're going to be an teeny ...\nI was watching football and holding a plate of meat loaf Lincoln bam above the lightning slams into the apartment blowing out the TV and surround sound you could have done to help ma'am I'm a full table not an electrician\nYour TV tree can help you in a lightning storm but the insurance agency can help you get covered for personal property damage and go to guy go done gone to see how affordable renters insurance can be\nBlood on cell you break your addiction to drug and alcohol call the addiction specialists now at the detox and treatment help line twenty four hours a day seven days a week if you have private insurance we specialize in finding the right\nTreatment eight hundred two nine six Thirteen twenty five a hundred two nine six Thirteen twenty five\nA hundred two nine six Thirteen twenty five and eight hundred two nine six one three to five\n[noise]\nHouston sounds good everywhere okay Google like gay T. R. H. I. hard radio [noise]\n\n\nWe'll take calls with Joshua ... worn next hour by the way now we will talk with him about time warps in UFOs and you will you stumbled into a time warp for several months ago and you\n[noise] I did in fact I broke this story on coast to coast am shooting them before I even did it [laughter] and I know that that that\nSounds a bit suspicious but no honestly what I was doing as I said I have this new piece of technology on going to take it to a certain place I don't think I said where of course that place turned out to be here is if\nThe one from Las Vegas outside of Las Vegas Nevada and um\nI I I sort of gave everybody a heads up and then when I found something that surprised me um it went viral I mean I I made international news with this discovery it was a Newsweek inside edition and ABC NBC CBS Fox News media in Russia China basically\nI discovered some type of a space time anomaly between Las Vegas in area fifty one at this nondescript site on the side of the road out in the desert and it turns out that that is one of the most extreme UFO\nA the defense of earth against other earthlings\nI'm much stronger but at the same time you're defending perhaps all earthlings from some kind of outside potential for invasion\nAnd I think that even if you are listening to this show tonight and you believe that there are aliens or ... or however you want to describe them that are coming here and you think they must be good because if they weren't good they would have destroyed is already if you're in charge of the military\nIf your job is to be suspicious if your job is to protect the people of your country\nThen why would you take a chance and say okay well maybe these beings are benevolent but still why don't we do with ever we can to have whatever we can muster together in place\nJust in case you need to send ourselves because they have a change of heart or they've been deceiving them to be\nSafe than sorry right\nWhy sure you know and and we it might be Utah I'll I mean you would think that it would be that if the if there are being out there that are coming here that are are so advanced that they um they they ... you know would otherwise destroy is\nAh if you know if if that was their plan but you know here's this is getting dark this is this is very dark but I honestly this is a logical point of view\nWhat if George ... if they were going to come back here these beings that ancient alien ah theorists talk about talk about this kind of thing many times on the History Channel [noise]\nUm if they they come back and they want to and slave us again because a lot of people\nBelieve especially if you look at like Zacharias ... work and all that that they came here and modified our our genetics in our DNA to enslave us and treat us as minors for gold or whatever\nIf their goal is to come back here and in slavery was it might be a better fate for us to commit to global suicide in other words and again I told you this is going to be dark\nWater a lot of these governments actually have some kind of plan in place where they say rather than have these beings come back\nAnd put you know colors on us and and work us like animals we hit these buttons and we just annihilate ourselves spooky but what if that's the case\nSo do stay button basically\nAnd and and that the idea is that we're not necessarily as concerned about each other\nAs we are about the force from outside and you're going back to Ronald Reagan I'm I'm sure you recall that kind of eerie comment that he made at one of his speeches I Believe it might have been before the un jumped in what if there was an alien threat [laughter]\nWhat did he really mean by that you know he was he was just being facetious to try to talk to people about banning together or does he really knows something at the time\nWhen you look back at all of these people who have made deathbed confessions who are related to raw as well and um you know the whole suspicion that surrounds researchers to this day who goes snooping a little too much and digging a little too deep [noise]\nI mean there is something to this idea\nThat we may be up against\nPotentially a some visitors here if you want to call them visitors they call them are just as easily invaders but there may be some some uh beings that we have got to do our best to defend against\nAnd they're using space time manipulating technology in order to completely I'm Out maneuver anything that we can do and so once we see the possible examples like I'm\nPerhaps present thing that maybe now we humans are experimenting with some stuff sadly enough weaponry which costs\nYou may have a space time manipulating effect\nUh this could be a particularly worrisome for those beings if they say okay we made a little trade off we gave them if you will not get the wisdom but boy the the the earthlings are run with it and so we need to put them back in their place\nJosh tell us about your event coming up in October this month\nYeah faking this Saturday it's October the thirteenth is going to be my final wishing machine extravaganza I Am a huge fan\nA huge experiment or when it comes to mind machines machines that allow you to connect your mind to the world around you have to try to manifest things ... products you don't see many programs like this these days I can promise you that\nAnd this is going to be I promise a life changing program it's my last one because I Am the co creator of the wishing machine project I wanted to do one on the east coast so I did want to North Carolina\nI wanted to do one somewhere in between I did want us to do that and now this will be my west coast that will fulfill my educational journey I have a new t._v. contracts so I don't have time to do any more live events anytime soon\nSo to get the full scoop go to Joshua pie Warren dot com there's no period after the pie\nClick a link at the top there and you can learn about the event but I also want to give away some free tickets do you want me to tell folks how they can get a free ticket right now he\nCan you do it in thirty seconds if not the after the top of the hour\nOr I go to Joshua ... dot com sign up for my three e newsletter\nI'm going to give you all secret word right now that word if Tesla\nI'm going to send out a newsletter this week and I'm going to say who knows the secret word if you reply and you say Tesla I'm going to take the first five to ten people and give them a free ticket so sign up for the free and spam free e newsletter Iraq with my own little fingers there Joshua ...\nSoup or when we come back we're going to talk with Joshua about Halloween and also take your phone calls about the spirit world on the coast to coast am ... don't touch your dial here's our next emerging artists Frank Felicia from Henderson ville Tennessee you are one you our love that you are like oh who\nRole in\nFind out more about tonight's gifts to log on to coast to coast am dot com\nIs known for the asked her down heat Earl Campbell diversity Houston we have a problem beautiful women we love you use it and we're known as the plane to go for keeping up to speed with used thing for me to turn on the radio news radio seven forty\nKatie R. H. hoops\nSteam cleaning show up on time to clean your carpets they'll do a good job they won't up so you know if there are other things you want done they'll do it and I'll tell you how much that costs commercial carpet cleaning is well not just your home air duct cleaning natural\nStone ceramic tile grout cleaning bathrooms kitchens all of it counter tops oriental rug upholstery they can do it all hoops steam dot com to eight one eight to two oh five six one to eight one eight to two oh five six one\nThis report is brought you buy atlas foundation repair old friends are the ones you can trust like I'd listen ... repaired Houston has precedent listens Nineteen Seventy seven for foundation driveways sidewalk and under slab plumbing repair atlas is the answer local experienced trusted atlas foundation dot net\nIt's Monday October eighth what's new today on the free our radio last\nFor decorating the house for just setting the Gehry move\nSpicy platelets has killed tracks with labor in mind when no after day\nSwing mainstream break out all our great valium party ... whether you're at home or the stadium the new I our Radio Free ... collections that come out and now\nIt's Monday October eighth what's new day on the free I her radio last\nFor decorating the house for just sitting here in our pumpkins by the plate and has your tracks with labor in mind when no after day\nSwing make sure you break out all our great valium party ... whether you were at home or the stadium the new I our Radio Free ... collections that come out and now\nThe leaders\nFurniture made in America studios this his youth Radio's seven forty Katie our age Houston and I argue radio stations both\n[noise]\nHouston sounds good everywhere okay Google Play Katie our age and I are draining out\n[noise]\nAnd\nWelcome back to coast to coast George ... with you again I'm going to give you a little Halloween trivia here Halloween is an annual holiday ... celebrated each year on October thirty first it originated with the ancient Celtic festival of Saddam Hussein when people would light bonfires and work costumes to ward off ghosts\nAnd the evening before was known as all Hallows eve and then later Halloween is an interesting Josh\nIt absolutely is I mean that it goes back thousands of years\nAnd um I I think Fallon was the original pronunciation and they would talk about this being a period of time with of course\nThey were ... you know reaping the rewards of harvest but preparing for the call the month of winter and so they believe that as the world was sort of transitioning\nInto the cold dead time\nThere was a period where the the bill was so thin in fact the Europeans often talk about what they call Finn places the boundary was soaked in between where we are and where the spirits are we getting counter each other for at least one or two nights and ... and interact with each other\nAnd the good part was well some of your loved ones might come through but then there were also all of these creepy evil being true and so you're\nYou'd wear a mask so do you blend in with the evil ones and they'd be like oh you're one of us\nYou know and and they they wouldn't harm you but from a more um I I think updated point of view George this also happens to be the time of year when a here in our part of the world\nThe earth is shifting away from the sun and so uh that means not only does it get colder and darker as we built in to that mysterious back a black void of space\nBut furthermore uh we are not being as a strongly bombarded\nBy the the radiation coming from the sun and therefore subtle things\nThat might otherwise have been sort of drowned out in the noise of the sons radiation could pop a little more so for example let's say a I shine a flashlight at towards you outside on a bright sunny day well you're not going to notice that as much as you would if I did it on a dark night\nRight and so what happens in general we wanted them there but it's still there\nIt's still there but it's just not as prominent and noticeable so this is the time of year when we shift away from the sun and a lot of these subtle energies electromagnetic electro static and otherwise that are associated with these spirits another ... these are suddenly more distinctive\nAnd a play more of a significant role in in our awareness and of course we're we're also in Hampton this because we're we're paying more attention and we're looking out for it more\nLet's take some calls here with Josh as we continue chatting I Want to ask you about Robert The haunted all in a moment let's go to Charles first time caller in Asheville North Carolina hey Charles\nGo ahead you're with us no\nHe's not let's get John in Virginia Beach Virginia try hey John go ahead\nGeorge ... uh I won't tell you the story that happy they like in the nineties\nNow I I never believed in ... spirits UFOs eighties and things of that ... however that Nineteen I'm leaders Middle East or had passed away and they were having a memorial service when the church\nAnd I was in that close to him but I just said you know anyway I uh I went I was late getting as so I had to sit in the black church was packed and services going on and all of a sudden I\nFelt some somebody standing behind me behind one of the person that check and I looked up and it was my uncle had just passed away\nAnd and he\nTold me he said John ... your car and I was shot at it and what to do it again you said John don't value car when I was so scared I had to get out of there so I got up late and what he was gone\nBut still I was ... and ...\nAnd so I got it right now we're finding mind next morning I called my cousin which was the son named it that way and ask him if he wouldn't mind bringing my collectively and I'd get him right back home he shouldn't matter though\nSo he and his go and get my car and to let a cage for them that anyway he\nGot in my car they pull that the ... fault line and they were hit by a truck and they they weren't killed but they were extremely you know I mean they had ... votes and that's\nWhat I never told anybody this at was reluctant to say anything that it would it till\nTwo of my close friends and um I don't let it late at night when I was sure they have the I guess you know up until now I hadn't told\nMe in the in the morning was just not to be in that car as opposed to you driving the\nCar you know what I didn't want to do that after he told me down and\nSaid you didn't think it would carry on to them\nNo no no that was the idea\nThat they would be and you get my car but they were ... they weren't killed but that was the only time I ever had to think like a safe stage goes to get all the same thing as for CNN\nJosh why does spirits come across like that in more than you\nYeah well you know John ... thank you for that that's a great call and it I Believe represents one of the most interesting aspects of the spiritual realm [noise]\nYou know scientists who are the smartest folks among us right now who where are you know the astrophysicist a cosmologist a quantum physicist they're telling us\nThat we have the mathematical models we have the experimental data to prove that all time is happening at once at least on this particular time line that the past the president and the future all happening at once the problem is that we humans are\nSpirits in the material world it's like the song by the police\nAnd so when you are a spirit trapped here in this material body you're only able to process what's happening on the timeline little by little a minute by minute hour by hour a day by day week by week and so on\nBut once you are no longer in this body it seems like you're able to have an awareness of things that extend far beyond what we physical or physically incarnate as humans call the presidents\nAnd so it would make perfect sense that if you have a loved one\nEspecially one who has recently passed into the spiritual realm\nThat person may be astounded by the fact that he or she can now see\nThe future to a degree that you cannot uh it might almost be like comparing the perspective of an app to the ... to the perspective of an eagle\nAh they're both physical beings but they just have a different point of view and then when the eagles way up high he can see the storms that are coming that the aunt can't see that there is more sensitive to what's happening I'm On a lower level\nSo anyway all that said your relatives or friends or loved ones who pass over my\nDefinitely be able to see beyond the scope of the temporary situation and see somewhat into the future and that would certainly be great motivation for them to come and give you a warning and in this case John and it seems like that's the most likely thing that happened to you\nAny updates with Robert de haunted dull Josh\n[noise] you know Robert at this point live like a king and ... and this is very funny because\nHe still ... yeah yeah\nI mean I I haven't seen him in a while now but Robert I think really became famous or some would say infamous as Robert\nBecause that a lot of people were sort of a chiding him and uh I don't want to use the word abusing him but basically there they were taking him out and cathartic Lee releasing their\nPent up frustrations on him and it was when the shock wave of curses and bad luck started hitting all those people that suddenly word began to spread like okay this dog here and you know he\nWas fighting back\nYeah and it's because of that that um he I Believe now is so famous because the word has now spread for so long that if you go to see how you have to be respectful people now take it seriously and I don't think that there are nearly as many people\nWho are going to see him now\nWho are having bad experiences or even paranormal experiences because he seems to be at peace\nOr John ongoing low construction maybe phone down forty five ... six forty six the left lane will be closed until five AM than we do have that persistent road construction to the north west Broadway inbound that Senate the entrance ramp\nWill be closed until the beginning of next year I'm that Killian indicate to your age go 'cause when those dot com twenty four hour traffic center\nMost of the county for tonight training partly cloudy overnight snow twenty percent chance would shower or storm loaded Seventy mix of sunshine for your Monday Columbus Day with the ... members get showers and storms were breezy hide mid ... he's a fifty percent chance of getting storms again on Tuesday would hide mid eighties I mean just hogwash Weather Channel\nEighty degrees on Galveston Island Seventy six degrees of the woodland in Seventy eight degrees and the west side north side Lexus Katie our age twenty four hour weather center a theory to news time one thirty one our top story Charlene Caldwell obese Houston is dead after she was beaten to death with a baseball bat by her boyfriend\nHe confessed to police twenty people killed in a deadly limo accident about Seventy miles north of New York city the limo ran a stop sign tropical storm Michael on the way to Florida the governor there has to clear the state already\nAn emergency situation it was the biggest October movie weekend in history been um was number one it made eighty million dollars number two was a star is born starring Bradley Cooper and Lady Gaga\nBut Texans beat the cowboys sixteen to Thirteen tonight at ... stadium in overtime and the Astros played tomorrow in Cleveland the game starts at the Lebanese and you can hear it on sports talk seven Ninety news on demand Katie arch dot com our next updated to breaking information as it happens\nJohn mostly daily news radio seven forty KP our age\n[noise] with the Houston is known for having an actor at the beard match Mac humidity Tex\nMex awful traffic and we're known as the place to go for beating that awful traffic\nWhen I'm driving countering commute with radio seven\nForty Katie our age this report is brought to buy Walmart a fresh new shopping experience is coming your way Wal Mart's investing and the Houston area selects doors are getting a fresh new look and convenient new services so get ready for what's coming your way hoops\nSteam cleaning show up on time to clean your carpets they'll do a good job they won't up so you know if there are other things you want done they'll do it and I'll tell you how much that costs commercial carpet cleaning is well not just your home air duct cleaning natural\nStone ceramic tile grout cleaning bathrooms kitchens all of it counter tops oriental rug upholstery they can do it all hoops steam dot com to eight one eight to two oh five six one to eight one eight to two oh five six one\nOf the biggest music festival of the year and it's coming to their cw already all music\nDon't miss the iconic performances\nTo watch her must be I heard radio music festival tonight at seven pm on the W. thirty nine Monday\nOctober eighth what's new today on the free our radio\nFor decorating the house or just setting the dairy our pumpkins by the pilot had Joe ... with labor inside when no after de\nBlanc mixture you\nBreak out all our great failure party ... whether you're at home or the stadium and knew I our Radio Free ... collection that come out now\nDays without money [noise] I Know him in a way good our main monies [noise]\nWe're oh man oh\nProblems when\nThe\nReunion that then then\nThey were all of them will then ...\nThen then\nWe're a day to day\nYou may ask you down and you know I'm new\nTo\nYou may tell your down do you do or why\nThen but now\nThe ... and on and on\nYou see it in\nTo talk to George ... called the garden line that each one eighty five zero one one zero in on the first time caller line is a one eight\nVibe zero one for seven to one to talk to read from east of the Rockies call eight hundred eight to five vibes zero three three from west of the Rockies to recall eight hundred six one eight eight to ... to reach George VI escape use guy named George nine seven three one three\nSent Georgia Tech message anytime it eight one eight to nine eight seven six five to one for this video ... businesses coast to coast am with George Nouri\nWhile our annual goes to show is Wednesday October\nThirty first obviously Halloween Night and that we are going to take many of your phone calls\nWe also like you to email us your name phone number and George ghost story because we may call you and get you on the program that way\nBecause there's going to be really difficult for some people to get through so send your goals story what's your name and phone number to Halloween story at coast to coast am dot com Halloween story at coast to coast damn dot com boy I'm really proud to do it now says we did last week whole lifetimes magazine\nOr which is put out by our very own Gina cell body genes she knows our associate producer and this is the nation's longest running holistic publication it's based in Los Angeles she has taken it over she's got a great deal for you Gina I'm proud of you\nGood for me the sound much joy how cool is this just wonderful bank yeah\nNow you got giving out free email digital lush addition to ...\nPre digital additional people need to do is email me Gina G. I. N. A. at whole like magazine dot com or they can text that oh yeah you got the ... ... says he texted the word whole life all one word with the data your whole life to four to eight to eight\nWe can get you set up that way so that like that that's that's like a phone number for just like to wait to eight that's correct our sport too\nIt's to age in just tax the word whole life ... ... what am I say Hi Gina or something like that and I said to work legally I and I actually don't know you\nCan tax four to eight to eight put it in the whole life or send Gina a direct the mail for the free digital edition of her magazine whole lifetime said Gina G. I. N. A. and whole life magazine dot com and now of course stem cell technology is doing some wonderful things\nThere is no dispute that we all want to look our best were very lucky to be in a time where science can come to the rescue stem cell research has literally performed miracles on so many\nAnd now it is available in an easy to apply non prescription serum for those areas that need a little touch up like fine lines wrinkles and bags under your eyes Dr ... Newman is the creator of looming mess he started with thirty to forty orders of luminous monthly and now\nIt is a worldwide product available in one hundred and thirty seven countries here's Dr Neumann\nWhen we use this product or does many different things it\nGoes into the skin and helps to regenerate new college a new law than most of the effect that we see four but there was this year was the anti inflammatory things\nOr people would actually where the written this goes away and their skin gets better and I think part of the treatment that we're giving is because these language is able to go and prevent the breakdown of tissues\nLumina is not available in stores but it is available from healthy looking dot com find genuine luminous products and especially the lumina zero with\nThe highest concentration of Dr Neumann A. P. T. two hundred stem cell formula at healthy looking dot com all products speech or a twenty five percent discount for signing up for smart deliberate uh check out what you can cancel with no obligation at any time plus if you're not satisfied\nThere is a thirty day money back guarantee you have nothing to lose to start looking better today for a limited time you can try the lumina starter pack for only Nineteen Ninety five\nWith free shipping that healthy looking dot com or tool three eight hundred six so for thirty one twenty nine eight hundred six so for thirty one twenty nine or ... healthy looking dot com looming death at healthy looking dot com [noise]\nNews radio seven forty Katie our age [noise]\n[noise] I fear for my ... year here they're really know why\nShe is a hundred and five pounds of shiny moved the dog for life the shedding staff pitching staff\nSince two thousand one we've held more than a quarter million dogs get over the nutritional deficiency misery and saved our customers ...\nWe've got Kyle and Clinton, Utah now it's his turn Hi Kyle\n... how you doing okay go ahead\n[noise] right so I I just got off work at eleven thirty ... and I was in the ... and the Katie Hoff or log in\nAnd I'm cleaning and I'm often\nIt's called the ... you know where the ... people come they do that to this and all of a sudden I say this little nine year old boy I Would say maybe ten eloquently I cooked steamed directly straight you know just that core I perfectly and he's looking at me\nAnd so I start off and they continue mop like okay this is kind of eerie any pushing pretty hard and so I was wondering it seems like since I've been working there for about a month like he think it's\nMaybe around October is that we're in the spirit to really show theirselves and he wasn't\nSupposed to be there was a ...\nI I don't think so I talked to see in a in a couple of the nurses and they told me that they everyone who goes in there by their cell or maybe\nTwo or three people they feel like someone to watching them and I was just wondering might huh\nJosh or what do you guys think 'cause like it seems to me is October 'cause it's not a full moon because it's full knew I could tell you what it it gets really crazy around the hospital for whatever reason\nHuh do you know the little boy died there\nYou know I asked them and they ... from what we understand no one has died there but they said we don't know a full history\nOf Illinois hospital where do you think Josh\n[noise] well ... thank you for that call and yes I think that this time of year has more prominent paranormal activity for at least three reasons\nReason number one goes back to what I was saying earlier in the show about the earth tilting away from the sun and subtle energy fields being magnified or at least being more perceptive ... so that's that's number one number two is that here again in our part of the world and the northern hemisphere\nMost places have a colder drier environment and I know that's certainly the case in Utah\nSo that means there is a larger build up of electro static charges so when you lay down at night and you pull your sheets up you might see those little blue sparks flying around the similar to when you're drag your socks on the carpet and touched the door knob\nAnd there is a definite relationship between\nEnhanced electro static charge and the ability for paranormal phenomenon to materialize and interact\nOr in my laboratory over the years I've been able to reproduce many of the things\nThat people talk about when they encounter the paranormal using electrodes data charges such as creating Loomis life forms making objects move without any visible source or creating the sensation of a cold spot or a cold when when they call an eye on when\nI'm making your hair stand on end these are all things that you can do artificially with electro steady charge and yet\nWhen you go to these places where people are often experiencing extreme paranormal phenomena you find that there are these very strong electro static anomalies in the area so there's some connection there\nRegarding how that the non physical realm of the spiritual might be able to temporarily interact with the physical realm\nAnd it reminds me of how something like a magnet has this invisible field around that that creates a physical effect\nBut then the third and final point of course is that\nThis time of year we're talking about it more I mean you go to the store you see all of these things that reminds you of the paranormal spooky the afterlife\nYou see it all on TV you see the movies coming out and so you combine those three things together and certainly it means that again at least here in the United states this is the time of\nYear when we have the highest likelihood of experiencing something ghostly spooky creepy paranormal or at very least metaphysical\nJosh during this time of the year for some reason\n[noise] well I Do and I think you know part of it goes back to the fact that you know I was born this month and so you know that's always been a time a celebration my mom and dad have always been fantastic people have always been a really cool arranging nice things for me and growing up in western North Carolina\nUh especially in Asheville when when the leaves are splashed with color and everybody that becoming very festive um it's a great reflection\nOf that original celebrate tore mood from the old world in fact so many people of Scots Irish descent came into the mountains of western North Carolina because they found them familiar\nThat ah I every single genealogist I've ever talked to says there are more people of for example Scottish dissent\nIn North Carolina then there are in Scotland and uh we should remember that the very first attempt\nAt an English Settlement was in North Carolina on the coast at a place called Roanoke Island\nAnd they all vanished so we now know that today is one of history the greatest mystery of the ah last colony and so I was born in the area that had um an enormous amount of influence\nFrom the early you know Scots Irish who originated these ideas about celebrating Fallon and Halloween and so that combined with my birthday makes me very excited and I'm sure contributed to the fact that uh I Love this time of year\nThirty seconds I give us your uh been again one more time\nOr I go to Joshua pie Warren dot com is no period after the peach Joshua ... Warren dot com this Saturday October Thirteen in Hollywood\nTwo to four pm it is my final wishing machine extravaganza everybody gets a free gift I'm not going to disappoint you it's got to be a great time for all of us and if you want to get a chance at a free ticket\nGo to Josh will be warned dot com sign up for my free a newsletter the secret word is Tesla\nYou got it ending out that soon\nThanks Josh being touched my friend I always think the world W here's our last emerging artists for the month Tom Lang from Springfield, Oregon California slipped my mind\n\nLike El Nino holding them accountable\nYou do not easy for you to not be struck down\nKnow the thing that\nBelieve what was waiting for me\nGets Daily Show updates right to your inbox for free with the ... newsletter sign up today at ... am dot com\nFew minutes with former NFL star running back one word saved lives for\nAn\nInch hurricane season\nStay informed hurricane season with news radio seven\nKatie our age hoops steam cleaning show up on time to clean your carpets they'll do a good job they won't up so you\nKnow if there are other things you want done they'll do it and I'll tell you how much that costs commercial carpet cleaning is well not just your home air duct cleaning natural\nStone ceramic tile grout cleaning bathrooms kitchens all of it countertops oriental rug upholstery they can do it all hoops steam dot com to eight one eight to two oh five six one to eight one eight to two oh five six one this report is brought to you by bank of taxes\nYour life keeps you on the go your bank tree keep pace with twenty four thousand ATMs nationwide and easy to use mobile apps access to your money is quick and easy is it as a bank of Texas dot com bank of Texas long leave your money we all have some pretty\nCool friends celebrating is a very good friend of mine some more than other call I got a friend of mine there is one person we really like to be friends with you on a link to my friend of mine Haiti R. H. dot com\nIs the biggest music festival of the year and it's coming to the ... radio music\nYou'll miss the iconic performances\nTo be Vegas from\nTo watch her must see I heard radio music festival tonight at seven pm on cw thirty nine\n[noise]\nThe leaders weather\nFurniture made an American studios this his youth Radio's seven forty Katie our age Houston and I are the radio stations\nDeath by baseball bat I'm John mostly Dana it's two o'clock on news radio seven forty Haiti or age with travel you know whether to gather here that killing\nHey John or say at once and I'll say it again I think there's no accident sounded the rose I'm always happy to report that smooth sailing as we're getting around the Houston area but we\nAnd he writes the anti matter column which looks at\nFringe science and the paranormal for the online magazine he uses his experience in journalism\nAnd his interest both go slower and the paranormal to collect and tell stories all about the supernatural he was with us a couple of months ago with Richard talking about some haunted rock and roll that was a classic mad welcome back to the program\nThank you very much for having me on\nVery background hot as a journalist get involved in the unusual in the paranormal\n[noise] well the simple answer was I was born that way\n[laughter] on Halloween or yeah yeah oh happy birthday coming up yeah\nThank you very much so that really kind of started my interest in it I don't ever remember a time where I wasn't\nInterested in ghost stories horror movies and all like so I just learned uh I I never really wrote about it until I started to work as a reporter\nAnd uh every Halloween I Would try to write a a a feature story a Halloween feature story and so I started to write a story about um local ghosts legends around the area where I was born\nAnd ah the reaction to that story was so overwhelming that I thought well there's really\nSomething here and so since then I've I've combined my interest in history and folklore and go stories and just kind of combined them altogether\nDid your birthday cut into Halloween or didn't Halloween cut into your birthday when you're you\nKnow it it sort of a made my birthday ex financial I refer to it as the season of Matt now [laughter]\nI Love it kicking off the year I Love this quarter October November December it's it is the best absolutely in how did you get your interest in World War two\nWell I after I wrote you know I wrote three books about a music in the supernatural and at a certain point I wanted to uh find another project to to place with my publisher\nAnd initially I thought I I I'm you know to be completely transparent I consider myself more of a civil war geek\nUm but I started to look around at writing a civil war book but what I've found is that there's just so many so much good stuff out there already\nA and that people have compiled a numerous books so I didn't think I could really add anything to that area of ah of ghost stories and a supernatural\nSo I just started I turn towards a World War two uh and started to uh research whether there were any good stories and and sure enough there were there were plenty of good stories that I could compile in a way that I I like to do it I like to do I like to couple ghost stories with [noise]\nYou know tales of secret in cities and and forty entails so a hunted World War two ah it turned into be just a really a deep area for me to explore and that's that's kind of what I like to do\nAny harm to the world war two were these goals stories and events from World war one that overlapped in the world war two or with these things happening during the second war\nSo most of the stories that I I compile our stories from World war two not between the wars and and they occurred they continue to occur believe it or not\nWhat creates the difference between these kinds of ghost stories I Would call the military on teens as opposed to regular guy\n[noise] that that's a that's a great question because um [noise] you know most of\nThe stories that I wrote about before a university ... stories haunted rock and roll go stories of country music there is there sort of a light hearted aspect of the stories compared to what I found myself into when I started to research the world war two go slower\nUm and I think when you're dealing with war and warriors and victims of of atrocities and\nWorld War two probably set a new standard and violence and atrocities\nSo there is a deep seriousness about the material and I really want to honor the sacrifices especially from the soldiers and sailors Marines [noise]\nAh you know when you're dealing with this these acts of Vail valor on on Normandy and\nYou know all of those stories you want to make sure that your your ah honoring a what they they brought or the other thing that I found a little different when I started to research hunted World War two was that um\n[noise] you know you want to make sure that you get the history right I'm history serves as a backdrop for a lot of these stories\nAnd I think ghost stories are are one way that people help preserve the past\nBut sometimes they're not perfect in history so what I found myself doing is a lot of times is is uh finding these stories and then trying to confirm to make sure that history was correct\nOr you know I've been I've never looked for whether I'm a ... or was available to German troops in ... during the Normandy invasion but you know I found myself looking looking at those types of details so I think those are two reasons why\nThe these stories are a lot different from the stories that I worked on before\nWhat isn't Matthew about the battlefield that seems to enhance the stories in and they could be anywhere they could be I had um a friend who just once a little big corn\nOh we're Custer it's less than was and it you know he's convinced that's haunted to Gettysburg Reno was on to write I'm sure there are other battlefields that are but what is it about war\nThat creates these hunting does it because sadly enough these Soldiers Die so suddenly and they just still hang around what what's going on there\nYeah there there are a lot of theories about why battlefield seemed to attract these ... more so than than other places um and and they're essentially is two camps on this so you have on one hand you have the paranormal theorists\nAnd they said that this in in one case a they say that this violence and trauma of war\nAh causes these um almost in the event almost in beds itself in time and space it gets repeated over and over so that kind of explains what they would consider residual ...\nNow on the other hand there there are some a theorist and also say that\nYou know the shock of war happens so quick that maybe people have a hard time transitioning maybe their spirits have a hard time transitioning from one plane to the next that's that's the other theory now there's a whole skeptical side of this too and what\nThe skeptics would suggest is that because these areas are profoundly moving emotionally when you talk about the sacrifice when you talk about\nThe death and the tragedy that it raises your consciousness that maybe you mistake normal uh activity normal phenomena for paranormal phenomena so those seem to be the main theories behind why these battlefields are so haunted\nIs there a specific battlefield that you would say is the most talented a bowl\n[noise] I think the consensus wise I Would say a Normandy is extremely haunted um there's just doesn't ... stories\nAre especially in it might be because there are a lot of tourists are that are visiting that area and so a lot of this tourists there documenting what happens but the bunkers the fortifications uh seem to be haunted one of the stories that I found a particularly interesting was that a\nA father and daughter visited the battlefield\nAnd that's part of France for people who don't know where it is\nRight yeah Normandy, France uh and uh the the father and the daughter visited the Normandy peaches and we're exploring some of the fortifications and went into a bunker\nAnd when the daughter and and father said that when they came out of the bunker they they didn't really talk too much about it but then later\nThe daughter said that when she was in there she solve these figures are these people actually in the bunker somewhere laying down somewhere looking out the window and then she started to describe their uniforms and the father who was a World War two buff\nImmediately ... ah recognize these uniforms is German uniforms\nAnd later he decided he wouldn't press the issue on a writer right away but then later he talks to her and he brought out a book of weaponry and and uniforms in and asked her to look through it and identify what she saw\nAnd he claims that she had no access to any World War two history books she truck he tried to keep that\nAway from her because she was so young but then she began to describe the guns that were there the uniforms that were there and they all matched or what could have been in that bunker at that time so you do have stories like that from a pretty credible sources that they've had these experiences\nIn Normandy and that certainly wasn't the only one that happened in those bunkers\nThe other place that uh I talked to a jury\nAnd goes tonner and his name's Tom ...\nAnd he told me that uh he investigated the art dens battlefield which is in in Germany or near Germany a and a site of the battle of the bulge [noise]\nBesides that weekend construction boarded up go free way north publishing colder in up in part of the teen won't have that whole area closed off until about ... him\nOn that Julian and the ... Gulf Coast windows dot com twenty four hour traffic center all the attentional\nBeyond tropical storm Michael out in the southern Gulf of Mexico looked at target the northern Gulf would you be where we could do some indirect effects as far as high weeds are concerned more than I Do mostly part of the ... guy twenty percent chance for re shower storm low blood in the seventies or ... percent chance of showers storm Monday and Tuesday I mean does ... Weather Channel\nAnd it is Seventy six degrees and the woodland Seventy nine to keep your age west side north side Lexus twenty four hour\nWeather center Katie or each news time is to thirty one\nTwenty people dead after a limo accident in upstate New York state police there say the accident and Bob a limo and another vehicle the limo ran a stop sign at a high rate of speed Eighteen people in the limo were killed two pedestrians were killed\nThe NTSB is calling at one of the worst transportation accidents since two thousand nine\nTropical storm Michael is expected to go to Florida the Florida Panhandle and the governor there has already declared a state of emergency but Texans beat the cowboys it in our stadium final score Nineteen to sixteen and the Astros played today\nYou can hear the game at eleven o'clock on sports talk seven Ninety news on demand a Katie or each dot com or next updated three breaking information\nAs it happens I'm\nJealous evaluate Houston's news weather and traffic station news radio seven forty K. P. R. H. the news you want to know Kavanaugh\nComments on the age of fifty one the nose forty nine emotion green uglier seatbelt should be\nUse radio seven forty Katie R. H.\nThis report is ... by Wal Mart a fresh new shopping experience is coming your way Wal Mart's investing and the Houston area selects doors are getting a fresh new look and convenient new services so get ready for what's coming your way to HP's steam cleaning\nShow up on time to clean your carpets they'll do a good job they won't up so you know if there are other things you want done they'll do it not so much that costs\nCommercial carpet cleaning as well not just your home air duct cleaning natural stone ceramic tile grout cleaning bathrooms kitchens all of it countertops oriental rug upholstery they can do it all keeps steam dot com to eight one eight to two oh five six\nTo eight one eight to two oh five six one\nThe biggest music festival of the year and it's coming to their cw already all you\nDon't miss the comic performance if\nTo watch her must be I heard radio music festival tonight at seven pm on cw thirty nine [laughter]\nThey October eighth what's new today on the three hour radio a radio\nFor decorating the house or just setting the Gehry move\nPumpkins by the pilot has Joel tracks with labor is why when no after day\nIn swing mixture you break out all our great Delia ... whether you're at home or the stadium knew I our radio ... collection that come out\n\n\nNa\n\nNa na\nNa na na na na\nNa\n\nNa na\nThis is coast to coast am with George Nouri\nGot some free videos for ya coast to coast am dot com you can see are beyond belief shows bill ... takes us on a guide to a journey through\nSpace and time doing explore ancient mystical realms go take a look at it in our highlight reel the coast to coast am dot com you just click it and take it away and have some fun looking for ways to preserve views here symmetrical way\nThere are things about the faith that so many adults complain about the age namely bags under the ice cores grows feet fine lines and wrinkle finally there's an immediate fix its called instantly ageless an age defying micro cream that accent less than two minutes no needles no pay just a happier\nYounger looking you it's simple to use take a small drop lightly applied to target areas leap damp until dry then apply cosmetics if necessary it's great for men and women people are amazed at how fast at work here some reaction with actual instantly ageless users\nI probably know that in the past five year that my I have gained a lot of fine lines wrinkles make ... have gotten deeper while I was hoping for five years but I think about and I think ten years ago that it\nReally kind of a wrinkle on TV just because I'm your finger and go hide which I had more down here because like the one ... seconds and then it must not turning forty I didn't think would be a big deal to me\nBut that looked like me that I feel like inside instead of\nInstantly ageless today go to our exclusive website HP gone dot com age E. E. B. E. G. O. N. E. dot com that Ajmi gone dot com or\nPaul eight hundred she's five seven zero three eight times try a sample size for Nineteen Ninety nine plus there's a twenty nine percent discount on for a check out instantly ageless available today at age be gone dot com or to\nFree eight hundred she's five seven zero three eight sides instantly aid but at age ... gone dot com [noise]\nNews radio warning orange [noise]\nMessaging ... considering going back to school I suppose the following questions you need to flexibility to take classes on your schedule you must college credit you need transferred to earn a quality degree from the world renowned university if you answered yes to any of these questions Arizona State university is the perfect school for you\nArizona State university hours over a hundred and fifty highly ranked degree programs a hundred percent on line to learn the same degree and see what I'm ... from wherever you are on your schedule plus ... transfer credits\nFor information now he's three five five lines hadn't\nLearned for yourself by the wall Street Journal thanks and you stay\nIn the nation from producing that best qualified graduates and white eighty seven percent of ask you grab recruited within Ninety Days are graduates and learn to grow marriages exceed and learn to ride at Arizona State university to learn more about ASU online degrees tax now two three five sidelined setting\nEl ... kids three five five lane set and\nIf you need anything from the simple home repair you a major ... you need to know about home than either totally free service they instantly connected with top local service ...\nIs a very easy way contractor and for me it's the only way\nYou can you have a nine or ... your house cleaning your meaning electricians plumbers handyman\nWe've had nothing but fabulous every single time just the lesson type of work you need done and home advisors pro find your technology instantly find time for those in your area you can read customer reviews and the pros even use their ... guide to find out what hundreds of other repairing improvement project caught in your area\nI think everybody you know I tell everybody either\nHome advisors a total solution to any type of work you would ever want to do around your house\nAnd best of all it's completely free done at home by their dot com or download free\n[noise]\n\nThan\nWelcome back to the coast to coast Matthew swing with us is website is linked up the coast to coast them dot com a couple of his other books haunted rock and roll ghosts of country music more hunted rock and roll we'll talk a little bit about that tonight\nAs well but tonight right now we're talking about his latest onto the world war two soldiers spirits ghost planes and strange synchronous cities\nPearl Harbor is it haunted or not\nThere's a story of alone be Seventeen crew that watch to UFO track them for miles I I think almost a about an hour and then of course a lot of people consider what's known as the battle of Los Angeles\nWas a great story of those\nYeah that's an amazing story and a and usually I think the was the story was the moving Nineteen forty one with John Belushi they made it seem like it was just based on what the war department called war nerves in other words this was\nA shortly after World War two I think er I'm Sorry after the bombing of Pearl Harbor I Believe it was in February of Nineteen forty two [noise]\nAnd aircraft gunners anti aircraft guns started firing in the air there was all kinds of pandemonium a and the war department just said the the people were nervous but I found it very uh an account from a very uh good witness\nWho are actually was ... a professor\nAt occidental college um later he was just a kid at the time and he said that uh what he witnessed was a huge object that was pretty much just standing at it sitting still in the middle of the ... right above the ocean\nThat these guns were trained right on it and it didn't seem to have any effect and then it drifted it almost sounded like it drifted right over his head so it was a to me that was more of a story about something weird happening in the sky let alone a war nerves\nWoman and they shot against the math you people could hear ... sounds yeah and we're hitting something\nRight this this person actually said uh some of the shelves were landing a few feet away from them and they had a the spotlight trained on it I think there's a a pretty dramatic picture that shows that\nIt is dramatic Matthew swing with us his latest book haunted World War two where do you get the book math you\nYou can get it at Amazon dot com Barnes and noble dot com go to your um a local bookstore and see if they have it in if they don't shake 'em down and try to get it in for me I'd appreciate it\nWhat about haunted ships from World war two\nWell I didn't want to just I didn't want to leave our our sailors out\nNo nine years maybe for me so let's not leave aside\nWell yeah I'm going to make sure I have those in there so the interesting thing about uh after World War two as you had these battleships\nYou had ... ah aircraft carriers and they were engaged in so many activities so much a honor that ah those sailors served in that it was a shame to just got all them or to reduce them to scrap but luckily for us a lot of\nPeople got into preserving those um\nShips those aircraft carriers and his battleships as living museums and they brought him back to different ports and and also when they brought him back to these ports they brought a lot of a ghost stories with them and and some of the ones that I collected the USS Yorktown which is now in Charleston Harbor\nUm there's a lot of activity or a witness their shadow figure is probably one of the ones they call him shadow ed and Ed's stands for enemy designated which was a World War two term for when you come in contact with the enemy\nOr there's some pretty dramatic stories of ghost hunters chasing this shadow creature around the the carrier USS Hornet I think is probably one of the most\nCommitted a ship based a haunted site\nUh there there is a story about a man dressed in white naval uniform who uh wanders around that deck some of the battle ships the USS North Carolina I worked with um a a few a paranormal investigator from Port city paranormal\nAnd they basically told me they they have a career documenting the ... on there\nUm and of course we mentioned USS Arizona all of those uh and there there are a lot more I was finding them even as a I was starting to publish this book so yeah there are a lot of World War two ships are haunted and I'm just glad that they preserved them and have him back here goes and all\nJust an amazing series of events that have been happening that seem to all have a similarity in that has to do with tragedy ... for some reason tragedy makes these ghosts or whatever we want to call them hang around don't you think\n[noise] yeah I mean absolutely that seems to be the one common element\nOf uh you know I'll say not just the ghosts of World War two but when you talk about haunted rock and roll which I investigated and even some of the ghost stories of\nOf country these tragedies just seemed to linger it's like either the spirit doesn't want to let go uh somehow this is a interaction between consciousness of reality or maybe they were just so crime and um to to\nWhen we hear these tragedies can maybe hope that that uh the spirits go on or the spirits linger there's probably a lot of different reasons for that those are just some of the ones that I've come across\nOur special guest of course is Matthew Swain we're going to take calls next hour with him stories and questions of course and uh let's get into when we come back also after the break Matthew a little bit of euro haunted rock and roll stories those are those are fantastic too\nI Love them that's one of my favorites\nAnd they just keep coming more and more and more they just never stop like you know people like Michael Jackson who passed on now when prince and folks like that have they come back you up to a ... as a ghost\nWell there are definitely go stories about Michael Jackson uh there were a few\nA video anomalies when I'm when I Believe his brother I Believe it might have been germane was being interviewed people said they saw Michael Jackson walk behind him there are stories from a neighbor's of a former home owned\nBy Michael Jackson claimed to hear music coming out of it at odd times when there shouldn't be anybody at home so that definitely a Michael Jackson\nCoasts have been seen there are starting right now a lot more good stories about prince who just died I think back in\nTwo thousand sixteen [noise]\nHis uh Paisley Park has his recording studio several of the workers there claimed to hear people shuffling\nAround to hear voices fans have also blog about how they believe like they had an encounter with it goes to print\nOut they seem to be everywhere will come back we'll talk more about some of these altered rock and roll stories and take some calls next on the coast to coast am joined\nThe coast to coast am Facebook page with thousands of members his great great show updates in connecting with other man's go to Facebook dot com slash coast to coast am including like buttons\n[laughter] just use used affect your life imitating life American\nAnd experienced it first of all that and make\nBetter life in this life\nT. R. H. the folks at independent electrical contractors they know you're already a good electrician they want to help you become a better business owner lean law labor laws contract last for them and training project management training OSHA laws in classes continuing education tax seminars\nHuman resources seminar succession planning are you going to sell your company to who's going to take it over as you get older\nI strongly encourage you to be a member of a group I'm a big believer\nIn and had been for many years independent electrical contractors seven won three eight six nine Nineteen Seventy six\nThis report is brought you by church services cultured services and get a precision tune up for fifty nine dollars that produces energy used by up to thirty percent improve performance and helps avoid constantly future repairs over just fifty nine dollars go seven three seven two to five thousand that seven when three Seventy two five thousand or a book on line at church services dot com\nThat biggest music festival of the year and it's coming to the scene you'll use our radio music\nYou'll miss the iconic performances\nTo watch her must see I heard radio music festival tonight seven pm on cw thirty\nNine [noise]\nTwenty first century has found media getting social so much of our lives are online yet with millions of choices and down\nYou only need one change E. R. H. O. local news that important to me joining us on\nWith exclusive views contests contests and more I like to see local news to find out what's happening right then and there and just click on the link and Katie Ari\nFurniture made in America studios this his youth Radio's seven forty Katie R. H. abused and and I argue radio stations today is Brett\nEven better for the digestive tract and immune system and dogs ... try liquor jobs by to get one free this is Henry look authentic for die by\nNow [laughter]\n[noise]\n\n\nAnd welcome back to coast to coast Matthew swing with us Matthew I'm Adolf Hitler as sick as he was was also interested in the cult did you come across anything that the dealt with that\n[noise] you know I did and I came away with a little bit of a different perspective about Hitler in the cold or you know initially I thought that Hitler was a a cult practitioner throughout his life\nBut what I found through my research and this is pretty controversial when I'm sure they're all people have have different ideas and I'd be glad to entertain those thoughts too\nBut it sounds like Hitler's early\nA philosophy was influenced by\nA cult groups like the full society in the ... society very prevalent in a pre World War two Germany in that area\nBut what I think happened was that Hitler was of all things are not an occult theorists but more of an incredible sociopathic nurse assistant I don't think he could think\nThat there was any type of power a worthy of him I think he thought he was the ultimate power and that the state was the ultimate power\nAnd so what you see later is that a Hitler begins to purge a lot of it is a cult groups he starts to go after fortune tellers and astrologers so I came away with a little bit\nOf a different opinion on the cold in in Nazi Germany uh likewise I was sort of fascinated that the cult played a much bigger role in my opinion a among uh the side of the allied side so there were\nThe wiccan in England who uh try to get together to uh spiritually or go after the Nazi regime or they held meetings and the ... got together\nWith the express purpose of trying to to stop 'em Germany from invading England and likewise uh and I really picked us up from a frequent guest on coast to coast Mitch or with\nUh the allied a new thought ... a movement those are a lot of the practitioners for that group were very involved into trying to use spiritual techniques a cult techniques\nTo stop Hitler from uh from succeeding so those were a different ways that a ... you know when I tried to write a book I'm I'm really I Know a lot of people write books because they know a lot I like to learn a lot\nSo I go into some of these stories with really preconceived notions and then as I delve into it I find twists and turns that that I I Try to bring out uh in in the book\nNow in your stories on haunted rock and roll told me the theme about those\n[noise] well the theme about haunted rock and roll is that I really when I started writing hard rock and roll and again another I listen to our Gary Patterson on your show many times ah\nAnd ah you know I started to investigate and what I thought initially was that rock and roll had this special cult power and maybe people that were into the Cold War attracted to it\nBut after writing of the country booking and revisiting rock and roll for more on a rock and roll when it comes a came away with is the thought that\nMusic is really just to consciousness raising tool ah it's used in just about every religious service are out there it's also a key part of a lot of\nUm historical movements like the civil rights movement there's something special about music that I Believe raises the consciousness\nOf both the listener and and the musician that I think makes either people more open to things like the supernatural the cold or maybe a you know actually can kind of promote these these types of powers in these types of of of visions\nSo that's really the theme that kind of runs through all of those book in my opinion\nWell that's pretty dramatic stuff and like we were talking earlier the current rock stars that have faded a haven't shown up yet but they will I think eventually don't you\n... yeah I sometimes this is a matter of what I find is that it's a matter of\nThese stories in these tales of the supernatural usually start out than to than musician to musician\nA person the witnesses it talks to another friend and then for me it usually bubbles up on line and blog posts and then uh newspapers will investigate I'll look into it goes counters will be attracted to the site so it takes a while I'm I'm Still waiting for some good ghost stories about David Bowie for example\nJames Dean of course died young in a car accident and was in his car chopped up into little pieces and they saw all the parts and apparently they were haunted\n[noise] yeah that's a ... ... the name of his car yeah he um he had a car was a poor spider was involved in Iraq and then\nA pieces of it because it was really a race car um pieces of it were salvaged and I know there's one story about I'm a ... a one race car driver used a piece in his car and a car fell on him and I think crushed him to death [noise]\nBelieve it or not there's a parallel to that in the haunted World War two book there was a\nI think it was a beat twenty four the crash landed in the desert of North Africa pieces of it were recovered are that are now in the national I think air force a museum a and\nPieces of that plane were report it to be cursed in that uh I think some of the pieces went went into a a a a plane that later crashed I think a couple of planes crashed based on and so so there is a connection\nAll right let's take some calls here for you Matthew let's pick it up by going to Frank in Hollywood, Maryland again to start and Frank\nHow did your back with you when you made any subject I\nI I I think you know they somehow think they are not the Nazi Germany but what about\nA place where people were murdered by by not a\n... I was a film where they get a shot three hundred shot down over a day that they were shot down a credible what was found\nAnd I'm Wondering if any any hunting and in a remote places where you're not you're not take my answer off air okay\n... thanks for that that's a that's a great question and I believe I Know exactly which\nWhich footage you're talking about and believe it or not one of the stories that I came across a is I think from that area because I I Believe that that might have been taken in Poland Czechoslovakia and there are stories about some of the victims of the Jewish victims of those atrocities\nUm that still hunters areas again I I I found out of a difference for those those people that I Would leave them out of the book and and wouldn't try to try to um\nYou know be looked at like I was making any money from that so I I left that out but yeah definitely those stories crop up and I guarantee you if you were in those areas you would find a lot of go slower a lot of folklore and a lot of good stories about those places\nNot stop we go to Charles ... St Charles go ahead\nEither yeah well I was a ... a a a me and my dad were a a ... I was riding along and pick up truck over in a at a\nOver here in Texas we saw a ... quality you go what a number of the oil or go find out what ... I didn't think about it you know clearly at the time it was sort of strange\nDidn't look real to you at the time\n... ... yeah it it looked like that that is one thing and I had my windows down right around that are with the windows down and pick up and the and it was totally it was like I it was white I think I could almost like that on top of the pickup truck I thought\nWell now that's interesting Matt ... people see these planes are the physical enough where you can't touch it\n[noise] yeah I mean the the\nCallers account is almost identical to what some of the people a ...\n... experienced in England where the the plane looks real it doesn't look like it\nA John we've got most of the new accidents forty five north freeway southbound after north main street\nIt's affecting the left lane on liquor delays woman sitting back by about two to three minutes in that area and we do have that we can construction wrap it up soon I ... and Sheldon that's going to be shut them until about five AM ... Killian in the ... windows dot com twenty four hour traffic center\nMost of the county for tonight training partly cloudy overnight snow twenty percent chance that ... that many mixed clubs sunshine for your Monday Columbus Day with the present Chan who's gonna showers and storms were breezy hide mid to upper eighties a fifty percent chance of getting started again on Tuesday hide mid eighties I mean does talk about Weather Channel\nSeventy nine degrees in Galveston Seventy five at the woodland in Seventy eight of the ...\nTwenty four hour weather center KTLA Tucson three thirty won the Republican Party cheap believes justice Brett Kavanaugh's confirmation will help GOP candidates in November\nRenault Romney McDaniel told Fox News that she thinks they'll get a boost particularly in the Senate races\n... she says her base is totally energized twenty people killed in a deadly limo accident about Seventy miles north of New York city limit rent a stop sign Charlene Caldwell at least used in dead after she was beaten to death with a baseball bat her boyfriend confessed to police\nAnd the Texans beat the cowboys sixteen to Thirteen last night and then our stadium Astros play Cleveland today at eleven o'clock tackling the mound and you can hear it on sports talk seven Ninety news on demand a K PR each dot com our next updated for breaking information as it happens John Wesley Downey news radio seven forty eight T. R. H.\nVery ... hurricane to be informed citizenry prepares\nOf racial fear weather station when your family can be prepared\nTo use radio seven forty\nKatie our age this report is brought you buy unbalanced dot org right now there are young people across the world facing a tough choice continue their dream of education or drop out to help their family put food on the table\nYou can help change their future in a single moment see how far your support can go at ... dot org\nYour linked to a faster commute traffic on news radio seven forty cagey R. H. hoops steam\nCleaning show up on time to clean your carpets they'll do a good job they won't up so you know if there are other things you want done they'll do it not so much that costs\nCommercial carpet cleaning is well not just your home air duct cleaning natural stone ceramic tile grout cleaning bathrooms kitchens all of it counter tops oriental rug upholstery they can do it all keeps steam dot com to eight one eight to two oh five six one\nTo eight one eight to two oh five six one\nThe biggest music festival of the year and it's coming to their CWC I already all music\nYou'll miss the iconic performances\nTo be Vegas\nTo watch her must be I heard radio music festival tonight at seven pm on cw\nThirty nine we all have some pretty cool\nFriends celebrating is a very good friend of mine's on more than other call I got as a friend of mine there is one person we'd really like to be friends with you on a link\nTo my friend of mine that Katie R. H. dot com\n\nBolo news weather and traffic Alexa like Katie our age and I are draining I'll\n\nOh\n\nMan\nYou to talk to your jewelry all the wild card line one eight five zero one for one zero in on\nTime caller mind is the one eight five zero one\nFor seven to one to talk to free from east of the Rockies go eight hundred eight to five five zero three three from west of the Rockies to free go eight hundred six one eight eight to five five to reach Georgia via Skype use guy named George nine seven three one three\nSin Georgia text message anytime they won eight to nine eight seven six five to one is coast to coast am with George ...\nOn our next coast to coast program we're going to talk about smart robots and also to ghost photographer she'll get ready for that or just the echoing of course the other caller who took a picture of duck call and soft three very strange beans there as well paranormal day dot com it's approaching\nSeventy nine thousand members it's two hundred and Seventy five people shy of that free to sign up go ahead and meet somebody you turn them all date dot com\nAnd folks producer time here the other day I was on the Web looking at the coast to coast am store and all the amazing find items that are available signature mugs ... coffee drinkers V. next church for the ladies\nBaseball caps bathrobes and more it got me thinking about where all these great items come from so with me now is Jeff Schwartz Jeff as the c._e._o. of shorts promotions and the creator of all these new merchandise Jeff how do you come up with all the ideas for the coast to coast and products\nTom thanks for asking I Try to come up with items that are both useful and fun and some of my ideas even come from coast listeners and what's really neat is we have new products and promotions all the time and how long does it take for people to get their items we ship all the orders and twenty four hours so they get to you in no time\nWell there you go convenience shopping and shipping quick to order your favorite item and it will be on the way in no time these items are must for any coast listener here's what listener Angelina has to say\nI Can't ... I get and people ... to ... a a cap I Know that when you get the part that gets her friends she let it go and that was very\nThere you go here's your chance to get that perfect gift for someone you love or maybe treat yourself and show everyone you're a member of the coast to coast family by supporting your favorite coast merchandise it's easy finding the item you like click and it'll be in your hands before you know it jumped on over to the\nThe store and check out what's available go now to coast to coast am dot com that's coast to coast am dot com [noise]\nNews radio seven forty taped ER age [noise]\nAre you considering a safe to secure your valuables or firearms let's face it seeps are not very attractive they usually end up getting stuck in the garage\nOr in a closet wouldn't it be great if there was a seat that had to look up a beautiful antique so you could display it in your living space as an heirloom while also having easy access to it while there is check out the\nRhino iron works and rhino safe dot com\nAmerican Made an antique styled our seats are part art part furniture and all security\nAnd if you like the classic look of our rhino fireworks apes we also feature beautiful matching tool chess\nAnd furniture with hundreds of thousands of satisfied customers tend to a huge network across the U.S we've built our reputation on having the best bill best looking and most convenient sakes what great service and warranties and you can get online financing\nSo go with the best and gets style convenience security and true peace of mind with rhino C. dot com today that's rhino save dot com rhino safe dot com\n[noise] we've got a great feeling sorely carnival and now\nDavid your guy that has overcome a severe issue\nOr like a light the light bulb went on and I started to research on there and say ... I was going to capsules I couldn't get enough it made me feel so much better I can only tell you one thing\nThe product war and not only works in one way it works in a whole bunch of different ways because it gives me energy it gives me like Tallahassee\nCare even right now it's just a better way to build everything back into my body taken a while but you know on his back there and I ... I Can't say I don't know\nThis is Richard Haass throw owner for carnival or research international call one eight six six eight three six eight seven three five that's one eight six six eight seven six eight seven three five or visit carnival rent dot com C. A. R. N. I. V. O. R. A. dot com call now\n[noise]\nHouston sounds good everywhere okay Google like Katie R. H. I. heart radio [noise]\nAnd", "year": "2018", "show_name": "Coast to Coast AM with George Noory", "city": "Houston", "day": "08"}