{"month": "10", "state": "NY", "station": "WAMC", "content": "\n[noise]\nThis is Northeast Public radio WAMC up an HD Ninety point three Albany\nW arguing HD Ninety point three rooms and Utica W. M. K. HD Ninety point I think than W. O. R. H. D. Ninety One seven Middletown W C. E. O. H. D. Ninety One nine Plattsburgh WC a an HD Ninety three three candidate Harry W. N. C. H. D. one oh three point nine tie kind of rogue W. M. H. D. one by one great aren't in\nW. W. E. S. H. D. idiot point I had not just go W. A. N. D. H. D. Ninety point one Stanford W a an eighty eight points by Brewster and WAMC am fourteen hundred Albany [noise]\nWelcome to today's program of\nThe commonwealth of California I'm Gloria ... the president and CEOs the club a nonpartisan non profit public forum dedicated to airing diverse views on important topics of the day who would've thought that things have a nice day could be controversial at Harvard professor Steven\nPinker has been receiving a lot of resistance to his message that this is a nice day or more specifically that it's the best time to be alive because of the study of wealth and will be around the globe along with the decline by [noise] to learn more about the reasons for his often those in the midst of so much in the\nWe invite a doctor pink or to make his case\nHe was in conversation was ... hari most of the inquiry minds pod cast this program was generously supported by the Kennan Jackie bright family fun we would also like to thank United Airlines now please join Steven Pinker Sheree hari for their commonwealth club conversation [noise]\n\nGood evening everyone and welcome to tonight's program at the commonwealth club my name's ... hari and I'm pleased to be your moderator for tonight's program joining us this evening is the one and only Steven Pinker Johnstone family professor of psychology at Harvard University and author of the best selling book enlightenment now\nDr pickers and experimental cognitive psychologist in enlightenment now explores the progress that humanity has made through enlightenment thinking while today's world can be characterized by hyper polarization disintegrating discourse and the degradation of fact he argues that the world is actually improving\nSo please join me now and walking Dr Steven Pinker [noise]\nAll\nRight Steve I made the mistake of opening Twitter\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu [noise]\nWhich I think a key feature of the of that ad you spend a lot of time arguing the reverse that this is one of this might be the greatest time to be alive how so\nPeople are living longer and what's more fundamental for life people are a wealthier by that I don't mean the one percent but I mean uh the bottom ten percent that\nRates of extreme poverty have been plunging by about three quarters and just the last three decades a rates of literacy have\nHave increased about Ninety percent of the world's population under the age of twenty five can read and write\nRates of death in a from all forms of violence are in decline there are fewer people were killed in war in a\nStick decade than I and the nineties the eighties seventies sixties fifties to say nothing of the of the world's worst rates of violent crime had been declining for the violence against women or so in most measures of human well being\nYou see improvements over a span of decades and centuries\nIf I wasn't a mistake and you sound like a hyper optimist to me actually is that the point of this book you\nKnow the point actually it's not optimism that all the point is I knowing the facts\nThat it's not a question of well if if global poverty has fallen to um ten percent should we concentrate to be happy about the Ninety percent or upset about the ten percent the fact is we should note that the numbers are Ninety percent and ten percent most people don't know that most people when asked\n... is poverty across the world extreme poverty increasing or decreasing majorities say increasing or staying the same the correct answer is that it's decreasing there wasn't a question of optimism this is the question is just going facts likewise\nIs the rate of death in warfare higher or lower now than it was saying the Nineteen eighties now it's not a question of being optimistic that there are fewer wars or pessimistic but they're still in a off of wars in Syria and Yemen and elsewhere\nIt's question just knowing which way the world is going what\nThe late Swedish doctrine ... calls fact fullness\nFact fullness I like that knowing what the facts are now now should we be\nMy wife is going to call me full of facts later [laughter] I don't know how I feel about it why a return to the enlightenment of all the periods of human history to have to kind of crawl back towards whiny light minutes been two hundred plus years some\nYou know it's it's not it's not it's not a return is not calling back it's not ... bring back the light and that it's a question of affirming a set of ideals that were most articulate we stated er during the enlightenment but that are still relevant namely reason science and humanism\nLet's start to unpack those ideals but first to a minor history lesson what made those ideas emerge at that time\nSo we we it's it's a hard question to answer because it only happened once and so with as with any historical event we can't gonna replay of faith the tape a number of times and and the number of ways at times that went in different directions depending on what immediately proceeded it\nBut a plausibly the rise of print and literacy that if you were to look at something that happened before the say the second half of the Eighteenth century that's when you want to more or less center to the ah the the light and\nUm it was an era in which the population of European countries so past fifty\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nCosts of printing a book or a pamphlet plummeted us those greater mobility of people and ideas it may have been the historical memory of the wars of religion of the um sixteenth century or sixties seventeenth century\nFat people realized that killing people by the tens of millions depending on their interpretation of the holy trinity probably isn't the best way to run\nA society in part it was the fruits of the scientific revolution which show that a lot of ... human beliefs were were were outright false of which the ... the faith belief that the son\nWrote revolves around the earth is maybe the most famous example and perhaps the the result of uh the age of exploration that they were all of these continents that\nTeeming with life with people's with of a different cultures that\nPeople didn't even know existed until a century before sort of expanding people's horizons to all of the things we don't really know what was the cause but um but they all seem to come together\nAnd I want to unpack some of these ideas now so when you say reason I think that means something different nowadays than what you want you unpack in the book wait what do you mean by reading\nRationality logic uh LA it does not have had in good yeah rationality logic as opposed to\nAs opposed to dogma as opposed to\nParsing scriptures as opposed to authority as opposed to conventional wisdom or as opposed to gut feelings that the feeling of subjective certainty and after the glow of of a feeling that you're in the right because you're you and your your um this intimate infallible\nOr that someone else who you admire assessed that they are on this tour infallible superstitions a dog my\nFair a so those are all alternatives to reason\nAnd science I I think\nThe science the application of reason to the the natural world so not all of reason to science because there is also logic is also mathematics there's also a moral arguments but when you apply reason to the way through the way things are work than we call it science\nAnd then the the one that I I think most people haven't haven't heard of or at least some packages humanism\nYeah so humanism is just the idea that the ultimate moral good is to promote human well being that is the the ...\nHappiness the longevity the knowledge the experience of men women and children and other animals but we'll we'll we'll begin with humans\nAs opposed to now you can say well who could be opposed to that I mean who could be against people living longer and and I'm a been healthier and and uh having enough to eat well there are alternative moral system such as that the ultimate good is to carry out God's commandments or to\nMaximize the glory of the nation or the race or creed so even though it may seem to be completely unacceptable that you do what makes the most people better off\nTribalism of authoritarianism but there are intellectuals or defend Trump and they often alludes to counter enlightenment ideas or Steve Bannon considers himself an intellectual ah there were a\nTwo hundred academics who signed a statement in support of Trump a ... a couple of months prior to the two thousand sixteen election and the ideas behind Trump is an art counter and like the idea is there's no such thing as a humanity and they're just tribes either as a zero sum competition between tribes\nTo surrender national interest to global cooperation is to be a chump in a battle of a tribe against tribe race against race so he's our ideas I think that terrible ideas but they are ideas and the west\nBy no means a ... ever as you do these ideas to the debate that's going on within the west\nSo did you write this book in response to the rise of of Trump ism as you put it this tribalism that was emerging\n[noise] no I although not at the outset although I did have to incorporate that uh the I I began to book in two thousand Fifteen I signed a contract for the book in two thousand Thirteen\nAnd so the idea that Donald Trump or be president was a ... came out of The Simpsons quite literally [noise] I mean it was it was absurd at the time\nThe Simpsons has proven to be quite pressure you well yeah\n[laughter] ah so it didn't require and this was a pretty uh pretty conspicuous elephant in the room that I could not ignore in a book on progress and so I deal with\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nBecomes more efficient we're guaranteed to almost to think that things are getting worse even if as I'm getting better that's one reason\nAnd putting on my scientists that are ... are we evolved in ... in our evolutionary history is that a a situation that we're we're naturally predisposed to because our brains aren't moving at the ... at the speed of ... of news if you will in term yes it is it's development\nYeah I think that that's right that the uh\nData sets really didn't exist until quite recently where we're naturally numerous they uh arithmetic mathematics are recent inventions in human history a\nOf a existed for a fraction of the time we've been we've been ah human ... it's not a a catastrophic the fact that our mind goes with a samples and anecdotes because after all those are are not only available\nBefore the existence of literacy and data gathering organizations but they do reflect local conditions or\nAs a not a bad first approximation it really is true that there are more pigeons city than than than white breasted nuthatches and you know that without having to do a bird census you don't have to look a day that he was just consult your your images and that's a case where your images are are are correct and they often are correct\nBut not when it comes to a world of seven billion people\nYeah so this is the one of the things that struck me as if that doesn't come naturally to us this idea of of thinking in the world in these hyper rational ways through the lens of data because we are human we are predisposed to our evolutionary roots\nAren't you asking us to take a little bit of a leap of faith\nWell to to think this way\nNo it's not a leap of faith it's the week it's a leap of education it's the opposite of a leap of faith\nThat is we [noise]\n\nIt it certainly does require a inhibiting certain impulses in states north going with our our our gut feelings to uh to allow our best data are best reason are the fruits of our educational system to override our intuitions\nI just think back to um I Can't remember exactly when but George W. Bush talking about leading from its good and um how trapped of that was\nTo see a leader talked about it that way you describe like the leaders that we should really be attracted to the ones that speak to reason and science because they're going to be grounded in progress is is that a fair assessment of of of your point\nYeah so they the that um the policy should be based on rational\nAnalysis for sure I Know of course a politician in a democracy in order to be elected has to appeal to people with all of their biases and emotions and intuitions so skilled politician\nA and an admirable politician would be one who combines the most rational analysis of policy with the greatest skill in\nThe attention and and support of a of the people of the country so when they don't recall the person a demagogue ah when they do then that that's probably the best we can hope for leadership and a democracy\nOr the best we can hope for a few like that is resident right now um [noise] why go back two hundred years that timeline seems arbitrary on some point I understand you were going back to the enlightenment but why not fifty years ago or or more realistically for us\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nMy life in the context of wow and Seventeen Fifteen they weren't doing as well or as I Am now I tend to think about like how I was doing a year ago maybe even ten years ago\nWell the thing is that these these trends are a visible not just over centuries but over decades and and over the years I mean not all of them there's always goals that can be reversals that can be sickening lurk troops\nBut I'm going back to the extreme poverty a as a nation that's a hundred and thirty seven thousand people a day for the last Thirty years who've escaped extreme poverty\nUm when it comes to war and democracy just in my own lifetime I mean I I when I was a college student world had thirty one democracies today as a hundred and three there were wars to kill people at a rate of nine per hundred thousand per year now the rate is about one point for for a hundred thousand per year\nI have long had the sense that uh\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nAnd you're offering something ... you're saying you're offering a rebuke against that idea yeah I'm ... ... talk about that a little bit your your thoughts are on pessimism or in a span opponent and the thing\nYeah there is a a um a a tendency to give more um ... some credence to to pass them is a there is a financial aid and Morgan house on said that a pessimist sound like they're trying to help you optimist sound like they're trying to sell you something\nThis may be a reflection of another a psychological feature they some of the negativity ... bias that bad\nWays I'm a more heavily than good we are we drive losses more than we look forward to gains a criticism stings more than praise or booms ah we\nAh remember recent bad events better than recent good events and so that may open up a leash for people to remind us of bad things that we may have overlooked and so we do a\nScribe greater moral seriousness to to pass them is ah the biblical profits are a good example we consider them both moral and they warned of him in and do\nIt it's easy it's it's kind of cheap and easy to be a\nPessimist 'cause they'll always be things that go wrong and you can if you assemble a list of all the worst things that are happening anywhere on the planet any given time it's always good look pretty depressing now of course something ... tons of things do get worse is not this is not an argument for optimism in the sense that we should always believe things get better\nThings don't always get better and then there's no reason to believe that they will left to their own devices [noise]\nIt's a rather that we should have the most accurate assessment that we can half of the state of the world and the direction that it's going to try to identify what it is that makes things better and do more of them\nI'm being missed allergic but I in my house I grew up and we would watch the news every night and it wasn't good news back then we'd watch Peter Jennings on ABC and there is always bad news they left one segment at the end that was sort of the good news\nBut it does feel like there is a prevailing sense when I turn on the news now that it feels more pessimistic than ever yeah why are we seeing a trend line in that direction with the coverage of the narratives that we see out\nThere there is a good question and it and it um you know I have to be careful not to say the phone to my own trap and say well for the the news is getting worse or the news getting more pessimistic without any data and so I did find that there is a a data scientist named ...\nWho did a a random algorithm that\nTallied up the number of positive or negative words in news stories in the New York times and in a sample of a global new services since the Nineteen forties\nAnd found that in fact it has gotten more more pessimistic for justice people are living longer and there's and and I received death in war been going down and racist literacy even going down\nThe news has been getting more and more morose and so this is the fact that there isn't just a a ...\nWho's leading the horse there is that reflective of something that we writ large as the public is inspiring the media to red light of that or is it the reverse\nA good question if it was just the negativity bias and human nature that would not protect that there should be a trend toward greater pessimism because human nature I haven't changed in the last Seventy years or it may be a combination of our greater ability\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nNews teams to the remote corners of the world now everyone with a smartphone as I can can beam\nVideo footage to the to the Web instantaneously is partly paradoxically the I'm a kind of a gift of are expanding circle of empathy that we care more about people and not just people other organisms and parts of the world\nThat may have fallen below leath our radar in the past so we care more about famines in Africa and uh and wars in in in now Yemen that our ancestors may happen little kids being bullied and um and women being sexually harassed which used to happen but just wasn't an issue now it is an issue [noise]\nUm and and the third part a possible answer your question is that there is a change I think in the culture of journalism where it's considered increasingly ah especially since the seventies I think that the\nUh mores of of of responsible journalism ... were a as increasingly been to point out what's going wrong to speak truth to power to to break the mock\nA and that there was a there is a revolt and I think in the culture of journalism to the old style of uh being complicit with um power structures not to show Roosevelt from the waist down because it wouldn't be wouldn't look as presidential\nTo overlook JFK's affairs to kind of be cheerleaders for the government now it's the other way around\nPerhaps even gone to an extreme where I every a civic institution is considered to be a target for an aggressive take down and there's a kind of cynicism that nothing could ever work everything is corrupt which may have had pernicious consequences\nBut there has been some criticism of your book a you're not that isn't new to you I'm In one of the the criticism came from from the right especially the religious right who saw this as a rebuke of the role of faith in society a and I'm curious what your thoughts were\nYeah uh yeah I don't think that faith as a role in society I mean there's no faith in the sense of bleeding something without a reason now this doesn't mean that there is no role for religious institutions in society and religious institutions\nUh half of all I'm many of them have become more humanistic even if they don't necessarily use that word\nBut um but yeah I don't think that that any collective decision should be based on a on faith in the sense of the leading something without a good reason on the basis of tradition or dogma or authority\nSo what could be the role of religious institutions going forward than like what opportunities to UC for them it in a world that is is driven by a latent ideal\nWorld religions have a um a a rich historical legacy they they are uh been synonymous with our culture and civilized nation and pretty much I'm Tovia enlightenment um it was probably only with the light minute you there was even a distinction between religious in non religious uh um institutions\nThey can be so sigh for um communal uh experience with people getting together and enjoying the warmth of a community the a reassurance of tradition the beauty of\nA liturgy and music and iconography or they can be ... civil society movements to a\nCharities um support for I'm at risk youth providers of of\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nVery weak civil society organizations they can be involved in I'm In a peacemaking in peacekeeping in justice and rule of law I'm some really there's a as\nLegacy institutions that command a great deal of loyalty there is a potential for religion is to be positive forces what they ... what what I Would call in and it's not not just me but but maybe it's just not to\nBase I any of the morality on a dog my authority scripture but just to to justify that health is good and pieces good and living together as good and tolerance is good and\nAh education is good to to the extent that these institutions dedicate themselves to those humanistic values then they can be massive forces for good\nYou've also face withering criticism from um opponents on the left\nA you are a professor on a campus he's still teach courses and you've been highly critical of politically correct environments on campus and and you even posted that given Ryan's to some uh some elements that our society they're completely undesirable can you talk about that\nYeah um I think the ah\nIt to my horror I have\nA former students who have gravitated to the ... All right um so these are not ignoramus is these are not skinheads um these are are in some cases extremely intelligent articulate a people but they have often been repelled by\nThe uh atmosphere of um of of um politically correct dogma on American campuses uh and and in in certain American media and often when they\nCome across politically incorrect I'm a fax they feel that the uh entire establishment has been systematically repressing\nI'm a a a a\nOf facts and feel emboldened that the exact opposite of the establishment must have a a a greater be much more in tune to the to the to the truth\nAnd therefore often embrace a extreme and unjustified interpretations of certain facts that simply can't be discussed\nAnd therefore we're never inoculated to them ... against the most extreme interpretation sounds all wouldn't it be concrete um the idea that that men and women are indistinguishable at our ... except for", "show_name": "Commonwealth Club of California", "year": "2018", "city": "Albany", "day": "10"}