{"month": "10", "state": "CO", "station": "KRCC", "content": "Eating out there every day on the line from\nBeing on top of all the election is can be a challenge and all things considered helps you to pay your the bigger picture every afternoon on all things considered from NPR News afternoons at three thirty\nOn Ninety One point five K. R. C. C. programming on Ninety One point five K. R. C. C. is supported by who gives a scrap creative reuse center a thrift store carrying a mix of new and used arts and crafts supplies scrap booking paper game pieces books\nBy who gives a scrap creative reuse center a thrift store carrying a mix of new and used arts and crafts supplies scrap booking paper game pieces books and more now with their new location five twenty west Colorado who gives a scrap Colorado dot com you\nGot a June to southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs K. E. C. C. hunter key CCS stark ville advocate W CCF em woodland park streaming at K. R. C. C. dot O. R. G.\n\nNo no\nWelcome here Saturday Night edition of Ninety One point five K. or she sees plate special on your host chi chi and starting off his initial set up a special it's Johnnie coat on that and rock me baby\nAnd he's rocket new baby here on Ninety One point five K. or she sees blue plate special\n[noise]\n\n[noise]\nNo no\nYou mean [noise]\n[noise]\n\n\n\n\nI Do oh\nBlue plate special before that sunny cherry in browning Mickey we're stepping it up and go in also in that set Billy givens a kind of taking a breather from ... top temporarily we hope\nBut it's a great fines solo album entitled the big bad blues the song we heard from Billy second lied and starting off this initial set of the special for this evening Johnny Copeland was rocking your baby\nClosing in rapidly on the twenty minutes past the seven pm hour here in Ninety One fine this is G T\n... my name is Benjamin chairman president an order of monument occupational medicine in monument Colorado targeted audience are owners of companies HR professionals safety managers and injured workers the tone of the medical care that they need to get\nBack to work or CC's helped us quite a bit and we are able to obtain a lot of access to individually normally wouldn't have access to through other means of advertising if you would like to become an underwriter like me\nPlease call genetic seven when nine four seven three for eight zero one\nNow you can tune into Ninety One point five care cc without lifting a finger just ask your smart speaker to play K. R. C. C.\nProgramming on Ninety One point five K. R. C. C. is supported by jak wins Irish pub in restaurant celebrating Halloween would drink selections a costume contest and the return of monsters of mark local bands covering the B. fifty twos and queen October thirty first eight PM jak wins bug dot com [noise]\n\nIn my mind [noise]\nWell the dream what up three\nAnd a man on mine I'm a [noise]\nWent out well then [noise]\nThen right\n[noise]\n[noise]\n\nDream I'd gotten married\nStarted me up family\nMy wife had twelve children\nBlack\nMe but it was the\nWhat a dream [noise]\n...\nWhen the moon and\nNot sat down\nMe my bleeding lottery\nAnd I played the odds of do\nA little much money\nWell but it was just the dream\nMonth among them\nUp his own and\nNot pay the road on but uh\n\n\n\n\nIt was during\nThe ... [noise] [laughter]\nIt wasn't it\nWas it on my mind\nWas it on my mind\nAh what ah well more than\nNothing right\nRead about what the White House\nAnd I met in the rebel groups yeah\nAnd take me by my hand and I'm Glad to be able to bring a nightmare\nI don't mind um ah\nAh and when I was on the moon and you\nKnow to\nNothing wow [laughter]\n[noise]\n\n\n\n[noise]\n\n\n[noise]\nDo you have it all down\nTown meal nah\nThey're not in a while or by a\nMan\n\n[noise] [noise] well\n\nYou\n[noise] [noise]\nTo know about\n[noise]\n\n[noise]\n\nWell what do you see someone\n\n\nMy way [noise]\n\n[noise]\n\n\n[noise]\n\n\n\nBut then he said oh\nGod yeah I Know that\nAll\nThe time I\nHeard\n[noise]\n[noise]\nMm some\n... ... ... ...\n... ... ... ...\nAnd are doing\nA little deeper and\nA dream match up and then when the dog ... on the hill and the sky and\nSome of their\nDream about to be there and the dog and all ... and all\nAnd then and\nCurrently and divide it's clear at forty one fifty one and fair in Trinidad also fair in Pueblo at fifty two here in Colorado Springs we have it partly cloudy and fifty five\nSouthern Colorado's NPR station Ninety One point five to your seat you can be with you wherever you go all you need is your smartphone\nDownload the free Ninety One point five to ... mobile apps and Google Flu or the I tuned app store\nNPR on Ninety One point five to your cc is supported locally but bourbon brothers smoke house in ... north gate and bass pro Dr Colorado owned gourmet cuisine and barbecue now serving breakfast Thursday's Fridays and Saturdays and southern gourmet brunch buffet on Sundays bourbon brothers dot com\nOn November ... mile\nHigh in Denver university graduate students the Fort Logan cemetery telling the stories of our own soldiers organization under the counter Lincoln ...\n[noise]\n\n\n[noise]\nMy\nTrue\nLot of\nKnow sharing\nHere although I'm\nWhere you're going to try\n\nI'm sure\nGetting\n\nYou're in a while\n\nA bad\nGuy\n\nA\nGuy\n\n\n\n\nRead the B. B. B. lego ...\nRead the baby being lego learn\nA little heavy living good may change your mind in\nEyes you baby ...\nBaby bird\n...\nLet me worry that you know rather than leave me the\n...\nI'm going okay well they must be going I'm going through a booming with the\n... the weather you drive a new way\nOh you ... I was a huge right when we\nBattle crave high you know I like black and brown\nGrave I gather I like black and brown\nLike all good he's around only use them\nNew latest midnight to shine right leg the\nLate ... right like the ... the oil right away the\nYou made it clear now\nYou think I'm not joking\nWere you to know\nWhat I Would like to know\nWould you take my blood\nYour mom\nI'm renting now\nNot something I\nLove not been a\nLong will it still may\nCall me do it or not eating and uh\nCan we change would we be the\nThing you will but living\nReaching out you\nWhat did you take my good", "year": "2018", "show_name": "Blue Plate Special", "city": "Colorado Springs", "day": "21"}