{"month": "10", "state": "CO", "station": "KRCC", "content": "This week on MORNING edition Turkey's president has put his accusations on the record how will President Trump addressed ... situation just two weeks ahead of the midterms listening to MORNING EDITION every weekday from NPR News weekday\nMornings beginning at five on Ninety One point five to your C. C. programming on Ninety One point five to your cc is supported by the cultural office of the pikes peak region inviting listeners who celebrate arts month this October but having at least one new cultural experience with family or friends\nInviting listeners to celebrate our ... month this October by having at least one new cultural experience with family or friends details at peak radar dot com slash arts months you've\nGot a tune to southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs K. E. C. C. Y. two\nK. C. C. a stark bill and K W CCF that woodland park streaming at K. R. C. C. dot O. R. G.\n\nNo no\nWelcome deer Saturday Night edition of Ninety One point five K. R. cc's blue plate special\nI'm your host G G and studying office initial set up a special it's big bill Morgan feels that he's trapped and we're trapped right along with them here on Ninety One point five K. R. cc's blue plate special\n[noise]\n\n\n\n\n\n\nOoh\n\nOoh ...\n... ... ... ... ...\nYou know\n\nNah I guess\nJust not\nThere\n\nOther\nOne\n\nMan\n\nFrom their debut album for Nineteen sixty eight that's we would Mack you're a Ninety One point five gay or she sees blue plate special shaking their money makers before that really branch and Kenny Neal don't start me talking also with that said\nThe sky is crying about one coming from Skeeter Brandon and highway sixty one and we started off this initial set of this evening's edition of the blue plate special with big bill Morgan feels trapped\nTwenty one minute spent seven PM your Ninety One by this is Judy\nYes you can have great music southern nights a week from seven to midnight and Ninety One point five chance to see\n\n\nColorado Technical University and writes the community to the criminal justice pedal they say the first several andme discipline government industry professionals that evening or formation on our community calorie low here says two that are largely\nNPR Ninety One point five J. R. C. C. you supported locally by a e G presenting an acoustic evening with Lyle Lovett and John Hi it that'd be worry eleventh of pikes peak center more information is available at access\nDot com that's a X. dot com white monument occupational medicine working with injured workers and employers dedicated to helping employees returned to work with comprehensive medical care drug screening and beauty exams and pre employment physicals monument OCC med dot com or\n\n[noise] no\nThis little ... they're not thinking about the you know ... and every block and got to work more than what\nThey were ... y\n... you're right and you move around the bird ... girls who\nGet back you\nI was ... there was all my\nWife was not me\nI live in the new law having fun doing it in their mind in wind but they would not say oh I mean let's say if\nYou're why we are scaling brown newspapers around when as you try to\nMove around them\nGet back get back\nTo me even during the bombing at all and there's a lot of them but I got in line\nMay call everybody number one name never did call mind to see if he was why these your right and really try to stay around but as you drive [noise] was rather\nGet back get back\nMe in a man is working side by side this is more than men\nThere was paying him a dollar novel was\nPaying me see if there's just a few\nMinutes why do we All right before the game if you look around the states around me but I used to live\nGet back get back get done\nIn our bill does continue\nAnd I fought for it to do now that you see what a black man half the do they say if you want\nTo write to him even brown snake around one as you fly\nGet back get back\nOur wins doing victory and with my little bar and a whole new novel you didn't tell me and the problem with your daughter the oh Jim crow now or if you\nWhy do we know alright do really brown David around\nIt by a ...\n\n\n\n\n[noise]\n\n\n\nAh\nThat this man [noise]\nWill know Iran\nHell ain't nothing but a mile and a quarter at least according to Joe Louis Walker Bruce cats and Giles ropes and Iran Ninety One point five K. R. cc's\nBlue plate special started off the second set for this evening's edition of the show the something relatively new from Z. Z. top front man ... missing yo kissing after that it was big bill Bruins the black brown and white\nAnd we followed up with the classic stormy Monday blues this time out as rendered by Albert King\nForty minutes spent seven pm here at Ninety One fine this is G T we're taking a look at what's going on weather wise in the Ninety One point five K. R. C. C. broadcast area\nThis evening it's going to be partly cloudy look for Lowe's and the higher thirties to lower forties tomorrow mostly Sunday Sunday\nWith ... and the higher sixties to lower seventies currently and divide partly cloudy at fifty to sixty five and Trinidad and fair also fair in Pueblo at sixty three here in Colorado Springs it's just flat out sixty and mostly cloudy\n[noise] Hi I'm ... the membership manager here at any one point five years the on behalf of all of us here at the station thank you for your support during the fall membership drives could not do this without you\nYour support your ball members dry you could not do this without you [noise]\n\nRibs and grocery bags for three and\n\nSandy what the answer to build a Jones'\nWeight and she\nEggs like poetry and\nMovie than\nSome\nAge they poetry yeah in\nThe news the wall man\n[noise]\n\n[noise]\nOut around\nI'm never willing yeah the you know\nEighth grade poultry yeah\n[noise]\n[noise]\nDid they oh three\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\n\nI don't\nKnow what a ... a\nA\nNovel go home go take a\nLot of people who own own own own own own own own room [noise]\nAround robbing another man\nOh like the mood that when\nI Believe I really don't know about a mile\nMaybe would have been in the ...\nLet me [noise]\nMy maybe that would ban look on the\nIsland and all that long ago\nIt was all down [noise]\nWhat am I don't know\nA man and\nOf all the God told\nThem to go on to my race\n\nPlease let me go on with the murder rate is lower\nAll alone alone alone alone alone alone alone [noise]\nBald your mind around in law and\nYou're like what does that in the way\nMy I get around in law and\nYou have like the wind blows out in the way\nHe made\nA wrong way but you\nKnow when I was glad you know\nThey're not all jobs out\nThat Ben from ... to do\nAbout it back I mean my\n\nHome [noise]\nI leave my reading the normal", "show_name": "Blue Plate Special", "year": "2018", "city": "Colorado Springs", "day": "28"}