{"month": "10", "state": "NY", "station": "WAMC", "content": "Banks to Bryan strap and then John Callahan of the New York state canal corporation [noise] read author of the New York state museum\nJim handler Rensselaer Polytechnic Institute\nAnd author Carol sheriff inject Kelly for all or how\nUntil next time [noise] ... [noise]\nThis is Northeast Public radio WAMC FM HD Ninety point three Albany\nW arguing HD Ninety point three rooms and Utica W. A. K. HD Ninety point nine Kingston W. O. R. H. D. Ninety One seven Middletown W C. E. O. H. D. Ninety One nine Plattsburgh WC a an HD Ninety three three candidate Harry W. A. N. C. H. D. one oh three point nine tie kind of rogue WM cue HD one by one great aren't in\nW. W. E. S. H. D. idiot point I just go W. A. N. D. H. D. Ninety point one Stanford W a an eighty eight point by Brewster and WAMC am fourteen hundred Albany\nSupport for WAMC come some clear yoga right back working to help develop strengths stamina flexibility and peace of mind through the practice of a young girl yoga classes for all abilities seven days a week clear yoga right back dot com\nThe blue marble a world of gifts on north part of the street and cameras to endorse marketplace Northampton offering a hand selected collection of jewelry scarves pottery law art and gifts the blue marble doctors in Albany pro musical presenting box bliss featuring acronym baroque string ensemble and the boy courts\nHis aunt Albany ... music uh presenting box bliss featuring acronym baroque string ensemble and the boy course stirs of the cathedral of all saints this Sunday three PM at Troy savings bank musical Albany ... dot org\nThis is WAMC News I'm Jim ...\nThe mega millions jackpot is now up to nine hundred million dollars lottery officials raised the estimated prize today less than a day after another drawing ... without a winner\nIncreasing the prize to eight hundred sixty eight million dollars the next drawing is set for friday the estimated jackpot for that drawing would be the second largest lottery prize in us history\nLeaders from the European Union in Britain shrugged off a weekend negotiating debacle in previous deadlines today giving themselves several more weeks to clinch a friendly deal ahead of their separation\nAfter the you insisted for months that today's some it was a key meeting to get a deal it's breaks it negotiator said he needs much more time to work with is British counterpart\nToday is the last day to register to vote in Massachusetts to participate in the November ... election WAMC ... reports\nThe election officers in the city and town halls across the state will stay open until eight PM Springfield election commissioner glass or you'll Lopez said voter registration can also be done by mail if post Marc today and online at the Massachusetts secretary of state's website until eleven fifty nine pm\nThat seems to be the easiest way and you can join via smartphone or a computer so if you don't have a computer don't have access to a computer you can start filing for many people have\nMassachusetts has a new automatic voter registration law but the system won't be implemented until two thousand twenty Paul taught he'll WAMC news\nOn Wall street a short time ago the Dow is down twenty three to twenty five thousand seven hundred Seventy for\nThe ... up five to seven thousand six hundred fifty one and the U.S and the five hundred is up for points to two thousand eight hundred fourteen in the forecast mostly cloudy and windy with scattered showers today temperatures falling from the fifties to the forties\nMostly cloudy and windy with scattered rain showers and some snow showers in the mountains tonight lows in the upper twenties and thirties\nA freeze warning in effect from midnight tonight to nine AM Thursday\nFor the Hudson River valley from the ... area up through the capital district including the Saratoga and Glenn falls areas and for a Washington and southern which field counties\nMostly sunny and breezy tomorrow ties in the mid forties\nAt last report mostly cloudy and forty seven in lake George New York light rain and forty eight in Bennington, Vermont cloudy and fifty in Pittsfield, Massachusetts and it's cloudy and forty nine in Albany support comes from Hadley garden center Hadley, Massachusetts locally owned and operated\nFor over fifty years with indoor and outdoor plans of gardening supplies bird feeders and seeds organic fertilizer ended voice Hadley garden center dot com more WAMC news coming up at three thirty uh northeast report\nSupport for WAMC come some spirit house Amherst, Massachusetts a family owned wind and spirits retailer for over forty years providing products from classic new labels spirit H. A. U. S. dot com\nAnd cold and it Hartman architects servant clients throughout New England and New York was architecture designed for resilience and renew ability designed for the next hundred years C and D H architects dot com [noise]\nOf the woman behind how her the vote\nOut now\nStreaming support for WAMC come from ... bio mass woods to warmth homes and businesses wrote the northeast today's soap stoking automated would heat would boilers dot com\nIt's much harder to create that changed\nMe one woman who was placed in an internment camp during World War two and here from another who use for notes to find her plates in this world I'm Alison down and this is fifty one percent [laughter]\n\n\n\n\nHow her New York state wide network of more than one hundred organizations have banded together to ensure that women's voices are magnified and the women vote in the November elections the nonpartisan initiative power the vote aimed to protect and expand women's right to New York\nGalvanized by the women's marches me too movement and federal assaults on progressive policies that social media campaign hopes to inject key issues into the public debate ensure that candidates address issues of important to women and Dr voters to the polls on election day in November\nHow her the vote launched on primary day which was September thirteenth and the initiative spotlights various issues each week leading up to the general election in November sex with expert blog social media region online forums focused around power her New York's ten questions to ask candidates\nTopics include childcare better jobs in equal pay reproductive rights violence against women criminal justice leadership and diversity\nI spoke with the president empower the vote never really knew felt\nOur really grew out of equal pay campaign that the advocates started at eleven years ago in New York and we were working to raise awareness and to push change it to close the wage gap which I think it was not a topic a lot of people were talking about\nThen and um we've really have done that and made some improvements but what happened along the way is that we realized attaining co pay is actually quite complex\nUm you know for women to thrive they really need like supportive so workplaces they need to be safe at home in the workplace and on the streets they need to be able to determine when and if they have families so\nThe idea of equal pay campaign transformed into a much bigger idea which I'm turned into power in New York I'm wearing a diverse intersection network of\nOrganizations across the state and individuals and a lot of us are working on different issues but we're collaborating because we see a commonality and we had a shared agenda in a shared goal and that's women's economic quality in New York\nSo with that as a platform how did you arrive out working toward the November election empowering the vote\nSo um you know panel her works to educate engaging and we advocate so\nWe've done that successfully and we've been pushing a progressive limits agenda\nAnd you know we've passed good laws we've changed um harassment policies and New York city and around the state but it has not been easy and we know that like leadership really matters\nSo looking at the election we saw that as an opportunity to talk about our issues to spotlight what matters to women we're strictly nonpartisan um but we found a way that we could talk about our issues or join the election season and we call it tell her the vote because we want\nUm but we found a way that we could talk about our issues during the election season and we call it how her the vote because we want people to think about women's issues um when they go to the voting booth and we want to encourage them to go to the voting booth I don't know if people are aware but\nLike only thirty four percent of voters actually cast their ballot in the last off year election in New York I'm In New York is like I think on the bottom of of the states in terms of voter participation so\nWe see see this is a real opportunity to to build on the energy that there is out there right now on to get people I'm aware talking and get candidates and future elected officials listening\nYou're not endorsing candidate we don't endorse anybody but we'll talk to everybody about\nUm you know things like better jobs and fair pay or violence against women childcare sexual harassment equal pay\nYou know the really the plight of immigrant women in our communities um criminal justice and\nSome of the people that I think are very interested in right now is around women's leadership because so many women are taking up um the gauntlet and they're running for office which is a sort of an ultimate of of leadership in our country so um that's how we're approaching this\nThis US government news real shows weld interests children happily drinking milk inside a World War two internment camp [noise]\nEmphasis was put on the health\nCare of these American children of Japanese descent\nSally pseudo was there she recalls a different reality\nThe buildings were so terribly built that the sand would actually come through you know the tar paper and settle all over\nOn your food and everything and that was your food to eat so you did the best you couldn't if what you could and then you'd go back to your room and everything would be covered with that very fine sand\nPseudo who now lives in Minnesota was six years old when the government pride or family from their Seattle a home\nWell all I remember is there was a lot of confusion and I could see the stress on my parents' part\nIt was spring Nineteen forty two just months earlier Japan a bomb Pearl Harbor prompting us to enter World War two anti Japanese sentiment surged so president Franklin Roosevelt signed executive order Ninety sixty six\nMilitary authorities therefore determined that all of them citizens and aliens alike would have\nThe order for us to a hundred and twenty thousand Japanese Americans into internment camps including pseudo family\nFirst attention was given to the problems of sabotage and hasn't been off no\nSan Francisco for example\nThey were afraid of acts of espionage sabotage of which none was ever committed by any person of Japanese ancestry in the United states\nWhen the government center family away they wrote on a train with armed guards to desolate area in southern Idaho\nWhen we get out we see nothing but sand and sagebrush in Greece would I mean we're obviously in a very desert like area\nHer home in the camp blacked running water electricity consisted of single light bulb hanging from the rafters pseudo spent three years that the internment camp\nWe always open every school day by saying the pledge allegiance to the flag and you know it's kind of ironic that we would say and liberty and justice for all and here we are in these prison camps\nOne of her older brothers enlisted in the army in Nineteen forty for his knowledge of the Japanese language placed him in the military intelligence service language school which was located at Fort smelling in Minnesota\nPeople like my older siblings they went to a Japanese school after regular school it's just like I'm Jewish kids go to Hebrew school that kind of thing\nAt the time fewer than a hundred Japanese Americans lived in the state gimme to knock a is a historic interpreter with the Minnesota Historical Society\nIt's likely that Minnesotan had never really even interacted with anybody who would have Japanese that sent\nThe military language schools changed that they brought more than six thousand soldiers to the state after the war language school veterans helped grow Minnesota's Japanese American population to more than a thousand pseudo his brother was among them he bought a house for the family in Minneapolis near many uh falls\nWe were the first Japanese to ever move into that neighborhood uh we got hate mail to begin with we don't want any gaps in the neighborhood you know get out or else\nHowever the Lutheran Church\nMove into that neighborhood uh we got hate mail to begin with we don't want any gaps in the neighborhood you know get out or else\nHowever the Lutheran Church across the street welcome them\nI think it was through them that we were able to adjust as well as we did\nBut first pseudo who's now ... to ... and lives in a diner the psychological effects of the internment camp stayed with her for decades\nI grew up with that feeling that there's something wrong with being Japanese I kind of look down on it\nPseudo didn't embrace trip in a city until years later\nI think people today they need to know how easily or something like this could happen again because the next time it could be\nFurtive I'm Joey Peters\nThe mayor of a socket Japan says he's ending at six decades sister city relationship with San Francisco to protest that statue honoring women forced to have sex with Japanese soldiers during World War two\nTo San Francisco examiner reports that Osaka mayor here ... sent a letter in early October to San Francisco announcing he's withdrawing from a largely ceremonial relationship\nThat statue was erected on city property last year by California's Korean Chinese and Filipino communities\nA spokesman for San Francisco mayor London Breed called you'll see more its decision unfortunate and says the city's will remain connected through people to people tied historian say tens of thousands of so called comfort women around Asia were forced to work and brothels for Japanese troops it remains an open rift between Japan and other Asian nations\nCalifornia has become the first state to require publicly traded companies to include women on their boards of directors governor Jerry Brown approved the legislation September thirtieth that forces changes a California based corporations by twenty twenty some European countries including France and Norway already require corporate boards to include women\nAre forced to publicly held corporations with headquarters in California do not have any women on their boards of directors state senator ... Jackson says having more women on board will make companies more successful that Santa Barbara Democrat author the measure\nThe California chamber of commerce has argued that the composition of corporate boards she'll be determined internally not mandated by government\nThat chamber says the new law prioritized gender over other aspects of diversity [noise]\nAs a woman in her twenties mandate golf brings up a piece called musical contemplation she uses her experience with music as a metaphor for trying to find her plates in the world Trade Center judges music and words as part of her journey\nMost teams have time to get up and without any training at nine and hugged around\n[noise] God and he changed ... trying to I'm waiting [noise] somebody's after ten minutes and put it down and continue making completely ineffective most companies [noise] unexpectedly align appears headed then can ...\nI'm trying to learn [noise]\nPlay very well known for an hour because [noise] had totally easy ... comes to me and him were waiting like an internal principle [noise] Beatty I didn't learn that somehow accidentally coming into the [noise]\n\nA discussion my boyfriend\nAnd coming into the world\nHad a discussion my boyfriend about what questions should be our overarching question though which would mean decision his question was how can it be the happiest ... his decisions essentially slow\nDown and the answer to that question you know I found myself disagreeing with you and then you\nKnow\nThe deepest guiding question for me and how can I get back to life than you did to me and my son I live\nRight on duty in or out of the chaos waiting and and now they [noise] I put grounded mediocrity [noise] train me to the shunning shifting\nLooking to one day maybe sixty days I'm standing in search of unexpected really meaning and purpose\nOf the question becomes how do I gain makes it hard to know every day and then just think that the purpose intentionally\n... how do I find my card to play him how can it become completely [noise]\n[noise]\nThat was Mandy golf with her musical contemplation\nAnd that's our chauffeur this week thanks to Patrick Garrett for production assistant our executive producer is Dr Allen chard talk are the music it's gone when the dark by Kevin Bartlett that show is a national production of Northeast Public radio if you'd like to hear that show\nAgain sign up for a ... that the fifty one percent archived on our website I tell you AMC dot org and follow us on Twitter I fifty one percent radio\nThis week's show it's number Fifteen twenty five [noise]", "show_name": "51%", "year": "2018", "city": "Albany", "day": "17"}