[{"month": "10", "state": "NY", "station": "WAMC", "content": "Streaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\n\nAmerican public media [noise]\nSupport comes from the town cry or live music and creative contemporary cuisine in\nBeacon Jeffrey so called October twelfth Kenny White also any species October nineteenth jarred Gorka October twentieth\nT O W N E crier dot com and from Woodstock art exchange had blown glass and sculpture curated fighter and exhibits from artists and makers throughout New York state and beyond ... twenty eight west of Kingston Facebook or Woodstock art exchange dot com\nThis is Northeast Public radio WAMC F. M. H. D. Ninety point three Albany W. R. U. N. H. D. Ninety points reruns and Utica W. M. K. E. H. D. Ninety point nine Kingston W. O. S. R. H. D. Ninety One point seven Middletown to UCLA HD Ninety One point nine Plattsburgh W T A N HD Ninety three point three candidate Harry ... anti age do you want to three nine tai chi and robots\nW am cue HD won all five one great Barrington W. W. E. S. H. D. H. D. point nine mount Kisco W. N. D. H. D. in any point one Stanford W and our eighty eight point by Brewster WAMC am fourteen hundred Albany mhm\nGood evening and welcome to tonight touch whoever's hand for my name is Wanda Fisher and I'll be here with you till about ten o'clock this evening we have some special get to all joined us right after the eight o'clock news and we hope you'll stay tuned\nBut first we'll check in with National Public radio news in Washington for the latest news update [noise]\n\n\nLive from NPR News in Washington I'm Janine hurt President Trump is campaigning for Republican candidates in Topeka, Kansas tonight where he praised the Senate vote today that made Brett Kavanaugh Supreme Court justice and Trump told a cheering crowd they need to remember the bitter bipartisan fight at the mid term elections have you\nWrong people to get into office [noise] things could change sacred Jay genetic change\nFast [noise] that we're not going to let that happen we can't let\nProtesters gathered at the Supreme Court and the U.S Capitol building in Washington DC today as the Senate confirms Kavanaugh fifty to forty eight mostly along party lines NPR's Brian Naylor reports\nThe vote ended weeks of sharp partisan battles over the fifty three year old Kevin ... who'd been accused by several women are sexually assaulting them charges he angrily denied in the debate before the vote senator sounded like they were describing two different men Senate majority leader Mitch McConnell called him a dedicated public servant\nJudge Brett Kavanaugh was among the very best our nation has to offer\nYou will make the Senate and the country proud\nSenate minority leader Chuck Schumer on the other hand said Kavanaugh's confirmation was a low moment for the Senate and the country\nThat set it is about to elevate a nominee who doesn't belong on the nation's highest fetch capitalist\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nAfter our nation has to offer\nYou will make the Senate and the country proud\nSenate minority leader Chuck Schumer on the other hand said Kavanaugh's confirmation was a low moment for the Senate and the country\nThat set it is about to elevate a nominee who doesn't belong on the nation's highest bench\nKavanaugh was sworn in a few hours later Brian Naylor NPR News Washington\nWrench officials tell NPR that China is detaining the head of the international police organization Interpol on suspicion of financial fraud and other charges man hung way is for has reportedly been missing since late last month NPR's Eleanor Beardsley reports\nThe south China Morning post reported friday that sixty four year old ... hung way was picked up by Chinese authorities when he arrived in Hong Kong in September\nAnd actually enter both tend to matter concerns French and Chinese authorities but in a later statement Interpol secretary general your stock\nSaid he wants an official response from Chinese authorities to address concerns ever meanings wellbeing before being elected to Interpol in two thousand sixteen main hung way was vice minister of public security in China Eleanor Beardsley NPR News Paris\nSecretary of state Mike Pompeo is heading to North Korea tonight hoping to set up a second summit between President Trump and Kim Jong moon today he met with Japan's prime minister Shinzo Abe's reassuring him the Tokyo concern won't be forgotten\nOr get a view which will be North Korea\nJapan worries Washington will cut a deal with the young young limiting it into cannot continental ballistic missile program but leave it was shorter range missiles that could hit Tokyo and pay off the plans to visit South Korea and China\nOn this trip you're listening to NPR News\nIt's been Twenty years since the brutal murder of Matthew Shepard in Laramie, Wyoming he was beaten and left for dead for being openly gay as Cooper make him of Wyoming Public media reports on legacy of shepherds death is the white collection of artistic responses\nTo play the Laramie project with the first major work inspired by the murder he was constructed from interviews with locals just after the event\nSince its release in two thousand there'd been countless works of art songs poems and theatrical interpretations shepherd story Craig Howard Johnson's composer of the Cold War considering Matthew Shepard he explains why artist become part shepherd legacy it helps us grieve together\nSo that alone is is when you know significant aspect of a way that performance and performance or music can hold a story and give us deep possibility for processing\nJohnson is touring his production around the country for NPR News I'm Cooper McCann in Laramie\nArtwork created by the artist Banksy self destruct at moments after it was auctioned off at one point four million dollars a record price for the artist the stuff was apparently orchestrated by the elusive street artists themselves\nThat spray painted canvas girl with a balloon was auctioned off at Sotheby's and London last night but just moments after it was sold alarm sounded and then the painting ran through a shredder that with imbedded in the frame coming out the bottom\nIn strips thought to be says it was unaware of the stunt was that it was going to happen and it's not clear if the artists who was never revealed his full name was there I'm Janine ... NPR News\nSupport for NPR comes from the financial services firm of Raymond James offers\nStreaming support for WAMC comes from Albany mid that will open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nOther than the frame coming out the bottom in strips Sotheby's says it was unaware of the stunt was that it was going to happen and it's not clear if the artists who was never revealed his full name was there I'm Janine ... NPR News\nSupport for NPR comes from the financial services firm of Raymond James offering personal lives wealth management advice and baking and capital markets expertise along with the legacy of putting clients financial well being first learned more ed Raymond James dot com\nAnd support for WAMC comes from wind horse natural path a clinic rental borrow Vermont offering natural pathway medicine oxidative medicine colon hydro therapy and acupuncture\nSpecializing in Lyme disease now accepting new primary care patients wind horse natural path ... dot com arts sparked dedicated to helping artists musicians and all created with the business of being an artist arts dash spark dot com\nEllis medicine cardiovascular care offering up to date technology and cardiovascular treatment options to New York's capital region heart care in a community hospital setting Ellis medicine dot org slash heart to heart\nBlue heron restaurant and catering located in the historic town hall in Sunderland now booking holiday parties for the two thousand Eighteen Nineteen season blue heron dining dot com slash catering\nAtmospheric or farms Poughkeepsie Kingston Newberg and ... for farm fresh local produce seafood and hair for beef prepared meals to go deli bakery sweet shop and specialty groceries Adams farms dot com\nAnd the Linda WAMC is performing arts studio presenting a range of concerts film theater and discussions for the capital region though Linda dot org\nWell once again and welcome to tonight's program and just before we get going I just want to remind everybody about the locked box\nWe are having a fun drive that starts a week from Monday and if you would go to WAMC dot org and put a little bit in our lock box it helps us to cut down\nOn the amount of on air fundraising that we do and Fox has been just an amazing thing for us here at WAMC we've had one to two day fund drives ever since we've instituted the lock box so right there at WAMC dot org\nTheir digital pop right up for you\nWell we're going to do something a little bit different tonight um we have a a couple of people with us here in the studio a we have Liam con and Jasmine K.\nAnd they have a project going on and and a big concert associated with it in a couple of weeks on October twenty it's down\nIn Kingston and a couple of our folk artist said have been on the show played on the show a number of times a jar Williams now emerging and Bruce ... will be part of the\nStar studded cast as we would probably not the only people there but it is a it's part of a big project Lee and why don't you tell us a little bit about this project\nStreaming support for WAMC comes from Albany mid now open the mastery family children's emergency center a place for you and injured children more information at AMC dot edu\n[noise] well that was jar Williams was the storm king from her she do in the time of God for that Bruce Small ski did wolves howling from his CD lost boys\nAnd both of them will be at the ... the you pack in Kingston in two weeks from tonight and that place holds Fifteen hundred people and you've already sold a thousand tickets William con and Jasmine Kay I'm so people who might want to go and hear this\nUm that's a big concert that you're having as part of a get out the vote might want to try to get their tickets yup I'm so how would they do that\nSo you can go to Hudson Valley votes dot com\nAnd there is a link to a ticket master right a right a Jewish girl down a it's very very easy if you're having trouble you can email us of course not Hudson Valley votes at Gmail okay\nWe are expecting to sell out to um we are it's going to be a great crowd were really excited as we said doors open it's sex the music starts seven and we're really excited for just the energy for that evening\nA I think it's I think Jasmine and I both feel that it's never been more critical to participate in your democracy you really uh this is how you do it too which is you know this is an important night for us to you know encourage people to get out the vote and then you have to go and get out the vote you know you have to go out\nAnd participate you know be part you know be a part of of everything that you know a ... be a part of your democracy by voting\nIt's not just to have fun at a concert at should get out to vote no judgment who else is going to be there besides these three folk acts that I've been talking about not only merchant tar Williams Andrew Smokey um do you have the list I Know Jack to John that will be there he's a he's somebody that I Know as well um so\nThe list is also on the get out the vote website as\nThat is correct if you you our entire set listed on Hudson Valley votes dot com and Jasmine also has the has the full list as well\nYeah um and I think that's important to us it's you know bring together a group of activists musicians actors all coming together for a common cause so we have actor Paul ride we have activists eve and ...\nWe have Justin Vivian bind a we have uh the kids at the rock academy or else they're going to be performing we as I'm Aaron ... of the national the marriage do it faster than you have there is isn't survival chorus I'm\nEnvious delicious goes on 'em and it's one thing for us is the author tried to get as many local artists and people that have Hudson Valley wrote roots here too\nBecause it's such an integral part of our community so you know a lot of these people are local and they're all coming together for a common cause you know get out the vote and use our voice it to participate in our democracy which has never been more critical\nThat's right and the both of your from Woodstock originally any job and so there was also last week we were supposed to actually have I have a medium and somebody else on our show but they couldn't be here tonight because they are involved in a production\nStreaming support for WAMC comes from Albany med that will open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nGet out the vote and use our voice it to participate in our democracy which has never been more critical\nThat's right and if the both of your from Woodstock originally and ... and so there was also last week we were supposed to actually have I have a medium and somebody else on our show but they couldn't be here tonight because they are involved in a production to that\nThat's right so a unfortunately uh last week didn't work out but the rock academy kids were some of them are going to be here with us the really cool thing about these kids that are in Woodstock\nA um [noise] yeah it is something called the rock academy and these kids are just these phenomenal artist um they have phenomenal teachers um and and um [noise]\nAnd they are they're about the season showers tonight at the colony in Woodstock\nEverybody absolutely should check out these kids because these kids are also part of our youth voter core\nAnd they use voter course focused on getting out the vote in getting young people to participate in our democracy we've kept his youngest fourteen coming and meeting candidates offer office and trying to really learn about how does our government work why should I care about voting\nAnd tonight there or you know they are showing off their talents and we couldn't be more proud of them\nThat's great and you know in order to uh to to be here you're actually missing their performance which is is great\nSo um I think that the whole get out the vote act is wonderful and the registration vote a voter registration deadline in October twelve you still have until uh I think we we looked up until the end of the\n... were thirty asked if you need to request an absentee ballot right\nAnd so the the election is a November six and a do you have anything else you'd like to add before we listen to Natalie Merchant in kind of wrap things up\nNo okay this is great I'm so glad that you came them this is a this is wonderful so we're going to listen to something from Italy merchants who has been a longtime friend of this station for many many years and this is a\nKind of a an appropriate song from deadly I think\n\nMm Mm\nMm Mm\nMm\nWell your son were good no no\nNo no\nNo clues and the\nLaw but uh I'm I'm I'm\nI'm\nNa na\nStreaming support for WAMC comes from Albany met now will in the ... family children emergency Center for ill and injured children more information at AMC dot edu na\n\nDon't go ... well\nHere they ... ... ... well ...\n... s man ... ... ... ... no\nYou know\nUh well no\nKnow na\nStreaming support for WAMC comes from Albany mid that will open the battery family children's emergency center a place for ill and injured children more information at AMC dot edu [noise]\nDeal this like the when the ...\n... when ...\nWhen goal that was on the\nDown in ... when you go\nNovels down and now we\n...\n... ... ...\nIn ... we didn't want to know\n... ...\nJust the boy you\nKnow ...\nWe're in a bad way um Mm\nYeah ...\nWe rely nature's bank ... ... ... ...\n\n\n... ... ... not having\nGood crowd ...\nWhy do you know the judge in show ways around ...\nNo no no no we ... our ... was ...\nThat her ... not ... ... he\nSaid how when they say they will\nIt in the fall you know and\nDo I do and\n... my hundred it could be a\nGood ...\nWhy do you do see the show ... Mm\nStreaming support for WAMC comes from Albany met now will in the ... family children's emergency center a place for ill and injured children more information at AMC dot E. D. you know\nWhy do we do something to show ... bring your surroundings and ...\nThere's a ...\nYear during between ... and H\nArea you would have to give to the\nJust ...\nYork so\nI didn't grow ...\n\nMm do you say\nAre so many votes no no\n... ... ... ... to me ... ... ...\n... over ...\n... and then when we all I'm ...\n... ... ... do to get to know ... ... ... ...\nOne mold had ah rotor but\n\nFine can vicious but drugs or they\nAlone the ...\nI'm sure and for all and we were the other hot to\nBees are\nWas when I saw it was the last leg can\nGo Mandy where\nThe Joe ... saw roll\nSt John beyond a role\nAs well and they voted\nBe buying their hearts and\nThey try ...\n... ... ... ...\nStreaming support for WAMC comes from Albany met now will open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu part saying\nThey try non\n... anti their boats ...\n... ... ... Mm\nSailor\nLines could never vote\n...\nThese missiles they discover\nThey say a new\nWay or no\nSign about drawing neither\nFine vote\nWas ... they can do\nMany layers na ve where\nBeing around the ... roll\nThrough the streets of San Leandro in a row\nAnd loves this well then they\nThey with\nTheir hearts send them\nBy one ... one fine votes\nMm Mm Mm\nYou can't go like I'll tell you how old are your brain which I think you you kind of\nBlow up I don't really low really have a garden all over again we have a garden and all over again um\nA lifetime to see from ...\n... drove it was on the bench that I don't\nBelieve should crawling\nGuarding me so well\nAnd you can do\nTo you know how the membrane Uganda\n... I'll pay the rent alone will have oh gardening all over again we have a garden no no we're just saying\nWhat do you know live time there was a moment\nCame and they claim to\nTo have you there was money and then when the listener to make a desert of of four ribs\nLamb ... you see the lights out in the dark as you're being the son of either way you see the flowers\nAre out there you don't let alone to build our garden\nStreaming support for WAMC comes from Albany med that will open the battery family children's emergency center a place for ill and injured children more information at AMC dot edu\nAllies of the top of the some of your day the ball all go\nTo our little guarded all over oh well you know overall\n\n[noise] the group is called child's plenty it's a group of all kinds of different people together fiddler ... and it'll make her child's play the bloom of youth temple house and sailing in and before that I kind of semi request\nA Steelers fan from a CD called time and that was the harvest of the moon\nThis is Northeast Public radio WAMC FM HD Ninety point three Albany W. R. UNH the Ninety point three ramps and Utica W am cage the nine point nine Kingston W. O. N. sorry she Ninety One seven Middletown\nWGLA ... Ninety One night Plattsburgh W T A N HD Ninety three three candidates Harry W. A. N. C. H. D. one oh three nights ...\nWon all five one great Barrington W W E S H da da na ... Kisco WINZ HD Ninety point one Stanford W boy in our eighty five Brewster and WAMC am fourteen hundred Albany\nThe news is next from National Public radio news in Washington and we'll be back with more music following this news updates\nFrom NPR and we have something for you from Tom Rodriguez Seeger right after this break\nLive from NPR News in Washington I'm Janine hurt on Capitol Hill\n[noise] as red cabinet took his oath of office as the\nOne hundred seconds associate justice of the Supreme Court in a private ceremony tonight protesters chanted outside the building at across the street at the U.S Capitol democratic Senator Chris Coons says he had hoped the FBI investigation which of the cabinet isn't sit to sit on the nation's highest court\n[noise]\n[noise] but rather than Trump campaigning for Republican candidates in Topeka, Kansas tonight hold a cheering crowd he's pleased with the Senate decision but says conservative can't be complacent with mid term elections just weeks away\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu [noise]\n[noise] but President Trump campaigning for Republican candidates into he could Kansas and I told a cheering crowd he's pleased with a sentence decision but says conservative can't be complacent with midterm elections just weeks away were draining the swamp\nDrop it now but it's conservative than on the court with the second successful nomination in as many years billions go to the polls tomorrow to choose a new president NPR's Philip Reeves reports\n... a veteran congressman is the pay a front runner up a few years ago he was a minor figure notorious for offensive remarks about gender and race you know he could be about to leave Latin America's largest nation shop to the rights\nTo when he needs more than fifty percent of the vote otherwise there'll be a runoff probably between him and his chief rival from the leftist workers' party\nPolls showed ... support rising steadily during the campaign most of what she spent the hospital after being stopped at a rally his supporters say he's a champion of family values and upload his hard line stance on crime and corruption\n... Mara Brazil's policies but you're dictatorship which is why his opponents say he threatens democracy itself\nFor the breeze NPR News Rio de Janeiro\nAmericans spent five hundred billion dollars a year on their grown children that's according to a new study and fears on a Jaffe reports that's twice the amount that contribute to their own retirement funds\nAbout a quarter of the money that parents spend on children ages Eighteen to thirty four goes toward their education the study for Merrill Lynch and the research organization age wave also found that nearly a third of adult children live with their parents that's higher than the percentage slipping with spouse\nOverall almost eighty percent of parents contribute to the support of their adult children that includes major expenses like paying for a wedding or helping with the purchase of a home it also includes help with daily needs like rent car expenses groceries or cell phone bill's\nEighty two percent of parents say they are willing to make a financial sacrifices to help an adult child by dipping into their savings curtailing their own lifestyle taking on debt or refinancing their home I knew Jaffe NPR News and you're listening to\nNPR News from Washington\n\nThe Congolese health ministry says another five confirmed cases of Ebola has been found and Democratic Republic of Congo as health workers struggle to contain the disease the world Health Organization says there are one hundred thirty five confirmed cases of the disease more than two months since the outbreak was declared\nHealth workers face a number of obstacles in fighting Ebola virus that circulating in the eastern part of the country where there have been frequent violent clashes between armed groups and the government and many people don't trust health workers and won't let them into their villages\nThe ruins of palm pay buried under a volcanic ash than Seventy nine eighty have yielded a new treasure NPR's Sylvia Poggioli reports archaeologist discovered a richly painted garden seen in a well to do home\nThe discovery was reported by the Italian ... news agency given exclusive access to the site dubbed and chanted garden photos show intricate ... peacocks and delicate birds and flowers\nThey're located in what the head of the ... pay archaeological site Nazi ... calls a marvelous an enigmatic room that must be carefully studied other photos show a fierce\nStreaming support for WAMC comes from Albany mid now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nGiven exclusive access to the site dubbed and chanted garden photos show in cricket ... Serpas peacocks and delicate birds and flowers\nThey're located in what the head of the ... pay archaeological site ... on a called a marvelous an enigmatic room that must be carefully studied other photos show a fierce dog fighting a wild boar against a blood red background the color known as pump a in red\n... says the house probably belong to a wealthy tradesmen a refined and cultivated person who commission the best artist of the time it's not known when the room will be open to the public\nSuperbowl ... NPR News Rome\nI'm Janine hurts and you're listening to NPR News from Washington\nSupport for NPR comes from NPR stations other contributors include vital project started supporting the museum of modern art in Manhattan where drugs and dance theater that work is never done it on view and includes weekly performances in the ... more a moment dot org\nAnd support for WAMC comes from the Waldorf school of Saratoga Springs giving children the education and\nTools for the challenges of an ever changing world Waldorf Saratoga dot org\n... rose helping people with disabilities achieve their dreams offices in Amherst Greenfield and Springfield staff rose dot org for more information\nSt Louis Subaru Hadley, Massachusetts a new and used Subaru dealer serving the pioneer valley Hartford and Springfield offering news Hoover's plus used cars trucks and SUVs see fluid Subaru dot com\nAlbany law school offering online master's degree in cyber security and privacy law also offering master's degrees focused on government affairs\nHealth law and healthcare compliance Albany law dot edu slash online\nButtermilk falls in ... Milton taking reservations for mid week fall stays tonight's apple picking and picnicking dubois farms through October thirty first\nButtermilk falls in dot com and goat peak strings East Hampton Massachusetts specializing in repairs and restoration as well as the purchase and sale of vintage string instruments including electric and acoustic guitars and violins\nSeventy five years combined experience goat peak strings dot com [noise]\nWell once again I just want to remind you about the locked box that's on our Web site WAMC dot org and it really helps us if you give us a little bit of something before we get into the uh the on air fundraising helps to shorten\nOur on air a fundraising and\nThat helps us all stay into a regular programming that everybody relies on I'm I rely on the news and everything else that's on WAMC so if you can\nGive whatever you can to lock box and help us to cut down that ah that on air fundraising [noise]\nWell I wanted to play something from the new Michael ... CD but in order to get to that I have to play some other things to get to what I Want to play on the new Michael ... CD so going to listen to something from a towel Rodriguez Seeger\n\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nWanting to play something from the new Michael ... CD but in order to get to that I have to play some other things to get to what I Want to play on the new Michael generally CD so going to listen to something from a cow Rodriguez Seeger\n\n\nAddress is good enough to read and then\nThese diagrams when Tom\nNa\nChocolate\n\n\n...\nSalaries may may or may upper\nRight hand corner\nYou know ...\nWhere it was a very good job sugar and a\nJoe ... well\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu ...\nWhy the scale sugar Mm\nJoe troops there is you know a\n... I've been doing\nWas in ...\n...\nWe had to lay\nDown in Florida ...\nThere's ... no ...\nSorting through what did I did in ...\nSo you rose one\nThat's what we live\n\nWe have a job they for God and ...\nWhen ...\n...\nAbout ...\n...\nThe new CD from Michael generally just came in this week and it's really a very very nice [noise] CD [noise] title tune family recipe Michael ...\nBefore that kept him and tell you what the chocolate on my tongue from her latest CD pretty bird she's going to be at the Troy savings make Music Hall on October Eighteenth and that was chocolate on my tongue and that was written by Oliver would\nBefore that from the ... flu and Peter ... love is the weirdest of all is the name of the TV or live is the weirdest of all and that was crab cannot pay before that was them again Lewin Peter from WROL\nAnd that was orange cocoa cake and we started that group of songs with actually with Pete Seeger and tower I drink a seeker from seeds to tons of Pete Seeger\nStreaming support for WAMC comes from Albany method that will open the mastery family children's emergency center a place for you and injured children more information at AMC dot edu\nOr live is the weirdest of all and that was crab cannot pay before that it was them again when Peter from double ...\nAnd that was orange cocoa cake and we started that group of songs with actually it was Pete Seeger and tower Audrey good seeker from seeds songs of Pete Seeger volumes three Pete Seeger and friends a little of this and that\n[noise] [noise] [noise]\nSupport for WAMC comes from del mar farmers' market three thirty two can would avenue dome are celebrating ten years of local and organic farm products baked goods fair trade crops music and more\nEvery Saturday from nine to one del mar market dot org windy hollow veterinary clinic molecule Massachusetts conventional and integrate of veterinary medicine including acupuncture comprehensive pet care and vets services that health services since Nineteen Ninety eight windy hollow vet dot com [noise]\nThe people of environment one providing systems and services for the water and electric utility industry's E. O. N. E. dot com [noise]\nGrist mill real estate Socrates for four years a local independent realtor offering one on one consultations poor buyers and sellers specializing in homes in Socrates Woodstock Kingston and beyond grist mill real estate dot com [noise]\nSteve Lewis Subaru happy Massachusetts a new and used Subaru dealer serving the pioneer valley Hartford and Springfield offering new supers plus used cars trucks and SUVs Steve Lewis Subaru dot com and Laurie over soccer\nCaldwell banker village green realty Woodstock specializing in the greater Woodstock Socrates and stone rich area markets and serving both buyers and sellers of homes and lands\nEight four or five nine zero one six one to nine [noise]\nWell let's see Jae younger in Mali Mason a Mike burned to enter Ruthie and uh the great barrier trio featuring Andrew and know of and Nordstrom are going to be playing tomorrow [noise]\nAh at seven o'clock at night at the rocks Barry art center in Rochester New York\nAnd this is something from Jay and Molly's latest recordings\n\n\n\n\nStreaming support for WAMC comes from Albany bed now will in the ... family children's emergency center a place for ill and injured children more information at AMC dot edu or\nTo share a little no\nIn the\n\n\n[laughter] oh\n\nWell\nThat he\nWill be and what do they\n\nThey\nMay be the beginning and then I remember when the\nDow Jones did did they didn't\nKnow what\nMy\n\nMom didn't go to get to know when when did\nChange the bill well no they\n\nWill make the world for a long way but the\nMain the main\nDream about the\nGo together when uh\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nWill make whoa whoa whoa wait what's up\nMan the\nDREAM Act the\nWin and [noise]\n[noise] [noise]\n[noise]\n\n[noise] [noise]\n[noise] [noise]\n\n[noise]\nBack in the museum and it probably\nDidn't really\nYou know they\nDidn't want to do things a little silly thing they can do they pay you a little bit but I think the ... ... people in the old days\n\n... [noise]\nI mean I'm\nNot a demanding bugging way way way in a\nUnited together he is\nThe only thing I think it's all of them\nAll together and rally them\nGood men well\nAgain never give up the beach\nOh\nWill they let the Little Mermaid Jared ... will be like a little bit of golf ball will be like the\nMan\n[noise] coming to town from her CD calling to town some guys in my name and that was this wall and she's going to be at the middle ... librarian middle ... New York tomorrow afternoon at four o'clock\nBefore that we heard from ... from his latest CD full Detroit's that's the name of the CD [noise] and you heard him do leave a little heaven behind before that we heard from Hugh Christopher Brown from his CD pop ...\nStreaming support for WAMC comes from Albany method that will open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nFour o'clock before that we heard from Paul sex from his latest CD full Detroit's that's the name of the CD [noise] and you heard him do leave a little heaven behind\nBefore that we heard from Hugh Christopher Brown from his CD posh him\nAnd that was keep her off the plane and we started with Jay ongoing Mali Mason from the CD the quiet room used to heal the heart and sued the soul and that when the blue river waltz and they will be at the rocks Barry Arts Center in rocks brand new York\nTomorrow at seven o'clock along with my Miranda and Ruthie on gr Miranda and the great barrier trio featuring Andrew and Noah van Nordstrom that is tomorrow\n[noise]\nSupport for WAMC comes from Wendy health farm for church nursery and garden shop great Barrington hearty moms fall blooming perennials ornamental grass is spring flowering bones pumpkins cords and garlic for planting Wendy hill farm ink dot com\nThe button box Sunderland, Massachusetts makers of our more concertina also selling new and used concertina and accordion and providing repairs and accessories button box dot com\nVision excel I care lake Katrin exams I cared dry ice therapy and now new American Made frames where I where is an art vision excel I cared dot com\nState street fruit store deli wines and spirits downtown north Hampton a locally owned community minded grocery and specialty foods stores since Nineteen twenty two wine tastings every Friday four to seven states street fruit dot com\nAnd nine pins side or works Albany featuring hard side are made from local apples now serving pizza like fair be beer or wine and spirits in the tasting room open Tuesday through Sunday nine pinch tighter dot com [noise]\nAnd just one last reminder about the lock box go to WAMC dot org and put in whatever you can to help us keep our fund drives a little shorter\nAnd keep the on air fundraising to a minimum we ... we appreciate everything that you can do for us and we really do\nI listen to the ... to the radio station pretty much all day long and I know that most of you do as well [noise]\nThis is a trio from Canada called gatherings sparks as we wind down tonight program\n\n[noise] we are bringing in LA\nLong is nine teams in the evening\nFaithful yeah tuning returning to the\nAnd hunting\nAnd stuff ... thank God [noise]\nClowns as long as it's known thing and this man and dressed in a sea change one thing\nWe were hanging [noise]\n\nStreaming support for WAMC comes from Albany met now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu gun\nClubs as well as they do this and this did you ask ... ...\nWe are bringing in\nMm\nTiny right [noise]\nLetter can\nBreath for any\nAnd then when you said the brakes\nNation to awaken remember much fat and we used to\nSee a rabid na", "show_name": "The Hudson River Sampler", "year": "2018", "city": "Albany", "day": "07", "locations": [["Albany New York", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Washington", 38.89511, -77.03637], ["Washington", 38.89511, -77.03637], ["Topeka Kansas", 39.04833, -95.67804], ["U.S", 39.828306, -98.5795], ["Washington DC", 38.89511, -77.03637], ["Albany", 42.65258, -73.75623], ["Washington", 38.89511, -77.03637], ["China", 35.0, 105.0], ["Hong Kong", 22.27832, 114.17469], ["China", 35.0, 105.0], ["Paris", 48.85341, 2.3488], ["North Korea", 40.0, 127.0], ["Japan", 35.68536, 139.75309], ["Tokyo", 35.6895, 139.69171], ["North Korea", 40.0, 127.0], ["Japan", 35.68536, 139.75309], ["Washington", 38.89511, -77.03637], ["Tokyo", 35.6895, 139.69171], ["South Korea", 36.5, 127.75], ["China", 35.0, 105.0], ["Laramie Wyoming Wyoming", 41.13998, -104.82025], ["Laramie", 41.13998, -104.82025], ["Laramie", 41.13998, -104.82025], ["London", 51.50853, -0.12574], ["Albany", 42.65258, -73.75623], ["Vermont", 44.00034, -72.74983], ["Lyme", 53.0, -2.23333], ["New York's", 40.77205, -73.93014], ["Sunderland", 54.90465, -1.38222], ["Kingston", 17.99702, -76.79358], ["Albany", 42.65258, -73.75623], ["Kingston", 17.99702, -76.79358], ["Albany", 42.65258, -73.75623], ["Woodstock", 34.10149, -84.51938], ["Woodstock", 34.10149, -84.51938], ["Italy", 42.83333, 12.83333], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["San Leandro", 37.72493, -122.15608], ["Uganda", 1.25, 32.5], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Washington", 38.89511, -77.03637], ["Washington", 38.89511, -77.03637], ["U.S", 39.828306, -98.5795], ["Topeka Kansas", 39.04833, -95.67804], ["Albany", 42.65258, -73.75623], ["Kansas", 39.09973, -94.57857], ["Washington", 38.89511, -77.03637], ["Democratic Republic of Congo", -2.5, 23.5], ["Albany", 42.65258, -73.75623], ["Rome", 41.89193, 12.51133], ["Washington", 38.89511, -77.03637], ["Manhattan", 40.78343, -73.96625], ["Springfield", 39.80172, -89.64371], ["Massachusetts", 42.36565, -71.10832], ["Hartford", 41.76371, -72.68509], ["Springfield", 39.80172, -89.64371], ["Hoover", 33.40539, -86.81138], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Massachusetts", 42.36565, -71.10832], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Florida", 28.75054, -82.5001], ["Troy", 18.24924, -77.60978], ["Albany", 42.65258, -73.75623], ["Massachusetts", 42.36565, -71.10832], ["Massachusetts", 42.36565, -71.10832], ["Hartford", 41.76371, -72.68509], ["Springfield", 39.80172, -89.64371], ["Rochester New York", 43.15478, -77.61556], ["Albany", 42.65258, -73.75623], ["Albany New York", 42.65258, -73.75623], ["Detroit", 42.33143, -83.04575], ["Albany", 42.65258, -73.75623], ["Detroit", 42.33143, -83.04575], ["new York", 40.71427, -74.00597], ["Ruthie", 48.70056, -85.24], ["Sunderland", 54.90465, -1.38222], ["Massachusetts", 42.36565, -71.10832], ["concertina", -20.15694, 33.72389], ["concertina", -20.15694, 33.72389], ["Katrin", 45.40008, -73.58248], ["Albany", 42.65258, -73.75623], ["Canada", 60.10867, -113.64258], ["LA", 34.052235, -118.243683], ["Albany", 42.65258, -73.75623]], "not_found": [], "ep_coords": ["Albany, NY", 42.65258, -73.75623], "in_country": ["Albany New York", "Albany", "Albany", "Washington", "Washington", "Topeka Kansas", "U.S", "Washington DC", "Albany", "Washington", "Washington", "Laramie Wyoming Wyoming", "Laramie", "Laramie", "Albany", "Vermont", "New York's", "Albany", "Albany", "Woodstock", "Woodstock", "Albany", "Albany", "Albany", "Albany", "San Leandro", "Albany", "Albany", "Albany", "Washington", "Washington", "U.S", "Topeka Kansas", "Albany", "Kansas", "Washington", "Albany", "Washington", "Manhattan", "Springfield", "Massachusetts", "Hartford", "Springfield", "Hoover", "Albany", "Albany", "Massachusetts", "Albany", "Albany", "Florida", "Albany", "Massachusetts", "Massachusetts", "Hartford", "Springfield", "Rochester New York", "Albany", "Albany New York", "Detroit", "Albany", "Detroit", "new York", "Massachusetts", "Albany", "LA", "Albany"], "out_country": ["China", "Hong Kong", "China", "Paris", "North Korea", "Japan", "Tokyo", "North Korea", "Japan", "Tokyo", "South Korea", "China", "London", "Lyme", "Sunderland", "Kingston", "Kingston", "Italy", "Uganda", "Democratic Republic of Congo", "Rome", "Troy", "Ruthie", "Sunderland", "concertina", "concertina", "Katrin", "Canada"], "in_state": ["Albany New York", "Albany", "Albany", "Albany", "Albany", "New York's", "Albany", "Albany", "Albany", "Albany", "Albany", "Albany", "Albany", "Albany", "Albany", "Albany", "Albany", "Manhattan", "Albany", "Albany", "Albany", "Albany", "Albany", "Rochester New York", "Albany", "Albany New York", "Albany", "new York", "Albany", "Albany"], "out_state": ["Washington", "Washington", "Topeka Kansas", "U.S", "Washington DC", "Washington", "China", "Hong Kong", "China", "Paris", "North Korea", "Japan", "Tokyo", "North Korea", "Japan", "Washington", "Tokyo", "South Korea", "China", "Laramie Wyoming Wyoming", "Laramie", "Laramie", "London", "Vermont", "Lyme", "Sunderland", "Kingston", "Kingston", "Woodstock", "Woodstock", "Italy", "San Leandro", "Uganda", "Washington", "Washington", "U.S", "Topeka Kansas", "Kansas", "Washington", "Democratic Republic of Congo", "Rome", "Washington", "Springfield", "Massachusetts", "Hartford", "Springfield", "Hoover", "Massachusetts", "Florida", "Troy", "Massachusetts", "Massachusetts", "Hartford", "Springfield", "Detroit", "Detroit", "Ruthie", "Sunderland", "Massachusetts", "concertina", "concertina", "Katrin", "Canada", "LA"]}, {"month": "10", "state": "NY", "station": "WAMC", "content": "Streaming support for WAMC comes from my dog hardest dot com and no choke no poll dog harness invented to make walks easier for both dogs and humans no need to pull no need to tug walk your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com October twenty eighth\nParents sent me an ... experience November third T O W N E crier dot com\nThis is Northeast Public radio WAMC ... three Albany\nW arguing ... three rooms and Utica W. M. K. E. H. D. Ninety point I think than W. O. R. H. D. Ninety One seven Middletown W C. E. O. H. D. Ninety One nine Plattsburgh WC a an HD Ninety three three candidate Harry W. N. C. H. D. one oh three point nine ... W am to ... five one Great Britain\nW. W. E. S. H. D. idiot point nine mount Kisco W. A. N. D. H. D. Ninety point one Stanford W a an eight point five rooster at WAMC am fourteen hundred Albany\nMhm Mm\nGood evening and welcome to tonight touching her name is Wanda Fisher and I'll be here with you until the ten o'clock tonight tonight to program is pre recorded so we will not be taking any requests but we hope that you will stay tuned\nBut first we'll check in with National Public radio news in Washington for the latest news update Mm\n\nLive from NPR News in Washington I'm Janine her in Pittsburgh but already say accused gunman Robert powers was in the tree of life synagogue for about twenty minutes this morning\nKilling at least eleven people and injuring ... others Lucy Perkins of member station WBFO say reports police say powers had at least three handguns and one assault rifle\nThe FBI is investigating the shooting at the hate crime Bob Jones is a special agent in charge of the bureau's Pittsburgh office he says this is the most horrific crime he'd seen in twenty two years that the FBI\nMembers of the tree of life synagogue conducting a peaceful service and the place of worship were brutally murdered by a gunman targeting them simply because of their face\nPennsylvania governor Tom Wolfe said there is no place in the state for anti Semitism governor was flanked by both Democratic and Republican lawmakers at the press conference and a call for unity for NPR News I'm Lucy parking in Pittsburgh\nPowers is hospitalized with gunshot wounds to thirty say they're still not sure if it's full mode of in the attack President Trump condemned the shooting calling it an assault on humanity\nAnd attorney who once represented Cesar ... the man accused of sending more than a dozen explosives in the mail says his former clients been living in his band for years and it's a strange from his family NPR's Greg Myre a report run\nLow he says he represented Cesar ... four or five times what he described his routine low level cases like shoplifting and altering his driver's license\nLow he still represents other members of the ... family and said they were deeply distraught over the allegations he was behind the threatening packages the lawyer says the family often urge they ought to seek mental health treatment but that he always resisted\nRefused to even get diagnosed but his family and anyone who interacts with him can he suffers from some very\nSad because expected in court Monday in Miami Greg McGarry NPR News\nStreaming support for WAMC comes from my dog harness dot com and no choke no pull dog harness invented to make walks easier for both dogs and humans no need to pull no need to tug walk your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com\nSan Antonio immigrants are being dropped off in math at area bus stations [noise]\nThe greyhound bus station in downtown San Antonio sister Denise Little Rock of interfaith welcome coalition scrambling to assist the sudden influx of families\nThe detention centers and the holding centers at the border just gets so full\nIt's just like releasing that vowels\nYou know with their ankle monitors and all that kind of\nThe newly released families are required to report to immigration authorities when they reached their destinations for rock says she's been told that detained immigrants were being released to make room for a caravan of migrants now in Mexico in a statement the immigration and Customs Enforcement agency said his releasing these families to comply with federal\nLaw for NPR News I'm David Martin Davies in San Antonio you're listening to NPR News\nGame four of the world series gets underway this hour and has a lot to live up to last night and into this morning\nThe Los Angeles Dodgers and the Boston Red Sox played an ethic Eighteen any game three the doctors won three to two ahead of tonight's game the red Sox hold at two games to one lead NPR's Tom Goldman reports\nIn the latter part of the seven hour twenty minute marathon batters for both teams were taking mighty swings trying to hit a home run in and what would become the longest gaming World Series history finally in the bottom of the Eighteenth ending LA smacks when the did [noise]\n\nHe blasted the winning home run off awesome relief pitcher Nathan evolving it was for all practical purposes a season saving win for the Dodgers have they lost they would have trailed in the series three games to none no team in World Series history has ever come back from that deficits\nIn the bottom of the Thirteen painting the red Sox won out away from taking that commanding lead\nBut Boston second baseman Ian can for made a wild throw to first base\nAllowing a Dodgers runner to score and time again Tom Goldman NPR News\nIn Ireland Michael Higgins was reelected to a second term as president capturing fifty five point eight percent of the vote in an election marked by low turnout orders also overwhelmingly back to measure to remove blasphemy as an offense from the country's constitution it's the latest in a series\nOf measures that have seen the overwhelmingly Roman Catholic country step back from the religions influence over the government I'm Janine hurts and you're listening to NPR News from Washington\nSupport for NPR coverage from NPR stations other contributors include pro quest who's literature online premium features works from the eighth century to the present day and makes minority authors works discover all along with the western canon at libraries or pro quest dot com\nBoom\nSupport comes from the people of environment one providing systems and services for the water and electric utility industry's E. O. N. E. dot com stab rose helping people with disabilities achieve their dreams offices in ... Greenfield in Springfield ... dad worked for more information\nGo peek strings each tempted Massachusetts specializing in repairs and restoration as well as the purchase and sale of vintage string instruments including electric and acoustic guitars and violin Seventy five years combined experience\nStreaming support for WAMC comes from my dog hardest dot com or no choked no poll dog harness invented to make walks easier for both dogs and humans no need to pull no need to tug walk your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com\nWith American ... and bluegrass Saturday December first tried to call dot org\nAnd from elements hot tub spot downtown Amherst, Massachusetts hot tubs in five indoor or outdoor private rooms plus a team of massage therapist for individuals and a couple of elements ... dot com for gift certificates and photo gallery Mm\nMm Mm\n[noise] or in the studio today with a trek fury and you know we've never had you live in the studio with us before\nAnd I've been playing your music for lo these many years on your own label and you've got some amazing music and I had the opportunity to go to a song writing workshops with you earlier this year and um [noise]\nAnd you you gave me some secrets about songwriting and I haven't really necessarily put into practice [laughter] you know you have the notes when it comes to know to have their notes I have been really good I was right and I just wanted to a snack you for a few minutes to talk a little bit about\nSome of the things that you are doing these days and you have a new recent CD it's not brand spanking now it\nCame out at the end of may so it's fairly new um it's my sixteenth album and I always say album because I received CDs for two decades don't we both yes we do [laughter]\nAnd\nUh yeah and I it's uh I'm very proud of this album has been getting a lot of play on radio which is which is such an honor for me and I'm doing doing a lot of touring to promote it\nHe'd never actually a nice to have\nA new baseball which is golden rule\nAnd\nMy father loved the game and a big town here which Motown same game lock the plate and dealer runners\nBaseball with his middle name Mm keep your eye on the ball and keep your feet firmly planted they got to me when the ...\nTrust your instincts trust your dream to get that ball like\nMy father taught us that promote sleep\n\n\nIn my daddy was me and temperament wouldn't often sweet boy well groomed girls much\n... dancing fees\nOut in the Chevrolet off to the dentist ban which they have been into her all those pretty\nAnd he dances swings\nTo the ... in your view to the beat keep your feet firmly planted in the dance when the song use right\nTrust your instincts shops ears ring that they like read if they\nKnew my father taught lessons from only\nMm Mm\n\n\nMm\nIt is a game is still funny big school didn't want to see him gone my Eighteen\nIn Ninety eight years\nShe sounded buddies known in my knees\nStreaming support for WAMC comes from my dog hardest dot com I Know choked no poll dog harness invented to make walks easier for both dogs and humans no need to pull no need to tug walk your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com\nRinsing trust you read it that ball like Sam\n\nMy mom taught us from home see\nMy father was from only my father taught us citizens from they\n\nThat's such a great song because Everytime you do the chorus you change it just a little bit of that to modify it for a golf and dancing and baseball and it all fits it does somehow it all fits and you used Babe Ruth and you use Fred Astaire and Sam's need\nVarious you know it's that I dated by self exams need for well\nYou know Well Fred Astaire and Babe Ruth and not exactly a exactly the courage of interesting thing is like when I\nPlay this the first time a clear from my father he said he said you know they used to call me Fred Astaire and I did not know that was one of those you know beautiful moments of secret things in a city that's powerful\nThat's that's ... that's really a neat neat little song we're here in Studio ... would stop by to play a few songs from us She's got a\nA new CD called roses in November we're almost at November\nAt this time and you know we might look outside our window and a couple of weeks and there may be roses and growing more some tomatoes just like you say in the in the song now you live in in ... along the coast in Virginia now yes I Lived in Newport News and that's a that's that's a really beautiful part of the world\nIt is I've been there for seven years now and um it feels like home to me ah you know I've lived many places I spent Thirty years on the west coast I spent twelve years in Madison, Wisconsin and then I moved east for love and um it feels it's a wonderful place to live it really is so\nAre you working on anything new right now I mean I Know you're just working and then I'm just really promoting this I've written a couple of new songs but I'm I'm concentrating on promoting this and also I'm doing a lot more\nTeaching these days which I'm very happy about I'm doing a more and more workshops and a I T O I teach online I teach on Skype but the workshops are what really are exciting for me you you can work with a group of people and change people's lives and the way\nA yes you can [laughter] I went to one of those are one of those few day workshops and it was really quite\nAmazing that the kind of chemistry that you can get\nWhen you go away for a few days and have different songwriters that you can work with and ask questions mhm uh because questions at your when you are writing a song and kind of like in the middle of the night and um you write something down you have a question you can't\nAlways get an answer to that but you can if you go to one of the tongue writing out shop and now you write those questions down in the next morning around breakfast you can say it had this question I studied just this this race doesn't work out\nAnd even if you're writing alone it's always a collaborative effort in a workshop you can learn so much from from each other yeah and yeah that that's the beauty of and also when you go away and it's you're immersed in it\nYou don't have many distractions as you do at home you know the other song that I like a ... I'm throwing you a curve ball here lessons from home plate um about your family is the one about um a small town ... um I can play that can you play that without re tuning and going out just\nStreaming support for WAMC comes from my dog hardest dot com and no choked nope ... dog harness invented to make walks easier for both dogs and humans no need to pull no need to tug walk your dog with love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com\nOr being from a small town and not going back or going back or driving by and thinking about all the other things that you that people know in a small town\nSo well so many of us have grown up in small towns whether we've moved on or not I mean I have\nA ... they're just talking to my new CD also that deals with the same small town called ... Easter and I have cousins who have never left the town which they grown up which I find amazing and you know I I couldn't imagine myself but there is a beauty about knowing everything about\nThe people in your town and that sort of what this is was based on a ... a town called ... Easter where my grandparents my Norwegian grandparents lived when they retired from farming\nBut you know sometimes people grow up in a big town but the only grow up in a small part of the big city and it's still a small town in the same\nThing absolutely yeah so this is a small town\nA little bit of a\nThe streets are so why do you can diagonally harm in that small you know\nIn that small town yeah the streets are so why do with the theater has gone too far in that\nSmall town small town\nWhere your business is everybody's man\nAnd everybody knows your business is everybody know that um you wish you the ... and that's\nNo small oh\nConcrete so there are ... every year of that small\nYou know the ... and\nWent to work and you will lose every buddy was in tears and ...\nAnd our parents' rules and the kids on moved away from that small no no no no problem\n... say there's no reasons and they\nIn a small town they're really small oh\nWell you know everybody and everybody knows your business and everybody knows more than you know the ... in that small\nSmall oh Mm\nMy cousin Kenny on the pool hall ... day in a\nSmall no small town ...\nFarmers garments nation by the way\nStreaming support for WAMC comes from my dog hardest dot com and no choked no poll dog harness invented to make walks easier for both dogs and humans no need to pull no need to tug walk your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com\nAnd want to thank trip furious for stopping by again and we have a lot more show for you so we hope that you will stay tuned\n\nSupport comes from Hadley garden center Hadley, Massachusetts locally owned and operated for over fifty years with indoor and outdoor plants gardening supplies bird feeders and seeds organic fertilizer and advice Hadley garden center dot com\nSteve Lewis Subaru Hadley, Massachusetts a new and used super dealer serving the pioneer valley Hartford and Springfield offering new series plus used cars trucks and death CDs Steve Lewis Subaru dot com\nWhen towards natural path a clinic ... offering natural pathway medicine oxidative medicine Colin hydro therapy I'd acupuncture specializing in lung disease now accepting new primary care patients\nStreaming support for WAMC comes from my dog hardest dot com or no choked no poll dog harness invented to make walks easier for both dogs and humans no need to ... no need to tug walk your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com and maintenance\nNature works land care dot com Sienna college ... hosting an open house on Saturday November tent\nSharing information on new degrees in data science communications nursing and the new NBA option for undergrad CNN dot edu slash open house\nBlew mountain bistro to go route twenty eight Kingston cafe catering and to take out food\nBy shepherd author Richard Erickson home of the new cookbooks feel good food\nOpen daily blue mountain bistro dot com and from foresight landed services for over forty five years offering civil engineering land surveying planning and environmental permitting deprived and municipal clients in the Berkshires and eastern New York\nForesight land dot com [noise]\n\n\n[noise]\nLittle instrumental piece from ...\nTo kind of get you in the mood for some Halloween songs peppers ghost and other banjo visitations\nHe tells you a little bit about it in here and it's a new to name for an old time staged illusion still used today with the hidden room and an angle pain of glass things appear or disappear as lighting is manipulated professor John pepper of London\nFirst use the trick in Eighteen sixty two to create a ghost in the Dickens Christmas play [noise]\nSeem to like a good title for this reflective to what we do have Halloween coming up in the middle of next weekend edition is a song by Billy Crockett that tells you oh maybe we shouldn't be so afraid of those ghosts\nMm\nHurdle was a mess it just never customary\nDrank whiskey from a Dixie ...\nMarched with Dr King ...\nJob is phone book and have a ...\nRichard was a congressman home every one of the dog food so\nBlack and white TV from his western ...\nO\nSaying Bob is a good\nOne for him reform Mm\nView that oh the one and my mother\nGive those spin ... two and one and\nStreaming support for WAMC comes from my dog hardest dot com and don't choke nope ... dog Curtis invented to make it easier for both dogs and very humid no need to pose no need to tug walk your dog with love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com or no\nBetty was it that would roll with for some\nDrinks with Louis does\nShe had to lay eggs\nI bet she knew how to use is\nRachel was much Graham oh though I never met\nA beautiful to read it sees the picture\nShe should\nThe ... who who won a made up\nI can always moving in ...\nLike friends who will go ...\nBut my dinner the go [noise]\nBut we should know Mm\nAt the door there is a no Iraqi not invited yes or no it is my father\nUh can't catch my breath Mm\nHe never said anything to me he didn't feel like a test\nThe room gets cold it awkward but don't know why he hey\nBut he has a trace of sadness not see to to the\nMachinery is with me\nAnd we use enough first names\nThe table\nOn as much as we\nSomebody comes in the\nLast thing in softball and no one sees a\n... my dinner they would go [noise]\nLike Jamaica told [noise]\nUsed all the girl\nWas a no Mm\nStreaming support for WAMC comes from my dog hardest dot com and don't choke nope ... dog harden it that just to make it easier for those dogs and their humid no need to pull no need to tell what you're dealt with well crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com\nNow their own vehicles weighing in memory surprise better when they said he slowly grew\nWagons Rhode Island through when the school bell woken\nHurting dirty enroll me\nIn Wyoming\nGoes ... for you\nKnow there are only goes to a\nFar from abroad high\nAnd here are\nThe charges paper shy\nBeside the railroad\nJust to turn them from every move the mother in law\nAnd I get a\nThe raw random\nReading the miners\nMm\n\nThere's just Northeast Public radio WAMC F. M. H. D. Ninety point three Albany W. R. UNH the Ninety pointer erupts in Utica WAMC AHD Ninety point nine Kingston W O with our HD nine one seven Middletown WGLA chi Ninety One night Plattsburgh WC a an HD Ninety three three can't count as your Harry\nW. A. N. C. H. D. one oh three nine to ... the one oh five one great Barrington W. W. E. S. H. D. eighty eight nine mount Kisco WINZ HD Ninety point one Stanford W in our eighty five Brewster and WAMC am fourteen hundred Albany\nAnd of course you can listen online at WAMC dot org [noise]\nThe news is next from National Public radio news in Washington we have more songs for Halloween for you know we have one from and hardy another one from Cindy max and to come up and just before uh we uh told you what stations you are listening to you heard from El McMahon and we'll be right back after the news\n[noise] live from NPR News in Washington I'm Janine hurt\nThe man accused of opening fire at a Pittsburgh synagogue this morning is in custody\nPlease I don't know the motive behind forty six year old Robert powers actions he is hospitalized with gunshot ones\nAt least eleven people died six others were injured and a middle light rain thousands champion intersection near the synagogue tonight for a candlelight vigil for the victims saying prayers and singing in memory of those killed and wounded\nMeanwhile authorities in New York Chicago Los Angeles and other areas are increasing security around synagogues and Jeremy Siegel from member station ... reports multiple agencies in the bay area are also increasing police presence\nOfficials from San Francisco Oakland and Berkeley's police departments either ramping up patrols around synagogues in response to the Pittsburgh shooting just over ... is a public information officer for as a PD\nUp he has definitely stepped up president around the very synagogues throughout the city and at that time we can let the public in San Francisco now that there are no ... or any of the synagogues or in a city and\nStreaming support for WAMC comes from my dog hardest dot com and no choke no poll dog harness invented to make walks easier for both dogs and humans no need to pull no need to tug walk your dog with love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com\nGladstone says members of his congregation are shocked and saddened by the shooting in Pittsburgh for NPR News I'm Jeremy Siegel in San Francisco\nPresident Trump says the hearts of all Americans are filled with grief telling the crowd at a campaign rally in Murfreesboro Illinois\nThat it was an anti Semitic attack at its worst he'll just says he will visit Pittsburgh but he didn't give details former President Obama tweeted about the shooting saying he Greece for the Americans murdered in Pittsburgh\nAnd that all of us have to fight the rise of anti Semitism and hateful rhetoric against those who look love or prayed differently\nThan real police in Mexico try to stop thousands of Central American migrants from continuing north during a stand off on a highway as NPR's Carrie Kahn reports the migrants earlier turned down an offer from the Mexican government to stay in that country\nPolice with plastic shields block the caravan from advancing on the highway in the southern state of Chiapas where migrants have been walking north to the U.S border Mexico's National Human rights commission is negotiating with the police to ensure passage most of the migrants want those negotiations to take place in Mexico city\nYesterday Mexico's president announced a new plan he called you are at home\nAllowing the migrants to stay in the country working send their children to school in a boisterous rally led by supporter of the caravan the migrants voted to continue northward to Mexico City and the U.S border many were skeptical as a Mexican offer and point to the hundreds who have already been deported back to Honduras Carrie Kahn NPR News\nYou're listening to NPR News from Washington\nPoet and play right into the key ... has died she was Seventy she's best known for her Korea home and titles for colored girls who have considered suicide when the rainbow was enough a groundbreaking production combining poetry dance music and song NPR's Lynn Neary has this remembrance\nShe was born ... Williams the leader took on an African name that meant she who comes with her own things and she walks like a lion a feminist and poet she burst onto the New York theater scene with the off Broadway production of for colored girls in Nineteen Seventy five\nIt was a startling production for the time of course of seven spread across the stage speaking truth about the reality of life as a black woman that had never been heard before\nIt was young gay and obey award moved on to Broadway and later it was made into a film by Tyler Perry\nShrug it was a prolific writer producing dozens of poetry collections plays and novels and in recent years she continued working even after suffering several strokes Lynn Neary NPR News Washington\nFederal emergency management agency has sent supplies to the U.S territory of the northern Mariano islands whose residents are dealing with power outages destroyed houses and roads days after the powerful typhoon you to hit the area\nMilitary planes run an food water tarps and other supplies and FEMA says it will focus on opening sea and airports and making sure cell towers operate and restoring power\nAt least one person died in the storm that had maximum sustained winds of one hundred eighty miles an hour as it passed over the islands of ... this is NPR News\nSupport for NPR comes from NPR stations or their contributors include their doors do charitable foundation whos clinical sciences development awards support promising early career fuzzy\nStreaming support for WAMC comes from my dog hardest dot com and don't choke nope ... dog harness invented to make it easier for both dogs and humans no need to pull no need to tug walk your dog with well crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com [noise]\nWell that is joined the Wilson with James pocket from a CD or first call Carolyn cottage he's ... Carolyn on the ... volume two and ... Nineteen Ninety One\nWell just before the news I promise to some music from Cindy ... were staying in the Halloween machine and so this is from her CD sun lines from Nineteen Ninety two Cindy makes\n...\n\n... a lady Margaret we're living in ... I'm\nA lady\nThing in the ... when she heard a ...\n... ...\nYou know I'd rather oh\nNo no no no I'm a\nWalk for I'm here\nI think we should do when Madeleine to dwell on the number one ...\nAgain going to have a\nGuy that I'm not going to ... I basically you're part of the above\nMe I'm ... I'm ... to ...\nThe Braves fan where Trump's going\nTo come by\nFar the fat lie down\nAnd wrap my gets Gary Hart\nEarn the money to do in ... but I must\nSay more or ...\n\nOr in the car but I really haven't done the right to maneuver or move on\nTo the ...\nHe's a boy or a ...\n... when they\n... one\nOf our Muslim baby man when the ...\n\nThe longest sure you\nStreaming support for WAMC comes from my dog hardest dot com and don't choke nope ... dog hornets invented to make it easier for both dogs and very humid no need to pull no need to talk walk your dog with love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com\nBust you mean the Jim ...\nYou're ... you're right my degree on the ...\nYou put ... for you to\nRead um lawyer I wouldn't\nWant to see the\nMovie you're ... ... ... ...\n... ... ...\nWas one for the game\nFrom dinner I'm ...\nI'm good how are you from how are you\nThe rye with your\nYour ... are getting um harm make more of a living in the ... the number\n\nUm I came to a\nIn\nThe\nMom how we're going to\nShow no\n\nNo\nNo no\n\nI'm I I'm\nWrong maybe in some\nOne which is a\nGuy who just raised today\nWhere they're spraying jeeze\nFor St John\nWhich will bolster a\nFundraiser gray and there's a\nLot\nMore than me and oh\nSorry I'm going to jail\nBut I just took\nWhich is down to\nDo Henry hard for\nLong season\nStreaming support for WAMC comes from my dog hardest dot com and don't you know pulled dog harness invented to make it easier for both dogs and humans no need to pull no need to tug walk your dog with well crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com\nAnd I'm a\nMy God\nSixteen twelve\n\nHot oh\nBill or a\nJudgment followed\nSo I\nWhy why\nTo\nFind out\nI Know I just\nBought a home on\nDo the lush green nine zero\nYou\nGuy people die down\n[noise] so written by and hills and it's about an ancestor of hers Alice Snyder who was hanged for practicing witchcraft in England the CD is called for chose ... seen Cindy makes an aunt hills and Michael Smith\nHandle hill is the name of the two before that classic Archie Fisher with which of the west Marlins demand with a rhyme amazing\nAlbum from way back started out into vinyl recording in his now available on C. D. for that and hearty from barefoot folk from two thousand Thirteen and that was the ghost on mortgage\nAnd she makes in from a solo CD that she did called song lines and that was sweet Williams ghost interesting concept about a ghost coming back and change that you have to\nStreaming support for WAMC comes from my dog hardest dot com or no choke no poll ... invented to make walks easier for both dogs and humans no need to pull no need to tug walk your dog with love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com\nOr your lesson you are listening to the Hudson River sampler my name is Wanda Fisher and every Saturday evening with get together and play this kind of music tonight's program is pre recorded I had to go out of town and had to go pretty early in\nThe process so someone else is taking care of the underwriting credit for me and I really appreciate all of that work that they helped me out with\nSupport comes from the Waldorf school at Saratoga Springs giving children the education and tools for the challenges that are never changing world Waldorf Saratoga dot org\nThe town crier live music and creative contemporary convening beacon presenting Alistair Frasier at Natalie hawks October twenty eight\nUnder the\nEuropean nah\nStreaming support for WAMC comes from my dog hardest dot com and don't choke nope whole dog Curtis invented to make it easier for both dogs and very humid no need to poll no need to tug walk your dog with love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com\n... through the ... Brittany ...\n... ...\nTo ...\nTo my ...\n...\n...\nWas ... to ...\n...\n...\nBut ever will let you know we've been\nDaughter well mother won't give her a non ... na\nWas heavy\nMarketers we\nStill have a bunch of them not fond of the value of which no man\nHe\nMay call Wall Street\n\nMaybe ... million dollar\nShe couldn't spend\nOr lawyers that sense [noise]\nAlways demanded it for free though she had properties foreign ... how many\nWere through cracks in\nThere would read as hard\nMy passion dirty her\nChildren play like more they don't do it all over\nWhat they called it a tree\nEven though\nShe couldn't quit in ...\nHis green\nMark me well\nWhether your tickets for heaven or hell there's nothing just by another just\n\nI Want to know\nWhen when they grow so how could you bought your oh\n\nStreaming support for WAMC comes from my dog hardest dot com I Know choked no poll dog harness invented to make walks easier for both dogs and humans no need to pull no need to tug walk your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com [noise]\nRight to free labor\nHard to say with their children crippled and she didn't go on and her husband late in ...\nAnd we do we she knew you\nWere nothing she\nEvery word she feared every hand poisoning I'm\nRecalling\nMillion though\nShe\nMay call phone\n\n\n\nFrom the wilderness road new Vermont history songs Pete Sutherland and friends and the friend that saying the ah the friend who's saying the lead on that one was quoting laws you are and that was the which of Wall Street and the hope Jake\nBefore that we heard from the late and wonderful Michael Johnson with a song that he made popular on country radio actually uh there's just I'm just to go to in the house from a collection of music from the folk scene the folk scene collection volume three\nOh from two wonderful a folk DJ's who are who has now left us Ross and Howard alarm in many wonderful musicians are on this particular collection on the red house label\nBefore that\nWe heard from Betty and the baby boomers with ah Bruce Springsteen song the ghost of Tom jones from their this love will carry CD and they will be at the age stepped in Schenectady on Saturday the eleventh [noise]\n[noise]\nSupport comes from the people of environment one providing systems and services for the water and electric utility industry's E. O. N. E. dot com grapes and degrades wide disparities green Bush New York off we wanted to craft spirits from around the globe and from local artisans had picked selection of wines\nStreaming support for WAMC comes from my dog hardest dot com and no choke ... dog harness invented to make walks easier for both dogs and humans no need to pull no need to tug walk your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com\nNorthampton at East Hampton in Massachusetts later at ... dot org\nArts spark dedicated to helping artists musicians and created with the business of being an artist\nArts dashed mark dot com and from state street fruit store deli winds and spirit downtown Northampton a locally owned community minded grocery and specialty stores since Nineteen twenty two wine tastings every Friday forty seven state street fruit dot com [noise]\n\n[noise]\n[noise] Joe made this with dogs on the ... you are listening to the Hudson River sampler on this taped program my name is Wanda Fisher a little bit of the Halloween team and we're going to listen to a song called Halloween by David raw to be at the sounding board in a\nAt winding trails in Farmington, Connecticut tomorrow afternoon at ... ... ...\n\n[noise]\nWas the favorite holiday is when\nI got to address on\nLike many people don't want to do\nI was fired when you run my sister was approved", "year": "2018", "show_name": "The Hudson River Sampler", "city": "Albany", "day": "28", "locations": [["Albany", 42.65258, -73.75623], ["Great Britain", 54.75844, -2.69531], ["Albany", 42.65258, -73.75623], ["Washington", 38.89511, -77.03637], ["Washington", 38.89511, -77.03637], ["Pittsburgh", 40.44062, -79.99589], ["Pittsburgh Pennsylvania", 40.44062, -79.99589], ["Pittsburgh", 40.44062, -79.99589], ["Miami", 25.77427, -80.19366], ["San Antonio", 29.42412, -98.49363], ["San Antonio", 29.42412, -98.49363], ["Mexico", 23.0, -102.0], ["San Antonio", 29.42412, -98.49363], ["LA", 34.052235, -118.243683], ["Boston", 42.35843, -71.05977], ["Ireland", 53.0, -8.0], ["Washington", 38.89511, -77.03637], ["Springfield", 39.80172, -89.64371], ["Massachusetts", 42.36565, -71.10832], ["Massachusetts", 42.36565, -71.10832], ["Motown", 42.33143, -83.04575], ["Virginia", 38.34982, -81.63262], ["Wisconsin", 44.50024, -90.00041], ["Hadley", -68.49017, -66.50523], ["Massachusetts", 42.36565, -71.10832], ["Massachusetts", 42.36565, -71.10832], ["Springfield", 39.80172, -89.64371], ["Kingston", 17.99702, -76.79358], ["Berkshires", 42.16676, -73.14955], ["New York", 40.71427, -74.00597], ["London", 51.50853, -0.12574], ["Jamaica", 18.16667, -77.25], ["Rhode Island", 41.82399, -71.41283], ["Wyoming", 43.00024, -107.5009], ["Albany", 42.65258, -73.75623], ["Utica", 5.16977, -74.50134], ["Albany", 42.65258, -73.75623], ["Washington", 38.89511, -77.03637], ["Washington", 38.89511, -77.03637], ["Pittsburgh", 40.44062, -79.99589], ["New York Chicago", 41.68833, -73.89833], ["Los Angeles", 34.05223, -118.24368], ["San Francisco Oakland", 37.80437, -122.2708], ["Pittsburgh", 40.44062, -79.99589], ["San Francisco", 37.77493, -122.41942], ["Pittsburgh", 40.44062, -79.99589], ["San Francisco", 37.77493, -122.41942], ["Illinois", 41.85003, -87.65005], ["Pittsburgh", 40.44062, -79.99589], ["Greece", 39.0, 22.0], ["Pittsburgh", 40.44062, -79.99589], ["Mexico", 23.0, -102.0], ["Chiapas", 16.5, -92.5], ["U.S", 39.828306, -98.5795], ["Mexico", 23.0, -102.0], ["Mexico city", 19.42847, -99.12766], ["Mexico", 23.0, -102.0], ["Mexico City", 19.42847, -99.12766], ["U.S", 39.828306, -98.5795], ["Honduras", 15.0, -86.5], ["Washington", 38.89511, -77.03637], ["Korea", 36.5, 127.75], ["New York", 40.71427, -74.00597], ["Washington", 38.89511, -77.03637], ["U.S", 39.828306, -98.5795], ["Mariano", 45.69651, 9.1818], ["England", 44.0, -71.0], ["Vermont", 44.00034, -72.74983], ["New York", 40.71427, -74.00597], ["Northampton", 40.62593, -75.37046], ["Massachusetts", 42.36565, -71.10832], ["Northampton", 40.62593, -75.37046], ["Farmington", 42.46448, -83.37632], ["Connecticut", 41.66704, -72.66648]], "not_found": [], "ep_coords": ["Albany, NY", 42.65258, -73.75623], "in_country": ["Albany", "Albany", "Washington", "Washington", "Pittsburgh", "Pittsburgh Pennsylvania", "Pittsburgh", "Miami", "San Antonio", "San Antonio", "San Antonio", "LA", "Boston", "Washington", "Springfield", "Massachusetts", "Massachusetts", "Motown", "Virginia", "Wisconsin", "Massachusetts", "Massachusetts", "Springfield", "Berkshires", "New York", "Rhode Island", "Wyoming", "Albany", "Albany", "Washington", "Washington", "Pittsburgh", "New York Chicago", "Los Angeles", "San Francisco Oakland", "Pittsburgh", "San Francisco", "Pittsburgh", "San Francisco", "Illinois", "Pittsburgh", "Pittsburgh", "U.S", "U.S", "Washington", "New York", "Washington", "U.S", "England", "Vermont", "New York", "Northampton", "Massachusetts", "Northampton", "Farmington", "Connecticut"], "out_country": ["Great Britain", "Mexico", "Ireland", "Hadley", "Kingston", "London", "Jamaica", "Utica", "Greece", "Mexico", "Chiapas", "Mexico", "Mexico city", "Mexico", "Mexico City", "Honduras", "Korea", "Mariano"], "in_state": ["Albany", "Albany", "New York", "Albany", "Albany", "New York Chicago", "New York", "New York"], "out_state": ["Great Britain", "Washington", "Washington", "Pittsburgh", "Pittsburgh Pennsylvania", "Pittsburgh", "Miami", "San Antonio", "San Antonio", "Mexico", "San Antonio", "LA", "Boston", "Ireland", "Washington", "Springfield", "Massachusetts", "Massachusetts", "Motown", "Virginia", "Wisconsin", "Hadley", "Massachusetts", "Massachusetts", "Springfield", "Kingston", "Berkshires", "London", "Jamaica", "Rhode Island", "Wyoming", "Utica", "Washington", "Washington", "Pittsburgh", "Los Angeles", "San Francisco Oakland", "Pittsburgh", "San Francisco", "Pittsburgh", "San Francisco", "Illinois", "Pittsburgh", "Greece", "Pittsburgh", "Mexico", "Chiapas", "U.S", "Mexico", "Mexico city", "Mexico", "Mexico City", "U.S", "Honduras", "Washington", "Korea", "Washington", "U.S", "Mariano", "England", "Vermont", "Northampton", "Massachusetts", "Northampton", "Farmington", "Connecticut"]}, {"month": "10", "state": "NY", "station": "WAMC", "content": "Streaming support for WAMC comes from my dog ... dot com no joke no poll dog hardest invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog Curtis dot com [noise]\nThis is Northeast Public radio WAMC up\nAnd made Ninety point three Albany doubled you argue energy Ninety point three months in Utica WAMC ... point nine Kingston doubled you always are edgy Ninety One seven Middletown W. U. C. L. E. D. Ninety One nine parts for that what you see a un agency Ninety three three kinda G Harry W. A. N. C. H. D. one oh three no anti counter real good WAMC ... the one oh five one great Barrington\nW W E S H da da da da da da da da and our eighty eight five Brewster at WAMC fourteen hundred Albany mhm\nGood evening and welcome to tonight touching her sampler my name is Wanda Fisher and I'll be with you tonight until about ten o'clock we have some special guests waiting for you in the studio Bob Warren in parts of his band and we hope that you will stay tuned\nBut first we'll check in with National Public radio news in Washington for the latest news update\nMm Mm\n\nLive from NPR News in Washington I'm Janine her for the truth is praising Mexico's government for blocking a caravan of Central American migrants someone from hope to travel on to the U.S even as Mexico grabs visitors permits that some of the migrants\nHave to go only allowing those with visas or passport then and some who are seeking asylum situation is getting chaotic Emily Green is on a bridge on the border between Guatemala and Mexico\nIt's over hats here but it's so extremely hot and humid there are lots of people who have set up camp on the sidewalk summer lying on their back\nTheir shirts off many kids and how there's I'm running around with no shoes on\nAnd at the same time lots of people lining up to get food\nAh it's a very fluid and dynamic Jewish and it puts a tons and tons of people\nEmily Green reporting from along the Mexico Guatemala border annual gathering of Alaska Native people drop thousands to Alaska's largest city is under way this week but as the Northwest News network's Emily ... reports there is one hot button issue that's not an official agenda item\nAt least half of adult women in Alaska experience intimate partner violence or sexual assaults are both\nHaving those discussions are painful folks are vulnerable and they need to happen\nIf we're going to break the cycle\nUs assistant secretary for Indian affairs tyrants weeny was that this year's Alaska federation of natives convention\nPeople are talking about abuse in hallways and out on the street but it isn't a form of conversation here too and foreign policy development in the coming year Sweeney and Alaska Native would not comment\nStreaming support for WAMC comes from my dog harness dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com\nIn age from ten to Twenty one argue the government failed to protect natural resources as a public trucks for future generations in the ocean of and that report\nChief justice John Roberts signed the order marking a victory for the U.S government which has tried for years under both the Obama and Trump administrations to get the case dismissed the lawsuit was filed in twenty Fifteen and it's sponsored by an Oregon based nonprofit called our children's trust\nIt seeks to phase out fossil fuels that caused climate change\nAnd court filings the federal government has said the lawsuit is unconstitutional and that these issues should be left to the political branches of government to resolve not the courts\nThe high court's blocking temporary and it will freeze the trial for ten days in federal court until lawyers for the activists provider response chanted and sent NPR News Washington\nAnd you're listening to NPR News\nIn Afghanistan a suicide bomber blew himself up outside a polling station in school today\nIt's the first major attack in today's parliamentary elections\nSeveral people were killed many more wounded no one has claimed responsibility but the local ISIS affiliate and the Taliban threatened violence and warn people to stay away from the polls\nI've already said Seventy thousand national security forces were deployed to the Twenty one thousand polling places across the country for Afghanistan first parliamentary elections since twenty ten\nUniversal postal union is warning American consumers will pay a heavy price if the Trump Administration goes ahead with its threat to pull out of an international postal treaty\nAs Lisa ... reports from Geneva Washington cleans the treaty benefits China and that's at the expense of American business interests\nThe Trump Administration wants to renegotiate the treaty saying it allows China to mail small packages to America and heavily discounted rate making it hard for American business to compete\nAs senior postal union official warns Americans won't be able to send international letters or international packages if Washington pulls out of the one hundred forty four year old treaty he\nSays the U.S won't be able to access special codes needed to send and receive mail internationally and this will affect UPS that ... and other companies who also would lose access to these codes for NPR News I'm Lisa shrine in Geneva\nOn Janine hurt and you're listening to NPR News from Washington\nSupport for NPR comes from NPR stations or their contributors include Sierra Nevada Brewing Company family owned operated and argued over since Nineteen eighty proud supporter of independent thought whether that's on line over the air or in a bottle more if you're in Nevada dot com\nAnd support for WAMC comes from lakes two locks passage scenic by way of supporting the variety of hands on classes offered at the Adirondack folk school in lake Lucerne I ... and travel tips at lakes two locks dot org I Love New York\nThe button box Sunderland, Massachusetts makers of our mores concertina is also selling new and used concertina and accordion and providing repairs and accessories button box dot com Saratoga bridges Boston's fondue York community resource for people with disabilities and their ...\nStreaming support for WAMC comes from my dog harness dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com\nValley Hartford and Springfield offering new super ... plus used cars trucks and SUVs Steve Lewis Subaru dot com\nAnd hand ... shake her village a place to explore the legacy of the shakers heirloom gardens historic buildings are tend to know festivals farm to table dining concerts inhale loft Hancock shake her village dot org [noise]\nWell once again and welcome to tonight's program and we have a real treat for you tonight and every year at this time usually I think\nA lot around that time bomb I think on usually come in here and not talk to us about your annual a program at caffeine Lena isn't that right\nThat is that we always do the leaders on the first weekend of November and usually it's a one day sometimes two shows on that same day but this year it's two two dates or the friday and Saturday the second and third of November\nAnd uh usually they'll show show out cello trade\n[noise] uh yes and hopefully they will again this year were you know especially with the CD really says a lot of excitement about the new CD coming out and uh that's that's my hope some that's part of the reason we're here is to reach out to anybody who who might not be aware of this yeah\nYes I have the CD in my hand is called my town and where did the title come from\nWell a ... many of the songs I live in the village agreements New York and many of the songs are directly about my town about my life there um I got a grant a last year to write some songs about my community and a few of them are have ended up on the album and a few of them are are more personal than that\nBut still about my town about my life and and so it seemed like a good time [noise]\nSo getting a grant to write songs about your town is it because of the rural nature of the town or is it what what was the granting agency give you a a money to do that for\nBasically to have a a a recorded history okay I'm One of the songs on the album we won't do it tonight because it's eight minutes and then the second I see that\nUh the the linen mill um that was established in Greenwich in the late Eighteen hundreds and which brought over many many people from Ireland particularly kill for violent and so the whole south West End of town which used to be called darn town because while dogs around there\n... ...\n\nIn the streets the huge strong ...\n... ... ...\nPeople\nComes or deeds you never know\n[noise] [noise]\n...\nMm\nMm\n\nAnd when ... ... ...\nI Will\nLead my ... ...\n... claim to the sweet ...\n... ... ... ... ... ... ...\n...\n\n... times and I'm a\nI'm a\n...\nA ... ...\n... ... [noise]\nStreaming support for WAMC comes from my dog harness dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com\nTime yeah probably did\nYeah I think I thought I heard you get to that one before and it's a great town um and we're here with Bob Warren and I told him I tell us and Matt donnelley I met I you don't necessarily need to uh to\nLean over your keyboard and get into the microphone but I really like the light touch that you gave to that song is really really just exactly right you being a full fearful I'm\nBob you need to do one of the historical ones from the CD I think can you do one of the ones that its historical on the on the CD or not [noise]\nWithout having I Know the eight minute when it's not going to do it\n[laughter] is there one year they could just do the men and women just bring it up to the Nineteen thirties [laughter] I mean is there one on here that you could do that as part of the grant that do that [noise] um well my town was actually that that was part of the grant okay Yeah John Burton is really\nThe other in four leaf clover which four leaf clover really benefits from the ... okay and the book you know the things that are other instrumentation and okay so I I think my town maybe are only ... often\nI mean the grant well um I think that maybe people might be able to hear some of those are the benefits from other instrumentation if they were to go to a cafe Lena\nAbsolutely my brother Donald joined us on guitar joined McKenzie will join us on vocals Danny ... will join us on percussion and then we are going to have a winner Grady and James gas going ah joined us on fiddle in Ventura\nOh that'll be nice Saturday Night shift can be great I'm so again the dates are\nNovember second and third Friday Saturday both a nice at eight o'clock I'm people I talk with a seemingly\n... people are telling me they're coming to both shows but I'm seemed to have a lot of people come into the friday show so I don't know I don't know where they stand on ticket sales but it's probably a good time to order now if if you're going to want to ...\nYeah I think that you could find out if if they are close to being sold out or if they're sold out by just going onto the caffeine Lena website and they if if you can't buy a ticket think they're a little ... you know right right so we've got time for maybe two more songs are wonderful yep so what if you\nWill do is just silly ones for you okay All right so so I hate the color of my old [laughter] not really the song is really based on a different house in my old house but I thought how funny would it be\nTo talk about the fact that you know you live in a house for years and years of you because it becomes part of you and\nUh and even though you may sell it and move on you still have a a sort of pride in possession about feeling a possession about it so I wrote the song and I wanted to people who live in the house that um I was writing it when I started to ride it out and I said it's not really the colors are not about the house\nThis house it's about a different how are they okay but it's called I hate the color you painted\nMile was it about ... ... ... I I drive by it today but no not that I Lived in no okay just to hide it or a house yeah OK took\nThe colors of a of a house that I used to really love the way it looked and don't like the way it looks now okay I'm In kind of in my mind painted the walls with my old house those going okay\nWell to love to be fooled\nStreaming support for WAMC comes from my dog hardest dot com no joke nope poll dog heart is it that did to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to Todd walk your dog with love thousands of reviews at my dog Curtis dot com\nPulled her in the\nSenate they was feeling good\nTurned down to ... ... [noise] wait a minute job just dropped ... slam down the street swimming to a kid to do with this terrible thing you did well\nHate the colder you paint in my own hours\nAnd [noise]\nGet you went down to the hardware store and say I\nDon't know that Benjamin Moore no\nGimme ended she bit pain and a senior [noise] lacking in Boulder restraint and Cheney made germ can zoom rejected pain\nThat made the original ... said well\nHate the child or you pay to my own well [noise]\n[noise]\n\n\n\n\n\n[noise] [noise]\nWell you might have played it safe\nNot you know [noise]\nUm the cutting edge oh that is new and artistic free spirit in New York in or shy\nRode her in the hands go gun wire render\nDo well in a bubble gum the shutters sitting\nSalmon lonely you tell them well I hate cold or you pay ten miles\nWell [noise]\nI hate to go to the ten minute\nNo [noise] [noise]\n[noise]\nMm\n\n[noise] and it just reminds me my my kids when they were little which they are not anymore I used to love the book by Daniel Pink water called the big orange ... do you know that no no I don't know how uh this guy took a big orange paint can and and put it on the side of his house and his neighbors didn't like it\nAnd he would say to them on my house is is me and I am ... and so don't tell me how to paint my house and a ... just check out check out the big orange black one of these days is a great story\nWill and I and I was thinking about that I think you know it it it's kind of in one sense it's great to these folks just made the south or their own their own and it's not like too many other houses\nStreaming support for WAMC comes from my dog hardest dot com and no ... no poll dog heart is it that did to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to Todd walk your dog with love thousands of reviews at my dog Curtis dot com\nLot or\nMy God oh\nGoing to be\n\nDo different things and\nBe [noise]\nStreaming support for WAMC comes from my dog hardest dot com no joke nope poll y'all garden is that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\nA game and have\nBeen screened for going\nOh man jogging\nThat far out and for\nOh I Know\n...\n\n\n\nMm\nMm Mm Mm Mm Mm\nMm Mm Mm Mm\nStreaming support for WAMC comes from my dog hardest dot com I no joke nope poll y'all garden is that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com Mm\nMen Mm\nMm\n...\n... ...\n\nYou know\nStrayed onto you flew into when no one died without warning and your big along some very done done\nFollowed you can never in a\nOf the guy and he wrote today\nMe until I returned home and make me well look like in ... in\nHas on Megan my home and never in a\nI showed on your show no he gave me that my mom we made he wins the and\nIn the morning or the day\nI come in they can be long well blanket or rebel again Joe\nName has on me given my\nStreaming support for WAMC comes from my dog hardest dot com I no joke nope poll y'all Curtis is that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com\nNo harm in\nThey only have the ending you\nI returned home then they can be well like in her belly and\nVegan my home and never really\nStrain on you know\nNice guy he well\nThen make me look like in\nBite me Don May give\nDone gig in my whole man ever\n...\nDishes Northeast Public radio WAMC F. M. H. D. Ninety point three Albany W. R. UNH do Ninety pointer eruption Utica W. I. M. K. HD nine point nine Kingston W O which are HD Ninety One seven Middletown\nWGLA Chino anyone nine Plattsburgh WC A. N. H. D. Ninety three three candidate Harry W. A. T. H. D. one oh three nine ... one oh five one great Barrington W W E S H da da di mount Kisco W. A. N. D. H. D. Ninety point one Stanford\nW and our age by Brewster\nAnd WAMC am fourteen hundred Albany the news is next from National Public radio news in Washington and we'll be back with more music following this news update from National Public radio news in Washington we hope that you will stay tuned to\nHave a lot of GOOD Music coming up next\nLive from NPR News in Washington I'm Janine hurt\nAs international called for an investigation into the death of Washington Post journalist ... in ... grow President Trump today is repeating his position but he's not sure the Saudi Government was involved\nTrump speaking to reporters after a campaign rally in Nevada says it's possible the Saudi crown prince was unaware of the killing the Trump says the multibillion dollar sale of US military equipment to Riyadh still needs to happen [noise]\nFour hundred and fifty million dollars I think it's over a million jobs [noise]\nThat's not helpful for us to cancel it order like that [noise]\nThat are just more that urge them\nThe Saudi Government now says the journalist died as a result of a fist fight in a Soviet consulate in Turkey\nHundreds of thousands of protesters packed into central London today demanding another referendum on the u._k. pulling out of the European Union address rank Langfitt reports many Britain's are deeply unhappy with Brexit negotiations which are at a stalemate and running out of time the march or see the ... that was ...\nStreaming support for WAMC comes from my dog harness dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com bust of\nCrushing out of the European Union with no deal for a future relationship the protestors want to stay in the EU others hope there will be a deal but want to see the details before signing off prime minister may however has rejected holding another public vote which breakfast here say would be anti democratic Frank Langfitt NPR News London\nAfghanistan is holding its first parliamentary elections in eight years and here in Studio city reports though at least three people have been killed in a suicide bombing targeting voters at a polling station held in school\nThe Bowman struck a school that was used as a polling station it was kept open to accommodate voters who hadn't been able to cough that ballots only because of ... off hadn't turned up in the morning fearing attacks\nVoters though did turn up in defiance of the Taliban and ISIS who struck campaign rallies in the lead up to these elections militants also try to attend voting and Scott a deadly attacks around the country\nThere was also confusion about how to use the new biometric systems and some days didn't have ballots because of the kind of surrounding the elections voting will now be extended to Sunday in some areas the date NPR News Islamabad\nA police officer and Georgia's been shot and killed after responding to reports of suspicion vehicle narrow school when it kind of ... shots were fired from inside that vehicle it's officer Antwon Tony and other officers approach police sergeant Jay Smith\n... bills are offered got out of their cars and approached the vehicle and before they can even get shots\nSo does that affect fled the scene police are still searching for him you're listening to NPR News from Washington\nAuthority than India say most of the casualties and the train crash friday in the northern part of the country where migrant workers at least sixty people were killed dozens injured when a speeding train ran over crowd celebrating a Hindu festival\nA local branch of the Indian National Congress party organize the event at a clearing near the railway track on the outskirts of the myths or\nPolice they are investigating whether the organizers had the proper permits\nWhether the week after hurricane Michael hit the Florida Panhandle tens of thousands of people are still without power and if you're an event that reports\nMost of the outages are in Bay county and northern Florida near the border of Alabama and Georgia residents say they are using candles flashlights after dark and generators have our air conditioners most to Florida and electricity sources are outside the area's most impacted by the storm and remain intact\nBut the hurricane destroy transmission lines substations and utility poles connecting those sources to customers goals powers says it has more than a thousand employees working on restoration and in the meantime authorities are warning residents to stay away from downed power lines Shannon sent NPR News\nAn unmanned spacecraft is now on his way to mercury that's a seven year journey a journey rather\nThe mission is a joint one between the European and Japanese space agency and if successful would only be the surgeon study mercury up close officials at the European space agency the the length of the trip makes it a challenging one\nThe mission is expected to enter Mercury's orbit in late twenty twenty five\nI'm Janine hurts NPR News in Washington\nSupport for NPR comes from the Jack Kemp cook foundation providing scholarships throughout the mission to exceptionally high achieving students with financial need\nStreaming support for WAMC comes from my dog ... dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com\nDad rose helping people with disabilities achieve their dreams offices in Amherst Greenfield and Springfield several dot org for more information\nThe Yiddish book center Amherst, Massachusetts presenting community open house a day of events including talks tours and an afternoon concert Sunday October twenty first ten AM to four pm Yiddish book center dot org\nGoat peak strings East Hampton in Massachusetts specializing in repairs and restoration as well as the purchase and sale of vintage string instruments including electric and acoustic guitars and violence\nSeventy five years combine experience go peek strings dot com elements hot tub spot downtown Amherst, Massachusetts offering hot tubs and five indoor or outdoor private rooms plus a team of massage therapists for individuals and couples\nElements hot tub spot dot com for gift certificates and photo gallery [noise]\nNew York state a F. L. CIO with two and a half million members speaking with one voice helping working families achieve a better life and Y. S. A. F. L. C. I. O. dot org\nAnd the tent and you will Woodstock invitational Lou tears showcase new this year learned to play guitar in a day at the climate James Center for the arts Sunday October twenty eighth Woodstock invitational dot com [noise]\nAnd before we get back into the music I just want to thank everybody who participated in the ... that we had last week it was just an amazing an extraordinary time again the locked box and\nTwo days in three hours and our listeners who are the most extraordinary listeners in the world and I really mean that\nJust came forward and help to meet our goal of a million dollars and you are just incredible and we just cannot say enough about you [noise]\nSo thank you thank you thank you thank you and\nYou're the reason we're here every last one of you [noise]\nHere are Betty and the baby boomers\n\n\nAnd\nDo your job so who ... or\nNa\nNa\n\nScreening support for WAMC comes from my dog hardest dot com I no joke nope y'all garden is that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk what your dog would love that is the reviews at my dog ... dot com or\nHere\nTruth football\n\nAnd and I am\n[noise]\n\n\n\n... ...\n... ...\n... ... ball go\nGet a hose ...\nMachinery and things are to the river\nSing to to go see\nPower to you when the\nI'm\n\n\nDon't know\nStreaming support for WAMC comes from my dog hardest dot com I don't choke nope don't harden it that just to make it easier for both dogs and their humid crafted in the Berkshires two thousand six\nNo need to pull no need to talk what your dog would love that is the reviews at my dog Curtis dot com [noise]\nNo we don't\nWhat now but many\n\nJudge him every day\n\nVe and\nDied but oh\nMany [noise]\nLong enough or\nReally ...\nTo help those two together\nWe don't live with this\nSo I'm not\nThere as well but the\n\nYeah I Know\n\nWe are\nThe\nAnd we\nWe\nDo when you want to go\nWe try to water\nStay in the\nAnd yeah as\nYou say\nNa na yo yo\n\nStreaming support for WAMC comes from my dog ... dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com\nWell Appleseed records has come out with his three record set\nFifty seven tracks apple seeds twenty first anniversary roots and branches and a lot of new songs by people such as Donovan John Wesley Harding Tom Morello Tim Robbins Bruce Springsteen\nAnd the late Jesse Winchester to quit the collection on Appleseed recordings to celebrate their twenty ... twenty first anniversary of producing really amazing music and that was a song from there\nAnd that was a Lorie Wyatt and Pete Seeger with so most el Barco Lorie Wyatt wrote the song and you probably recognize some other voices on there including Emmy Lou Harris and before that from that same CD a Dick Oregon with land of the north when\nStreaming support for WAMC comes from my dog hardest dot com I choke nope y'all garden is that just to make it easier for both dogs and their humid crafted in the Berkshires two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog ... dot com\nAnd\nKnow\nJob he\nJob fees\n\nLouisville came down to the shooting\nThen really shouldn't\nHuge the low\nWas in tears dean cues the\nClose in ... the ...\nThe truth\nWe enjoy as long\nBig dreams oh\n\n\nRode the route to the code\nMan ...\nYou could know\nJudy did he sees as\nLose lowered the lover\nWe do but it's been a low\nStraightening support for WAMC comes from my dog hardest dot com I choke nope y'all garden it that just to make it easier for both dogs and their humid crafted in the Berkshires two thousand six\nNo need to pull no need to talk what your dog would love that is it really is at my dog dot com\nMan\nA\nSay ...\nWhat do you ...\nThe news\nOverboard sleep and I'm ... ... you\nIn ...\nDreams Jews drill thing\nBeing treated you know\n[noise]\nHazard trauma a CD is called true but your came out in two thousand seven on the right to get people before that they call them\nStreaming support for WAMC comes from my dog hardest dot com no joke no poll dog harness that did to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love thousands of reviews at my dog harness dot com\nFields and uh that was written by Wendy Waldman and we started with Ruth hill from her CD reunion of broken hearts and that was break the stones [noise]\nSupport for WAMC comes from sunflower natural foods market Woodstock and ride back with false self and family care supplements and immune support remedies for seasonal allergies replenishing moisturizers for ... skin care sunflower natural dot com [noise]\nAll stir county resource recovery agency using food scraps and yard waste to create nutrient rich compost to help conserve water and control weeds compost available for purchase U. C. R. R. A. dot org\nArts spark dedicated to helping artists musicians and all creative is with the business of being an artist arts dash spark dot com\nWind horse natural path a clinic parental borrow Vermont offering natural path to take medicine oxidative medicine colon hydro therapy and acupuncture specializing in Lyme disease now accepting new primary care patients when towards natural path ... dot com\nAnd miss halt school pet Pittsfield, Massachusetts a boarding and date school offering girls in grades nine through twelve the real world experiences of its horizon or an internship in service learning program mess halls dot org [noise]\nWe're going to listen to something now by John Smith from his CD ...\n\n[noise] [noise] [noise]\n\nCrops hurry [noise]\nLast time oh I'm ... I'm In the usa [noise]\n[noise]\nNo I don't", "show_name": "The Hudson River Sampler", "year": "2018", "city": "Albany", "day": "21", "locations": [["Albany", 42.65258, -73.75623], ["Utica", 5.16977, -74.50134], ["Kingston", 17.99702, -76.79358], ["Albany", 42.65258, -73.75623], ["Washington", 38.89511, -77.03637], ["Washington", 38.89511, -77.03637], ["Mexico", 23.0, -102.0], ["U.S", 39.828306, -98.5795], ["Mexico", 23.0, -102.0], ["Guatemala", 15.5, -90.25], ["Mexico", 23.0, -102.0], ["Mexico Guatemala", 15.83106, -88.77719], ["Alaska", 64.00028, -150.00028], ["Alaska", 64.00028, -150.00028], ["Us", 45.99696, -118.49854], ["Alaska", 64.00028, -150.00028], ["U.S", 39.828306, -98.5795], ["Oregon", 44.00013, -120.50139], ["Washington", 38.89511, -77.03637], ["Afghanistan", 33.0, 66.0], ["Afghanistan", 33.0, 66.0], ["Geneva", 46.20222, 6.14569], ["Washington", 38.89511, -77.03637], ["China", 35.0, 105.0], ["China", 35.0, 105.0], ["America", 39.828306, -98.5795], ["Washington", 38.89511, -77.03637], ["U.S", 39.828306, -98.5795], ["Geneva", 46.20222, 6.14569], ["Washington", 38.89511, -77.03637], ["Nevada", 39.25021, -116.75119], ["Adirondack", 45.40258, -73.65278], ["Sunderland", 54.90465, -1.38222], ["Massachusetts", 42.36565, -71.10832], ["concertina", -20.15694, 33.72389], ["concertina", -20.15694, 33.72389], ["Boston", 42.35843, -71.05977], ["Springfield", 39.80172, -89.64371], ["Lena", 43.16089, -5.82878], ["New York", 40.71427, -74.00597], ["Greenwich", 17.98438, -76.82559], ["Ireland", 53.0, -8.0], ["Lena", 43.16089, -5.82878], ["Ventura", 34.27834, -119.29317], ["Boulder", 40.01499, -105.27055], ["New York", 40.71427, -74.00597], ["Megan", 47.40448, -72.46761], ["Albany", 42.65258, -73.75623], ["Washington", 38.89511, -77.03637], ["Washington", 38.89511, -77.03637], ["Washington", 38.89511, -77.03637], ["Nevada", 39.25021, -116.75119], ["US", 45.99696, -118.49854], ["Riyadh", 24.68773, 46.72185], ["Turkey", 39.0, 35.0], ["London", 51.50853, -0.12574], ["Britain", 41.66121, -72.77954], ["London", 51.50853, -0.12574], ["Afghanistan", 33.0, 66.0], ["Studio city", 34.14862, -118.39647], ["Georgia", 41.99998, 43.4999], ["Washington", 38.89511, -77.03637], ["India", 22.0, 79.0], ["Florida", 28.75054, -82.5001], ["Bay county", 43.59447, -83.88886], ["Florida", 28.75054, -82.5001], ["Alabama", 32.75041, -86.75026], ["Georgia", 41.99998, 43.4999], ["Florida", 28.75054, -82.5001], ["Washington", 38.89511, -77.03637], ["Springfield", 39.80172, -89.64371], ["Massachusetts", 42.36565, -71.10832], ["Massachusetts", 42.36565, -71.10832], ["Massachusetts", 42.36565, -71.10832], ["New York", 40.71427, -74.00597], ["Louisville", 38.25424, -85.75941], ["Vermont", 44.00034, -72.74983], ["Lyme", 53.0, -2.23333], ["Pittsfield Massachusetts", 42.45008, -73.24538]], "not_found": [], "ep_coords": ["Albany, NY", 42.65258, -73.75623], "in_country": ["Albany", "Albany", "Washington", "Washington", "U.S", "Alaska", "Alaska", "Us", "Alaska", "U.S", "Oregon", "Washington", "Washington", "America", "Washington", "U.S", "Washington", "Nevada", "Massachusetts", "Boston", "Springfield", "New York", "Ventura", "Boulder", "New York", "Albany", "Washington", "Washington", "Washington", "Nevada", "US", "Britain", "Studio city", "Washington", "Florida", "Bay county", "Florida", "Alabama", "Florida", "Washington", "Springfield", "Massachusetts", "Massachusetts", "Massachusetts", "New York", "Louisville", "Vermont", "Pittsfield Massachusetts"], "out_country": ["Utica", "Kingston", "Mexico", "Mexico", "Guatemala", "Mexico", "Mexico Guatemala", "Afghanistan", "Afghanistan", "Geneva", "China", "China", "Geneva", "Adirondack", "Sunderland", "concertina", "concertina", "Lena", "Greenwich", "Ireland", "Lena", "Megan", "Riyadh", "Turkey", "London", "London", "Afghanistan", "Georgia", "India", "Georgia", "Lyme"], "in_state": ["Albany", "Albany", "New York", "New York", "Albany", "New York"], "out_state": ["Utica", "Kingston", "Washington", "Washington", "Mexico", "U.S", "Mexico", "Guatemala", "Mexico", "Mexico Guatemala", "Alaska", "Alaska", "Us", "Alaska", "U.S", "Oregon", "Washington", "Afghanistan", "Afghanistan", "Geneva", "Washington", "China", "China", "America", "Washington", "U.S", "Geneva", "Washington", "Nevada", "Adirondack", "Sunderland", "Massachusetts", "concertina", "concertina", "Boston", "Springfield", "Lena", "Greenwich", "Ireland", "Lena", "Ventura", "Boulder", "Megan", "Washington", "Washington", "Washington", "Nevada", "US", "Riyadh", "Turkey", "London", "Britain", "London", "Afghanistan", "Studio city", "Georgia", "Washington", "India", "Florida", "Bay county", "Florida", "Alabama", "Georgia", "Florida", "Washington", "Springfield", "Massachusetts", "Massachusetts", "Massachusetts", "Louisville", "Vermont", "Lyme", "Pittsfield Massachusetts"]}, {"month": "10", "state": "NY", "station": "WAMC", "content": "Streaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including may go robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nIt day in a victory show featuring limbo being underground David and Jacob burns and others October fourteenth T O W N E crier ...\nThis is Northeast Public radio WAMC F. M. H. D. Ninety\nPoint three Albany W. R. U. N. H. D. ... W am cage the nine point nine Kingston W. O. R. H. D. Ninety One seven Middletown WGLA HD Ninety One nine Plattsburgh WC a an HD Ninety three three Kennedy Harry W. A. N. C. H. D. one oh three nights high kind of robust W. A. M. U. H. D. one oh five\nOne great Barrington W W E S H da da na ... kids go W. A. N. D. H. D. Ninety point one Stanford W ANR eighty five Brewster and WAMC am fourteen hundred Albany\nMhm Mm Mm\nGood evening and welcome to tonight ... name is Wanda Fisher and I'll be here with you until about ten o'clock tonight tonight to program is pre recorded so we will not be taking any requests but we hope that you will stay tuned\n\nBut first we'll check in with National Public radio news in Washington for the latest news update Mm\nMm\nMm Mm [noise]\nLive from NPR News in Culver City California I'm Janine Herb's President Trump welcomed pastor Andrew Brunson to the White House today celebrating his released from detention in Turkey as NPR's Tamara Keith reports the evangelical pastor had been held in that country for more than two years\nBrunson and his family sat next to Trump in the oval office marking the end of what had been a harrowing two years Branson an American evangelical Christian pastor with a small church in Turkey was swept up in a crackdown\nBy the government of Turkish president regimen type ... following a coup attempt in twenty sixteen he freed friday\nI always say we spoke about this at least once a day we thought we had done two months ago sometimes it doesn't always work out but that's [noise] I can only tell you this better than anybody else because of\nGrateful Brunson thank the president members of Congress State Department officials and others for their efforts to secure his release while\nStill in the oval office Brunson prayed for Trump asking that he'd be given supernatural wisdom camera Keith NPR News\nMeanwhile President Trump is campaigning in Richmond, Kentucky tonight for Republican candidates in the state telling the crowd during the midterms next month's elections next month every voter faces a choice once again saying Democrats or the party of crime while Republicans are the party of safety\nTropic campaigning for three term congressman Andy Barr who's fighting off a strong challenge from Democrat Amy graph\nOf retired Marine fighter pilot in the Florida Panhandle emergency workers are scrambling to get food and water to communities hit hard by hurricane Michael and here's Joel Rose reports conditions in Panama City Florida are growing increasingly desperate\nDays after the storm made landfall there is still no power as no water in Panama City and very limited cell phone service many residents vacuum\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including may go robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nGet food and water to residents quickly but that effort has been hindered by communication problems Joel Rose NPR News Miramar Beach Florida\nAt least fourteen deaths are blamed on the storm and Germany protestors gathered in a capital to march against the rise and right wing populism as we Nicholson has more\nThousands of demonstrations from the gym and he took to the streets but then on Saturday carrying ... reading we are indivisible and build bridges not ruled\nThe protest which aims to promote an open society it's also a reaction to the rise of the far right party alternatives to Germany which is expected to set one in the ... station actions on Sunday\nMany will also demonstrating against the recent anti immigration running in the eastern city of cabinet west saw rights groups chased people they deemed to be foreign\nFor NPR News I'm Esme Nicholson in ... and\nYou're listening to NPR News from Culver City California\nIn Yemen an airstrike by the Saudi led coalition targeting Yemen Shiite rebels known as ... as allegedly Seventeen people dead several wounded and the port city of data today\nRebel leaders say the strike hit traffic including a bus that was completely destroyed ... was it keep port installation suffering and un and other humanitarian aid\nBecome the center of Yemen's conflict the death toll it expected to rise as many of the wounded are in critical condition\nOr officials in northern California are bracing for hot and windy weather that's likely to increase the wildfire danger this weekend in early ... into early next week if you're a skirt Ziegler reports Cal Fire and other agencies are already increasing staff and putting extra crews on standby\nIt's been years and some of the most destructive and deadly wildfires hit northern California and fire managers are nervous because of similar weather scenario that proceeded those fires is also in the forecast\nIn northern California the dreaded Diablo wins that blow in from the interior and replace the usual chili coastal breeze or to arrive this weekend\nAnd here in Southern California the Santa Ana winds are predicted by Monday with temperatures shooting up into the eighties or hotter many wildfires are caused by sparks from downed power lines of vehicles or ... cigarette butts October is the typical peak of the wildfire season and coastal areas Kirk Siegler NPR News Los Angeles\nPost tropical cyclone Leslie is heading toward Spain and Portugal the national Hurricane Center in Miami says the storm is expected to hit parts of both countries later tonight and tomorrow heavy rains and gusty winds I'm Janine hurts NPR News\nSupport for NPR comes from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefeller work in food health power jobs and resilient cities at rock found dot org and Americans for the arts\nAnd support for WAMC comes from goat peak strings East Hampton in Massachusetts specializing in repairs and restoration\nAs well as the purchase entail a vintage string instruments including electric and acoustic guitars and violins Seventy five years combined experience goat peak strings dot com\nArt spark dedicated to helping artists musicians and own creative with the business of being an artist arts dash spark dot com\nUnderground railroad history project announcing seeking sanctuary exhibition\nStreaming support for WAMC comes from my dog ... dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com\nStreet fruit store deli winds and spirits downtown north Hampton a locally owned community minded grocery and specialty food stores since Nineteen twenty two wine tastings every Friday four to seven\nState street fruit dot com and Albany promo Zika presenting back bliss featuring acronym baroque string ensemble and the boy course stars of the cathedral of all saints October twenty first at Troy savings bank musical Albany provost ... dot org\nWell once again and welcome to tonight's program and just a reminder tonight's program is pre recorded so we will not be able to take requests tonight\n[noise] but I Do want to remind you about our fun drive which starts on Monday two days from now\nAnd if you would like to get a head start on the program\nOn the fund drive or you can go to WAMC dot org and put a little something into the locked box it's a secure way to pledge and to give us a little head start on our October fund drive because the more we have in the lock box the viewer\nA we have to raise on the air and the less we interrupt the regular programming because I don't know about you but I rely on this radio station\nFor news and information and some of the other really amazing program said\nWe broadcast through WAMC right here and I know that so many people that I run into tell me the same thing [noise]\nNow I have a I'm surrounded as I usually am by all these CDs that I Want to play for you tonight and we're going to start with something from the new Aerosmith Rob trio [noise]\nJust Aerosmith Richard Aerosmith and Ian Rob\nAnd this is the title tune from the CD that's only been out for a few weeks Aerosmith Rob trail\n\n\n\n\nWe love you but I Do not get him on the news you know you can live on land on more than ...\n\n... you know ...\n\n\nWhen I saw the the\n\n\nStreaming support for WAMC come from birch are Center for weight loss surgery with a focus on white scope and support for long term success would weave district to me and ... bypass surgery monthly seminars open to the public for one three three nights five seven five one zero to register [noise]\n\n[noise]\nNah\nAny white and our pet away from home sweet home songs of love locks and been longing salt of the earth CD came out in two thousand twelve it's beautiful CD on Amy's own label fair would\nRecords\nSalt of the earth before that Judy Collins with her song that she wrote called salt of the earth and started with the Aerosmith Rob trio with the title tune from their brand new CD all the salt just Aerosmith\nRichard Aerosmith and E N Rob and just beautiful harmonies on that song it's a beautiful song all around [noise]\nYou're listening to the Hudson River sampler my name is Wanda Fisher and every Saturday evening get together and play this kind of music and I hope that you are enjoying what you're hearing we are pre recorded this week uh because uh\nI had to go out of town and I can tell you about it all next week if things go well\n[noise] and knowing that it's baseball season you might be able to put two and two together but I'll tell you about it next week\nSupport for WAMC comes from del mar farmers' market three thirty two can would have a new dumber celebrating ten years of local and organic farm products baked goods fair trade craft music and more every Saturday from nine to one John Maher market dot org\nThe button box Sunderland, Massachusetts makers of our more concertina also selling new and used concertina and accordion and providing repairs and accessories button box dot com [noise]\nStab rose helping people with disabilities achieve their dreams offices in Amherst green field and Springfield stab rose dot org for more information\n[noise] late for retirement communities communities of older adults devoted to social responsibility and personal and intellectual enrichment north Hampton and East Hampton in Massachusetts ... dot Kendall\nDot org [noise] oh that's just kind of an interesting CD\n[noise]\nHas just come into the station it's a song called music\nStreaming support for WAMC come from birch are Center for weight loss surgery with a focus on life scope and support for a long term success with we've got struck me in gastric bypass surgery monthly seminars open to the public for what three three nights five Seventy five one zero to register\nSome of the songs that are on here are things like uncle John stand and ripple from the Grateful Dead end these boots were made for walking by\nNancy Sinatra the Wichita Lineman do you mean with Web song that\nWe heard\nFrom like Kim from the beach Glen Campbell and you know so it's kind of an interesting\nConcept to do them and with folk music arrangements Lauren euro stone she'll picnic things like this but this is a\nSong that a number of folk musicians have recorded written by Rowley Sally [noise] so we're going to listen to this one with any felt on we eat\nAnd Darryl anger with\n\nOn a number of the other instruments and then you send jokes which on base and Neal Perlman on accordion ... and Emmy fell from songs of the roaring sixties\n\n\n\nHe's\nJust like [noise]\n\nNo\n[noise]\n[noise]\n\n[noise]\n[noise] um [noise]\n[noise]\n\n[noise]\nStreaming support for WAMC come from birch are set up for weight loss surgery where the focus on life skills and support for long term success which we've got struck me in gastric bypass surgery monthly seminars open to the public for what three three nights five Seventy five one zero to register\n[noise]\nNo it's not a ... ... ...\nWho's June ... rent is going on ... rising pants fall ... ...\nC ...\n...\nServed go by we spread out\nLie goals scourge ... rocky and you know ...\nThey will not drop their right to be more tightly around their shoulders but\nThen when they do more ... well the\nStraightening support for WAMC comes from my dog hardest dot com I don't ... know poll dog hard is it that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love that is it really is at my dog Curtis dot com\nMm\nCats and the kitchen ...\nGoing in the bar and\nLeaves no see my\nBurnt stopped a chapter\nOne last calm sea Shia heading\nFor a southern ...\nWomen have them on to some\n...\n... to return\nSay well you know draw whereas most highly around their shareholders\nWhen they don't ...\n\nThe way which is five\nMm\n... ... ... the guy is heavy and during the\nWho are here in the trees will be\nShorter and shorter Mm ... Mm\nWell interest in what is there I\nHands ... phone it in France role\nIn the\nThe dream I'm the senior center ...\n... ... they are dreaming um springs in the ...\nMay well not really draw ... more tightly around they show on earth but no\nFan I Am a little more ...\n\nThe ...\nYeah\n\nDoesn't Joe is in the movie\nHe's coming home loan leading\nTo the moon is a\nOne strike Tony ...\nStreaming support for WAMC comes from my dog hardest dot com I no joke nope poll yogurt is it that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk what your dog would love that is it really is at my dog Curtis dot com ...\n... the man who\nIs ... the the\nGuy in the spring\n...\n... how do you\nEver done this before the ... the ...\nIt's a ...\n...\nWhere we don't\nThat we\nVery\n...\n\nRobot begs zone blue\nFool me\nIn the dreams risk\nAll the ...\nFamily is a new\nAnd that\n\nIt's a very young age\nWe're we're they don't\nThat we\n...\nBrand new so long\n\nMm well\n\nStreaming support for WAMC comes from my dog hardest dot com or no joke no pope dog hornets invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love that is the reviews at my dog Curtis dot com\n\nNext\nWell\n\nGo\n\n\n\nHighly near who won't be doing a CD released concert next Saturday the ... at the tip of proctors\nDitches Northeast Public radio WAMC F. M. H. D. Ninety point three Albany W are you renting she Ninety point three ramps and Utica\nW William ... Ninety point nine Kingston W. O. N. sorry she Ninety One seven Middletown WGLA nine one nine Plattsburgh until you see a an HD Ninety three three candidates Harry\nW. A. N. C. H. D. one oh three nine to ... good to be William ... five one great Barrington W. W. E. S. H. D. eighty eight nine mount Kisco W. A. N. D. H. D. Ninety Ninety point when ... million are eighty five Brewster and WAMC am fourteen hundred Albany\nAnd of course you can listen online at any time at WAMC dot org or on your W. A. M. C. at\nThe news is next from National Public radio news in Washington and we'll be back with more music right after that live from\nCulver City California I'm Janine hurt President Trump met with Andrew Brunson in the White House today the American pastor is back in the U.S after being held for nearly two years in Turkey rented was accused of participating in a failed coup attempt in twenty sixteen a charge he denies\nAll the law\nI welcome all pastor echo Russian [noise]\nTrump speaking there to campaign rally in Richmond, Kentucky today stumping for Republican candidates in that state it's the latest campaign rally he's held around the country ahead of the mid term elections next month\nAt the rally he also praised Senate majority leader Mitch McConnell who is from Kentucky for helping to get a cabin up onto the Supreme Court\nRelief supplies lifesaving equipment and personnel are all heading into areas of Florida's panhandle rabbits by hurricane Michael\nOfficials say the severity of the devastation tampering trucks from getting into the most heavily damaged areas at least fourteen deaths are being blamed on the storm but officials expect that number two rights and bears David Schaper reports the commercials supply chain\nStreaming support for WAMC comes from my dog ... dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com\nThrough Florida Randy ... with Tampa Bay blew grades logistics you're waiting\nOn a product that may be coming through the port of Miami it's no going to be able to get up through the panhandle right now and get up into into the mid west in Chicago and then the then be distributed so you will feed delays\nOver here or there was already a shortage of drivers and some will now be diverted to hurricane relief so his customers are seeing a fifty percent spike in shipping costs that could make orange juice grapefruit and other Florida produce more expensive in the weeks to come David Schaper NPR News\nThe Taliban confirmed that their representatives in cutter held talks with the U.S delegation including in ... new U.S on going to the region and glass reports from Kabul the peace efforts are aimed at ending the Seventeen year war\nThe meeting between the Taliban and U.S officials in the second time the two groups have met face to face was the first for now and they ... the new U.S special representative\nHe declined to give details the Taliban and say the two sides talked about finding a peaceful resolution to the Afghan conflict they also said that the presence of foreign forces remains the greatest obstacle to peace but that both sides agree to continue to me about Fifteen thousand us troops remain in the country\nLives not brief the Afghan president on his first trip in the region which included a previous stop here Pakistan Saudi Arabia and Qatar us Taliban meetings represent a shift for years the United states for a few Taliban requested meet directly seeing any peace process should be Afghan lead\nFor NPR News I'm Jennifer glass in Kabul\nYou're listening to NPR News from Culver City California\nPope Francis today de ... to more Chilean priests accused of sexually abusing minors and in an apparent effort to show greater transparency he publicly examined why they were removed and here it's Philip Reeves reports from made the announcement after he met with chilies president\nThe tuba ships of religious clerics to fold in a scandal that's engulfed the Catholic Church and today the Vatican says Francisco Jose ... Marco Antonio Dennis Fernandez was stripped of the priesthood for overt acts of abuse the scandals so far led to the resignation of a handful of bishops a prominent priest was the ... last month\nAnd prosecutors say they're investigating over one hundred cases of alleged clerical abuse going back to Nineteen sixty\nThe Vatican's long been accused by victims of covering up the issue and then being slow to respond when the pope eventually sent a team to try to investigate it to identify the culture of abuse concealment for the Braves MPR news\nFuneral services were held today for some of the victims of the party bucks crash in upstate New York last week that left ... people dead\nIn Amsterdam New York hundreds of mourners packed the saints fan of lost Roman Catholic church for the funerals of four sisters killed in the crash along with three of the women's husbands and the brother of one of the husbands the NTSB is investigating but so far no cause has been determined\nThe driver of that party event also died and authorities say he barrel down a street hitting an empty parked vehicle before coming to rest intervene\nThe limo company has been banned from operating until the NTSB investigation is complete\nI'm Janine her NPR News Culver City California\nFor NPR comes from NPR stations other contributors include vital project spawned supporting the museum of modern art in Manhattan where Charles\nStreaming support for WAMC comes from my dog ... dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com\nAnyway MC comes from Massachusetts General hospital Mass General research backed care approach drives them to develop treatments for complex conditions to help their patients get back to their lives revolutionizing care Mass General\nAlbany promo Zika presenting Bach bliss featuring acronym baroque string ensemble and the boy course stirs up the cathedral of all saints October twenty first at Troy savings bank musical Albany promos or go dot org [noise]\nThe town crier live music and creative contemporary cuisine in beacon fifth anniversary show featuring ... underground David and Jacob burns and others October fourteenth G O W N e crier dot com\nShe blew a Subaru Hadley, Massachusetts a new and used Subaru dealer serving the pioneer valley Hartford in Springfield offering new sue Bruce plus used cars trucks and SUVs she blew a Subaru dot com [noise]\nThe Waldorf school of Saratoga Springs giving children the education and tools for the challenges of an ever changing world Waldorf Saratoga dot org\nAnd blue heron restaurant and catering located in the historic town hall in Sunderland now booking holiday parties for the two thousand Eighteen two thousand Nineteen season blue heron dining dot com slash\nCatering [noise] well you know there are so many really great shows coming up in our area I I Can't even keep up with so many of them but [noise] [noise]\nThere's a duo coming to the caffeine Lena in Saratoga Springs next Saturday evening and I found them at the folk alliance in\n[noise] I think it was in Kansas City and they are from England and they are just absolutely phenomenal and they call themselves the black feathers\n[noise] and they are uh\nShaun Chandler ... huge and I thought I played something by them here today and this is from their CD called soap to the bone the black feathers\n\nAnd I know\nGod I thought oh\nUh well the murder along the road who ... Rees deep uh well the most well those rules ... Rees\n\nGod or ... ... ... bees\nI hear what you're telling me to do but the world so deep and I can't see into the deep\nAll ... all those ... ... ... yeah I'm a deep uh well ... ...\nRees\nA God or ... well no maybe bees\nNow more than two months and then come and take me so I can stay tuned in deep\nAll ... all those\n... ...\nStreaming support for WAMC comes from my dog hardest dot com I don't choke nope pope dog harden it that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love that is the reviews at my dog Curtis dot com\nDeep well ... ...\nRe\nA deep uh well I'm not a well ... ... ...\n\n\nWe're not\nStreaming support for WAMC comes from my dog ... dot com no joke no poll dog harness that did to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com\nMany and the baby boomers from there where the hair in weight CD from two thousand nine with come and get your scores and row and that's um no actually it's called tide and the river rising song written by a Cindy ... who's\nInstrumental piece I've been using as my theme song at the beginning and the and my show since the show begins in Nineteen eighty to tide and the river rising Betty and the baby boomers and they will be\nDoing a show a week from tonight at the Hudson River maritime museum in Clearwater barn along with Tom McHugh\nAnd that will be at seven thirty before that\nGene Ayman from Canada\nWith a song that she called deep water and that is the title tune from that particular a CD [noise]\nBefore that we heard from happy Trump are wonderful friend both here at the station and in that particular show tomorrow afternoon from two to five PM at the ... center he's going to be doing his program on the coming of age during the folk revival\nAnd I've seen that program it's absolutely fantastic so that'll be at the ... center and you heard him do the incredible song on up to my neck in high ... money water a\nCo written by John Harold and ah who left us a few years ago [noise] and we started oh before that we heard from Ellis Paul\nWho is also going to be in the area in a ... Vermont\nA next stage on the nineteenth that's next friday\nI was scaring bend fields and deaths in ... Vermont Fifteen Kimball hill next stage\nAnd you heard him do river road and we started with the black feathers who will be a caffeine Lena in Saratoga Springs you heard from there so to the bone CD on down by the river\n[noise] so many many many good things happening over the next week a great October in the ...\nStreaming support for WAMC come from Berkeley Center for weight loss surgery with a focus on life skills and support for a long term success with we've got strict to me in gastric bypass surgery monthly seminars open to the public for what three three nine five seven five one zero to register\nAnd crafts spirits from around the globe and from local artist since with weekly tastings stocking single moms bourbon sticky loose and jeans grapes and greens wine dot com\nThe center for natural wellness school of massage therapy now when Rowling spring two thousand Nineteen part-time morning and fulltime massage therapy programs C. N. W. S. M. T. dot com for information and events [noise]\nThe city of north Adams welcoming visitors to experience the fall foliage hiking biking museums shop in restaurants explore north Adams dot com [noise]\nThe people of environment one providing systems and services for the water and electric utility industry's E. O. N. E. dot com and elements hot tub spot downtown Amherst, Massachusetts offering hot tubs and five indoor or outdoor private rooms\n\nMan\nStreaming support for WAMC come from birch are set up for weight loss surgery where the focus on life skills ... support for long term success with we've got to me and ... bypass surgery monthly seminars open to the public for what three three nights five Seventy five one zero to register no\n... and too much to say\nKnow ...\n\n... my\nOh\n'cause we love to\nI'm\nSingle mom\nMe than my\nHere is not\n...\nYeah in\n[noise]\nStreaming support for WAMC comes from my dog Curtis dot com I choke nope who do Curtis is that just to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to hug walk your dog would love that is the reviews at my dog Curtis dot com\n\nKnow\nOr they they they made\nKnow will no longer go\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including may go robotic surgery sports medicine and anterior hip surgery for one three for nine six six zero zero\nThe Jeremiah is from a CD they called the fence fake tile of Maine from last year the wild Barrow road before that we heard from Donald Lindsay\nAnd that was a little Jake's on the wandering home the boys valley mode and within a mile of Dublin from his CD waters of the north esque highland bagpipe music from in VR mark\nAnd he will be doing a Celtic music from the north presented by the Vermont Institute of Celtic arts in ... College of piping\nOn Saturday up to twenty at seven pm to kill to call for thirty new Carter Road in colony\nAnd a along with in my car and special guests on the end ... Irish dancers ... broad on guitar and fiddle Dominique dodge harp in ... in Gaelic song\nA lot of Fitzgerald a Celtic song and foreign and Eli glued on fiddle [noise]\nBefore that we heard from Bethany euro and Bethany euro and refunds ... will be doing a concert on October twenty is at\nA Walt Whitman books in middle Bergen New York that's at seven o'clock before that we heard from the new CD from kayak cater the CD is called grenades", "show_name": "The Hudson River Sampler", "year": "2018", "city": "Albany", "day": "14", "locations": [["Albany", 42.65258, -73.75623], ["Washington", 38.89511, -77.03637], ["Culver City California", 34.02112, -118.39647], ["Turkey", 39.0, 35.0], ["Turkey", 39.0, 35.0], ["Richmond", 37.55376, -77.46026], ["Kentucky", 38.20042, -84.87762], ["Florida", 28.75054, -82.5001], ["Panama City", 8.9936, -79.51973], ["Florida", 28.75054, -82.5001], ["Panama City", 8.9936, -79.51973], ["Miramar Beach Florida", 30.37437, -86.35856], ["Germany", 51.5, 10.5], ["Germany", 51.5, 10.5], ["Culver City California", 34.02112, -118.39647], ["Yemen", 15.5, 47.5], ["Yemen", 15.5, 47.5], ["California", 34.68743, -116.78467], ["California", 34.68743, -116.78467], ["California", 34.68743, -116.78467], ["Diablo", 13.11949, -85.87971], ["Los Angeles", 34.05223, -118.24368], ["Spain", 40.0, -4.0], ["Portugal", 39.6945, -8.13057], ["Miami", 25.77427, -80.19366], ["Massachusetts", 42.36565, -71.10832], ["Albany", 42.65258, -73.75623], ["Troy", 18.24924, -77.60978], ["Albany", 42.65258, -73.75623], ["Sunderland", 54.90465, -1.38222], ["Massachusetts", 42.36565, -71.10832], ["concertina", -20.15694, 33.72389], ["concertina", -20.15694, 33.72389], ["Springfield", 39.80172, -89.64371], ["Massachusetts", 42.36565, -71.10832], ["France", 46.0, 2.0], ["Utica", 5.16977, -74.50134], ["Albany", 42.65258, -73.75623], ["Washington", 38.89511, -77.03637], ["Culver City California", 34.02112, -118.39647], ["U.S", 39.828306, -98.5795], ["Turkey", 39.0, 35.0], ["Richmond", 37.55376, -77.46026], ["Kentucky", 38.20042, -84.87762], ["Kentucky", 38.20042, -84.87762], ["Florida", 28.75054, -82.5001], ["Florida", 28.75054, -82.5001], ["Miami", 25.77427, -80.19366], ["Chicago", 41.85003, -87.65005], ["Florida", 28.75054, -82.5001], ["U.S", 39.828306, -98.5795], ["U.S", 39.828306, -98.5795], ["Kabul", 34.52813, 69.17233], ["U.S", 39.828306, -98.5795], ["U.S", 39.828306, -98.5795], ["Pakistan Saudi Arabia", 33.72707, 73.10978], ["Qatar", 25.5, 51.25], ["the United states", 39.828306, -98.5795], ["Kabul", 34.52813, 69.17233], ["Culver City California", 34.02112, -118.39647], ["New York", 40.71427, -74.00597], ["Amsterdam", 52.37403, 4.88969], ["Culver City California", 34.02112, -118.39647], ["Manhattan", 40.78343, -73.96625], ["Massachusetts", 42.36565, -71.10832], ["Albany", 42.65258, -73.75623], ["Troy", 18.24924, -77.60978], ["Albany", 42.65258, -73.75623], ["Massachusetts", 42.36565, -71.10832], ["Hartford", 41.76371, -72.68509], ["Springfield", 39.80172, -89.64371], ["Sunderland", 54.90465, -1.38222], ["Kansas City", 39.09973, -94.57857], ["England", 44.0, -71.0], ["Clearwater", 27.96585, -82.8001], ["Canada", 60.10867, -113.64258], ["Vermont", 44.00034, -72.74983], ["Vermont", 44.00034, -72.74983], ["Lena", 43.16089, -5.82878], ["Saratoga Springs", 43.08313, -73.78457], ["Massachusetts", 42.36565, -71.10832], ["Maine", 45.50032, -69.24977], ["Barrow", 33.98292, -83.67016], ["Dublin", 53.33306, -6.24889], ["New York", 40.71427, -74.00597]], "not_found": ["Subaru Hadley", "north Adams dot com"], "ep_coords": ["Albany, NY", 42.65258, -73.75623], "in_country": ["Albany", "Washington", "Culver City California", "Richmond", "Kentucky", "Florida", "Florida", "Miramar Beach Florida", "Culver City California", "California", "California", "California", "Los Angeles", "Miami", "Massachusetts", "Albany", "Albany", "Massachusetts", "Springfield", "Massachusetts", "Albany", "Washington", "Culver City California", "U.S", "Richmond", "Kentucky", "Kentucky", "Florida", "Florida", "Miami", "Chicago", "Florida", "U.S", "U.S", "U.S", "U.S", "the United states", "Culver City California", "New York", "Culver City California", "Manhattan", "Massachusetts", "Albany", "Albany", "Massachusetts", "Hartford", "Springfield", "Kansas City", "England", "Clearwater", "Vermont", "Vermont", "Saratoga Springs", "Massachusetts", "Maine", "Barrow", "New York"], "out_country": ["Turkey", "Turkey", "Panama City", "Panama City", "Germany", "Germany", "Yemen", "Yemen", "Diablo", "Spain", "Portugal", "Troy", "Sunderland", "concertina", "concertina", "France", "Utica", "Turkey", "Kabul", "Pakistan Saudi Arabia", "Qatar", "Kabul", "Amsterdam", "Troy", "Sunderland", "Canada", "Lena", "Dublin"], "in_state": ["Albany", "Albany", "Albany", "Albany", "New York", "Manhattan", "Albany", "Albany", "Saratoga Springs", "New York"], "out_state": ["Washington", "Culver City California", "Turkey", "Turkey", "Richmond", "Kentucky", "Florida", "Panama City", "Florida", "Panama City", "Miramar Beach Florida", "Germany", "Germany", "Culver City California", "Yemen", "Yemen", "California", "California", "California", "Diablo", "Los Angeles", "Spain", "Portugal", "Miami", "Massachusetts", "Troy", "Sunderland", "Massachusetts", "concertina", "concertina", "Springfield", "Massachusetts", "France", "Utica", "Washington", "Culver City California", "U.S", "Turkey", "Richmond", "Kentucky", "Kentucky", "Florida", "Florida", "Miami", "Chicago", "Florida", "U.S", "U.S", "Kabul", "U.S", "U.S", "Pakistan Saudi Arabia", "Qatar", "the United states", "Kabul", "Culver City California", "Amsterdam", "Culver City California", "Massachusetts", "Troy", "Massachusetts", "Hartford", "Springfield", "Sunderland", "Kansas City", "England", "Clearwater", "Canada", "Vermont", "Vermont", "Lena", "Massachusetts", "Maine", "Barrow", "Dublin"]}]