[{"month": "10", "state": "CA", "station": "KALW", "content": "That's needed from the hearts of space next year and I wouldn't put seven K. A. L. W. San Francisco\n\n... comes at the end of October the very different celebration of the dark side of the human so it's the time we willingly martial art shows and stories of\nThe supernatural\nAnd rituals we create around\nCredit to the traditional generally goes to our ancestors\nCombined the old pagan harvest celebration of sour\nAnd the exciting nighttime bonfires which has three parts Christian festival of all how to\nHim more than ... commemoration the recently departed souls saints monitor\nWho spirits were said to wander the years that this time of year in search or\nThese traditions are rich creative field for musicians of the dark and being shown [noise]\nThey we've together deep drowned to somebody voices\nWailing frigid gloomy string with a dark galaxy powerful electronic an environmental effects\nTo create truly electro crew stick worlds soundtracks films you'd rather see are\nI'm Steven view on the transmission of parts of space\nGloomy stormy floating dark ambient journey on the program by Canadian Gus producer David J e can comb ghostly shadow\nWe began with some some stories from the environment series\nOn the music by the French ... dark sanctuary pretty lame and while\nThe magic music by the ghost between string Bush\nDark and being a ritual music by\nCounting\nFrom Norway we have a good piece by transfer phobia pronounced memory\nFrom Russian go streets down by the law from start to go see the ...\nMore from ... to\n... own future date\nFrom the u._k. music by based community ghost term magnetic tape\nAnd from finishing it'd be a musician Scott\nGhoulish nightclub orange\nFrom divine intervention\nNear the end just body voices from Los Angeles and be musician due to Benedict checks\nIt can be variation\nIn the primary meditation to do next\nIt took me just told me about the dark and being journey from our\nOn this transmission\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\nOr [noise]\nOr\n\n[noise]\n\nOr\nOr [noise]\n\nOr what\nYou were [noise]\n\n\n\n\n\nRoom [noise]\n\nAnd the world [noise]\n\n\n\n\n\n...\n[noise]\n\n\n\n[noise]\n\n\n\n\nWhoa [noise]\nJeeze\n[noise] ...\nWell ...\n[noise]\n\nLove\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n...\n[noise]\n\n[noise]\n\n[laughter]\n[noise] [laughter]\nTo the to the [noise]\nThe [noise]\nDid this to the [noise]\nThe the [noise] [laughter]\n[noise]\n\n[laughter]\nThe the [noise]\n[laughter]\n[noise]\n\n\n\n[laughter]\n\n\n\n[noise] [laughter]\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\nOoh [noise]\n\n\n\n[noise]\n\n\n\nEasy ...\n\nThe prehistoric days musical instruments we have the flipped the rational and drop\nLater primitive trumpets and ... and from ancient Mesopotamia more than four thousand years ago early members of the quarter some family plus string liars visitors harms and says it's\nString instruments of come a long way since then in Europe boats strings were refined into the violin family we know today why loops evolved into the guitar\nMusic for strings developed along with the instruments and western classical music is rich with variation\nAmong string instruments perhaps the most versatile the cello\nA virtual solo string orchestras\nI'm Steven Hill and on the transmission of hearts of space contemplative music for strings with us\nWe begin with two pieces by Santa Fe New Mexico base jealous Jamie's fever for my title inspiring album turn ...\nFrom England where music by jealous John ...\nLater music by keyboard is composer Michael\nFeaturing Swiss Joe is Martin ...\nIn the deep so Connecticut jealous David Darby with selections from prayer for compassion and does he see a classic dark wood all back plus more by Jamie ...\nThe space shuttle contemplative sounded timeless straight\nFrom the transmission of hearts of space\nMm\n\n\n\n\n\n\n\nYea\n\n...\n\nMm\n\n\n\n\nMhm mhm [noise]\nMhm\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\nMhm\n[noise]\nMhm\n\n", "year": "2018", "show_name": "Music from the Hearts of Space", "city": "San Francisco", "day": "29", "locations": [["electro", 1.6363, -75.61109], ["Norway", 62.0, 10.0], ["Los Angeles", 34.05223, -118.24368], ["England", 44.0, -71.0], ["Connecticut", 41.66704, -72.66648]], "not_found": [], "ep_coords": ["San Francisco, CA", 37.77493, -122.41942], "in_country": ["Los Angeles", "England", "Connecticut"], "out_country": ["electro", "Norway"], "in_state": ["Los Angeles"], "out_state": ["electro", "Norway", "England", "Connecticut"]}, {"month": "10", "state": "CA", "station": "KALW", "content": "\n[noise]\nDebbie see rounds out your revolutions permitted for this Sunday October twenty first\nI bet you do hear some shots to coach tomorrow evening at nine for explorations in music I'm your host David Law to leave for that show were in partnership with ... performances and Dr Robert Greenberg and the Alexander string quartet tomorrow evening at nine\nThe string quartet number ten and a flat major from Nineteen sixty four exploration to music tomorrow night at night I Hope you'll join us for that next two hours of slow music for fast times it's music and the hearts of space here on K. A. L. W. San Francisco\n[noise]\n\n\n\nThis could be the sound of tissue there but I'm ... and then that's it we're we're coming up on their time after all [noise] but no it's the ... to a journey into the cooling darkening deepening soundscape [noise]\n\nIt's time to join the animals and prepare for a long winter time to focus planned in complete those lingering projects\nCan get together with friends you missed over to suffer [noise] I'm Stephen ... transmission of hearts that space seasonal electronic journey from the Washington soundscape when the program called descending dark too [noise]\n\nBeing left to selection spice sleepy town manufacture the project of Russian electronic music\nAnd music by so the collaboration in California we used to shoot down together and Serbian or electronic musician stream your mother\nFrom a on friday we music by tendency musician Paulina catch the from drawing up a storm automatically spheres by Washington state recording artist Deborah Martin from the wizard\nAnd the general lodging drift by Burma ... comes guys later to extend the elections by better in Germany synthesis Clarence shoots\nFrom silhouette\nElectronic sink you turn by sharing space the project to New York state musician Craig chain from second\nAll that much in the champagne by by pool right from the cage [noise] and electronic journey the Washington Sandusky descending dark to Mr ... parts of Spain\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n...\n\n\n[noise] [noise]\n[noise] [noise] [noise]\nOh\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise] [noise] [noise]\nMm\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise] [noise] [noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\nYou know [noise]\n\nA\n[noise]\n\n\nA\n\nLa [noise]\n[noise]\n\n\nI'm [noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\nNo [noise]\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\nUh\n\nUh\n\n\n\n\nUh\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou know a\n\nOr\nLa la la la\nLa la la la la la la\nLa la\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise] [noise]\n\n\n[noise] [noise]\n\n[noise]\n\nAnother hour ... music for fast times music from the hearts of space just ahead you're on the listener supported Ninety One point seven K. A. L. W.\nJust sending you to be honored soundscape we returned to the slower darker burn just electrons to stick sounds of the cease Joe piano electronic keyboard\nIt's time for descending progression this dark trying to monitor key harmonies just to get 'cause the shorter days declining money after the fall put\nI'm Steven Chu and under the transmission it's hard to space and they beat Germany ... off on a program called totally dark for [noise]\nWe set to seems music by two story and ... and by just pure for the compilation ...\nWe music by Tucson musician ... from why do you buy the Italian trio Sherry from countered it down\nMusic by Richard them from\nImages from a parallel world by NBA et cetera narrow but from cheap one through living\nAnd finish it would be the poster yawn pretty smart from quiet places\nIt's been since ... early ...\nFrom the dark for the transmission of hearts of space [noise]\n\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\nOh cool [noise]\n[noise]\nAnd\nAh and\n[noise]\n\n[noise]\nWho or [noise]\n\n\nMm\n[noise]\n[noise] ah\nNah\n[noise]\n\n[noise]\nUh\n[noise]\n\n\n\n\nAnd\nUm [noise]\n[noise]\n\n[noise]\n\n...\n[noise]\n\n[noise]\n\nUh uh\nOn on uh\n[noise]\nM M M E\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\nMm\n[noise]\n\n[noise] [noise]\n[noise]\n[noise]\n\nSo [noise]\n\n\n\n\n\n\n[noise]\n[noise]\n... [noise]\nYou know they're going to\n\nShips six [noise]\n\n\n\n\n\n\n\n\n\nOr [noise]\n\n\n\nOwn [noise] or\nWork [noise]\n\n\n\n\n...\nWhen she gets to be [noise]\n\n\n\n...\n[noise]\n\n\n... ... email or [noise]\n...", "show_name": "Music from the Hearts of Space", "year": "2018", "city": "San Francisco", "day": "22", "locations": [["Washington", 38.89511, -77.03637], ["California", 34.68743, -116.78467], ["Paulina", -32.05, -55.4], ["Washington", 38.89511, -77.03637], ["Germany", 51.5, 10.5], ["New York", 40.71427, -74.00597], ["Spain", 40.0, -4.0], ["Germany", 51.5, 10.5], ["Tucson", 32.22174, -110.92648]], "not_found": [], "ep_coords": ["San Francisco, CA", 37.77493, -122.41942], "in_country": ["Washington", "California", "Washington", "New York", "Tucson"], "out_country": ["Paulina", "Germany", "Spain", "Germany"], "in_state": ["California"], "out_state": ["Washington", "Paulina", "Washington", "Germany", "New York", "Spain", "Germany", "Tucson"]}, {"month": "10", "state": "CA", "station": "KALW", "content": "Nine PM and tomorrow the string quartet number eight in C minor opus one ten written in Nineteen sixty I Hope you'll join me then\nYou've been listening to revolutions per minute a local public radio KLW San Francisco where two hours or slow music for fast times is yours now it's music from the hearts of space\n[noise] [noise]\n[noise] Mm\nFrom the prehistoric days of musical instruments we have the flute the\nLater primitive trumpets and ... and from ancient Mesopotamia more than four thousand years ago early members of the quarter phone family plus strings Myers is if there's ... and ...\nString instruments of come a long way since then in Europe boats strings were fined into the violin family we know today well lose devolved into the guitar\nMusic for strings developed along with the instruments and western classical music is rich with variation\nAmong string instruments perhaps the most versatile was the cello\nA virtual solo string orchestra\nOn the transmission of hearts of space contemplative music for strings with a focus on the shuttle program called\nTo begin with two pieces five Santa Fe New Mexico based checklist Jamie fever\nFor my title inspiring album\nFrom England where music by Charles Johnson cue from lucent dream [noise]\nLater music by keyboard as composer Michael hot\nAnd the details Connecticut jealous David darling with selections from prayer for ... patch and does he see a classic dark wood or back plus more by Jamie cheaper\nThis spacious contemplative sounded turns straight\nFrom the streets mushy parts of space [noise]\n\n\n\n[noise]\n\n\n\nMhm\nMhm mhm\nMm mhm\nMm\nMhm\nMhm\n\n...\n\n\n[noise]\n\n\n\nMhm mhm\nMhm\n[noise]\n\n\n[noise] mhm\n\n\n\nMhm\nMhm\nMhm\n\n\n\nI'm David lot you leap inviting you to join me tomorrow evening for explorations in music\nIf you'd like to discover or explore the music of Dimitri shots to cove which\nAre beginning our second delve into the life and times of Soviet composer Dimitri shots to coverage tomorrow evening at nine will be the string quartet number eight in C minor\nWritten in Nineteen sixty Alexander string quartet and the always enlightening music historian Robert Greenberg will be your guide\nTo explore music tomorrow evening explorations of music nine pm here on KLW hope you can join us but we can do now with slow music for fast times\n[noise]\nWhat's in it grew\nIn music the term usually describes are repeating rhythm pattern that creates a cycle of movement in the sense of proposed shut the word has been used in jazz since the Nineteen thirties\nA cruise ship and keeps you dance music around the world for centuries and or an element of many popular genre and Swiss musician darn league has taken the concert far they're\nWorking before the cost curve rhythms and federal changes in phrasing create change your perceptions of time and space his work was often described as reductive or minimum [noise]\nI'm Steven Hill and on his transmission of parts of space waves lower minimum rhythms and the ambient patterns on a program called minimum grew [noise]\n\nWe'll feature Dr amusing ... multi instrumentalist on leave from his albums Fifteen square and Kuhn post jazz traumatic urban ambient by Southern California do require ride our\nFrom slow feels they debated for atmospheric and being from New York by advertising Bill Ayers well from now style jak\nLater the minimal space jazz by New York city trombone is Nelson fold in Berlin based musician Tomlin pretty still live\nIn wind to prove percussion influenced by the ground my daughter said tore from invisible rhythms and an extended dream world by Japanese percussionist and composer me Dorie Jakarta\nFrom through the looking glass\nAll that plus more by our cars and go as well from now ... center preserve donnelley's music from Fifteen square [noise]\nThat time morphine and the rhythms are minimally grew on this transmission of hearts of space [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\nDue to\nTo be\nDue to [noise]\nRead\n\n\n\n\n[noise]\n[noise]\n[noise]\n\nOr\n\n\n[noise] [noise] [noise]\n[noise]\n\n\n[noise] it was\nOf\n\n[noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n\n\n[noise]\nMm [noise] or a row row\nRow row [noise]\n\nYou\nIn in in the\n\nAlong with\nThe [noise] you know\nOr\nThe [noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\n\n\n...\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\nMhm [noise]\nMm\n\n[noise]\n\n\n[noise]\n\n\nMm\n[noise]\n[noise]\n\n[noise]\n\n\nMhm\n\nMhm\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\nLa la\nLa la\nLa la\nLa\nLa\n\nLa\n\n\n\n\nLa la la\nLa\n\n[noise]\nUm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe [noise] the [noise]\nThe [noise] he was [noise]\nWas\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\nMm [noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n", "show_name": "Music from the Hearts of Space", "year": "2018", "city": "San Francisco", "day": "08", "locations": [["San Francisco", 37.77493, -122.41942], ["England", 44.0, -71.0], ["Connecticut", 41.66704, -72.66648], ["New York New York", 40.71427, -74.00597], ["Berlin", 52.52437, 13.41053]], "not_found": [], "ep_coords": ["San Francisco, CA", 37.77493, -122.41942], "in_country": ["San Francisco", "England", "Connecticut", "New York New York"], "out_country": ["Berlin"], "in_state": ["San Francisco"], "out_state": ["England", "Connecticut", "New York New York", "Berlin"]}, {"month": "10", "state": "CA", "station": "KALW", "content": "Tuesday October sixteenth at seven PM information that J. C. C. S. F. dot org forward slash arts\nTwo hours of slow music for fast times is next year I'm Ninety One point seven KLW San Francisco it's music from the hearts of space\nYeah well\nOh man\nOh no\n\nAnd he\nHe\nOh snow Mm\nMm\nIn thirty five years of parts of space there's only been a handful of occasions when we devoted an entire prove to a single ... composition\nThis week we do it again with the ... collaboration between Iranian singer Marcia for doctors and Norway fifty\nVoice screw choir under the direction of Parenthood argue with music and arrangements for the great the region pianist toured goose ... from the album ... fair in the mirror\nIt's a journey across time and space and culture a moving encounter between traditional Persian songs reaching church music\nA program ... meets nor the transmission of hearts of space\nOh [noise]\n\nOh oh [noise]\n[noise] [noise]\n\nHe showed\n\nMe\nAll ... around\nThe how\nDo they know\nThe name\nYeah inch today\nYeah Joe Main dining yeah no\nNo no no no\nNo\nNo\nThe the\n... in\nThe ... role in\nThe morning\nShe nodding bones girl\nTo\nReally hard\nUm you\nA ... a\nI'm\nNo\nI'm\n\nA long chain la la la la ... yo\nYo man no then\nHe'll say to yo yo\nYo man woman and you know oh\nNo\nNo no\nNo no no no no no no no\nNo\nA like a\nSure we know that they\nStill pretty young man\nThey they ... they say\nThey ain't got no\nHe he says\nGo\n\nGo go go\nGo do that both\nDumb chain sure both I'm Jane well of course\nBut\n[noise]\n\n\nUm you know we're all he does that mean that the people on the drawing the\nGold for each language\nSo I Know really the cage you\nKnow he the\nBall in the uh [noise]\nArabians [noise] ...\nFrom one day\nBe given these people\n\nWho\nCome from China\n... I'm\n...\nA I'm a a\nNo no no no no no no no no no no no\nCan\nGo how did he jump right now for the\nCall my ... D you know\n\n... ... ...\nThat meant that he'll\n\n\n\nBe mhm Mm\nWhen when you get in the ...\nHe had a ball\n\nPoint you're getting the money the more\nOn on me\nBut the thing that has led me to um [noise]\n\n\nThe\nThe the ... on the ...\nCentury bombing run now don't we may not prove that number on it you know the\n\nHe\n\nHopes to me\n\nThe key\nTo\nMove now to be on the trading we know the\nMom no no no\nHe made me really\n\nTrying to\nDo when I\n\n\nJoined the new\nOne on me\n\n[noise] you\nKnow\nYou mentioned the\n... to ... let me know ...\n\n\nHere in the um [noise]\n\nThey came here from the point\nDo none\n\nI just had everybody\n[noise]\nI'm\n\n\nFathers\nOn a\n\n\n\n\n\nCalling\nBecause\n\nI'm\nReally [noise]\n\nYou know\n\n\nDo\nKnown\n\nFor\n\nMovie for\nI'm [noise] I'm\nKnow I'm I'm\nA I'm\nA\nI'm a I'm a I'm a\nI'm a I'm a new school\n\nFor\nFor a long time ago um\nDo\nOh\nOoh [noise]\n\n[noise]\n\n... he ... he can well well what did\nShe didn't know that you know\nThe ...\nHe was ... she\n... the thing\nIs he going to\nFall she\nShe or he\nIs he or she should pay ...\n... ... he\nWas ... yeah\n[noise]\nOh [noise] oh [noise] oh\nA woman\nMaybe he didn't he didn't he\nDidn't he didn't he\nDidn't he\n\nYou do a long time\nNo ... no\n...\nNo ... well no no no\nDa da\nDa da\n\nDa\nOh my God I\nUh I'm a\n\n\n\nShe no she didn't know too\nMany na\nNa\nNa ... no ... but he he\n... plenty\nNa plenty ...\n... ... ... yeah\n\n\n[noise]\n\nUm [noise]\n\n[noise]\n\n[noise]\nOoh\n[noise] um\n[noise]\n\n\n... na na\n\nToo in a\n...\nPoint\nLead you know a\n... she\nCalls\nMe he ... na\nNa na\nNa\nNa na na na\nNa na na ve a na\nNa na\nNa na na na na na na na na\nNa ve now that's not the\nNa na na na\nNa ... the men who are doing\nAll the people who can go now\nI'm a I don't know how\nMuch we can [noise] you know I'm In Minnesota\nKind of [noise] I mean [noise] you know\nAt K. A. L. W. dot O. R. G. something you can do any time on your desktop laptop mobile device\nCheck it out at K. A. L. W. dot O. R. G.\nOne of the core experiences of ambience electronic space music and the feeling of weightless floating\nThe subtle sounds seem to be material crisis expand our personal space and slower sensitive term\nIt's kind of magical for many of us are we pleasurable even the dictator\nSince the introduction of mass produced electronic instruments in the Nineteen seventies anybody can create floating textures but even if you're just a listener\nThe experiences widely enjoyed and often described in therapeutic terms as relaxing healing and transformative\nI'm Steven Hill during these transmission of hearts of space and other anti gravity journey on the electronic way\nFloating world to [noise]\nWe'll feature floating soundscapes by veteran Connecticut multi instrumentalist ... from mindful\nIn music by Norwegian electronic musician Eric ...\nFrom ... point\nWe have contributed electronics by Oregon keyboard and Howard given in California synthesis creek deer\nFrom my flows water\nMore by our lab dreams from my from\nRefined introspective electronics by Florida ... musician so we're we're Christian from wherever\nAnd a floating soundscape price than it's been since his next door to go from not turns to\nPlus the final selection bipolar dream is from mine for\nWaitress electronic soundscapes\nFloating world to\n\n\n\n\n\n\n\nOr\n\n[noise] uh-huh\n... [noise]\n\n...\n[noise]\n\nIn the middle of the news\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n[noise] [noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n...\n\n[noise]\n\n\n\n[noise]\n\nThe ...\n\n\nOh [noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\nJeeze\n[noise]\n\n\n\nJeeze [noise]\n\n\n", "year": "2018", "show_name": "Music from the Hearts of Space", "city": "San Francisco", "day": "15", "locations": [["San Francisco", 37.77493, -122.41942], ["Norway", 62.0, 10.0], ["China", 35.0, 105.0], ["Minnesota", 46.25024, -94.25055], ["Connecticut", 41.66704, -72.66648], ["Oregon", 44.00013, -120.50139], ["California", 34.68743, -116.78467], ["Florida", 28.75054, -82.5001]], "not_found": [], "ep_coords": ["San Francisco, CA", 37.77493, -122.41942], "in_country": ["San Francisco", "Minnesota", "Connecticut", "Oregon", "California", "Florida"], "out_country": ["Norway", "China"], "in_state": ["San Francisco", "California"], "out_state": ["Norway", "China", "Minnesota", "Connecticut", "Oregon", "Florida"]}, {"month": "10", "state": "CA", "station": "KALW", "content": "[noise] [noise]\n\n[noise]\nDescending into the Arctic soundscape we returned to the slower darker burnish to lectures to stick sounds of the cease jello piano electronic keyboard\nIt's time for descending progression dark drums in minor key harmonies is the music yeah 'cause the shoulder days declining right after the fall and we put\nI'm Steven Chu and one's transmission of parts of space and they beat Germany ... on on a program called only dark for [noise]\nWe set the scene music by two story in ... in by just pure from the compilation possibilities you some circumstances\nWe music by Tucson musician Jeff Greene from wide view and by the Italian trio ... from ...\nIn the deep some music by Richard Bone from images from the parallel world by NBA et cetera narrow but from chain went through a living\nAnd by finished champagne composer young to be sworn into from quiet place\nTo be just since the early ...\nFrom the dark for\nThe transmission of arts space [noise]\n\n[noise]\n\n\n\n\n\n\n\n[noise] [noise]\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\nNah\nNah [noise]\n\n[noise]\nUh\n[noise]\n\n\nMm [noise] [noise]\n\n\nAnd ah [noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\nNah\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\nUm\n[noise]\n\n\n\n[noise] [noise]\n[noise]\n[noise]\nUm [noise] [noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\nThere were no oil [noise]\n\n\nOr you know what's\nGoing on you know [noise] [noise]\n\n\n[noise]\n\nWhat was going on or something you know\nSome of the oil or whatever that\nThey will be the other hand [noise]\n\n\n\n\n\nOil\n[noise] ah\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\nTo [noise] during the winter this winter is\n[noise]\n[laughter] average [noise]\n\n\n\n\n\nJeeze [noise]\nUh [noise]\nUh\n[noise]\n\n\n\n\nWhoa\n[noise]\n\n\n\n... [noise]\n[noise] ... visitors she'd be [noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\n\nThe toilet on Monday by the record shelf with Jim Schrader and relevant tone is tomorrow we need to let him which will feature music inspired by the boundless creativity of nature [noise]\nIt's your musical Ninety One point seven KLW thanks for being with us tonight and always thank you for supporting local public radio\n\nWas tied bell was an innovator and entrepreneur who created the diaries series of ambience\nHe perfected the concept of functional therapeutic background sound\nOnes can bearing his recordings\nTo a bar so [noise] I Do realize that nature sounds had a soothing Carmen restored as quality so concentrated on ocean waves slowing stream these birds insects wind and rain [noise]\nListening to nature sounds takes us back to pre industrial pre electronic media time where we spend hours every\nDay immersed in natural sounds resigned was in fact this fair to say that are stereoscopic sharing systems evolved to guide position and protect us and the natural environment where characteristics provider type ... one man record labels seem tonic research\nIs obsessive persistence technical talent genius for branding and marketing and over the top buzzwords film\nCopy writing led to the first commercially successful series of ambient sound recordings the day the relief to Nineteen sixty nine was an ocean recording which he branded let's psychologically ultimate seashore\nAgain storm on\nThere was a hit picked up by a major labels and sold millions which gave him the freedom to expand his idea into his series\nTie bell was in the purest when he couldn't get her realism recording the fittest concept you turn to assign to sprint at Bell Labs and created electronically on an early IBM mainframe\nUntil recently as workers in almost forgotten artifact of the Nineteen seventies\nBut according to a profound by ... Atlas Obscura darn calm\nTry bell was the transition between the Nineteen sixties era Muzak mood music and cheesy sound effects records and the Nineteen eighties era of new age atmosphere and being music and Brian Ito and not coincidentally parts of space\nThe original environments therapies and later CDs were out of print for years but recently they appeared on the phone catalogs streaming services like Spotify and apple music\nNot only that thanks to new age sound historian Douglas ma gallon and the numeral group reissue label you can now buy the complete environments catalogue of twenty two long form ambient nature recordings for just two Ninety nine as a map making experience\nAffordable personal portable and accessible even when you're off last [noise] it's so effortless to play them in the ass that it encourages more use experimentation and appreciation [noise] how cool is that\nI'm Steven Hill and on his transmission in parts of space a celebration of the pioneering ambience are recordings of earth tied balance in comic research\nOn the program called environments\nWe'll feature selections from six to know the environment series recordings tracking the sounds of the day from Don tonight and beyond into contemplative environments for digital bells and coral voices the general world of natural hand being Sam\nEnvironments on this transmission of hearts of space [noise]\n\n\n[noise]\n\n\n[noise] [noise]\n\n\n\n[noise] [noise] [noise] [noise]\n\n\n\n\n\n\n\n\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\n\n[noise]\n[noise] [noise] [noise]\n[laughter]\n\n\n[noise] [laughter]\n\n\n\n\n[noise]\n[laughter]\n\n[noise] [laughter] [noise] [laughter]\n\n[noise]\n\n\n\n\nYeah [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise] ...\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n[laughter] [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\nDo\n\n\n\n[noise]\n\n\n\n\nUm [noise]\nOr [noise]\nOr [noise]\n\nOr um [noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\nUm [noise]\n\nUm [noise]\n[noise]\n\n\n[noise] [noise]\n[noise]\nUm [noise]\n\n\nUm\n\n[noise] [noise]\n[noise]\nUm [noise]\n\n\n\n\n[noise] [noise]\nOh what\n\nDoes any of them you know man ah\nAnnie\nI\n\n\nGather all\nAround [noise]\nAnd a\n\nAnd then ah a\n\nBoy and you know and you know", "year": "2018", "show_name": "Music from the Hearts of Space", "city": "San Francisco", "day": "01", "locations": [["Germany", 51.5, 10.5]], "not_found": [], "ep_coords": ["San Francisco, CA", 37.77493, -122.41942], "in_country": [], "out_country": ["Germany"], "in_state": [], "out_state": ["Germany"]}]