{"month": "10", "state": "PA", "station": "WVYA", "content": "Not report co in next as your host right after the news from National Public radio on your arts and information station W. V. I. A.\nThis is W. B. I. eighty nine point not FM W. V. I. H. D. one scratching Wilkes Barre Hazelden WTY eighty nine point seven Williamsport WTO eighty eight points ... Mansfield at least one of the ... W. P. A. U. Ninety One point five FM Palmyra township\nTranslators W to walk to a T Clark summit W to eight nine ... sundry W to zero seven eight Williamsport end up to seven eight ... wells borough listener supported public radio [noise]\nMillions of us grew up with Mr Rogers on PBS and now to celebrate the fiftieth anniversary of Mr Rogers neighborhoods WPRI and the greater ... valley United Way and the daily item invite you to the movie won't you be my neighbor Tuesday October night six PM in the capital cedar Lewis burn it's free first come first served\nFree small popcorn and drinks and her win prizes from WBAI anti again on or Mr Rogers by bringing a sweater to be donated to community aid October night with W. V. ...\nOn the next fresh air Michael Lewis author of the best selling books the big short and Moneyball has about his new book is this risk it looked at the federal government under President Trump is focusing on Trump's department of energy agriculture and commerce and how unprepared they are now to deal with urgent risks join us [noise]\nThis evening at six after all things considered on W. V. I. A. F. M.\n\nProgramming on WB I made possible by our members and by Pennsylvania College of technology thinking about college hoping to land a great job after earning your degree think Pennsylvania College of technology\nWith one hundred plus bachelor an associate's degrees an exciting career fields industry standard labs in uh Ninety six percent graduation placement rate pen college is perfect for hands on learners visit P. C. T. dot edu to learn about Penn college degrees that work\nLive from NPR News in Washington I'm Laurie London Senate majority leader Mitch McConnell says the Senate will vote by the end of the week on Brett Kavanaugh's nomination to the Supreme Court\nNPR's Kelsey Snell reports the vote will follow a deadline for the FBI to complete its investigation into allegations of sexual misconduct\nBy Kavanaugh the FBI has until friday to investigate allegations against Kavanaugh but the process could take less time their mandate is to investigate any current credible claims of misconduct Democrat to criticize that definition it too vague and so far it's\nThe Senate will vote by the end of the week on Brett Kavanaugh's nomination to the Supreme Court NPR's Kelsey Snell reports the vote will follow a deadline for the FBI to complete its investigation into allegations of sexual misconduct by having all\nThe FBI has until friday to investigate allegations against Kavanaugh but the process could take less time their mandate is to investigate any current credible claims of misconduct Democrat to criticize that definition is too vague and so far it's unclear who will be interviewing the probe\nDemocrat the Republican leaders are constraining the investigation and have criticized the process an incomplete button McConnell's pushing back\nBelow some terrible or Mr programs you can practically hear the south of the Democrats moving the goalposts\nHe's not setting exact day for a final vote Kelsey Snell NPR News Washington\nFour days after a magnitude seven point to earthquake and tsunami on the Indonesian island of ...\nThe situation remains dire the death toll is already above twelve hundred NPR's Julie McCarthy is in Indonesia traveling with an army aid and security convoy to the heavily hit city of ... near the epicenter or casualties are likely to increase\nWe're oh well there's a high one that holds the cold as we move more\nApollo all the roads are decent condition it started to rain or which sort of added to the misery here\nThere's not a lot of traffic coming back out on what you would have expected because a lot of people are trying to leave however there is no gasoline to do that and so people really there's this sense of feeling trapped\nShe says there's no water no food and aftershocks continue sixty five thousand homes were destroyed but more than a million people have been affected [noise]\nThe Nobel Prize in physics has been awarded to three people for their work in advancing laser technology NPR's Geoff Brumfiel reports the prize winners included female recipient for the first time in fifty five years\nEven Donna Strickland the winter herself seemed surprised to learn how few women have won the prize she was asked about it in today's press conference\nYou are the second woman ever getting the Nobel Prize in physics\nOften what your comments on that\nOkay I thought there might have been fact\nStrickland in charge more route one for their work creating a high intensity ultra fast laser pulses the prize also went to Arthur asking for his work using lasers this tweezers to pick up and move tiny objects Geoff Brumfiel NPR News this is NPR\nIran state news media is providing clues about what could be responsible for natural gas pipeline explosion in southwestern Iran NPR's Peter Kenyon reports the incident occurred in the same province where a gunman opened fire on an Iranian military parade\nThis day run for news agency quoted a disaster response official as saying a gas leak sparked a fire in the Quds is done is behind pipeline you said firefighting crews were dispatched to put out the blaze and the situation is under control\nNo cause for the league and fire was immediately announced it occurred in the same province were shooting attack last month killed at least twenty five people attending a military parade in the city of all was an Arab separatist group an Islamic state claimed responsibility to run retaliated on Monday firing missiles into eastern Syria near the border with Iran\nPeter Kenyon NPR News Istanbul\nMillennia traumas arrived in ...\nIt's behind pipeline he said firefighting crews were dispatched to put out the blaze and the situation is under control\nNo cause for the league and fire was immediately announced it occurred in the same province were shooting attack last month killed at least twenty five people attending a military parade in the city of all was an Arab separatist group an Islamic state claimed responsibility\nTo run retaliated on Monday firing missiles into eastern Syria near the border with Iran\nPeter Kenyon NPR News Istanbul [noise]\nMillennia traumas arrived in ... she begins her first major solo international trip as first lady down as first lady Rebecca\nA coup fell on do welcome sure American counterpart to the west African nation where Mrs Trump with greeted with dancing and drumming and schoolchildren waving many us and gone and flags\nThe first lady visited a hospital neonatal intensive care unit before going to the presidential palace for it to be with\nA coup so I Do she plans to promote child welfare during the five day trip\nWhich also includes visits to allowing\nKenya and Egypt Hi Lori London NPR News in Washington\nSupport for NPR comes from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial well\nBeing first learn more ed Raymond James dot com\nWe're expecting rain this afternoon here is the weather forecast Ninety percent chance of rain through two nights we could also see some thunderstorms that may produce gusty winds and heavy rainfall\nThe regular taper off overnight and we'll have some patch you thought forming in the early morning hours highs this afternoon on the mid seventies overnight lows around sixty\nTomorrow mostly Saudi ... and the low seventies Wednesday night losing the upper fifties been partly sunny Thursday hides in the upper seventies in Bethlehem warm for this time of year Seventy seven degrees homes Dale Seventy two Seventy three in Williamsport Seventy four here at the W. V. I. A. studios\nProgramming on W. V. I. is made possible by our members we thank you for your support numbers and by the Home Depot the next generation of home improvement with everything you need to do projects smarter the Home Depot more saving more doing\nGood afternoon I'm Larry void go thanks so much for tuning in this afternoon and coming up a little bit later we have a piano sonata by Mozart some music of Johann Strauss know you'll have struck the waltz king it was on this date that he took over his dad's orchestra\nAnd a civil mark that date also we have a a sweep buys open called die a from a a stage work and the orchestral sweet is actually more famous than the opera\nWe begin with a student work by a composer who made his career as an opera composer though uh ... uh most of his operas do not get performed just especially in the United states his name out of ... and he studied Munich\nWith the use of rain burger was while he was studying with that other composer um that he wrote this next piece so he was about\nSeventeen or Eighteen when he wrote this Seventy four string orchestra here's the Frankfurt radio symphony under Allen Francis and music of a model vote photo ID\n[noise]\nWhile he was studying with that other ... those are um that he wrote this next piece so he was about Seventeen or Eighteen when he wrote this ... for strings orchestra here's the Frankfurt radio symphony under I wasn't friends with the music of a model votes on the [noise]\nMhm\nReally is\n\n\n[laughter]\n\n\n[noise]\n\n\n\nMm\nMm Mm\n\n\n\nMm Mm\n... Mm\n\n\n\n[noise]\nMm Mm\n... Mm\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\nNo\n\n\nMm\n\n\nA long long\n\nMm\n\nMm\n\n[noise]\nMm\n[noise]\n\n\n\n\n\nMhm\n...\n\nGuy\n\n[noise]\n...\n\n\n\n\nWill\n\n\n\n[noise]\n[noise]\n[noise]\n\nThe one who only debate between the governor Tom Wolfe and his challenger Republican Scott Wagner tune in\nThis was W. B. I. nine point nine of them W. B. I. H. D. ones granted Wilkes Barre his will and we're in Williamsport at W. B. Y. eight eighty nine point seven FM you'd Mansfield a W T I O eighty eight point three of them were like well I'm pop back a W. P. A. U. Ninety One point five of them\nStreaming live a W. V. I. A. dot org we have a translator in Clark summit at ... three of them you're arts and information station listener supported public radio W. V. I. S.\nOn Shakespeare uncovered by do nothing in the well whether the tenant ... Shakespeare's most popular pain the opening just as we are and we are all in as the original romantic comedy\nCan be a small and intelligent and it's what you want but until you open yourself to a motion me another accent\nMuch ado about nothing Helen Hi I\nOn Shakespeare in ... [noise]\nFrom years October ... wealth at nine O W movie on a TV [noise]\nFrench Schubert wrote some of history's greatest arts on but those are hardly his soul contribution to vocal music and the next Chicago Symphony orchestra broadcast because ... conduct Schubert intimate math and eat flat nature\nAlso music my neighbor and Wagner next time with the CFL ...\nUnder your ten pm on W. B. R. A. about\n\nProgramming on WB I made possible by our members and by Pennsylvania College of technology thinking about college hoping to land a great job after earning your degree think Pennsylvania College of technology with one hundred plus bachelor and\nBecause ... conduct Schubert intimate math in e flat nature also music my neighbor and Wagner next time with a CSL ...\nUnder your ten pm on W. V. all day of\n\nProgramming on WB I it was made possible by our members and by Pennsylvania College of technology thinking about college hoping to land a great job after earning your degree think Pennsylvania College of technology\nWith one hundred plus bachelor an associate's degrees an exciting career fields industry standard labs in uh Ninety six percent graduation placement rate pen college is perfect for hands on learners visit P. C. T. dot edu to learn about Penn college degrees that work\nLive from NPR News in Washington I'm Laurie London President Trump is again answering questions about Supreme Court nominee Brett Kavanaugh he spoke to reporters just before departing the White House for Philadelphia\nWhile I say that it's a very scary time for young men in America when you're going to be a sea of something that you may not be guilty of which is a very very very difficult time\nThe FBI meanwhile continues to investigate allegations of sexual assault and misconduct against Kavanaugh even as Republican schedule a vote and pears Windsor Johnston reports the agency is working toward a friday deadline to release the findings of its weeklong probe\nThe FBI has interviewed friends of both have it all and his initial accuser Christine Blasey Ford\nThe agency has also spoken with a second woman who claims Kavanaugh exposed himself to her at a college party in the Nineteen eighties Democrat Chris Coons who sits on the Senate Judiciary committee and says all sides need to brace for what ever comes to light\nAgreeing that we should have a week for a Folsom but time and scope prescribed FBI investigation we have to recognize raises the possibility of Kevin are being cleared and the possibility of Dr Ford being corroborated\nSenate Republicans say a vote on Kavanaugh's confirmation will come later this week winter Johnston NPR News the\nPentagon says it has detected suspicious substance on to ... that arrived at its mail screening facility NPR's Greg Myre e has more on this investigation\nThe Pentagon says the envelopes were discovered on Monday at the building where all incoming letters and packages are checked the building is on the Pentagon ground but not inside the Pentagon itself\nThe FBI says its agents took control of the two letters on Tuesday Morning and the bureau is conducting a more detailed analysis\nNeither the Pentagon or the FBI has officially identified the suspicious substance all other male that arrived at the Pentagon facility on Monday is currently under quarantine Greg Myre NPR News Washington\nSenator Bernie Sanders who has been a longtime critic of Amazon's pay practices is saluting founder Jeff Bezos for announcing that all employees will now be paid at least Fifteen dollars an hour\nToday are want to give credit where credit is due in our water congratulate Mr ... we're doing exactly the right thing\nAmazon's wage increase takes effect November first ... says it will have a significant impact on employees and their families Amazon is among NPR's financial supporters\nOn Wall street stocks are rallying for a second straight day the Dow is up a hundred and sixty six points the S. and P. five hundred gains for this is NPR\nToday marks one hundred and\nAnd I want to congratulate Mr ... those were doing exactly the right thing\nAmazon's wage increase takes effect November first ... says it will have a significant impact on employees and their families Amazon is among NPR's financial supporters on Wall street stocks are rallying for a second straight day the Dow is up\nA hundred and sixty six points the S. and P. five hundred gains for this is NPR\nToday marks one hundred and forty nine years since the birth of ...\nNPR's Lauren Frayer in ... by says this is a national holiday in India and people are celebrating the life of the activist and champion of social justice known worldwide by the honor effect Mahatma Gandhi [laughter]\nTo Bollywood style flash mob and Mumbai train station on a beach nearby volunteers\nSaying the national anthem before picking up trash prime minister Narendra Modi bad before gundy memorial and the capital New Delhi\nSchools are out offices shut many spend the day volunteering as part of a twenty billion dollar government campaign called swatch bar at clean India its logo is ... signature wire frame glasses\nAnd a coma Nathan is hundred fiftieth birthday next year un secretary general Antonio ... here for a conference on sanitation when Gandhi's priorities for India\nLauren Frayer NPR News Mumbai\nThe twenty Eighteen American music awards will open with a performance by Taylor Swift her first award show performance and nearly three years the singer made the announcement today on ABC's Good Morning America Dick Clark productions set swift will thing I did something bad from her reputation album\nLifted up for artist of the year alongside Ed Sheeran imagined dragons and post Malone show airs live on ABC\nOctober ninth this is NPR News\nSupport for NPR comes from NPR stations other contributors include farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs coverage options and more information can be found at farmers dot com and the ... e Casey foundation\nIn the weather forecasts looked for rain through the afternoon and evening hours we could see some thunderstorms with a heavy downpours and then patch you fog forming after midnight lives will be around sixty degrees\nAfter the fog live tomorrow morning we'll it mostly sunny skies ours on the lower seventies that will be partly cloudy Wednesday night losing the upper fifties and partly on the on Thursday holidays in the upper seventies Allentown Seventy eight Mansfield sixty eight Lewis perks Seventy four in Wilkes Barre Seventy five degrees human beings\nAre made up of just four letters a G G G the same for litter the the ... billion of letters of code if you had every pitch filled with ... g's and T's you'd have the hundred dictionaries worth of genetic code\nAnd that code decides who we are a guy rise that story next time on the Ted radio hour from NPR [noise]\nSaturday afternoon or W. B. R. A. up on Larry ... thanks for joining me a piano Sedona by Mozart coming up we'll also hear on the composer staple can we open up the of today we'll hear about a composer who helped make a lot of people laugh\nAnd it was on this day that the wall scheme Johann Strauss the younger took over the orchestra from dad we go back to this\nDo you beyond a up on Larry ... thanks for joining me a piano sonata by Mozart coming up we'll also hear on the composer tape up when we open up the uh that today we'll hear about a composer who helped make a lot of people laugh\nAnd it was on this day that the wall scheme Johann Strauss the younger took over the orchestra from dad we go back to the leader Meyer period and all this Gen till it again the string trio by Franz Schubert played by the Vietnamese strength ... W. B. I.\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\nMm [noise]\n\nMm [noise]\n\n\n\n[noise] [noise]\n[noise] [noise]\n\n\n\n\n\nPut string trio would be ... to ... which got along number five eight one like by the beginnings string trio on WB I Would guess thanks so much for joining in coming up with a a recital a concert by classical guitarist traced to ask you this is one of the many offerings\n\n\nThe string trio and be flattered shoe bird in the George catalog number five eight one play by the ... string trio on W. vi I'm every Ford go thanks so much for tuning in\nComing up with a a recital a concert by classical guitarist Jason ... this is one of the many offerings of the Dietrich Caesar in Tunkas panic and uh he plays a varied program of classical guitar from mocked Brazil to ... Beatles to Broadway and more\nThat's coming up on a Sunday the satellites that three in the afternoon at the Dietrich theater in tongues tech\nAnd if your taste rent or something with a a bit more a sound then you won't want to miss [noise]\nThe Williamsport symphony orchestra conducted by maestro Edelstein opens October sixteenth with works by Racine each ... and Brahms\nGrammy nominated in charge shopping violinist Caroline Golding plays Chuck ... violin concerto [noise]\nSports symphony October sixteenth humidity art center five seven zero three to six twenty four twenty four or Williamsport symphony dot org sponsors who'd our capital group that might come in college\nIs the composers day on the day we celebrate the birthday of an American soldier whose name might not win the mail but\nWhose music you probably recognize him as my voice yield name rarely appeared on our gang and law from the Nineteen thirties but music would use in most of\nThe world's shield was born in ... Minnesota on today's dated Eighteen Ninety three by was already an accomplished piano that Oregon invite this theme of professional ranger composer and pianist\n\n\n\nMm Mm Mm oh that was good Viennese bond bond that it's a spot\nWFL amount of gun durability boss ski it was on the state of need to forty nine but Johann Strauss the younger became the music director of the Strauss orchestra to go for the leadership from his dad and\nThen a beginning his way to becoming known as the walls keep\nAhead we have the other music of Mozart Larry which go stay tuned\nProgramming on WB I is made possible by our members we thank you for your support numbers and by the Home Depot the next generation of home improvement with everything you need to do projects smarter the Home Depot more saving more doing\nIn the weather forecast rain continues through this evening we may see some\n[noise] I had we have got a music of Mozart Larry which go please stay tuned\nProgramming on W. V. I. is made possible by our members we thank you for your support numbers and by the Home Depot the next generation of home improvement with everything you need to do projects smarter the Home Depot more seeming more doing\nIn the weather forecast rain continues through this evening we may see some thunderstorms later today and into the evening that may produce heavy rainfall\nLives will be around sixty after some follow up tomorrow morning mostly sunny skies highs of the low seventies Jabbar nights lives will be in the upper fifties and partly sunny Thursday highs of the upper seventies in ... sixty six ... spills Seventy three hazel in sixty eight Seventy two at the W. V. I. A. studios ...\nEvery day thousands of Pennsylvania and mothers sponsors children neighbors struggled to overcome\nAddiction that's like Pennsylvania's public media stations have come together for battling opioids series of educational programs they focus on increasing awareness and reducing the stigma around opioid addiction give you a story declined the resources available to you is it badly opioids ... or to get there we can save\nMy major funding provided by Geisinger\nSupport comes from can easily owner of good neighbor waffles specializing in design restoration and construction field stone wall since Nineteen Ninety six he's proud to participate in show his work at the twenty Eighteen artist open house weekend in ... county\nThe latest news coming up at the top of the hour taking their this piano Sedona by Mozart is so don't take a minor in the actual catalogue it's number three ten and\nThere's elements of blowing their own especially as opening here's ...\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise] [noise] [noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n[laughter]\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise] they do in New\n\nAnd\n[noise]\n[noise]\n\n[noise]\n\n\n[noise] [noise]\n\n\n\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise]\nWe leave our area needs public media to highlight our local cultural scene and keep in touch with the world [noise]\nThere are many ways you can help us with this public service mission [noise]\nGet your business to sponsor WB I make a memorial gift donates stocks bonds or mutual funds for a tax advantage include WB I in your will and leave a legacy\nDonate a vehicle you don't see\nBombings here at the station catalog CDs answer phones organized press releases help with special events assured concerts\nPublic media is a community of people who care we care and we thank you for carrying\nThank you for your support [noise]\nMore ideas at W. V. I.\nA. dot org visitors\nW. V. eight eighty nine point nine ... W. V. I. H. D. one ... he's building in Williamsport W. B. Y. eight eighty nine point seven in Mansfield WTO eighty eight point three ... and at lake while in pop back W. P. A. U. Ninety One point five FM streamed live a W. V. I. A. dot org\nWearing Allentown in Ninety nine point three any Bethlehem at one of five point seven member supportive public radio W. V. I. S.\n[noise]\nThe swashbuckling adventures of captain may have or we told this week when Eli offer an air presents Jay keg east really scored based on Herman Melville novel Moby Dick [noise] college a hundred more\nThe obsession captain who leads the crew and the pursuit of the mythical reliance on with the common we often or district court\nYou live at W. B. A. dot org we're in Allentown to not eat on point three and a Bethlehem at what a five point seven member supported public radio W. V. I. S.\n[noise]\nSwashbuckling adventure captive have retold this week when only offering her present cookies through in school or something you know those mobile mobile [noise] drink more\nIf you have to include in pursuit of Hama only on for four months he joined us really offer on a\nSaturday afternoon at ... W. B. I. A. F. [noise]\n[noise] today China flower is the walls and China would win with them or ...\nChina have plans to build a brand new city from scratch on my walk of life because it just takes and politics and in a way it's not a done deal and so actually the from coal fired fast flowing stop on the next MORNING EDITION from NPR News [noise]\nTomorrow morning from five to not on volition V. O. L. A. F. out\nLie from NPR News in Washington I'm Laurie London\nPresident Trump is in Philadelphia today but before departing reporters caught up with him on the White House lawn with more questions about Supreme Court nominee Brett Kavanaugh among other things they asked how he would feel if the report shows Kavanaugh lied to Congress\nI don't think they should lie to Congress under a lot of people over the last year that have larger Congress to me that would not be acceptable\nSenate majority leader Mitch McConnell has promised a floor vote this week even as a probe continues he says each lawmaker will get a copy of the FBI report on sexual misconduct allegations against Kavanaugh\nDemocratic leader Chuck Schumer says he wants a briefing at least twenty four hours before an initial procedural votes\nWhite House economic adviser Larry Kudlow is defending the administration's new trade agreement with Mexico and Canada and NPR's Scott Horsley reports that agreement drew criticism from the conservative editorial page of the wall Street Journal\n... who's a former CNBC commentator calls the Journal's editorial writers dear friends but he takes issue with their criticism of the trade deal nothing is perfect Kudlow says the deal barrage an uptick to NAFTA which took effect a quarter century ago\nWe've been proved to supply chains of tariffs would we notice a tariff free zone in the spin effect supply chains will be their business will not be disrupted all those threats have not come out so I could do all the president's ...\nNever mind that it was the president himself who threaten cross border supply chains with promises to tear up NAFTA if you didn't get his way Kudlow stumbled over the name of the new NAFTA which Trump insisted on rebranding as the U. S. M. C. A. Scott Horsley NPR News the White House\nThe Trump Administration has started denying visas this week for same sex partners of un diplomats who are not married NPR's Layla Fidel reports the state department says the change in policy is about equal treatment\nThe department says the shift makes the policy consistent for same sex and opposite sex couples so same sex domestic partners can no longer get to rebut it diplomatic visas unless they are legally married this will also impact other foreign officials like ambassadors and full time into the employees\nBut many worry that the shift unfairly targets couples who come from countries where same sex marriage is not legal former UN ambassador Samantha Power who served under President Obama tweeted that the change in policy\nState Department says the change in policy is about equal treatment\nThe department says the shift makes the policy consistent from those same sex and opposite sex couples so same sex domestic partners can no longer get derivative diplomatic visas unless they are legally married this will also impact other foreign officials like ambassadors and full time into the employees\nBut many worry that the shift unfairly targets couples who come from countries where same sex marriage is not legal\nFormer UN ambassador Samantha Power who served under President Obama tweeted that the change in policy is cruel and bigoted going on to say only twelve percent of the un member states allow same sex marriage in some cases these relationships are punished\nPeople stationed in the U.S now have until the end of the year to get married somewhere where it's legal ... NPR News\nThe Dow is up a hundred and thirty six points this is NPR jurors are\nHearing from a white Chicago police officer who was on trial for murder and the shooting death of a black teenager Jason Van Dyke shot ... on McDonald's sixteen times during an on duty and counter and twenty fourteen as Patrick Smith from member station WBFO easy report\nWhen prosecutors made their case against Van Dyke they focused largely on a dash cam video that showed Van Dyke unloading has gone into the Seventeen year old in managing their defense Van Dyke attorneys have been working to undo the videos impact\nThe first witness this week a psychologist who specializes in police and deadly force encounters he said a reasonable officer would the same quote perceptual reality as Van Dyke would also have fired\nAnd cross examination the prosecutor pointed out that the experts opinion was based on Van Dyke retelling of the story and raise the possibility that Van Dyke lied about feeling in danger for NPR News I'm Patrick Smith in Chicago\nThe Nobel Prize in physics has been awarded to three people for groundbreaking inventions in the field of laser physics\nHalf of the prize goes to Ninety six year old American Arthur Ashe skin who invented the optical tweezers a laser that allow physical material to be moved using light\nThe other half of the prizes being awarded jointly to Canadian Donna Strickland and France's ... for sharp to pose amplification a technique that is allowed\nResearchers to boost the power of lasers those did much of their work at the University of Rochester this is NPR News\nSupport for NPR comes from NPR stations other contributors include constant contact who's email marketing tool to help small businesses and nonprofits connect with their customers learn more constant contact dot com and that listeners who support this NPR station\nAnd the weather forecast mostly cloudy and rain through this evening maybe some thunderstorms\nAnd some of these storms may produce gusty winds and heavy rainfall there's a Ninety percent chance of rain\nThere will be around sixty will have some fog tomorrow morning they're mostly sunny skies it'll be pleasant de ... and the lower seventies Wednesday night some clouds those will be on the upper fifties and partly sunny on Thursday highs and the upper seventies\nTemperatures right now Bethlehem Seventy eight Strasburg Seventy four o'clock somebody's at Seventy Seventy five in Wilkes Barre\nProgramming on WB I is made possible by our members and by golden business machines servicing the business machine needs the Lehigh Valley central at northeastern Pennsylvania for over Thirty years golden business machines as a proud corporate partner of W vi\nTonight at seven PM W vi famine TV will sign will cast a debate between the nominees\nDo you use and partly sunny on Thursday highest in the upper seventies temperatures right now Bethlehem Seventy eight Strasburg Seventy four o'clock somebody that Seventy and Seventy five in Wilkes Barre\nProgramming on WB I is made possible by our members and by golden business mushy servicing the business machine needs the Lehigh Valley central at northeastern Pennsylvania for over Thirty years golden business machines is a pro corporate partner or W. B. I. [noise]\nTonight at seven PM WB I a famine TV will will cast a debate between the nominees for Pennsylvania governor incumbent Democrat Tom ... and his challenger Republican Scott Wagner\nThe moderator this debate will be Alex Jr back the longtime host of the TV quiz show jeopardy tune yet but the only gubernatorial debate before election day on WB I ate\nPreempting all that jazz for this important forum\nOn Larry would go and uh coming up at four o'clock of course all things considered followed by fresh air and\nStill another our classical music right now I'm just a little bit well here's the music of an American composer who's been forgotten unfortunately George temple strong about below enjoy this or Castro sweet we begin with a familiar curtain raiser\nIt's an overture from the twentieth century by the beach you got less close when you own your play by the Russian national orchestra Mick I'll play yes conducting\n[noise]\n\nMm\n[noise]\nNa\nNa na\nNa na\n\nNa\nNa\nNa na na\nNa\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\nWell my conscience danced around the kitchen et cetera not out of the ... and an arrangement for chamber ensemble played by ... featuring pianist Kathryn Wilson nice or Canadian artists [noise]\nWe have a orchestral music from an earlier time by another American composer whose family has been forgotten about his music is\nA will put together and I hope you'll enjoy this were Castro sweet by George Templeton strong just stay at the weather forecast watch rain perhaps some thunderstorms that may produce gusty winds and heavy rainfall\nPatchy fog may form after midnight and those will drop to around sixty then turning mostly sunny tomorrow highs and the lower seventies partly cloudy Wednesday night lives will be in the upper fifth season for Thursday partly sunny was high on the upper seventies\nIt's Seventy nine in Allentown sixty nine and how what is Dale ... Seventy one here at the W. V. I. A. studios Seventy five degrees\n[noise] next time I'll ask me either we've got comedian Tom Arnold star of the new show the hunt for the Trump ... plus singer songwriter jumped up you'll put born with their very own Jonathan Gold than any music parity game about artists who go by one name who joined me\nHere at for NPR's our a puzzle games and trivia [noise]\nSaturday at eleven AM um W. V. I. I got bad\nJoin us for a celebration of the one hundredth anniversary of the birth of Leonard Bernstein's on Sunday October fourteenth the three PM Jerry and Bernadette Byrd\nGoals with which we don't resent a program that includes excerpts from his ... worked can't begin to west side story as well as it early summer and it went on WB I ate at the Dietrich theater like you to enjoy the contributions to donate to make reservations or touch and\nFeel like they were were by phone five seven zero six five five to\nMusic now this composer I mentioned George Templeton strong who was an almost ... ...\nSunday October fourteenth the three you get reimbursed that go with what you don't resent a program that includes excerpts from a speech where he can't beat the west Side Story as well as early summer and winter WB I ate at the ... like you to enjoy the contributions to donate the make reservations are taught to\nBe like they weren't or by phone five seven zero six by by\nMusic now this composer I mentioned George Templeton strong who was an almost exact contemporary um Edward eh will guard\nAnd he received as early music training here in the states but finished off\nWhen it looked like he was going to seek a professional career he uh went off to Europe like so many of the other composers of his generation and after and he ended up is like the conservatory and eventually did play viola for a time in the lives that goes on how\nAnd stayed in Europe for some time uh he was kind of on the periphery of the circle of Wagner list\nAnd then he came back home and we have his first or Castro sweet\nFrom a ... book the sketches and the first movement is titled epilogue the next the elbow below the horn\nThan the cemetery Ira bond of the dead and finally in the in the like watch music of George Templeton strong play by the Moscow Seventy under Adriano\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\nPerhaps something new to your music of George temple than strong American ... those are the romantic lead her new book that sketches sweet number one\n[noise]\n\n\n\n[noise] perhaps something new to your music of George temple than strong that American composer to lake romantic we heard notebook sketch is sweet number one like let the Moscow simply under Adriano on W. V. I. A. FM\nProgramming on W. V. I. is made possible by our members we thank you for your support numbers and by the Home Depot the next generation of home improvement with everything you need to do projects smarter the Home Depot more saving more doing\nBut we have to be on the lookout for some severe weather this evening there's ... percent chance of rain uh showers and perhaps some thunderstorms which may produce gusty winds and heavy rainfall and it'd be the national weather services issued a tornado watch a tornado watch until eleven o'clock tonight\nFor the following counties in our listening area Bradford Lackawanna loser in pike suck what Hannah Wayne in Wyoming counties\nSo uh the uh I'm aware of that and then tomorrow we should have nice weather mostly sunny highs and the lower seventies partly cloudy on Wednesday night those in the upper fifties and for Thursday partly sunny highs and the upper seventies\nIn Bloomberg Seventy five my Pocono sixty seven Seventy six and son variant in Scranton Seventy three\nSupport comes from can easily owner of good neighbor walls specializing in design restoration and construction of field stone wall since Nineteen\nNinety six he's proud to participate in show his work at the twenty Eighteen artist open house weekend in ... county\n[noise] drinking water around the country is polluted with a potentially harmful group of chemical linked to a wide range of illnesses\nCancer low birth weight thyroid disease [noise]\nHaving an effect on the immune system\nI'm Ari Shapiro where these chemicals come from and how they might be regulate this afternoon on all things considered from NPR News [noise]\nNow begins at four o'clock on WB I a [noise] but now it's a little um attractive chamber work from a French composer\n... of the twentieth century the early twentieth century who really made his living as a career naval officer now unlike risky course he got his name is Joan Cross and this is a quintet for heart flute violin and cello [noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\nThe future hospice was Isabel more anti that quintet for heart Newt and strings by French composer Shankar\nOn Mary would go thanks so much worse tuning in right now and I check the weather or get that a tornado watch is and if that's the eleven o'clock for virtually the entire listening area W. B. I. S. all the way from the Poconos west to my uh Williamsport\nNorth to Bradford titled counties south to screw Cook County in carbon in my county\nSo I'm so be careful that we're going to conclude with a familiar work by British composer Peter ... real sweet ... near where the Academy of St Martin in the field and", "show_name": "Classical Music with Larry Vojtko", "year": "2018", "city": "Williamsport", "day": "02"}