{"month": "10", "state": "PA", "station": "WVYA", "content": "This was WB ... not FM W. V. I. H. D. one scratching Wilkes Barre Hazelden WTY eighty nine point seven Williamsport WTO eighty eight points ... Mansfield at least one of the ... W. P. A. U. Ninety One point five FM Palmyra township\nTranslators W to walk to a T Clark summit W to eight nine ... sundry W. twos zero seven eight Williamsport end up to seven eight ... wells borough listener supported public radio\n\nEvery day thousands of Pennsylvania and mothers fathers children neighbors struggled to overcome addiction\nThat is why Pennsylvania's public media stations have come together we're battling opioids series of educational programs\nTo focus on increasing awareness and reducing the stigma around opioid addiction to these stories and find the resources available to you is it badly opioids dot org together we can save lives major funding provided by Geisinger\n[noise] next time on ask me other we've got comedian Tom Arnold star of the new showed the hunt for the Trump take plus\nSinger songwriter Jill so we'll put born with their very own Jonathan Gold in music parity game about artists who go by one name so joined me over here at for NPR's our a puzzle word games Andrea via [noise]\nSaturday at eleven AM on W. V. I. A. F. at\n\nProgramming on W. V. I. is made possible by our members anti Pennsylvania College of technology thinking about college hoping to land a great job after earning your degree think Pennsylvania College of technology\nWith one hundred plus bachelor an associate's degrees an exciting career fields industry standard labs in uh Ninety six percent graduation placement rate pen college is perfect for hands on learners visit P. C. T. dot edu to learn about Penn college degrees that work\nLive from NPR News in Washington I'm winter Johnston presidential adviser Kellyanne Conway is taking aim at those who say President Trump month the woman who said Supreme Court nominee Brett Kavanaugh sexually assaulted her when they were teenagers\nAnd a campaign rally in the city last night Trump made fun of Christine Blasey Ford for not remembering all the details at times it's quoting what she said\nConway says Trump with simply pointing out inconsistencies and forwards testimony before the Senate Judiciary committee last week\nThis woman has testified under oath ... hours\nNPR News in Washington I'm Windsor Johnston presidential adviser Kellyanne Conway is taking aim at those who say President Trump among the woman who says Supreme Court nominee Brett Kavanaugh sexually assaulted her when they were teenagers\nAnd a campaign rally in the city last night Trump made fun of ... forward for not remembering all the details at times Mitt's quoting what she said\nConway says Trump with simply pointing out inconsistencies and forwards testimony before the Senate Judiciary committee last week\nThis woman has testified under oath ... hours for all of you to say now you're getting concerned about the fast and then we got the fact that July is not how much because people from all different life are coming forward and tell their stories\nSome Republicans are condemning Trump's comments Senator Jeff flake calls than a polling center Susan Collins says they were just plain wrong\nAnd internal watchdog at the department of homeland security has found serious issues at a major immigration detention facility in Southern California NPR's Joel Rose reports that's the finding of a report released today by the department's inspector general\nDitch us inspectors paid a surprise visit in may to the Adelanto detention facility which houses nearly two thousand immigrant detainees they found problems that show quote disregard for detainee health and safety unquote including News's made out of sheets and detainees cells\nWatchdogs report highlights the suicide of one detainee who was found hanging by bed sheets and notes seven attempted suicides at the facility\nThe inspectors also found that detainees lax timely access to medical and dental care and we're sometimes disciplines improperly the Adelanto facility is run by the GEO Group or a private prison company under the supervision of us immigration and Customs Enforcement ice has agreed to conduct a full review of the detention facility Joel Rose NPR News\nRussian President Vladimir Putin has called the former Russian spy who was poisoned in England a traitor and come back and ... Kim reports British authorities are blaming Russian military intelligence for the poisoning which the Kremlin strongly denies\nDuring a panel discussion in Moscow president ... after the crumbling would react to new U.S sanctions to protest the poisoning of Russian double agent Sergei Skripal and mark\nNeumann scribble was just as wide as a traitor to the homeless and come back out of the\nEspionage light prostitution is one of the world's most important professions and nobody has been able to put an end to it yet the script ... diplomatic rift between Russia and the west as well it's tightening us economic sanctions Lucian Kim NPR News Moscow\nStocks are trading higher on Wall street at this hour the Dow Jones industrial average is up one hundred fifty seven points at twenty six thousand nine thirty one but not second positive forty nine the U.S and the five hundred up twelve this is NPR News\nThe Nobel Committee has awarded this year's Nobel Prize in chemistry to read scientists half of the price go to American Francis Arnold\nIt's hard not to dream but I certainly didn't\nThink it was a possibility I I'm an engineer by training I Love chemistry but I'm not the greatest hello\nArnold will share the prize with American George Pete Smith and Britain Gregory Winter the Nobel Committee says they're being recognized for their work to develop new biofuels and pharmaceuticals\nA new government is taking shape in Iraq five months after the country's elections NPR Jenna rap reports on Iraq's new president\nParliament elected Kurdish politician burned solid has president he appointed Shia politician Adel Abdul ... to form a government idled ... is a French educated economist he served as\nBut I'm not the greatest hello Arnold\nWill share the prize with American George Pete Smith and Britain Gregory Winter the Nobel Committee says they're being recognized for their work to develop new biofuels and pharmaceuticals and new government is taking shape in Iraq five months after the country's elections NPR Jana rap reports on Iraq's new president\nParliament elected Kurdish politician Burnham Saleh as president he appointed Shia politician Adel Abdul ... to form a government\n... is a French educated economist he served as Iraqi vice president and later an oil minister a member of a party founded in Iran by Iraqi exiled\nHandling that anyone that's imported most of Iraq's powerful around that Shia parties and he's also respected in the west it's thirty days to put together a cabinet and then go to a vote in parliament which will either approve or reject the new government Jane around for NPR News Erbil in the Kurdistan region of Iraq the death toll from\nLast week's powerful earthquake and tsunami in Indonesia has surpassed the fourteen hundred search and rescue teams are coming through the rubble on the island of silhouettes eight searching for survivors officials say hundreds of people remain unaccounted for\nAnd thousands more have been displaced I went there Johnston NPR News in Washington\nSupport for NPR comes from NPR's versions other contributors include farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life ups and downs coverage options and more information can be found and farmers dot com and the ... foundation\nOn Shakespeare uncovered do fairly well so what does he hadn't treated Shakespeare's most popular pays the opening just says we are and we are all in as the original romantic comedy\nCan be a small and intelligent with you won't but until you open your own self promotion of\nMuch ado about nothing that hadn't had\nShakespeare uncovered [noise]\nPrepares October ... wealth at nine o\nW ... TV support comes from the artist so open house weekend in ... county twenty four artist exhibiting a variety of unique our treasures of twenty locations studios are open ten AM to six PM October ... through the eight five seven to seven eight two or three three to four artist tour dot com\n[noise] good afternoon I'm Larry ... thanks so much for tuning in and coming up this afternoon we have a guitar congenital from the early romantic period\nToday we celebrate the birthday of the conductor composer studies loves scrub adjust ski and we'll hear a recording he may conducting the Minnesota Orchestra music of rebel if this hour Daniel Baron ... will be a piano for a trio by Mozart\nAnd we begin with an orchestra sweet taken from an opera ... in fact it's final opera\nA dating from Seventeen sixty four and\nIt was never produced in his lifetime they were in rehearsal Z a but the ... passed away in September of that year in the middle of the rehearsal period and the directors of the opera\nAre claiming they could not find a suitable replacement for round mole just let the project fall away and so the first performance of this opera staged performance took place in the twentieth century it's called buddies ... odd\nOpportunities um be a it was from Greek mythology figure in Greek mythology operates the hyper ... and he was supposed to be from a a that was his his land hyper ... and he was a legendary sage healer and a priest of Apollo\n... you'd need not know anything about that do enjoy this we'd have dances from the ballet play by ... or under the direction\nPhone way so the first performance of this opera staged performance took place in the twentieth century it's called I bet he's ... ball the odd\nNobody's um the uh what's for Greek mythology figure in Greek mythology Upper East the hyper boring and he was supposed to be from a a that was his his land type of ... he was a legendary sage either a priest Apollo\nBut you need not know anything about that do enjoy this we'd have dances from the ballet played by ... or under the direction of Barry ...\nNo\n\nNo\n\n\n\n\n\nKnow\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise] [noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\nMm\n\n\n\n[noise] [noise] [noise]\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n[noise] Mm [noise]\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n\n\n[noise]\n\n\n\n[noise]\nMm [noise]\n[noise]\n\n\n\n[laughter]\n\n\n\nScene with Erica funky weekday mornings off to the news it eleven on WB I Am FM [noise]\n\nThis is W. V. I. S. eighty nine point nine ... W. V. I. H. D. once ... he's holding in Williamsport W. B. Y. eight eighty nine point seven have him in Mansfield WTO eighty eight point three I found out at like while and pop back\nW. P. A. U. Ninety One point five FM streaming live a W. V. I. A. dot org where ... ... point three and in Bethlehem at one of five point seven member supportive public radio W. V. I. S.\n\nIt's October and live from here with Christine Lee is kicking off that even at hardly strictly bluegrass\nIn San Francisco this weekend [noise] you know the one with the Golden Gate bridge and tune in for special guest Lindsey knocking ham answer rain for the riff raff\nRadio players will be there with our new music director Mike Elizondo and our new team with are now in America correspondent Tom pop on\nSaturday Night to Sunday night to date on W. V.\nI. A. F. at it the president's tough ... leads to a new trade agreement with Canada and Mexico without tariffs\nWe wouldn't be talking about a deal just for those babies out there to keep talking about terrorists that includes Congress oh please don't charge tariffs and other benefits of the new deal worst caught\nPart of the suffering of American dairy farmers is resulting from President Trump's on policy\nOn the next MORNING EDITION from NPR News [noise]\nTomorrow morning from five to nine on W. V. I. A. F. out\nOn W. V. I. is made possible by our members and by Pennsylvania college shifts\nPresidents tough tactics leads to a new trade agreement with Canada and Mexico without tariffs we wouldn't be talking about a deal [noise] just for those babies out there that you're talking about terrorists\nThat his lose Congress oh please don't charge tariffs and are the benefits of the new deal worth the cost of the suffering of American dairy farmers is resulting from President Trump's own poll on the next MORNING EDITION from NPR News [noise]\nTomorrow morning from five to nine on W. V. I. A. F. M.\nProgramming on WB I made possible by our members and by Pennsylvania College of technology thinking about college hoping to land a great job after earning your degree think Pennsylvania College of technology\nWith one hundred plus bachelor an associate's degree it's an exciting career field industry standard labs in uh Ninety six percent graduation placement rate pen college is perfect for hands on learners visit P. C. T. dot edu to learn about Penn college degrees that work\nLife from NPR News in Washington I'm winter Johnston the White House continues to defend Supreme Court nominee Brett Kavanaugh who's facing multiple allegations of sexual misconduct press secretary Sarah Sanders is accusing Democrats of derailing the confirmation process from the start\nOn the night President Trump nominated judge Brett Kavanaugh Senator Schumer declared the Democrats would oppose this nomination with everything they had\nBefore a single document which produce single meeting with the senator or hearing was ever scheduled Chuck Schumer the Senate Democrats telegraph strategy to throw the kitchen sink at the judge with no regard for the practice decency for standards\nThe FBI is in the midst of conducting a supplemental background investigation into the claims made against cabin all the agency is expected to release its findings by the end of the week Senate Republicans are pushing for a full vote on his confirmation by that and\nPresident Trump is taking to social media to push back against a scathing report published in the New York times NPR's Scott Horsley says the article reports that Trump and his family used to be a scheme to evade taxes on hundreds of millions of dollars in inherited wealth\nThe New York times fourteen thousand words story was the product of more than a year of investigation it shows that despite his claim to be a self made billionaire President Trump was the beneficiary of a vast inherited fortune much which was shielded from taxes through a variety of questionable schemes\nNew York taxing authorities say they're reviewing the articles findings\nIn his tweets the president does not dispute any of the facts and the article but describes it as quote a very old boring and often told Trump complains the vast majority of the newspapers coverage of his administration has been negative echoing a charge leveled by the White House press secretary Scott Horsley NPR News Washington\nThe death toll from last week's magnitude seven point five earthquake and tsunami in Indonesia announcer pathogens fourteen hundred NPR's Julie McCarthy is in the city of ... near the epicenter\nAs you enter the city of ... there is a all kinds of signs of\nDistress and frustration but not violence or unrest do you feel you feel that there is a um\nA a sense of desperation people are holding signs up saying we need help to we need food and you have little children chasing the cars and people are throwing out their food at them\nJulie McCarthy reporting from the island of silhouette the Indonesia the federal emergency management agency is set to conduct the first test of a new national wireless emergency alert system later this hour most cell phones across the U.S will ring or vibrate at ... pm eastern\nFeel you feel that there is a um a a sense of desperation people are holding signs up saying we need help to we need food and you have little children chasing the cars and people are throwing out their food at them\nNPR's Julie McCarthy reporting from the island of silhouette the Indonesia the federal emergency management agency it's set to conduct the first test of the new national wireless emergency alert system later this hour most cell phones across\nThe U.S will ring or vibrate at ... pm eastern time the alert will ensure that system would work in the event of a national crisis this is NPR News the woman whose name became immortal\nInto buddy Holly songs had died ... to guarantee died Monday in Lubbock, Texas she was Seventy eight years old and the arts on the U.S Lucas reports that her love affair became crystallized in history when buddy Holly and the cricket started performing this song\n... suit Gehring when the Seventeen year old who dated the band's drummer geriatric\n[noise] one on money morality\nWas writing a song to Cindy Lou but Alison had another idea as he told NPR in two thousand\nI had a girl from ... ... talk to him and the judge to Beijing revenge due to\nThe Capitol got married after she graduated from high school and buddy Holly wrote Peggy Sue got married but the two divorced nine years later and Gary and claims in her autobiography the cheetah actually been in love with buddy Holly ... NPR News new\nYork first lady Melania Trump is continuing her multi nation African tour she visited a former slave holding facility on the coast of gun at today\nTo die in Salt Lake City [noise] [noise]\n\nAs a Trump will also visit Kenya Malawi in Egypt with a focus on promoting health and education she's also set to promote her be best initiative\nWhich aims to tackle issues such as cyber bullying and boots healthy living and this is NPR News\nSupport for NPR comes from log Meehan maker of go to meeting proud sponsor of how I built this summit taking place in San Francisco at the ... center October sixteenth learn more I'd go to meeting dot com and the listeners who support this NPR station\nTaking a look now at the forecast will see mostly sunny skies today with eyes on the upper sixties there'll be mostly clear this evening on becoming partly cloudy overnight lows in the mid fifties\nAnd Thursday looks partly sunny in the morning then becoming mostly cloudy in the afternoon along with showers and thunderstorms likely some thunderstorms may produce heavy rainfall with highs and the upper seventies or chance of rain is Seventy percent\nThis listener supported public radio W. V. on gay off him\nHello again I'm Larry ... thanks for staying with me and him this hour we'll open up the composers date book and\nWe'll hear about the premier of airing Copeland spinal chamber work\nAlso it's the birthday of the conductor composer studies less ... and we'll hear recording you may conducting some musical rebelled\nA little bit later round out the hour in fact we have a guitar country from the early romantic period and right now it's a contribution for violin and orchestra was not a show piece at all\nThat sort of variations\nOn a traditional Irish tune\nIn this hour we'll open up the composers date book and\nWe'll hear about the premier of airing Copeland spinal chamber work\nAlso the birthday of the conductor composer studies let's grab a jet ski and we'll hear recording you may conducting some music of rebelled\nA little bit later round out the hour in fact we have a guitar country from the early romantic period and right now with the contributions for violin and work his job so it's not a show piece at all\nThat sort of variations\nOn a traditional Irish team by Hamilton hearty you wrote this in Nineteen wells\nAnd I guess he was going through Thomas Moore's collection of the Irish melodies and he came upon you and he liked uh the valley smiling before me\nAnd that is the tuna which he built this set of variations on a Dublin air raid homes as the violinist the ... led by Bryan Thompson the music of Hamilton hearty\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise] this\nA national emergency alert system was about ... leaders voted cooperation with the federal emergency management agency Federal Communications commission and hoping to keep you informed it'd be a bit of an emergency\n\n\n[noise]\n\n\nVariations on a Dublin air\nPlay by rape homes with the ... workers drop Bryan Thompson conducting the composer Hamilton hearty himself was very important conductor in the first part of the twentieth century\nAnd it is the birthday of a well known conductor and will celebrate that birthday outstanding slaps ... ski in just a little bit so please do state to [noise]\nFrench Schubert wrote some of the histories greatest arts on but they're they're hardly his soul contribution to vocal music and the next Chicago Symphony orchestra broadcast ... conduct she with Internet math and eat flat major\nAlso music my neighbor and ... next time with the CFL ...\nSunday at ten pm on W. V. A. F. out [noise]\n[noise]\nThis is the composers date before October third I'm ... [noise]\nOne of the last chamber works of Being American composer Aaron Copland you see the first performance on today's date in Nineteen Seventy one just took place in Philadelphia and the benefits for the settlement music school with Copeland himself president for the premier abuse duo for food at the end of\nThe work was commissioned by friends due to the late William and Kate for many years the\nPrincipal students the Philadelphia Orchestra\nBy Nineteen Seventy one so many complex\nAnd a total music was the passion in both Europe and America [noise]\nCopeland for his ... some challenging orchestra works along these lines as well his duo however was unashamedly lyrical [noise]\nHas Copeland himself voted what can you do with the mood in an extended form that would not emphasized it song for nature\nViruses and seems to be built into\nSome expressed surprise total nature of my duo considering that my recent works had been in a more severe idiom however the style was naturally influenced by the fact that I was posing for can cage students not for\nFuture generations [noise] although I Hope\nYounger voters would play my do eventually ... just\nAs music critic Michael Steinberg put it reviewing its first performance of Boston ... is a lightweight work of a master craftsman is going to give pleasure to flew to send their audiences for a long time [noise]\nComposers date book is supported by ma goose online test prep for the ACT that's designed to improve scores students can get video lessons practiced questions and experts support online prep smart go far and enjoy the ride at ...\nDot com slash ACT\nStaple is produced by a pi I'm American public media in conjunction with the American composers for him\nWould it be doing its first performance of Boston ... is a lightweight work of a master craftsman is going to get pleasure to flew to send their audience is for a long time [noise]\nComposers date book is supported by ... online test prep for the ACT that's designed to improve scores students can get video lessons practiced question an expert support online prep smart go far and enjoy the ride at ...\nDot com slash ACT\nComposer state book is produced by a pi I'm American public media in conjunction with the American composers farm reminding you that all music was once new\nToday we mark the birthday when important conductor and composer of the twentieth century study slaps ... who was born in Poland on the state of Nineteen twenty three\nAnd he began a career as a pianist but he had a hand injury which ended that career and so it steered him toward conducting in composition\nAnd he worked a first lady and his own country Poland in various capacities as an orchestra and opera conductor he then went off to Paris to study composition with not your blue longer Shay\nAnd he was invited to America by George cell when fighting to conduct the Cleveland Orchestra\nSoon ... found himself the music director of the Minneapolis symphony orchestra which under his tenure was renamed the Minnesota Orchestra\nAnd so we hear him in a recording he made with the Minnesota Orchestra in Maurice rebels law ball birthday greetings to conductor ... all the jet ski\n\n\n[noise]\n\n\n\n\n\n\n[noise] ... play by the Minnesota Orchestra conducted by studies loved Grover ... who was born on this date in Poland in Nineteen twenty three he's spent many years as music director of the Minnesota Orchestra he was also a composer\nAnd he passed away fairly recently just last year\nComing up but guitar concerto I'm Larry would go ...\nProgramming on WB I is made possible by our members we thank you for your support numbers and by the Home Depot the next generation of home improvement with everything you need to do projects smarter the Home Depot more seeping more doing\nTaking a look now at the forecast will see mostly sunny skies today with ... and the upper sixties there'll be mostly clear this evening then becoming partly cloudy overnight lows in the mid fifties\nAnd Thursday looks partly sunny in the morning then becoming mostly cloudy in the afternoon along with showers and thunderstorms likely some thunderstorms may produce heavy rainfall with high in the upper seventies or chance of rain is Seventy\nPercent this listener supported public radio W. V. on ...\nHuman beings are made up of just four letters a U G G to mean for letters that every speech McClellan has billions of letters of code if you had every pitch filled with ease g's and T's you'd have you'd hundred dictionaries worth of genetic code and that\nCode decides who we are a guy Raj that story next time on the head radio hour from NPR oh\nSaturday at noon or W. B. A. up out\n\nSupport comes from Kent Aly owner of good neighbor walls specializing in design restoration and construction of field stone wall since Nineteen Ninety six he's proud to participate in showbiz work at the twenty Eighteen artist open house weekend in ... county\n\nThanks for joining the w._b. I ate public radio and coming up at four it's all things considered the latest news at the top of the hour and taking us there this guitar country either from the early romantic period by Fernando ... ruling is played here by the federal ... with the Academy of St Martin in the field played by I own a brown\n\nThey're not ... ruling he's played here by the federal ... with the Academy of St Martin in the field played by like Nebraska\nAnd\n\n\n\n\n\n[laughter]\nMhm\n[noise]\n\n\n\n\nThis was WBRC eighty nine point nine F. M. W. B. I. H. D. one Scranton Wilkes Barre ... we're in Williamsport WTY eighty nine point seven ... than you'd Mansfield a W T I O eighty eight point three of them were like well I'm hot packet W. P. A. U. Ninety One point five out of town\nStreaming live a W. V. I. A. dot org we have a translator and collect stomach at Ninety point three I found your arts any information station listener supported public radio W. V. I. S.\n[noise]\nThis was W. V. I. eighty nine points on F. M. W. V. I. H. D. once granted Wilkes Barre his will join we're in Williamsport it WTY eighty nine point seven FM in Mansfield a W T I O eighty eight point three of them were like well I'm pocket W. P. A. U. Ninety One point five of them\nStreaming live at W. V. I. A. dot org we have a translator in Clark summit at ... three of them you're arts and information station lucrative supported public radio W. V. I. S.\n[noise]\nSwashbuckling adventures of captain have retold between when only offer an air present against ruin score based on ... novel mobile [noise] perjury hundred more\nIf you have to leave for a while to come from poor Murphy joined us really off on a\nSaturday afternoon it was on WB I Am [noise]\nOn the next fresh air camera Jenkins taps about writing and directing her new movie private life starting Catherine hunt and ... as a couple in their forties trying to have a baby do any means necessary adoption ivy s egg donor\nLie in bed with a turtle a my old egg joined us\nThis evening at six after all things considered on W. V. I. A. F. M.\nSupport for WBAI comes from the citizens voice provided loser and county with breaking news every day for the past forty years citizens voice affects their readers who received news at home or on the go the citizens voice here to stay more information at citizens voice dot com\nThe Y. Center for the performing arts present and Cristina Pato ... bagpipes on Thursday October eleventh at seven thirty PM at the white setter tickets available at Bucknell dot edu slash box office or five seven zero five seven seven one thousand\nLive from NPR News in Washington I'm Windsor Johnston the White House is defending remarks that President Trump made about the woman who accuses Supreme Court nominee Brett Kavanaugh of sexual assault\nAt a campaign rally last night Trump mock Christine Blasey Ford for not remembering some of the details of the alleged attack that took place at a high school gathering in the Nineteen eighties press secretary Sarah Sanders has Trump was merely stating the facts and his comment will not affect it Kavanaugh's confirmation\nThe president's very confident in his nominee as he said a time and time again and we expected to vote and we hope they do that for\nSome Democrats say they're appalled by the president's comment senator ... says they proved Trump has no empathy for survivors of sexual assault is another statement by a\nThe remarks also drew criticism from several key Republican senators possible swing vote the judge will need in order to be confirmed\nThe FBI is investigating multiple allegations of sexual misconduct against cap and all the agency has until friday to release its findings with a November midterms getting closer and new NPR PBS NewsHour Marist Poll shows more Republicans are becoming enthusiastic about election day\nNPR's Brian Naylor reports that survey also shows Republicans had narrowed the gap with Democrats over which party voters wanted C control Congress\nThe poll shows a two percentage point difference between the numbers of Democrats and Republicans who are calling next month's election very important in July the number was ten points in favor of Democrats and the Democrats advantage on which party Americans want to have in ...\nIt's getting closer and new NPR PBS NewsHour Marist Poll shows more Republicans are becoming enthusiastic about election day NPR's Brian Naylor reports that survey also shows Republicans have narrowed the gap with the Democrats over which party voters wanted C control Congress\nThe poll shows or two percentage point difference between the numbers of Democrats and Republicans who are calling next month's election very important in July the number was ten points in favor of Democrats and the Democrats advantage on which party Americans want to have in control of Congress has fallen in half\nFrom twelve points in mid September to six points now the latest poll numbers come during a heated partisan battle over President Trump's nomination of judge Brett Kavanaugh to the Supreme Court\nMultiple women have accused him of sexual misconduct which capital has denied the controversy appears to have fired up Republican voters Brian Naylor NPR News Washington\nIslamic state is claiming responsibility for a suicide bombing that targeted and election rally in Afghanistan and the arts the deed reports the attack killed at least Thirteen people and wounded more than two dozen\nIt was the first attack on an election rally since campaigning kicked off last week the parliamentary elections there widespread fear that they sort of violence could derail the process they seen as a dry run for the more important presidential election next year and a test of the government's ability to provide security\nNPR ... reporting from Islamabad stopped on Wall street or trading higher that's our the Dow is sixteen points then that's like a twenty six the U.S and pay five hundred up to you're listening to NPR News\nFrom Washington\nThe remnants of tropical storm in the Pacific ocean R D wrenching parts of the southwestern us\nThe national weather service is warning of flash flooding in Colorado Arizona and Nevada the state of emergency has been declared in Utah governor Gary Herbert has deployed the national guard to Utah County south of Salt Lake city to prepare for potential flooding\nThis year's Nobel Prize in chemistry has been awarded to Americans and a researcher in the United kingdom NPR's Nell Greenfieldboyce reports they won for using evolution to design new enzymes and medicines\nFrancis Arnold works at Cal Tech but early this morning she was in a hotel room in Dallas texas sound asleep\nAnd the phone rang and I first of course I thought it was one of my sons with the\nProblems nope it was the royals Swedish Academy of Sciences she'd been awarded half of the Nobel Prize in chemistry for pioneering the idea of using random changes to produce all kinds of new chemicals are enzymes so researchers can pick the best one for use in say an industrial process or a pharmaceutical\nShe shares the award with George Smith of the University of Missouri in Colombia and Gregory Winter at the end Marcy laboratory of molecular biology in the United kingdom Nell Greenfieldboyce NPR News\nA group of investors says it will try to revive Toys R us after receiving a number of qualified bids that word comes in a bankruptcy court filing the company was founded in Nineteen fifty seven\nI went through Johnston NPR News in Washington\nSupport for NPR comes from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial well being first learn more at Raymond James dot com\nTaking a look now at the forecast will see mostly sunny skies today with eyes on the upper sixties\nFiling the company was founded in Nineteen fifty seven I went there Johnston NPR News in Washington getting\nSupport for NPR comes from the financial services firm of Raymond James offering personalized wealth management advice and baking and capital markets expertise along with the legacy of putting clients by natural wellbeing first learn more at Raymond James dot com\nTaking a look now at the forecast will see mostly sunny skies today with ... and the upper sixties there'll be mostly clear this evening then becoming partly cloudy overnight with low in the mid fifties\nAnd Thursday looks partly sunny in the morning then becoming mostly cloudy in the afternoon along with showers and thunderstorms likely some thunderstorms produce heavy rainfall with highs and the upper seventies or chance of rain is Seventy percent\nThis listener supported public radio W. V. on gay a fan\nOf the opioid epidemic using a men's public health crisis of our time\nNow WB I as a proud partner with family services association of northeastern Pennsylvania for the ninth annual national family we conference a community built to conquer opioid addiction [noise]\nFriday October twenty six at the best western plus genetic hotel conference center in Wilkes Barre\nTwelve workshops focusing on different aspects of the opioid crisis details in registration essay\nAnd eat da di\n... on WB I is made possible by our members we thank you for your support numbers and by the Home Depot the next generation of home improvement with everything you need to do projects smarter the Home Depot more saving more doing\nGood afternoon I Hope your day is going well I Would go and in the final our classical music on this Wednesday a piano quintet by Mozart's people hold all also\nA quartet for ... and strings and we begin way back in the late seventeenth century music ... Henry personal\nThis was a sweet ticket for one of his stage works out allows her or the mores revenge kind of a retelling of the fellows story and you recognize at least one to you know because\nThe Iran do from this a scorer was used by Benjamin Britten that's the basis for his now famous young person's guide to the orchestra\nHere there's music is played on period instruments by the ... ... almost angle Brooke conducting the music of Henry personal\n\n\nThe music of Henry personal from his stage where other lobster or the ... revenge\nThat sweet was played out period instruments by the ... orchestra Thomas ... book the music director I'm Larry voice go and still to comment oboe quartet by a friend of both tied into Mozart and we have a music of Mozart's most famous people ...\n... it was a complete state to\nSupport comes from the artist soap and house weekend in ... county twenty four artist exhibiting a variety of unique our treasures of twenty locations studios are open ten am but six PM October ... through the eight five seven to seven eight two or three three to four artist tour dot com\nTaking a look now at the forecast will see mostly sunny skies today with eyes on the upper sixties there'll be mostly clear this evening then becoming partly cloudy overnight with Lowes in the mid fifties\nAnd Thursday looks partly sunny in the morning then becoming mostly cloudy in the afternoon along with showers and thunderstorms likely some thunderstorms may produce heavy rainfall with high in the upper seventies or chance of rain is Seventy percent\nThis listener supported public radio W. V. on gay a fan\nAnd next time I asked me other we've got comedian Tom Arnold star of the new show the hunt for the Trump takes plus singer songwriter ... their very own Jonathan Gold than any music parity game about artists who go might one name who joined me\nHere at for NPR's our a puzzle where again Andrea\nSaturday at all that but I Am on W. V. I. A. up out\n\nThanks for staying with me on Larry voice go well the northeastern Pennsylvania philharmonic his back and their first master works concert of this new season comes up this Saturday October sixth at eight o'clock\nIn Kingston on the campus of Wyoming Seminary at the curb the center for the creative arts and that program will open with\nOur a puzzle where again Andrea\nSaturday at a ... a up and\n\nThanks for staying with me on Larry voice go well the northeastern Pennsylvania philharmonic is back and their first master works concert of this new season comes up this Saturday October sixth at eight o'clock\nIn Kingston on the campus of Wyoming Seminary at the curb the center for the creative arts and that program will open with the bully and other true to the marriage of Figaro of Mozart and conclude that the gorgeous simply number two if you're a hunter Brahms\nThey could turn on the program at the piano concerto number two a rock modern off\nFeaturing Spencer my or who's become something of a good friend of the northeastern Pennsylvania philharmonic just a fabulous pianist so for more information at tickets in E. P. A. filled dot org N. E. P. A. P. H. I. L. dot org that this Saturday eight o'clock in Kingston Wyoming Seminary\nRight now it's music as a contemporary of heighten Nobel quartet by young ... divine hall played by sour Frances ... was was he took ... trio\n[noise]\n[noise]\nAnd\n\n\n[noise]\n\nAnd Thursday looks partly sunny in the morning that becoming mostly cloudy in the afternoon along with showers and thunderstorms likely some thunderstorms may produce heavy rainfall with high in the upper seventies or chance of rain is Seventy percent this is listeners\nAnd Thursday looks partly sunny in the morning then becoming mostly cloudy in the afternoon along with showers and thunderstorms likely some thunderstorms produce heavy rainfall with highs and the upper seventies or chance of rain is Seventy percent\nThis listener supported public radio W. V. on a a fan\n\nWhen your business becomes a WBAI you sponsor you helpless share the world within ... NPR News classical jazz in contemporary music and other favorite radio programs\nWe're proud to thank the many civic minded businesses arts and education organizations that support or non profit public service mission and we invite your business to join engage the w._b. I audience\nPlease call our corporate sponsorship team five seven zero six zero to eleven thirty seven and thank you\nIf you've\nGot an extra vehicles that you no longer need to make the most typically donating that car truck or both to W. vi hey we'll get top dollar for your extra car and you can support the W. vi mission you may also qualify for tax deduction just call aid for for W. B. I. a car that's it for for W. V. guy a car\nFor a visit W. B. I. A. dot org slash cars to learn more\nAnd as always thank you for your support for W. V. I. A.\nProgramming on WB I is made possible by our members we thank you for your support numbers and by the Home Depot the next generation of home improvement with everything you need to do projects smarter the Home Depot more saving more doing\nRounding out the afternoon as a piano quintet by your ... who study with Mozart and succeeded hide it and as the music director at in the court of Esther ...\nWell he left lots of music no symphony so young at the church doesn't lots of chamber music including this very attractive piano quintet proceeding seven here played by members of such that do classical on WB I\nMm\n\n[noise]\n\n\n\nThat the\n\n\n\n\n\n[noise]\n\n\n\n\nNa\nNa\n\n\n[noise]\nNa\nNa\n\n\nNa\n\n[laughter] they're\nOh okay\nYou know but you do\n\nYou if the\n\n\n\n\n[noise]\n[noise]", "year": "2018", "show_name": "Classical Music with Larry Vojtko", "city": "Williamsport", "day": "03"}