{"month": "10", "state": "PA", "station": "WVYA", "content": "And translators W to want to a T ... W to eight nine ... W E to zero seven eight Williamsport and ... to seven eight ... wells borough listener supported public radio [noise]\nMillions of Americans have voted for their favorite novels in the great American read October Eighteenth as the deadline to vote then joined WB I for a great American read Halloween party Saturday October twenty seven AM to two PM and just one more page four twenty five years ...\nBring the kids in caution for glitter tattoos refreshments fund them prizes October twenty you as we await the announcement of America's favorite novels October twenty third\nYou can still get your vote in W. V. I. dot org slash great American read\n[noise]\nNext time on ask me now there we're joined by actor Nick cruel from the grill show broadway's oh how low and the Netflix animated series big mouth and will play a game called best of the fast where contestants will have to guess real festivals from one we just made up their joined me up\nYour eyes and break for MPR to our puzzles where a game and trivia [noise]\nSaturday at eleven AM on W. V. I. A. F. at\nSupport comes from the greater have worked in concert series providing professional performances to northeast Pennsylvania featuring musical starlings of Mandy Barnett the company man and the sellers while as this year season passion membership information available at Hilton concert series dot org\nIt's through the support of listeners like you that W vi is able to provide the excellent programming you enjoy daily learned more about membership at our website W. B. I. I. dot org sign up today and thanks for all of us at W. B. I\nLive from NPR News in Washington I'm Lakshmi sang President Trump says his administration may know by the end of the week what happened in the Saudi conflict in his stumble or Washington Post columnist or ... show was last seen alive more than two weeks ago ... family and friends fear cause show he was killed by Saudi hit men loyal to crown prince Mohammed bin Salman\nTrump says he's waiting for the results of an investigation but for now the president he's affirming the US's strategically critical partnership with Saudi Arabia\nThey are an ally with other very good allies in the middle east but if you look in Saudi Arabia they're an ally as there is tremendous purchaser of not only military equipment but other things\nThe president has also previously spoken a lucrative business deals he's made with Saudis in the U.S before he was elected\nRussian investigators say they believe in Eighteen year old students shot and killed Seventeen people at his vocational school in Crimea before he took his own life NPR's Lucian Kim reports from Moscow Russian authorities no longer suspected terrorists melted Russian authorities\nFirst said they weren't ruling out terrorists but re classified the crime once details became known president Vladimir ... who is meeting with the chips\nThe ... first said they weren't ruling out terrorists but re classified the crime once details became known president Vladimir ... who is meeting with the chips and counterpart Abdel Fattah el Sisi\nHold a moment of silence and expressed his condolences to the families of victims school shootings are rare and the former Soviet Union new tougher gun laws for Crimea became heavily\nMilitarized after Russia seized the peninsula from Ukraine and twenty fourteen Russia annexed Crimea after occupying it in holding a referendum that few countries have recognized Lucian Kim NPR News Moscow\nThe Trump Administration is pulling out of another multilateral trading NPR's Brian Naylor says the U.S is surfing noticed that will leave the body that said international postal shipping rate\nThe universal postal union is one hundred forty four year old agreement the Trump Administration says it gives an unfair advantage to foreign shippers contending it's cheaper to send a small package from Beijing to New York than it is to send one from San Francisco to New York\nThat discrepancy costs us businesses an estimated three hundred million dollars a year us manufacturers support the pullout saying the agreement is outdated in the age of e commerce\nThe administration says it will take twelve months to formally withdraw and in the meantime it's willing to negotiate with the new for better terms it will also started dabbling its own set of shipping rates\nBrian Naylor NPR News Washington\nAs if rebuilding from last week's hurricane Michael isn't daunting enough for many Floridians in the panhandle now they got to watch out for looters major Jimmy Stanford of the bay county sheriff's officers quoted in the Panama City news Harold saying that every night officers has been renting about ten people suspected of ransacking homes and businesses during a power outage\nSome areas of Lake County are putting looters on no his with spray painted signs that read leaders will be shot\nThe doubt is down thirty four points this is NPR News\n\nThe first lady spending to stay with the tiniest in most vulnerable victims in the nation's opioid crisis\nMillennia Trump is learning how doctors and nurses in Philadelphia care for newborns who are exposed to opioids in the womb she spoke briefly at a conference at Thomas Jefferson university hospital and toward in intensive care unit that cares for the infants and crisis\nMrs Trump arrived late this morning the plane she first born and was forced to return to joint base Andrews because of mechanical problems according to journalists who were traveling with the first lady the flight within the air for about ten minutes went smoke filled the cabin no word yet on the ...\nThe long running voice of big bird and Oscar the grouch on Sesame Street is retiring NPR's Andrew Limbong report that actor Carol ... leaving the children's program after fifty years\nI daily daily Herald leader has been a part of Sesame Street and it started in Nineteen sixty nine\nTo ... ... very\nA newly laid an egg right here on science can be pretty\nThin he dedicated his life the puppetry even met his wife Deborah I'm a set of Sesame Street and twenty Fifteen he told NPR that he was close to his characters including yes big bird but also\nOscar is pretty much ah I think I Know how he thinks because he thinks exactly the opposite of what I think is\nThe way to be [noise] to current Sesame Street actors stepping into the big bird at ... rolls into Limbong NPR News downs down for us in ... up five now that comes up nine points\nOn Lakshmi Singh NPR News\nFor NPR comes from the do the investments taking a personalized approach to helping clients row preserved and manage their wealth learn more at ... dot com slash well\nIt's from the daddy investments taking a personalized approach to helping clients row preserved and manage their wealth learn more at ... dot com slash wealth finality brokered services Elsie and Americans for the arts and Americans for the arts dot org\nHere's the weather forecast for the w._b. I listening area mostly sunny and windy this afternoon\nWith a very slight chance of showers highs and the low fifties partly cloudy tonight lives will be in the lower thirties with wind gusts up to thirty miles an hour and a freeze morning will be in effect from midnight tonight until ten o'clock on Thursday tomorrow will be mostly sunny and again windy high for the upper forties tomorrow night mostly clear losing the low thirties and\nFriday sunny hides in the mid fifties you're listening to W. V. I. A. F. M.\nSupport comes from the times tribute for over a century the times Tribune in Scranton served northeast Pennsylvania with news and information that defines our community and charts our history as it unfolds delivered to your home or your mobile device the Taj tribunal there for you any PA news dot com\n[noise]\nHello I'm Larry ... thanks for tuning in to help your day's going well a little bit later we have a violin concerto from the romantic period that had its first hearing on the state also ... in this hour one of the finest symphonies when the Pentagon Christian by\nAnd we begin with chamber music of the loop fixing Beethoven his up Seventy seven zero it's up to Seventy is a set of two piano trio was\nThe first is the so called ghost trio this is the less famous of the two of the open Seventy number two there are four movements and that's this is music from Beethoven's middle period they were published and Eighteen oh nine\nLynn Harold the jealous it's ... it's like Perlman the violinist and ... the pianist and this piano trio and eat lead over Seventy number two of Beethoven here on WB I\n\n[noise]\n[noise]\n\n\n[laughter]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise] Mm [noise]\n[noise]\n\n[noise]\n[noise]\nThing that the\nDoo doo doo doo doo\nMm\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\nMm\n[noise]\n\n\n\n[noise] the piano trio when he fled over Seventy number two of lip vixen Beethoven\nAre performers all great soloist coming together to play chamber music Vladimir Ashkenazi the pianist it's a problem and violinist and the cellist Lynn Harrell here on W. V. I Am\nI'm Larry voice going just ahead we have a symphony from the middle of the Eighteenth century by the youngest is Sebastian box boys Johan Christian box I help you plan to stay tuned\nSupport for WBAI it comes from but why Center for the performing arts hosting a free health and wellness fair on Thursday October twenty fifth from five to seven thirty PM in the atrium lobby in conjunction with the performance the nature of forgetting that evening at the Y. center\nThe health and wellness fair will feature a dozen vendors sharing information about staying active and healthy as we age including resources for those affected by memory loss and their caregivers for more information about this health and wellness fair five seven zero five seven seven three seven to seven\nHere's the weather forecast where the vi listening area mostly sunny and windy this afternoon with a very slight chance of showers highs and the low fifties\nPartly cloudy tonight lives will be in the lower thirties with wind gusts up to thirty miles an hour\nAnd a freeze warning will be in effect from midnight tonight until ten o'clock on Thursday tomorrow will be mostly sunny and again windy highs of the upper forties tomorrow night mostly clear losing the low thirties and friday sunny hides in the mid fifties you're listening to W.\nV. I. A. F. N.\nEmbracing covered Sony and ... screening involving the setting and very too we offer a flight ... fanciful reviewer but largely an celebrated repertoire\nFive hundred years or battalion Oregon music this week on pipe dreams\nFrom American public media Michael Barone I Hope you'll be listening\nA Sunday Morning at six on WB I Am I'm Larry voice job at the news from NPR's the top of the hour right now it's a symphony by the youngest son Sebastian Bach Johan Christian boss and this symphony\nA is a great example of a particular movement within classes system called ... owns the wrong storming stress here's a performance of the ... six number six ... audio on their hearts papers\n[noise]\n\n\n\nMm\nThis is W. V. I. eighty nine point nine FM W. V. I. H. D. one granted Wilkes Barre he'd gotten in Williamsport W. B. Y. eighty nine point seven have him in Mansfield WTO eighty eight point three ... and a while and pop back W. P. A. U. Ninety One point five FM streamed live a W. B. I. I. dot org\nWe're in Allentown ... three any Bethlehem at what a five point seven member supported public radio W. V. I. S. E.\nY. on Christian Bailey host of life from here [noise]\nYou know they see this country is more divided than ever but there's one thing we can all agree on the people just mentally I Hope you'll join us for a glorious evening of music and comedy that just might bring us a little closer together\nDuring the Saturday for a live broadcast from a Fitzgerald Theater in Saint Paul Minnesota with again for side the war in treaty Mr Gabriel ... Saturday Night at six Sunday night at eight on WB I ain't got banned\nI felt shot I still feel showing hundreds of thousands of veterans who've received less than honorable discharges had been denied VA benefits\nIf you have to be DFT mad because of that pie DSD you act out what you should not lose eligibility for your veterans' benefits that that's what's been happening\nLast year the VA finally offered to treat these veterans but are they doing enough on the next MORNING EDITION from NPR News in\nTomorrow morning from five to nine on W. V. I. A. F. out\nSupport comes from the greater hazel in concert series providing professional performances to northeast Pennsylvania featuring musical starlings of maybe Barnett the company man and this ... this year season fashioned membership information available at his house in concert series dot org\nFrom NPR News in Washington I'm Lakshmi Singh president Donald Trump says he wants to find out what happened to Saudi did sitting journalist ... but as NPR's Mara Liasson its intelligence Trump also continues to give the benefit of the doubt\nSince he wants to find out what happened to Saudi dissident journalist or ... but as NPR's Mara Liasson and tells us Trump also continue to give the benefit of the doubt to the Saudi royal family\nThe president said he'll be brief soon by secretary of state Mike Pompeo who's on his way back from meetings in Saudi Arabia and turkey President Trump has compared the Saudi royal family to Brett Kavanaugh suggesting that they've both been considered guilty until proven innocent today he was asked whether those statements gave the Saudis cover\nA red given caboodle with that being said Saudi Arabia's then a very important ally of ours in the middle east\nThe president also said he thinks audio tapes of what could be ... torture and dismembered meant at the hands of Saudi Government officials probably exists and that he's asked the Turkish government to share those tapes with us investigators Mara Liasson NPR News the White House\nSigning waste and fat in the federal budget President Trump says he's directing members of his cabinet to adopt what he calls the nickel plan he wants them to find a way to cut at least five percent from their budgets for the next fiscal year which starts October first two thousand nine team the president is expected to release his twenty twenty budget early next year\nIn a move that likely urged China a U.S navy research vessel has docked in Taiwan NPR's Rob Schmitz reports this is a diplomatic diplomatically fragile time for Washington DC and Beijing they're both locked in a trade war\nThe vessel named Thomas Street Thompson arrived in the southern part of go shown to refuel and change cruise tones official news agency quoted the islands defense minister saying it's visitors unrelated to military activity\nChina objects all government or military contract between us and Taiwan which claims as part of China despite its having its own democratically elected government flag and military\nIf not the first time the vessel docked in Taiwan but this visit comes at a sensitive time in U.S China relations\nThe world's two largest economies are embroiled in a trade war in China demanded us kids or three hundred and thirty million dollars a barrel of parts in support for Taiwan's us made F. sixteen fighter jets Rob Schmitz NPR News Shanghai\nRussia's investigating a mass shooting at a vocational college in Crimea today that ended in the deaths of Eighteen people\nAnd left more than forty others wounded local authorities encourage say that the gunman was an Eighteen year old student there reporting that he took his own life they say this was not a terrorist attack their categorizing this as again a mass shooting\nAt last check on Wall street the Dow Jones industrial average was down eighty five points to twenty five thousand seven hundred fourteen the NASDAQ is down Eighteen points that Seventy six twenty seven the ... down one at twenty eight oh wait this is NPR\nWells Fargo is getting ready for Brexit the San Francisco based bank says some of its servicing to Europe needs to move out of London to that end it's applied for an investment firm license in France NPR's Eleanor Beardsley reports on the banks transition against the backdrop of significant uncertainty over whether Britain\nWill be able to finalize its divorced from the European Union by next march is planned\nThe San Francisco based bank says it will continue to service the u._k. and non ... clients from London but it says a new city area based in Paris will provide capital markets and investment banking services for European and international customers who require access to the European Union\nParis is competing with Frankfurt Dublin in ... when over finance jobs as Britain leaves the EU France's easing financial regulations and introducing new tax incentives to make parents a more attractive financial hub Eleanor Beardsley NPR News Paris Canada\nIntroducing new tax incentives to make parrots a more attractive financial hub Eleanor Beardsley NPR News Paris\nCanada is now the first group of seven country to legalize the sale of candidates for recreational use and only the second in the world after ... as Dan carbon check reports from Toronto, Canada is national marijuana marketplace took effect at midnight\nCelebrations in part parties when well into the night as many Canadians marked a day they believe would never come prime minister Justin Trudeau is campaign promise to legalize recreational cannabis is now reality anyone Nineteen or older will be able to buy marijuana\nBut just days before legalization a new survey suggested nearly eighty percent of Canadians have no interest in smoking legal part\nThat staying carbon check reporting I'm Lakshmi Singh NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life ups and downs coverage options and more information can be found at farmers dot\nCom and the ... foundation\nIt's going to be cold overnight here's the weather forecast a freezer morning will go into effect at midnight last until ten o'clock tomorrow morning those dropping into the lower thirties with wind gusts up to thirty miles an hour\nMostly sunny and again windy tomorrow high on the upper forties mostly clear Thursday night and those will be in the low thirties and sunny on friday hides in the mid fifties you're listening to W.\nV. I. A.\nW. V. I. public media presents Pennsylvania decision twenty eight teams\nThe Pennsylvania ninth congressional district debate\nRepublican congressional candidate John user and democratic congressional candidate Danny will discuss the issues in front of tunnel is to analyze the audience\nKnows the Kennedys before you vote the Pennsylvania ninth congressional district debate [noise]\nTuesday October thirtieth at seven on WB I [noise]\n[noise] good afternoon I'm Larry ... thanks so much for tuning in\nComing up a little bit later we'll open up the composers date book can we learn about a link between two American musicians and unlikely pair to know each other poll white men and Aaron Copeland\nAlso we have a famous violin concerto the habits premier on this day and we begin with music of extra barely does the concert overture let costs air going up on the high seas with uh the Tigris well\nIs it really meant to be a depiction of pirates\nOf the initial\nInspiration for this overture came piled barely as was on vacation in nice in the summer of Eighteen forty four and a you\nOriginally titled this piece the tower of nice but then re titled it costs a roof or after jeans a gym spend more Cooper's novel the red rover\nAnd then finally just live close air which suggests to most Byron ... so\nIt probably doesn't matter what the inspiration is it really is exciting music you play by the San Diego simply orchestra under your wife tells me\n[noise]\n\n\n\n[noise]\n[noise]\nMusic it Alexander glass and off now that had a preview or on this date in Nineteen oh five\nIt was at this time that he had completed his cyclists symphonies and began to write concerto Sunni left a couple of good journalists were piano also up for cello and the violin concerto which is the most famous of any of ... and that's the piece that was prepared under state in Nineteen oh five\nHeritage play by Nikolai Snyder with the Bavarian radioactivity orcas drowned her modest ... violin concerto in eight\nNineteen oh fine here it is played by ... Snyder with the very radio ... modest yup some vitamin can generally hey minor well proceeding to blossom\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\nMm Mm [noise]\n[noise]\n[noise]\nMm\n\n\n\n[noise]\n\n\n\n\n[noise] [noise]\n[noise] [noise] [noise]\nMm Mm Mm\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise] the violin concerto in a minor opus eighty to ... an off\nWhich was premiered on this data Nineteen oh five that recording made by violinist ... with a very in radio symphony other modestly on and on W. V. I. F. fan I'm Larry Boyd going just ahead\nSome tickets to give away if you love choral music than stay tuned for your chance to win some music out some tickets to hear a concert by the choral society at northeastern Pennsylvania\nAnd we'll also hear some incidental music to\nPlay by French composer ... ne stay with me please\nSupport from WBAI comes from everything natural and Clark summit featuring an indoor lecture with Dr cast and grim October twenty first two PM sharing information on using natural remedies to fight Lyme disease arthritis chronic pain and more evident natural shop here if you know what's good for you\nHere's the weather forecast for the w._b. I listening area\nPartly cloudy and cold tonight lives will be in the lower thirties with gusty winds will have a freeze warning in effect for the night until ten o'clock tomorrow morning mostly sunny through Thursday with windy conditions highs and the upper forties clear on Thursday night losing the low thirties\nAnd studying on friday with ... in the mid fifties this is your arts and information station W. V. I. A. F. M.\n[noise]\nLeave all the roads ... five hundred concerto but he poured his\nTalent into jumped one for the cello mandolin and the next Chicago Symphony orchestra program mandolin Avi Avi town performed in\nClass heightened drum roll symphony next time with the CFL I Me sits any on\nSunday at ten pm on WB I uh\nSupport comes from the times tribunal for over a century the times Tribune in Scranton ... northeast Pennsylvania with news and information that defines our community and charts our history as it unfolds delivered to your home or your mobile device the Taj tributes there for you any PA news dot com\n\nWell you're a music lover because we're due to W. B. I. F. M. and the place to be Sunday afternoon November fourth hits\nWell you're a music lover because we do the W. B. I. F. M. and the place to be Sunday afternoon November or\nHissing Stevens physical crocus he drew in downtown Wilkes Barre that's where the choral society northeast Pennsylvania will ... be presenting a concert begins at four o'clock and its\nMusic fifth for a key program of English broke out some sort of course the lowest chamber orchestra including a coronation Athens or my handle and also some music of Henry personal on that program\nIf you'd like tickets I end up here for you well you have to do is be called their number two the numbers five seven zero six five five to eight eight five\nSeven zero six five five to eight oh the choral society northeast Pennsylvania performing Sunday November force at four in the afternoon at St Stevens in downtown Wilkes Barre right now taking us to do this time\nA suite of incidental music written for the play Ramon show the composer Gabrielle ... here is the law around Fela Monica on there with my\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\nStreaming live at W. V. I. A. dot org we have a translator in clock stomach at Ninety point three I found your arts any information station listener supported public radio W. V. I. S.\nWhat percent of the food in American supermarkets you actually think his\nSuit the definition of food is something that sustains a nerve shit yeah and nourishment in something that increases your health so forty percent of the stuff in American supermarkets wouldn't qualify as food like forty\nPercent wouldn't qualify sued right\nHow we connect with our food that time on the radio hour from NPR\nSaturday new no W beyond a up out\nOn the next ... the creator of the net flicks comedy series bow jak horsemen Raphael by black right\nSo jak is an animated comedy with the cats of humans and animals do jak as a horse does it depressed alcoholic sexist former sitcom star the Syrian satirized the Hollywood and pop culture and the new season is set in the era of the me too\nThere's a depressed alcoholic sexist former sitcom star the Syrian satirized the Hollywood and pop culture and the new season is set in the era of the me too movement joined\nThis evening at six after all things considered on the whole you beyond AFL\n\nProgramming on WB I made possible by our members and by Pennsylvania College of technology thinking about college hoping to land a great job after earning your degree think Pennsylvania College of technology\nWith one hundred plus bachelor an associate's degrees an exciting career fields industry standard labs in uh Ninety six percent graduation placement rate pen college is perfect for hands on learners visit P. C. T. dot edu to learn about Penn college degrees that work\n\nLife from NPR News in Washington on Lakshmi Singh\nIf secretary of state Mike Pompeo has a good idea about the fate of Jamal ... G after his meeting with Saudi Arabia's royal family and the Turkish government he's not sharing on the way back home from his fact finding trip to the middle east Pompeo told reporters that the administration is waiting for the results of an investigation into what became of the Washington Post columnist\nAfter he was last seen alive entering the Saudi conflict and assemble earlier this month Turkish authorities suspect foul play involving Saudi hit men loyal to crown prince Mohammed bin Salman Saudi Arabia says the claims are baseless secretary palm Pelayo says if the evidence points to Saudi Arabia a crucial us ally in the middle East that would be bad\nDays is an activity the boys [laughter]\nNope no one is going to defend\nIn Washington President Trump says he thinks the investigation into could show jeeze disappearance could wrap up by the end of the week\nTreasury Department employee faces federal charges for allegedly leaking sensitive government information to a journalist NPR's Ryan Lucas tells us the documents allegedly disclosed were related to suspects and the Russia investigation that only Edwards\nCase was one count of disclosing so called suspicious activity reports and one count of conspiracy to disclose them Edwards worked for the treasury department's financial crimes enforcement network which gave her access to sensitive reports about suspicious banking activity\nThe government says in court papers at Edwards provided an unnamed journalist copies of these reports about several suspects in special counsel Robert Mueller's investigation including Paul Manafort and Rick Gates the government says at which took photos of the documents and\nThen ... them to the journalists over in encrypted messaging app both charges against Edwards carry a maximum sentence of five years in prison Ryan Lucas NPR News Washington [noise]\nA week after hurricane Michael made landfall some people in the storm's path still cannot find a cell phone signal the Federal Communications commission says more than half the cell sites around Panama City Florida are out of service we have the latest from NPR's Camila Domonoske\nSurvivors of the storm are struggling to call loved ones or their insurance companies FCC chairman ... pi called the slow progress and restoring cell service quote completely unacceptable\nKrista born is rising market president for wireless in the south she says the company is struggling with an unprecedented number of cuts to crucial fiber optic cables and now she says some cables that has been fixed are accidentally being damaged again\nEverybody from power companies to emergency operations centers and even residents of clearing their own personal property all of that I can put the repair work at risk\nThe four major cell phone providers are offering credits and fee waivers for affected customers ... NPR News\nThe Dow is down fifty nine points to twenty five thousand seven hundred thirty nine this is NPR\nTornadoes generally seem to be ...\nFifty nine points to twenty five thousand seven hundred thirty nine this is NPR\nTornadoes generally seem to be shifting eastward in the United states and researchers are not sure why\nAccording to a study appearing in the journal climate and atmospheric science over the last few decades fewer twisters have been forming in Oklahoma Texas in Kansas and more have been turning up in states along the Mississippi River in further east such as Illinois Tennessee Michigan and parts of Ohio\nThe study's lead author says it's worrisome because more people live in those states however even with the decline in twisters Texas reportedly still leads the field in toward an addict activity\nThe Trump Administration is threatening to withdraw from another international treaty NPR's Yuki Noguchi reports the latest involved the postal agreement that Trump concerts gives Chinese companies an unfair advantage when they ship goods to the United states\nFor a hundred and forty four years the U.S has been part of the universal postal union which sets shipping rates for international deliveries poor developing countries including China pay lower rates well rates in the U.S and Europe are higher\nNowadays because so many products are shipped into the U.S from China the Trump Administration argues this amount to a subsidy this new escalation of trade tensions between Washington and Beijing could mean higher prices for American consumers\nThe administration says it will start the year long process of withdrawing from the treaty unless it is renegotiated ... NPR News Washington\nBut the the Dow down fifty three twenty five seven twenty five thousand seven hundred and forty four NASDAQ is down two points this is NPR\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with aroma knows\nA new series from the creator of Mad Men starring John Slattery Amanda Pete Paul Riser and Catherine hiring a new episode every Friday on prime video and the and EKG foundation\nHere it's going to be cold overnight here's the weather forecast a freeze morning will go into effect at midnight last until ten o'clock tomorrow morning most dropping into the lower thirties with wind gusts up to thirty miles an hour\nMostly sunny and again we'll be tomorrow high on the upper forties mostly clear Thursday night lives will be in the low thirties and sunny on friday ... in the mid fifties you're listening to W. vi\nProgramming on WB I is made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your arts that information station W. V. I. Pham\nThanks for staying with me on Larry voice go and coming up of this hour music tranquil and dramatic\nThe tranquil park English pastoral impressions some orchestral music by a British composer checking us off to the English countryside and a dramatic well we have some exciting if music\nThat picks a formidable force but costs sex\nWe begin with a variant a lovely sauna Tina for food and guitar from the twentieth century by a very prolific composer of an Italian American composer molecule cost and all over to disco he also was a film as a composer and unimportant teacher on the west coast\nThis on a ... for food and guitars played by Rachael ... guitar and Susan Hefner flute here on WB I Am\n\nOh no no\n\n\n\n\n\n\n[noise] [noise] Mm\nMm [noise]\n\n[noise]\n\n\nMusic of Matteo Costa new world with the desk go who spent the first half of his life in his native Italy and escaped fascism and came to United States\nTo become an important composer and composition teacher that was his southern Tina for flute and guitar a prolific composer this was opus two hundred five Rachel ... like a tourist the flu to Susan ... coming up off to the English countryside\nI'm Larry voice go please stay tuned\nThe Y. Center for the performing arts presenting Indian dance company and you're right you're grant dance ensemble on Thursday October Eighteenth at seven thirty PM at the white setter tickets available at Bucknell dot edu slash box office or five seven zero five seven seven one thousand\n\nHere's the weather forecast for the w._b. I listening area\nPartly cloudy and colds and I lose will be in the lower thirties with gusty winds will have a freeze warning in effect for midnight until ten o'clock tomorrow morning mostly sunny through Thursday with windy conditions highs and the upper forties clear on Thursday night losing the low thirties\nAnd studying on friday with high in the mid fifties this was your arts and information station W. V. I. A. F. M.\n[noise]\nSan Francisco operate presents renting these barber of Seville\nI don't like combination is cutting clever and the cartoon characters brought to life with the cats during Lucas me Jim Daniel ... and ...\n... the conduct the barber of Seville from San Francisco opera on this station [noise]\nSaturday afternoon at one on W. V. I. A. F.\nProgramming on WB I is made possible by our members and by Lindy corporation of pitched Lindy is committed to the local development of clean safe and abundant Marcellus natural gas harvested from under our feet in northeastern Pennsylvania\nLooking ahead a bit Sunday November eleventh that's a very special day it's the one hundredth anniversary of the end of World War one when\nThe armistice went into effect\nAnd on the eleventh hour of the eleventh day of the eleventh month and we hear a W vi are planning a series of programs to mark that occasions to keep your eye out for that or will be telling you more about that the weeks to come the reason I bring it up now though is in relation to this\nKeep your eye out for that I Will be tell you more about that the weeks to come the reason I bring it up no though was in relation to this next by this British composer\nWhose career was cut short by his service in World War one he was killed in action in Nineteen Eighteen [noise]\nHe was a close associate of race on Williams and indeed this score was dedicated to rate but William [noise]\nAn orchestra sweet cold English pastoral impression was the first movie Mark's spring morning here ferret makes use of an inch or two from the British Isles ... in\nThe next moment ... hill definable been over the hills and far away I was there Mitchell conducts the philharmonic orchestra English pastoral impression\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n\nSupport for WBAI comes from the citizens voice providing loser in county with breaking news every day for the past forty years as citizens voice thanks their readers who received news at home or on the go the citizens voice here to stay more information at citizens voice dot com\nI Larry Boyd give thanks for staying with me wrapping up our time together history in music\nGets a symphonic bombed by Reinhold glioma that first takes us back to the mid seventeenth century when a band of Ukrainians rose up against their polish oppressors Poland was in charge that part of the world at that time\nAnd they became legendary as the costs sex a formidable force to be sure here's the tone poem the ... by Reinhold ... played here by the check radioactivity orcas road dropped his lava under Keith Clark\n\n\n\nOh\n\n\n[noise]\n\nOh whoa whoa whoa whoa whoa whoa whoa\nWhoa\nWhoa whoa whoa whoa whoa whoa whoa [noise]\n[noise]\n[noise]\n[laughter]\n[noise]\n[noise]\n[noise]", "show_name": "Classical Music with Larry Vojtko", "year": "2018", "city": "Williamsport", "day": "17"}