{"month": "10", "state": "PA", "station": "WVYA", "content": "And translators W to want to a T Clark seven to eight nine ... son very W to zero seven eight Williamsport and don't need to seven eight a ... a listener supported public radio\n[noise]\nAfter months of nationwide voting in the great American read will finally find out Tuesday what America has chosen as his best love novel\nJoined WB I Am electronic county library system for a grand finale party with prices refreshing since on as we watch the final episode counting down to the announcement of America's favorite novels this Tuesday October twenty thirty seven thirty at the ... community librarian ... summit\nIn costumes are welcome for this free family events Tuesday with W. V. I. A. [noise] health\nCare is a problem that people in his district fates every single day in New Jersey with fewer than three weeks until the midterms repealing Obamacare is a major issue in a hotly contested congressional race and the issue of leaving many voters on the fence but\nI don't know I'm a I'm a little bit on the\nThat one I'm not sure that's on the next MORNING EDITION from NPR News tomorrow morning from five to nine on W. V. I. A. F. M.\nProgramming on WB I is made possible by our members and by the box choir Bethlehem welcoming distinguished American pianist Peter circuit to their annual concert gala\nHis program includes box Goldberg Variations and Mozart sonata in B flat major K. five Seventy and a doctor you and be minor K. five forty Saturday November third at four pm central moravian church Bethlehem\nInformation at six one zero eight six six four three eight to\nOr online at ... dot org\nFrom NPR News in Washington I'm Lakshmi Singh the Trump Administration is preparing to end assistance to Guatemala Honduras and El Salvador countries from which thousands of people have fled in search of greater safety and paying work\nTrump says he's determined to block a migrant caravan from crossing into the U.S illegally the president has repeatedly warned of unauthorized immigrants who resort to gang and other violence in the United states\nThose making the track north include young and old families and individuals able bodied and wheelchair bound Mexico's president elect suggested yesterday that his country the U.S and Canada work together to fund development in poor areas of southern Mexico and Central America\nWhere caravans are forming NPR's Mara Liasson reports on the political implications of the caravan is President Trump\nStumps in Texas today for incumbent Republican Senator Ted Cruz this is the president's go to issue and he has really grasped onto the caravan he's even said that the caravan and Kavanaugh will be the two most important things about the mid term\nHe's not only said without evidence that they are criminals he's even said that there are terrorists That's NPR's Mara Liasson\nWe'll be the two most important things about the midterms he's not only said without evidence that they are criminals he's even said that there are terrorists as NPR's Mara Liasson Ashley Lopez of member station K. U. T. Austin is covering Trump's visit to Texas where early voting is underway\nElection officials say they're expecting a higher turnout than usual and the coming days Texas has been flooded with a lot of money in the past several weeks particularly for the closely watched Senate race between incumbent Ted Cruz and his Democratic challenger Beto O'Rourke\nDana Spain who lived in Austin says she always votes but this election feels particularly important though she voted first thing this morning\nUm there was no way I was not going to be here a minute at the polls opened up and telling people what am I getting hit by a bus Monday afternoon and I didn't vote of no way\nPresident Trump is holding a rally in Houston today and an effort to dry support for crews on the first day of voting for NPR News I'm Ashley Lopez in Austin\nBig tech is that the White House today NPR's Jasmine Garsd reports companies including Google Amazon and IBM are considering the possibility of employees doing tours of duty with the government\nWhen it comes to technology the federal government lags behind and that hasn't been helped by a widening gap between left leaning Silicon Valley and the Trump Administration\nThis White House's office of American innovation is trying to bridge that gap the office is tasked with making recommendations to the president on how to improve government operations and services\nThe administration is trying to convince Silicon Valley leaders that their employees should take leads time away from their jobs to perform civil service those workers would be asked to help modernize state and federal agencies Jasmine Garsd NPR News New York\nAt last check on Wall street the Dow was down one hundred fifty seven points or more than half a percent at twenty five thousand two hundred eighty seven this is NPR News\nIt's been decades since the first Halloween came out and the horror flick is still attracting big audiences so much so that over the weekend it rose to the top of the domestic box office charts NPR's Trina Williams reports moviegoers\nHelps scare up an estimated Seventy seven and a half million dollars in ticket sales as the only\nNew wide release over the weekend it's nothing but treat for Halloween debuting at the second biggest October opening Halloween also can both the second highest October debut for horror movie behind last year it and the new was Halloween is the best opening\nElse to say fifty five year old Jamie Lee Curtis\nMakes Halloween the biggest movie opening with a female lead her age a star is born hold well at a distant number two then I'm drops to the third position at for topping the charts for two consecutive weekends goose bumps to hunted Halloween keeps the fourth spot and first man drops to number five Trina Williams NPR News\nThe Associated Press reports that to rarely seen stories by Ernest Hemingway will be published next year the director of Hemingway literary estate healthy AP that\nIndian country and the white army and the monument will be made available to the public there will also be a reissue of the authors famous work\nFor whom the bell tolls\nUs stocks are lower with Adele off one hundred thirty nine points to twenty five thousand three hundred five the S. and peas down eight NASDAQ has actually up twenty nine points this is NPR\nSupport for NPR comes from ... committed to changing lived through math by building map achievement problem solving and critical thinking skills for thousands of students every day\nBeing committed to a changing lived through Matt Bai building math achievement problem solving and critical thinking skills per thousand students to every day in nine hundred franchise locations Matt ... dot com slash NPR\nHere's the weather forecast for the w._b. I listening area partly sunny for the remainder of the afternoon ... will be around fifty mostly cloudy tonight through Tuesday night with some rain and the golfing lives will be in the upper thirties overnight a forty percent chance of rain showers tomorrow\nAnd Tuesday night lows dropping to the upper thirties and partly sunny Wednesday highs and the upper forties mostly cloudy Wednesday night losing the gap or twenties and mostly sunny Thursday high in the mid forties it's fifty degrees bell in Allentown Strasburg it forty seven Williamsport forty eight here at the w._b. I hate studios forty\nThree degrees support for NPR comes from Pennsylvania what October ... month celebrating Pennsylvania's locally grown and crafted want what special things to do taste and discover all across the state more information can be found P. A. Y. months dot com\n[noise]\nGood afternoon I'm Larry Boyd get my hope you had a great weekend in the coming up a little bit later the first ... says songs the most famous more popular but to also the birthday of Franz Liszt will celebrate with one of his symphonic poems after all is a jar where the he invented\nThis hour was here from violinist Joshua Bell but first did the recording in our record librarian out of reach new recording but one in that's new to our record library in the first time I think we've had this piece in the library it's a symphony number five of Alexander ... off\nThis fifth symphony came from it'd be a middle of the Eighteen nineties see was too right just three more after this and uh here or it was a very a\nVery successful a premier of the fifth symphony er Leipzig newspaper called the symphony alternate leave very profound and sparkling probably have a they scared so in mind with the sparkling adjective let's get some comes in the second place in the second movement\nHere is the Seventy number five in B flat sometimes called the heroic symphony of an accent a glass enough focus fifty five the b._b._c. national Tiffany orchestra Wales is ... is a conducted by the donkey talk\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise] [laughter] [noise]\n[laughter] [noise]\n[laughter] [noise]\n\n[laughter] [noise] [laughter] [noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[laughter] [noise] [laughter]\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\nAnd\n\n[noise] listen buddy number five in B flat the so called heroic symphony of Alexander bouncing off\nHis hope is fifty five their play by the BBC National Symphony of whales under the donkey or DACA coming up we have a set of variations for violin\nBy Henrik ... more about that important a virtuoso the romantic period and we'll be hearing a recording by Joshua Bell so I Hope you plan to stay tuned\nFor WBAI comes from but why Center for the performing arts hosting a free health and wellness fair on Thursday October twenty ... for five to seven thirty PM in the atrium lobby in conjunction with the performance the nature of forgetting that evening at the Y. center\nThe health and wellness fair will feature it doesn't the vendors sharing information about staying active unhealthy as we age including resources for those affected by memory loss and their caregivers for more information about this health and wellness fair five seven zero five seven seven three seven to seven\n\nHere the weather forecast a mixture clouds and sunshine this afternoon I was around fifty mostly cloudy tonight through tomorrow night those will be in the upper thirties tonight and in the upper thirties again tomorrow night or tomorrow we'll have a forty percent chance of rain showers in the afternoon with high in the mid fifties\nWednesday partly sunny eyes on the upper forties cold on Wednesday night losing the opportunities and mostly sunny Thursday highs and the maid forties Bethlehem at fifty two homes Dale forty four o'clock so I'm at forty two in Wilkes Barre forty six ...\nOne hundred two hundred even four hundred and fifty years as we celebrate important ... researchers are ... who knows her old rides and Christian airborne do light a candle with those we're honoring anniversaries this week going pipe dreams from American public media\nAnd Michael Barone I Hope you'll be listening\nSunday Morning at six on WB I Am\nAnd in about a half hour we have another anniversary to celebrate the birthday of Franz Liszt and we'll hear one of his symphonic poems\nOne of the contemporary younger contemporary of list was ... he was an important violin virtuoso in the romantic period came from Poland played all over\nThe are all over Europe and actually made a couple of doors in the United states which is a set of variations opens Fifteen to the scene is original to the ski and Joshua Bell is the violinist the pianist Samuel Sanders\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\nOut at like ... W ... Ninety One point five FM streaming live a W. B. A. dot org we're in Allentown ... three and in Bethlehem at one of five point seven member supported public radio W. V. I. okay\n\nWe'll meet again stories from Vietnam\nWomen's rights and escape from Cuba\nYour mother tells you you're going to go alone\nTo the United states car was really hard to fit that changed the world my career changed a lot with impossible with now possible and people changed each other's lives [noise]\nWhat do you want to say I need him to go save [noise]\nTuesday October thirtieth at age ... W. V. hike ATV\nHi I'm Chris daily host the black from here are some times rockets sometimes poignant always excellent variety show\nEach week we fill your public radio tote bags tropical music and comedy for a long time favorites to new discoveries you didn't even know what you're worth looking for I Hope you'll join me this weekend for killer show with comedian type Barry ... dish and Diana Gordon and the one the only Jeff Tweedy turn on tune in and drop on\nSaturday Night at six Sunday night at eight on W. V. I. A. F. N.\nProgramming on WB I is made possible by our members and by the box choir Bethlehem welcoming distinguished American pianist Peter circuit to their annual concert gala his program includes box Goldberg Variations and Mozart sonata in B flat major K. five Seventy ... be minor K. five forty\nSaturday November thirty four pm central moravian church Bethlehem\nInformation at six one zero eight six six four three eight to or online at ... dot org [noise]\nLive from NPR News in Washington on Lakshmi sang that's used in gears up for tonight's campaign event with President Donald Trump early voting is underway across Texas and the earth Sarah McCammon has more from the state's largest city were Democrats rally this morning as the thank you\nPainted vet with President Donald Trump early voting is underway across taxes NPR's Sarah McCammon has more from the state's largest city were Democrats rally this morning\nAs the sun came up over a shopping mall parking lot in Houston a large crowd of supporters cheered for a brief get out the vote rally led by Democratic Senate candidate that overall\n[noise] to show trailer\nBrought her six year old daughter with her to vote on their way to school a choice that she decided to cast her ballot on the first day of early voting here but not about the president coming to town to campaign for Republican Senator Ted Cruz\nI think it's going to be packed and I'm not happy if it is a little positivity\nIn the morning the Trump campaign says tens of thousands of people have registered for the rally Sarah McCammon NPR News Houston\nA Turkish state run news agency is reporting that police have sealed off the entrance to an underground car park where of equal belonging to the Saudi conflict has been found\nSaudi Arabia's crown prince Mohammed bin Solomon and his body guards are implicated in the disappearance and suspected murder of Washington Post columnist or ... G. three weeks ago when he visited the consulate in Istanbul the kingdom is now claiming ... died in an altercation in the conflict it still denies that the crown prince ordered his killing\nTurns out one of the American soldiers shot and wounded in a Taliban attack in southern Afghanistan last week is an army general Jennifer glass reports from Kabul to strike was time to disrupt elections\nThere he lives army brigadier general Jeffrey smiley was looted Thursday in Kandahar when the Taliban loyal it opened fire on a high level delegation including the top American commander in Afghanistan he was not injured but the shooter did kill two of the provinces top security officials the chief of police and head of intelligence and wounded the governor\nThat prompted Afghan officials to lay parliamentary elections in Kandahar for at least a week over the weekend the rest of the country voted despite Taliban and Islamic state threats nearly four million Afghans went to the polls to choose a new legislature\nThe election was marred by logistical and technical flaws that did keep some Afghans from voting and while there was violence there were no major attacks for NPR News I'm Jennifer glass in Kabul\nNorway is paying tribute today to solve it to or who is credited with spoiling Nazi Germany's plans to develop nuclear weapons you a camera and barred has died at the age of Ninety nine in Nineteen forty three letter Forman team to blow up a heavy water planted Norway that the Nazis wanted to use the developed atomic bombs\nThe operation inspired stories books and the Nineteen sixty five war movie the heroes of told mark Netflix has its sights set on top of one hundred million mark and subscribers drawn to its movies and original programming but it'll cost the video streaming service an additional two billion dollars to keep that dream alive\nThe two billion that Netflix plans to raise a bond offering comes on top of nearly twelve billion dollars in debt the streaming service already\nHas this is NPR News\nHurricane alerts are in effect across portions of Mexico's western coast Daniel Brown of the national\nHurricane Center says hurricane will up has intensified into a category five it could be catastrophic for residents and tourists by the time it hit slammed between Muslims and poor to buy our to this week\nWe're expecting an extremely dangerous scam surge along with a damaging hurricane force winds as well as a potential for flooding rainfall users are very mountainous where it will be making landfall and that can cause flash flooding and landslides\nHas top sustained winds of one hundred sixty miles per hour its forecasts to weaken slightly before it makes landfall\nNearly a million people in Austin, Texas are being ordered to boil their tap water due to high concentrations of silt in the city's water supply from member station K. U. T. jokes if he has detailed Austin's water utility director Greg moved there is a historic flooding in central Texas over that\nFrom member station K. U. T. jets if he has detail\nAustin's water utility director Greg ... says historic flooding in central Texas over the past week has inundated the city's water treatment plants with unprecedented concentrations of silt\nThe water in the river is still very very turban it looks like chocolate milk or milk shake for example a typical of drinking water is point three in the use of clarity or your bitty the river water is over four hundred we've never seen it to that level before\nHe explains the city's water pressure must be kept high enough for fire protection resources and that means the tap water going out is not up to its standards for consumption this morning bottled water sold out quickly at several local grocery stores as it remains unclear when the boil order will be lifted\nFor NPR News I'm Joseph ... you know this is NPR\nSupport for NPR comes from NPR's stations other contributors include farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life ups and downs coverage options and more information can be found at farmers dot com and the ... foundation\nBut\nSurely full week ahead here's the weather forecast tonight and those will be on the upper thirties with mostly cloudy skies tomorrow a forty percent chance of rain showers in the afternoon highs will be in the mid fifties\nTuesday night lows in the upper thirties partly sunny Wednesday high on the upper forties Wednesday night was dropping to the upper twenties and then mostly sunny on Thursday highs will be in the mid forties you're listening to public radio W. V. I. A. F. M.\nProgramming on W. V. I. is made possible by our members and by Pennsylvania College of technology thinking about college hoping to land a great job after earning your degree think Pennsylvania College of technology with one hundred plus bachelor\nAn associate's degrees an exciting career fields industry standard labs in uh Ninety six percent graduation placement rate pen college is perfect for hands on learners visit P. C. T. dot edu to learn about Penn college degrees that work\nThanks for staying with me on my ... coming up is is our ear to the birthday\nOf Franz Liszt the composer and pianist conductor or the father of the symphonic poem and will celebrate by hearing one of those or fee is also the first ... on the list and we begin with music of Mozart one of his so called Salzburg symphonies which are actually develop anti\nThis was the first of the collection of three the developmental number one in the play by members of the ...\n[noise]\n\nMusic of Mozart the developmental number one in ... thirty six lay by members of ... ... ... conducting coming up look at those are state book and then birthday greetings fronds list was your what are we symphonic poet Hi Larry would go please stay to\n[noise]\nHere W ... hey we also feature recordings by the audience chamber orchestra one of the world's foremost cheaper orchestras your them live in concert Saturday\nNovember third at seven thirty PM at the Y. center at ... University in St Louis or the program is titled stars aligned joining the orchestra for this conflict will be two innovative artists not the U.S continues to the rule the accordion and Israel's I'll be I'll be tall mandolin door reinventing these times\nIt's not as ... or all the accordion at Israel's Avi Avi town mandolin door reinventing these time honored instruments\nThe program the teachers have doubled concerto by Bach and concert music my film composers including Nino rough time for more information go to Bucknell dot edu slash wise center\nW. V. I. A. celebrate hundreds of regional art and cultural organizations for details on many more events check the W. B. I. A. art scene calendar and catch up on art scene pod cast a W. V. I. A. dot org slash our [noise]\nThis is the composers date before October twenty seconds John [noise]\nGeorge Frederick handle is the composer credited with inventing the organ concerto back in the ... century\nScandal was virtuoso performer on the organ and as a special added attraction during the London performances of some of his biblical oratory ... one of handles can share those would be used as a kind of intermission featured\nThis served to showcase handled skill as an organist and perhaps to give a singer is a chance to catch their breath between sections of the oratory [noise]\nToday in Nineteen Ninety a very different kind of Oregon concerto premiered on a CBC Radio broadcast from the Calgary organ festival competition [noise]\nSnow Walker by American composer Michael Cole grass is cast as an impressionistic musical picture of the far north and the fortitude humor and spirituality of candidates native India with people [noise]\n\n\nThe work is dedicated to hardly ... the author of never cry will the story of life in the far north may popular into Disney movies [noise]\nHolding both cries from a trombone of your ankle grasses score along with surging winds of up all their landscape and vacations of India with throat singing culminating in rambunctious dance finale [noise]\nIt's all very far cry from Eighteenth century London but still in the tradition of handles virtuoso show pieces for a master organist\nComposers date book is supported by ... online test prep for the ACT that's\nDesigned to boost scores students can get video lessons practiced question expert support online prep smart go far and enjoy the ride at ...\nDot com slash ACT composers stay focused produced by age the American public media in conjunction with the American presidents forum reminded you that music was one [noise]\n\nToday is the birthday of one of the most influential musicians of the romantic period\nIn the nineteenth century an influence that carry into the twentieth century Franz Liszt was born other state in Eighteen eleven one of the great pianist of all times and also a composer conductor impresario a\nAn educator he was father the music of the future looking ahead to the possibilities that can be a mind out of the romantic at at at aesthetic\nAnd one of the things he invented the symphonic poem and so it was celebrated his birthday by hearing this is a some honeycomb number four which tells a episode from the the um [noise]\nA fictional life of the mythical character or the U.S here we have about ... or ... or ... or the U.S by Franz Liszt\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\nOr ...\nOr ...\nMm\nMm Mm Mm Mm\n\n\n\n\n\n\nMm Mm\nMm\n\n\n\n\n\n\n... ... ... Mm Mm\nGet top dollar for it and use those funds to support the w._b. I ate mission called eight for for W. VISA card that's eight for poor W VISA card or visit W. V. I. A. dot org slash cars to learn more and as always thanks for your support for W. vi and\n\nThis was WBRC eighty nine point nine up M. W. B. I. H. D. one Scranton Wilkes Barre his will and we're in Williamsport WTY eight eighty nine point seven FM in Mansfield a W T I O eighty eight point three of them were like well I'm humpback a W. P. A. U. Ninety One point five about them\nStreaming live at W. V. I. A. dot org we have a translator and collect stomach at Ninety three I found your arts any information station listener supported public radio W. V. I. S.\nMusic by women composers of the past and present are featured on WB I ate suddenly grand concert like none of Comey wrote down\nThe holy resides in eastern she is the world of the country on Sunday afternoon listen that's highly ... music composers such as Clara Schumann and jumped time [noise]\nOne of the afternoon listen as highly performs usually by composer such as clever shoe on an Joan\n\nThe audience would regret causes lovely up to the um on the public\nAnd the next fresh air Melissa McCarthy\nFind myself in a rather [noise]\nMcCarthy stars in the new film can you ever forgive me as a biographer turned literary for germ we'll talk about the film growing up on a farm for early comedy act hurling bridesmaids and playing Sean Spicer on Saturday Night live join us\nReceiving a six after all things considered on but we'll be beyond a of them\n\nLive from NPR News in Washington I'm Lakshmi Singh newly released surveillance video appears to show a man wearing some of the same clothes Washington Post columnist or ... he was wearing the day he was last seen all live in the Saudi constantly in Turkey\nA Turkish ruling party officials said footage of an apparent double\nIts further evidence of premeditated murder and a cover up by Saudi Arabia\nA claim crown prince Mohammed bin Salman denies however over the weekend the Saudi Government conceded for the first time that ... was dead blaming it on an altercation not a hit order by member of the Saudi royal family with still so many questions surrounding the journalists final moments inside of the Saudi conflict weeks ago\nThe German government says it's a spending arms sales to Saudi Arabia\nAnd does that mean Nicholson tells us chance for uncle America was urging other countries\nTo do the same speaking as a news conference American announced such until ... knew about what happens to the Washington Post gender Jemma ... Germany will cease exporting weapons to Saudi Arabia\nShe said we condemn this act and the strongest tends not insisted that those responsible for his death will be held to account\nFor joining Saudi claimed that she ... she was killed in a sit tight Germany's economy minister ...\n... other ... members to follow suit and also still palms exports until more is known about what happened to him and he is among the world's leading expulsions of weapons to Saudi Arabia together with the U.S Great Britain and France for NPR News I'm asked me to listen in by\nPresident Trump campaigns for Senator Ted Cruz in Houston tonight after recently declaring plans for another major tax cut for the middle class but NPR's Mara Liasson suspects just talk he's just making it up as he goes along Congress's ... they can vote on this\nBut he said it's going to be major it's going to be for middle income people why because the tax cuts that they already passed or not popular Republicans thought they'd ride these the tax cut bill to victory in November\nBut people don't buy it NPR's Mara Liasson will besides the mid term some potential democratic candidates already eyeing the twenty twenty presidential race including Vermont Senator Bernie Sanders who's on a nice day tour Here's NPR's off for college\nBernie Sanders warn folks that if they don't the Democrats will lose he said in the last midterm elections in twenty fourteen roughly two thirds of Americans did not vote\nOr working people started all lower income people sort of it'll be both callers fertile young people said oh not too far but it's a thought\nHe was [noise] Sanders also saying this Wisconsin crowd for supporting him in his twenties sixteen presidential bid and suggested he's ideas on health\nCare and the economy are more relevant than ever Sanders is one of many possible democratic presidential hopeful stumping for midterm candidates along with former vice president Joe Biden and senator Cory Booker Asma Khalid NPR News\nThis is NPR News\n\nTrump is threatening to reduce or completely cut\nThis is NPR News\nPresident Trump is threatening to reduce or completely cut off aid to Guatemala Honduras and El Salvador\nHe's protesting the caravan of thousands of migrants from those countries traveling north to the United states on Twitter Trump says the three Central American countries which received a combined five hundred plus million dollars from the U.S in the last fiscal year lose that funding if they don't keep their citizens from leaving and attempting to cross into the U.S illegally\nMeanwhile Mexico's president elect suggests that his country the U.S and Canada work together to fund development in poor areas of southern Mexico and Central America [noise]\nDrugs widely used to treat the ... in the intensive care unit are in fact not effective according to a study in the New England Journal of medicine NPR's Richard Harris has that story\nAnti psychotic drug such as how ... have been used for forty years to treat delivery him which is a confused and sometimes agitated state common in critically ill patients the\nDrugs do help calmed down patients but a study involving more than five hundred volunteers shows that at our psychotic drugs are useless in treating delivery him itself\nLikewise the study found that related drugs called atypical antipsychotics don't create delivery him either ICU doctors have known for years that the evidence for using these drugs to treat ... week experts in the field say this major study now provides strong evidence that they simply don't work for this purpose Richard Harris NPR News\nThe Dow is down thirty three points at twenty five thousand four hundred ten as some he's down to a twenty seven sixty four now that is that forty six points this is NPR\nSupport for NPR comes from the three I owe the powering enterprise digital transformation with artificial intelligence predictive analytics and I oh these illusions learn more at the three I O T dot AI and the ... foundation at ... dot org\nA chilly fall week ahead here's the weather forecast tonight and those will be on the upper thirties with mostly cloudy skies tomorrow a forty percent chance of rain showers in the afternoon eyes will be in the mid fifties\nTuesday night lows in the upper thirties partly sunny Wednesday high on the upper forties Wednesday night moves dropping to the upper twenties and then mostly sunny on Thursday highs will be in the mid forties you're listening to public radio W. V. I. A. F. M.\nProgramming on WB I is made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your arts that information station W. V. ...\nThanks are tuning in on Larry would go a good afternoon\nI Hope you had a great weekend and coming up in his final our classical music on this Monday music old and new we're going to hear music from the ... century from the nineteenth century and right now from the Eighteenth century we have excerpts an orchestra sweet\nTaken from the opera rotor Linda of George Frederick handle played by the ensemble ... Ninety under the direction of Simon Standage\n[noise]\nVariations for guitar and strings please do state June ... go\nOn for ... donuts any comedy slowly\nThe minds mainly because while I tried to marry for money\n\nTo be the lead them my teacher and I read the on the wrong road hiding stover Lawrence friendly gives me to\nJoin us for done that's going on station [noise]\nSaturday afternoon at one [noise]\nClouds with some rain and the forecast tonight mostly cloudy lows will be in the upper thirties a forty percent chance of rain showers tomorrow afternoon with high on the mid fifties\nLos dropping to the upper thirties on Tuesday night in the upper ... Wednesday night partly sunny Wednesday high and the upper forties mostly sunny Thursday highs of the mid forties this was WB I Am your arts and information stations\n\nAre you weren't ducks in a row\nAlmost half of Americans do not have a proper sting plan\nIs the plans are more than matters of money and inherited deacon guide your future health decisions and\nSpecial instructions for loved ones in your care put your mind at by getting your ducks in a row today [noise]\nTo request a brief planning God contact ... W young [noise]\n\nBut now it's musical modeled Giuliani he was a guitar virtuoso in the\nEarly um nineteenth century was one of the number of guitarists who brought the guitar out of the realm of folk music and into the concert hall and this was an introduction steam and variations with the pollen is for um a guitar and string quartet\nAnd he begins the introduction as\nA he stayed with great importance and\nI'm taking his job very seriously and then the theme is not his own it is from um a song or from an Oreo by ... know call up you know on me sent though maybe using it when you were taking voice lessons as a youngster then he has the variations in ends with this a delightful pollen has\nThe ... string quartet performs the guitarist Richard so be no music model Giuliani\nUm\n\n\n\n\n\n\nI'm Larry voice get would just be handed all Castro street using material from keyboard pieces from the Elizabethan era please do stay tuned\nProgramming on WB I is made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your arts that information station W. V. a a fan\nBut surely full week ahead here's the weather forecast tonight lives will be on the upper thirties was mostly cloudy skies tomorrow at forty percent chance of rain showers in the afternoon highs will be in the mid fifties\nTuesday night let us in the upper thirties partly sunny Wednesday high on the upper forties Wednesday night was dropping to the upper ... and then mostly sunny on Thursday highs will be in the mid forties you're listening to public radio W. V. I. A. out that\n[noise]\nThis is music fit for king king George the second to England to be precise and and some written by handle each one of the works off next concert of corals Saudi of northeast Pennsylvania Sunday November for the poor via athlete Stevens will [noise]\nDr Eli Baker will conduct a program of English Baroque I'm from works course than orchestra written for teams do including this coronation anthem forward towards the second [noise]\n\nEnjoy a loyal musical Sunday November for for more information go to choral society Dr [noise] nobody celebrates hundreds of regional art and cultural organization for details on many more events check the w._b. I ate artsy talented\nAnd catch up on our ... half the w._b. I ate dot org slash aren't listening for art scene with Erica hunky weekday\nTo check the W. B. I. arching calendar and catch up on our podcast the W. B. I. E. dot org slash aren't listening for marching with Eric and funky weekday mornings after the news at eleven on WB I Am\nThanks for staying with me I'm Larry voice gallon now some keyboard music re fashion for orchestra\nIn the renaissance in into the ... early ... there was a particular English type of parts of the court called the Byrd journal\nAnd one of the masters and it was ... one of the twentieth century composer at the rubber ... took a number of these pieces virginal and orchestrated and put them into the sweet that we'll hear now improvisations on virtual pieces by Dallas ought to be played by the ... other homes who but chancellor\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\nOr the\n[noise]\n\n[noise]\n[noise]", "show_name": "Classical Music with Larry Vojtko", "year": "2018", "city": "Williamsport", "day": "22"}