{"month": "10", "state": "PA", "station": "WVYA", "content": "And then it's for you to the award winning news magazine all things considered on your arts an information station [noise]\nOn this week's broadcasted the San Francisco to use the director Michael Thomas brings out all the colors of the orchestra solace and whole sections of what's going to get a chance to shine individually and collectively music by bar talk multari Samuel Adams that next time the San Francisco to [noise]\nSend it to this is W. B. ... W. V. I. H. D. one scratching Wilkes Barre hazel and W. B. Y. eighty nine point seven Williamsport WTO eighty eight points ... Mansfield at least one of ... W. P. A. you not one point five FM ... ship\nAnd translators W to walk to a T ... W to eight nine ... sundry W to zero seven eight Williamsport and don't lead to seven eight ... wells borough listener supported public radio\nEvery day thousands of Pennsylvania and mothers fathers children neighbors struggled to overcome addiction\nThat is why Pennsylvania's public media stations have come together for battling opioids theories of educational\nPrograms to focus on increasing awareness and reducing the stigma around opioid addiction to these stories and find the resources available to you did the battling opioids dot org together we can save lives major funding provided by Geisinger\nLive from NPR News in Washington I'm winter Johnston President Trump is dismissing democratic calls to impeach Supreme Court justice Brett Kavanaugh speaking to reporters before heading to Florida Today Trump called the sexual misconduct allegations against cap and all at democratic hope when you\nMention the just the United states the resource for the top dollar to stop it like I don't get nothing wrong with no operation up any time Trump\nPlans to host cabin all at the White House tonight for a ceremonial swearing in he was officially sworn in at the Supreme Court on Saturday\nThe Nobel Committee today awarded it's two thousand Eighteen prize for economics scientists to two economists NPR's Nick fountain reports their work focuses on innovation and climate change\nNormally today economists are waiting by their phones but NYU's Paul Romer\nForeign called morning and I didn't answer either one because I thought it was some damn call so I wasn't\nWhy you Paul Romer to foreign call this morning and I didn't answer either warm because I thought it was some ankle so I wasn't [laughter] I was honored strictly murderers\nRumors work is about economic growth and how to keep economy is growing his insight\nGovernments need to create the right incentives for innovation strong Patton systems for example he shares the prize with William Nord house of you whose work is on how economies interact with the environment and climate and similarly says\nGovernments have to get the incentives right for example with a carbon tax and people have been listening his work has been used by the EPA and the un inter governmental panel on climate change\nMixed up to an NPR News New York\nThe major league baseball playoff continue with three game today NPR's Tom Goldman reports of Houston and the LA Dodgers had a chance to clinch their opening playoff series\nThe Houston Astros are looking very much like baseball's defending champions they leave the Cleveland Indians two games to none and their best three at a five game series and pitching is a big reason why I asked for his pictures of held Cleveland batters to six hits in sixty advance\nThe Indians are hoping the series shifting back to Cleveland helps them get their off and it's going\nThe Dodgers also can advance to the next round with a win over Atlanta\nBut the Braves grabbed the momentum Sunday beating LA with tubing home runs a grand slam by twenty year old Ronald attuned your junior and a solo home run by Freddie Freeman that turned out to be the winning run finally arch rivals Boston and New York resume their series today tied at one game each Tom Goldman NPR News\nHurricane Michael is lashing Cuba as again strengthen the Atlantic ocean forecasters predict it will come ashore along parts of Florida's Gulf Coast as a category ... storm by mid week stocks are trading lower on Wall street\nAt this hour the Dallas down one hundred forty six points the NASDAQ down one hundred twenty to this is NPR\nThe death toll from a powerful earthquake and tsunami that hit central Indonesia almost two weeks ago is nearing two thousand NPR's Lauren Frayer reports from ... one of the hardest hit areas I think she'll say one\nThousand nine hundred forty eight people are confirmed dead many of them died here in ... but the real number maybe many times that figure up to five thousand could be buried under mudslides and their bodies may never be recovered the government is considering declaring three polish neighborhoods and memorials and mass graves\nNPR's Lauren Frayer reporting scientists say they have identified the first genes linked to erect tile dysfunction as NPR's Michaeleen Doucleff reports the findings may help with the development of new treatments\nOr reptile dysfunction is extremely common it affects about twenty percent of men over age forty scientists have known for a long time that genes can affect a man's risk for the problem but it's been difficult to pinpoint which genes are most important\nNow scientists at Kaiser Permanente northern California are starting to change that the team analyze genes for more than thirty six thousand men in fact one little piece of DNA which raises a man's risk by about twenty five percent\nTo scientists think the DNA influences neurons in the brain that control sexual function the findings which appear in the proceedings of the national Academy of sciences offer clues what causes reptile dysfunction in a new strategy for developing drugs to stop it Michaeline do class NPR News\nOn Wall street the Dallas down one hundred thirty nine points I'm with your Johnston NPR News from Washington\nSupport for NPR comes from NPR's patients other contributors include heritage are working to transform how businesses work through their power\nSupport for NPR comes from NPR station other contributors includes Herod data working to transform how businesses work through the power of data using pervasive data intelligence Tara data leverage is all relevant data to deliver answers to complex business issues Tara data dot com\n\n[noise] here's the weather forecast for the W vi listening area\nMostly cloudy with a slight chance of some showers and thunderstorms today through tonight daytime ... seventies overnight lows in the low sixties mostly cloudy tomorrow morning then try and partly sunny with high to the mid seventies\nCloudy Tuesday night lives in the sixties and partly sunny Wednesday highs once again in the middle seventies you're listening to W. vi your arts and information station\n[noise]\nJoined us for a celebration of one hundredth anniversary of the birth of later\nSunday afternoon at three Gary and Bernadette Byrd with Iran is Richard McDonald's\nA program that includes excerpts from states where\nDeemed west side story\nThat's one of the early clarinet on WB I ate and the Dietrich Caesar invited to enjoy this time through divorce or donate theater make reservations or do we need more or fall by seven zero six five five to eight\n[noise] good afternoon on Larry voice Gail thanks for tuning in on this Monday\nI Hope your weekend went well coming up a little bit later I doubled country held by composer mocks Bruce his clarinet and viola concerto an early ... didn't ski music of John Ireland a symphony or by buckled any a little bit later in this hour and we begin with one of the earlier piano concerto those of Mozart\nWhen he moved to Vienna was trying to make a name for himself Anna living he arranged a series of subscription concerts and would sell the subscription some tickets to these concerts in would write music specifically for these concerts this was a common practice at the time\nAnd this was a reason for one of those the piano concerto number eleven you have\nOne of three concerto zeroed in Vienna Seventeen D D to here's Alfred rental with the Academy of St Martin in the fields under Sir Neville Mariner in music and boats art\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n[noise] [noise]\n\n\n[noise] [noise]\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n\n[noise] [noise]\n\n[noise]\n\n[noise]\n[noise] [noise]\n\n\n[noise] [noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[laughter]\n[laughter]\n[laughter]\n\n[noise]\n[laughter]\nUh [laughter]\n[noise]\nUh\nUh [noise] [noise] [noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\nUh\nThere\n\n\n\n\n[noise]\n[noise]\n\n\n[laughter]\n[noise]\n\n\n\n[noise]\nOr a a\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\nMm [noise]\nMm\n\n\n\n\n\nThis was WBRC eighty nine point nine F. M. W. V. I. H. D. once granted Wilkes Barre hazel ... we're in Williamsport it WTY eight eighty nine point seven at the end you advance to build a W T I O eighty eight point three of them were like well I'm hot packet W. P. A. U. Ninety One point five about them\nStreaming live a W. V. I. A. dot org we have a translator in clock so much at Ninety three I found your arts any information station listener supported public radio W. V. I. S.\n[noise]\nAdapted Roy theory ever imagined that the instruments to which he ministers in the fifties and sixties would be regarded as national treasures but they are and we share them with special concert shrimp killed during Longview in Shreveport to preview the upcoming used Texas organ festival this week on pipe dreams from American public media\nMichael Barone I Hope you'll be listening [noise]\nSunday Morning at six on WB I Am\n\nWhen the Greek debt crisis had many European officials supported letting a Chinese shipping company takeovers record will now some European observers have regrets\nThey find out if they if they're if they find out to be the [noise] and give it up a sign of\nGaining a foothold in Europe the kind of respect for the next MORNING EDITION [noise]\nTomorrow morning from five to not on W. B. I. A. F. out\n[noise]\nLive from NPR News in Washington I winter Johnston President Trump will crisscross the country this week in an effort to build support for Republican the head of November midterms NPR Shannon ... reports tropical whole campaign rallies\nThe country this week in an effort to build support for Republicans a head of November midterms NPR Shannon bent sand reports tropical whole campaign rallies in four states\nTrump will travel to Iowa at Pennsylvania Ohio and Kentucky he's expected to help the economy and urge voters to head to the polls in November over the weekend at a rally in Kansas Trump celebrated Kavanaugh's confirmation and ramped up his attacks on Democrats\nDuring our son is doing left wing mob and [noise]\nAll four hundred and thirty five members of the house are up for reelection and one third of the Senate is one hundred seats while also being on the line Democrats need to win twenty three seats to gain control of the house ... NPR News Washington\nA un report is calling on countries around the world to do more to combat global warming as Larry Miller reports scientists are warning of severe environmental changes including heat waves devastating storms droughts and a lot of species\nThe only ... says even keeping the earth's temperature rise to the two degrees centigrade targeted greed of the Paris climate change talks is too high when the world is heading toward of three degree rise\nThe IPC she says only by dropping to one point five degrees and the worst effects of climate change for you avoided\nIts report says manmade zero to emissions me to drop to zero by twenty fifty also renewable energy would need to supply up to eighty five percent of electricity compared with twenty five percent no\nOne I PCC board member warns there is only the slimmest chance of avoiding unthinkable damage to the climate system that supports life as we know it\nFor NPR News I'm Marie Miller in London\nPakistan's Supreme Court has heard the final appeal of a Christian Woman who's been sentenced to death for black to me and the arts and the hippie reports it emerged as one of the most important cases in years to reach the Supreme Court there\nThe cotton reserved it's judgment on the appeal and didn't say when it would be announced over the years the case against us your baby has led to the assassination of two senior officials one of them was murdered by his buddy God who is now revered as a news St by the religious right\nThe case also released a powerful extremist movement and their leaders wound of terrible consequences if ... was granted leniency\nNPR ... reporting from Islamic bought\nThe death toll from a powerful earthquake and tsunami that struck central Indonesia and nearly two weeks ago is nearing two thousand search and rescue crews continue to come through mud and debris on silhouette the island searching for survivors thousands of people are unaccounted for\nDr trading lower on Wall street at this hour the Dow is down forty two points the NASDAQ down eighty three B. S. and P. down nine this is NPR\nHurricane Michael is pounding Cuba with heavy rain and high winds as it makes its way toward the Florida Panhandle ... at the national Hurricane Center says the storm is predicted to gain strength and the next few days\nWe do expect that it's going to speed up the Gulf of Mexico was closer to the Florida Panhandle of Florida Big Bend area by\nForecasters say Michael could come ashore along Florida's Gulf Coast as a category three and storm the unemployment rate is at its lowest level in nearly fifty years which means American retailers and might have to try a little harder to fill their seasonal hiring lots of the year NPR's Camila Domonoske reports\nBeginning of autumn brings changing colors the start of the school year and a wave of temporary hires as retailers get ready for the holiday crush fifty five thousand workers for FedEx eighty thousand at Macy's target is looking for a hundred and twenty thousand\nGet ready for the holiday crash fifty five thousand records for FedEx eighty thousand at Macy's target is looking for a hundred and twenty thousand\nBut unemployment is low and American workers have more options and they used to consulting firm challenger gray and Christmas says companies need to offer either competitive compensation or perks\nAmazon recently announced all its employees including temps and seasonal workers will make at least Fifteen dollars an hour and target is giving new hires the chance to win a five hundred dollar gift card\n... NPR News facts\nAre can can you link to train lower on Wall street the Dow Jones industrial average is down thirty nine points at twenty six thousand for seven and I had the down eighty five points the S. and P. five hundred down eight this is NPR News in Washington\nSupport for NPR comments from NPR stations other contributors include progressive insurance offering its home quote explorer so shoppers can evaluate options in one place when buying home insurance custom quotes and the rates are available online learn more at progressive dot com\n\nOur milder temperatures continue through the mid week here's the weather forecast ... mostly cloudy with Louis in the lower sixties and a slight chance of showers and thunderstorms\nTomorrow mostly cloudy in the morning they're becoming partly sunny ... going to be it's seventies tomorrow night mostly cloudy lows in the mid sixties Wednesday partly sunny ... of the mid seventies for Thursday showers and friday mostly sunny and\nCool with high then in the fifties you're listening to W. V. I. A. F. M. public radio\nProgramming on WB I is made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your arts and information station W. V. I. A. F. M.\nHello again I'd ... things were staying with me coming up later the double concerto for Claritin viola of ... and early piece by e Gore strip Vince ski\nAnd we'll hear about a premier of history and ski work on this date in the Nineteen forties or the ... state book but right now off to London town this is an overture by John Ireland\nAnd it's a reworking of a piece for brass band a comedy of the trip and he uh than a flush it out into this a piece for full orchestra making some revisions it is a tour of the great city as you might expect\nAnd the prevailing motif is interesting and I'm using a it is based on the bus ... call\nAs you're traveling about and ready to get off the Piccadilly Piccadilly Piccadilly you'll hear that rhythm threw out a London overture of John Ireland here's the London symphony under so John ... really\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\nI Hope you enjoyed our visit to London music of John Ireland a London do that you're played by the London symphony under Sir John barber really\nOn Larry voice go just a bit we'll open up the composers date book here about a piece by strict ... we'll also hear some early music is Devinsky and later a double concerto something a bit unusual for clarinet viola an orchestra so please do stay to\nThe Y. Center for the performing arts presenting Cristina Pato ... bagpipes on Thursday October eleventh at seven thirty PM at the white center tickets available at Bucknell dot edu slash box office or five seven zero five seven seven one thousand\n[noise] at the white set around the capital to Bucknell University Sunday October fourteen foot UPN\nEnjoy a concert by the chamber orchestra that\nDeal onto the Canadian ensemble is known for its interpretations music of the seventeenth Eighteenth century\nBut also regularly gels or to the repertoire the nineteenth and twentieth century\nThe Y. center program includes works by torturing\nAs well as Philip Glass [noise]\nJoining the orchestra will be renounced counter ten or\n... Johnson\nLivio don't do that by John only one Sunday afternoon October fourteenth for two for more information Bucknell dot edu slash whites than [noise]\nWB I celebrate hundreds of regional art and cultural organizations for details and many more of an checked the w._b. I ate marching calendar and catch up on arching podcast the W. V. I. I. dot org slash arts listen for art scene when Ericka funky weekday mornings after the news at eleven on WB I Am\n\nThis is the composers date before October eight I'm John Jack the Russian Revolution of Nineteen Seventeen wiped up many family fortune and many Russian immigrated\nTo flood the Bolshevik said to start from scratch in exile\nNatalie ... however was not one of them\nFor family fortune was fairly diversify so even the loss of or large Russian holding left or with considerable wealth elsewhere in Europe [noise]\nAnd since Natalie was married to the\nRussian immigrate music publisher conductor and new music impresario Syracuse risky\nThat meant a number of famous twentieth century composers benefited as well [noise]\nIt's not an exaggeration to say that culturally speaking without ... the history of twentieth century music would have been noticeably poor [noise] when Natalie died ... music foundation in her honor one of the foundations memorial commissions was premiered on today's date in Nineteen forty three\nBy the Boston symphony led by ...\nThis was a three part symphonic oh written by ... feet and dedicated in that lens member [noise]\nThe second movement that's driven skis owed was actually a bit of recycled film music [noise] ... originally intended for a hunting scene in the June ... Orson Welles cinematic version of the novel Jane\nEyre plans for that film progress however ... he was replaced by the more experienced film composer Bernard Herman who had worked with Orson Welles and a number of previous films and radio play [noise]\nComposers date book is supported by ... online test prep for the ACT it's\nTo improve scores students can get video lessons practiced\nQuestion expert support on line\nSupported by mongoose online test prep for the ATP designed to boost scores you can get video watching\nQuest expert support online smart go far and enjoy the ride at ... dot com white ATP\nComposers date book is produced\nBy eight PM American public media in conjunction with the American soldiers for reminding you that all music was once new\nLet's hear some early music on e Gloucester getting ski he's studied was risky course the cough\nAnd we're going to hear the second piece for orchestra that he wrote but the first that he wrote with out the guidance of risky course the cough\nAll on his own he was inspired by an essay by meddling the life of the bees and originally he was going to call this these bees\nBut settled on skits ... the hope is reinforced Devinsky who played by they was concerned about workers drove Amsterdam under ...\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\nMm\nWell\nWell well\n\n\n\n\n\n[noise]\n[noise] oh\n\n\nMm\n\n\n[noise] [noise]\n\nMm\n[noise]\n\nNo\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\nA program that includes excerpts from states where the cat the west Side Story that's one of the early clarinet Saddam WB I ate and the ... in like you do enjoy this concert tickets or donate the Internet to make reservations a double the Newtown lord or phone by\nZero six five five to eight\nThis is W. V. I. eighty nine point nine a pound W. V. I. H. D. ones granted Wilkes Barre eagles in Williamsport W. B. Y. eight eighty nine point seven I found in Mansfield WTO eighty eight point three I found out at like while I'm pop back\nW. P. A. U. Ninety One point five FM streamed live at W. B. A. dot org we're in Allentown to Ninety nine point three any Bethlehem at well five point seven member supportive public radio W. V. I. S.\nHen a desert the elections are good for democracy is fundamentally flawed and I'm not sure if they could be fixed his idea replaced politicians with randomly selected citizens work when people do this\nPeople make trust to balance petitions hacking the law next time on the head\nWork when people make from about hacking the law that next time on the Ted radio hour from NPR Saturday afternoon or W. B. R. A. up out [laughter]\n[noise] when Leonard Cohen died and twenty sixteen he left behind many unpublished poems and lyrics some of which have been collected in a new book on the next\nFresh air we talk with his son Adam Cohen who wrote the introduction at I'm also produced you want it darker the album his father recorded shortly before his death join us [noise]\nBut it's evening at six after all things considered on W. V. I. A. F.\nLive from NPR News in Washington I'm winter Johnston President Trump is keeping a top Justice Department official on the job for now NPR's Scott Horsley reports deputy attorney general Rod Rosenstein traveled with Trump to Florida earlier today\nRosenstein state has been a question mark for several weeks since the New York times published a story saying among other things that the deputy attorney general had discussed secretly tape recording the president last year\nRosenstein has denied that report Trump spent about thirty minutes talking with the deputy attorney general aboard air force one of the two men made their way to a police convention in Florida a driveway\nBroad I didn't know rod before but I've gotten to know but I get along very\nRosenstein his job is politically sensitive because he oversees special counsel Robert Mueller's investigation of Russian interference in the twenty sixteen election Scott Horsley NPR News Washington\nHurricane Michael is intensifying in the Atlantic as it takes aim at Florida's Gulf Coast speaking to a law enforcement group in Orlando President Trump today are trends in in the heat caution\nAs hurricane Michael news landfall we're working with state and local officials in lord of the day goal messages are precautions and we're ... residents to be prepared\nThe national Hurricane Center expects Michael to hit the panhandle or big then by mid week forecasters say it's likely to come ashore as a category three hurricane new laws aimed at the prevention of sexual harassment on the job go into effect tomorrow in New York NPR's Yuki Noguchi reports\nThe new laws take effect almost exactly a year from the start of the me too movement public allegations of sexual harassment and the resulting Alister of many leaders in industry and government have transformed the workplace culture\nThe new laws require every employer to conduct interactive prevention training of all its workers every year it also requires employers to publish and provide their policy to employees\nAnd inform them about how to file complaints experts say while many larger employers already has sexual harassment policies in place many smaller ones are unaware that this new law also applies to them you can ... NPR News Washington\nThe national Transportation Safety board is working to determine the cause of the deadly limousine crash in upstate New York when it's that said the limo rent a stop sign into Harry outside Albany on Saturday and slammed into a park SUV\nTwenty people were killed Eighteen in a limo and to the desk trans federal authorities say the accident is the deadliest us transport crash in nearly a decade\nStocks are trading mixed on Wall street at this hour the Dallas up forty points than NASDAQ down forty the U.S and the five hundred up a fraction you're listening to NPR News in Washington\nThis year's Nobel Prize in economics is being shared by too\nYou're listening to NPR News in Washington this year's Nobel Prize in economics is being shared by two American researchers one at Yale University and the other at New York university\nOne path to William ... dolls for integrating climate change in the long run macroeconomic analysis of the other half support em Romer forty integrating technological innovations in the long run macroeconomic analysis\nThat the ... with the royal Swedish Academy of Sciences making the announcement today install calm\nThem is the new number one movie on the domestic box office charts decide by feature took in an estimated ... million dollars over the weekend NPR's Trina Williams has more on the top five releases\nThem big opening as a record for an October new release the character is associated with marvel comic book universe Sony Pictures brings the former Spiderman and images to the big one\nHold on power to say\nSame as says Tom Hardy Michelle Williams and risk a med starring this mix of science fiction fried action and a bit of weight a star is born where you make with Bradley Cooper and Lady Gaga out paces expectations for strong baby like number two small flip flops that third wall last weekend's winter nights false to fourth\nThe house with a clock and it's ... also did finishing fifth\nTrina Williams NPR News\nI'm Windsor Johnston and you're listening to NPR News from Washington\nSupport for NPR comes from NPR stations other contributors include the ... foundation since Nineteen eighty five supporting advances in science education and the arts towards a better more just society more information is available ... foundation dot org\nOur mild temperatures continue through the mid week here's the weather forecast tonight mostly cloudy with Louis in the lower sixties and a slight chance of showers and thunderstorms\nTomorrow mostly cloudy in the morning they're becoming partly sunny ... going to be at seventies tomorrow night mostly cloudy lows in the mid sixties Wednesday partly sunny ... of the mid seventies\nFor Thursday showers and friday mostly studying and cool with high when in the fifties you're listening to W. V. I. A. F. M. public radio\n[noise] like what you see on WB I a view enjoy fine programs like pull dark nova or nature the your kids love watching the antics of Elmo on Sesame Street enjoy sit at the science cuter curious George how 'bout shows like called the doctor Pennsylvania pogo or scholastic scrimmage\nWhatever the reason you watch we want you to know that you make it all possible become a member today and ensure the future of your favorite programs that W. V. I. A. dot org\nAnd thank you for your support for W. V. I. A.\nProgramming on WB I is made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your arts and information station W. V. A. F. M.\nGood afternoon I Hope your day is going well I'm Larry voice go and this was the final our classical\nMusic on this a day of October twenty Eighteen a violin concerto by a friend of hide in a little bit later we have chamber music biased doomed to Mozart and we begin with music of Antonio Vivaldi the king of ... if you will\nAnd this was a double concerto four string instruments one plugged in one bowed a Katrina for guitar and a little more in um this is uh\nCould share those four string instruments one block to one vote a Katrina for guitar and to be a little more\nIn this is one of his late works and here we have performed by Rachel bark like I'll be all the more and hug because as soon as the guitars with the ensemble ours on people\nHere is music about Tony how they've already\n\n[noise]\n[noise]\n\n[noise] can Jetta windy minor for guitar village Moran orchestra by on the audio Vivaldi the real catalog number five four zero our soloist Rachel bargain Livio that more and hub ... Smith guitar with the un subtle ours on ...\n... head we have some chamber music\nBy ... had a it's a delightful little trio and I hope you'll stay tuned\nThe owner art center presenting Nicole Henry Saturday October thirteenth at eight pm one of the jazz world's most acclaimed vocalists possessing a potent combination of dynamic vocal abilities impeccable phrasing and powerful emotional resonance six one zero seven you arts or its owner art center dot org\nHere's the weather forecast it'll be mostly cloudy overnight perhaps some showers and thunderstorms this evening and those will be in the lower sixties then tomorrow some clouds of the morning giving way to partly sunny skies or the afternoon highs will be in the mid seventies tomorrow night mostly cloudy Louis in the mid sixties Wednesday partly sunny highs again in the mid seventies\nThursday will be a rainy day\nMostly sunny on friday but cool with ... in the fifties you're listening to W. V. I. F. M. your arts and information station a\nSan Francisco offered present Andrea\n... who who joined dominoes tale of a poet any young noble woman causing the turmoil of the\nFrench Revolution music director Nicole into it's on the leads an international cat teaching young who leave ... George gotten each day in Geneva bridges to join us for Andrea ... on this station Saturday afternoon it was a\nSupport for WBAI comes from sky packet connecting businesses directly to the Internet with Pennsylvania's public broadband network sky packet brings a tear one Internet private network connections and managed network services to Pennsylvania's businesses in rural communities sky packet dot net\nUp at four it's all things considered from NPR News followed at six buy fresh air and our friend George Graham taking us through the evening with the alternative contemporary music and some jazz\nSo all of this program is made possible only through the generous financial support of the community and particularly from voluntary contributions from listeners like you thanks so much for your membership right now it is a trio by you\nDepictions from listeners like you thanks so much for your membership right now it is a trio by Johan nibble poodle\n... was one of the great ... in the early romantic period in this piece is meant merely to entertain ... trio in this music of Johann nickel cobalt ... gonna get\nNa\n\n\n[noise]\n\n\n\n[noise]\n[noise]\nMm [noise]\n\n\n\n\n\n\n[noise]\nNo no no no no no\n\n[laughter]\n\nThe uh\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\nDid you ever wonder if the great composers knew each other and did Wagner no verity did Copeland do strip and ski\nDid heighten no Mozart well\nI didn't did no Mozart and they got together from time to time and place string quartets with two of their friends Karl ... stores\nAnd the composer list violin concerto ... hall here's like agenda when gee play by yourself so with the ... chamber orchestra under this law on WB I\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n", "year": "2018", "show_name": "Classical Music with Larry Vojtko", "city": "Williamsport", "day": "08"}