{"month": "10", "state": "PA", "station": "WVYA", "content": "Programming on WB I is made possible by our members we thank you for your support numbers and by indeed there is more business hiring information that indeed dot com slash hire this is W. V. A. F. M.\nVisitors W ... not FM W. V. I. H. D. one scratching Wilkes Barre hazel and W. V. Y. eighty nine point seven Williamsport WTO eighty eight points ... Mansfield at least one of the ... W. P. A. U. Ninety One point five FM Palmyra township and\nTranslators W to want to a T Clark summit W to eight nine ... son very W to zero seven eight Williamsport and don't need to seven eight ... wells borough listener supported public radio\nWhen political passions rhetoric sometimes inflame and divide us one of the common values that night and inspiring [noise] lose for university recently hosted a program called conversations for the common good the first amendment recorded for broadcast watch Thursday night I'm ever fifteenth of nine on WB I ATV\n... joined an additional interactive panel discussion on free speech in higher education wondering I remember fifty seven route to Eighteen centennial hall at St Louis where University of Pennsylvania\n\nOne year ago the me too movement drew attention to the widespread problem of sexual harassment now the movements power is tested at the ballot box [noise]\nI'm not willing to compromise my values over election time is up\nSome lawmakers who could accused male face voters on the next MORNING EDITION from NPR News [noise]\nTomorrow morning from five to nine on W. V. I. A. F. out\nLie from NPR News in Washington I'm Lakshmi sang in the first such public confirmation a Turkish prosecutor says Saudi journalist Jamal could show gee what strangled within minutes of entering the Saudi consulate in Istanbul\nThe Washington Post columnist had gone to the conflict to pick up marriage documents October second NPR's Peter Kenyon has more\nA statement from the prosecutor's office confirms much of what investigators have leaked to the media since ... disappeared on October second\nProsecutors say could show the was strangled his buddy dismembered and disposed of investigators its search the consulate and other Saturday diplomatic properties as well as nearby sewer systems the statement also says a series of meetings with the Saudi chief prosecutor has produced no results\nAfter weeks of denials the Saudis acknowledge ... was killed in a premeditated operation but had refused to say where the body is Peter Kenyon NPR News Istanbul\nThat sent back behind the recent series of python center prominent critics of President Trump apparently started planning the attacks in July in a letter Justice Department prosecutors tele Miami federal judge that Cesar say ox searched for his targets addresses online and had\nIn a letter Justice Department prosecutors tele Miami federal judge that Cesar ... searched for his targets addresses on line and had photos of many of them on his cell phone authorities say no one was hurt but the pipe bombs were real and they warn others could surface\nIndonesia's search operation may have turned up more debris from the line air plane that crashed into the job of sea on Monday but the head of the country search and rescue agency says the strong currents have been preventing searchers from recovering the airplanes fly data and cockpit voice recorders\nInvestigators hope the black boxes reveal what causes a two month old Boeing seven thirty seven to go down shortly after take off from Jakarta one hundred eighty nine people were on board no one survived\nPresident Donald Trump is reinforcing his pledge to an automatic citizenship for children born to non citizens in the United states NPR's Windsor Johnson reports the heightened rhetoric on illegal immigration comes less than a week before the midterm elections\nIn a tweet Trump promise to keep the country safe then said the matter will be settled by the United States Supreme court Trump has pledged to use executive action to end automatic birthright citizenship which is guaranteed under the fourteenth amendment\nWhite House press secretary Sarah Sanders says Trump is being forced to take action on the matter because Democrats in Congress won't\nThe president's shouldn't have to do any of these things alone but Democrats are failing to work with the president he's laid out a number of different pieces of legislation that Congress could have easily address these problems Trump also says\nIt's unclear whether the fourteenth amendment applies to people who are living in the U.S illegally Windsor Johnston NPR News Washington us\nStocks continue to climb the doubt up three hundred twenty three points one point three percent of twenty five thousand one hundred Ninety nine the NASDAQ is up to point three percent and the ... up one and a half percent from Washington this is NPR News\nOne years since the me too movement took off a new NPR Ipsos poll reveals more than forty percent of Americans think it's gone too far NPR's Tovia Smith explains public opinion divides closely along party lines\nThree quarters of Republicans and one quarter of Democrats they need to has gone too far\nRepublicans are also more likely to believe false accusations are common and the less likely to say alleged victims should be given the benefit of the doubt on the other hand a third of respondents believe allegations of misconduct these days still get ignored\nNPR's Tovia Smith reporting Spain wants to lift the statute of limitations on child sex abuse making pedophilia as serious a crime is terrorism and genocide Joanna Kakissis reports from Athens on rising concerned about the Roman Catholic Church and long history of covering up for priests who abuse children\nSurvivors of child sex abuse in Spain currently have up to Fifteen Years to bring charges against perpetrators the government insists that's not enough that it often takes many years for sex abuse victims to process what's happened to them some have been abused by Catholic priests in\nA country where the church is still strong the ecclesiastical court of the Spanish Catholic Church has handed down lenient sentences to many priests who have abused children\nA recent investigation by the Spanish daily el ... these shows that only a handful of Catholic Church dioceses have passed on information on sex abuse cases to Spain's public prosecutor for NPR News I'm Joanna Kakissis in Athens\nThis is NPR support for NPR comes from NPR's versions other contributors includes ... working to transform how businesses work through the power of data using pervasive data intelligence ... to leverage is over living data\nInclude Tara data working to transform how businesses work through the power of data using pervasive data intelligent Tara data leverage is all relevant data to deliver answers to complex business issues Tara data dot com\nIt's rained for the head of the week here's the forecast\nPartly sunny this afternoon highs and the low sixties\nA fifty percent chance of showers overnight lows will be in the lower fifties and rain likely tomorrow highs and the low sixties uh near one hundred percent chance of rain Thursday night through friday with dusty wins overnight lows in the mid fifties and daytime hides in the mid sixties uh Ninety percent chance of more rain friday night maybe some thunderstorms lows will be limited forties\nYou're listening to W. vi your arts and information station\nSupport comes from the times tribute for over a century the times Tribune in Scranton assert northeast Pennsylvania with news and information that defines our community and charts our history as it unfolds delivered to your home or your mobile device the times Tribune is there for you any PA news dot com or\nGood afternoon I'm Larry Boy Scout thanks for tuning in its Halloween and this afternoon it's a program of\nMusic fool of ghost inspectors of witches and goblins to scare up enjoyment this afternoon where we begin with a tone poem or legwork by often divorce rockets one of a number of orchestra pieces inspired by folk ballads\nAnd this story um like many actual folk tales fairy tales of has some gruesome elements to it it's called the golden spinning wheel\nAnd in the story a king is in love with a young spinning made the requisite evil step mother and stepsister fly into a jealous rage and murdered the damsel when a grisly fashion the king returns mistakes the stepsister for his law been married her\nA mysterious old man appears and is determined to bring the made back to life fooling the false queen like Tempe tinker with a golden spinning wheel when the king returns from battle\nBut Golding spinning wheel breaks interest song and recounts the actual circumstances the false queen gets or just desserts and the king and the maid are reunited the golden spinning wheel of onto the divorce shot play by the Berlin Philharmonic under Simon Rattle [noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise] [noise]\nMm\n[noise]\n\n\nMm\n\n\n\n\n[noise]\n[noise]\n\n\nMm\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\nThe dance of the goblins by Antonio by seeing the same\n\n[noise] the ... the the goblins ... see any favorite virtuoso worked for violinist and that was Sarah trying with Charles Robert\nOrchestral music now this Halloween program and here we find a hunter who breaks the taboo by going hunting on Sunday\nWhen he finds out that that was a bad choice as he is being chased by ... factors here is the first the hunter play by the Boston symphony orchestra ... beach it's music a lot from\n\n\n\n\n[noise] [noise] [noise]\n\nWell\n\n\n\nAnd how the court looks now with the Trump appointees and the chief justice who's considered the most likely swing vote we'll talk with David Kaplan author of the most dangerous branch he was the legal affairs editor at Newsweek joins us\n\nThis evening at six after all things considered on W. V. A. F. out [noise]\n\nThere's something about this play something special color what you will or history or values lifestyle\nHere we haven't forgotten to care [noise] nosing or has grown to be one of the most scientifically events than innovative health care organization in America but we've never forgot where we come from we care it's such an old idea is mostly [noise]\n\nLive from NPR News in Washington I'm Lakshmi saying federal prosecutors are up in the number of charges filed against the alleged gunman behind Saturday's mass shooting at a synagogue in Pittsburgh\nA grand jury has decided to indict the suspect on forty four counts up from twenty nine according to a filing in federal court in Pittsburgh eleven people were killed over the weekend to date the city is holding a second day of funerals\nThe day after visiting Pittsburgh president Donald Trump pivots back to the campaign trail ahead of next week's midterms NPR's Windsor Johnson says Trump will be in Florida later today\nTrump is scheduled to hold a letting campaign events in the days leading up to the midterms today whole rally supporters and heavily Republican lead county along Florida's Gulf Coast there he is expected to make a last minute push for Republican gubernatorial candidate rounded Saturday and US Senate candidate Rick Scott\nTrump will also make campaign stops this week in Montana Indiana and Missouri\nAnd parents Windsor Johnson reporting in Georgia in federal court is reaffirming a previous order aimed at preventing some absentee ballots from being rejected Georgia Public broadcasting Steven Fowler has the latest update on the ongoing legal wrangling leading up to next week's midterms\nLast week a judge said absentee mail in ballots with signatures that don't match what's on file shouldn't be rejected instead the ballot becomes provisional and voters have until the Friday after election day to fix it\nThe secretary of state's office had asked for a stay while the court order is appealed but now the federal judge has said no ruling that the public interest is served by having these ballots cast and counted\nThere are currently several lawsuits challenging aspects of Georgia's election systems polls are showing a tight gubernatorial race with Georgia Democrats looking to elect the country's first ever black female governor for NPR News I'm Stephen Fowler in Atlanta\nRussia's space agency says a faulty censor is why rocket failed during lunch causing the two crewmembers aboard to make an emergency landing NPR's Lucian Kim reports from Moscow Russian officials hope the next piloted launch will take place in December\nAfter NASA retired the space shuttle and twenty eleven Russian ... rockets have been the only way to get people to the international space station on October eleventh is I use rocket failed two minutes after liftoff\nForcing the American astronaut and Russian ... aboard to abort mission and brought safely to earth from thirty miles into the atmosphere circuit ... off of Russia space agency told reporters in the investigation to determine a defective censor it caused the accident\nCurricular for the next pilot admission may take place on December third followed by the return of the crew currently at the international space station before Christmas Hussein Kim NPR News Moscow\nThen that that is that more than two and a half percent at Seventy three forty two the doubts up one and a half percent the ... at one point\nLucian Kim NPR News Moscow then that that is that more than two and a half percent at Seventy three forty two of the doubt up one and a half percent the S. and peas at one point seven percent this is NPR News\n\nThe Associated Press is reporting that a Roman Catholic diocese in Iowa concedes it remain silent for more than Thirty years about priests admission that he sexually abused dozens of boys\nA piece cites a statement that it says it received from the digestive to city according to the statement the Catholic dies his admits it never contacted police about Reverend Jerome coil and it did not alert parishioners Associated Press reports that dies has recently transfer quality of care facility in Fort Dodge\nAcross the street from a Catholic school\nIn the Philippines the death toll from Thai food you chew has risen to at least eleven heavy rains in the northern mountainous areas of trigger deadly landslides one mudslide buried a government building where at least two people have been confirmed dead with at least another five people getting out alive from manila NPR's McCarthy has the latest\nRescue workers say time is running out to save those buried in an unfinished public works building laborers security guards and a half a dozen residents sought shelter in it from the storm but on the typhoon battered mountain the building collapsed police soldiers and firefighters had been digging by hand to rescue those trapped\nTyphoon you two known locally as rosy tailed pounded the main island of loose on just six weeks after typhoon among coot\nCalled nearly fifty landslides and killed more than a deep people by the time it reached the Philippines you chew was much weaker storm than it was five days earlier when it leveled parts of the U.S northern very honest\nJulie McCarthy NPR News manila I'm Lakshmi Singh NPR News in Washington\nSupport for NPR comes from NPR stations other contributors included logged me in makers have go to meeting a collaboration meeting platform allowing people to connect around the globe to get work done learn more at go to a meeting dot com and the listeners who support this NPR station\n\nHere's the double the vi weather forecast\nA fifty percent chance of showers tonight and those will be in the lower fifties Seventy percent chance of rain tomorrow highs will return to the lower sixties but an air one hundred percent chance of rain Thursday night through friday with wind gusts up to thirty miles an hour through this period overnight lows will be in the mid fifties daytime highs friday will be in the mid sixties\nFriday night of Ninety percent chance of more rain with a chance of thunderstorms lows will be in the mid forties\nThis was W. V. I. A.\nIf you've recently got a new car and you don't need the old one donated to support WB I was even told away and you get a tax deductible receipt details or W. B. I. dot org slash cars or call you for for W. B. I. A. car\nThanks so much for staying with me on this Halloween and coming up and just a bit we're going to hear music that was preventing other state in Nineteen fifty five I simply be up Alan ... honestly has the subtitle mysterious mountain\nAlso we'll hear music by two of the great ... virtuoso his little romantic period Karl ... I'm Franz Liszt with is just a loss but first we made a Slavic bogeyman or I guess it's a ... woman\nHer name is Kiki Mara and she is a house spirit who lives near the stove or in the cellar she makes noises that are not dissimilar to that of mice rats she's trying to opt team food here's a musical painting of keeping more of may ... ...\nDid that in mind ... she's trying to ... who here's a musical painting ... made by ... by the cure orchestra under about maybe ...\n\n[noise] [noise]\n\n\n[noise]\nOver sixty symphony six zero sixty symphonies but he was just getting started Nineteen fifty five when he's second symphony was premier by the Houston Symphony orchestra impulse to ...\nAnd I'm the second symphony is among his most popular works it has a subtitle mysterious mountain and it is a an appreciation\nOf the hour and a magic properties of mountains and how a human kind do really over the e on says related to a nature and mountains in particular\nThere we have the Cincinnati Symphony under his love as global steering this mountain\n[noise]\nWow wow\nOh wow\nOh\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\nDo do\n\n\n\n[noise] [noise]\n\n[noise]\n... ... ...\n...\n\n...\n... to\n\n[laughter]\n[laughter]\n[laughter] it was\nOr\n... ...\n[noise]\n[noise]\n\n... ... ...\n[noise] [noise] Mm [noise]\n[noise]\nMm\n\n[noise] how about that that was Michael Lou ... music is Carl how seek the Ghost Ship\nSure back in the nineteenth century they\nGave some of the ladies in the audience flipping burgers\nWell ... was a student uh Franz Liszt we're going to hear a much more famous piece in the same vein but we're going to hear the ... the last ... testable transcription played by ... he under a search word ... Iran W. V. I. hey if I ...\n\nThis was W. V. I. eighty nine point nine up out W. V. I. H. D. one granted Wilkes Barre he's building you Williamsport W. B. Y. eighty nine point seven have him in Mansfield WTO eighty eight point three I found out at like while in pop back\nW. P. A. U. Ninety One point five FM streaming live a W. V. I. I. dot org we're in Allentown and not eat on point three and in Bethlehem at what a five point seven member supportive public radio W. V. I. okay\nHi I'm Chris Bailey host of ride for your for public radio variety show joined us this weekend from semi show winery in Washington state with my guest bend full no\nLive from here but at the time when [noise]\nSaturday Night at six Sunday night at eight O W V. I. A. F. [noise]\nOn the next fresh air how the Supreme Court became so politicized\nHow the court looks now with the Trump appointees and the chief justice who's considered the most likely swing vote we'll talk with David Kaplan author of the most dangerous branch he was the legal affairs editor at Newsweek join us\nIn the evening at six after all things considered on WB I Am about\n\nLife from NPR News in Washington I'm Lakshmi Singh a federal grand jury is now indicting the suspect in the Pittsburgh synagogue mass shooting on forty four counts including hate crimes that's up from twenty nine the alleged gunman faces the death penalty\nThe new charges were announced on the second day funerals for some of the eleven victims killed and what's believed to be the deadliest attack on Jews in the United states in recent memory six people were injured in the attack hospital officials say the two most seriously wounded victims are improving\nPresident Donald Trump will attempt to energize the GOP voter base in a series of campaign rallies in the run up to next week's mid term elections that includes a stop in the battleground state of Florida NPR's Mara Liasson reports on recent promises President Trump's major voters including\nAnother tax cut the ten percent tax cut 'em gambit is defensive and he proposed that because the tax cuts that the Republicans already passed is so unpopular and middle class to people and the Republicans own internal polls show that people think it was a tax cut for the rich and not for them\nIt's NPR's Mara Liasson hundreds of thousands of Red Sox fans are filling the streets of Boston a chair on the world series champion says they paraded by Craig lemoult of member station WBUR GBH is there\nSuch grew more to air ducts downtown we will choose to move\nThe trophy was actually damage to win the band reportedly do a full year at the team mark ... grew up with socks fan and brought his son to the parade\nWe don't know what it could be over the happening\nThere at the air so I tell my son we should do because when I was just the ... so you just gotta keep ...\nWith all the teams jerseys everywhere it looked like half the city's dressed up as Red Sox players for Halloween today\nFor NPR News I'm Craig lemoult in Boston\nAnd other news after more than two years in exile South Sudan's main rebel leader is back in Juba to celebrate a new peace deal NPR's Eyder Peralta has details Rick ...\nExiled South Sudan's main rebel leader is back in Juba to celebrate a new peace deal NPR's Eyder Peralta has details\nRick ... arrived at the Juba international airport and gave president Salva Kiir a hug which are used to be self evident vice president Kiir accused him of plotting a cool and that sparked a more than five years civil war the last time these two men were in Juba a war was rekindled\nThis time deputy information minister ... says things will be different\nFrom the moon to do the business the or for the call Misha ... him and to be all acceptance\nBut the country still have a long way to go fighting is still raging in some regions there are still vast food insecurity and Machar will leave the country following the celebration and also NPR News Nairobi\nAt last check on Wall street the Dow is up four hundred and fifty four points this is NPR\nHiring appears to remain strong at U.S companies the payroll processor ATP released the results of a private survey that found employers added two hundred twenty seven thousand jobs to this month that would make October job showing the strongest an eight months\nRetailer manufacturing were among the sectors that showed robust employment growth this month the government's monthly employment report\nWill be released the day after tomorrow again that's out of the Labor Department lawmakers in Canada and the u._k. want to hear from Facebook CEO Mark Zuckerberg on what's been done so far to combat the spread of misinformation and protect users' accounts from being compromised again\nParliamentary committees in both countries are urging him to testify before what they call an international grand committee [noise]\nWell a new study suggests dinosaurs had colored and spotted eggs NPR's Nell Greenfieldboyce reports that lives on in today's birds\nScientists used to think that modern birds invented colored eggs that before birds' eggs were white but yeah I mean a vehement of Yale University recently analyzed a bunch of fossilized dinosaur eggs\nShe and her colleagues found to pigments a red one and a blue one that same pigments that color bird eggs we have very likely a single evolutionary origin of color in the journal nature they say some dinosaur eggs weren't just colored but also spotted and speckled\nThese colors and patterns could have served a purpose like camouflage when dinosaurs started to build nests for their eggs rather than burying them underground Nell Greenfieldboyce NPR News this is NPR\nSupport for NPR comes from Americans for the arts committed to transforming America's communities through the arts and arts education supporting the nonprofit arts industry which employs four point six million people nationwide learn more at Americans for the arts dot org\n[noise] here's the w._b. I our weather forecast\nA fifty percent chance of showers tonight and those will be in the lower fifties or Seventy percent chance of rain tomorrow has will return to the lower sixties near one hundred percent chance of rain Thursday night through friday with wind gusts up to thirty miles an hour through this period overnight lows will be in the mid fifties daytime highs front and will be in the sixties\nFriday night or Ninety percent chance of more rain with a chance of thunderstorms lows will be in the mid forties this is W. V. I. S.\nSupport for vi comes from ... County Community college now and rolling for the winter and spring semesters with more than one hundred degrees the area's lowest tuition and easy transfer to four year colleges lose earn will get you ready for success more information at loser dot\nEDU\nWhat was tuition and easy transfer to four year colleges loser will get you ready for ... more information at ... dot edu\nHappy Halloween I'd Larry would get what is this ... hour are celebrating Halloween\nMusic Greene recently ah gosh we will hear some music from opera also\n... does rise from hell musical beyond rouse will meet the early ... and right now we are witnessing the ride about Yuri's here's the New York philharmonic under Leonard Bernstein unless they must be some regard bought their\n\nOur celebration of Halloween takes us to music of America George White feel chat with was the composer of that symphonic sketch hub goblet their play by the Detroit symphony under NAFTA guarantee\nIn just a bit we'll um last year the first of our musical portraits of let's just do this hour\nAnd we meet the dreaded Earl King in just a bit please stay tuned\nProgramming on WB I is made possible by our members we thank you for your support numbers and by indeed there is more business hiring information that indeed dot com slash higher business W. V. on a a fan of\nRain for the end of the week here's the weather forecast\nA fifty percent chance of showers tonight and those will be in the lower fifties than to borrow a Seventy percent chance of rain highs and the low sixties tomorrow night through friday on your one hundred percent chance of rain with gusty winds I've got up to thirty miles an hour those will be in the mid fifties and eyes on friday in the mid sixties\nFriday night or Ninety percent chance of additional rain and maybe some thunderstorms those will be in the mid forties [noise]\nThis is your arts and information station W. V. I. A. F. at\nGeorge Walker was trailblazer who became the first black composer to win the Pulitzer Prize for music he died on August twenty third at age Ninety six and the next Chicago Symphony orchestra broadcast Ricardo moody conduct walkers lyrics restrain plus music by Copeland\nEnded voice shot next time with the S. how I miss if any on\nSunday at ten pm on WB I about [noise]\nThe owner art center presenting university jazz repertory orchestra Saturday November thirty eight PM Lehigh students jazz faculty and look professional musicians perform contemporary big band Jackson's book six one zero seven now you arts or solar Arts Center dot org\n[noise] in just a bit we'll catch a glimpse of missed just do it is natural habitat and apparently\nHe's not not too happy to be there at first we meet\nThe German answer to the headless horsemen in a way this is the URL tea it was a poem of ... very famously by from Schubert tells the story of a father and son galloping through the forest at night\nIt was a poem I guess I was secretary of sleep I Try and shoot that tells the story the father and son galloping through the forest at night being chased by\nDebt kidding me Earl King the story is told to us by my cs Ghana baritone let's be honest address gr you're on WB I ain't\n\nNo no no no no no no no no no no\nNo no no no no no no no no no no no no no we're\nGoing to go ... who is a school age\n\nThat's what we're doing manual labor day\nWe're going to be they all I can do\nThis again this is a scandal and the\nMan or woman\nOr you need to\nAnd if it's been a new civil died they use for\nWhen the plane is more than what they're\nKeep the same way but [laughter] I just want to respond\nTo the movies but there is there any more they can do to lower\nWhen we come and go as\nFar as we speak to the\nSchool where\nThey make all that so far no matter how much can you know Bob and\nSaw my\n...\nNot to mention outlaw\nOregon or is it just makes me feel good Tony ...\n\nMy father was whether or not we're going to be spontaneously for like ... to ... and you know those long it took me a baseline to anybody does each one of the size\nOf like well\nLet me see used to do that's going to ask for the last time I\nWas going to school I was interested in it and you\nKnow it's a boy and the other side of the United states\n\nShould be miserable a punishment for or against the law [noise] what what is it is a little bit of all those\nKinds of nine one one of the man they saw me into it\nWhy do they do it\nOh [laughter]\nYeah it's it's Christmas Eve you know\n[noise]\nWhich are winning\nYou know what else\nOh\n\nTragically ... girl king has this way a child dies at the end of that ... they're performed by my the is gonna our tone a dress have liquor piano the Earl keen on WB I may\nWell we have a scary waltz by Johann Strauss the can they be well this was written for a grand festival with with fireworks that was billed as the journey into the lake the higher now that's a reference to passage in revelations\nAnd the devil was cast into the lake of fire in ... stone where's the beef stand the false prophet are in shall be tormented date at night for ever and ever\nHere we hear Memphis does ... from hell this wall spy Johann Strauss play by the Islamic state but a lot of work is Dr cause you to under Alfred Walter\n\n\n\n\nThe which is to happen from the opera ballet up ... Cheney Libby beat the ... ... ... Monica they cut the ... the I Would get what now we conclude our celebration Halloween with a\nCapital passage for much more famous on ... ... I like music or ... you know here's the orchestra world upper house called the garden under sir George Will be\nWell\n[noise]\n\n\n\n\n\n... what\n", "show_name": "Classical Music with Larry Vojtko", "year": "2018", "city": "Williamsport", "day": "31"}