{"month": "10", "state": "PA", "station": "WVYA", "content": "Four wheeled joined NPR once again for the award winning news magazine all things considered so don't go way [noise]\n\n\n\n\nThis is W. B. I. eighty nine points on FM W. V. I. H. D. one grandson Wilkes Barre ... W. B. Y. eighty nine point seven Williamsport WTO eighty eight points ... Mansfield at least one of the pomp at W. P. A. U. Ninety One point five FM ... township\nAnd translators W to want to a T ... W to eight nine ... son very W to zero seven eight Williamsport and don't be two Seventy eight a wealth borough listener supported public radio\nThe opioid epidemic using a men's public health crisis of our time now WB I Am a proud partner with families service association of northeastern Pennsylvania for the ninth annual national family we conference a community built to conquer opioid addiction [noise]\nFriday October twenty six at the best western plus genetic hotel conference center in books very\nTwelve workshops focusing on different aspects of the opioid crisis details in registration FFA\nAnd eat da di\n... elections are good for democracy is fundamentally flawed and I'm not sure if they could be fixed his idea replace politicians with randomly selected citizens work when people do this\nPeople make trusted balance decisions hacking the law next time on the radio hour from NPR Saturday new no W beyond a up and\n\nLive from NPR News in Washington I'm neuron President Trump is again criticizing the Federal Reserve board for raising interest rates calling it a ridiculous policy\nThey have interest rates going up at a clip that's much faster than certainly a lot of people including myself would have anticipated I think the fed is out of control I think what they're doing is wrong\nThe president said he knows more about interest rates then members of the Federal Reserve but he said he does not intend to fire fed chairman Jerome Powell in the past twenty four hours the president has also called the Federal Reserve board crazy and look up the director of the national economic council Larry Kudlow and said the president is not trying to ...\nOr board for raising interest rates calling it a ridiculous policy\nHave interest rates going up but it flipped that's much faster than certainly a lot of people including myself would have anticipated I think the fed is out of control I think what they're doing is wrong\nThe president said he knows more about interest rates then members of the Federal Reserve but he said he does not intend to fire fed chairman Jerome Powell in the past twenty four hours the president has also called the Federal Reserve board crazy and logo the director of the national economic council Larry Kudlow and said the president is not try to dictate policy to the fed\nThe Federal Reserve is expected to raise interest rates again it's December meeting analysts say it's not likely that will change because of today's report that the consumer price index rose one tenth of ... percent last month\nThe federal emergency management agency says it's focusing on search and rescue in the Florida Panhandle today as now tropical storm Michael ... northeast over the Carolinas NPR's Brian Naylor reports\nSeem administrator Brock Long says it appears that the town of Mexico beach was ground zero for the storm he says his agency is working with the national guard and first responders to access the area\nToday is a big day for us when it comes to a truly helping people and try to ah prevent for the loss of life as a result of of you know what the Gulf Coast has been through\nAn estimated nine hundred thousand customers are without electricity in the region\nLong says FEMA is also studying a trio centers are several hospitals are out of commission the storm is tracking through the Carolinas today and ... are warning of possible tornadoes and more flooding in areas still recovering from Hurricane Florence last month Brian Naylor NPR News Washington\nOr New York court has agreed to drop part of the criminal sexual assault case against former movie producer Harvey Weinstein NPR's\nRose Freeman report\nAccording to a letter from the Manhattan District attorney's office a detective took a statement from a witness in the case but failed to alert the da de ... contradicts the account Lucia Evans had given her alleged assault by Harvey Weinstein speaking to reporters linking attorney Benjamin Brafman says it's a good thing for a client\nOf Maine with us and the district attorney's office lied and effective let the investigation committed what he believed to be serious criminal ...\nIt's a step back for the prosecution but in a statement the da's office says the key is quote moving full steam ahead there remaining charges against Harvey Weinstein include predatory sexual assault hidden next court appearance scheduled for December rich Friedman NPR News New York\nIt's another down day on Wall street the Dow is down a hundred and eighty four points the S. and P. as down Twenty one and the NASDAQ is down six points and this is NPR News\nThe government announced today that Social Security recipients will re SUV received two point eight percent more starting in January the increase in benefits reflects the higher cost of living with the adjustment notice cola the average monthly Social Security payments for retired worker will be fourteen hundred and sixty one dollars next year\nTony nominated lyricist and liberate us Ira gassman died on October ... at the age of Seventy six Jeff Lunden reports\nThe New York native had many careers she was a stand up comic a newspaper columnist and in advertising executive gifts been coined the phrase bounty the quicker picker upper but writing lyrics and script was his passion\nIn the Nineteen seventies he co authored the off Broadway satirical review what tonight's country like you do in a state like this\nAnd he teamed up with composer site Coleman on the life of Nineteen Ninety seven Broadway musical that looked at pimps prostitutes in ...\nThanks at the age of Seventy six Jeff Lunden reports\nThe New York native had many careers she was just stand up comic the newspaper columnist then in advertising executive gifts been coined the phrase bounty the quicker picker upper but writing lyrics in script was his passion\nIn the Nineteen seventies he co authored the off Broadway to cheer Ikle review what's a nice country like you doing in a state like this\nAnd he teamed up with composer sigh Coleman on the life of Nineteen Ninety seven Broadway musical\nThat looked at pimps and prostitutes in previous Times Square\n[noise]\nHave me one day gasping also wrote radiant baby an off Broadway musical about\nArtists keep hearing for NPR News I'm Jeff Lunden in New York\nA U.S astronaut and Russian consummate not are safe after an emergency landing in conflict on today they're spacecraft was launched there but a booster rocket failed shortly after that caused the rescue capsule pleaded disconnected from the booster and follow the earth\nOfficials say the two space travelers are in good condition that were being sent into space to joined the crew on the international space station I'm nor rom NPR News in Washington\nSupport for NPR comes from NPR's Beijing other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart ... Hendricks and Isabel who pair premiering October twelve on prime video\n\nYour membership support enables our region to enjoy the quality of life classical jazz in contemporary music and other favorite\nProgramming thank you for making public radio possible W. V. I.\nGood afternoon on Larry Ford Gail thanks so much for tuning in and coming up this afternoon\nA little bit later we'll open up a composer state book and today's entry concerns inspiration that composers receive from nature and specifically from birds and was here a concerto by handle at times that sings the song or the cuckoo and other times that of the night in jail\nOr somebody by Michael hiding ahead some chamber music of ... and we begin with a Russian symphony by a composer not very well known that silly ... didn't you cough\nAnd he should be better known if he had lived longer he passed away the age of thirty five so he was a contemporary of up a gloves and often WC and ... passed away in Nineteen ...\nThe music that we do have is a testament to his talent inventive scenes and beautiful or Castro colors as an example here as the Seventy number two and a of a silly ... cough played by the Scottish national orchestra than we are conducting\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise] [noise]\n\n[noise]\n\n[noise] Mm\nMm\n[noise]\n[noise]\n\nMm\n\n\n\n\n[laughter]\n\n\n\n\n\n\n\n[noise]\nA\n\nWell\n\n\nWell well\n\n\n\n\n\n[noise]\n\n\n\n[noise] I certainly hope you enjoy that late romantic symphony somebody number two and a of rushing ... off the Scottish national orchestra led by name ... coming up we'd go back into the romantic period for some chamber music\nOf Robert ... that's coming up next I'm Larry which go I Hope you plan to stay tuned\nProgramming on W. V. I. NGOs made possible by our members and by Pennsylvania College of technology thinking about college hoping to land a great job after earning your degree think Pennsylvania College of technology\nWith one hundred plus bachelor an associate's degrees an exciting career fields industry standard labs in Ninety six percent graduation placement rate pen college is perfect for hands on learners visit P. C. T. dot edu to learn about Penn college degrees that work\nBrand him a desert the elections are good for democracy is fundamentally flawed and I'm not sure if they could be\nFixed good idea replace politicians with randomly selected citizens work when people do this that people make ... petitions hacking the law next time on the radio hour from NPR Saturday up new no W beyond a up out\n\nI Hope you find a state June coming up a little bit later somebody by Michael hide in the younger brother used to have heightened under concerto that was inspired by the songs of two birds the cuckoo out in the Nineteen Gail\nRight now it's some chamber music rubber ... use fantasy pieces of this Seventy three\nAnd these have been played on a just about every sort of melody instrument whether it's a violin viola a cello oboe above the bar at right now we hear clarinet as Richard Stoll spent with pianist Richard good and the music of Robert Schumann\n\n\n\n[noise]\n\n\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise]\nThis is W. V. eight eighty nine point nine ... W. V. I. H. D. one Scranton Wilkes Barre he's building in Williamsport W. B. Y. eight eighty nine point Senate map in Mansfield WTO eighty eight point three ... at at like while I'm pop back\nW. P. A. U. Ninety One point five FM streamline the W. B. A. dot org ... Allentown in Ninety nine point three any Bethlehem at one of five point seven member supporting public radio W. V. I. S.\n[noise]\nWe'll meet again to stories from Vietnam\nWomen's rights and escape from Cuba your mother tells you you're going to go along\nTo the United states was really hard to fit they changed the world nine Korea changed what would you ... with no possible\nAnd people who changed each other's lives [noise]\nWhat do you feel I Need him to go he said for [noise]\nTo stay October thirtieth and each time W. H. T. V.\nUh San Francisco I Pretend Andrea shame yeah they do like I don't know its tail at a poet any young noble women causing the turmoil of the French Revolution\nMusic director ... ... the ... international cap [noise] teaching young who me on up there on the George get new Jay I'm Janine bridges to join us for Andrea Shea on this station Saturday afternoon it was um [noise]\nThe Williamsport symphony orchestra conducted by my store Edelstein opens October sixteenth was works by what you see any ... and bronchitis\nGrammy nominated in chart topping violinist Caroline Golding plays Chuck ... violin concerto\nThe French Revolution music director ... leads an international cat teaching young who lead auditor on St George gotten these days and Janine bridges join us for Andrea ... on this station Saturday afternoon it was\nThe Williamsport simply conducted by ... it'll Stein opens October sixteenth works by Racine each ... and Brahms Grammy nominated and chart topping violinist Caroline Golding plays truck ... violin concerto [noise]\nWilliamsport simply October sixteenth that the community art center five seven zero three to six twenty four twenty four or Williamsport symphony dot org\nSponsors who'd our capital group that might come in college\nLive from NPR News in Washington I'm neuron you went stocks are lower again today after around yesterday they pushed the Dow industrial down more than eight hundred and thirty points as NPR's John Ydstie reports so far the losses are much smaller today\nThe Dow fell about a hundred and thirty points to the opening bell but a positive report on us consumer inflation help support the market which bounce back and forth between losses in gains in early trading\nThen some negative news from the White House on trade tensions with China pushed duck slower at the morning session the Dow is down over three hundred and Seventy points\nIt regain most of background later investors are worried about trade issues and rising interest rates which are negative for stocks President Trump again criticized the fed for raising rates saying the fed is out of control and making a mistake\nJohn Ydstie NPR News Washington\nPresident Trump says results of an investigation into the disappearance of Saudi journalist Jim off the show gay\nMay be released soon in the meantime as NPR's Ayesha Rascoe reports Trump is pushing back against called from both parties in Congress\nFor the U.S to stop arms sales to Saudi Arabia Trump says the U.S will take action against Saudi Arabia is it determined that thought he'd harm democracy fogy but he said he does not want to impose sanctions that will prevent the Saudi Government from buying US military equipment\nI don't like the concept of stopping an investment of a hundred and ten billion dollars into the United states because you know what they're going to do they're going to take that money to spend it or Russia or China or someplace else\nTrump said there are other ways to punish the Saudis though he didn't offer any examples Ayesha Rascoe NPR News the White House hundreds of thousands of homes and businesses are without power in the southeast us today after hurricane Michael it came ashore along the Florida Panhandle just shy of a category five\nBefore weakening to a tropical storm over South Carolina\nNorth Carolina governor Roy Cooper says it's now in his state\nThe ragged but still raging remains of hurricane Michael have now come to North Carolina the storm has already been done to lash our Veterans Day with strong winds and heavy rain\nThe storm is expected to move into Virginia by tonight the national Hurricane Center says parts of North Carolina and Virginia could be life threatening flash floods\nThe state Supreme Court in Washington today struck down the death penalty saying that it's been applied in an arbitrary and racially discriminatory manner Washington is now the twentieth state to outlaw capital punishment\nAt last check on Wall street the Dow is down a hundred and eighty nine points the S. and P. as down twenty three the NASDAQ down eleven [noise] this is NPR News from Washington\n\nTonight the national Hurricane Center says parts of North Carolina and Virginia could be life threatening flash floods\nThe state Supreme Court in Washington today struck down the death penalty saying that it's been applied in an arbitrary and racially discriminatory manner Washington is now the twentieth state to outlaw capital punishment\nAt last check on Wall street the Dow is down a hundred and eighty nine points the S. and P. is down twenty three the NASDAQ down eleven [noise] this is NPR News from Washington\nA judge in New York state today dismissed as sexual assault charge against former movie producer Harvey Weinstein prosecutors did not object fighting information they obtained since that charge was filed\nThere are five other sexual assault charges still pending wind stain has pleaded not guilty to all of them as well as accusations of sexual misconduct including rate from scores of women going back decades\nOfficials in Indonesia are extending the search and rescue effort that began after a powerful earthquake and tsunami struck the island of ... wasting nearly two weeks ago Michael Sullivan reports the official death toll has or plastic two thousand\nOfficials say volunteers and relatives of the missing will be allowed to continue their search is hoping to find at least the bodies of those they lost nearly two weeks and there's almost no hope of finding anyone to live\nThe official search effort we'll end with mass prayers in some of the hardest hit neighborhoods of ...\nThe official tally of the missing stands at six hundred and thirty but\nNo one really knows how many victims remain buried under the rubble the national disaster mitigation agency says the number could be as high as five thousand tomorrow the government will begin focusing on their next challenge rebuilding for NPR News I'm Michael Sullivan in Chiang Rai Thailand\nAnother earthquake struck Indonesia today and had a magnitude have six and ... job on Bali islands officials say three people were killed\nIt appears the newest quake did not affect the international Monetary Fund and the world bank meetings in Bali this week the leaders of those urge the U.S and China desk allay trade tensions I'm nowhere rom NPR News in Washington\nSupport for NPR comes from log Meehan maker of go to meeting proud sponsor of how I built this summit taking place in San Francisco at the ... center October sixteenth learn more at go to meeting dot com and the listeners who support this NPR station\nTurning cooler as we head to the weekend here's the weather forecast mostly cloudy tonight a fifty percent chance of rain this evening overnight lows will drop to the upper forties it'll be less humid with gusty winds that will follow us into friday morning\nPartly sunny tomorrow high on the upper fifties a fifty percent chance of showers Friday nights through Saturday with high on Saturday and the low fifties Heinz on Sunday in the mid fifties with mostly sunny skies this was W. V. I. F. M. [noise]\nNext time with the Chicago Symphony orchestra conductor eight and a virus has made her second in the most talked about turning and invented or the horns and try to number three and\nMozart and they have more time to Chicago Symphony orchestra anyhow [noise]\nSunday at ten pm on WB all of a [noise]\n\nI ... I Hope your day is going well thanks for staying with me coming up a little bit later we have some funny for the classical period will open up the composers date book and learn about inspiration composers receive inspiration from many sources including nature and days\nMozart Beethoven ... Chicago Symphony orchestra ...\nSunday I ten pm on WB I found\n\nI ... I Hope your day is going well thanks for staying with me coming up a little bit later we have a symphony for the classical period\nWill open up the composers date book and learn about inspiration composers receive inspiration from many sources including nature and today's episode is focused on inspiration provided by birds\nAnd we're glad he caricatured by handle that was inspired by two separate birds [noise]\nWell that's just a little bit but right now we have a symphony Michael hide in the younger brother used to hide in this is a monster fear not unlike Mozart's earlier symphony this is the Seventy number thirty seven in the play by the German chamber of ketamine of noise under the direction of the ...\nUm\nMy faith is the grand ... of my life [noise]\nI'm a believer so I sing words of God to those who have no\nIdea of bird songs in those who dwell in cities and had never heard that make rhythms for those who not only military marches or jazz and paint colors for those who've seen not\nComposers date book is supported by ... online test prep for the ACT that's designed to improve scores\nStudents can get video lessons practiced question expert support online prep smart go far and enjoy the ride at\n... dot com slash ACT composers date book is produced by a pi I'm American public media in conjunction with the American composers farm reminding you that all music was once new [noise]\n\nWent to listen to some music inspired by the songs of birds this is an organ concerto by George Frederick handle which is subtitled but cuckoo and the Nineteen Gail mainly because of bird like motifs into second movement\nHere we have Simon pressed and as a soloist with the English concerts under Trevor picnic the organ ... an F of handle the ... and the Nineteen Gail\nMm\nMm\n\nSoldiers with the English construct under Trevor ... ... s a handle the ... and then I can get\n\nMm\n\nMm\nMm\n\n\n\n\n\n\n\nOne\n\n\n\n[noise]\n\n\n[noise]\n... [noise]\n\nMm\nMm [noise]\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\nMore music ahead you're on WB I arts and information station on Larry which go please stay tuned coming up next the news in the our\n\nNa na\nNa na na\nThis was WBRC eighty nine point nine of them W. B. I. H. D. once threatened Wilkes Barre has that we're in Williamsport at W. B. Y. eighty nine points that would have to have you back to build a W T I O idiot point three of them were like well\nOoh\n\nThis was W ... W. B. I. H. D. ones granted Wilkes Barre who were in Williamsport at W. B. Y. eighty nine point seven FM you advance to build a W T I O eighty eight point three of them were like well I'm pocket W. P. A. U. Ninety One point five of them\nStreaming live at W. V. I. A. dot org we have a translator in Clark summit at ... three of them you're arts and information station listener supported public radio W. V. I. S. [noise]\nOn this week's broadcasted the San Francisco to use the director Michael do from home which brings out all the colors of the orchestra stolen and whole\nSections of it's going to get a chance to shine individually and collectively by ... Mozart and Samuel Adams that next time with the San Francisco to [noise]\nSunday afternoon it to or W. B. I. A. F. out\nMillions of Americans have voted for their favorite novels and the great American ...\nOctober seventeenth there's the deadline to votes than George W. B. R. A. for a great American read Halloween party Saturday October twentieth eleven AM to two PM at just one more page walks twenty five years toga street jumped in and bring the kids in college you put her tattoos refreshments funding prizes as we await the announcement of America's favorite novel October twenty thirty\nTo get your vote him W. B. I. dot org slash great American ... [noise]\nLive from NPR News in Washington I'm neuron hundreds of thousands of homes and businesses are still without power after hurricane Michael in Georgia the governor is telling people to be patient from member station W. A. B. E. Susanna Capelouto reports\nGovernor Nathan Deal that chainsaw strike teams have been deployed two counties in southwest Georgia hardest hit by hurricane Michael more than a hundred and twenty state roads closed and debris removal is key to get power trucks into the area he's urging the public to stay out of their way\nPast experience tells us that one of the greatest impediments to restoring power is people who get in the way all the power trucks and the crews who are working to make that happen\nDeal says more than fifty poultry houses were destroyed hospitals and nursing homes in southwest Georgia all running on generators for NPR News I'm Susanna Capelouto in Atlanta\nA lawyer for former Trump deputy campaign chairman Rick Gates calls him a model cooperating witness NPR's Carrie Johnson reports gates is seeking less supervision before he sentence Rick\nGates is asking a judge to remove him from electronic monitoring and and the night time curfew he also wants to be able to travel more freely in DC in Virginia gates has been living under restriction since he pleaded guilty to lying to the FBI and conspiring against the United states he's\nBeen meeting with prosecutors any testified against his former boss Paul Manafort at a trial in August\nHis lawyer says gates is continuing to help the thirties with the investigation into Russian election interference the special counsel's office did not oppose gates request meanwhile a federal judge in Virginia has asked to hear from Manafort and special counsel next week\nThe judge wants to know more about how Manafort's cooperating ended that at sentencing date Carrie Johnson NPR News Washington\nWith twenty six days until the mid term elections Senate majority leader Mitch McConnell says he thinks the confirmation fight over it\nHe testified against his former boss Paul Manafort at a trial in August his lawyer says gates is continuing to help authorities with the investigation into Russian election interference the special counsel's office did not oppose gates request meanwhile a federal judge in Virginia has\nHere from Manafort and special counsel next week the judge wants to know more about how Manafort's cooperating and that is sentencing date Carrie Johnson NPR News Washington\nWith twenty six days until the mid term elections Senate majority leader Mitch McConnell says he thinks the confirmation fight over Supreme Court justice Brett Kavanaugh makes it less likely the Democrats will win the Senate\nUm increasingly optimistic that we may hold on majority now they get mentioned huge difference\nAnd one of the good things about the Supreme Court fight as it underscores for Republican voters that the shuttle is on the personal business ... and the project of confirming judges is over for the last two years of President Trump\nMcConnell was interviewed by NPR's Kelsey Snell the medical device maker ... says it's disabled Internet updates for some thirty four thousand care link programming devices used by health providers to access implanted pacemakers\nThe company says the system could be vulnerable to cyber attacks which could harm patients atomic says it has not received any reports of such attacks but his developing security updates\nIts another down day on Wall street at last check the Dow is down four hundred and Seventy one points the absentee it down fifty this is NPR the Labor Department reports consumer prices rose one tenth of one percent last month\nThe so called core index which leaves out the volatile food and energy component was up one tenth of ... percent last month for the second straight month since consumer prices are up Social Security recipients are getting a raise a cost of living adjustment of two point eight percent it will start in January\nDozens of Taliban and Afghan security forces have been killed in Afghanistan as violence continues ahead a parliamentary elections Jennifer glass reports from Kabul\nAt least fourteen Afghan border police seven Taliban were killed in ... province northern Afghanistan when the Taliban attacked a series of police checkpoints in a district on the country's northern border the Afghan intelligence services Twenty one Taliban were killed in might on ... in central Afghanistan\nAnd an air raid because they were allegedly gather to plan attacks on the upcoming election the parliamentary vote is just over a week away with the Taliban ad Islamic state has vowed to disrupted\nThe United nations says despite significant security challenges progress has been made by the security forces to create conditions for the majority of Afghans to vote for NPR News I'm Jennifer ... in Kabul\nVisitors to the crop all is the most popular tourist attraction and grades are out of luck today it's closed workers called a twenty four hours strike because they feared some landmarks may be sold as part of access to privatize as part of Greece's international bailouts government officials say historical sites will be exempt from the program\nI'm nor rom NPR News\nSupport for NPR comes from the alliance for lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for a lifetime income dot org\nTurning cooler as we head to the weekend here's the weather forecast mostly cloudy tonight a fifty percent chance of rain this evening overnight lows will drop to the upper forties it'll be less humid with gusty winds that will follow us into friday morning partly sunny tomorrow high on the upper fifty\nLifetime income a nonprofit composed the financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for a lifetime income dot org\nTurning cooler as we head to the weekend here's the weather forecast mostly cloudy tonight a fifty percent chance of rain this evening overnight lows will drop to the upper forties will be less humid with gusty winds that will follow us into friday morning\nPartly sunny tomorrow high on the upper fifties a fifty percent chance of showers Friday nights through Saturday with high on Saturday in the low fifties Heinz on Sunday in the mid fifties with mostly sunny skies this is W. V. I. F. M.\nProgramming on WB I is made possible by our members we thank you for your support members and buying a Home Depot there's more home improvement information at the Home Depot dot com this is your arts and information station W. V. A. F. M.\nHello again I'm Larry ... thanks for staying with me coming up a little bit later a musical adventures take us up to ...\nWe have incidental music written for a play the composer John sub alias and we begin with a ... a rather unusual work it's a piece of music by ... well known composer but it's a set of variations for oboe\nAnd band wind ensemble and um\nWhat would ever possess ... hairs on incomplete you spend your whole to write music for wind ensemble when you see he was the inspector of Russian Navy batons\nRisk ... young men himself was a ... in the navy and so in that capacity as the inspector he wrote a number of works where we ... including the Senate variations were Oberlin ban loves Lynch is is the slowest here with members of the Berlin radioactivity other Hans Zimmer he's like a risky course took off\nWell no no\nNo no\n\n\n\n\n\n\n\n\nIncluding WC who wrote an opera also the um Arnold Schoenberg wrote a tone bomb unpaid leaves of medicine\n... bally's Gabrielle foray as well for a wrote incidental music for production in London to bally's was chosen to rising incidental music for the premier of family medicine and from that score here as a concert sweet play by the Israel feel I'm On an orchestra and has been made to\n[noise]\nThe minute Meyers host of composers including did you see an opera also yup Arnold ... wrote a toll on them and some other son\n... bally's got real boring as well Laurie wrote incidental music for production in London the bally's was chosen to write the incidental music for the premier up nearly as the medicine and from that score here as a concert sweet play by the Israel Philadelphia Orchestra and has been made\n[noise]\n\nUm\n\n\n\n[noise]\n\n[noise] [noise] [noise] [noise]\nMm\n\n[noise]\n\n[noise]\n\n\nMm\n\n\nOoh\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\nIn addition to a home care elite national home health ranking at allied services you'll find I'm surpassed clinical expertise industry leading accreditation and award winning results\nMiracles in rehab performed daily at allied surfaces\nAt allied services you'll find I'm surpassed clinical expertise industry leading accreditation and award winning results\nMiracles in rehab perform daily allied service is\nTurning cooler as we head to the weekend here's the weather forecast\nMostly cloudy tonight a fifty percent chance of rain this evening overnight lows will drop to the upper forties that will be less humid with gusty winds that will follow us into friday morning partly sunny tomorrow high on the upper fifties a fifty percent chance of showers friday night through Saturday with high on Saturday and the low fifties\nHike on Sunday in the mid fifties with mostly sunny skies this is W. V. I found\nThis week wait wait don't tell me give you what you've always needed a break from the new astronaut Scott Kelly tells us why you need to double ... floating in space he found go reveals for most challenging role cookie monster and we hear often go be terrible ... of the exploding lives on\nA bitter said will join us for a mini vacation for your soul on the news from NPR's [noise]\nSaturday morning get a chance Sunday evening at seven odd W. B. I. A. up out\nI'm Larry ... thanks for staying with me our time is quickly coming to an end and coming up next we'll be all things considered all the day's news\nBut right now it's music ... the French composer well of course French but he had such a love for his whole region of pro bonds that he described himself as French from pro huh here's this week program saw\nA celebration of his homeland play by the Boston symphony orchestra under ... beach\n\n\n\n\n\n... [noise]\n\n...\n\n\n[noise]\n\n... [noise]\n\n", "show_name": "Classical Music with Larry Vojtko", "year": "2018", "city": "Williamsport", "day": "11"}