{"month": "10", "state": "PA", "station": "WVYA", "content": "On translators W to want to a T ... W to eight nine ... W to zero seven a Williamsport and don't need to seven eight ... listener supported public radio\nMillions of Americans have voted for their favorite novels in the great American read\nA job or Eighteenth as the deadline to vote then joined WBAI for a great American read Halloween party Saturday October twenty is eleven AM to two PM at just one more page works twenty five years ... bring the kids in caution for glitter tattoos refreshments fun memorize this October twenty you as we await the announcement of America's favorite novels October twenty third\nYou can still get your vote in W. V. I. dot org slash great American read\nOn the next fresh air [noise]\nHome slices emptied of queen tissue girl the deer maybe\nRobinson stand up comedian writer actress co creator and co host of the podcast is TV show to do ... and co host of the podcast so many white guys she has a new book titled everything's trash but it's OK join us\nThis evening at six after all things considered on W. V. I. A. F. M.\n\nProgramming on W. V. I. is made possible by our members and by Pennsylvania College of technology thinking about college hoping to land a great job after earning your degree think Pennsylvania College of technology\nWith one hundred plus bachelor an associate's degrees an exciting career fields industry standard labs in uh Ninety six percent graduation placement rate pen college is perfect for hands on learners visit P. C. T. dot edu to learn about Penn college degrees that work\nLive from NPR News in Washington I'm Lakshmi Singh a joint Turkish in Saudi investigative team and searching the Saudi conflict and assemble turkey nearly two weeks after a journalist Jamal ... entered the building and apparently never came out he is feared dead\nThe mystery surrounding a shaggy whose columns have been critical of Saudi crown prince Mohammed bin Salman puts the Trump Administration in a highly sensitive diplomatic position with the U.S ally in the middle east NPR's Michel ... element is traveling with secretary of state Mike Pompeo who is on his way to Saudi Arabia this hour to meet with the crown prince his father Washington\nPost columnist your mouth is Yogi was last seen entering the Saudi conflict in ... earlier this month President Trump said on Twitter that the Saudi king denied any knowledge of what happened to ... Trump said he spoke by phone with gangs all non ended sending his secretary of state Mike Pompeo to Riyadh\nTrump says the Saudis are working closely with turkey to find an answer Turkish authorities have said they believe the Saudis lord to show it to the consulate and killed him there and the case is draining\nIn closely with turkey to find an answer Turkish authorities have said they believe the Saudis lord ... to the consulate and killed him there and the cases draining us relations with Saudi Arabia though Trump has made clear he doesn't want to disrupt lucrative arms deals Michele ... NPR News the state department\nShould President Trump ever make another Pocahontas dig against Senator Elizabeth Warren the lawmaker from Massachusetts will respond with a DNA test she has released the results which offers strong evidence that she has Native American heritage going back six to ten generations\nUntil now Trump never seemed to believe warrants claim at his rallies he has mocked her as a fake Pocahontas or markets deeply insulting to Native American groups several months ago in Montana he even better generous donation and senator warns favorite charity if she could prove them wrong I Want\nIf you take the test of the shows you're\nOn his way to Florida this morning President Trump told reporters\nHe never said that the president\nAnd first lady Melania Trump are in Florida this our viewing hurricane recovery work NPR's Quil Lawrence reports from the Florida Panhandle hundreds of people are still in shelters\nCarbs and chainsaws are in high demand as residents clear fallen trees and patch up the holes in the ruse made by hurricane Michael's one hundred fifty five miles per hour winds electric generators or sought after with power companies still tentative\nAbout when the lights might come back on there's no cell phone signal and much of the region moguls have been getting tips from radio stations about where they might find gas food and water distribution and medical care\nTraffic in and out of the worst affected areas has been crawling often sidelined by long convoys of police cars and power cruise as they flew into the pan handle from all over the state where Lawrence NPR News Miramar Beach Florida\nThe Dow is up twenty nine points to twenty five thousand three hundred sixty nine an as that goes down twenty seven at some he's off one this is NPR\n[noise] it's a desperate seeing this hour on south west France flash\nFloods have killed at least ten people NPR's Eleanor Beardsley reports five months worth of rain fell in five hours overnight swelling rivers into raging torrent French\nTelevision is showing footage of waters coursing through towns and villages with only the tops of cars visible\nThe heaviest flooding within the area around the medieval walled city of ... where they owed river reached a level not seen since Eighteen Ninety One the waters rose so quickly that many people were stranded on their rooftops and had to be rescued by helicopter at least one elderly person who couldn't make it to the second story of its house drowned\nIn some places a river rose by more than twenty feet and floodwaters were too powerful for the emergency services to get through even in boats today's schools are closed and people are being urged to stay inside the French prime minister has gone to visit some of the devastated towns Eleanor Beardsley NPR News Paris\nSears is filing for chapter eleven bankruptcy protection the company says it will start holding liquidation sale and we'll close in additional one hundred forty two stores before the end of the year [noise]\nSears has been plagued by declining sales and growing debt the more than a century old institution is the latest in a string of traditional retailers struggling to compete in an increasingly online retail world\nUs stocks slightly mix this hour the Dow is up forty seven points to twenty five thousand three eighty seven the NASDAQ has down Nineteen points in the ants and he is up now a fraction this is NPR\nSupport for NPR comes from the three audio the powering enterprise digital transformation\n[noise]\n\n\n\n\n\n\n...\n\nAh\nIs\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\nThe ... votes aren't somebody number thirty eight in the play by call a game on the fringes of Meyer conducting so we heard music written for Prague next we'll hear music written by a composer born in Prague a violin concerto just ahead please stay cheap\nProgramming on WB I I just made possible by our members and by Pennsylvania College of technology inviting you to the limits of modern warfare stalemate technology and the sounds of front in the first World War presented by Dr John deck\nDuring the next edition of the technology and society ... series open to the public at seven PM Thursday November rate in the clump academic center auditorium at Penn college more information is available at P. C. T. dot edu slash political\nAnd the weather forecast windy with showers this afternoon high in the mid sixties rain showers likely through the sea\n...\nAnd the weather forecast windy with showers this afternoon high in the mid sixties rain showers likely through the evening with gusty winds meant partly cloudy after midnight lives in the upper thirties\nTomorrow sunny highs will be in the lower fifty's still windy conditions in tomorrow night mostly clearer the evening becoming partly cloudy later on lives will be in the upper thirties mostly sunny breezy on Wednesday heights indolent were fifties hit sixty one here at the w._b. ice studios\nWhen job openings occurred WBAI we appreciate the help of organizations that regularly distribute information about employment opportunities to applicants working with up looking to refer\nIf your organization would like to receive notification of job they can seize the w._b. I piece contact lens handle a WB I one hundred WB I wait pitch to be a one eight six four zero\nFive seven zero six zero to eleven twenty four W. B. I. dot org WBAI is an equal opportunity employer\nWell here's the violin concerto by Yorkers mislead the Jack was born in Prague she ... the soloist with the divorce rock chamber orchestra ... Patrick [noise]\n\n\n[noise]\n\n\n\nThis is W. V. I. eighty nine point nine a pound W. V. I. H. D. ones granted Wilkes Barre he'd gotten in Williamsport W. B. Y. eight eighty nine point seven have him in Mansfield WTO eighty eight point three of them and at like ...\nW. P. A. U. Ninety One point five FM streaming live a W. B. I. A. dot org we're in Allentown ... three and in Bethlehem at one of five point seven member supportive public radio W. V. I. S.\n[noise]\nWe'll meet again [noise] stories from the\nYour mother tells you you're going to go on loan\nTo the United states I was really hard you've been been changed the world my career changed what would be impossible with no possible\nAnd people changed each other's lives [noise]\nWhat do you want to say I need him to shake my [noise]\nTuesday October thirtieth at eight O W ... TV\n[noise]\nThis week's broadcasted the San Francisco symphony Michael Jordan Tama since the orchestra and when to stop Mars most personal musical statement you simply number nine full of wills in transition but grasping strongly at life while accepting mortality that's next time with the San Francisco symphony\nSunday afternoon at two on WB I found\nSupport comes from the greater hazel in concert series providing professional performances to northeast Pennsylvania featuring musical starlings of Mandy Barnett the company man and the seller while as this year season bashing membership information available at Hilton concert series dot org\nLive from NPR News in Washington I'm Lakshmi sang President Trump and first lady Melania Trump or spending the next few hours in Florida in Georgia being briefed on the hurricane recovery like an air force base this afternoon Trump applauded what's been done so far off\nTrump or spending the next few hours in Florida in Georgia being briefed on the hurricane recovery Glenn air force base this afternoon Trump applauded what's been done so far off it\nLast week hurricane Michael roared ashore in Florida's panhandle as a destructive category for storm with one hundred and fifty five mile per hour winds it level neighborhoods Mexico beach population of a thousand was nearly wiped out the hurricane wreaked havoc in four states from Florida to Virginia it killed at least Seventeen people [noise]\nA team of Turkish in Saudi investigators are searching the Saturday consulate in Istanbul, Turkey the scene of the disappearance an alleged murder of Saudi journalist earlier this month NPR's Peter Kenyon reports that officials continue to deny any involvement in a journalist disappearance\nIn the morning Turkish officials announced their intention to search the consulate as well as the Saudi consul general's residence and diplomatic vehicles but the search didn't begin until after dark\nTurkish investigators have claimed the journalist ... was killed inside the consulate on October second in his body disposed of\nSaudi officials reject the allegations investigators focused on the arrival of Fifteen Saudi used ... on the day 'cause she'll be disappeared them into part at the same day Saudi officials say 'cause she'll be left because within an hour of arriving but it provided no evidence to back up that claim Peter Kenyon NPR News Istanbul\n[noise] the Russian Orthodox church is breaking ties with the head of the global orthodox community\nAfter the accurate medical patriarch head of Constantinople decided to grant Ukrainian clerics independence from the church in Moscow for the first time and hundreds of years since Russia annexed Crimea from Ukraine and two thousand fourteen calls for the Ukrainian churches independence have intensified\nStrong winds and dry conditions have prompted Pacific gas and electric for the first time to shut off electricity for some of its customers to prevent wild fires in parts of northern California from member station ... in San Francisco Ted Goldberg has an update\nPGE has turned off power for some fifty nine thousand customers in three counties north of San Francisco and three other counties in the Sierra foothills the proactive electricity shut offs live some school districts to cancel classes for the day\nThe genie which is the largest utility provider in northern California says the move is in the interests of safety in a last resort due to extreme weather conditions\nThe national weather services wind speeds reached Seventy seven miles per hour or two locations in the northern part of the bay area on Sunday evening over the summer Cal Fire announce it ... electrical infrastructure cause at least a dozen fires in six counties last October\nFor NPR News I'm Ted Goldberg in San Francisco\nThe Dow Jones industrial average is up forty seven points this is NPR needs\nUs defense secretary Jim Mattis\nIs on his way to Vietnam Michael Sullivan reports this has managed to second visit this year\nMadison visited communist Vietnam's capital Hanoi in January he's visiting the country's economic capital Ho Chi Minh city on this trip\nTo meet with the Vietnamese counterpart and visit a Vietnamese airbase medicines trips bookend to visit by the U.S navy aircraft carrier Carl Vinson to the port city of ... in March\nIt was the first such visit since the war and one that signal both sides willingness to grow military ties\nAs China continues construction on disputed islands in the south China Sea in June met us called out China for deploying surface to air missiles on some of those islands placed there he said for the purpose of intimidation and corps and for NPR News I'm Michael Sullivan in Bangkok\n[noise] Stephen Hawking has more warnings for the world though it's been months\n\n[noise]\n[noise]\n\n[noise]\nNa na\nOh no no\n\nUh\n\n\n\n\n\n[noise]\n\nUh [noise]\n[noise] [noise]\n\n\n[noise] music on the ... played by ... to lose under Michel ... three romantic walks us in just a bit we have a romantic sweets when written by twenty century composer who was born on this date\nFrom the ... calendar the ... valley corral he's getting ready for their big performances coming up this weekend there performing heightens oratory oh the creation retailing of the genesis story\nAnd this is at ... Lutheran Church in some very Saturday and Sunday and Saturday evening at seven thirty Sunday afternoon at three for more information S. V. C. music dot org\n... valley corral S. V. C. music dot org the creation or he's going to be performed this weekend with the pain will be conducting the chorus orchestra and sold it was\nFine more events on the on line art scene calendar on the W. B. I. N. website W. V. I. dot org\nProgramming on W. V. I. is made possible by our members and by Pennsylvania College of technology thinking about college hoping to land a great job after earning your degree think Pennsylvania College of technology with one hundred plus bachelor an associate's degrees an exciting career field industry standard\nThey're earning your degree think Pennsylvania College of technology\nWith one hundred plus bachelor and associate degrees an exciting career fields industry standard labs in uh Ninety six percent graduation placement rate pen college is perfect for hands on learners visit P. C. T. dot edu to learn about Penn college degrees that work\nAnd this is the composers date before October fifth I'm John ... the expatriate American composer ... was famous for writing pieces for player pianos\nCare oh fairly came to the pollution that the ... and ... of all the music that he wanted to write was just too difficult for a mere mortals despite its complex to me that heroes music do some of the deep and lasting influence from the human jazz style means of Art Tatum ill father hind [noise]\nAnd the complex rhythmic patterns of music from India [noise]\nNine Carol was born in Nineteen twelve and Texarkana, Arkansas at the age of Eighteen ... skis rite of spring which sparked his lifelong exist in ... complex [noise] after net zero begin private music studies with American composers Roger session multiple\nThen Terrell composed almost total isolation until the late nineties seven days on some of his piano vocal composition started appearing on record\nAnd the MacArthur Foundation awarded him it's prestigious genius award up three hundred thousand dollars [noise]\nLate fame even brought a series of commission for live performance and performers willing to take on the challenge performing as difficult music [noise]\nOne of these pieces Medicare owes the string quartet number three was premiered on today's date in Nineteen eighty seven by the R D the court that [noise] that Carol died in Mexico in Nineteen Ninety seven [noise]\nComposers date book is supported by a goose online test prep for ACT designed to improve scores student can get video lessons practiced question an expert support on line prep smart go far and enjoy the ride at ... dot com slash ACT [noise]\nComposers date book is a production of AP yeah American public media and the American composers for reminding you that all music was once new [noise]\nWe have a birthday to celebrate today the composer dog when I was born in Sweden on the state of Nineteen oh five he studied at a stock um conservatory and finished up studies in Paris\nAnd he was a quite a prolific composer and unimportant composers especially in Sweden\nA he wrote five symphonies a number of other were Castro works you're broken chair has for piano violin and cello five string quartets to piano trio ... and other chamber music [noise]\nAnd he worked wrote a works for the stage ballets and incidental music to play and that's what takes us to this music as we celebrate the birthday of Dr phil and\nThis has caused a romantic sweet up it's twenty two but originally as incidental music for production of Shakespeare's the merchant of Venice\nAnd the movements are marked\nIf I only knew why I Am so sad [noise]\nNext we go to Venice then seven eight for Jessica the forces gestures downs and the fifth portions orchestra here's the romantic sweet up was twenty two abducted him play by the Donaldson pointing out that stuff on ... conducting\n\n\n\n\nMhm\nMm\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\nAh\n[noise]\n\n\n\n\n[laughter]\nSupport comes from the times tribute for over a century the town's Tribune in Scranton ... northeast Pennsylvania with news and information that defines our community and charts our history as it unfolds delivered to your home or your mobile device the times tribunal there for you any PA news dot com\n[noise] the latest news from NPR coming up at the top of the hour right now it's music rubber ... who like many romantic composers wrote music that had extra musical associations\nBut they were never really specific and he never wrote to say a symphonic poem about he wrote a number of chamber pieces with a titles such as fairy tales and fantasy\nPieces and here's a set of fantasy pieces he wrote for piano trio is up is eighty eight played by late all the ... Christian ... violent and Tanya ... cello music of mount on W. V. I.\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n\nMm Mm\n\n\nDa da da da da\nDa da da da da\n\nDa da da da da\n\nDa da da da\n\nDa da da da\nDa da da\nDa da da\n\n\nDa da\n\nNot a\n\nDo that\nI'm a\n\n\n[noise] [noise]\n[noise]\nA\nCat and a\nNew\n[noise] Mm\nAnd then the ... but in the [noise]\nThe [noise] the only people that do\n\n\nVisit WBRC eighty nine point nine F. M. W. B. I. H. D. ones granted Wilkes Barre hazel ... we're in Williamsport it WTY eight eighty nine point seven at the end in Mansfield a W T I O eighty eight point three of them were like well I'm humpback a W. P. A. U. Ninety One point five about them\nStreaming live at W. V. I. A. dot org we have a translator in clock so much at Ninety point three I found your arts any information station listener supported public radio W. V. I. S.\n\nRepertory embracing covered Sonia ... meaning of all the and\nI think it's very too we offer a flight ... fanciful overview of a largely an celebrated repertoire\nFive hundred years or battalion Oregon music this week on pipe dreams from American public media I'm Michael Barone I Hope you'll be listening\nSunday Morning at six on WB I Am WB I celebrate the cultural life of our community art scene features with Erica funky weekday\nSong W. B. I. A. F. M.\nWB I celebrate the cultural life of our community art scene futures with Erica funky weekday mornings after the news and living on WB I Am\nJust one catch up anytime arching online at W. V. I. dot org [noise]\nWilliamsport somebody wanted to buy ... it'll Stein opens October sixteenth works by Racine each ... and Ronald\nGrammy nominated and chart topping ... Caroline Golding plays Chuck ... violin concerto [noise]\nWilliamsport simply October sixteenth that the community arts at her five seven zero three to six twenty four twenty four Williamsport simply dot org sponsors would on top of a group that might come in college [noise]\nLive from NPR News in Washington I'm Lakshmi Singh James Woolsey former director of security for the Senate intelligence committee is pleading guilty to one federal count of lying to the FBI about his contacts with reporters under a plea deal with the U.S attorney's office in Washington DC\nThe fifty seven year old Wolfe was charged with three counts of making false statements he was arrested over the summer as part of an investigation into classified\nInformation links to reporters\nSenator Elizabeth Warren is calling President Trump's bluff a few months ago at a rally Trump went on a rant daring warned approve that she has Native American ancestry saying that he would donate a lot of money to her favorite charity if she proved him wrong today with DNA results in hand Senator Warren tweet said she'd like Trump's donation made to the national\nIndigenous women's resource center and peers us a call it has more on what could be warns campaign move the DNA results\nShow strong evidence Warren has a Native American ancestry dates back six to ten generations the DNA test this part of an elaborate strategy to and questions about her ancestry possibly ahead of twenty twenty presidential that they were released in conjunction with a campaign style video that included clips of President Trump mocking her\nI say I want for your favorite charity for trouble if you take the test and as you hear it in their\nWarren's results indicate she could be somewhere between one at thirty second and one one thousand twenty fourth Native American Republicans were quick to dismiss the result saying it shows only and miniscule percentage of Native American heritage Asma Khalid NPR News\nDozens of people in the Florida Panhandle Mexico beach are still unaccounted for days after hurricane Michael made landfall\nWith one hundred fifty five miles per hour winds one person in that city was killed sixteen others lost their lives as well as the hurricane unleashed powerful winds generated floods and spawn tornadoes from Florida to Virginia\nThe hangers at tend to air force base near Panama City or in ruins from that hurricane but his mind daily of member station WFSU tell this democratic Senator Bill Nelson says fears at the base might have to shut down our unfounded\nSenator Nelson says the bases eleven thousand personnel and most of its aircraft were evacuated prior to hurricane Michael's landfall hangers sustain heavy damage and some aircraft that remain during the storm are still being evaluated steel mills in a debate won't be closing down\nAs a senior member of the Senate Armed services committed [noise] I can say to him do will be rebuilt and it will be an example of modern us air force was\nMelting says Kendall is critically located next to the Air Force's eastern Gulf testing and training range in the Gulf of Mexico the U.S military's largest he called the training range quote one of our greatest national assets\nThat try and daily reporting this is NPR\nNorth and South Korea\nOf our greatest national assets that try and daily reporting this is NPR\nNorth and South Korea say they're going to restore rail enrolled links across their common border NPR's Anthony Kuhn reports it's one of many items agreed to in the latest round of high level talks\nThe two sides agreed to break ground this year on roads and railways running up and down the east and west coasts of the Korean Peninsula\nLater this month the two sides will meet to discuss a joint bid to host the twenty thirty two Olympics oldest is raising concerns in Washington that the inter Korean rapprochement is getting too far ahead of progress on the nuclear issue\nThat's NPR's Anthony Kuhn reporting the iconic retailers Sears has filed for bankruptcy the American auto center hardware appliance and clothing store I made the announcement after missing a one hundred thirty four million dollar debt payment today NPR's Emily sell then has this update\nFears was the most well known mail order catalogue company up the nineteenth and twenty century it's for decades it sold everything from diamond watches and cards to homes historian Jerry Hancock remembers it to prominence\nFears taught America or about the modern world through this catalog\nToday it's five point five billion dollars in debt it was a long march to the end the company has seen store closures and tumbling stock in recent years a medic constantly changing retail landscape dominated by Amazon e commerce and big box discount retailers\nIt's chapter eleven filing allowed the company to reorganize and perhaps emerged from bankruptcy was some of its business is still alive Emily Sullivan NPR News\nThis is NPR support\nFor NPR comes from progressive insurance committed to protecting Carson drivers weather on the open road or having a driveway moment while listening to NPR learn more progressive dot com or one eight hundred progressive and Americans for the arts and Americans for the arts dot org\nRain showers should continue through the evening here's the weather forecast a Seventy percent chance of rain this evening wind gusts up to thirty miles an hour\nPartly cloudy after midnight losing the upper thirties sunny skies tomorrow the windy with ... and the lower fifties mostly clear Tuesday evening the turning partly cloudy overnight losing the upper thirties mostly starting in briefly Wednesday hogs will be in the low fifties you're listening to W. V. all your arts and information station\nProgramming on WB I made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this was your arts that information station W. V. like hey off him", "year": "2018", "show_name": "Classical Music with Larry Vojtko", "city": "Williamsport", "day": "15"}