{"month": "10", "state": "PA", "station": "WVYA", "content": "Let me voice go in right after the news headlines from the NPR next and he'll have Showtime and chamber music orchestral music until four that's when we were joined NPR News once again for the award winning all things considered on your arts and information station\nThis was WB ... point not FM W. V. I. H. D. one scratching Wilkes Barre hazel to W. B. Y. U. eighty nine points evident that Williamsport WTO eighty eight points ... Mansfield at like one of the ... W. P. A. U. Nadia one point five FM ... township\nAnd translators W to walk to a T ... W to eight nine ... our son very W to zero seven eight a Williamsport end up to seven eight ... wells borough listener supported public radio [noise]\nMillions of us grew up with Mr Rogers on PBS and now to celebrate the fiftieth anniversary of Mr Roger's neighborhood WPRI and the greater ... valley United Way and the daily item invite you to the movie won't you be my neighbor Tuesday October night six PM in the camp procedure Lewis burn it's free first come first served\nFree small popcorn and drinks inter win prizes from WBAI anti again on or Mr Rogers by bringing a sweater to be donated to a community aid October night with W. V. I. ...\nOn the next fresh air had terrorists government political campaigns and even street gangs are using social media to push propaganda this information and fear with real world consequences\nWe talked with the W. singer and Emerson breaking authors of the new book like war the weaponization of social media China [noise]\nThis evening at six after all things considered on W. V. I. A. up at [noise]\nLive from NPR News in Washington I'm Laurie London UN ambassador Nikki Haley is planning to leave the Trump Administration NPR's Windsor Johnston reports in a surprise decision Haley announced chill resigned by the end of the year\nSpeaking alongside President Trump at the White House Hayley said it's been in honor of a lifetime and blessing can serve in the position\nI in fact you're lucky girl has been able to leave the state that race may and to serve\nMuch Haley as strong defender of the administration's foreign policy agenda is receiving some advance outgoing praise from Trump\nChoosing a fantastic job and we've done a fantastic job together we've solved a lot of problems or one of the process of solving a lot of problems\nTrump isn't ruling out the possibility of Haley serving in another capacity it's expected to nominate her successor within the next several weeks Windsor Johnston NPR News Washington\nAs hurricane Michael approaches the Florida Gulf Coast governor Rick Scott is urging residents to take this one seriously don't\nNPR News Washington\nAs hurricane Michael approaches the Florida Gulf Coast governor Rick Scott is urging residents to take this one seriously\nDon't take a chat a hundred and twenty miles per hour winds were going to have twelve inches of rain in some places but twelve feet potentially a storm surge do not take a trip\nYou said the impact will start to be felt as soon as tomorrow the residents really need to prepare now it's a massive storm that could bring total devastation to the state especially the panhandle hurricane Michael is forecast to be the most destructive storm to hit the Florida Panhandle in decades\nThe storm will be life threatening and extremely dangerous Michael is expected to make landfall in the category three storm with the potential for twelve foot storm surge from Tampa all the way to Pensacola\nJournalists are protesting across Pakistan to demand an end to harassment and censorship NPR's dia de reports from Islam about the protests come after a prominent columnist was forced to appear in court on charges of treason\nJournalists gathered outside the office I pressed come protest\nFrom a growing concerns that journalists are engaging in self censorship because they all their media outlets have received threats to kind of reporting critical of Pakistan's security forces most recently a lawyer demanded it investigation I guess it's a prominent Pakistani columnist he's seeking to having charged with edition\nSay the case of sending a message to other reporters to behave the date NPR News is on those odd\nMeanwhile turkey is welcoming Saudi Arabia's decision to allow authorities to inspect the Saudi ... ... ... it's done ...\nAs part of an investigation into the disappearance of Washington Post contributor Jamal a show the Turkish officials believe the show he was killed inside the consulate and had his body was later taken away Saudi officials adamantly denies this is NPR\nA death row inmate in Tennessee says he'd rather die in an electric chair than the state's current method of lethal injection from member station WBUR P. L. and Blake Farmer reports the convicted murderer is scheduled to die Thursday night\nWithin hours of the tendency Supreme Court upholding the state's three drug method of lethal injection attorneys for Edmunds ... say they notified prison officials of his preference to die by electrocution\nThey call it the lesser of two evils describing the existing lethal injection process as tend to Eighteen minutes of drowning suffocation in chemical burning\nTennessee death row inmates have been unsuccessful enforcing mistake to adopt the one drug methods they argue would be less painful\nIn the last Fifteen Years Virginia and South Carolina have also used electrocution as to back up to legal injection Tennessee west electrocuted a prisoner in two thousand seven and afterward as attorney called the practice barbaric and so that should never be used again for NPR News I'm Blake Farmer in Nashville\nAdvocates of taxing fossil fuels are feeling emboldened by a dire un warning about the urgency of combating climate change and a Nobel Prize awarded to to American economists to argue carbon taxes or the best way to address problems created by global warming\nCarbon taxes are designed to make users of fossil fuel such as coal oil and natural gas pay for the environmental damage they cause but neither the warning nor the economists research is likely to break down the political\nResistance from Congress and the White House I'm Laurie London NPR News in Washington\nSupport for NPR comments from NPR stations other contributors include a log me in Maine\nWashing\nSupport for NPR comes from NPR station or their contributors include a log me and makers have go to meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more at go to meeting\nDot com [noise]\nHere's the weather forecast with a W beyond you're listening area\nMostly cloudy this afternoon highest will be in the upper seventies how'd you find filming after midnight tonight lives will be in the lower sixties and after the fog list tomorrow morning we'll have partly sunny skies ice tomorrow the upper seventies\nRain begins move again tomorrow night with fifty percent chance of showers and lose the mid sixties showers are likely Thursday on Thursday night and perhaps them thunder storms as Well hi Thursday in the mid seventies this is W. B. I.\nProgramming on WB on young is made possible by our members we thank you for your support members and buying a Home Depot there's more home improvement information at the Home Depot dot com this is your arts and information station W. V. like I have a family [noise]\nGood afternoon on Larry ... thanks so much for tuning in on this Tuesday night stay by October ...\nComing up a little bit later we have a sweet from an opera binding risky course it costs will hear the overture to proceed to use the siege of courts that opera was per beard on this date\nA string quartet by a polish composer of the romantic period and later in this hour it's an expansive romantic symphony that will probably be new to you but right now here is John ... playing the impromptu number one in a flat out Frederick ...\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\nUh\nWell\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\nYeah\n\n[noise]\n[noise]\nW. B. I celebrate hundreds regional art and cultural organization for details and many more than just the w._b. I ate marching talented and catch up on our podcast a W. V. I. A. dot org slash ... listen for art scene with Erica funky weekday mornings after the news at eleven on W.\nV. A. F. out\nThis was WBRC eighty nine point nine of M. W. V. I. H. D. ones granted Wilkes Barre ... and we're in Williamsport it WTY eight eighty nine point seven have him in Mansfield a W T I O eighty eight point three of them were like well a ... a U. Ninety One point five of them\nStreaming live a W. V. I. A. dot org we have a translator in Clark so much at Ninety point three of them you're arts and information station listener supported public radio W. V. I. S.\nParliamentary disease is one of the most common medical conditions in the world millions of people in the United states government\nDump form of lung disease including asthma bronchitis emphysema\n... genetic and inspections are long factor\nFor why someone they develop one or more disease\nPulmonary disease every\nCount on the natural color Don dark\nWednesday night at seven thirty on WB I a TV\nProgramming on WB I is made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your arts and information station W. V. like I have family\nSupport for WBAI comes from the citizens voice providing loser in county with breaking news every day for the past forty years the citizens voice thanks their readership received news at home or on the go citizens voice here to stay more information as citizens voice dot com\nLive from NPR News in Washington I'm Laurie London one of the top us diplomats is stepping down NPR's Scott Horsley reports UN ambassador Nikki Haley has announced she'll be leaving her post by years and have these announcement\nCaused the international community by surprise although President Trump says it's been the works for months\nHer post by years and\nHe was announced when coffee international community by surprise although President Trump says it's been the works for months hey we offered no specific explanation for the move except to say she needs a break after six years as governor of South Carolina and nearly two representing the U.S before the United nations\nI'm a believer in term limits I think you have to the south was enough to know when you step aside and someone else to do the job\nTrump bruised Haley's work at the un and so have you hope she'll return to administration and some other capacity you said there are many good candidates to fill the un position and suggested he might name a successor for Haley in as little as two weeks Scott Horsley NPR News the White House\nThe national Hurricane Center says hurricane Michael have top sustained winds of one hundred and ten miles per hour and continue to get stronger as it moves toward Florida's Gulf Coast NPR's Windsor Johnston reports the storm is expected to make landfall tomorrow\nResidents in the path of the storm are boarding our homes and preparing to evacuate federal emergency management agency spokesperson Jeff fired says Michael will bring a life threatening storm surges and all warnings should be taken seriously\nAmazing other we ask you to do is to evacuated asked to do so that was the most important role you can play a to protect yourself but also to protect the lives of our first responders we asked if you do not for the our first responders in harm's way of if they have to come and try to rescue and you've been asked to evacuate\nForecasters say Michael is expected to make landfall on Wednesday state of emergency have been declared and thirty five Florida counties Windsor jumped in NPR News\nJournalists are protesting across Pakistan to demand an end to harassment and censorship\nProtests come after a prominent columnist was forced to attend court hearings in a case involving treason allegations against him\nNPR's ... reports from Islam about the protests full are growing concerns that journalists are engaging in self censorship because they all their media outlets have received threats to ... reporting critical of Pakistan's security forces most recently a lawyer demanded investigation gets to permanent Pakistani columnist\nHe's seeking to have in charge for ths edition activists say the case of sending a message to other reporters to be have\nIt also comes at a time when journalists across the globe face increasing danger and censorship from dictatorships unhappy with their reporting on Wall street stocks are wavering as investors absorbed the shakeout from rising interest rates\nThe Dow is down thirty four points the S. and P. five hundred off one this is NPR\nA day after a for voting report by the world's leading climate experts a Dutch court has ordered the country's government to step up its efforts to combat climate change\nAs Teri Schultz reports the ruling handed a victory to an environmental group representing almost a thousand Dutch citizens a Dutch appeals court says the government must revamp its plans to cut greenhouse gas emissions\nTo make sure the countries at least twenty five percent below Nineteen Ninety levels by the year twenty twenty that would be five percent better than the European Union target\nThe environmental group challenging the government or gender aimed to transition the country to a one hundred percent renewable energy supply the government's done too little to prevent the dangers of climate change and it's doing too little to catch up the court said in upholding at twenty Fifteen rolling by district court\nLast year emissions of greenhouse gases were only Thirteen percent below Nineteen Ninety levels in the Netherlands which is among the biggest polluters and they eat you for NPR News I'm Teri Schultz in Brussels\nSo he may not be on the ballot and the upcoming\nThe levels in the Netherlands which is among the biggest polluters and they eat you for NPR News I'm Teri Schultz in Brussels\nSo he may not be on the ballot in the upcoming midterm smart Vermont Senator Bernie Sanders is setting off on a nine state tour on behalf of democratic candidates is packed schedule included stops in Michigan Indiana Wisconsin Arizona Colorado Nevada and California\nThis will be Sanders' most extensive stretch of campaigning since the twenty sixteen presidential race\nIn the coming months he is expected to make a decision about whether or not he'll run again in twenty twenty and what may be a crowded democratic field I'm Laurie London NPR News in Washington\nSupport for NPR comments from NPR stations other contributors includes the three I O T providing a software platform that enables organizations could deploy artificial intelligence predicted analytics an ... solutions and industrial scale learn more at the three I O T dot AI\n\nRain coming our way here's the weather forecast\nMostly cloudy tonight with some patchy fog after midnight lives will be able to lower sixties tomorrow we'll have partly sunny skies highs and the upper seventies then tomorrow night a fifty percent chance of showers lows in the mid sixties\nShowers and perhaps some thunderstorms Thursday on Thursday night ... will be in the mid seventies an overnight lows in the upper forties then mostly sunny friday highs and the upper fifties\nThis was your arts and information station W. V. I. A. F. out\n\nIt doesn't take long to become addicted to opioids in fact Thirteen Pennsylvanians die from them every day [noise] guy singer is committed to ending opioid addiction with both prevention and treatment in the last three years we've reduced the amount of opioids we prescribe by fifty percent\nAnd please open three medication assisted treatment centers to help patients recover from attacks and learn more at guys are diehard flash had enough\n\nI Do hope your day is going well I'd Larry Boy Scout and thanks for spending some time with me coming up in this hour it's an orchestra sweet taken from one of the operas of Nicholas ... often\nIt includes a very famous symphonic march also with us here in ... to an opera that had a premier on this date we'll hear about the premier of\nA latter day off from a an American opera William bulk them a setting Arthur Miller as an opera so that's coming up on the ... state book\nAnd let's begin with a string quartet bio polish composer of the romantic period his name studies love ... and he was a quite influential and that made his mark\nIn music history mainly as a composer vocal music an opera in polish but he also wrote some instrumental music and we're going to hear his second string quartet now play by the Warsaw quartet here on WB I\n\n\n[noise]\n[noise]\n\n... ... ... na na na\nThere and ...\nUm\n\n[noise] the Warsaw quartet performing music of polish ... that was the string quartet number two in s major\nI'm Larry ... thanks for tuning in from the arching calendar coming up tonight at ... university the river hawk brass quintet will be in concert in ... concert hall\nAnd that is event is open without charge the queen ... perform music especially composer brass instruments ranging from the seventeenth century to the present day\nThe river hawk brass quintet this evening at seven thirty at ... university next week at like coming college it is a theatrical presentation of musical by Jason Robert Browne songs for a new world will be presented Wednesday October Seventeen through Saturday October twenty us\nAt eight o'clock in the Mary Elle Welsh theater\nVis a vis a contemporary abstract musical about decisions and self discovery\nThat is that like coming college next week find more events on line on the arts in calendar at W. V. I. A. dot org\n[noise]\nThis is the composers date book for October ... I'm ... [noise]\nOn today's date in Nineteen Ninety nine the lyric opera Chicago premier the new law by the American composer William Balkam\nBased on the plate of view from the bridge by Arthur Miller [noise]\nNot all stage plays translate well into opera Bolton was well aware [noise]\nIn theater he said you have the tax and then below what you have this subject\nAnd opera it is pretty much the opposite [noise]\nThe subjects is what you are really dealing with first and foremost\nBig raw emotions which are supported by the text not all of Arthur Miller's plays would make strung opera but if you from the bridge as a strong story that you can tell on one page\n[laughter]\nIn fact Miller's play all those set in Brooklyn in the Nineteen fifties has often been likened to do a Greek tragedy a theatrical form in which the chorus plays an important role Balkam saw that as a real opportunity\nIf you were going to do an opera from a play it better have a dimension that the play doesn't play you can't have your course speak at all because practically speaking it is financially prohibitive as soon as the course opens his mouth the price goes up because of actors equity\nSo naturally one of the great\nResources of opera houses opera chorus resource you can use much more easily [noise]\nComposers date book is supported by ma goose online test prep for the ACT that's designed to improve scores students can get video lessons practiced questions and experts support on line prep smart go far and enjoy the ride at ... dot com slash ACT\nComposers date book it's a production of eight PM American public media and the American composers for reminding you that all music was one [noise]\nOn this date another opera had its premier but we go back to the earlier part of the nineteenth century Eighteen twenty six and we're in Paris it was the opening the premier of the sea just Koreans by ... Seaney\nThe offer was a reworking into French as a French opera or one of his former Italian ... does is\nThere was a reworking into friendships a French opera or one of his former Italian it's about ... does the second [noise]\nUh he um reuse the material and revise did how did the little here ... little there and the siege of course was first presented on this date in Eighteen twenty six here's the yogurt your play by the national philharmonic under the ...\n[noise]\n[noise]\n[noise]\n\nCourse it costs here the state's he's best known for his ... Castro pieces such as Arizona and the ... year old but he also left a quite a number of operas which are measured in Russia\nHere's an orchestra sweet from one ... ... national workers drowned her name be happy and this week includes one of his most famous symphonic march is the protection of the nobles here's music ... W. B. I.\n\n\n[noise]\n\n\n\n[noise]\n[noise]\nMm [noise]\n\n\n[noise] [noise] [noise] [noise]\n\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n\n\n\nNo\n\n\n...\n\nThis was W. V. I. eighty not would not have found W. V. I. H. D. one scripted Wilkes Barre Eagleton in Williamsport W. B. Y. eight eighty nine point seven of them in Mansfield WTO eighty eight point three up and I'm like well and pop back\nW. P. A. U. Ninety One point five FM streaming live a W. B. A. dot org were in ... three any Bethlehem at what a five point seven member supportive public radio W. V. I. S.\n[noise]\nOn this week's broadcast of the San Francisco to use the director Michael Thomas brings out all the colors of the orchestra stolen and whole sections of us are going to get a chance to shine originally and collectively music by bar talking Mozart and Samuel Adams that next time with the San Francisco [noise]\nMonday afternoon it to a W. B. I. A. up out\nOn the next fresh air had terrorists government political campaigns and even street gangs\nAre using social media to push propaganda and disinformation and fear with real world consequences we talked with the W. singer ... authors of the new book like war the weaponization of social media China [noise]\nReceiving at six after all things considered on WB I Am about\nLife from NPR News in Washington I'm Laurie London the Supreme Court is welcoming Brett Kavanaugh for his first day on the bench\nNPR's Carrie Johnson reports the high court heard arguments in two cases today chief justice John Roberts says he wishes Brett Kavanaugh along unhappy career on the Supreme Court Kevin O's already made his presence known he asked more than ten questions during the oral arguments\nAlong unhappy career on the Supreme Court Kavanaugh was already made his presence known he asked more than ten questions during the oral arguments he\nExchanged warm greetings with justice Elena Kagan who once hired him to teach at Harvard law school and after about two hours he shook Kagan's hand as he left the bench Kavanaugh's wife Ashley in his two daughters attend in the morning arguments\nSo did retire Justice Anthony Kennedy who Kavanaugh were placed on the high court\nDozens of people protested outside the Supreme Court citing sexual assault allegation Kavanaugh has denied but inside the chamber there were no disruptions Carrie Johnson NPR News Washington\nOn the Indonesian island of ... more than ten thousand rescue workers are scouring the expensive debris for victims ahead of Thursdays government imposed deadline to stop\nThey're focusing on three areas obliterated by soil liquid vacation following an earthquake that triggered a massive nominee less than two weeks ago the death toll has surpassed two thousand but as NPR's Lauren Frayer reports from the city of ... near the epicenter\nMany more people are still missing up to five thousand people are still unaccounted\nFor workers are rushing to recover bodies before Thursday when the government plans to call off the search it's putting new restrictions on foreign aid workers ordering them out of the quake zone unless they're partnering with local groups Indonesia does not want to be seen as relying on foreign aid\nThe decision to end the search has angered some relatives of those still missing the national disaster mitigation agency their sights concern about the spread of disease\nGoogle is shutting down the consumer version of its failed social network Google Plus after announcing Monday that the private profile data of at least five hundred thousand users may have been exposed to hundreds of external developers NPR's Jasmine Garsd reports the move was prompted by a Wall Street\nJournal report user data was exposed from two thousand Fifteen to march two thousand Eighteen also troubling according to the report is that Google decided not to inform the public\nBut for many ... was really surprising wasn't the privacy breach or that Google decided to shut Google Plus down it was at Google Plus even still exists\nThe social media platforms failed to garner popularity and was widely considered one of the company's biggest failures Jasmine Garsd NPR News New York\nOn Wall street the Dow is up ten points you're listening to NPR News\nThe U.S Forest Service is proposing changes to sage grouse protections that would make it easier to develop on vast swaths of land where the chicken like bird lives Wyoming Public Radio's Cooper ... Kim has more\nThere are several years of siege grass protections in the forest service's current plants these were initially approved and twenty Fifteen to help prevent the bird from becoming endangered the proposed changes would do away with the highest year remove steam federal cooperation acquired or approved development and special cases especially relating to energy\nMichael solved with the center for biological diversity he says energy operations do not mix will with sage grouse\nIt's going to increase the likelihood that they ultimately are going to be on the road to extinction\nBefore services giving the public Ninety Days to comment the Interior Department is also looking at changing its ... plans with an eye towards promoting energy development for NPR News I'm Cooper McCann in Laramie\nDutch appeals court has upheld a landmark ruling that ordered the Dutch government to cut the country's greenhouse gas emissions by at least twenty five per se\nAppeals court has upheld a landmark ruling that ordered the Dutch government to cut the country's greenhouse gas emissions by at least twenty five percent by twenty twenty firm benchmark Nineteen Ninety levels\nThe original June twenty Fifteen ruling came in a case brought by the environmental group or gender on behalf of nine hundred Dutch citizens\nSimilar cases are now underway in several other countries the court said the government is under a legal obligation to take measures that protect its citizens against dangerous climate\nChange I Laurie London NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include workman publisher of a thousand books to read before you die a life changing lift a readers compendium for inspiring hours of browsing the joy of discovery and the answer to the question what to read next\nRain coming our way here's\nThe weather forecast mostly cloudy tonight with some ... after midnight lives will be in the lower sixties tomorrow we'll have partly sunny skies highs and the upper seventies then tomorrow night a fifty percent chance of showers lows in the mid sixties showers and perhaps some thunderstorms Thursday on Thursday night\nAll eyes will be in the mid seventies an overnight lows in the upper forties then mostly sunny friday highs and the upper fifties\nThis is your arts and information station W. V. I\nAm\nJoined us for a celebration of one hundredth anniversary of the birth of later\nOn Sunday afternoon at three Gary and burn it at all with Iran is Richard McDonald's\nA program that includes excerpts from states where you can do to west side story when does this early on WB I ate and the Dietrich theater invite you to enjoy this time through divorce or donate theater make reservations or do we need more forceful seven zero six five five to eight\nHello again I'm Larry voice go in this final our classical music on Tuesday it's\nMusic from the romantic period including with a trumpet concerto we'll also hear some music for violent and guitar by pocket money and we begin with an overture by French composer Daniel ... over there who was also a leader in his career the director of the Paris Conservatory\nThis was considered the first of what is called grand opera\nThe mute girl of port teach the level went to Puerto ... here's the overture played by the orchestra dilemma real conflicts alter ego and my cabbage\n[noise]\n\n[noise]\nOr\n\n[noise]\n\nThis was a little musical farewell by sir Edward Eldar\n[noise]\n[noise]\n\n\n\n\n\n\n\n\nOh sweet little piece simply titled idea by sir Edward Eldar unit performance by the board must just want to get to George first conducting\nI'm every voice go a little bit later a trumpet concerto and just ahead music for violin and guitar by how can any least Eighteen\nProgramming on W. V. I. is made possible by our members and by Pennsylvania College of technology thinking about college hoping to land a great job after earning your degree think Pennsylvania College of technology\nWith one hundred plus bachelor an associate's degrees an exciting career fields industry standard labs in uh Ninety six percent graduation placement rate pen college is perfect for hands on learners\nVisit P. C. T. dot edu to learn about Penn college degrees that work\nHere's the w._b. I weather forecasts\nThursday will be a rainy day tonight will have mostly cloudy skies some long after midnight lives will be in the lower sixties\nPartly sunny skies tomorrow highs and the upper seventies rain losing tomorrow night those will be in the mid sixties Thursday on Thursday nights showers likely with a Ninety percent chance of rain during the day an eighty percent chance of rain at night I was in the mid seventies then mostly sunny on friday and cool with high the makeup or fifties this is W. V. I. A. F. N.\n\n[noise] like what you see on WB I Do enjoy fine programs like pull dark Nobel or nature do your kids love watching the antics of Belmont Sesame Street enjoy did the science kid are curious George how 'bout shows like called the doctor\nThat were nature do your kids love watching the antics of Elmo on Sesame Street enjoy the science kid are curious George how 'bout shows like called the doctor Pennsylvania pogo or scholastic scrimmage\nWhatever the reason you watch we want you to know that you make it all possible becoming number today and ensure the future of your favorite programs that W. V. I. I. dot org and thank you for your support for W. V. I.\nThanks for spending some time with me it's music ... right now who's virtual city as the violinist was so talented get seemed almost supernatural some say he made a pact with the devil\nWell he was also the oldest and the guitarist any run a number of pieces for guitar and for the combination of the violin and guitar here's one the ... contract hotter in hey give a harm as the violinist yarns will surely guitars and music of legal ...\nNo\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\nAdopted Roy very ever imagined that the instruments to which he ministers in the fifties and sixties would be regarded as national treasures but they are and we share them with special concerts from ... long view in Shreveport\nTo preview the upcoming east Texas organ festival this week on pipe dreams from American public media Michael Barone I Hope you'll be listening [noise]\nSunday Morning at six on WB I Am\n[noise]\nRain coming our way here's the weather forecast\nMostly cloudy tonight with some ... after midnight lives will be on the lower sixties tomorrow we'll have partly sunny skies highs and the upper seventies then tomorrow night a fifty percent chance of showers lows in the mid sixties showers and perhaps some thunderstorms Thursday on Thursday night\nAll eyes will be in the mid seventies an overnight lows in the upper forties then mostly sunny friday highs and the upper fifties\nThis is your arts and information station W. V. I Am\n\nSorry you weren't ducks in a row\nAlmost half of Americans do not have a proper ... plan\nIs the plans are more than matters of money and inheritance\nDeacon guide your future health decisions Andrew vine special instructions for loved ones in your care [noise] put your mind at the beginning you're ducks in Rio today [noise]\nTo request a free planning guy content Joe ... W young young [noise]\n\nTo conclude our time together it's music of a little known composer Oscar ...\nHe was a contemporary of raw modern often Vaughan Williams mainly he was a trumpet virtuoso he studied the lights the conservatory but most of his career was spent in Russia as the a trumpeter in the ... theater orchestra and he was also a teacher in St Petersburg\nHere's this trumpet concerto up is Eighteen play by Georgia prospered with a check the la montage orchestra Arnie rough conducting the music of Oscar been\n\n\n\n\n\n\n\n[noise]\n\n", "show_name": "Classical Music with Larry Vojtko", "year": "2018", "city": "Williamsport", "day": "09"}