{"month": "10", "state": "TX", "station": "KTRH", "content": "I go uh towards the matrix that oh I think if people who are experiencing with the space and I don't take that away from them but I Believe that the eggs that zeroes into wars and the Jews to nine or sometime interfere with and we see will we see we feel we feed him he'd move they move\nBut this is my question\nMy questions in all the tragedy that do happen on this planet and and that's not excluding things have happened right here in this country if the protocol the goals would be because you have had tragedies\nA on in your life it took away your life then there would be more goes on this planet any will be people\nAnd just let's just deal with the United states itself I mean uh I Am part Cherokee and so I'm just saying the tragedy happened in them in all all the people Jews all over the world what is the protocol to be a goal and if you believe in that\nIt was not the matrix\nOr could you ever considered this being the matrix and the numbers you just not calculating that these are the way it should be\nThat is my question thank you for your joined or music or their George I love all your music all the way from bluegrass dude sold to everything from the years you've been play you a number one when it comes to that\nAll right my friend more to come so what what what is the definition Ron what a ghost becomes why does it become a ghost\n... sixty four thousand dollar question Georgian\nEnvy honestly we really don't know exactly what a ghost is I mean ah when I first started doing this I used to work with a Franciscan monks and we had a cause a religious aspects of it\nAnd we come up with the feeling that maybe some of this is that the purgatory thing not like it's a punishment but rather its place it's a temporal thing versus the and the thing so I mean that's they're just going on doing their\nTime basically but that's I mean that's the only one theory there are many three shifts the tragedy thing is when I always worried about in\nGettysburg was always supposed to be the most part it then that's why it's the most thing but there are there are battles I mean Nagasaki and you I mean thousands of people will tell like that why are we seeing like\nAll those goes from running around so there's gotta be certain aspects of that we were unaware of or or have yet to determine and the ... and really be quite honestly nobody knows exactly\nFor sure we have our theories and that's all it is\nAre there any friendly ghosts like Casper or are they all tied the evil\n[laughter] well well yeah I mean what's what's the guardian angel what are you know spirit guide I Am a uh the ghost to maybe\n... I guess it depends on what the definition of the ghost might be I mean if somebody sees their dead grandmother at the side of the bed is that a ghost or\nIs that there's some kind of entity your spirit or or one of your same\nThe number one I always said the number one citing is is what I Believe is a messenger goes that's somebody who is just passed away and they they either come back to see how you're doing or let them know let you know that they're okay I mean they happen to my mom my mom didn't believe in goes or anything my dad died at a\nCompany that family cookout never got to say goodbye that night uh she was in bed and she swears he came in fully dressed in a suit and she's scared the crap and she screamed and he disappeared but\nThere are countless examples of that ah throughout history\nLet's go to the shade in billings Montana first time caller squeeze shading then go ahead and she doesn't\nGo enjoyed great thank you hey I had a question our last night you're talking about spirit guide a little bit and it really piqued my interest in ... night by interest is once again are actually had a question from ... sure\nUm I've had numerous people throughout my life come up to me and told me there's something following and I've been what and they can never give me a straight answer I've always been curious as to what it is\nAnd have you have you felt that you had something following you\nOh my entire life you have come from\nEarly childhood but there's something polling experience when I was about seven years old my backyard my parents were both inside the house and I came in screaming because some some things fit my name into my ear and it made my ear vibrate\nBox that bringing out now have you have you ... have you felt threatened\nOr do you feel secure with whatever entity is doing this\nYou know it's kind of\nA car and your and then there are times when I feel like it I don't ever feel like it's trying to harm me but I Do feel like there's certain people in my life that try to act in ways\nAnd interesting well let me tell you in the in the short time we have left\nMy experience is that if these entities aren't hurting you a ... the I don't think you have much to worry about Maureen we've only got about thirty seconds left would you agree with that if he's not being heard that the these entities aren't out to really hurt him\nAbsolutely and I was going to say go get a great job because that was the same thing I Would ask because typically I don't think it's a who I mean what I'm saying is following I think that if someone\nUm and I think it's more of a relative it's like a guy that looking over you know maybe they're watching out for you and sometimes not as can do when they could but I don't think they're there to harm you\nAll right both of you thank you so much for being on the program the name of the book is called more goes chronicles it's really a great read if you're in the ghost stories and the supernatural dishes [noise]\nGo auntie Tom Dan ... loan heard Sean law the shores Stephanie Smith\nChris boroughs timber and George nap I'm George Norris somewhere out there on coast to coast am we'll see you on our next until then be safer [noise]\n\nMichael berry she'll guarantee we're going to die for your\nMoney back to ... live free or we're all going to die yeah\nSo let's just lay off the judge you know the the morning at eight afternoon at five and seven forty\nKatie R. H. hoops steam cleaning show up on time to clean your carpets they'll do a good job they won't up so you know if there are other things you want done they'll do it and I'll tell you how much that costs\nCommercial carpet cleaning is well not just your home air duct cleaning natural stone ceramic tile grout cleaning bathrooms kitchens all of it countertops oriental rug upholstery they can do it all looks steam dot com to eight one eight to two oh five six one\nTo eight one eight to two oh five six one\nThis report is sponsored by Special Olympics Texas crave adventure they've got your fix repelled twenty stories from the roof of the embassy suite so talent downtown Houston on November seventeenth of the Special Olympics Texas over the edge of that go to see X. dot org slash ... or ... three to nine zero zero zero for nine\nWith all the experiments that are happening at CERN going beyond the typical could there be a breach the truly terrifying I mean these fields up it's common ground zero with Clyde Louis tonight intent on seven forty\nKatie our age thank you for listening to cagey our age this is a Jimmy ... from Houston It's MORNING news remember you can listen to us anywhere that's why we created I heart radio I listen all my favorite music and all my favorite stations all free download or open our car radio up and try it free\nFood stocks shop and bad\nWeather conversation last word more sleep a family time better life life\nInformation station every facet of life news radio seven forty ... [noise]\n[noise]\nThe leaders\nFurniture made an American studios this he's the youth Radio's seven forty Katie R. H. bused in orange radio station\nMichael continues to barrel through the Gulf slam Eric sharp and he was four o'clock on news radio seven forty ... traffic and whether together here is playing a\nCouple of stone vehicles have been moved to the shoulder ice in the\n... street also six in the north east bound before Jensen and we've got some overnight construction sounds to be aware of the ... at the south Sam toll plaza also why forty fives all freeway nor spawn from each wrote an essay him six forty six\nThe party that holds the White House typically loses seats in mid term congressional elections\nIt's ten minutes now after the hour on this morning\nAmericas first news\nThe Capitol one is building a better bank one that feels an ax nothing like a typical bank it's why they're reimagining banking and building something completely different\nThey offer accounts with no fees are minimum they also offer one of the best savings rates in America and you can open a capital one account from anywhere in five minutes capital one this is banking re imagined\nOpen an account today inexperienced banking re imagined for yourself capital one what's in your wallet capital one in a\nYou can print invoices without\nYour status reports spreadsheets wrote on record doing twelve minutes without\nKnow you can print anything without [noise] luckily staples has a huge selection of ink and donor in stock and a great prices everyday and drinks people's\nPrinting of it by one age beating cartridge and get a second to thirty percent so stock up now because you can't afford to run out of\nPoverty stricken sources cedar\nStaples dot com slashing savings for details commence Exxon Mobil CEO test [noise] scientist observes subject bad station subject to be earns Exxon Mobil rewards costs punch punch she can use to save on gas coffee car washes and more subject ... wealth and buy me a copy subject they look like\nShe's leading such hasn't purchased me anything yet [noise]\nConclusion Exxon Mobil rewards plus makes refueling rewarding and subject the owes me a coffee perhaps a donut signed up today at Exxon Mobil rewards plus dot com terms conditions pliable or participating ExxonMobil granted locations\nWhen a state ranks among the top ten in the country for major new and expanded facilities that's pure growth\nWhen it's tops for four straight years that's pure Michigan long known as a world leader in the automotive industry Michigan is also a leader in advanced manufacturing cyber security agribusiness an aerospace\nInfect CNBC rates Michigan as the most improve state for business to learn more visit Michigan business dot org\nChristian Brothers automotive is Houston trusted name in auto repair ... AFC started by technician and they're free settled there they'll make starting to keep you and your family safe on the road Christian Brothers automotive ready to serve you with twenty sevens scenario location to schedule the free credits the inspection visit C. P. A. the dot com\nThis is a perfect time if you've been putting off getting your new ac system\nTrain T. R. A. N. E. go to Houston train dot com rebates up to Fifteen hundred dollars on qualifying systems special financing all sorts of deals available with credit approval\nGo to Houston train G. R. A. N. E. ... independent train comfort specialist dealer\nHouston trained DRA in Houston train dot com it's hard to stop a train\nMoving my family economy my job to the White House Houston's morning news with Jimmy marriage and share of higher this morning at five live\nLife your life every day why news radio seven forty cagey R. H. Gordon\nDeal here at five cats used in the morning news Jimmy beret and shower prior to keep you in touch in on time was trafficking whether together every ten minutes on the\nThrough the clutter to bring you the people and stories that matter to you you are listening to America's first knew this morning with Gordon the\nBudget with us we'll come into Wednesday there are competing advertisements\nRepresenting an effort to grab the attention of the world's most powerful TV viewer President Trump there's also a belief by Washington's influence industry that Mr Trump can be swayed by what he sees on TV here's what's happening from Wall Street Journal national political reporter Julie biker which Julie what's up\nIt's no secret that the president as an avid watcher of Fox News in particular and we know that because he is frequently tweeting in real time as he watches particularly Fox and friends in the morning and then also um\nDuring Hannity in the evening sometimes references Lou Dobbs them over at the Fox business channel until the general public notice this until have lobbyists and DC and\nLobbyist had found that in effect give way to get a message in front of the president is to advertise during his favorite TV program so that's what we're seeing happen more and more\nWild like ... like a fern what example whose airing what\nWill we took a look at the story now because there's a big fight to that's been going on over ethanol and so groups that are\nSavoring you know President Trump increasing the mix of ethanol in gasoline has been um advertising a lot lately during Fox News programs and group said also oppose that are sort of counter messaging to him during the same programs\nAs you know to be influenced by them\nFor what we can see if he doesn't ... sometimes directly after an ad\nThat pops up on TALK on this happened to win a group of a U.S steel workers that advertising during boxing fans in March you know as the ad came up the president started talking about the issue suggesting that he had seen the ad um\nAnd then sort of on the other side here if you remember last year billionaire Tom's tire who's constantly and fights with the president has started an impeachment movement I'm\nKind of was trolling him in a way by putting up an ad during Fox and friends and the president noticed that and tweeted about it right away\nWe're speaking with Wall Street journal national political reporter Julie bike what's her piece was called interest groups compete for Trump's TV attention you know what to do the ad revenue for these programs that Mr Trump watches on the rise right\nThat's right and to not only is the president watching but the the programs himself have really strong viewership um during this administration the viewership has raised and and so have the ad rates and we've actually seen some ... from\nYou know notice that not only is the president watching these shows that people who are highly supportive of the president are also watching and so the thinking is not only to reach the audience of wine but perhaps you know out in the heartland Trump's base watching the same ads\nAnd maybe they will engage more on the types of issues that are being advertised about\nI thought it was interesting too you said that a strategist also target early hours on MSNBC and CNN outcome\nWell although the president um has expressed a dislike for programs on on those two channels there's there's no debate that at least they're monitoring how those channels are talking about him and so the thinking there\nIs that people who are influential with the president may see some types of advertising and and a flag it to him\nThat uh that sounds I guess along the lines of what ah the guy Kevin Mac from that group need to impeach how he feels so he just suspects at the president's watching and knows he can targeting with with I don't know like a little elbow and the ribs kinda bad\nActually exactly um and then also sort of interesting here is the president has been very disparaging of Saturday Night live as a show that's not funny any longer\nAnd one that he says he doesn't watch but there's some evidence that he was watching and groups are also starting to put up at string Saturday Night live it\nMakes Julie's Wall Street journal national political reporter Julie by go with\nMore sort of the program is drawn to you by white streams\nAre thinking about saving money this fall\nWhy not start by paying less interest on your credit card balances refinance with a credit card consolidation loan from white stream\nIs an easy way to save hundreds perhaps thousands of dollars and lower your interest rate light stream offers credit card consolidation loans from five point eight nine percent a PR with auto pay that is way lower\nThan the average credit card interest rate of over Eighteen percent\nAlso know by the way you can get your funds as soon as the day you apply light streamed believes that people with good credit deserve a great interest rate and no fees and our listeners conceive even more with an additional interest rate discount on top of light streams already low rates\nThe only way to get this just jump is to go to light stream dot com slash deal that's white stream L. I. G. H. T. S. T. R. E. A. M. light stream\nDot com slash deal subject to credit approval the rate includes a zero point five zero percent auto pay discount terms and conditions apply in offers are subject to change without notice visit lights dream dot com for more information for the additional discount it's light stream\nDot com slash deal twenty minutes after the hour on this morning Jennifer ... is here\nWith more of America's first new\nPort in hurricane Michael swelled to an extremely dangerous category for storm as it rumble toward the Gulf Coast of Florida and what\nForecasters warn is an unprecedented weather events for the area the national Hurricane Center says the storm has now packing maximum wind gust of one hundred thirty miles per hour could grow even more and is expected to slam a short today among the Florida Panhandle or Big Bend area\nAs a life threatening events FEMA associate administrator Jeff fired\nTime to prepare is now a please we want to read as a size to eat those local warnings as they know best\nSalt vehicle has been moved to the shoulder to any ignores phone in Yellowstone and light trucks in the Gulf Coast windows dot com twenty four hour traffic center [noise]\nWeather Channel's forecast for the first time in a long time no mention of grain for today just part of my colleagues guys highs of eighty nine and it's not clear skies a little bit cooler than it has been closed down to sixty three this evening right now what am I calling in Seventy three T. R. H. Westside north side Lexus twenty\nFour I'm a winter center ... news time is now for thirty one and our top story well hurricane Michael is grown in strength to a very dangerous category for storm\nNational Hurricane center says the Bible has maximum sustained winds of a hundred and forty miles per hour as it closes in on the Florida Panhandle it's turning about a hundred and eighty miles south southwest of Panama City at last check\n... secretary of state Mike Pompeo says that there's been solid progress in relations with North Korea bumping into just returning from a meeting with North Korean leader Kim Jong un he says that President Trump could have a second meeting with Kim in the near future\nAnd General Motors will soon be building pick up trucks and full size issue bees have plants that are powered by wind instead of fuel\nThe company's goal is to power all global facilities with renewable energy by the year twenty fifty the average will target wind farms in Ohio Illinois and right here in Texas\nNews on demand at Katy outrage dot com or next updates had five breaking info is an avid time now for more America's first News I'm Eric sharp on news radio seven forty Katie our age\nThis report is brought you buy unbalanced dot org right now there are young people across the world facing a tough choice continue their dream of education or drop out to help their family put food on the table you can help change the future in a single moment see how far your support can go at ... dot org\nOops steam cleaning show up on time to clean your carpets they'll do a good job they won't up so you know if there are other things you want done they'll do it and I'll tell you how much that costs\nCommercial carpet cleaning is well not just your home air duct cleaning natural stone ceramic tile grout cleaning bathrooms kitchens all of it countertops oriental rug upholstery they can do it all hoops steam dot com to eight one eight to two oh five six to eight one eight to ...\nUh this is Jimmy bird for Bill advisor dot com if you have a cell phone pay TV electricity Internet our home in auto insurance you really need to listen up because every week bill advisor is winning for hundreds of our listeners\nThere now so committed they doubled their savings guarantee from one hundred fifty to three hundred dollars if they can see me at least we hundred bucks you get everybody back no set up the still just one Ninety nine promotes searched me right now takes the word go that's geo to twenty three twenty three twenty three or go to bill advisor dot com and click start saving\n[noise] want to get really growing armor gates soil complete ...\nBlend provide out one two punch that simply works this powerful organic combo designed especially for gardening success in our area will energize your green dumb like never before so him out to the armor again located in Tom ball on FM twenty nine twenty a mile and\nOf our way to forty nine warm visit us online ad Barbara gate dot com\n[noise] very that's talking sprinkler goes in the winter months you're loaned me to a lot less water in their hand to shut me\nAnd water and things like that term unlike me aren't black\nHouston sounds good everywhere he okay Google Play Katie our age and I are draining out [noise]\n\nWithout the nonsense you are listening to America's first news this morning with the [noise] the bricks\nBeing with us we'll come into Wednesday October ten Gordon Deal Jennifer ... some of our top stories and headlines hurricane Michael targets the Gulf Coast UN ambassador Nikki Haley stepping down new rules expected today that could change the number of green cards issued\nUS News says the number one place to retire is Lancaster, Pennsylvania\nTaylor Swift one artist to year at the American Music Awards new baseball the next two days since new division series won five games and the newborn\nAbout to complete a trip to all fifty states that story in about twenty minutes\nGraze the hurricane Michael which has developed into a category ... storm of the targets landfall today hundreds of thousands in the Florida Panhandle and Big Bend area have been told to evacuate\nThe Alabama coast also paying close attention as it shares a border with the Florida Panhandle that's where we find Sean Solomon morning show hosted at them talk one of those six five W. A. D. H. radio immobile one of our Philly It's MORNING showing the divisions right now\nWe hear it oh it will be will not bad gusty we've got some gusts twenty of maybe a little over twenty miles an hour maybe twenty five and a few showers but we are on the western side of what is now I have very very big hurricane Michael in the western shine for people who don't watch it is that\nIf there is a thing is the good side right so the northeast quadrant of any hurricane or its impact area that's the worst tried to be on and the north west side if there is a good side that is the better when in other words the weight and fall apart quickly you have less issue with storm surge\nAnd it's just the uh the drier side as well of a storm so we're actually on that side where so many people have come before the panhandle to be as close as they came to their own but still be safe we had seen a day's worth a whole twenty four hours of a massive shift to people from Florida Panhandle in the southwest Alabama\nWow do you have the ability to accommodate all those folks\nBut they were full now but but will show figure out areas like Baldwin county which is one of the\nTwo counties that make up our metro area around we'll be obey they have opened up their coliseum in Baldwin county to take a take a ... and a ... I Know that I guess I got a report this morning we're pretty getting pretty close to full\nOn hotels here immobile county but uh people probably at that point if we'd do fill up in our area mobile and bought one counties up people will probably continue to go west to the Mississippi coast\nEven though at this point it does look like mobiles going to take a direct hit you do kind of have unique topography right 'cause that mobile bay kind of it it's like a little inlet off of the Gulf Coast is that poses particular flooding problems\nIt can yeah I'm a big inlet first your mobile bay and it it you know it shaped like a show many ... why does that ring towards the southern end of it then the next down as it comes up towards the McGill river comes into the bay and we're ... and that could give you an issue with search but once again lucky for us being on the west\nHi Wendy she's going to be really valid north today show which areas to the east of the storm that will get that on short but we saw Gordon Moore the short float yesterday as Michael was still further out in the Gulf and we saw\nWater levels three to four feet above normal yesterday and today I have a feeling that will be lower because the storm\nIs now going to be the swing wins from the north towards us but you know it it's very being here because waking up this morning I went to bed last night this was a category three we're doing a very significant hurricanes waking up to a category four and wind speeds\nAre very much like a category for that hit movie oh back in Nineteen Seventy nine hurricane Frederick\n... absolutely let big areas of Moby on ball when counties especially immobile county when I talk about what it did on the coast and the trees down that's what I worry about on the stand into storm surge right now obviously a threat to life but also there has not been a significant hurricane in that area\nBut the Florida Panhandle in long enough that the trees are not what they call waiting for him and I I I'm scared were received their for damages of trees down further inland trees on houses those issues\nAnd we could live this morning with Sean Solomon morning show hosted FM talk one oh six five in Mobile Alabama one of our affiliates you're like a junior meteorologist now the way you talk about this stuff you ever get tired though of like kind of living under the the hurricane or tornado threatened that area but\nI don't know I mean do you get tired of a snowstorm says you know in the northeastern part of life yeah sure I mean we don't like it and it said when it hit you when it's your time it's set you back and set your life back\nBut it's also you know part of part of the cost of living in a beautiful place you're on the northern Gulf Coast show I don't know you take it you take it with the good you know you just take it that part of life\nThe Florida residents one evacuation of your home or getting out your address or cell phone number or anything like that\nWe are I'm going to do a little video with my children and my dogs and how they acted last night and if those evacuated when it comes to my house hey you all are welcome\nVery good stay safe thanks for a few minutes is always good to audio Sean Solomon from ... one of those six five in Mobile Alabama is twenty minutes now in front of the hour on this morning Americas first news\nLook into any great business whether it's a manufacturing\nOr a hotel a store [noise]\nLooking to each and every one of\nThem and you'll find the same thing great\nPeople grown us we believe that great businesses are powered by great people and with criminals workforce solutions we'll help you find them gates and engage them learn more criminals dot com cross workforce innovation works [noise]", "show_name": "This Morning With Gordon Deal", "year": "2018", "city": "Houston", "day": "10"}