{"month": "10", "state": "FL", "station": "WUSF", "content": "It's the thirty nine the water jazz holiday October Eighteenth to the twenty first encroachment park if you drink George Thurgood into destroyers Morris Day and the time Jay Jay ... throw the ... brothers and many more tickets at Clearwater jazz dot com\nHurricanes lightning flooding and tornadoes affect the entire state of Florida and the team of meteorologist from the Florida public radio emergency network keep you informed around the clock\nAll year long we're committed to providing in depth weather coverage\nFor all year long we're committed to providing in depth weather coverage both here on W. us up and on the mobile app Florida storms the Florida public radio emergency network is supported by W USF and citizens property insurance on line its citizens F. L. A. dot com\nI might Cornett stay tuned after a news update for all my jobs and tonight on all night just several brand new recordings including something from Tony Bennett with Diana crawl and you're listening to W. S. F. I. D. nine point seven Tampa saint Petersburg Sarasota we're broadcasting from the University of South Florida\nHere is NPR News than all my parents\nLive from NPR News in Washington I'm Janine hurts on Capitol Hill [noise]\nAs Kevin I took his oath of office that's a one hundred second associate justice of the Supreme Court in a private ceremony tonight protesters chanted outside the building at across the street at the U.S Capitol\nDemocratic Senator Chris Coons says he had hoped the FBI investigation which all the cabinet isn't fit to sit on the nation's highest court [noise]\nVery high [noise]\nThe President Trump campaigning for Republican candidates in Topeka, Kansas tonight told a cheering crowd he's pleased with the centers decision but that's conservative can't be complacent with maternal elections just weeks away were draining the swamp and we want to [noise]\nDrop is now but it's conservative stamp on the court with the second successful nomination in as many years [noise] Brazilians go to the polls tomorrow to choose a new president NPR's Philip Reeves reports\nShy boats NATO a veteran congressman is the clear front runner up a few years ago he was a minor figure notorious for offensive remarks about gender and race you know he could be about to leave Latin America's largest nation shop you to the rights\nTo when he needs more than fifty percent of the vote otherwise there'll be a runoff probably between him and his chief rival from the leftist workers' party\nPolls showed ... support rising steadily during the campaign most of what she spent in hospital love to be stopped at a rally it's supposed to say he's a champion of family values and upload his hard line stance on crime and corruption\nBoth NATO as Mara Brazil's polish military dictatorship which is why his opponents say he threatens democracy itself\nFor the breeze MPR news British native\nAmericans spent five hundred billion dollars a year and they're grown children that's according to a new study and beyond a Jaffe reports that's twice the amount that contribute to their own retirement funds\nAbout a quarter of the money that parents spend on children ages Eighteen to thirty four goats toward their education the study for Merrill Lynch and the research organization age wave also found that nearly a third of adult children live with their parents that's higher than the percentage slipping without\nOverall almost eighty percent of parents contribute to the support of their adult children that includes major expenses like paying for a wedding or helping with the purchase of a home and don't concludes help with daily needs like rent car expenses groceries or cell phone bill's\nEighty two percent of parents said they are willing to make a financial sacrifice to help an adult child by dipping into their savings curtailing their own life style taking on debt or refinancing their home I knew Jaffe NPR News\nAnd you're listening to NPR News from Washington\n\nThe Congolese health ministry says another five confirmed cases of Ebola have been found in Democratic Republic of Congo as health workers struggle to contain the disease the world Health Organization says there\nWorkers struggle to contain the disease the world Health Organization says there are one hundred thirty five confirmed cases of the disease more than two months since the outbreak was declared\nHealth workers face a number of obstacles and fighting Ebola virus circulating in the eastern part of the country where there has been frequent violent clashes between armed groups and the government and many people don't trust health workers and not let them into their villages\nThe ruins of palm pay buried under volcanic ash than Seventy nine ... D have yielded a new treasure NPR's Sylvia Poggioli reports archaeologist discovered a richly painted garden seen in a well to do home\nThe discovery was reported by the Italian ... news agency given exclusive access to the site dubbed and chanted garden photos show intricate ... Serpas peacocks and delicate birds and flowers\nThey're located in what the head of the ... pay archaeological sites boxy my old Ron I called a marvelous an enigmatic room that must be carefully studied\nOther photos show a few years dog fighting a wild boar against a blood red background but color known as ... paying rent\nOr Donald says the house probably belong to a wealthy tradesmen a refined and cultivated person commission the best artists of the time it's not known when new rules will be open to the public\nSo beautiful Joel Rose NPR News Rome\nI'm Janine her and you're listening to NPR News from Washington\nSupport for NPR comes from NPR stations or their contributors include vital project started supporting the museum of modern art in Manhattan where a judge and dance theater the work is never done it on view and includes weekly performances in the ... more a moment dot org\nIt's all my jobs for Saturday Iran W us up at a nine point seven news jazz NPR your NPR station and\nTonight on all my jazz well we'll have our new jazz release round up we've had a ton of new recordings to share with you tonight\nIncluding something their futures trucker Terrell Stafford who's coming to town in November we've also got something brand new from Tony Bennett with Diana crawl here that in our opening said well let's get things started with a little big band music tonight I bought that we'll start with Gerald Wilson from the complete Pacific jazz and be the Toronto on all my jobs [noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\nNa\nAnd then just prior to that we're listening to music from Tony Bennett and Diana crawl brand new release called love is here to stay or new jazz released rounded up for a Saturday evening and there are featured there with the bill Charlotte trio bill I'm General Peter Washington on base Kenny Washington on drums\nGeorge Gershwin ... wonderful from love is here to stay Tony Bennett and Diana crawl him off and this one throughout the evening here on all night jazz\nAnd we'll put things up with Gerald Wilson from complete Pacific jazz\nAnd a tribute ... Murata the name of the June Carmel Jones Horace Silver fame and they're on trumpet heady Edwards on tenor Joe Pass on guitar these uh Toronto from Gerald Wilson\nRight here on all night chance for Saturday evening Wu as a baby nine point seven I might corner at an all night jazz and W. U. S. F. is sponsored by Tyrone square miles to thirty three hundred Tyrone boulevard in St Pete they offer a wide selection of new and certified ... miles does with a commitment to a customer service\nSeventy seven three four four three three four four\nFriends of strays and no kill nonprofit animal shelter in St Pete\nIs celebrating their fortieth anniversary at their labs and whiskers gala coming up on October twenty is that the Duncan McClellan gallery and the theme that seemed to this is disco fever and details are friends of strays dot O. R. G.\nIt's all night jazz or a WD us after eighty nine point seven I might corn that we're gonna continue now with music from eddy Harris and the shadow of your smile\n... [noise]\nOkay [noise]\nOkay [noise]\nAnd [noise]\n[noise]\n\n\nMhm\n\n[noise]\n...\n\nMan [noise]\n\n\nMm\nPay\n\n[noise]\n[noise]\n\n\n[noise]\nMm\n[noise]\n\n\n[noise]\n\nNine two one five for one zero\nPitches Ira Plato host of science friday and thanks to Elizabeth more and W. us chaff science friday is coming to Tampa I November Seventeen\nShe'll get your tickets now to join us for a great night of science in conversation at the historic Tampa theater called the box office at eight one three to seven for eight to eight chicks or better yet get your tickets right now on line at W. USGF dot org slash die fry\nAn additional sponsorship comes from the age see I grew up with some new music for you here on a Saturday from our new jazz release round up this one at an all star cast your called family feeling terrible staffer Dick oats Bruce birth Tim ... David long environment lend them years mode for trained on all night chance [noise]\n\n\n\n\n\n\n[noise]\n\nDa\n\nNa\nNa na na na na na na ...\n\n\n[noise] learn\nAnatomy\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\nManage\nIs\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n", "show_name": "Piano Jazz", "year": "2018", "city": "Tampa", "day": "07"}