{"month": "10", "state": "CO", "station": "KRCC", "content": "Boehner with the bone a certified craftsmen program a network of hardwood flooring contractor is committed to expertise in customer service contractor locate her and more information at bona dot com\nOne minute in 'til six o'clock that evening Microsoft thanks for tuning in for all things considered Iran\nK. R. C. C. K. R. C. C. H. D. Colorado Springs ... hunter KCBS struck Phil and K W CCF them\nWoodland park also streaming at ... dot O. R. G.\n\nSixty four degrees or current temperature here in the downtown area\nThe six o'clock hour one year ago a gunman opened fire on a music\nFestival in Las Vegas killing dozens and traumatizing countless others\nI knew that you have to talk about it you have to think about it you have to face it you have to feel your feelings about it\nComing up in about twenty minutes we'll hear from a woman who survived who's trying to help others heal that story coming up at six twenty here on Ninety One point five K. R. C. C.\n\nNinety One point five care cc is on Facebook and Twitter you'll find news headlines local story days in advance canned announcement sinus and follow us on Facebook and Twitter carry the the\nThis is the case for the Laurie Cohen charitable trust\nMy good friend Dr lord Cohen asked me to help finish some task for her lawyers gift to the care cc legacy fund helps perpetuate knowledge and understanding of the world she so cherished she would encourage others to join her in this effort to help make the community she loved and lived in a better place\nInformation on the ... the legacy fund can be found at our website ... seat died or G. about a twenty percent chance for showers\nThe rest of this evening and you can probably double that for tomorrow forty percent probability showers tomorrow bit warmer though for Tuesday\nAnd Wednesday and then cooling back down for the end of the week\nLive from NPR News in Washington I'm jak sphere President Trump says the FBI should do a comprehensive investigation into the allegations surrounding Supreme Court nominee Brett Kavanaugh but as NPR's Mara Liasson reports he also says Senate Republicans should determine the scope of it\nGee about a twenty percent chance for showers the rest of this evening and you can probably double that for tomorrow forty percent probability of showers tomorrow warmer though for Tuesday and Wednesday and then coming back down for the end of the week\nLive from NPR News in Washington I'm jak sphere President Trump says the FBI should do a comprehensive investigation into the allegations surrounding Supreme Court nominee Brett Kavanaugh but as NPR's Mara Liasson reports the also says Senate Republicans should determine the scope of that investigation\nPresident Trump said he wants the investigation to end quickly and that the FBI should look into whatever the Republican Senate wants it to he said he believes Kavanaugh was truthful in his testimony and that his family has been treated horribly but he also said he has no backup plan if Kavanaugh should withdraw or be rejected by the Senate\nI Hope that he gets approved I Hope that the report comes out\nLike a ... like I really think it should I think it will I Hope\nI Hope but look I'm waiting just like you the president said he was surprised how vocal Kavanaugh was about his drinking problems in high school President Trump doesn't drink which she joke today was one of his only good traits Mara Liasson NPR News Washington\nAs the death toll continues to rise from last friday's massive earthquake and tsunami in Indonesia President Trump is sending condolences to that country and its president\nAnd the rose garden press conference today the president says he is dispatch first responders including the military and others to help in the aftermath of the disaster visuals are say the earthquake and tsunami waves struck shortly after have claimed the lives of the least a hundred and forty people and destroyed thousands of homes triggering immediate humanitarian crisis or the city of Paolo\nAmerican dairy farmers say they are please a new trade deal that some so more milk and cheese to Canada but as NPR's Dan Charles reports that changes not expected to make a big difference Canada has strict limits on imports of dairy products and President Trump has attacked those limits repeatedly\nThe new trade deal would allow American dairy farmers to claim a few percent of the Canadian milk and cheese market Canada also will stop under cutting the U. S. price on products like skim milk powder and milk protein\nBut it still can limit dairy imports as well as the amount of milk its own farmers can produce and independent economists say the new deal probably will not bring big changes the farmers on either side of the border the existing NAFTA trade deals been good for American dairy farmers they ship more than a billion dollars\nDairy products and President Trump has attacked those limits repeatedly the new trade deal would allow American dairy farmers to claim a few percent of the Canadian milk and cheese market Canada also will stop under cutting the U. S. price on products like skim milk powder and milk protein\nBut it's still can limit dairy imports as well as the amount of milk its own farmers can produce\nAnd independent economists say the new deal probably will not bring big changes the farmers on either side of the border the existing NAFTA trade deals been good for American dairy farmers they shipped more than a billion dollars worth of their products to Mexico each year Dan Charles NPR News\nThe venture capitalists as reported to be on the verge of acquiring one of the nation's largest for profit colleges the deal wants complete could put a holding company run by Bradley Palmer in charge of the for profit divide chain which is roughly forty six thousand students\nCritics have said the deal raises some red flags though including whether Palmer ones that tiny California college has the experience to run a big online educational institution like the rye which also faces thousands of student complains\nRelatively strong start to the fourth quarter the Dow is up a hundred and Ninety two points today the NASDAQ closed down nine points you're listening to NPR\nAnd his study shows older women may benefit from bones drugs given by ivy every Eighteen months\nEvaluated immigrated to the rugs and their ability to reduce the risk of fracture suggesting that medicines could be a benefit to more people than currently are receiving them broken bones or a major problem as people age especially women hip fractures for example can lead to a nursing home care the risk is more common in post menopausal women [noise]\nAttacks us scientists has been awarded the Nobel Prize in physiology or medicine he shares the prize with a scientist from Japan and Houston Public media's Davis land tells us the winters are being recognized for advances in cancer treatments\nThe Nobel Committee says James P Allison in ... both discovered ways to use the body's immune system to fight off cancer Alison spoke at a press conference this morning he thinks patients in clinical trials instead of receptor called C. T. L. A. for was key in his discovery\nOr figured out to sea toy for was the breaks in recess or several is just disabled or breaks for several other mere systems or to attack cancer and\nAllison says it's the first Nobel given to a cancer therapy drugs developed from the method treat melanoma and other cancers for NPR News I'm Davis land in Houston\nFormer Alaska Governor Sarah Palin's oldest son is in trouble\nCancer Alison spoke at a press conference this morning he thanked patients in clinical trials and set a receptor called C. T. L. A. for was key in his discovery\nOr figure out to sea toy for was the breaks open range just sort of role as just disabled or breaks spheres as rollout immune system to attack cancer and it did\nAllison says it's the first Nobel given to a cancer therapy drugs developed from the method treat melanoma and other cancers for NPR News I'm Davis land in Houston\nFormer Alaska Governor Sarah Palin's oldest son is in trouble again less than a year after being accused of attacking his father's the family's home last ... state troopers taking twenty nine year old track payload into custody in connection with alleged assault ... say Palin resisted arrest after being taken into custody this home on allegations he assaulted female acquaintance there late\nFriday I'm jak sphere NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the University of Florida we're solving for next is power to buy it landed grants heritage from renewable energy to global health us students and researchers are working to solve challenges at next dot U. F. L. dot edu\nIf you're in your area or just a little forgetful and he'd like to know when you have a program here in Ninety One point I Can't see the visit our website you'll find daily and we have got to learn\nProgramming on Ninety One point five K. or cc is supported by opinion real estate group insulator helping visitors fulfilled dreams of mountain living in ... county and the surrounding region from land and ranchers do vacation homes and long term rentals\nInformation and more at putting in real estate dot com considered ... Chang and I'm Ari Shapiro\nMajority leader Mitch McConnell promises that the Senate will vote this week on Brett Kavanaugh's confirmation to the Supreme Court\nIt's not clear which day that depends on when the FBI concludes its investigation into claims that Kavanaugh sexually assaulted Christine Blasey Ford decades ago when they were both teenagers Kavanaugh slightly denies the claims\nThe scope of the investigation is unclear and has been the subject of political haggling ever since the inquiry was announced on friday\nNPR congressional correspondent Scott Detrow is here in the studio to walk us through the latest I've got a good afternoon let's start at the White House President Trump held another one of those extended unfiltered press conferences today what did he say about cabin on where this investigation stance he said a lot about cabinet but let's just focus for this moment on ...\nThe FBI concludes its investigation into claims that Kavanaugh sexually assaulted Christine Blasey Ford decades ago when they were both teenagers Kavanaugh ... denies the claims\nThe scope of the investigation is unclear and has been the subject of political haggling ever since the inquiry was announced on friday NPR congressional correspondent Scott Detrow is here in the studio to walk us through the latest I've got a good afternoon let's start at the White House President Trump held another one of those extended unfiltered press conferences today what did he say about cabin on where this investigation stance\nHe said a lot about cabinet but let's just focus for this moment on what he said about the investigation and cabinet ... we've been hearing a lot of reports that the White House had been ordering the FBI to keep the focus very narrow President Trump today insisted that is not the case\nI Want them to do a very comprehensive\nInvestigation whatever\nThat means according to\nThe senators and the Republicans and the Republican majority I Want them to do that\nAnd we do know there's been a lot of conversation between the White House and Senate Republicans about this Jeff Flake is the Arizona senator who forced this week long investigation on friday he said today he has been having a lot of talks with the White House app had the other key Republican holdouts here\nThe Judiciary Committee asked the White House to have the FBI investigate current and credible allegations President Trump seems to be referring to send a Republicans on this so what's our best understanding of how the Senate Republicans define current incredible\nLindsey Graham gave a definition of this over the weekend to ABC News he said that would involve all of the witnesses that Christine Blasey Ford said we're at the party\nAnd it also includes Deborah Ramirez who made that second claim that Kavanaugh exposed himself to her at a college party\nHere's the thing that's unclear is whether the FBI could or would broaden and talk to college classmates who have come forward saying that cabinet wasn't telling the truth when he testified about his drinking habits and other things like that a flake was in Boston today here's what he said about what he wants the scope to be\nDime Abigail vaccine joined me and my co host weekday mornings for news and cultural coverage on Ninety One point five K. R. C. the\nHi this is David Greene while most of you are still sleeping I'm spending my overnight right here at NPR getting ready to MORNING EDITION usually\nOn touch base with reporters and editors around the world writing scripts or begging for more coffee what make all of that possible it could be your car is right in the car you're driving help pay for the next great story you here on MORNING edition turn your car into the programs you up\nAnd he joined me and my co host weekday morning for news and cultural coverage on Ninety One point five K. R. C. C.\nHi this is David Greene while most of you are still sleeping I'm spending my overnight right here at NPR getting ready to MORNING EDITION usually\nOn touch base with reporters and editors around the world writing scripts or begging for more coffee what makes all of that possible will it could be your car that's right the car you're driving but help pay for the next great stories here on MORNING edition turn your car into the programs you love [noise]\nVisit Kay or C. C. dot orgy for details\nNPR on Ninety One point five kill your cc is supported locally\nBy Jackson Greek senior living monument offering independent living assisted living in memory care residents was designed for many lifestyle choices wellness programs tailored activities and more now scheduling tours more at Jackson Greek senior living dot com [noise] coming up on six\nTwenty sixty three degrees here in the downtown springs area about a twenty percent chance of showers yet for this afternoon and evening and you can make that a about a forty percent probability for tomorrow [noise]\n\nSupport for NPR comes from the station and from the alliance for a lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for lifetime income dot org\nAnd from Trader Joe's offering new products in every store and new episodes of the original pod cast series inside Trader Joe's at apple pod cast or where pod cast are available more at Trader Joe's dot com\nThis is all things considered from NPR News I'm Ari Shapiro and I now said Chang one year ago today and reclusive high stakes gambler open fire on thousands of people at an outdoor music festival in Las Vegas\nPolice say they still don't know why she did it it was the deadliest mass shooting in modern us history fifty eight people were killed plus the gunman hundreds more and more wounded NPR's Eric Westervelt has this story about one of the survivor's a woman who's trying to help others heal\nThat first warning you will hear the sound of gunfire in this report\nPsychologist Dr ... guide from San Diego was near the front of the stage of the route Ninety One country music festival for star gene\nBeen fire on thousands of people at an outdoor music festival in Las Vegas\nPolice say they still don't know why she did it it was the deadliest mass shooting in modern us history fifty eight people were killed plus the gunman hundreds more were wounded\nNPR's Eric Westervelt has this story about one of the survivor's a woman who's trying to help others heal that first warning you will hear the sound of gunfire in this report\nPsychologist Dr ... guide from San Diego was near the front of the stage of the route Ninety One country music festival for star Jason al being he was early into his show and that jarring rapid fire popping sound began\nAt first guiding her friends were in town for a great weekend didn't think much of it someone nearby been shooting off confetti Poppers plus all the music lights\nI mean it's fake is right so I mean we didn't know maybe the the show had fireworks or maybe there were fireworks nearby\nBut when the stage lights went out flood lights came on and the quick fires semi automatic rifle\nCrackle continued guides confusion quickly turn to terror this has gone far south as captured on the witnesses cell phone videos [noise]\nSo many people's screamed and yelled guide says others seemed oddly nonchalant sounds seem to echo\nEverywhere the gunshots sounds kept changing and in different directions and some sounded very far away some sounded like they were coming over the fence\nShe first huddled under a plastic table then in between two recycling pans more gunfire and fear [noise]\nShe'd been made a dash just a motorized scooters park near the stage and literally sat there\nCrouched behind the wheel chair scooter thinking over and over again please please don't hit me please please just don't have anything vital had anything vital don't hit anything vital just over and over again\nFor people near guide were killed the group's use with finally made a run for it stepping over pools of blood and carnage the shooting started just after ten pm it took several hours of panic and fleeing before guide finally felt safe and a nearby hotel secure conference room she remembers looking down at her fitbit\nIt was twelve thirty so two and a half hours of running in hiding and running in hiding and as I sat in that room I realized that I had a decision to make and it was a really important decision I could try to heal and in private\nThe group she was with finally made a run for it stepping over pools of blood and carnage the shooting started just after ten pm it took several hours of panic and fleeing before guide finally felt safe and a nearby hotel secure conference room she remembers looking down at her fitbit\nAnd it was tough thirty two and a half hours it's running in hiding in running in hiding and as I said in that room I realized that I had a decision and make and it was really important to fish and I could kind of healing in private or I could just lead by example\nShe chose the latter the licensed clinical psychologist has worked extensively with combat veterans and military personnel some with Pete TST in the San Diego area back home a few days later guide realize there just wasn't much out there to help people process that night's whores and nothing that seemed easily accessible\nYou know had a couple of sleepless nights and probably not unlike anybody else\nAnd I I just I ... in a panic thinking about how many people would invisible one\nDoctor guy didn't realize yet how deep her own invisible wounds ran\nShe called up the manager of a local country music bar and dance hall where she was a regular she knew it was closed on Mondays could you offer free counseling they're the owner said yes she put out the word through local TV and social media and just seven days after the shooting she held her first support group [noise]\nMore than forty Las Vegas shooting survivors showed up\nI knew that you have to talk about it you have to think about it you have to face it you have to feel your feelings about it\nJust about every Monday since the shooting between forty and sixty survivors come to the dance all to talk\nThe groups just for them not the general public not the media they meet together before splitting up into small groups of five or six guy drops in on discussions the small groups or where she says people really open up trouble sleeping anxiety stress shaken by loud noises\nIn between giving lessons with titles such as why avoidance makes it worse than tips on managing nightmares\nGuide realized she had lots of blind spots in her memory things she blocked out the healer now needed her own healing the P. T. S. D. councilor now new personally more of what the servicemen and women she treated had gone through\nA year later she realizes she needed the group as much as they needed her the first few months\nThe small groups or where she says people really open up trouble sleeping anxiety stress shaken by loud noises in between giving lessons with titles such as why avoidance makes it worse in tips on managing nightmares\nGuide realized she had lots of blind spots in her memory things she blocked out the ... now needed her own healing the pie TST councilor now new personally more of what the servicemen and women she treated had gone through\nA year later she realizes she needed the group as much as they needed her\nThe first few months were really rough for me and I kind of line\nI guess I thought that my expertise and experience in treating trauma for all of these ears would somehow protect me or Amy nice me from the effects of living through a near death experience and in fact it didn't [laughter] you know\nThe healing won't end for guide on this anniversary but the weekly survivor meetings at the dance bar will there'll be a final gathering a potluck dinner and remembrance tonight one year to the day since the shooting it won't be a celebration or a memorial\nBut something in between Westervelt NPR News\n[noise]\nSinger songwriter an actor Charles as no war has died at the age of Ninety four he'd often been called the French Frank Sinatra as Navarro was an international star who performed around the world NPR's Eleanor Beardsley reports he was especially people love it in his native France where tributes are pouring in\nShower avenue or songs are playing nonstop on French radio shovel the\n\nCountry's president Emmanuel Macron tweeted that I've never had a\nCompany that joy than paying three generations and that is voice and unique brilliant will shine on throughout a Seventy year career I never sold more than a hundred million records in eighty countries John ... had a programming at melody TV said I've never had a\nHe was the first scene there in the sixties who was essential ... all the details hadn't brushes when they're going to show that that will\nOh\n\nAnd we'll shine on throughout a Seventy year career as never wore sold more than a hundred million records and eighty countries jumpy I'll pass cleanliness had of programming at melody TV that I've never broken taboos\nAnd he was the first scene during the sixties was essential ... he's all the details of Russia's when really Drew Sharp ...\nYeah oh\nSaw\nThat I'm\nOlder gentleman who you know ...\n... ... the singer composer some fourteen hundred songs many about important scenes\nHe wrote about homosexuality in seven to two it was very oh the yeah the last\n... was born in France in Nineteen twenty four his relatives fled the Armenian Genocide in Turkey as another war was discovered by Edith piaf and wrote songs for her and toured with her after the war\nHe had his biggest hit an English in Nineteen Seventy four with\nMm I'd\nNever were also acted in more than sixty films including ... shoot the piano player as never told NPR two years ago when he was on tour in the U. S.\nAnd he couldn't hear well and how to use a teleprompter to remember the words with songs but he said his audience didn't mind\n... the more and more real close to me because my comes through the public is my first love\nCharlotte's not more composed and performed until the very end it was set to go on tour later this month Eleanor Beardsley NPR News Paris\nWell there's a lot of anger about that don't want is so huge and the preparation for this is simply nowhere near what needs to happen here\nThat's NPR's Julie McCarthy she's traveling in Indonesia central ... province thank you very much Julie thank you\nKnow to the Supreme Court where today the justice has grappled with a difficult death penalty question does it violates the Constitution's ban on cruel and unusual punishment to execute a convicted murderer who has such severe dementia that he doesn't remember the crime he committed NPR legal affairs correspondent Nina Totenberg reports\nVernon Madison committed a terrible crime in Nineteen eighty five after leaving his girlfriend's house he returned and shot and killed a police officer who had remained outside in his car to provide protection twice Madison was sentenced to death but the convictions were overturned because a prosecutorial misconduct\nThe third time he was convicted the jury recommended life in prison but Alabama has a unique law that allows a trial judge to override a jury's recommendation and the judge did just that\nMadison has been on death row in solitary confinement in Alabama now for more than Thirty years in that time he suffered multiple severe strokes an MRI shows part of his brain is dead and there is no dispute that he suffered from severe vascular dimension\nHis lawyer Bryan Stevenson says that Madison is so disoriented that he doesn't know what day a month or a year it is he's legally blind has difficulty walking and slurs his speech\nMost critically has no memory of the circumstances of this crime or things of at the same things to execute him for inside\nTo speech but most critically has no memory of the circumstances of this prime things about the state six to execute him for\nInside the Supreme Court today lawyer Stevenson told the justices that executing man so incompetent would be unconstitutionally cruel and unusual punishment\nIn the past two decades in cases like this barring the death penalty for juveniles and the mentally challenged the justice who provided the fifth and deciding vote was Anthony Kennedy and he has just retired\nInside the courtroom today the justices appeared closely divided chief justice John Roberts asked whether for the purposes of the death penalty dementia is the same as someone who becomes psychotic while in prison\nLawyer Stevenson there would have to be a memory loss plus something else Justice Ginsburg what would the plus B answer brain damage that is the results of an injury so that the brain is incapable of producing memories are creating the kind of rational understanding that this court has required in the past just to sort of my or\nSo you're not talking about just amnesia answer no Mr Madison's dementia is so comprehensive that he can explain to you that he has a toilet in itself or his use\nBut he can't hold that memory and he routinely urine aids on himself and asked the guards to take him to the toilet\nThe problem in this case Stephenson said is that the lower courts have said that since Madison is not delusional or psychotic it's All right to execute him\nThe eighth amendment he said is not like the constitutions other amendment it's a mirror of our norms and our values and what we have argued in this case is that Mr Madison's dementia renders him so frail but we'll dirt and vulnerable that executing him cannot be reconciled with the Constitution's ban on cruel and unusual punishment\nArguing for executing Madison was Alabama deputy attorney general Thomas ... junior justice prior a frequent critic of the death penalty asked this question I\nThink if a person in the advanced stages of Alzheimer's what's the purpose of executing that person if you wouldn't executed person who's schizophrenia or delusional lawyer Govan replied that the state in this case still has an interest in seeking retribution for a horrible\nCrime and he said that Madison does understand that he's in prison because of a murdered after the argument Alabama State attorney general Steve Marshall had this to say\nThis involved the little execution of a police officer with this murder and at some point in time to say look forward to being able to obtain the punishment with the trial judge believe was appropriate\nLittle execution of a police officer with this murder and at some point in time to state looks forward to being able to obtain the punishment that the trial judge believe was appropriate in this case\nA decision in the case is expected later in the term Nina Totenberg NPR News Washington\nYou're listening to all things considered from NPR News\nThe Nobel Prize in physics was awarded today to three researchers including Donna Strickland strictly is the first woman to share that they've ... physics prize in fifty five years NPR's Geoff Brumfiel reports on what took so long\nEven Donna Strickland herself seems surprised at how few women have won the Nobel in physics she was asked about it at a press conference earlier today you are that\nThe woman ever getting that Nobel Prize in physics\n[noise] what's your comment on that okay I can [laughter]\nIt's true there was Marie Curie in Nineteen oh three a nuclear physicist named Maria ... mayor in Nineteen sixty three and now Strickland a researcher at the University of Waterloo in Canada who won for her work on an ultra fast alter bright laser pulses\nJoke coal a particle physicist at Bruno University of London in the u._k. says the gender imbalance in physics exists well beyond the Nobel Prize\nI think the ... one of the subjects that he's viewed as being dominated by white middle cough miles\nShe says the problem starts his earliest elementary school and it runs all the way through grad school\nWe've tried really hard to try and encourage more women in to visit but it's but it just doesn't seem to be happening\nHere in the U.S just twenty percent of advanced physics degree is go to women that number hasn't changed in a decade the fuel suffers from more explicit sex with them as well just last week a male says assisted a European lab gave a presentation claiming that men were better than women\nSuffers from more explicit sex with them as well just last week a male says assisted a European lab gave a presentation claiming that men were better than women do physics he was suspended\nOther researchers in recent years have lost their jobs over sexual harassment that's progress says Jean Lou an astronomer at MIT Lincoln Laboratory\nI think that the right direction but it's different from being respected for a one expertise\nLoose says she's experienced all kinds of sexism for example whenever she went to visit the telescope\nI wouldn't have a ... and they will mail because I didn't have any a female student and I would always assumed to be the student and I got my student was always assumed to be the person in charge of me\nMoose says she thinks that kind of biased contributes to why they're so few Nobel Prize is awarded to women in physics to get the prize you have to be nominated by another physicist or astronomer most of whom are men\nI don't know what action there'll be thousands of nominations for men and maybe you know like five nomination for women I don't know something like that\nIt's a small percentage that's for sure that's ... ... and the secretary general of the royal Swedish Academy of Sciences during today's press conference he says the academy which runs the Nobel is trying to fix the problem\nWhere are you taking measures to encourage more nominations because we don't want to miss\nAnyone Lew says the Nobel need to catch up with the times Silicon Valley billionaires have begun financing a bunch of new prices for physicists to wind blew herself on one of the prices the Catholic prize and twenty twelve and she was in good company\nThat yeah I Won they will for women that was pretty cool\nIf the Nobel us want to stay cool Lew says they need to make sure they're not overlooking good candidates who just happened to be women Geoff Brumfiel NPR News [noise]\nListening to all things considered from NPR News just getting started with today's edition of all things considered here on Ninety One point five care see see Republicans\nJust getting started with today's edition of all things considered here on Ninety One point five K. R. C. C. Republican Senator Lindsey Graham is lashing out at Democrats over Supreme Court nominee Brett Kavanaugh\nIf you really wanted to know the truth you sure as hell wouldn't have done what you've done to this guy\nThe Kavanaugh hearings highlight grams transformation from anti Trump conservative fears Trump supporter that story coming up at four ten as we continue with all things considered Iran southern Colorado's NPR station\nWhat better way than to start your day off well informed and in touch with your community Hi I'm ... back in your local hoping for southern Colorado It's MORNING edition and I hope you'll join the weekday morning from six to nine AM on Ninety One point five K. R. C. C.\nSupport for Ninety One point five K. R. C. C. comes from local organizations who want to reach a well connected audience than discerning about news culture\nAnd how they spend their money becoming a corporate sponsor of Ninety One point five care the means your brand was stand out from the ground for more information about underwriting called Jeanette seven one nine four seven three for ...\nK W cc FM woodland park and streaming a gamer C. C. dot ORG on my cell it's eighty three degrees right now in the downtown springs area about a thirty percent chance of some late day showers for our listening area\nAnd then mostly forties and fifties expected overnight\nNPR on Ninety One point five to your cc is supported locally by the Colorado Springs law firm of ... heard him cry for forty five years helping families with wrongful death claims from accidents car crashes malpractice and dangerous products got us can hurt dot com\nBust Ninety One point five K. or cc members throughout our listening area thank you for your supportive southern Colorado's NPR station Ninety One point five years cc online at ... dot ORG\nKevin has done great damage to the credibility of the Supreme Court will always be the justice should behave the way he did quite says about ... ...\nI was doing great damage to the credibility of the Supreme Court people will always be the trust issue behave the way he\nDid questions about Brett Kavanaugh's impartiality come up after he criticized Democrats and the political left for Tuesday October second it's all things considered from NPR News\nI'm ... and I'm Ari Shapiro this hour we kick off our series on China's global influenced by looking at China's reach into Australia by influencing universities by sponsoring think tanks\nCyber intrusion operations I used to doing it later we travel back in Nineteen sixty eight in Mexico city when the government gunned down hundreds of student protesters how much democratic change has there been since that brutal repression\nInstitutions\nHave landed in unity and we talked to the first woman to win the Nobel Prize in physics in fifty five years first of the news\nLive from NPR News in Washington I'm ... President Trump holds a campaign rally in Mississippi tonight his second political event and as many days NPR's Scott Horsley reports Trump says he's seeing strong support among fellow Republicans for Supreme Court nominee Brett Kavanaugh\nTrump says Kevin O's nomination has become a rallying cry for the GOP and expressed confidence that closely to by the Senate will confirm his nominee by the end of this week\nKevin has strongly denied allegations that he sexually assaulted women decades ago Trump says he's not concerned by stories of Kevin O's drinking during that period even though the president himself does not drink\nI remember my college days everybody was thinking it was like normal I was abnormal it was totally normal everybody was drinking\nTrump defended Kevin O's performance during a congressional hearing which some critics have called overly partisan by the president caution lying to Congress would not be acceptable Scott Horsley NPR News the White House secretary\nOf state Mike Pompeo is heading back to North Korea this weekend to try and push ahead talks on denuclearization NPR's Michele Kelemen reports he'll also visit Japan South Korea and China\nThis would be his fourth trip to North Korea in less than a year and State Department spokesperson Heather Nauert says he hopes to meet the north Korean leader Kim Jong un who has exchange letters with President Trump\nI haven't been privy to all the letters and communications are that have gone back and forth but obviously these conversations are going in the right direction and we feel confident enough to hop on a plane or to had there to continue the conversation\nNow where it says the U.S one\nThese conversations are going in the right direction and we feel confident enough to hop on a plane or to had there to continue the conversation\nNow where it says the U.S wants to other countries to maintain sanctions and pressure on North Korea in the meantime though China and Russia are calling for an easing of sanctions do support diplomacy Michele ... NPR News the state department\nTime is running out for authorities to find any more survivors from the massive earthquake in resolving she nominee wave that struck Indonesia five days ago the official death toll from the earthquake that struck the western part of the country friday now tops twelve hundred and is still climbing compared to the McCarthy made her way to a devastated area with an army eight and security convoy\nWe aren't there is a high wind that hook the cold as we move north\nTo follow the roads are in decent condition it started to rain which sort of added to the misery here there's not a lot of traffic coming out um what you would have expected because a lot of people are trying to leave however there is no gasoline\nTo do that and so people really there's a sense of feeling ...\nNPR's Julie McCarthy online retail giant Amazon is taking a major step today now asking will raise the minimum wage for all us workers to Fifteen dollars an hour starting next month company says that move could ultimately benefit more than three hundred and fifty thousand workers\nAnd mix clothes on Wall street today the Dallas up a hundred and twenty two points the NASDAQ fell thirty seven points this is NPR\nFirst lady Maloney a Trump is in Africa the first lady today meeting over tea with or guardian counterpart after arriving in the west African nation\nSpoke to and from Mrs Trump says the two first ladies exchange gifts this was her first visit to Africa a five day tour with plants Thompson Balawi Kenya and Egypt earlier today she visited a baby clinic and gone as part of her campaign for child welfare\nAnd there were now says by the American Cancer Society is finding many teams are not up to date on H. B. B. vaccine NPR's Allison Aubrey reports the vaccination could prevent several types of cancers\nFourteen million pre teens will need to be vaccinated to reach the target of an eighty percent vaccination right by twenty twenty six the new analysis find a disproportionate percentage of teen boys and the families have private insurance\nHave not gotten the vaccine vaccination rate is higher among medicate insurance teens the others point to initiatives such as a federally funded vaccines for children program that provides free vaccines for low income children the human papillomavirus\nTwo initiatives such as a federally funded vaccines for children program that provides free vaccines for low income children\nThe human papillomavirus causes about thirty thousand cancers a year the majority can be prevented through vaccination the author say one barrier to vaccination is a lack of awareness of the vaccines benefits Allison Aubrey NPR News\nWhen your mobile device goes off with an emergency alert tomorrow it around to Eighteen pm eastern time don't say we didn't give you a heads up that's because the federal emergency management agency says it intends to conduct the first nationwide test for wireless phone emergency alert potentially reaching upwards of two hundred and twenty five million mobile devices across the\nUs I'm jak sphere NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the John B and Catherine the MacArthur Foundation supporting creative people an effective institutions committed to building a more adjusted burden and peaceful world more information is Mac founded dot org and the ... foundation\nNinety One point five K. R. C. C. is dedicated to covering southern Colorado and the Rocky Mountain west your membership directly funds are journalism thanks for supporting Ninety One point five K. R. C. C.\nProgramming on Ninety One point five K. R. C. C. is supported by fountain valley schools celebrating the new Julie and Spencer pen rose athletic center opening soon featuring a forty foot\nTall climbing wall was being days October eighth registration an F. B. S. dot edu\nThis is all things considered from NPR News I'm Ari Shapiro and I'd also Chang when Brett Kavanaugh sat down before the Senate Judiciary committee to respond to charges that he had sexually assaulted Christine Blasey Ford this is some of what he had to say\nThis whole week effort has been a calculated and orchestrated political fueled with a parent pent up anger about President Trump and the two thousand sixteen election\nRevenge on behalf of the Clintons and millions of dollars and money from outside left wing opposition groups\nSo what could the consequences of statements like this speech for judge Kavanaugh whether or not he's confirmed to the Supreme Court to answer that question we're joined by Stephen dealers he's a law professor at New York university and he specializes in ethics welcome thank you\nSo I Want to get a sense from U. of how rare it is to hear a Supreme Court\nAnd he specializes in ethics welcome thank you\nSo I don't want to get a sense from U. of how rare it is to hear a Supreme Court nominee talk the way Kevin I did in that moment I mean have you ever heard such partisan language like that during a confirmation hearing\nNo I haven't and not even during the confirmation of Clarence Thomas it was nothing like that\n[noise] so let's say Kavanaugh is confirmed to the Supreme Court do you think that he can be seen as an impartial arbiter in cases with political undertones\nIt depends upon who's doing the fear I think the losers will not see his decision as impartial\nHe is now branded as favoring variety over the left so in political cases so left will expect to lose an do attribute that laws not to a disinterested treatment of the law but to a political agenda\nI mean there's this ideal that a lot of people have about the Supreme Court that these justices that this court is above politics or should be above politics but let me ask you how far removed is that ideal from reality\n[noise] very far removed first of all the justice has been appointed by president of a particular party who\nIf he's doing his homework will be sure to appoint a justice who will likely you agree with the political position of that party so while we have decisions that use the language of the law\nWe know that the court's decisions the justices decisions are influenced by their political regions\nSo I guess what I'm really asking is how productive is having a conversation about impartiality when impartiality is a bit of a fantasy\nTake away comes to us tomorrow morning eleven AM right after one a\nHero Ninety One point five ... C. programming on Ninety One point five kill your cc is supported by ... by believing that technology is not about the computer as much as it's about the person using it to Cisco Systems network security consulting an office\nIs not about the computer as much as it's about the person using it Cisco Systems network security consulting and office scooter races since two thousand and one never guide dot com\nNinety minutes after four o'clock eighty four degrees here in the downtown area for a minute lows tonight ranging from the mid forties and those higher elevations to lower sixties cross lower Arkansas River valley mid fifties here in the springs and then a bit of a range for tomorrow's highs\nAre right around Seventy in the high country to Ninety in the hunt area\nSupport for NPR comes from this station and from transfer a wise a service that helps people send money internationally three million people and businesses use transfer a wise to send or receive and convert currencies and more than Seventy countries\nMore a transfer a wise dot com or from Iraq\nAnd from constant contact with hundreds of customize a bill email template for small businesses to reach customers where\nThey are every day there inbox learn more had constant contact dot com\nFrom NPR News this is all things considered ... Chang and I'm Ari Shapiro as China's economy grows so does it influence over the rest of the world and that has some countries feeling uneasy\nThis summer Australia's parliament passed a foreign interference law because of China's meddling in its political system and next door New Zealand there's been a scandal involving a Chinese born member of parliament suspected of spying for Beijing and the first of our series on China's growing global influence NPR's Rob Schmitz reports from down under\nThe late summer and camera Australia's landlocked capital city national Caroline bell tower strikes noon as Charles stirred university professor Clive Hamilton points out other landmarks\nJust through the trays on the outside like massive glass concrete monolith ...\nLives he points out easier Australia's intelligence agency then there's the federal police building and they're in the middle his word China built its embassy\nThey pick the spot and I had a lot of cloud and that mattered a vice compound there so you know they kind of get what they want around here\nThat is the topic of Hamilton's new book silent invasion China's influence in Australia when Hamilton first tried to release the cars publisher wrote to him that it wouldn't print it because it feared legal action from what it called Beijing's agents of influence\nI was very shocked to feel betrayed the episode vindicated the central thesis of his\nAll action from what it called Beijing's agents of influence I was very shocked to feel betrayed the episode vindicated the central thesis of his book that hit a little too close to home\nIt's a massive red flag under the strategy can picture lights on this question in other words no books seriously critical of the Chinese Communist party will be published in stride I mean this is essentially means we've sacrificed how democratic freedoms\nAt the cost of a booming economy Chinese demand is field a mining boom creating jobs pushing up wages\nIn Chinese investment in real estate has made rising home values but many wonder if the price is too high another publisher eventually released Hamilton's book but he says the whole episode has reminded him of how deeply China's Communist party has infiltrated Australian society\nFrom attacking I have a Chinese associations\nAssociation says Hamilton devoted to students and scholars in Chinese language churches\nBuying political influence promoting paging oil a papal into elected political positions\nHamilton's research counts more than forty current and former Australian politicians who he says are often unwittingly doing the bidding of China's Communist party\nBy influencing universities by sponsoring think tanks cyber intrusion operations I you know what I miss that doing it\nBut Australia is beginning to fight back\nForeign powers of making unprecedented and increasingly sophisticated attempts to influence the political process\nLast December prime minister Malcolm Turnbull announced a massive overhaul and Australia's espionage laws after senator accepted illegal donations from a Chinese businessmen with close ties to China's Communist party\nThat will protect and strengthen our democracy and I will ensure\nThat Streisand's make decisions based on the wishes of a stride and it's\nThe new law will require any one in Australia working on behalf of a foreign power to declare that connection to the government but Rory mad cap head of the national security college an Australian National University says these connections can be tough to gauge among Chinese citizens who come from a country where all parts of society are integrated with the party's objectives\nChinese citizens Ohio loyalty to the coffee than to the site itself so we really what we're dealing with here is the largest sacred organization in human history\nChina's embassy in Australia has responded allegations of improper influence in that country as a racist attacks on Chinese people Metcalf says the problem is not the people but the ...\nImproper influence in that country as a racist attacks on Chinese people Metcalf says the problem is not the people but the Communist Party and he says some of the most vulnerable victims of China's Communist party are Chinese people of left their country to live in democracies like Australia\nAnd New Zealand [noise] more than a thousand miles across the has been\nSeeing New Zealand generally Gen rests on his balcony in a leafy suburb of Auckland he left China back in Nineteen Ninety One this gaping arrest for working on a pro democracy newspaper\nHe re started the paper in New Zealand but even here he says Beijing caught up with them a pro party newspaper ... sued him for defamation after we criticize them for being to probe aging ongoing legal fees left him bankrupt\nThe ... to ... year old she can do their labor was funded by business is supported by China's government ... oversees communist party's propaganda wing crushed our democratic newspaper ever since ... says he's watched\nAs China's Communist party made deeper inroads in the New Zealand society and government\nLast year local media discovered that a Chinese born member of New Zealand parliament Dr Jen young had lied to authorities on his citizenship application it turned out that young a member of the ruling party at the time had taught spies at one of China's best known military intelligence schools before he moved to New Zealand\nWe've been trying to talk to your three dogs we need to talk to you about your wings for Chinese military intelligence talk to my boss like I Know we talked about what what kind of off\nA local reporter for new England's newsrooms and tried to talk to young last year he declined an interview request from NPR\nDid you intend on that took it's easy it's clear Gen young is a Chinese spy again ... ... ...\nYou know those people in his party think he is good for relations with China a lot of his party's donations come through him and he often leads the government troops to China to make lucrative deals their\nPlayed a prominent role during New Zealand official visit to China and twenty Thirteen and twenty sixteen and as his political influence grew so did new Zealand's dependence on China's market China is by far the biggest investor in New Zealand dairy industry a quarter of all imported milk in China comes from the island nation\nYoung was later removed from parliamentary select committees on foreign affairs defense in trade yet still serves in New Zealand parliament leaving some wondering why\nWinston Peters is new Zealand's deputy prime minister and the country's ministry of foreign affairs because at that live alone\nLeaving some wondering why Winston Peters is New Zealand is deputy prime minister and the country's minister of foreign affairs\nBecause at that level of growing public interest and the intelligence interest as well one would be naive to think that the response would not be forthcoming\nUs analysts considered the genuine case evidence that China is exploiting New Zealand as a weak link in the so called five eyes the intelligence alliance involving the U.S the u._k. Canada Australia and New Zealand this angers Peters\nThis could be turned up to two world wars two years before the United states but the cases we don't like that sort of took down here\nBut it's the work of a fellow New Zealand or that has drawn the brightest spotlight on Chinese influence operations inside the country\nLast year University of Canterbury professor Anne Marie Brady made a splash with a report magic weapons it revealed the activities of the United front worked department to Communist Party agency that Chinese leader Xi Jinping has revived directing it to guide by and co worst political influence abroad\nChina and she is a very ambitious policy and take it from me to support that\nEarlier this year Brady announced that her office and her home were robbed in before one of the break ins she received a letter threatening push back to people like her criticizing Beijing\nI can relate to my wedded to take a while that when\nHer laptops phones and flash drives were stolen everything related to her research in the summary of or magic weapons report Brady rights that democracies have magic weapons to the right to choose our government's checks on power freedom of speech and association and a free\nPress now she writes is the time to use them Rob Schmitz NPR News Wellington New Zealand [noise]\n\n[noise] this is NPR News\nToday China's power is the walls and China leader when with them or alcohol\nHas plans to build a brand new city some fresh off of like a hand in that way\nMichael China have plans to build a brand new city from scratch on my walk of life could be just six and politics stand in a way it's not a done deal and so you actually see from coal fired fast flowing across the world on MORNING EDITION from NPR News [noise]\nThey're called pee fast P. F. A. S. and they're linked to a number of illnesses including cancer the Trump Administration is working on a plane to regulate them some in Congress are pressing for it to move faster NPR's Jeff Brady has been looking into this and joins us now Jeff Hi Ari first of all what are these chemicals\nA pie fast it's an entire group of several thousand manmade chemicals in some of them had been around for decades these chemicals are good at repellent oil and water and that makes them really useful for all sorts of products like non stick cookware coating on fast food rappers pizza boxes\nAnd the places where Pete passes are used in manufacturing those are generally the places that are the most polluted or there's some sites in New York North Carolina Michigan just to name a few places\n... also are in firefighting phone used at airports and military bases in some cases around the country the chemicals have migrated into local drinking water and\nThe estimates on exactly how many people are affected very but it's safe to say that the numbers in the million\nHow harmful to people kind of chemicals be what kinds of problems that cause\nThe research is limited so it's hard to pin down exactly how harmful these chemicals are scientists will say ... passes are linked to certain illnesses here's Laurel ... she's a research scientist with an advocacy group called the Silent Spring Institute\nPiece chemicals have been linked to a wide range of health effects including cancer\nLow birth weight\nThyroid disease elevated cholesterol\nOn the immune system\nManufacturers have agreed to stop using two forms of pee fast in the U. S. but these chemicals take a long time to break down in the environment and that's why they are still a problem now\nAnd how regulators responding to this especially given the uncertainty\nThe EPA requires most water utilities to test for a list of ... passes and in twenty sixteen agency lowered a non binding health advisory limit for some ... chemicals it's now Seventy parts per trillion I'm told that it's about Seventy grains of sand in an Olympic size swimming pool\nAnd some environmental advocates argue level should be even lower than that but all this\nOf sand in an Olympic size swimming pool and some environmental advocates argue level should be even lower than that\nBut all this uncertainty it creates confusion especially for water companies like aqua America it's based in suburban Philadelphia Christopher ... is the chief environmental officer there and he says companies like his needs a clear direction from the EPA and from policymakers\nTo be able to explain to the public and my above or below sea level here and do we need to put treatment on in this community and how soon and that still needs to be determined and that needs to be determined as soon as\nPossible now the EPA is working on a plan to manage pee fast chemicals the agency just wrapped up a series of public meetings around the country the plan is expected by the end of the year\nThe Trump Administration has been so staunchly anti regulation especially rolling back protections meant to keep people safe from environmental contaminants why are they responding differently to this\nAn issue like this it really fits in with the way the Trump Administration has tried to narrow the focus of the EPA away from things like climate change and toward issues such as clean air and clean water also we should keep in mind that the EPA still working on his plan to manage ... chemicals\nAnd we don't know what that plan is going to look like until it's out some time in the next few months\nSo what could people do to protect themselves today\nAbout the water utility aqua that we heard from just a minute ago they've installed these big carbon filters to bring the levels down and that works the utility says the water is safe to drink\nIf you're still worried about it those filters that you get in a refrigerator or in water pitchers those would bring the levels down too but I've talked to people here who still just don't trust their water that it's safe and they're continuing to drink bottled water\nThat's NPR's Jeff Brady thanks thank you are and tomorrow we'll visit a New Hampshire town where there's concern that these chemicals are leaking from landfill into drinking water [noise]\n\n\n[noise]\nYou're listening to all things considered from NPR News\nIt's been more than two years since Britain voted to quit the European Union but the debate about how to leave it's still going on even within the ruling conservative party prime minister Theresa May's plan for Brexit has already been rejected by you and It's MORNING her former foreign secretary Boris Johnson also attacked it\nThat is not ... not just that is not a compromise he's dangerous about unstable politically and economically my fellow conservatives which is not a democracy that has no war we voted for\nJohnson was speaking at the conservative party convention in Birmingham, England and that is where NPR's Frank Langfitt filed the story\nThe energy is when you think he's here in the city of international convention center the party's leaders are speaking of stares at a city hall for the fringe event like this populist one nearby where John warmer kick things off [noise]\nRight [noise] big\nYou know what did I not only to do all those people do it in the room to see the\nMe\nCheers leave means leaf group dedicated to the swift exit from the you you'd also opposes what it sees as prime minister Theresa May's attempt to keep one foot inside the European Union I met you memory at a packed leave means leave events\nLast night I went to ... pass and they would like to come up with new Dale many economists say just walking away\nFrom the use marketer more than five hundred million consumers who do serious damage to the u._k. economy but Murray who's managing director of official auction company on England's east coast to the center of the u._k. leaves the faster English fisherman can reclaim exclusive rights to their traditional fishing grounds\nThe have taken the majority of our fish we want it badly want full control of our motives and the fish would they not what we could be dealing with now if someone like Donald Trump\nMost Britain's don't like the American president but his economic nationalism resonates with some breakfast tears would Mars willingness to attack free trade deals that her workers at home we need someone like ...\nThese economic nationalism resonates with some breakfast ears would Myers willingness to attack free trade deals that her workers at home\nWe need someone like came we need someone who wants to protect the country and the people not just that great unfortunately my night prime minister he did have an respectful has backtracked\nOn same anything she learns and not everyone here is down on the beleaguered to resent me\nPersonally I Am a massive funded the prime minister and I hope she stays on for as long as possible\nCamera round is a law student at the University of chest or outside of Liverpool he appreciates that may is trying to find a middle ground keeping some economic benefits of view membership for taking back political power from bureaucrats in Brussels the old criticism here\nBecause we like the European Union times of economic policy we live the freedom of goods moving across borders with ... with us trade\nSo we don't like the political institutions of the\nLeaders say you can't put the club and still cherry pick benefits he told the prime minister this last month at a meeting in Austria send her back to the drawing board\nEven though the U.S made its position known for weeks some Britain's for insult\nIncluding Joshua brought her another student here who tends the University of New York\nThat treatment as the prime minister assaulted with ... limited frankly that's really help in a way unite different parts of the conservative phosphate because of how she was treated them in what way because they still actually don't agree with that\nBut we don't agree but I think we've you not getting the outrage coffee\nPerhaps but outrage isn't a policy which is what prime minister may still needs to come up with later this month\nTo meet an e deadline\nIs she still hopes to avoid crashing out of the European Union\nAnd the economic pain that comes with and\nFrank Langfitt NPR News ... ah\nYou're listening to all things considered from NPR News and you are doing that here on Ninety One point five care cc southern Colorado's NPR station the debate over Brett Kavanaugh's Senate testimony has shifted from questions of sexual assault to whether he lied about his drinking\nThey on the accounts by his high school and college classmate she is grossly myth characterized his relationship with alcohol\nWe'll hear more on Kavanaugh's credibility on drinking and that report right after the headline news cast from NPR five or six\n\nHey thanks for listening this is David Draine my I'm students I'm Rachel Martin\n\nHey thanks for listening this is David Draine my I'm Stevens I'm Rachel Martin say there is Joshua Johnson the host of one a dime Abigail vaccine joined me and my co host weekday mornings for news and cultural coverage\nOn Ninety One point five K. R. C. C. [noise] does America have a drinking\nProblem my friends and I we drink beer like beer beer sometimes we had many beers\nWere talking about the culture around alcohol in this country and how your race and gender and background can all play a role in what's considered a normal amount to drink next time on the take away from WNYC NPR I\nAlso online at K. R. C. C. dot ORG\nAmazon says it's raising its minimum wage for all\nUs workers to Fifteen dollars an hour to that story coming up in about twenty five minutes as we continue with all things considered\nNow you can tune in to Ninety when we find NPR's D.C without lifting a finger in your smart ...\n[noise] [noise] [noise] [noise] Ninety One point five care cc is on Facebook and Twitter you'll find news headlines local story station then canned announcement find and follow us on Facebook and Twitter K. R. C. C. [noise]\nAre two issues on this November ballot aimed at funding transportation projects in the state\nThe truth is we need to pay if we'd like to improve our quality of life in terms of our transportation experience in the state of Colorado and we will take a look at those issues coming up in about forty five minutes or so that report it's five forty for Iran Ninety One point five\nK. R. C. C.\nPartly cloudy eighty one degrees current weather conditions in the downtown area about twenty to thirty percent chance give or take for showers yet\nOr the afternoon and evening and our listening area temperatures ranging from the mid forties and the high country to lower sixties in lower Arkansas River valley mid fifties for this spring\nArea temperatures ranging from the mid forties and the high country to lower sixties in lower Arkansas River valley [noise] mid fifties for the springs tonight and then tomorrow another wide range of temps\nClose to Seventy for the country from Ninety in hunter and lower eighties here in the springs again anyone here in the downtown springs area at fiber one\n\nLive from NPR News in Washington I'm jak sphere the Senate is awaiting the results of the FBI investigation and the Supreme Court nominee Brett Kavanaugh NPR's Windsor Johnston reports the agency is looking into allegations of sexual misconduct with stem from capital as high school and college days\nShe FBI is in the process of interviewing witnesses and an attempt to corroborate the stories of cat and all and his initial accuser Christine Blasey Ford Senator Jeff flake the Republican who played a key role and securing a delight to allow time for the ... says the FBI needs to be thorough\nMy hope is that they are as they interview these individuals then they'll immediately follow up on other leads that they might they might have so we don't know exactly where it is in terms of what it will take and I just hope that we find fact\nPresident Trump says he's hoping for a positive vote in the Senate this week for a cat and all but it will be dependent on what comes back from the FBI winter Johnston NPR News Washington\nOr Chicago police officer charged with murder and the shooting death of a black teenager testified on his own behalf today NPR's Cheryl Corley reports the officer says the team could have prevented the shooting it beat obey police orders\nAnd twenty fourteen Jason Van Dyke joined other police officers answering a call about someone breaking into vehicles Seventeen year old ... McDonald was walking on a busy Chicago street he had a knife and didn't drop it after police ordered him to do so\nThe other officers were waiting for a taser when Van Dyke arrived and video shows McDonald walking away but then I testified he thought officers were under attack he shot McDonald sixteen times\nYou could've made indecisive Sherman in watching the officers rushing any and all you could have drawn to it and I used to weigh in and did it All right than in their\nVan Dyke is the first Chicago police officer to face a murder charge for an on duty shooting in decades Cheryl Corley NPR News Chicago\nAt exactly to Eighteen pm eastern standard time tomorrow mobile devices across the country are expected to start going off that's because the federal emergency management agency says it tends to conduct\nMobile devices across the country are expected to start going off\nAs because the federal emergency management agency says it intends to conduct the first nationwide test of a wireless phone emergency alert potentially reaching upwards of two hundred and twenty five million mobile devices being as Wade Widmer says it's hope they could reach a wider group than through broadcast many alone\nThere was a lot of discussion and concern about the ability to warn or Americans or people in the United states of emergency is the only the radio and TV\nAs the subject line will read presidential alert the message will say this is a test no further action is required\nThe founder of China's online giant Eli Bob uh Jack Ma says the U.S trying to trade war could last decades though he also expressed hope a solution can be reached since he contends a trade war would hurt everyone Chinese e commerce billionaire also questioning the focus on trade deficits something he says it's more a relic of the twentieth century\nOn Wall street that I was up a hundred and twenty two points this is NPR\nThe Trump Administration has quietly seeking to weaken current radiation exposure rules contend the current no tolerance rule for radiation results an unnecessary spending proposed change would recommend a major departure from the current decades old guidance that any exposure represents a cancer risk\nCritics contend watering down the rules could lead to higher levels of radiation exposure for workers ... nuclear installations oil and gas drilling sites and for medical workers\nAnd their study is finding a simple rule change in college football can dramatically cut the risk of concussion NPR's Jon Hamilton reports on research in the journal of the American Medical Association more than twenty percent of concussions in college football occurred during kickoffs when players often collided full speed\nSo in two thousand Fifteen Ivy League schools moved to kick off line five yards up the field\nThe idea was to make it less likely to double would be returned\nAnd an analysis by three ivy leagues scientists found that the change reduce the chance of a concussion during kickoffs by more than eighty percent\nThe NFL also a decrease in brain injuries after changing its kickoff rules in two thousand eleven\nAnd a new study's authors say that schools beyond the ivy league made similar rule changes it might reduce concussions for all college football players Jon Hamilton NPR News ... biggest grocery and drugstore chain say they are joining forces with plans to work together they're trying to keep up with the growing popularity of online shopping\nWalgreens says will begin selling quote Kroger products at thirtieth but stores near the Cincinnati area on customers to use those locations to pick up groceries ordered on\n... says it will begin selling quote Kroger products at Thirteen of its stores near the Cincinnati area on customers to use those locations to pick up groceries ordered\nOn line I'm jak spear NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the University of Florida we're solving for next is powered by its land grant heritage from renewable energy to global health us students and researchers are working to solve challenges at next to die UFO dot edu\nNow you can have the Ninety One point five ... the newsletter highlighting the weeks local and national news delivered to your inbox every Friday morning [noise] sign up at ... dot org\nProgramming on Ninety One point five K. R. C. C. is supported by Jackson Greek senior living monument offering independent living assisted living in memory care residents was designed for many lifestyle choices wellness programs tailored activities in more now scheduling tours more Jackson creek senior living dot com\nAnd NPR News\nThis is all things considered I Know for Chang and I'm Ari Shapiro the fight to confirm Brett Kavanaugh to the Supreme Court continues on Capitol Hill\nBy the end of this week the FBI is expected to deliver findings from it's expanded background check on the judge that increase looking into claims of sexual assault\nAnd now there is also growing talk about Kavanaugh's comments on his drinking and whether his remarks were truthful we're going to take some time to go through what's been said and how the story line up first year was President Trump's yesterday\nI watched him I was surprised at how a vocally was about the fact that he likes beer\nAnd he's had a little bit of difficulty I mean he talked about things that happened when he drank\nOthers heard Kavanaugh's testimony differently Here's Senate minority leader Chuck Schumer this morning\nThey on the town's by his high school and college classmate she is grossly ms characterizes relationship with alcohol\nCommon thread judge Kavanaugh\nRepeatedly to toes around moved troops\nTo help guide us through these remarks interpretations of them NPR's Tamara Keith is here Hi Tom hello Ari you\nWant to begin with Kevin us first public comments about his drinking\nYes that was that Fox News interview that he did with Martha ... before the hearing he started by describing his high school life in this way\nI went to an all boys Catholic high school in Jesuit high school where I was focused on academics and athletics\nScraping his high school life in this way\nI went to an all boys Catholic high school in Jesuit high school world's focus on academics and athletics going to church every Sunday and little flower or working on my service projects and friendship\nHe did mention the other parts of it the the partying\nAnd you ask people might have had too many beers on occasion and people generally in high school or the goal of us are probably done things we look back on and high school and regret or cringe a bit but I that's not what we're talking about\nYou can come away from most of that interview thinking\nHere's someone who was really studious and didn't really have time for that much partying um but he was asked in the interview by Martha ... whether he ever drank so much that he couldn't remember the night before no ah then never happen you never had anyone I don't remember anything about us I Know\nSo that's the description he gave Fox News several days later he spoke to the Senate Judiciary committee under oath and here's what he said in his opening statement\nI drink beer with my friends\nEveryone did sometimes I had too many beers sometimes others did I like beer I still like beer but\nI did not drink beer to the point of watching out and I never sexually assaulted anyone\nWhen the time comes donate that part of this Asian they'll turn it into the programs you love [noise] gr donation information at your C. C. dot org\nAnd keep in mind why the evening edition of marketplace or following all things considered tonight at six thirty here on Ninety One point five care see see\nSpeaking of uh transportation there are two issues on this November ballot aimed at funding transportation projects in Colorado the truth is we need to pay if we'd like to improve our quality of life in terms of our transportation experience in the state of Colorado will take a look at those issues in this next half hour\nThat report coming up at five forty four here on southern Colorado's NPR station\nSome clouds Seventy nine degrees here in downtown Colorado Springs five twenty [noise]\n\nSupport for NPR comes from this station and from the main\nColorado Springs five twenty [noise]\n\nSupport for NPR comes from this station and from the main office of tourism offering travelers an opportunity to explore and discover their very own main thing to be inspired the original and be yourself at visit main dot com\nFrom T. I. A. T. I. A. as committed to helping those who are driven by purpose reached their definition of success investing advice banking retirement learn more it T. I. A. dot org and from the listeners who support this NPR station\nFrom NPR News this is all things considered ... Chang and I'm Ari Shapiro Jason Kander a Missouri politicians seen as a rising star in the Democratic party and the favorite in the Kansas City mayors race is dropping out\nCandor is a veteran who served in Afghanistan and today he said he's bowing out of the race in order to seek treatment for his ... and depression NPR's Quil Lawrence covers veterans and the VA and he joins us now like well how are the tell us more about Jason Kander a Democrat with deep appeal in a deep red state\nRight a he's a lawyer he was a former Missouri secretary of state he did a tour in Afghanistan as an intelligence officer back in two thousand six and then came home and got into Missouri politics he made a surprisingly good run in the deep red state to unseat Republican senator Roy Blunt\nIn two thousand uh sixteen and if you've heard of him you've probably heard of him from this ad hundreds in Kansas\nSenator boy and he's in an empty warehouse blindfolded and he's assembling a are Fifteen style rifle and the while he's doing he's talking about gun rights and he says he support gun supports gun rights but he also support background checks\nHe says to keep terrorists from getting one of these\nAnd then the gun is assembled and he takes off the blindfold and he says is I'd like to see some of the foreign do this and the ad gone national attention he later had a best selling book about lessons from politics and the military he was even mentioned as a possible democratic presidential candidate in twenty twenty so really\nIt seemed like a rising politician the Democratic\nParty and his decision today to part of the race came as a surprise and it came with a very honest and emotional letter message or tell us about it\nIt was just hours ago candor posted a statement that he was tired of denying that he had a problem that he'd been ... that he had symptoms of pie TST had nightmares\nGo candor posted a statement that he was tired of denying that he had a problem\nThat he'd been ... that he had symptoms of pie TST had nightmares and he'd been suffering from depression and he'd felt changed ever since he came back from Afghanistan eleven years ago\nUm he said that when he should have been celebrating for example a having a raised a record amount of funds in his mayoral campaign he was actually in a in crisis and he was on the veterans crisis line the Vietnam veterans crisis line in tears saying that yes he had\nBeen having suicidal thoughts\nUm so he decided that he should take a step back from the campaign and from the organization who started to something called the let America vote which is a anti gerrymandering an anti voter suppression organization or he says he's getting VIP treatment and that he's not permanently retiring from politics he's expecting to be back\nEven with all of a conversation about and support for people who have ... how much stigma is there still today\nWell I mean there's a lot of stigma and and it can also depend for example on what stage are out in the military career if you're active duty military and you raise your hand and get treatment it can make you under deployable so a lot a lot of people will hide it because they want to be able to stay in the fight\n'em and uh I mean I Can't think of a politician who disclosed this sort of thing except\nUsually on the you know on the tail of a scandal that's going to come up involving some\nUh misbehavior but uh I mean this is a serious crisis just last week the VA release statistic saying that suicide has increased especially among cancers generation of veterans and candor said he wanted to do this in part to help others confront this in public that it isn't a sign of weakness\nBut some parents Quil Lawrence thanks ... thank you are now we turn to Amazon which has become the largest company to commit to the minimum wage of Fifteen dollars an hour\nThe retail giant which is where it's almost a trillion dollars faced a lot of criticism after disclosing earlier this here that the median salary at Amazon was less than twenty nine thousand dollars that's just a little over the federal poverty level for a family for NPR's Alina Selyukh reports\nAnd Amazon corporate executives stood today before more than seven\nHundred workers in California warehouse and told them they are getting a re [noise]\nDave Clark he told me this was one of his best days at work and the Twenty years it's been an Amazon I should note that Amazon is one of NPR sponsors I reached Clark at that\nHe told me this was one of his best days at work and the Twenty years has been at Amazon I should note that Amazon is one of NPR sponsors I reached clerk at that California warehouse\nWhere we are now now is a Fifteen dollar minimum made\nBefore any other\nThe Fifteen dollar minimum kicks in on November first for all Amazon workers in the U.S fulltime part-time temps and seasonal Amazon says that's about three hundred and fifty thousand employees total I ask Clark how much a warehouse temp job might pay at Amazon now\nAre low after ... facility was under eleven dollars and it ranges over Fifteen dollars\nThis already far above the federal minimum wage of seven dollars and twenty five cents but still Amazon's bay has been facing a lot of criticism as a company ballooned into a global giant with half a million employees many of whom are drivers and warehouse workers\nAmazon is the second most valuable American Company it's run by the wealthiest men in the world CEO Jeff ... [noise]\n\nTwo weeks ago a group demonstrated outside of be the speech and Washington protesting the wide gap between basis as well and the wages for his lowest paid employees\nInside basin spoke to several hundred Washington Power brokers and he was asked about the growing intention that Amazon was getting from critics who think it's become too big and too powerful ... said scrutiny like that is good for society\nAll big institutions of any kind or going to be and should be examined scrutinized inspected\nToday in his statement about the Fifteen dollar minimum wage ... said the company listened to its critics one of the most high profile ones has been Vermont Senator Bernie Sanders\nFor her to give credit where credit's as soon as a matter of what I did the right wing\nStandards have long been campaigning for better conditions and pay for minimum wage workers including at retail and fast food restaurants\nHe has introduced a bill called the ... act which stands for stop bad employers by zeroing out subsidies the bill would tax large corporations whose workers rely on federal benefits like food stamps\nAt our hope and believe but I'm just wondering will cause other companies like Wal Mart for food in the short reading than we were also good for American workers\nThe decision today will cause other companies like Wal Mart or food in the short run as well so it's a good day for American workers\nAmazon is not the first big retailer to make a public show of raising the minimum wage target plans to get to Fifteen dollars an hour by twenty twenty cops go hit fourteen dollars this summer but Amazon is now the country's second largest private employer\nI thought it was great news I don't see how could be other than good news is the\nAuthor is an economist at MIT and he says there are several ways to view Amazon move skeptically won the unemployment rate is low and there is high demand for workers\nOne interpretation is look it was going to have to raise wages anyway Italy marketers tightening uh so it just you know decide to get the good publicity out of that\nAutor says no matter the reason it's important to remember that raises are good for the workers who get them tender local economies lower wage workers on and so they do tend to spend extra earnings\nAnd kind of surprising way that Amazon made waste today it's saying that it will lobby Congress for an increase in the federal minimum wage however Amazon's Dave Clark told me the company does not plan to Bush for a federal minimum all the way up to Fifteen dollars\nWe think is the right number for a really weird for me [noise]\nBut Senator Sanders says he hopes the ... stamp of approval convinces the rest of the country that Fifteen dollars an hour is writing Alina Selyukh NPR News\nWith all the news happening every day it can be hard to keep up so check out our podcast up first you'll get the biggest stories about ten minutes it's available every weekday morning wherever you get your podcasts\nThis is NPR News\nToday of Chinese power in the walls and China would win with the ...\nChina have plans to build a brand new city from scratch on my walk of life because it just sticks and politics than in a way it's not a done deal and so you actually see some calls parts fast flowing Morrow on MORNING EDITION from NPR News\nWell there's a lot of anger about that but want is so huge and the preparation for this is simply nowhere near what needs to happen here\nIs so huge and the preparation for this is simply nowhere near what needs to happen here\nThat's NPR's Julie McCarthy she's traveling in Indonesia central ... province thank you very much Julie thank you\nKnow to the Supreme Court where today the justice has grappled with a difficult death penalty question does it violates the Constitution's ban on cruel and unusual punishment to execute a convicted murderer who has such severe dementia that he doesn't remember the crime he committed NPR legal affairs correspondent Nina Totenberg reports\nVernon Madison committed a terrible crime in Nineteen eighty five after leaving his girlfriend's house he returned and shot and killed a police officer who had remained outside in his car to provide protection twice Madison was sentenced to death but the convictions were overturned because a prosecutorial misconduct\nThe third time he was convicted the jury recommended life in prison but Alabama has a unique law that allows a trial judge to override a jury's recommendation and the judge did just that\nMadison has been on death row in solitary confinement in Alabama now for more than Thirty years in that time he suffered multiple severe strokes an MRI shows part of his brain is dead and there is no dispute that he suffers from severe vascular dementia and\nHis lawyer Bryan Stevenson says that Madison is so disoriented that he doesn't know what day a month or a year it is he's legally blind has difficulty walking and slurs his speech\nBut most critically has no memory of the circumstances of this prime things about the same things to execute him for\nInside the Supreme Court today lawyer Stevenson told the justices that executing them and so incompetent would be unconstitutionally cruel and unusual punishment\nIn the past two decades in cases like this barring the death penalty for juveniles and the mentally challenged the justice who provided the fifth and deciding boat was Anthony Kennedy and he has just retired\nInside the courtroom today the justices appeared closely divided chief justice John Roberts asked whether for the purposes of the death penalty dementia is the same as someone who becomes psychotic while in prison\nLawyer Stevenson there would have to be a memory loss plus something else Justice Ginsburg what would the plus B answer brain damage that is the results of an injury so that their brain is incapable of producing memories are creating the kind of rational understanding that this court has required in the past justice ...\nIt's also an injury so that the brain is incapable of producing memories are creating the kind of rational understanding that this court has required in the past ... or\nSo you're not talking about just amnesia answer no Mr Madison's dementia is so comprehensive that he can explain to you that he has a toilet in itself or his use\nBut he can't hold that memory and he routinely urine eights on himself and asked the guards to take him to the toilet\nThe problem in this case Stephenson said is that the lower courts have said that since Madison is not delusional or psychotic it's All right to execute him\nThe eighth amendment he said it's not like the constitutions other amendment it's a mirror of our norms and our values and what we have argued in this case is that Mr Madison's dementia renders him so frail but we'll dirt and vulnerable that executing cannot be reconciled with the Constitution's ban on cruel and unusual punishment\nArguing for executing Madison was Alabama deputy attorney general Thomas ... junior justice prior a frequent critic of the death penalty asked this question I\nThink if a person in the advanced stages of Alzheimer's what's the purpose of executing that person if you wouldn't executed person who's schizophrenia or delusional lawyer Govan replied that the state in this case still has an interest in seeking retribution for a horrible crime\nAnd he said that Madison does understand that he's in prison because of a murdered after the argument Alabama State attorney general Steve Marshall had this to say\nThis involved the little execution of a police officer with this murder and at some point in time to say look forward to being able to obtain the punishment with the trial judge believe was appropriate in this case\nA decision in the case is expected later in the term Nina Totenberg NPR News Washington [noise]\nYou're listening to all things considered from NPR News\nAddition to electing a new governor this November Colorado voters will also see two items on the ballot for funding transportation projects they both find a way to pay for road construction but each one goes about it differently\nWe'll also see two items on the ballot for funding transportation projects they both find a way to pay for road construction but each one goes about it differently ... blue dug into propositions one oh nine and one ten and break them down\nTo understand why there are dueling transportation funding questions on the ballot you need to go back in time specifically twenty seven years ago\nRemember Nineteen Ninety One George Bush was president you know the other one and the Soviet Union was still a thing as this\nCampaign ad also states it was the last time Colorado raised the gas tax to twenty two cents a gallon to pay for road projects let's go Colorado will yes I wanted the gas tax hasn't been an adequate source of funding for a long time\nMeaning more and more projects had to be put off to the point where now the state faces about a nine ... billion dollar price tag to get its current to do list finished the reason we really strongly\nSupport initiative one ten is it raises about seven hundred and sixty seven\nMillion dollars a year Kelly broth is president and see all of the Denver metro chamber of commerce\nOne ten would raise the state wide sales tax from two point nine percent to three point five to ... percent for Twenty years to pay back up to six billion dollars in bonds the funding would be divided among both state and local governments for projects\nThe truth is we need to pay if we'd like to improve our quality of life in terms of our transportation experience in the state of Colorado and we have a strategy where he paid very little and we can get huge improvement\nWe don't know what we're getting with his tax increase that's\nJohn Caldera he's with the libertarian think tank independence Institute which is backing a different proposal\nWe don't know what trends are projects and we don't know what the cities will do with our slush fund it brings a lot of money and we're not certain that\nCertainty is exactly what Caldera is flaunting as the ads for proposition one oh nine\nIt tells the department of transportation to bond for three and a half billion dollars to put be used for sixty six specific projects around the state that says you will get going on all these projects and you will not raise taxes or fees to pay it back\nOne oh nine is also bluntly called fix our dam road it's also a twenty year plan Caldeira says its biggest strength is that it's been done before\nNew idea at all in Nineteen Ninety nine then Governor Bill Owens who was facing the same\nIt's been done before start a new idea at all in Nineteen Ninety nine then Governor Bill Owens who\nWas facing a same similar situation the state was flush with surplus money but none of it was going toward the roads so Owens a Republican put forward a bonding question\nThe transportation expansion project or T rex it added extra lanes to twenty five south of Denver and more than Nineteen miles of light rail track around the city and it worked\nBeautifully but ... says the downside to call their plan is that the money to pay back the bonds is not identified and would have to come from somewhere else in the state budget\nMost likely we believe you'd have to take it either out of higher ed are higher ed funding is forty eight out of fiftieth in the country out of our K. to twelve system were fifty five percent of our school districts currently on for days school weeks so they're probably going to have to go to less and data health care\nWith both campaigns critical of the others approach to the funding issue the situation begs the question what if voters passed both measures it's a wonderful intellectual question but I I don't see that at all Kelly bras campaign also doesn't see it working out that way\nAnd so I think what you didn't invite is a lot of legal wrangling a about what you get to spend your money on in your local community and we think that should be their decision about what's most important\nNeither ... nor John Caldeira wants to think about the other possibility which is neither question passes but it's so state lawmakers have a backup plan they have a question on deck for the twenty Nineteen ballot that would ask voters to bond about two billion dollars for transportation projects [noise]\n\nNinety One point five care cc is on Facebook and Twitter you'll find news headlines local stories station and then hand announcements sinus and follow us on Facebook and Twitter K. R. C. the\nRepublican Senator Lindsey Graham is lashing out to Democrats over Supreme Court nominee Brett Kavanaugh\nIf you really wanted to know the truth you sure as hell wouldn't have done what you've done to this guy\nThe Kavanaugh hearings highlight grams transformation from anti Trump conservative to fear from supporter get the full story on that in the next half hour of all things considered that story coming up at six ten here on Ninety One point five years you see NPR\nOn Ninety One point five\nAll things considered a story coming up at six ten here on Ninety One point five years you see\nNPR on Ninety One point five to your cc you supported locally by climate granted for Twenty years remodeling kitchens bathrooms with colors from around the globe ram it quartz site marble and more on display in the show room at thirty twenty more stone online at planet rented taught us", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Colorado Springs", "day": "02"}