{"month": "10", "state": "CO", "station": "KRCC", "content": "And your book is titled the poison squad comes from project took it really shows his commitment to this ah describe it the poison squad was\nThis is an experiment you could never do today because he basically goes out and recruit other people at the department of agriculture especially young clerks to volunteer to dine very dangerous lay and so the idea of the poison squad was that three free\nAnd your book is titled the poison squad comes from project took it really shows his commitment to this ah describe it the poison squad was\nWell this is an experiment you could never do today because he basically goes out and recruit other people at the department of agriculture\nEspecially young clerks to volunteer to dine very dangerous lay and so the idea of the poison squad\nWas that three three meals a day seven days a week super fancy meals that are cooked by a professional chef of all the ingredients are amazing and they only catches you have to agree\nThat half of you at any given period in this experiment are going to be adding capsules that contains suspect food additives and the other thing about it when you say is this crazy or what you are testing\nSuspected toxic compounds on human volunteers was that he felt that was the only way he could deal with this you had this rising tide of really dangerous food additives\nThere was no safety regulation how do I make a case that perhaps this is not a good idea I'll just tested on people and so he did\nNo one surprise if you feed people formaldehyde arsenic or lead they will get sick and when you demonstrate that why does it still remains so difficult to outlaw formaldehyde arsenic or lead in food why was it just not an obvious thing that everybody got on board with right away\nAnd doesn't that sound like the most logical response do look you've ... you've poison people let's get that out of the food supply the food industry\nHad been organizing itself to fight regulation probably at the point that widely starts these experiments in Nineteen oh to he had been advocating advocating advocating and working with Congress men to try to get some kind of basic consumer protection ... regulations out there\nAnd if nothing else labeling and\nAs he does these experiments and ads they catch the national attention which they did they were a front page news there were songs and you know musical numbers about them every one is suddenly realizing that there is a lot of bad ... stuffing their food there's just a lot of bad stuff in their food and\nSo there's this in media push back right to enrich\nCongressman to try to get some kind of basic consumer protection ... regulations out there and if nothing else labeling and\nAs he does these experiments and ads they catch the national attention which they did they were a front page news there were songs and you know musical numbers about them every one is suddenly realizing that there was a lot of bad ... stuffing their food there's just a lot of bad stuff in their food and\nSo there's this in media push back\nRight in which suddenly congressmen or on the side of food business or getting offered more money and the food industry actually organizes\nThey create a food Manufacturers Association and and and coalesce against making sure this doesn't happen and they were phenomenally effective\nAnd yet despite these long fought fight to expand decades today there isn't lead and formaldehyde and arsenic in food the way that there was a hundred years ago progress really was made\nYes once this\nFirst food safety law that passed in Nineteen oh six two years after a while a finished his\nFamous poison squad experiments wants that law went into a place we started pulling stuff out of formaldehyde when Alice Alice ... acid went out bar acts went out we\nAre cynical it out right you really see government stepping up for some of these outlet extremely dangerous compounds\nIn this book just one big argument in favor of government regulation\nIn part because it certainly should be a reminder of that before government regulation food was a constant unknown and often terrifying risk to American consumers and put our lives at risk\nBut it's also I Hope just a good story it's a story of something that I Love\nI Love these kinds of stories it's a story I'm a single person who changes the conversation right and I think that's really important to we need to remember\nThat someone who is focused and even obsessive and and who stands up relentlessly for an issue can actually make a difference so I Hope it works on all those levels\nNew book is called the poison squad one kind of a single minded crusade for food safety at the turn of the twentieth century thanks for talking with us\nStory of something that I Love\nI Love these kinds of stories it's a story of a single person who changes the conversation right and I think that's really important to we need to remember\nThat someone who is focused and even obsessive and and who you stand up relentlessly for an issue can actually make a difference so I Hope it works on all those levels\n... new book is called the poison squad one kind of a single minded crusade for food safety at the turn of the twentieth century thanks for talking with us thank you so much for having me on\n\nTomorrow on MORNING edition Jerusalem has long been a pilgrimage site for people of many faiths after the U.S embassy in Paris few months ago some religious Americans saw another reason to come they say the embassy represent something biblical\nThat story tomorrow on MORNING edition you can ask your smart speaker to play NPR or your local station by name\nAnd by all means tune in for MORNING EDITION tomorrow here on Ninety One point five ... five to nine AM we'd be mornings\nRe listening to all things considered from NPR News\nHow the top of the ballots can impact local races down ballot is a question more typically posed during presidential election years but this year a controversial Senate candidate is running in Virginia\nAnd that could have an impact on whether Democrats take control of the U.S house Mallory Noe Payne of member station WBHM ...\nReports a few months before last year's deadly unite the Right rally in Charlottesville Republican Cory Stewart stood before a stage draped with the Confederate battle flag he told the crowd he was proud to be there\n[noise] [noise]\n\n... have made a name for himself by associating with white nationalist he wants to deport immigrants who may be here illegally and after the unite the Right rally he falsely blamed left wing activist for the violence\nNow he's running for Senate and inspiring I roll from Republicans like Matt Walton as friends\n[noise] not [noise]\nI don't plan on\nDo we have made a name for himself by associating with white nationalist he wants to deport immigrants who may be here illegally and after the unite the Right rally he falsely claimed left wing activists for the violence\nNow he's running for Senate and inspiring I rolled from Republicans like Matt Walton\nI've some friends that are usually reliable Republican voters that are just frustrated or really debating whether it's worth showing up\nAt the polls in November\nStewart is a local government official and a strong supporter of President Trump he's proud of stirring up Virginia politics\nOr speak their mind and some people are afraid of controversy when they run for the hills of the first chance that somebody talked about something that's controversial I'm not like that but\nThose tactics have improved popular with most Virginia voters incumbent Democrat Tim Kaine has held a consistent double digit lead in the polls nationally Republicans don't expect the race to affect the balance of power in the Senate\nThe worry now is whether it could affect the balance of power in the house as many as four Republican controlled house seats in Virginia could be in play this election Democrats need to win twenty three seats to take the house Stephen Farnsworth is a professor of political science at the University of Mary\nWashington stewardess only collecting about eighty percent of the people who identify as Republicans\nFarnsworth says this close to election day eat expects that number to be above Ninety percent and\nThat lower level of support for Corey Stewart may mean at some Republicans will stay home and maintain some Republicans will donate money means of some Republicans won't show up to knock on doors\nAnd every door knocked every call made every dollar spent could make the difference [noise] one of those close races is in Virginia's ... district\nA recent debate between Democrat Leslie Coburn Andrew Republican Denver Riggleman was held in a high school auditorium Jim Smith is vice chair of the Madison County Republican committee he shrugs off the idea that Stewart's unpopularity could affect other candidate\nGeorge Wallace Charlotte in bed with one on one or a job\nIt's in Virginia the fifth district\nA recent debate between Democrat Leslie Coburn Andrew Republican Denver Riggleman was held in a high school auditorium Jim Smith is vice chair of the Madison County Republican committee he shrugs off the idea that Stewart unpopularity could affect other candidate\nGeorge Rock solid and that was one on one was for a job for individual liberty and that's really what we should be all about\nStewart has mostly been campaigning alone and other Republican House candidate has largely been avoiding him Denver Riggleman the GOP candidate in this district says the Stewart campaign has no impact on him positively or negatively\nCorps and the trailer me great you know but right now I just stay with his busy schedule he's not going to be able to do that\nAll men and other Republican House candidates say they're focusing on their own race in this final stretch to election day for NPR News I'm Mallory Noe Payne in Madison, Virginia\n[noise]\n[noise] this is all things considered from NPR News\n[noise] extra tuning in for all things considered here on Ninety One point five years you see just getting started\nWith today's program the bitter fight over Brett Kavanaugh's confirmation may give the Republicans a boost in the mid term elections\nSome of the data we've seen or heard about over the last ten days suggest that this is energizing them in a way they weren't before\nWe'll hear more on the political affects the Kevin ... of the care of a controversy that's in the next half hour of all things considered following headline news and for all six of\nThe United states will withdraw\nFrom the Paris\nFrom logged me in makers of go to meeting that collaboration meeting platform allowing people to connect around the globe to get work done learn more it go to meeting dot com [noise]\nAnd from listeners like you who donate to this NPR station\nThank you thank you for supporting southern Colorado's NPR station K. R. C. C. care C. C. H. D. Colorado Springs ... hunter Casey a structural and K W CCF em woodland park also streaming a key or C. C. dot O. R. G.\nOn Ninety One point five K. R. C. C. is supported by Colorado State university global campus in online State University offering career development through bachelor's degrees and master's\nIt was like you who donate to this NPR station\nThank you thank you for supporting southern Colorado's NPR station K. R. C. C. care C. C. H. D. Colorado Springs K. E. C. C. log on to Casey a structural and K W cc FM woodland park also streaming a key or C. C. dot O. R. G.\nProgramming on Ninety One point five K. R. C. C. is supported by Colorado State university global campus in online State University offering career development through bachelor's degrees master's degrees answer typical of completion more at sea as you global dot edu\nBy the Colorado health foundation committed to advancing and improving health care for Colorado communities more information on the Colorado health foundation and their core principles is available at Colorado health dot org\nHeadline news from NPR coming up next lots more all things considered we'll check in for the marketplace tech report at four thirty forty six degrees meanwhile in the downtown area at four o'clock [noise]\nAll over the country or rallies\nAnd people are\nLoving that man and loving ... said that and try to take credit for winning the bitter fight over Brett Kavanaugh's confirmation to the Supreme Court it's Monday October eighth and this is all things considered\nI'm Out the saying this hour we look at how fallout from Kavanaugh's confirmation could reshape the mid term elections that take in the house has already bake but I really think the biggest impact is going to be felt in the Senate also secretary of state Mike Pompeo ramps up the trip to Asia\nThey talk to North Korea seemed promising but when ... stopped over in Beijing Chinese officials had tough words for the U.S\nAnd the pop star Taylor Swift was long silent on politics until yesterday she changed course to endorse to tendency Democrats\nHonestly and an area where I don't know if anything can surprise me any more that's really a surprise to me now that means\nFrom NPR News in Washington I'm jak spear\nSaturdays limousine crash in upstate New York is an ongoing criminal investigation that's according to police and the national Transportation Safety board\nInvestigators are still piecing together what happened in that crash in school Harry that left Eighteen people in the limousine and two ... dead the driver wasn't properly licensed in the vehicle had failed to safety inspection NTSB chairman Robert Sumwalt says it's\nI don't know if anything can surprise me anymore that's really a surprise to me now that he's\nLived from NPR News in Washington I'm jak spear\nSaturdays limousine crash in upstate New York is an ongoing criminal investigation that's according to police and the national Transportation Safety board investigators are still piecing together what happened in that crash in school Harry that left Eighteen people in the limousine and two ... dead\nThe driver wasn't properly licensed in the vehicle had failed a safety inspection\nNTSB chairman Robert Sumwalt says his agency is questions for owner prestige limousines\nCompanies safety culture\nThe company's records\nRecords of prior clashes their management of drivers their fatigue management program vehicle maintenance fitness for ... driver fitness for duty we want to look at everything that we can related to the company that operated that lemons and\nCrush occurred in front of the store as a limo was ferrying people to a thirtieth birthday celebration Bradley ran a stop sign just prior to the crash the death toll from a powerful earthquake and tsunami that struck central Indonesia almost two weeks ago was nearing two thousand years NPR's Lauren Frayer official\nSay up to five thousand people may still be buried under rubble that earthquake triggered mudslides wiped out three big neighborhoods\nAnd their bodies may never be found the government says it plans to call off all searching by Thursday and its considering declaring those three neighborhoods as national memorials which may never be inhabited again\nThat strong some criticism from survivors who want to locate the remains of their loved ones across Polly people are still sleeping in tents even if their homes are intact for fear of aftershocks\nElectricity is coming back on and military planes landing at the damaged airport delivering aid Lauren Frayer NPR News Sao paolo Indonesia\nTomorrow President Trump traveled to Iowa for a campaign rally NPR ... report trouble crisscrossed the country this week to build support for Republicans ahead of November's midterm\nTrump will travel to Iowa at Pennsylvania Ohio and Kentucky he's expected to tell the economy and urge voters to head to the polls in November over the weekend at a rally in Kansas Trump celebrated Kavanaugh's confirmation and ramped up his attacks on Democrats\nIs doing our son is doing left wing mob\nSam report Trump will crisscross the country this week in an effort to build support for Republicans ahead of November's midterm\nTrump will traveled to Iowa at Pennsylvania Ohio and Kentucky he's expected to help the economy and urge voters to head to the polls in November over the weekend at a rally in Kansas Trump's celebrated Kavanaugh's confirmation and ramped up his attacks on Democrats\nAnd is doing arson is and you don't give you an left wing mob and that's what [noise]\nFour hundred and thirty five members at the house are up for reelection and one third of the Senate one hundred seats while also being on the line Democrats need to win twenty three seats to gain control of the house ... NPR News Washington\nWhat is now hurricane Michael is lashing the western edge of ... but it could pick up strength as it heads toward the U.S forecasters say could be a major category three hurricane when it hits us mainland on Wall Street Journal mix clothes that were thirty nine points\nThe NASDAQ was down to fifty two points this is NPR\nUnited Nations secretary general Antonio terrorists as he is very concerned about the disappearance of a Saudi journalist in Turkey as well as possible violence against other journalists\nTurkish officials claim without signing a any evidence that ... show via contributed to the paper was killed ... shouted constantly is stumble on his body was laid to remove from the building\nSaudi officials deny the claim saying ... left the building voluntarily\nScientists say they've identified the first genes linked to Iraq's all dysfunction as NPR's Michaeleen Doucleff reports the findings could help with the development of new treatments\nErectile dysfunction is extremely comment it affects about twenty percent of men over each forty scientists have known for a long time that genes can affect a man's risk for the problem but it's been difficult to pinpoint which genes are most important\nNow scientists at Kaiser Permanente northern California are starting to change that the teen analyze genes for more than thirty six thousand men in found one little piece of DNA which raises a man's risk by about twenty five percent\nTo scientists think the DNA influences neurons in the brain that control sexual function the findings which appear in the proceedings of the national Academy of sciences offer clues to what causes reptile dysfunction in a new strategy for developing drugs to stop it\nMichaeline do class NPR News\nMany Americans have historically retired by age sixty five nearly one in five people that age are still on the job new data also shows in many cases\nGenes for more than thirty six thousand men in found one little piece of DNA which raises a man's risk by about twenty five percent\nTo scientists think the DNA influences neurons in the brain that control sexual function the findings which appear in the proceedings of the national Academy of sciences offer clues to what causes a reptile dysfunction in a new strategy for developing drugs to stop it Michaeline do class NPR News\nWhile many Americans have historically retired by age sixty five nearly one in five people that age are still on the job new data also shows in many cases older Americans with higher education levels like a college degree are finding it easier to work past or traditional\nRetirement age I'm jak spear NPR News in Washington\nSupport for NPR comments from NPR stations other contributors include the Robert Wood Johnson Foundation working alongside others to build the culture of health that provides everyone in America a fair and just opportunity for health and wellbeing more at our W. J. F. dot ORG China has become\nThe biggest lender to governments in Africa critics say many of those countries are now at risk of credit crisis that story coming up at four twenty as we continue with all things considered Iran Ninety One point five years you see\nProgramming on Ninety One point five to your cc is supported by ... credit union and business banking is committed to comprehensive solutions to help solve small business challenges including business checking details at ... dot com slash business checking federally insured by ...\nThis is all things considered I'm outfit Chang\nPresident Trump hosts the swearing in ceremony tonight at the White House where the newest justice on the Supreme Court\nBrett Kavanaugh will be on the bench tomorrow when the Supreme Court hold oral arguments he was confirmed over the weekend on a narrow party line vote and today the president told a group of law enforcement officers in Florida that Kavanaugh's rise to the high court gives Republicans a political boost all over the\nCountry I'm doing rallies and people are loving that man and loving that yours\nWill have more on how the political battle over canonize affecting the mid term elections in a bit but first let's go to NPR's Scott Horsley Hey Scott I also see a picture of how Kavanaugh's presence on the court will will shift the decisions will the over the next few decades potentially\nWill certainly shift the courts are right remember he was chosen from a list of judicial candidates drawn up by the federalist society and the Heritage Foundation\nHis rise to the high court dance Republicans a political boost\nAll over the country I'm really rallies and people are loving that man and loving that you as well\nHave more on how the political battle over canonize affecting the mid term elections in a bad but first let's go to NPR's Scott Horsley have got high of a picture of how Kavanaugh's presence on the court will will shifted to the ... the over the next few decades potentially\nHe will certainly shift the court to the right remember he was chosen from a list of judicial candidates drawn up by the federalist society and the Heritage Foundation\nA list of reliable conservatives and that's something you couldn't always say about the justice he'll be replacing Anthony Kennedy\nKennedy of course was a Reagan appointee and generally conservative but he occasionally did side with the liberal wing of the court most famously on a string of gay rights cases but also for example in reaffirming the right to abortion\nKavanaugh is expected to be much more conservative than Kennedy and that leaves chief justice John Roberts now as the pivot point on the court to that's right [laughter] it'll be up to robbers to decide how much judicial restraint to exercise and then that will determine whether this\nShift is a gradual series of rightward steps or one big leap\nDo you think they're very bitter confirmation fight we saw over the last several weeks had damaged the course reputation as a political body\nIt it certainly has the possibility to do that now we're going to have five conservative justices all appointed by Republican presidents four liberal justices all appointed by Democrats and\nTo the extent their decisions divvy up along those partisan lines the court runs the risk of being seen as just another political branch of government snapped by partisans in robes rather than a an impartial body that somehow above politics\nAnd it certainly doesn't help the Kavanaugh is confirmed by that extremely narrow vote with just one Republican one Democrat breaking ranks and the Senate\nThis is the case for the Laurie Cohen charitable trust\nMy good friend Dr lord Cohen asked me to help finish some task for her lawyers gift to the care cc legacy fun helps perpetuate knowledge and understanding of the world she so cherished she would encourage others to join her in this effort to help make the community she loved and lived in a better place\nInformation on the ... legacy fund can be found at our website ... seat died or G.\nThis is how the black host of looking up the nerd show on astronomy here on Ninety One point five K. R. C. C. where every Monday at nine AM and nine PM an additional shows are archived\nHelp finish some task for her lawyers gift to the care cc legacy fund helps perpetuate knowledge and understanding of the world she so cherished she would encourage others to join her in this effort to help make the community she loved and lived in a better place\nInformation on the ... legacy fund can be found at our website ... seat dot org G.\nHi this is how big black host of looking up dinner joined astronomy here on Ninety One point five K. R. C. C. we're every Monday at nine AM and nine PM and additional shows are archived at K. R. C. C. dot org and available and I tunes remember keep looking up\nNPR on Ninety One point five to your cc you supported locally buy seeds consulting the prophet carry offering herbal formula was prepared on sites such as intestinal sued and ... which are balanced digestion consultations and class was available at twenty seven twenty seven north to ...\nA a\nCloudy and gray forty five degrees currently here in downtown Colorado Springs at four twenty\nSupport for NPR comes from this station and from the main office of tourism offering travelers an opportunity to explore and discover their very own main thing to be inspired the original and be yourself at visit main dot com [noise]\nFrom Amazon Web services used by millions of customers a W s provides a range of cloud services and functionality from tools to security to compliance more information at build on dot a W s\nAnd from the any case the foundation from NPR\nNews this is all things considered ... Chang China has become the biggest lender to governments on the African continent over the past decade the money has helped build ports roads bridges airports and trains and he's our infrastructure projects that might have it never happened without China\nBut critics say the loans are full of traps that could leave African countries mired in debt and beholden to the Chinese NPR's Eyder Peralta brings us the story of one big project in Kenya [noise]\nI certainly journey in Nairobi where the train station is quite easily the most impressive public building in the country it's modern with ambition sloping lines the train runs from the capital city to Portland bus up and represent the biggest infrastructure ...\nHappen without China but critics say the loans are full of traps that could lead African countries mired in debt and beholden to the Chinese NPR's Eyder Peralta brings us the story of one big project in Kenya [noise]\nMy survey journey in Nairobi where the train station is quite easily the most impressive public building in the country it's modern with ambitious looping lines\nThe train runs from the capital city to the portable boss up in represents the biggest infrastructure project since independence for Kenya it was funded entirely with a three point two billion dollar Chinese loan a Chinese company built it then the Chinese will operated for many years to come\nIs hard to forget at the entrance of every single wagon the Kenyan flag is flanked by a Chinese flag and as soon as I sit down here to strangers having a spirited argument about Chinese involvement\nIn\nThe jungle a marketing executive says Kenyans can learn something from the Chinese they built nearly three hundred miles of rail ahead of schedule he says he would drive past the construction site some times and he saw the Chinese working non stop\nAnd they would see how nice and some people walking in the ... anything leading me I didn't see the the heat on the last one it's a\nWhole trip that turned a poor country into an industrial powerhouse says and Kenyans would be wise to pay attention lately that faith can do a lot in a lawyer interrupting she says Kenyans do not want Chinese culture\nYou know we've got people that they should just be left him in jail in\nThe jungle is unconvinced opinions like to talk he says he liked to take breaks Chinese are not likes that\nLeaves the animal idle time not enemy ... title these man be matching\nAs he talks another lady across from him jumps into the conversation\nWas going on\nIn case you didn't hear it she says this guy is colonized what you don't know\nJungle is unconvinced Kenyans like to talk he says they like to take breaks Chinese are not likes\nThat leaves the only time enemy ... he's a man be matching\nAs he talks another lady across from him jumps into the conversation\nWith you in\nCase you didn't hear it she says this guy is colonized\nWhat you do know is that when I wrote this train Kenyan media had been full of news stories about the real way\nThey had shown pictures of Kenyans being physically punished by Chinese managers they reveal that the only time a Kenyan worker had taken control of a locomotive was a year ago on opening day\nThey also raise questions about how costly this thing had been and how can you may not be able to repay\nThe Chinese [noise]\nBut suddenly we look out the window at the vastness of south of national park\nAnd in the distance which the elephant they do need to look at that and the acrimony over the Chinese and over the spending it melts [laughter] what's happening here in Kenya is happening across the continent\nInternational Monetary fund says forty percent of sub Saharan countries are at risk of debt distress and China is playing a big role they've handed out billions for projects and places like Ethiopia Guyana and Mozambique that no one else would touch\nIt means Ethiopia got a new rail line to the port of Djibouti in Guyana has an expressway but\nThere are also worries\nBy some estimates the Chinese loans have bumped up Djibouti debt to GDP ratio from fifty ... eighty five percent only between the years of twenty fourteen to twenty sixteen so we're talking about a lot of money over to China\nThat's grant T Harris a former Africa advisor to President Obama he says these Chinese loans are also very different from other international loans because the terms are often secret\nWhat we do not have transparency on is what really is the collateral and the very scary case in point is true longer\nJust at the end of last year ... founded ... struggling\nFrom fifty eighty five percent only between the years of twenty fourteen to twenty sixteen so we're talking about a lot of money over to China\nThat's grant ... Harris a former Africa advisor to President Obama he says these Chinese loans are also very different from other international loans because the terms are often secret\nWhat we do not have transparency on is what really is the collateral and the very scary case in point is true longer\nJust at the end of last year ... co founded soap struggling to pay back its debt so they tend to China a strategic port on the Ninety nine year lease so what happens is Judy can't pay back its support what happens in Kenya can't pay back its train\nThe s GR on sets it wearing a development economist here in Kenya says the problem is we don't know\nAs a public intellectual analyzes African and Kenyan economy on a weekly basis at no point that come across a document that can say oh so that's what he has to be honest about\nWe asked the Kenyan government what happens in case of default but they would provide no concrete answer\nWhereas these types of deals worked for many governments they let them build visible projects that helps him win elections and they are also clearly the source of income for corrupt politicians and their supporters but lately here in Kenya there has\nBeen public outcry African governments need be happy with the city but African public's I'm not and fundamentally the sentiments on the grounds is really going to inform how successful then how well received their initiatives are in the country as a [noise]\nAre trained makes that much time to my boss up strategically important port on the Indian Ocean\nWe drive out of the station onto the wetlands across tall bridges on brand new paved roads all made by the Chinese\nChinese workers zoomed past us pickup truck goes or houses there too and also to the sides behind twelve foot fences and guard towers we see apartments threat lanterns tell us they are Chinese dwellings\nWe end up at the top of a bluff Charles door is a driver like a lot of others here he thought he'd one day be working on the railroad but these days he says he's not even allowed in the gate to try to find work I asked him if he's ever spoken to one of the ...\nA Chinese workers zoomed past us pick up and try and think those are houses there and to me and all the sides behind twelve foot fences and guard towers we see apartment threat lanterns tell us they are Chinese dwellings\nWe end up at the top of a bluff Charles ... door is a driver like a lot of others here he thought he'd one day be working on the railroad but these days he says he's not even allowed in the gate to try to find work\nI ask him if he's ever spoken to one of the China is\nThat when they were there while they are now\nHe says the Chinese have type cast them they think that all Kenyans are good for it to clean or to move rocks for construction\nSo really with it but it was a dog on the Web and don't see that a good one does that what you know we've got that right or do we got no more than what they're doing there\nHe feels like something that was supposed to bring jobs that was supposed to bring pride instead belongs to someone else in ... to NPR News ...\n[noise] ... [noise] ... [noise]\nTomorrow we continue our series on how China is changing the world will visit in Mandarin Chinese language school in Pakistan [noise]\nWhy oh why we named him learning\nChinese so that I could have got a job has been my brothers and sisters to get aid to fish here how China is making cultural inroads into Pakistan transforming and decades old strategic relationship between the two countries that's tomorrow here on all things considered [noise]\nSome supporters of the president paint a different picture if the Republicans lose the house they say Trump could use the Democratic speaker Nancy Pelosi or her successor as a foil and cruise to re election way Bill Clinton and Barack Obama did the Corey Lewandowski isn't buying it\nI've heard people say that and whoever says that you'd be summarily fired because clearly\nThey had no understanding of how politics works I think this president and his agenda and what he's been able to accomplish he's only been able to do because the Republicans have been in office\nOne thing both Democrats and Republicans agree on is that this White House is just not prepared for the consequences of losing former Bill Clinton advisor Paul the Gallup says no White House\nTrump could use the Democratic speaker Nancy Pelosi or her successor as a foil and cruise to re election way Bill Clinton and Barack Obama did with Corey Lewandowski isn't buying it\nI've heard people say that and whoever shows that you should not only fired because clearly they had no understanding of how politics works I think the president and his agenda and what you've been able to accomplish he's only been able to do because the Republicans had been in office\nOne thing both Democrats and Republicans agree on is that this White House is just not prepared for the consequences of losing former Bill Clinton advisor Paul the Gallup says no White House really is\nThey have no idea what it feels like I Do real fifty six Estes going up on what people would have felt like when there were sixty three [noise] it's a gut punch there's a very real psychological and political price part\nOf that price the rock solid hold President Trump has on the Republican Party in Congress could be shaken\nTalk rules his party by fear they're going to see him a lot less if they get their butts kicked he loses so much\nSo for Donald Trump whose entire persona is about always winning the November election could be the first time he's a loser or not Mara Liasson NPR News\nWe may not know what's gonna happen in the November midterms but we do know one thing Taylor Swift is voting Democrat\nIn a lengthy social media posts on Sunday the pop superstar explained why she would be supporting Democrats filled bread is in for Senate and Jim Cooper for the house she also slammed Republican congresswoman Marsha Blackburn for her record on women's and el GB he writes\nAnd all this from an artist who has famously refused to talk politics in the past we reached Emily ... of the Washington Post who's been following all of this welcome Hi so how on earth shattering is is to see Taylor Swift makes some political endorsement\nHonestly and an area where I don't know if anything can surprise me anymore and really a surprise tell me why the shock yeah so I think it surprised me and a lot of people because after the last few years there has kind of been\nA steady drumbeat to get Taylor Swift to sort of say anything political anything about the current environment and she never has and then all of a sudden Sunday she drops at Instagram poets that that really lengthy almost like scorched earth a post about how she really feels about the upcoming mid terms and I was just not expecting that\nWhat's the response than like from her fans\nThere were I don't know if anything can surprise me anymore really a surprise tell me why the shock yeah so I think it surprised me and a lot of people because ah for the last two years there has kind of been\nSteady drumbeat to get Taylor Swift just sort of say anything political anything about the current environment and she never has and then all of a sudden Sunday she drops Instagram poets that they're really lengthy owns like scorched earth a post about how she really feels about the upcoming\nMid terms and I was just not expecting that what's the response been like from her fans [noise]\nI've seen a lot of support from people who were honestly just glad she said anything I mean she has a hundred and twelve million Instagram followers and a lot of people that would really look up to her so there's a lot of support there is also of course there's kind of his movement that has always thought maybe she was secretly a conservative just because she never said\nAnything so [laughter] they kind of had read into a lot of things she had never even said that their them disappointment on that site today well you tell us with\nDid start out as a country music star which is a world that leans conservative but she's more of a pop star now so does have a broader fan base kind of free her to take more left leaning political\nPositions now I think it did\nIn some ways because when she made the break from Nashville in kind of declared herself going to the pop world she didn't have to worry as much about you know country radio which still drives so much of the country music industry now her songs are being played on pop radio and\nShe'd have a broader audience I feel like it may have trapped her a little bit in the way that because she still has his country than she did still want to appeal to them\nBut I think she probably didn't feel more free overall to share opinions\nYou know she has a reputation for being extremely calculated when it comes to cure reading her image so what do you think why jumped into politics now what do you think is going on with her\nAnd this is what I've been trying this is the mystery of the day and I always had that I had her mind from Italy exactly\nTaylor Swift always seems to be like twenty steps ahead of everyone else no matter what she does everything kind of have like a double or triple meaning when you really look at it\nI think in this case the timing probably was pretty strategic she just wrapped up her stadium tour in the United states you know she's done with their concert she doesn't need to think about the backlash for any of that so she\nPosted her message after that she kind of a looted and her statement to events that have happened to her in the last couple of years and that's why she was speaking out\nThat I had her mind for me it laid\nBack like Taylor Swift always seems to be like twenty steps ahead of everyone else no matter what she does everything kind of have like a double or triple meaning when you really look at it\nI think in this case the timing probably was pretty strategic she'd just wrapped up her stadium tour in the United states you know she's done with their concerts she doesn't need to think about the backlash for any of that so she posted her message after that\nShe kind of alluded in her statement to events that have happened to her in the last couple of years and that's why she was speaking out\nUnless you didn't say what those were um I think a big one that's impacted her the most with her sexual assault trial when a country music DJ sued her after he lost his job because she said he groped her in a meet and greet line\nWhen she counters sued him for assault and battery and she ended up winning and I think that experience really really left a mark on her\n[noise] Emily yard is an entertainment reporter for the Washington Post thanks very much for joining us today hate thank you\nWell this is all things considered from NPR News\nJust two days before saxophonist and composer\n... went into the studio to record his new album Hurricane Maria hit his native island of Puerto Rico [noise]\nDuring session breaks the known called family and friends for news about the devastation back home NPR's Michel ... says\nThe resulting album your soil out through his own or I Am the tradition has the MacArthur genius his trademark originality but the natural disaster also gives it emotional urgency\nMcGehee known had already planned for his eleventh album to shed light on Puerto Rico he's recorded many adaptations of its folk music in the past in this new eight parts sweet for saxophone and string quartet he showcases a different cultural tradition in each piece\nThis one Rosario is inspired by the rules are traditionally said on full instruments at funerals and other occasions\nThey know it's always a soulful player but with the hurricane hitting so close to the session his performance here with the spectral cortex\nTook on special feeling they play his adaptations intense rhythmic interaction\nAnd soaring melodies\nHe showcased in a different cultural tradition in each piece\nThis one Rosario is inspired by the rules are\nTraditionally said unfold instruments at funerals and other occasions\nThey know it's always a soulful player but with the hurricane hitting so close to the session his performance here but the spectral cortex\nTook on special feeling they play his adaptations intense Rudnick interaction\nAnd storing melodies as a fervent prayer\nThey know is blurring minds here between jazz classical and Puerto Rican folk music\nFor that name she finds Manchester City the spectral and engaging quartet well versed in contemporary views and\nThey no one's classical minimal with them can be complex\nWith such skilled musicians playing their hearts out though even dance idea unfold in a graceful down\n\nMm I'm\nThe most bucolic sign on the album be any hope is based on the type of rural folk music they know saxophone goes to cinematic here gliding above the streams and sweeping down to move among\nThe\nIt does if he's in treating us to take a closer look at\nWith you saw a lot to do you see him\nAnd the gals they known isn't just leaving them\nSweeping down to move among\n\nIt does if he's into reading I take a closer look at\nWhen you saw in ...\nAnd again they known isn't just leaving a musical flags for Puerto Rico\nHe's composed deep tradition into new musical landscape and recording so soon after Hurricane Maria hit\nThe resulting album is an imaginative and heartfelt tour of his home and [noise]\n\n... is ... through DC on our reviewer was Michelle Mercer\n[noise]\nThis is all things considered from NPR News and this is Ninety One point five ... southern Colorado's NPR station a new un climate report urges international leaders to address climate change much more originally\nWhat we need to do is to define where there's progress to date and identify opportunities for accelerating those processes\nAccording to the data climate change could cause mass of food shortages wild fires and drought spy the you're twenty forty that story right after headline news from NPR at five or six\nThere are so many ways to listen to Ninety One point five K. R. C. C. sooner than on uranium three months on line and K. R. C. C. dot org tell your smart speaker to play NPR or listen with a free mobile app radio for home work and play\nThis is southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs Kate ... hunter Casey CEO struck Phil and K W CCF am woodland park also on line and care she see down a large ...\nMore than a thousand people died of drug overdoses in Philadelphia last year\nMinutes with one hand gobble Suchet state of prep work like chopping and marinating this week's menu is at ... dot com slash NPR\nThis is southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs Kate easy see the hunter Casey she has struck fail and K W C. C. F. M. woodland park also on line and K. R. C. C. dot O. R. G.\nMore than a thousand people died of drug overdoses in Philadelphia last year\nWas the highest rate per capita of any big city in America we've got to do something to stop in\nThe city now plans to open a facility for people to use illegal drugs under medical supervision that story coming up in twenty minutes five twenty as we continue with all things considered this afternoon on Ninety One point five K. R. C. C.\nHey thanks for listening this is David Draine ... Stevens I'm Rachel Martin say there is Joshua Johnson the host of one egg and I'm Abigail vaccine joined me and my co host weekday morning for news and cultural coverage on Ninety One\nPoint five K. R. C. the Hi this is how the black host of looking up the nerd show on astronomy here on Ninety One point five K. R. C. C. where every Monday at nine AM and nine PM an additional shows are archived at K. R. C. C. dot org and available and I tunes remember keep looking up\nProgramming on Ninety One point five K. R. C. C. is supported by silver key providing adults aged sixty plus with a variety of services\nIncluding freshly prepared food and conversation at silver the connections cafe meals sites silver key dot org or eighty four to three zero four\nBy old world bagel in Delhi featuring New York style boiled bagels made in house daily and a breakfast and lunch menu to pick up or eat in from sandwiches to salads old world ... located one block west of self circle and by twenty five\nA pair of four is on the Ninety One point five care cc thermometer here in downtown in Colorado Springs have five oh one headline news from NPR's coming up next or all things considered on the local evening news cast for you at five thirty to\nLive from NPR News in Washington I'm jak spear\nPresident Donald Trump spent time today talking with his deputy attorney general Rod Rosenstein in at least for the moment that appears the president does not intend to fire him Rosenstein ... tenure at the Justice Department has been viewed as somewhat tenuous central moxie as opposed to it made about ... secretly will cost\nOne point five ... seats in ... in downtown Colorado Springs had five oh one headline news from NPR coming up next we're all things considered the local evening newscasts for you at five thirty to\nLive from NPR News in Washington I'm jak spear\nPresident Donald Trump spent time today talking with his deputy attorney general Rod Rosenstein at at least for the moment it appears the president does not intend to fire him\nRosenstein ... tenure at the Justice Department as ... to somewhat tenuous central mark she is supposed to have made about ... secretly recording the president or invoking constitutional powers to have Trump removed from office\nBut the president getting off marine one up this afternoon told reporters that status quo for now\nI'm not making it it gives me the person I'm not making any\nRosenstein who oversees special counsel Robert Mueller's Russia probe is denied the reports he and Trump spoke aboard air force one earlier today on route to Florida for a speech to police chiefs\nPop star ... Taylor Swift designing her voice little political dialogue in an Instagram posed Swiss says she cannot support Marsha Blackburn Republican congresswoman wanting for US Senate from Tennessee instead switch says she'll vote for Democrats and ... reports\nSwitches urging her fellow millennials to vote and said she would be casting a ballot for candidates to fight for human rights and support ... racial and gender equality blink can our men at the Tennessee and Democrats say swift could have a big influence on getting young people who are now young voters with jobs student loans and mortgages\nTo see themselves as part of the political process\nWhereas before we never thought that we can make an impact now we have no choice but to have the option to try to make an impact\nThat tendency and Republicans say swift book sway many young voters do hope more cast ballots in November chanted and sent NPR ...\nFlorida's panhandle is bracing for the impact of hurricane Michael which became a category one storm today shelters will begin opening tomorrow wind daily reports Tallahassee is mayor Andrew Gillum is urging precaution\nTallahassee mayor Andrew Gillum says north Florida has been battle tested through two major hurricanes in recent years including Irma in two thousand Seventeen but he says the state's panhandle region should brace itself or an even stronger storm with Michael and Florida's capital city the mayor expects widespread power outages for those\nWithin rely on our electric utility system for their livelihood or we would recommend that day or find a safer place\nReports Tallahassee as mayor Andrew Gillum is urging precaution\nTallahassee mayor Andrew Gillum says north Florida has been battle tested through two major hurricanes in recent years including our mind two thousand Seventeen but he says the state's panhandle region should brace itself for an even stronger storm with Michael and Florida's capital city the mayor expects widespread power outages for those\nWho within rely on our electric utility system for their livelihood or we would recommend that day or a find a\nA safer place to ride out the mandatory evacuations have been called in some coastal counties Michael is expected to make landfall Wednesday for NPR News I'm Ryan daily in Tallahassee\nTo Americans or this year's recipients of the Nobel Prize in economics one for studying the economies of climate change the other for showing how to help foster innovation needed to solve a problem world Swedish Academy of Sciences says William ... of Yale and Paul Romer of New York university will share that just over one million dollar award\nIMAX clothes on Wall street today the Dow was thirty nine points twenty six thousand forty six the NASDAQ fell fifty two points this is NPR\nIn South Carolina hundreds gathered to say goodbye to a police officer who was killed in the line of duty he was one of seven ambushed and shot when trying to conduct an investigation and possible the issue a search warrant from South Carolina Public radio ... more\nFamily friends any very large law enforcement community remembered sergeant parents Carol a as a great family man a mentor to kids in the community any dedicated officer from the fraternal order of police Tammy gaining\nLast Wednesday to my friend has it made it through the media somebody calling for what she was she was she wrote long before last Wednesday\nHeroin was killed on October third when he and three other foreign city officers try to rescue for county deputies who were ambushed in a neighborhood for officers are still hospitalized for NPR News I'm Felicia eating\nA new United Nations report out today says cutting the global temperature by just to greet could mean the difference between life and death for many people and ecosystems with a scientist behind the report also say there appears to be little hope the world will rise to the challenge\nFor it by the Intergovernmental Panel on climate change says nations of the world have set a goal of limiting warming of the planet the one point eight degrees Fahrenheit but scientists\nAll their Florence city officers try to rescue for county deputies who were ambushed in a neighborhood\nFor officers are still hospitalized for NPR News I'm Felicia eating a new United Nations report out today says cutting the global temperature by just a degree could mean the difference between life and death for many people and ecosystems with a scientist behind the report also say there appears to be little hope the world will rise to the challenge\nFor by the Intergovernmental Panel on climate change those nations of the world have set a goal of limiting warming of the planet the one point eight degrees Fahrenheit but so I just said it'd be a big difference even if I go where the cut in half reducing the number or the global temperature rather would mean fewer heat waves downpours and extinctions as well as less sea level rise\nGlobal futures prices fell slightly or was\nDown to Seventy four twenty nine a barrel I'm jak spirit NPR News in Washington\nSupport for NPR comes from the alliance for lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for a lifetime income dot org\nSix minutes after five o'clock that evening I'm like for self thanks for joining in for all things considered this afternoon\nLots more of the program to come have the local evening newscasts at five thirty to get her feet you report from Abigail back men on the motor this morning and guarding the gods park yesterday that's coming up at five forty four\nAgain appear force on the uh Ninety One point five care cc thermometer here in the downtown area looks like a cool and cloudy and wet start to the week\nIs all things considered from NPR News I'm ousted Chang and you climate report commissioned by the United nations paint a pretty dire picture for the year twenty forty\nHigh food shortages wildfires droughts rising sea levels poverty and massive destruction to coral reefs previous research predicted these effects if the earthworms by two degrees Celsius\nBut this report finds the consequences could actually come much sooner when the earthworms by one and a half degrees Celsius which is on track to happen in just about Twenty years\nThe un included data from over six thousand scientific studies and one of those studies came from the nonprofit think tank climate interactive where Andrew Jones is co founder welcome thank you thank you Elsa\nOf destruction to coral reefs previous research predicted these effects that the earthworms by two degrees Celsius\nBut this report finds the consequences could actually come much sooner when the earthworms by one and a half degrees Celsius which is on track to happen in just about Twenty years\nThe un included data from over six thousand scientific studies\nAnd one of those studies came from the nonprofit think tank climate interactive where Andrew Jones is the cofounder welcome thank you thank you also still it just made it clear this report is predicting really the same consequences of climate change that previous reports had been predicting but this report says the consequences will happen sooner\nYeah that's the basic idea and when I read it for the first time I was struck with the urgency and they really laid out with such precision the hearing now element of this problem and not do it for the grandkids\nSo many of these effects that you just mentioned hit around twenty forty Elsa you when I plan to be here around twenty orderly do yeah so what this is a kind of hearing now impacts at the scientists were writing about\nWhat would it take to avert this I mean this report is saying we basically have a deadline coming up in about Twenty years are are real changes feasible within that timeframe\nAbsolutely like this you hear some of those studies ... it makes you think\nGosh I just want to hide under the covers and\nWatch them Netflix but if you think about it facing this kind of impossibility is really some extent what humans were made for and the report lays out really well if we're willing to take on the kind of efforts that we have in the past and\nHumans have done it also and in World War two\nFlying to the moon yeah rebuilding Europe after the plague took out of I don't last that\nWas going to point out you wrote an op ed in the New York times the other day when she compared to seemingly insurmountable task of confronting climate change to to things like winning World War two or achieving civil rights but was that supposed to be reassuring because you do make the challenge seem awfully daunting\nWhat oil prices were low like there were a couple of years ago the drillers in Kansas pretty much just started shutting thing that everybody thought it would be over in a couple you know ten eleven months but once it hit that first year in the second year whatever it was tough\nGuy result Boyle is low no longer\nIn the whole Kansas economist is a benefit that's Exxon a marketplace\nEvening edition of marketplace with Congress coming up in just a little over an hour six thirty right after all things considered here on Ninety One point five care CC\nWill prices were low like they were a couple of years ago drillers in Kansas pretty much just started shutting things that\nEverybody thought it would be over in a couple of you know ten eleven months but once it hit that first year in the second year it was tough\nOn ... result oil is low no longer\nAnd the whole Kansas economies did the benefits that sticks on a marketplace\nThe evening edition of marketplace with Karl ... coming up and that just a little over an hour six thirty right after all things considered here on Ninety One point five care cc\nProgramming on Ninety One point five to your cc is supported\nBy printing unrealistic Reuben later\nHelping visitors fulfilled dreams of mountain living in St Louis county and the surrounding region from land and ranchers to vacation homes and long term rentals information and more at putting in real estate dot com\nBy the Colorado Springs school hosting a pre K. through twelfth grade open house in school showcase featuring the arts and sciences and family entertainment Saturday November tens one to four pm\nMore at the ss dot org\nForty four degrees here in the downtown springs area at five twenty all have the local evening newscast coming up at five thirty to\nSupport for NPR comes from the station and from the log me in makers of go to meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more it go to meeting dot com [noise]\nFrom exact science is offering color guard for average risk adults over fifty a non invasive colon cancer screening test that can be used at home by prescription only information at color guard test dot com and from the listeners who support this NPR station from\nNPR News this is all things considered ... Chang Philadelphia is getting closer to opening what maybe the country's first facility where people can use illegal opioids and other drugs all under medical supervision\nAnd nonprofit has formed to launch the so called supervised injection sites as Bobby Allyn of member station WHYY reports Trump ... officials are watching and promising crackdown\nEarlier this year officials in Philadelphia have been studying the idea of a supervised injection site where those struggling with addiction bring their own drugs and use under the watch of medical professionals the creation of the nonprofit called safe house is the most significant step so far\nIllegal opioids and other drugs all under medical supervision and nonprofit has foreign to launch the so called supervised injection sites as Bobby Allyn of member station WHYY reports Trump ministry officials are watching and promising crackdown\nSince earlier this year officials in Philadelphia have been studying the idea of a supervised injection site where those struggling with addiction bring their own drugs and use under the watch of medical professionals\nThe creation of the nonprofit called safe house is the most significant step so far and making that a reality one of the most prominent board members of the group is former Pennsylvania Governor Ed Rendell\nTwelve hundred and Seventy Philadelphians died of overdoses most of them die alone in the year ... Seventy so highest rate per capita of any big city in America we've got to do something to stop\nOther cities grappling with the opioid crisis including New York Seattle in San Francisco are considering opening a supervised injection sites but I haven't done so yet California Governor Jerry Brown recently vetoed a law that would help open one saying it would enable illegal drug use\nIts position shared by deputy attorney general Rod Rosenstein who told NPR in August that the Justice Department will not tolerate the opening of a supervised injection site in Philadelphia\nIt remains illegal under federal law and people engage in that activity remains vulnerable to civil and criminal enforcement\n... Rosenstein incorporate or of the savings excellent site nonprofit and they can come and arrest me first\nRun del says his brazen position takes him back in time to the early Nineteen nineties when he was mayor and welcome Philadelphia's first clean needle exchange during the AIDS crisis\nBut offering clean needles to drug users is one thing inviting them into a building to use illegal opioids is a different matter entirely around the gold fine with the AIDS Law Project a Pennsylvania is another board member of safe house the new nonprofit she agrees that it's a controversial idea but the model has saved lives in Canada in Europe\nThe idea is if today we can prevent that fatal overdoses and we can build that relationship of trust then maybe tomorrow or even later today we can encourage that person to get into treatment\nAlthough city officials are not directly involved with a nonprofit Philadelphia's mayor and district attorney support putting the site in Kensington the heart of the city's opioid problem the nonprofit has already raised two hundred thousand dollars but the ...\nIt's a controversial idea but the model has saved lives in Canada in Europe the idea is if\nToday we can prevent that fatal overdoses\nAnd we can build that relationship of trust then maybe tomorrow or even later today we can encourage that person to get into treatment although city officials are not directly involved with the nonprofit Philadelphia's mayor and district attorney support putting the site in Kensington\nThe heart of the city's opioid problem\nThe nonprofit has already raised two hundred thousand dollars\nBut the city council woman whose district includes\nKensington Maria Sanchez is still on the fence\nBefore we can talk about a safe injection site as a tool within\nOn a recent visit to Kensington the desperation was everywhere\nSyringes and drug bags strewn across sidewalks and train platforms people nodding off in front of homes extra Delhi's leaning against our cars\nThis is how forty two year old ray describes it using just his first name because he uses illegal opioids so I've been to ground zero of zombie lame and it's it's just crazy raise wearing a pink shirt and shorts and have a Phillies baseball cap on backward\nHe says he'd go to the supervised injection sites because right now he uses some extra stuff and and the only way back yard or anywhere\nSafe as officials won't say yet when they hope to open the doors but one thing is clear they say is getting people like ray off the streets and into\nA medical facility means defined the Trump Administration so be it\nFor NPR News I'm Bobby Allyn in Philadelphia [noise]\nIt's time now for all tech considered\n[noise] this month we're looking at our bodies the way technology sees them here in the U.S we're gradually getting used to facial recognition technology it's in our phones in some airport security systems on social media\nBut how good an in house a cue or is this technology\nTo answer some of those basic questions we're joined by Alice O'Toole she's a facial recognition expert at the University of Texas at Dallas welcome thank you now I feel like I'm seeing facial recognition\nPop up a lot more recently not just on smartphones but in airport security systems for example law enforcement has also experimented with it was there some sort of\n... recognition technology it's in our phones and some airport security systems on social media\nBut how good an house a cue or is this technology\nTo answer some of those basic questions we're joined by Alice O'Toole she's a facial recognition expert at the University of Texas at Dallas welcome thank you now I feel like I'm seeing facial recognition\nPop up a lot more recently not just on smartphones but in airport security systems for example law enforcement has also experimented with it\nWas there some sort of technological breakthrough that allowed wider use of this software\nYes there hasn't been a breakthrough or in the last five years or so there's been a new algorithm and it's modeled after the human visual system whereas older technology would do really quite well with well controlled facial images when elimination is good and the viewpoint is frontal\nThis new kind of algorithm is much better at being able to generalize identity across variable images so that crazy facial expression or that\nYou know a change in age and so on these algorithms really have the potential to be much better at the task\nYou one recurring issue though we keep seeing is\nFacial recognition technology that miss identifies people of color much more frequently than it missed identifies white people uh there was that one pretty embarrassing incident where Google tagged faces of black people as real as\nI'm just wondering from a technological standpoint why do mistakes like that happen\nYeah this is a really excellent point the current algorithms learn by example and examples are basically\nMany many images of a particular person and an accurate label and so you get what's out there and what's out there may not be equally representative of different races\nSo you're saying there are just a lot more photos of white people in the databases these pieces of software read that's exactly right so how do you solve this problem technologically how do you make the Web I guess less racially biased you just flooded with more photos of people of color yes oh\nThe answer to the question technologically is quite simple if you had equal representation of faces of different races we would expect it would be equally\nWhat's out there and what's out there may not be equally representative of different races\nSo you're saying there just a lot more photos of white people in the databases these pieces of software read that's exactly right so how do you solve this problem technologically how do you make the Web I guess less racially biased you just flooded with more photos of people of color\nYes oh the answer to the question technologically it's quite simple if you had equal representation of faces of different races we would expect it would be equally accurate how you make the Web on race bias that's a harder question\nSo even when facial recognition software does work when it is accurate\nThere are some troubling implications when it's linked to a database of images for example civil liberties groups worry that law enforcement could use of technology to target undocumented immigrants or to track protesters\nAs someone who really understands where this science is today how do you think about this\nUm is face recognition technology abused um that certainly a possibility any technology has the potential for abuse whether or not the potential for abuse of this technology outweighs its utility\nIs something that has to be decided by societies and carefully looking at how it works and making decisions about what the right ways to use the technology are\nAlice O'Toole is head of the face perception research lab at the University of Texas at Dallas thank you very much thank you\nFor all tech considered comes from the ...\nAnd providing a software platform that enables organizations to deploy artificial intelligence predictive analytics ... solutions that industrial scale learn more it see three I O T dot a ah [noise]\nAnd from ultimate software provider of cloud based HR payroll and talent management solutions for the modern workplace learned more it alternate software dot com ultimate software people first [noise]\nCause and your book titled the poisons squad comes from project which he undertook it really shows his commitment to this ah describe it the poison squad was\nWell this is an experiment you could never do today because he basically goes out and recruit other people at the department of agriculture especially young clerks to volunteer to dine very dangerous lay and so the idea of the poison squad\nWas that three free meals a day seven days away super fancy meals\nAnd your book is titled the poisons squad comes from project ... took it really shows his commitment to this ah describe it the poison squad was\nWell this is an experiment you could never do today because he basically goes out and recruit other people at the department of agriculture especially young clerks to volunteer to dine very dangerous lay and so the idea of the poison squad\nWas that three free meals a day seven days away super fancy meals that are cooked by a professional chef all the ingredients are amazing and they only catches you have to agree\nThat half of you at any given period in this experiment are going to be adding capsules that contains suspect food additives and the other thing about it when you say is this crazy or what you were testing\nSuspected toxic compounds on human volunteers was that he felt that was the only way he could deal with this you had this rising tide of really dangerous food additives\nThere was no safety regulation how do I make a case that perhaps this is not a good idea I'll just tested on people and so he did\nTo no one surprise if you feed people formaldehyde or snack or lead they will get sick and when you demonstrate that why does it still remains so difficult to outlaw formaldehyde arsenic or lead in food why was it just not an obvious thing that everybody got on board with right away\nAnd doesn't that sound like the most logical response so look you've ... you've poison people let's get that out of the food supply to the food industry\nHad been organizing itself to fight regulation probably at the point that widely starts these experiments in Nineteen oh to he had been advocating advocating advocating and working with Congress men to try to get some kind of basic consumer protection ... regulations out there\nAnd if nothing else labeling and\nAs he does these experiments and ads they catch national attention which they did they were a front page news there were songs and you know musical numbers about them everyone is suddenly realizing that there was a lot of bad stuff in their food there's just a lot of bad stuff in their food and\nSo there was this in media push back\nRight to in which suddenly congressmen or on the side of food business\nRegulations out there and if nothing else labeling and as he does these experiments and as they catch the national attention which they did they were a front page news there were\nSongs and you know musical numbers about them every one is suddenly realizing that there is a lot of bad ... stuffing their food is just a lot of bad stuff in their food and\nSo there was this in media push back\nRight in which suddenly congressmen or on the side of food business or getting offered more money and the food industry actually organizes\nThey create a food Manufacturers Association and and and coalesce against making sure this doesn't happen and they were phenomenally effective\nAnd yet despite these long fought fight to expand decades today there isn't lead and formaldehyde in arsenic in food the way that there was a hundred years ago progress really was made\nYes once this\nFirst food safety law that passed in Nineteen oh six two years after a while a finished his\nFamous poison squad experiments wants that law went into a place we started pulling stuff out formaldehyde when out salad so look outside went out bar acts went out we\nAre cynical without dry you really see government stepping up for some of these out ... extremely dangerous compound\nIs this book just one big argument in favor of government regulation\nIn part because it certainly should be a reminder of that before government regulation food was a constant unknown and often terrifying risk to American consumers and put our lives at risk\nBut it's also I Hope just a good story it's a story of something that I Love\nI Love these kinds of stories it's a story I'm a single person who changes the conversation right and I think that's really important to we need to remember\nThat someone who is focused than even obsessive and and who stands up relentlessly for an issue can actually make a difference so I Hope it works on all those levels\n... new book is called the poison squad one kind of a single minded crusade for food safety at the turn of the twentieth century thanks for talking with us\nThank you so much for having me on\nI Love these kinds of stories it's a story I'm a single person who changes the conversation right and I think that's really important to we need to remember\nThat someone who is focused than even obsessive and and who stands up relentlessly for an issue can actually make a difference\nSo I Hope it works on all those levels\n... new book is called the poison squad one chemists single minded crusade for food safety at the turn of the twentieth century thanks for talking with us thank you so much for having me on\n\nTomorrow on MORNING edition Jerusalem has long been a pilgrimage site for people of many faiths after the U.S embassy moved there are few months ago some religious Americans saw another reason to come they say the embassy represent something biblical\nThat story tomorrow on MORNING edition you can ask your smart speaker to play NPR or your local station by name\nTune in for MORNING EDITION with local host Abigail back then that's tomorrow five to nine AM here on Ninety One point five key are cc\nA gloomy ... morning did not keep people away from garner the gods for the parks seconds so called ... morning yesterday\nFor a few hours bikers runners and walkers roamed freely throughout the park and appreciating the landscape and the wildlife and no one seemed to miss the traffic Ninety One point five years he sees Abigail back when it was there and has this audio postcard\n[noise]\n\nIt's really it's nice because there's not a lot of vehicle there's not\nAs many people around you know a lot more people\nTalking to each other and it's very quiet riches lovely [noise]\nLogging coming to the garden of the gods since I was a kid and rock climbing wife so this is where I learned to climb in the garden so special place and it's a wonderful place to be and we like it when there's no cars out here [noise]\nThe cars the quiet is the most obvious difference\nThere and it's very quiet which is lovely\nLogging coming to the garden of the gods since I was a kid and rock climbing my whole life so this is where I learned to climb in the garden so special place and it's a wonderful place to be and we like it when there's no cars out here [noise]\nWithout the cars are the quiet is\nThe most obvious difference because the cars create a lot of noise there's a lot of noise pollution in nature threw out the American west in our parks and it's become a serious problem but it's not really recognized as a problem because we're so used to it you know most of us are urban dwellers including myself\nSo we used to that background was once you don't have that\nYou hear all that you can hear what nature really is and that's why this park was preserved was for ... reasons and it also preserves a little bit of our wildlife and\nIs very ... [noise]\nI never being able to foreign from Birmingham, Alabama they said that the gardener the guards in place to come see when you come to Colorado\nSo this is why me and my family's out here\nSo did you know there were no cars allowed in this morning no ma'am we were very surprised home when we got here we were thinking about taking the car so people will have to get out the car but ah it's it's it's nature I like anything you didn't expect um cold [laughter]\nAnd a son that out but I mean\nIt's great it's great we've got a child here that they learn so is this is a great education experience [noise]\nBeen wonderful so far I've been around twice around the loop we ride your frequently we live very near here and we moved here for the bike trails\nAnd I've just had a really good time because I haven't had to watch for cars all the time\nBut the best thing was it was so peaceful than I was able to stop at one point and listen to songbirds seeing that I could see up in the top of the little Bush by right where I was I mean he was not far from me at all and he had the most beautiful song I've never been able to do that before so\nAh it's just been a really wonderful experience\nWe ride your frequently we live very near here and we moved here for the bike trails and I've just had a really good time because I haven't\nHad to watch for cars all the time\nBut the best thing was he was so peaceful that I was able to stop at one point and listen to a songbird seeing that I could see up in the top of the little Bush by right where he was mean he was just hard for me at all and he had the most beautiful song and never been able to do that before so\nUh it's just been a really wonderful experience [noise]\n\nProgramming on Ninety One point five K. R. C. C. is supported by old world Beagle in Delhi featuring New York style boiled bagels made in house daily with breakfast and lunch served all day long to pick up or eat in old world bagel in Delhi is located one block west himself circle and our twenty four hours\nBut the Colorado Springs fine arts center at Colorado College presenting Virgil or tease revolution rise against the invasion reimagining the sixteen ... five hundred years later on you know Colorado College dot edu slash FCC\nThe bitter fight over Brett Kavanaugh's confirmation may give the Republicans a boost in the mid term elections\nSome of the data we've seen and heard about over the last ten days since yesterday this is energizing them in a way they weren't before\nWe'll hear more on the political affects the Kevin Kevin a controversy could create a that's right after headline news from NPR at six ... six\nWe'll hear more on the political affects the Kevin Kevin a controversy could create a that's right after headline news from NPR at six ... six\nAnd from listeners like you who donate to this NPR station\nThank you for tuning in for all things considered and thanks for supporting key are cc ... C. H. D. Colorado Springs ... hunter Casey is ...", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Colorado Springs", "day": "08"}