{"month": "10", "state": "AZ", "station": "KOFA", "content": "We enjoy relaxation stimulation entertainment if some liken jazz on the radio to an informal education of an art form will take a Sunday evening from seven to nine on board or radio Thirteen to ... am in Yuma an outline of border radio AJC dot org\nThis border radio pay ... ... am and ... or a service of Arizona western college\nWe also broadcast on the Arizona community radio network at eighty nine point five FM Jay Jay Z a Drake Williams Ninety One F. M. K. Jaycee deep Prescott\nNinety points ... kj ... cake Kingman and Ninety One point three FM black stuff\nThis was folk singer Michael Jonathan inviting you to tune in to this week's broadcast if we have the Austin trio the troll smash ears and the son of the legendary John McHugh and Jonathan McEwen his son\nWhen he both artists music in conversation on this week's broadcast [noise]\n\nI think that they don't border radio twenty and\nSunny skies in Kingman today hind you're Seventy two of the breezy out there someone gets up to thirty one miles per hour clear skies in the evening with the love around forty four in Prescott mostly sunny today on your sixty seven ten percent chance of showers before eleven PM with mostly clear skies love around thirty for an evening\nAt thirty percent chance of showers throughout the day in Flagstaff mostly sunny what's behind you're fifty eight in the evening partly cloudy with a lower I'm twenty seven\nIn Yuma sunny skies or ... eighty six today clear skies this evening alone around sixty two\nAnd I mean that's what the b._b._c. news hell a suspected of Germany's rust serial killer since the second World War one hundred if he's from patients with ... concession stand his trial in owning back coming here with for\nHis patients trusted him with a knife and Neal's haggle with a serial killer who preyed on the elderly and didn't find\nIt forty one year old minister fake ... medication to the people in his cat at two hospitals in northern Germany as a parent negative to impress his colleagues by attempting to resuscitate them very patient he's attacked\nHeckled already having a life sentence in connection with the deaths of six people it was only after investigator think seems the remains of all this that the truth extend his crimes came to light\nHas granted angrily threw South Korean ... stare to compensate for South Korea and so therefore play that during the second World War the prime minister Shinzo Abe's told reporters the decision was impossible under international law the prime minister atomic corner some in the ...\nThe second World War the prime minister Shinzo Abe's told reporters the decision was impossible under international law the prime minister atomic corner some in the south Korean ambassador to Japan to protest addict he's though are the\n... war the Japanese colony from Nineteen ten until Japan surrendered at the end of the war took you have argued that work has rights to compensation happening terminated by a treaty signed by both countries in Nineteen sixty five\nThe Supreme Court in South Korea rejected that argument that could open the floodgates for others to file a lawsuit against Japanese companies accused of capitalizing on forced labor in Korea getting the occupation\nEthnic on still refuses to pay the compensation that plane tickets and their families could a local courts to see that I sit and South Korea\nAnd the BBC interview Brazil science president elect unable to morale\nHas tried to LA fast and they don't yet know scenario will take the country back through authoritarian government doesn't allow an army general who resigned to into politics this year from its ministry would respect constitutional democracy he also said minority groups would be protected\nBlack people in the minority here in Brazil or people who have all their options of sexual options\nThey are in the ... old their rights are good and so they don't have to be afraid of anything they live their lives like they're leaving though they have more space because we'll be in a economic rules they have more jobs there will be happier\nPresident Trump is considering an executive order which he says who were when these the citizenship prices Lincoln's children born in the United states he says he's advises how to shoot him that such a step was within his presidential power\nMost experts believe that the constitutional provision on birthright citizenship cannot be scrapped without congressional approval BBC News\nFor K. A. W. see news in Yuma in conjunction\nYuma county public health district is wanting women to protect themselves when traveling to Mexico and the devil you seize Lou gum reports the warning comes after the Mexican state of Sonora reported in increase in locally acquired Zika cases\nHuman county joins Maricopa County and cautioning pregnant women to protect themselves from mosquitoes when traveling to seek affected areas officials suggest protective clothing and the use of mosquito repellent as directed\nMaricopa County health officials tell ... easy in Phoenix there have been forty five cases of ... in the last two weeks compared to eighty four cases since twenty Fifteen\nThe county has diagnosed one case of travel related sneak up on the county has not documented any locally acquired cases of ... and new mosquitoes trap locally have shown the virus Kevin ... county communications director\nWe have not to charge a drinker Yuma county but we do want particularly uh women that are pregnant or that are trying to become pregnant to be sure if they travel to an area that might have a seizure again a south of the border industrial area that they take the necessary precautions\n... spread by bites from infected mosquitoes and can pass from a pregnant woman to her fetus the viruses also spread through unprotected sex with someone infected by the guy who may not be showing symptoms which include fever rash headache and muscle pain for K. A. W. see News I'm Luke gum\nFormer state archaeologist is accusing the agency that oversees Arizona State parks are prioritizing development\nOver protection of Native American sites and artifacts Arizona Daily Star reports will Russell a former compliance officer and tribal liaison with Arizona State\nLike an artifact Arizona Daily Star reports will Russell a former compliance officer and tribal liaison with there was a mistake parks and trails filed a complaint earlier this month but the Arizona department of it's been a stretch\nFor K. A. W. see News I'm can transcend\n[noise]\nAre gathered scenic it's far away [laughter]\nYork City staff thing [noise]\nBig chance changes from day to day\nMake a pain\nYou\nMaybe you'll around right\nBeen told me what to do was never yeah\nWinning goal oriented all to come on you\nDo I go oh\nDo a job or oh\nWrecked the main don't exist no\nMore\nA bit of a swing and\nOh\n\nNa\nLike [noise]\nAround me that there has got them on my knee and my mom huh well do you come back from\nWell\nOn a on a\n\n\nOh oh oh [noise]\n\n\n\n... to that one at San borrow the new album called concrete in mud and we just heard heartbreak managed to continue with the bridge here on board or radio before that the ducks did ship high in transit we heard send me an omen that the new track from the Mac pie salute a man made up mostly of a former members\nOf the the black crows and we started that set up with I'd rather be your number three but the barebones\nTaking a look at the the upside of infidelity asked [laughter] hey stick around to take a short break as we continue to bridge I've got new music from some both started our next set so stay with us\nToday is border radio day sponsors or bill and Marcia pike celebrating their return to you know for the winter they appreciate border radio for providing GOOD Music and news to our entire community villain Marcia encourage their fellow winter visitors to join them and supporting border radio as the pikes have done for more than Twenty years\nYou can hear border radio Thirteen twenty am on the radio ... download the app install it and select K O at bay at your favorite station\nIn Flagstaff a chance of showers in a high a fifty eight today with west south west when five to ten miles per hour tomorrow sunny ice near fifty one basket mostly sunny eyes near sixty seven today sunny tomorrow with a high near sixty one\nIn Kingman sunny in a high up Seventy two today and suddenly tomorrow with a high up sixty eight\nIn Yuma sunny skies in a high near eighty eight degrees today tomorrow sunny icy or eighty three [noise]\n[noise]\n\nMm\nWell now that baseball's over I guess it's safe to play that's [laughter] that's a ... and his the cover of the dire straits track walk of life\nThat's from a covers I'll be put out a few years ago called substitute teacher you listed the bridge on board or radio or before that Dallas Morgan hockey talk I mean Mr Awlaki dog\nHas to be released from John Mellencamp ... days a farewell and we started that set off with some bold new releases called the search and we heard ... world\nWe're going to take a short break and we'll be back with a real fun ... from the string cheese incident we hope you'll stick around for more debris\nBorder radio was supported by the historic corn auto hotel located close to the Colorado River in historic cultural sites in ... Arizona only minutes from California and Mexico the historic Coren auto continues to serve travelers since opening in Nineteen thirty eight information online ... corn auto motor hotel dot com\nBroadcasting from the campus of Arizona western college for more than forty five years this is their genes when he am border radio and border radio easy dot work [noise] [noise]\nBrand new program called ... ... am I mean you're\nGet right here in Arizona\nWe heard I've ever done ... radio network\nAnd you can stream of ... ...\nMore on the radio that capital\nGet searched for K. O. N.\nRun Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm\n[laughter]\nMan and\nOnly the day\nCheese\n\n\n\nShare\n\n\n\n[laughter]\nDa\n\n\n\n\n\nNa na\n\nNa\n\nNa\nNa na\n\nNa\nNa\nNa\nNa na da da\nDa\nDa\nSaturday Night at a unborn and radio and border radio easy dot org [noise]\nYeah the president now we're with music and you just you know every week for right here I'll see\nYou are too did you say you must border radio Thirteen twenty am and border radio easy don't work we also broadcasts an Arizona Comey radio network eighty nine point five FM cage you see a drink Williams Ninety point one at ten K. J. C. P. Prescott Ninety point seven F. M. K. J. C. K. Kingman in Ninety One point three ...\nOn the next Celtic Connections we celebrate the information that led to our modern day you know when we were singers like Christie more Mary Black and many more\nThan the current oh\nThis is Brian till the growth of you to join the forest so celebration of that\nWhen the evening at seven on board or radio Thirteen twenty am\nIn Yuma sunny today with the highest eighty eight degrees north when ten to Fifteen miles per hour tonight mostly clear those around sixty three Kingman Sony and the highest Seventy two today\nClear tonight with a lower forty four ... mostly sunny ... near sixty seven today tonight chance of showers and a low of thirty four in Flagstaff a chance of showers and the highest fifty eight today and tonight the chance of showers in a low of twenty seven degree\n\nHello I'm now in motion with the b._b._c. news\nTo suspected of being Japanese was serial killer that since the second World War because it makes it depending on what if it's for my patients detected say Neal to okay\nSuspected of being Germany's was serial ... since the second World War but didn't mention to killing a hundred of his for my patients detected say Neal Togo gay fatal dose of medicine to the victims at two hospitals in northern Germany Jenny Hill is following the trial\nHis patients trusted him with that lives Neal toggle with a serial killer who preyed on the elderly and in fact I'm forty one year old administered faithful doses of medication to the people in his cat at two hospitals in northern Germany\nHas apparent motive to impress his colleagues by attempting to resuscitate a very patient he's attacked\nHeckled already serving a life sentence in connection with the deaths of six people it was only after investigators exams the remains of all this that the truth extend his crimes came to light\nPresident Trump has said he's considering ending the right to citizenship of children born to foreigners in the United states Mr Trump said his advice that ensured him he could do so using an executive order most experts believe the president doesn't have the power to overturn the constitutional amendment on the slide citizenship [noise]\nIt was hard it in Copenhagen have accused Iran of trying to carry out an assassination in Denmark the Danish intelligence Savage P. E. T.\nIs the target was named rainy an Arab activists resident in Denmark which to Pico report amongst\n... police carried out one of the largest operations in its history the controversy ... still as hundreds of roads were closed on trains unfair is canceled today that initial intelligence service linked to the store and rainy an assassination attempt to target is said to her being in writing in honor of activist resident in Denmark\nWho is now under police protection with two other people\nThere's also but who was eventually detained nine days ago denies involved and the intelligence service described Iran's behavior is totally unacceptable the foreign minister ... said Copenhagen was in talks with other European countries about for the Russian\n... constitutional crisis entered the fifth day with thousands of protests is gathering of the capital Colombo to show that support for the ousted prime minister runaway kind of thing that I'm Glad the appointment of a former president of the premier ship and suspension opponent ... Honda reports\n... supporter of Sri Lanka sacked prime minister ... ... around his official residence demanding that they need to be reinstated civil society groups are also that concerned about to move they say it's unconstitutional\nTo become a single image briefly to address his supporters he describes his dismissal as a coup an attack on the foundation of the country he says the remains prime minister and wants to be able to prove it to parliament but his replacement has the forming a cabinet\nAnd it includes at least for defectors from ... to become a thing this policy world news from the BBC\nGood morning for the devil you see News I'm Jasmine I did not well ballplayers representing him a county college in Tucson took to the field Saturday for their final home game after Eighteen years the ... the football program was canceled earlier this year\nDue to budget concern the fourteenth ranked aspects to the field against and ninth ranked eastern Arizona college Saturday they won by a score of twenty eight twenty six\nCollege chancellor elite laboratory Arizona Daily Star the college earlier this year that the school needed to reduce operating expenses by about Fifteen million dollars this year leading\nTo the football program cut my natural restraints Oslo left in Maricopa County community college district to cancer district sponsored football programs that twenty eight in season will be the last for for colleges and the district Phoenix gone down\nDistrict to cancel a district sponsored football programs the twenty teens season will be the last er for colleges in the district Phoenix got down that's a an Glendale community colleges\nArizona court of appeals ruling says a search warrant with an incorrect address for a home can still be valid if the other rice specifically identify the place to be searched there was on a Daily Star reports the courts ruled on an appeal in which equal cheese county man convicted\nOf drug related offenses try to overturn a search warrant with an incorrect to address\nThe ruling that Fourth Amendment privacy protections require that warrants specifically describe places to be searched\nBut it's incorrect addresses outweighed by details such as the homes color types of fences vehicle details and the princes\nPresence of waiting law enforcement officers like he's now goes back to a trial court to consider factual circumstances related to weather sheriff's personnel could enter the property despite a no trespassing sign\nThe WTC women's soccer team comes to an end on Saturday after losing to paradise valley or to zero ... bc News I'm Jasmine I didn't know\nThe word the\nTerm and gray and you said you\nKnow never cared about going into the game\nThem away and that's one thing we do do do do do\nYou bring in a way that will never get around do you will\nWants to\nTheir land\nNo way\nThe Wii U G G\nRight when we were in a way you know numbers care about do you all the way\nAnd then there's been down there\nToo and there are some of\nThem have been me them and loving me ... me for me\nThis town for um the the town\nKids some monitors yeah here's some um ...\nBlood Ron ... me my blood runs while I'm\nThere bam bam bam bam\n\nAnd\nRon are you saying well you sing his son and you let me\nBring them back open them back\nI certainly don't have a sibling and you don't have some stairwell so we still have ... minutes a designer\nBut when you saw it as a\nFree meal shoes or bring meals you are wearing Neal shoes ...\nNow I'm a slow and me and now\nThey're they're they're\nThey're\n\n\nA long time to get back\nIn ... in the\nRoom and down the road I go home than ... a\nDamn me and my ... money and then I Am loving me for\nMe is town now for me this town and the only time\n\nMan and you take him in\n... knock it in a gay man\nBabies satisfy in\nEvery baby just terrifying\nYou can't come in\nWorld man ...\nLoan man James Comey who\nMove to marry and then you can come in\nDo better and they can come in [noise]\n\nThat's a blues legend Mississippi John Hurt from Nineteen sixty seven to release called the moral that was keep on knocking as we can do with the bridge here on a Tuesday Morning you're listening to border radio before that sunny low down ... before I leave this town we heard boats a leg between our favorite Cajun Michael do say would take it to me\nIt started that set off with the new version of islands in the stream\nThis time by the band ... re which some help them really would\nHave helped me get sticker outlook I took a little break and then we'll be back with some more music I'll start the next set with a track from a Tara Devon you're on the border radio to breach\nBorder radio it's supported by president he'll Brewing Company a locally owned a restaurant and craft brewery on main street in humans historic downtown and an atmosphere which embraces humans history enrich cultures locals and travelers are welcome to enjoy some time in prison health custody along with a wide range of menu options and craft beers more on President he'll brewing on Facebook\nThanks for listening to the radio Thirteen twenty ... radio easy don't work we'd been a service to Arizona west in college for more than forty five years\nA brochure first produced by the Arizona how we department in Nineteen twenty five Arizona highways evolved into one of the most respected and Roberto publications in the world joined K. A. W. sea and retired Arizona highways publisher when holding at the next spirited discussion to learn the story of this remarkable magazine\nWednesday November seventh from five thirty seven at St Paul's cultural center for information does it K. A. W. C. dot org\nThis has been made possible in part by a grant from Arizona humanities\nNa na na\n\nNa na na\nThen lately and\n...\n\n... none of\nThe day\nOne paid a\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\nAnswer that's new music from David arrow and a new album called garden of Eden do we're finding Natalie as he did with the bridge on Tuesday Morning euro border radio before that the new release the GB route just called him a week we heard the track better get your gun\nAvalon was from jet black we started that set off with a new version of stars fill out Alabama like Karen ... he we hope you'll stick around we got to take another show\nAnd starting the next day you're just about ... minutes so stay with\nToday's border radio day sponsors or bill and Marcia pike celebrating their return to you for the winter they appreciate border radio for providing GOOD Music and news to our entire community bill in March to encourage their fellow winter visitors to join them and supporting border radio as the pikes have done for more than Twenty years\nYou get your voter radio Thirteen twenty am on the radio FX ... Donald the up and started and select gave us Stay as your favorite station this is folk\nSinger Michael Jonathan inviting you to tune in to this week's broadcast we have the Austin trio the trolls managers and the son of the legendary John McHugh and Jonathan McHugh and his son\nAnd then he both artists music in conversation on this week's broadcast\nI Am\nThe the evening at seven on board or radio he's twenty and\nKnow where we have\nA song\nStopped going back to live\n\n...\nAnd then the thing that they\nDon't have to know\nAll these you\nHans chats touched me in ways that I'd never been touched before they knew that and I just want it could be her\nTo the emergence of Joni Mitchell ... P. R. I. public radio international Sunday Morning at ten border radio kale at ... am Thirteen twenty in Yemen\nBroadcasting from the campus of Arizona western college this has bought her radio Thirteen twenty eight year in ... and ... radio waves eat dot org\nWe also broadcast on the Arizona community radio network eighty nine point five as thin K Jay Z a drink Williams Ninety ... kj ... Ninety ... kj easy cake Kingman in Ninety One point three FM ...\nMartin Lopez one of the hosts for new program called crossing borders on voter radio Thirteen to ... minutes every afternoon from three to seven from mix up music from around the world is right here in Arizona\nWe can be heard on the Arizona community radio network and you can stream at that age that we see that or the radio ethics or the tune in just search for K. L. I. S. [noise]\nIn Flagstaff a chance of showers and hire fifty eight today with west south west when five to ten miles per hour tomorrow sunny ice near fifty one basket mostly sunny ice near sixty seven today sunny tomorrow with a high near sixty one\nIn Kingman sunny in a high at Seventy two today and suddenly tomorrow with the highest sick\nThe seven today sunny tomorrow with a high near sixty one in Kingman sunny in a high of Seventy two today and suddenly tomorrow with a high of sixty eight in Yuma sunny skies in a high near eighty eight degrees today tomorrow sunny ice near eighty three\nHello I'm ... with the b._b._c. news the nuts to spectator being Germany's west cereal cannot since the second World War has admitted to killing a hundred if it's for my patient\nNews had made his confession the start of his trial in the northern city of holding back detectives say gay fatal dies does have Mets into the victims to hospitals in moving Gemini Jenny Hill has ...\nHad the power nice to have a board at those and wanted to impress his colleagues at the hospital by trying to replicate the very patients that he had to type ... with a lady solving a life sentence I have the deaths of six patients today's trial came about because investigative started to\nExam more than a hundred ... remain of all the patience to hospitals and found significant traces of medication fell in Athens\nPresident Trump has said he's considering um moved to end the right to citizenship as children born to foreigners in the United states in an interview with the Trump said his advisors at a showed him he could do so to an executive order Don Johnson reports from Washington\nWhere the only country in the world the president said we're a person comes in and how the baby and the babies essentially a citizen of the United states with all those benefits he said it's ridiculous and it has to and in fact the U.S isn't alone and not\nIt's not even clear if the president could change the law himself without the agreement of Congress the president's on the immigration messages have toughened in the run up to next week's midterm elections some suspect this is another idea floated to just to appeal to his core supporters\nIf he does but she is likely to be a legal challenge because the American constitution says that all people born or naturalized in the United states citizens\nThe authorities in Copenhagen have accused Iran of trying to carry out in the nation in Denmark Danish intelligence ... says the talk it with any rainy an Arab activist resident in Denmark ... reports\nEmotions or do Danish police carried out one of the largest operations in its history the country I spoke to a standstill as hundreds of roads were closed\nOn trains unfair is canceled today the Danish intelligence service linked to that to an Iranian assassination attempt to target is set to be known Iranian are activists resident in Denmark who is now under police protection with two other people\nThe suspect who was eventually detained nine days ago denies involvement the intelligence service described Iran's behavior is totally unacceptable the foreign minister ... said Copenhagen was in talks with other European countries about further action\nIt's written on could ousted prime minister runaway crime and saying that do does opposes that he'd sucking with an attack on the country's democracy included an attempted coup and said they wouldn't let president mighty policy be saying that you said the pilot opponent\nMr week were emitting has refused to leave his visual residents to his dismissal on friday\nYou're listening to the nation's well means from the BBC\nI'm Jasmine I did not about Seventy five percent of Arizona voters typically cast their votes by mail instead of showing up at the polls and are running out of time to Mehling those ballots tomorrow Halloween is the last states mail in ballots and be assured that they will arrive in time to be counted\nBut a lot of people have already turned in their balance out of the weekend nearly nine hundred thousand\nOf interned in across the state early voting down his shows over our voter enthusiasm is at an all time high for a midterm election\nThen I've been turned in across the state really voting data shed overall voter enthusiasm is at an all time high for a midterm election I should just point out these Republicans have the advantage\nForty four percent of the balance journey and by friday where from Republicans compared to thirty three percent from Democrats will stay in the early results are a reflection of GOP enthusiasm and the fact that Arizona is a red state\nDemocrats maybe narrowing the gap on friday alone at nearly one hundred thousand ballots were turned in and for friday Democrats narrowed a GOP lead it to eight percent\nFederal visuals are sending thousands of soldiers to the U.S border with Mexico from the from that as that skinny Phoenix kj CDs mouthy Casey reports that part of their job is to help keep a caravan of Central American migrants from entering the at\nMilitary officials are sending fifty two hundred troops some of them armed to the southwest border worth thousands of National Guard soldiers have already been for much\nThe mission is dubbed operation faithful patriot and it aims to help US Customs and border protection strengthen defenses at an around ports of entry the military is legally barred from doing immigration enforcement select the national guard these new troops will play supportive roles\nThe deployment comes as a caravan of Central American migrants slowly makes its way through Mexico president Donald Trump has called the caravan which is still hundreds of miles away from the U.S\nInvasion in Phoenix I'm Matthew ...\n[noise]\nAin't got no why are they\nBanging round machinery\n\nGay I notice that your job [noise]\nA kick in as a trash can [noise]\nMagazine near the train tracks\nI could hear the train tracks\nMan what a great artist that's a job right with his latest single knocking on your screen door as we begin another hour the bridge you're a border radio Thirteen twenty yeah you hear what they knew what the Reagan hope you're Tuesday Morning getting up to a good start\nWe love to feature Arizona artists on this program we've got one of the dumb lemons coming up later this hour also some Kim Angeles and uh we've got some kind of a magnet is coming up later this hour as well\nThis is a new artists that jade bird and a new track it's called uh all\nThis thing this round of pretty long\nHe he'll he'll stick around we got a lot more great music ahead including the blues from Jennifer magnets never start the next set was Melvin tailoring slacks\nHeard oh hey we hope you'll stick around ... got a lot more great music ahead including some blues from Jennifer magnets start the next set which some Melvin tailoring slacks ban so hope you can stay with us\nToday is border radio day sponsors or bill and Marcia pike celebrating their return to you know for the winter they appreciate border radio for providing GOOD Music and news to our entire community bill in March to encourage their fellow winter visitors to join them and supporting border radio as the pikes had done for more than Twenty years\nYou can hear border radio Thirteen twenty am on the radio ethics at download the app install it instantly kale I think that's your favorite station\nIn Yuma sunny today with a high of eighty eight degrees north when ten to Fifteen miles per hour tonight mostly clear those around sixty three ... sunny and the highest Seventy two today\nClear tonight with a lower forty four Prescott mostly sunny eyes near sixty seven today tonight chance of showers and a low of thirty four in Flagstaff the chance of showers in a high at fifty eight today and tonight the chance of showers in a low of twenty seven degrees [noise]\n[noise] [noise]\n[noise]\nRun for\n\n\n\n[noise]\n\n\n\nTake me say that\nThey may have back out and you are right\nChanging your right to\nGive you that ... me that and\nThey may around\nMe around\nThey made back out dream you\nKnow what on me\nI gave you that in mind that and\nKnow I don't know\nWho may around\nCold man and turn\nAround and\nMay mad magazine right\nTo me to write\nI give you that my knee that\nWay around\nThree both not\nIn my knee they may\nI won't and then you come back\nOr not\nAh do you live\nYou come back we're\nAnd he's done much now\nJust stepped out on the front or\nA Malian bang ... a\nLittle things I should've said new gun\nToday a record stay as\nI should go on in that yellow cab the really sky as around ...\n... and\nWith a broken heart\nTo in the arms interior build a viable da da da da de\nLa ...\nYears the latter man ... and\nYear old man and a well I think is the ... the love\nDo or not I'm not on a\nI'm not a law rot out bad no\nCould you just don't laugh\nLoving near\nThe mole\nI just don't lie\nLoving you ... and he\n... or\nDon't know who\nMaybe you know\nThen\nWho'd been\nHe did use\nKnow\nNine someone ...\nFor ...\nOh\n[noise]\n[noise]\n\n\n\n\nHere and chanting more now than when I call it in\nThe animal that got\nI'm relatively Howard joined me for Cape Verde the next to put a mile world music hours Saturday evening at seven on border radios Thirteen twenty ...\nThanks for listening to K O F ... Thirteen twenty or yum and border radio easy dot org service of Arizona western college we also broadcast on the Arizona community radio network at eighty nine point five FM K Jay Z a Drake Williams Ninety point when offend cage easy you Prescott\nNinety point seven F. M. K. Jay Z Kingman and many one point three of them Flagstaff\nA brochure first produced by the Arizona highway department in Nineteen twenty five Arizona highways evolved into one of the most respected and revered publications in the world joined K A double UC and retired Arizona highways publisher when Holden at the next spirited discussion to learn the story of this remarkable magazine\nWednesday November seventh from five thirty to seven at St Paul's cultural center for information visit K. A. W. C. dot or this event made possible in part by a grant from Arizona humanities\nIn Flagstaff a chance of showers and a high a fifty eight today with west southwest wind five to ten miles per hour tomorrow sunny eyes near fifty one Prescott mostly sunny hides near sixty seven today sunny tomorrow with a high near sixty one in Kingman sunny in a high of Seventy two today\nAnd suddenly tomorrow with a high of sixty eight in Yuma sunny skies in a high near eighty eight degrees today tomorrow sunny eyes near eighty three\n\nHello I'm ... sure where the b._b._c. news the news is suspected of being ... west Philly okay that's in the second World War has admitted to killing a hundred of his for my patients who made his confession started his trial in the northern city of holding back\nDetected say he gave fatal dies his medicine to the victims to hospitals in northern Gemini more details from Jenny Hill\nNorth and say well not a rating I how many people he nodded because of course many of the people he died I Hope that whole what cremated that no way of thinking and testing that remains but secondly they hospitals which Hagel what experience significant increase it and the number that\nThe number of thought the Haitians and in one case the amount of the ticket a medication that ...\nMany of the relatives say that by tightening a blind eye John and health authorities have an effect to send a tainted had old Nutter ambitions\nPresident Trump says he's considering ending bus ride citizenship in the United states in a televised interview he said the move would happen with an executive order\nA majority of joy is beneath the White House doesn't have the pilot scrap the constitutional guarantee that anyone born on us soil has the right to citizenship\nYou'll notice in Copenhagen have accused Iran of trying to carry out an assassination in Denmark\nThe Danish intelligent said his P. E. T. set the tone it with an Iranian Arab activist resident in Denmark which will be a report\nAgo Danish police carried out one of the largest operations in its history the country I spoke to a standstill as hundreds of roads were closed\nOn trains unfair is canceled today the Danish intelligence service link to that to any rainy an assassination attempt to target is set to have been any writing in our ... president in Denmark who is now under police protection with two other people\nThe suspect who was eventually detained nine days ago denies involvement then tell us\nIn Denmark who is not one to police protection with two other people to suspect who was eventually detained nine days ago denies involvement the intelligence service described Iran's behavior is totally unacceptable the foreign minister ... said Copenhagen was in talks with other European countries about further action\nThe United Nations Human rights chief which are about Gillette it's printing Saudi Arabia to lead independent foreign expense joined the investigation into the ... of the dissident journalist ... imaging foods reports from Vienna\nMichel ... said international investigators should be announced full access to evidence and witnesses to Jim ... deaths\nGiven the honey level ... officials were apparently involved in his killing she said independent experts were required to ensure an investigation freeze political considerations she ... to ... we're about to his ...\nAnd yet the tech he's president demanded that Saudi Arabia is chief prosecutor establish who owe to the king inside it sounded confident in Istanbul ...\n... that were you see new venue my I'm Jasmine I did not seem a county public health district is warning women to protect themselves when traveling to Mexico hey W sees a little gum reports the warning comes\nAfter the Mexican state of Sonora report it an increase in locally acquired Zika cases\nYuma county joins Maricopa County in cautioning pregnant women to protect themselves from mosquitoes when traveling to seek affected areas officials suggest protective clothing and the use of mosquito repellent as directed\nMaricopa County health officials tell ... easy in Phoenix there have been forty five cases of ... in Sonora in the last two weeks compared to eighty four cases tens twenty Fifteen\nThe county has diagnosed one case of travel related ... Huma county has not documented any locally acquired cases of ... and new mosquitoes trap locally have shown the virus Kevin ... county communications director\nFor you not to start to bicker here in Yuma Kelly but we do want particularly uh women that are pregnant or that are trying to become pregnant to be sure if they travel to an area that might have a seizure again a south of the border industrial area that they pick the shirt precaution\n... spread by bites from infected mosquitoes and can pass from a pregnant woman to her fetus the viruses also spread through unprotected sex with someone infected by the guy who may not be showing symptoms which include fever rash headache and muscle pain for ... you see News I'm Luke gum\nHalloween is Wednesday and its last day for Arizona instrumental in their early ballots for the November six general election there is on a republic report the vast majority of Arizona and about Seventy five percent typically cast a ballot by Mel for those ballots to be counted\nElection officials must receive them before posed clothes on November sex when\nStanding in a ballot don't forget just signed up front of the envelope on science balance aren't accounted for gay WC News I'm Jasmine I did not all\nOn them or\nOn them or\nA\nA a sweet\nCat fine\nThe floor\nA\nNa na na\nAnd the oh gee I Wish\nSee the sky gets black someone tried to walk down the street\nIt's really\nThe single person\nNight was in the\nMoney since the lightning when they\nAs the new\n\n\n\n\nWell see without guy who has time\nGet me\nRight now if you go on walks me why you\nKnow ... ... played by a man on the scene I'm On my feet above the ground and a man in the la la\nLa la la\nLa la la la la la la\n[noise]\n\nNo longer be blamed for our animals are made\nI mean the whole trial with my bra\nAs a guy\nKnow a lot of bad and I shall I Know\nA girl like that and that's what I shall I Know a\nDollar or my daughter and da da da\nDa da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da\nDa\nDa da\nDa da da da\nDa di\nShow or\nNa\nNa na na na\nNa ...\n\n\n\n[noise]\n[noise]\nHave played a lot of love songs this morning on the bridge here on board or radio that would suit John Stephen ... the track mystery of love that he wrote for the movie called me by your name last summer and it's been a branch job border radio\nWe are Thirteen twenty yeah you can you say you and we're also heard across the Arizona community radio network on FM transmitters\nAnd Ninety One point three FM in Flagstaff Ninety point one ... press get Ninety point seven FM in Kingman eighty nine point five in San ... Williams ...\nBefore to John Stevens we heard the Kenmore ban with bad days the what was the band the ... you don't love me that somebody who I call time now and we started that set off with a pet Galen Joey Ryan before they were ... kids we heard rock and roll\n[noise] I've got some great reggae coming up after the break so hope you'll stick around border\nRadio was supported by Dr Cheryl how go and the team at desert veterinary clinic who are dedicated to helping pets live long healthy and happy lives through regular visits and preventative care desert veterinary clinic nine Ninety five south Fifth Avenue and by phone at Seventy three vibes zero one zero\nWhen you can't get Puerto Rico thinking twenty ... and ... on your radio catch it something like that part of the radio ac dot org or you can use it in in ... ... ...\nWas folk singer Michael Johnson inviting you to tune in to this week's broadcasting we have the Austin trio the trolls smash ears and the son of the legendary John McHugh and Jonathan McEwen his son\nHe started his music and conversations among this week's broadcast [noise]\nAnd then he most artists music in conversations among this week's broadcast\n\nSee the thing is savannah morning radio he's twenty and\n\nShow that\nWho\n\nThe\nKnow\nThe a\nMaybe no\n\nReal well\n...\n\nAnd the pain\n\n\n\nIn New York\n\nWhat well that's a nice touch down there from Steve Schmidt them the sneakers from there crying for mercy album came up back in two thousand eleven that was mama likes as we continue with the bridge here on board or radio before that this ... has a new self titled release weird river water\nOne of my favorite songs from Antonio land before that was collard greens in snail that's from her album banjo grandma's family album and we started that set up with new music for Joe pilgrimage village area in the new album is called step out and we heard a timely tune called migrants\nHey we're going to take a short break we'll be back we've got music from Emily failures starting our next step lesson artist out of the nicks who has a very French sound uh we'll hear more music in just a little bit so stay with us\nBorder radio is supported by Arizona western college now offering extended hours as part of their ongoing commitment to putting students first and improving the college experience for our community\nStudent facing services on the campus are now open from seven AM to seven pm Monday through Thursday learn more at ease the western dot edu\nThis is Thirteen twenty I'm bored or radio K O F bay and border radio easy ... or a service of Arizona west in college are more than forty five years\n[noise]\nI Am you know one of the hosts a new program called crossing borders\nOn board or are you thinking twenty am in Yuma joined us every afternoon from three to seven for next to music from around the world or right here in Arizona they can be heard on the air isn't makes me radio network where he can she must that Kay WC dot org or on the radio effects that for the team at just ... [noise]\n\n\nWe ... you can't go\nIn and it is\nKidding wow bill\nThe big in\nMagic ... shin original founder of the gun powder nation\n\nSky\nCredit or\nOn the man\nTo do and when I'm Around me\nA long gone\nThe things\nOn your gee you\nYou hate all the way you\n\nWe enjoy relaxation stimulation entertainment so I'm like a jazz on the radio tuned in formal education of an art form will take a Sunday evening from seven to mind on board or radio for the ... I'm In Yuma an outline of border radio easy dot org\nBroadcasting from the campus of Arizona western college does its border radio Thirteen twenty am kale at the you might end born and radio easy dot org we also broadcast in Arizona community radio network at eighty nine point five FM cagey C H ... Williams Ninety One F. M. K. J. C. P. press get\nNinety point seven FM cagey seeking men in Ninety One point three ethane Flagstaff\nI'm an ex Celtic Connections we celebrate the ... through our modern day a week with singers like Christie more Mary Black and many more\nThan the current oh\nThis is Brian [noise] go to a group of you to join me for a felon celebration\nWednesday evening at seven on board or radio Thirteen twenty am\nIn Prescott mostly sunny hides near sixty six today south when five two Thirteen miles per hour tomorrow sunny highs near sixty degrees Flagstaff scattered showers possible today hide your fifty six\nTomorrow sunny high near forty eight in Kingman sunny in a high up Seventy three today tomorrow sunny in a high up sixty seven in Yuma sunny hind you're eighty six today tomorrow sunny sky high near eighty degrees\n\nHello I'm ... with the b._b._c. news those funerals are underway for the victims of Saturday's shooting at a synagogue us if you have pets back in ... were killed and wants to be the west anti Semitic attack in recent us history the BBC's junior Brian is in Pittsburgh\nWho called the gathering to pay tribute to pay their respects to the victims I think people will just long members of the Christian Community Muslim and\nJewish communities from all over the city can come to show solidarity with us you know all under way I'd like to call the ... there are a little bit about the victims we have two brothers ... and David Rice and so they were in the fifties\nAnd they had learning difficulties red lights revolved around that cynical played with that was a totally new thing is we have a local physician thought to Jerry Rubin as it sixty six years old but the ... community\nDuring the ... the\nUnited Nations human rights chief which has about you that I think Saudi Arabia that independent foreign ... joined the investigation into the mud or at the dissident Janet ... imaging\nHe's oppressing Saudi Arabia let independent foreign ... joined the investigation into the mud or of the dissident Janet ... imaging folks reports from Vienna\n... said international investigators should be allowed full access to evidence and witnesses to ... ... deaths\nGiven that high level ... officials were apparently involved in his killing she said independent experts were required to ensure an investigation free of political considerations she ... to ... we're a balance of his votes the\nIdea the Turkish president demanded that Saudi Arabia is chief prosecutor stoppage who ordered the king inside that Saudi consulate in Istanbul\nNuts especially to being Germany's with serial killer since the second World War and admitted to getting a hundred if he's for my patients knew who made his confession at the top of his trial in the northern city of holding back detectives say he gave fatal doses of medicine to the victims\nTo hospitals in northern Gemini Jenny Hill has ...\nHas a pattern motives even bought it so I wanted to impress his colleagues that whole that whole by trying to resuscitate the very patients that he had to tax the ... with a wedding solving a life sentence over the deaths of six patients today's trial came about they investigated started to\nExam more than a hundred ... remains of all the patients to hospitals and found significant traces of medication still in the system\nThan most has accused Iran of trying to carry out an assassination on it some real describing Tehran's actions are completely unacceptable\nThe Danish intelligence ... says the target was near rainy an Arab activists living in Denmark an illusion citizen the rainy and background was arrested in connection with the case nine days ago he denies involvement\nWith news from the BBC\nGW seniors in Yuma on jobs but not enough or players representing Pima community college in Tucson took to the field Saturday for their final home game\nAfter ... years of human optic football program was canceled earlier this year due to budget concern than him or fourteen ranked aspect stick to the field against number nine rent it eastern Arizona college Saturday and want to buy a score of twenty eight to twenty six\nCollege chance or lead Lambert told the Arizona Daily Star the college earlier this year at the school needed to reduce operating expenses by about Fifteen million dollars this year leading to the football program being touch\nA twenty Eighteen season will be the last for for colleges and the district the Knicks Scottsdale Mesa and Glendale community colleges\nSays the world series just ended Sunday night air cars are still top of the mind for some fans now and he said he suggests the umpire might not be as mine I ... I Would like to believe in the Arizona science desk Nicholas ... report\nIn baseball umpire stretch for South by watching the base while listening to the ball strike some live [noise]\nBamboo stand do this to but because light travels faster than sound the see the runner reached the bag and I blinked before they attach\nTo test the effects of these disagreeing senses seeking diversity researchers are subject to make calls from various distances based on different sight and sound cues to author Michael Macbeth said as predicted the calls got worse with distance\nWhen you're further away you actually physically experience the world differently so you're convinced that person was safe I clearly saw the foot hit before I heard the sound and the umpires the opposite of\nThe study appears on line in the journal experimental psychology human perception and performance on Nicholas group is in Phoenix\n\nMine in the journal experimental psychology human perception in performance on because group is in Phoenix\nSo we see there'll be more mature molest sense president Donald Trump has visited one of his presidential campaign seen well have that in the next ... News I'm jumping on ...\n... ...\nOh\nNo no off on that level\nDa da da da\nNa na uh oh so you wouldn't dare\nOn the ball\nOh\nNo no\nAt the la\nDi da da\nDa da\nDa da da da\nDa da da\nDa da da da\nDa da\nAnd that's the legendary bb king started another our music force here on the bridge from an L. P. we found a library from Nineteen sixty a call from the beginning that was you know I Love you [noise]\nJune ... by by up\nA new strain my ... well being drawn\nUm they grow so do they\nNow why did that ... you know\nThe industry about ...\nPlenty strong rain\nNa na\nNa na na\nNa na\nNa\n... been known to man the human\nSmuggling she began seeing you\nMuch to begin with the\nAnd that's a singer songwriter Mike Aiken from his captured the cowboys album with save the whales as we did with the bridge on a Tuesday Morning here on board or radio Thirteen twenty yeah\nI can say you must before that supports waters did their new uh track never mind we heard the grad schools with every time and we started that set off with a English artist her name is Khan way\nThat's how she performs any way her full name is ... ... and we heard her new trend woman they were going to take a short break as we sometimes do we won't play any commercials or anything like that but that will be back in about a minute or so with new music from blue water highway hope you'll stay with us\nIs border radio day sponsors or bill and Marcia pike celebrating their return to you know for the winter they appreciate border radio for providing GOOD Music and news to our entire community villain Marcia encourage their fellow winter visitors to join them\nThey appreciate border radio for providing GOOD Music and news to our entire community villain Marcia encourage their fellow winter visitors to join them and supporting border radio as the pike ... done for more than Twenty years\nYou're tuned into border radio on Thirteen twenty am Fe and border radio ... or we also broadcast on the Arizona community radio network\nIn Yuma sunny with a high of eighty six and north northwest when ten to Fifteen miles per hour today to nights mostly clear lows around sixty three Kingman sunny I near Seventy three today clear tonight with the lowest forty three in Prescott mostly sunny and the highest sixty six today\nMostly clear with the lowest thirty for tonight\nAnd in Flagstaff today scattered showers possible hiding your fifty six tonight the chance of showers and a low around twenty eight\n[noise]\n\nNo no no\nNo you\nYou know\n[noise]\nThat's a new group they're called ... have been the humble their new album is called we're all the same and we heard the sun's gonna right don't be sad if he could do to bridge on board or radio before that Charlie McCoy did some up blue is hard for us but it's hard for the blues album came out back in Nineteen Seventy five hundred the Columbus stocky lose\nThe ban Kobe did cool baby and we started that set off with blue water highway their new album called heartbreak city we heard a track called best friend\nHey we hope you'll stick around for more to bridge here on board or radio you got to take a short break we'll be back in a minute I've got some Donovan coming up and we'll start the next segment some river city junction so stay with us\nBorder radio is supported by visit you presenting large of been such as the Rio de surveys to brew fast unique activities like agricultural tours in providing current information about the ... area learned more online at ... dot com or at the visitor center in the ... crossing national heritage area\nThis is Thirteen twenty forty radio Kate oh essay and border radio easy dot org a service of Arizona watching college for more than forty five years [noise]\nA brochure first produced by the Arizona highway department in Nineteen twenty five Arizona highway devolved into one of the most respected and rebuild publications in the world\nJoin K. A. W. sea and retired Arizona highways publisher when holding\nAt the next spirited discussion to learn the story of this remarkable magazine Wednesday November seventh from five thirty to seven at St Paul's cultural center for information does it K. A. W. C. dot org this have been made possible in part by a grant from Arizona humanities [noise]\nNo no no no I'm I'm\nA I'm\nA I'm\nI'm\n\n\n\n\n[noise] [noise] [noise] [noise]\n[noise]\n... ... ...\n...\nAnd he told me\nMorning man ...\n\n...\n\nYou\nOr change\nThe\nIt\nShould\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n\nYou\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n... ... ... ...\n... ... with an island\nWhich laid before the great flood in the area we now call the Atlantic ocean\nSo great and that is learned from a western sure\nThose beautiful Salem journey to the\nNorth Americans but the ... in this ship with ...\nAcross the sure they were ...\nTo ... to ... inches but I've been to ... come to\nThe end to the movie and the genes colonized the world\nOver the gun to play in the mythological drama and all that jumped from", "show_name": "The Bridge", "year": "2018", "city": "Yuma", "day": "30"}