{"month": "10", "state": "GA", "station": "WABE", "content": "Wait a minute and then I just think it's like 'cause no one really gives white kids those types of like you know stories and I think is because like there aren't really those types of stories to actually like it was like I don't\nI don't know tell them about like Ted Bundy if you wanted to like really relied privileges for an eye on\nYou know we have to go to for those who don't know Emmett Till was a young man who was murdered by a mob and the town of money Mississippi allegedly for whistling on a white woman we did an interview last year with a man named Tim Tyson who wrote a new book\nAbout the Emmett Till case he interviewed that woman Carolyn Bryant who eventually confessed that she lied about accusing him until of having whistled at her you'll find that\nInterview with Tyson on our website the one eight dot org I Know we got to go but Steve let me give you one more last word before I\nI just wanted to say one of the things that was interesting about this process of being in the film for subjects and including Brandon's dad who we heard that clip from is the being in this series gave him more opportunity to reflect on and think about and talk about because we press people on these things then\nHe would have a news everyday life and I think the experience of being in this documentary has deepened his understanding to of that experience so it's kind of thing you know we can do a film on people and do it but we we need to do it more of the community\nSteve James the director of the ten episode documentary series America to me airing now in star Steve thanks for talking to us that\nCharles Nelson former student in Oak Park river forest high school in Oak Park Illinois thank you Charles thank you professor Emmanuel Lewis of the University of Illinois at Chicago the director of the Institute for research on recent public policy takes professor in front of\nAn African American studies professor David still will also at the University of Illinois at Chicago Thank you sir thanks so much for having me this program was produced by page Osbourne and Lindsey foster Thomas thanks also to W. be easy for hosting us today this program comes to you from W. A. M. you part of American University in Washington distributed by NPR\nI'm Joshua Johnson we'll see you tomorrow from Atlanta [noise] this is one egg [noise]\n\nSupport for NPR comes from this station and from Jane in Gerald catcher supporting the children's movement to Florida dedicated to helping all children entering school it's a social emotional and intellectual skills needed to succeed more information is available at children's movement Florida dot org\nFrom the John D and Catherine T MacArthur Foundation recognizing exceptionally creative individual this year's MacArthur fellows and more information alright max found dot org\nAnd from Americans for the arts\nFifty years ago the threat came from Russian nuclear missile stationed in Cuba nowadays president pollutants weapon of choice seems to be poison\nMoscow pay the price for targeting an elderly retired spy with a deadly nerve agent but what does Russia up to ... and who's next to the St Paul file next on on one a week nights at ten Ninety point one W. A. B. [laughter]\n\n\nNinety point one W. A. B. E. Atlanta your choice for NPR\n[noise]\nSupport for WABC comes from city springs presenting Prague philharmonic children's choir who's beautiful sales will feel buyers theater on Thursday October twenty fifth you can experience the wonder of these children's voices on October twenty ... springs dot com\nIt's the time of year to think about the tax benefits of donating your used car trailer or even motorcycle to Ninety point one learn more by calling one eight six six nine zero one W. E. E. or on line uh WABC dot org slash cars\nFrom Simpson the whole of the ... center W. H. B. E. brings you were broadcast them the lab a symphony orchestra I'm lowest bright says thanks for listening\nThis concert was performed in November and music director Robert ... bond there was on the podium to conduct the orchestra in smaller than the number seven\nHour program open with music by the German romantic you're a composer Robert ...\nThere were himself eight PM it shoe mom also were door that cello ... shine through in every moment of his cello concerto he\nWrote a piece in Eighteen fifty there didn't from year to a decade later for years after the composers that\nSince that time\nThe concerto has remained a favorite of the world's greatest cellist including the soloist Stephen ... here with conductor Roberts bomb there\nAnd the laughter symphony orchestra performing the Chandler couldn't share in a minor by Robert [noise]\n\n\n\n\n\n\n\nWe're ... we're going to go\n\n\nMm\n[noise]\nThe first to the great ... pieces in that ... the CIA and the concern there in a minor written in Eighteen fifty by Robert ... we heard a shoe mom\n... that's the lower the English Channel they see the survey with conductor Robert bomber and the lab a symphony orchestra ...\nJim dairy channel is a blue ... saw once described the shoe mountain concerto has one of the finest works one can hear from beginning to end the music is supply\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\nNah", "year": "2018", "show_name": "Radiolab (NPR)", "city": "Atlanta", "day": "25"}