{"month": "10", "state": "GA", "station": "WABE", "content": "That does kind of ... one of the premises of the movie which is that Jack's character says you can't reinvent yourself you can't become this\nDifferent artists and yet Bradley Cooper changes his voice an octave so he doesn't sound like Bradley Cooper and Andrew dice clay who has in his comedy been a horrible human being becomes a nice loving father so some of the choices in the movie itself\nBut why jacks complaint that you can't become\nA different artists as your career progressed tricare but go ahead and go ahead and do it and I just\nWant says Andrew dice clay plays a loving father who is also however at at patriarch who um himself wished he had been at a famous singer I'm you know written he plays those Frank Sinatra lines for last you know people said he was like Frank Sinatra but\nIn a strange way that character replaces the daddy elements of previous a male protect it so like for example the James Mason Norman main character played against Romney Garland um he felt like a daddy he felt much older and\nAnd you know really patriarchal guiding her career I feel like the Andrew dice clay character is not entirely sympathetic and this is you know maybe a radical reading but I feel like hey right right this is why this character in this Lady Gaga except\nThis other daddy we got to go on right now that I'm older and our critic and correspondent for NPR Linda Holmes of NPR's pop culture happy hour podcast John horn hosted the frame from key PCC thank you all for being with us I'm Joshua Johnson thanks for listening now this is one day [noise]\n\n\nSupport for NPR comes from this station and from the Charles Stuart month foundation supporting efforts to promote adjusts equitable and sustainable society and it's home town of Flint, Michigan and communities around the world more it mocked dot org\nFrom the Epstein Family Foundation in support of the David Gilkey ... amount of memorial fund established to support NPR's international journalists their coverage and their commitment to providing the news of the world to audiences back home\nAnd from Americans for the arts\nYou can sum up during my caissons activism in forwards show up dive in we have\nTo be on the inside can't just be an out that only strategy and that is very different than it was before Trump won since Michael Brown was shot dead in Ferguson, Missouri McCutcheon has become a leading voice and the lightning rod in the black lives matter movement now selling his own story next time on one a week nights at ten on Ninety point one double A. B. [noise]\n\nYou're listening to Ninety point one W. A. B. E. Atlanta where a T L meets NPR [noise]\n\nFor WABC comes from community foundation for greater Atlanta serving our ...\nAnd for almost Seventy years powering your philanthropy with assets like appreciated stock and business interests for taxi efficient giving learn more at sea of greater Atlanta dot org\nWith fuel prices climbing you may be rethinking keeping that gas guzzlers why not donated to the W. H. B. E. vehicle donation program it's easy just call one eight six six nine zero one W. H. B. E. or go on line to W. H. E. dot org ... thanks\nIt's easy to look at the headlines to get a sense of the nerves were looking for people who can provide the events that bring Super Bowl to life\nDistracted driving is an unacceptable behavior and will not be tolerated in this state our state is moving forward and trying to do what was necessary to expand traffic and this high traffic you're\nAll things considered dig into the center of the story to help you really understand not just what's happening but why stand with the facts weekday afternoons at four Ninety point one W. A. B. E.\nFrom symphony hall of the ... center W. A. B. E. brings your\nBroadcast stuff in the U.S laugh a symphony orchestra I'm Lawrence Wright says thank you for listening this concert was performed in October and guest conductor Ludo Vic more low was on the podium\nLater he'll eat the orchestrated in works by two French composer offer aid to cheer and ...\nViolin as straight Shen will be the soloist in pro coffee at second violin concerto and the program begins with music by Leonard Bernstein\nWith his two per tenure as music director of the New York philharmonic as well as his work on Broadway Bernstein will always be associated with New York city his roots however we're in Boston\nHe was born in Lawrence, Massachusetts graduated from Boston Latin school in Nineteen thirty five and then attended Harvard receiving his degree in Nineteen thirty nine [noise]\nFollowing studies at the Curtis Institute of music Bernstein became the assistant at Tanglewood to Boston symphony orchestra music director search crews that fits ...\n\nBernstein maintained to close association with both of Boston since ... Tanglewood for the remainder of his life\nIn Nineteen eighty Leonard Bernstein wrote his ... meant to commemorate the centennial Murray of the Boston symphony orchestra according to the notes by jak got late that appear as a preface to the score\nLeonard Bernstein ... is an expression of his love affair with the city of his youth and it symphony orchestra\n[noise] it is and the style checked album filled with affectionate memories of his growing up in Boston\nAs Bernstein himself commented ... wrote his symphony of songs commissioned by the B. S. so in honor of its fiftieth birthday he dedicated the work to the glory of God and the Boston symphony orchestra\nThis dedication he lifted a witty reaction at that time [noise]\nThat's what you call making the best of two worlds at walk\nIf I dare to put myself in struggling skis league\nI follow his example by having the double dedication to the Boston symphony orchestra and my mother or I might even go on better by offering eight triple dedication\nTo the Boston symphony orchestra my mother and Boston I old around town [noise]\nBernstein intended the opening movement Senate since ... kits\nAnd illusion to Shakespearean direction for fanfare to comprise the entire piece however the work soon blossomed into its final eight movement for\nEach of the brief movement is based upon to pitch it be for Boston and see for centennial\nWhile the developmental scored for a large orchestra separate lives the movement stop light individual instrument family\nThe waltz is scored only fourth district that's succeeding ... features the double or read the instruments and the penultimate blues movement highlights the brass and percussion\nThe work is ... ... ... to the repertoire which which Mr Bernstein grew up in symphony hall so I'm quite obvious others more secret message it's for the players themselves\nMuch of Bernstein's Tibet her mentor was in a light hearted fame that fits its title however the final movement opens with a trio for flute titled in memory\nIt moving tribute to the conductors and members of the Boston symphony orchestra no longer with\nA brief segue resolve to the lively concluding march that celebrates the past and future legacy of the composers loved home to our network is ...\n... is our conducted the world premiere with the Boston symphony in September of Nineteen eighty [noise] we'll hear the lab a symphony orchestra with guest conductor or a little bit more low in this\n\nOh\n\n\n\n\n\n\n\n[noise]\n\n\nThe ... symphony orchestra with guest conductor need to be more low performed diminished men to buy Leonard Bernstein she broke that he used to celebrate\nThe one hundredth anniversary of the Boston symphony orchestra we heard that as part of Leonard Bernstein's some tendency being observed by the last ... symphony in conductor Robert ... throughout this see\nThis is W. H. B. E. act like I knew what was right ... thank you for listening\n... cough yeah wrote his second violin concerto in Nineteen thirty bombs and it's one of his most lyrical ended with the war will your rage and that's the lowest now with the laugh it's been to New York is\nConducted by Ludo be more [noise]\n\n\n[noise]\n\n\n\n...\nOoh [laughter]\n\n[noise]\n\n\n\n\n\n\n\n\n", "show_name": "Radiolab (NPR)", "year": "2018", "city": "Atlanta", "day": "11"}