{"month": "11", "state": "GA", "station": "WABE", "content": "Me ruin it but you know vampire movies have have tended to follow the the uh one pattern and this just completely turn it on his head\nAny possibility we might get another John Carpenter horror movie out if you're one of these days\nAbsolutely I I ... I probably will do won anything in particular\nKind of topic or subject are focused that that interest you in terms of a backdrop for a horror movie\nWhile there's a whole bunch man it just depends on [noise] see I'm an old guy now and I\nHave to take things easy so I don't want a horror movie that challenges me like a I don't want to go back to the Arctic and shoot this like I did and the thing so um it'll have to be in a house\nSomething that's got a pretty easy location shoes\nFans of yours are real familiar with your theme to Halloween ... were there any other tracks particularly from the remake from this year that you were most proud of her that stood out to you that you really kind of experimented with or any other tracks from the new movie that that you maybe take particular pride in\nYes there's one uh this one track from the new soundtrack that I Love a lot and uh if if you buy the soundtrack album it's just the ... called\nThe shape tons Alison [noise]\nA\nPiece of music or something\nYou can't talk about music and words as music is beyond more\n[noise]\nJohn carpeted it was a pleasure thanks for talking to us thanks for talking to me remember you can subscribe to want to his podcast on the NPR One act or whatever you like we'd love it if you'd write us to review and if you're new to podcasting you'll find all the links to listen online\nAt NPR dot org slash won a today's conversation was produced by page Osbourne you can learn more about her and the rest of our team on line at the one eight dot org slash staff\nThis program comes to you from W AMU part of American University in Washington distributed by NPR until we meet again I'm Joshua Johnson thank you so much for listening heavy safe and\nThis is one a [noise]\n\nSupport for NPR comes from the station and from the Alfred P Sloan Foundation bridging science technology and the arts my\nSupporting exhibition such as program to the Whitney Museum in New York City on view through April fourteenth more at Sloan dot org\n[noise] from the doors do charitable foundation whos clinical scientists development towards support promising early career physician scientists and their research efforts to improve human health\nAnd from the sustaining members of this NPR station\nHow easy should it be to vote poll suggests there's overwhelming bipartisan support for laws that require people to present a government issued id\nBut democratic and Republican lawmakers have taken different strategies on changing the rules the fight for free and fair mid term election next time on one a week nights of ten on Ninety point one W. A. B. E. [noise]\nYou're listening to members supported Ninety point one W. A. B. E. Atlanta [noise]\nNow is the time to donate your vehicle WABC there's no need to wait until the end of the year in hopes of the tax\nDeduction just call one eight six six nine zero one WHAT eat or learn more uh WABC dot org slash cars thanks\n\nFrom symphony hall ... center W. H. B. E. brings you broadcast that would be a lab as symphony orchestra ... says thanks\nSnake this concert was performed in November\nPrinciple guest conductor Donald ... cold sweats on the podium to lead the orchestra AS so ... so low or his in a monument to work the requiem by two separate verity\nThough very happy little years for organized religion and deeply does trusted the Catholic Church the requiem mass ranks among his greatest achievements alongside his finest opera\nThat peace has its origin as part of a composite mat for composer ... death in Eighteen sixty eight verity he had written the the barrel may portion\nAt the time of first seeing the stats Verde cold him one of the glories of is asking for it and the other one who still live there is no more what will we have left\nThe other one was only some girl ... a celebrated poet and author who's lamb mark nineteenth century novel he pro ... see the be true\nTells the story of a young couple in early seventeenth century Italy separated by political and social here in\nThe work resonated with many foods like verity wanted the overthrow of foreign rulers and the unification of Italy\nVerde himself called ... trove not just a book but a consolation to all ... ...\n... died in May of Eighteen Seventy three Verde return to the idea of a requiem and completed that some months later\nHe conducted the first performance on the one year anniversary of ... death\nMay twenty second Eighteen Seventy four at the church of San Marco in Milan\nThe work is school for so look court tacked mixed chorus and an orchestra\nAfter the premier some critics said that the music was to operatic to overt really dramatic for is sacred text\nI asked one of the so Lewis some we'll hear in this performance her opinion ... soprano Jamie bart ... is among the world's most acclaimed opera stars and inexperienced church saying\nWell you know it's it's often joked among my colleagues that the Verde requiem is very nice greatest opera\nYou know it's it is actually won the opera companies do Houston grand opera did it not long ago the met is doing it right now you know so it it is something that offer companies do put on because there is that sense of drama that sense of\nOverwhelming power that comes from every single angle ah that very wrote it from but at the same time you know I think it is a piece that is perfect for something like the concert stage\nYou get to have the focus of the music from the band from the the chorus behind that you get these four so a sun front it it really is kind of a [noise] a team sport\nAnd I I think it works really really well it is absolutely dramatic but I tell you me as an audience member I Love that I Love going to pieces that are going to just blow my wig off\n[laughter] you know even in church even in church even in church you know I think some of the most spiritual experiences I've had have been through music\nAnd it's been through anything from the most simple like a Steven Hollis pilgrims him\nTo the ... of the Verde requiem it's a completely different effect but isn't that the point he was very skeptical about religion and it's ...\nMistrust full of priests yeah\nBut he wrote this piece for the glorious God mhm so was he jumps mellowing with what we're where where do we make of this you know self proclaimed self celebrated eight yes yeah writing this magnificent sacred were\nWell I think that that goes into a\nPersonal question of of where you think inspiration comes from\nI I I grew up as a Christian I still consider myself a spiritual person I Would say that I have kind of departed from the maybe base Christian beliefs but that being said I find absolute inspiration and this and spiritual way\n\n... years\nA\nMan oh\n\nRight\nRight\n\n\n\n\n\n\n\n\n\n... ... ...\n...\n... ...\n\nOh\nOh\nOh\n\nOh\nMm\nMm\nMm\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\nNo\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\nNew\n\n[noise]\n\nOn\nOn on on\n\n\n\nA\nOr a\n\nA\n\nYou\n\n\n\nWho\nMaybe ooh\nHe he's long\n\n\n\nBeen calling me\n\n\n[noise] well\nThe the\n\nThe\n\n\n...\nWhat's the name of it too\nLow and you know\nAnd\n\nUh\nWe\nHave a\nYou know I\n\nDon't\n\nKnow no no no no\n\nNo oh\nNo no not really what about you know\n...\nOh\n[noise]\nOh no\nWe're off more than\nOh oh come on the phone goes off\nAnd oh\nMm\n\nMm\nWhoa whoa whoa\nWhoa whoa whoa whoa\n\nWhoa whoa\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\nOn to that\nMany\nOn\n\nNews", "year": "2018", "show_name": "Radiolab (NPR)", "city": "Atlanta", "day": "01"}