{"month": "10", "state": "DC", "station": "WMAL", "content": "They dishonor our flag and our veterans say ridicule are traditional beliefs they sell at our jobs to China to raise our taxes they shut down our minds they want to open our borders and abolish ice\nBailout criminal illegal aliens to assault our daughter's murder our sons and deal drugs the Democratic party of today as an ... an angry mob of dogs and Tim Kaine tells them to fight in the streets and get in people's faces Tim Kaine wins or the Democrats take control of a sudden it it will get worse\nMuch worse I'm Corey Stewart Republican presented by approve this message an atmosphere vote because assigned Virginia had a senator who sounds worth working Americans not\nAbout ... percent it why approve this message an atmosphere vote because assigned Virginia how to senator who sounds worth working Americans not angry mob\nPaid for by course or for Senate gory stores dotcom\nWMA eleven would rich W a Mayo Washington Washington election headquarters and on\nTell me what\nAre they all knew that three more we'll leave well we're in the final count down to the midterms in Virginia governor Ralph Northam says he thinks there'll be a blue wave and the commonwealth\nI think as many as four seats could could change in Virginia\nOne congressional seat Democrats are hoping to win back if the tent district one now held by Republican Barbara Comstock Democrats seem so confident challenger Jennifer Wexton will win that seat that the largest pac supporting the party the house majority pac has canceled an eight hundred thousand dollar ad buy in the district according to advertising analytics\nBut I can tell you we're not we're not taking any chances not taking anything for granted and we're going to run hard and to seven o'clock Tuesday even hotter\nCurtis ...\nIs our defense secretary James Mattis talking about his department's decision to send fifty two hundred an active duty troops to the southern border in advance of migrant caravan that could reach the U.S border on a few weeks in speaking to reporter he was asked today at the deployment was a political starch\nYou know the support that we provide to the secretary for homeland security is practical or support based on the request from the commissioner\nOf customs and border police and so uh we don't we don't do stunts and this department to\nThe president winning about immigration\nThere's no indication the president will issue an executive order between now and election day but he remains fixated on the immigration is voters go to the polls he tweets so called birthright citizenship which calls our country billions of dollars and it's very unfair to our citizens will be ended one way or the other it is not covered by the fourteenth amendment because of the words\nSubject to the jurisdiction thereof many legal scholars agree\nCouple that with the Central American migrants human trained in Mexico as a president rights we will not let these caravans which are also made up of some very bad eggs and gang members into the U.S must come in legally turnaround bumped off the TV the wind\nNever all Democratic senators want a classified briefing on slain journalist Jamal 'cause she'll game\nSeven Democrats an independent Senator Bernie Sanders want to know what the U.S intelligence community knew about threats to the U.S based journalist who was murdered the Saudi consulate in Turkey\nIn a letter to the director of national intelligence to senators wrote Congress must understand the circumstances of Mr ... disappearance they also want to know if the intelligence community had warned ... about threats to his life\nThey noted the Washington Post reported the U.S government had intercepted communications from Saudi officials discussing a plan to capture cause she'll Jay Lynn to Kenya on Capitol Hill\nEven before the Pittsburgh synagogue shooting police in Montgomery County had started offering safety training for houses of worship\nNo your surroundings whether you're at your synagogue your church or mosque wherever you are in no the nearest exit\nCaptain Liz hadn't bird director of community engagement division leads the training sessions\nAnd the three things they say is avoid denied defend if you can avoid it get out of the area if you can lock yourself in a room lock yourself in a room to police get there to assist and the last one is the fan if sometimes that's probably your best answer\nBarbara ... W on the L and W. M. A. L. dot com with your mail traffic in whether an extra\nY win\nWin for Katie my W. M. A. L.\nShot at one thousand dollars happened more time we name is Margaret and\nTerrible you M. A. L.\nSuch a way to love animal people would want to pet\nHim and they cannot get close to him and it would be this is my dad didn't want to touch like get the dog away from me even after we'd give her but she would still stay very think evil bad breath and gas and he said some dogs are they actually\nDoes your dog ditch scratch stink worship like crazy come to nine of pro\nGay I. N. O. V. I. T. V. omega three fatty acids they think they're digested any by over that are cooked out of regular dog food\nThey agreed to me that it was definitely worth trying after about a week he started selling normal my husband and I were really kind of gone are kind of\nFight is Tricia eight five nine four one K. I. N. O. V. I. T. S. dot\nYour carpets cleaned then you need hobbies to go to Joe ... beads tied quarters a day you can sponsor a child through compassion international it's pocket change do you have a life changing for a child in may be part of the change become a sponsor\nDr quarters a day you can sponsor a child through compassion international it's pocket change do you we it's life changing for a child they may be part of the change become a sponsor now with compassion dot com slash radio compassion dot com slash radio\n... weather here that Rodriguez and they had the carpet cleaning products enter\nAnd his word has sponsored by compassionate international on the inner ... what a mess were hardly moving from the Springfield Interchange of that crash still blocking the to ride lanes between the expressed planes and Braddock wrote this solves out Ninety five north bounce from the Fairfax County parkway and three Ninety five southbound permits wrote in Laurel\nSounds on Baltimore Washington Barclays Jim from one Ninety eight to a crash that closes the parkway between one Ninety seven in the Patuxent River bridge\nKnocking garage or your dot com WMA el Weather Channel ...\nCounty tonight little fifty nine heart like honey tomorrow high seventies thick behind that Reagan National time a real nice on Washington Mall that will give them A L\nFor the national keyword when\nNine five eight nine ... nine five eight or nine again W. I. N. nine five eighty\nOne I Will be backing them from your rent free and that's why I Want to be able to you and a\nUp in generic about this show no surgery and by the way for the record hits Snickers\nAnd kick cat in that order [noise] I'll be honest Snickers and reaches constantly competing for the top spot this year it Snickers 'cause I'm In a new get kind of move\nBlurry O'Connor here on malaria counter show W. M. A. L. a happy Halloween to you all and I hope you're having a very fine\nSugar Russia or free sugar rush and I hope you gave a lot of crap to that one guy who showed up in costume and the office by the way really nailed it yesterday we do have someone dressed as a kid he kept in our office [noise]\nHow did she know that was that was remarkable coming up we've got representative Barbra ... in the next hour making her final arguments the use of voters Virginia Tech also Kaylee Mac in any given us a look at the national\nOutlook on the midterms coming up next Tuesday John not going to join us at the bottom of this hour\nGive a reset um the mass shootings over the weekend at a lot of the fall so you've heard in the media all that common up but first\nReally is I Swear it's pretty close to being the final countdown as the midterms are now well let me put it this way one week from right now\nWe will know exactly who the speaker of the house will be we will know who was representing you around the greater Washington area we will know Larry Hogan will have his second\nTerm as Republican first time since the fifties the state of Maryland will ... will know answers to all of those questions will do the next two years will bring impeachment hearings in the house or if the next two years will bring us more tax cuts in the house that's really\nThe simplified version of what this election is all about I and I want to hear from you I Want to take your temperature I Want to know how you're doing right now because the news cycle lately and a lot of the things you're hearing in the media might be bringing you down it might get you down hurt it it might make actually feel like maybe\nThe Republicans are not going to hold the house that the Democrats are going to win I mean here's Nancy Pelosi last\nNight I think I Would guess Chad election were held today we went down and saying we've always [laughter]\nAnyone\nRecognize how completely non ... tend\nTo go that statement was it like a ... really literally\nIs nonsense but she was saying\nWe're going to win and oh boy that's getting so much press the fact that Nancy Pelosi the leader of the Democrats in the house is now saying that she certain that she will win the majority\nNext Tuesday is big news that headline making\nA if you're in the media and you want to push that message I guess that's what makes it news so it's everywhere now and I want to know if you're feeling down hearted or if you are feeling motivated if you are extra motivated if your beyond motivated\nIf I see you tomorrow night at Chris plants politics in a pine are you going to have that same energy and fervor that you had just a couple of days before election day twenty sixteen\nHowever due to climate of these crazy lambs\nI did go out and I ... and early I bet it all Republican I Want them to the show whether Marilyn guys Republican or not I want them to see that we are behind Donald Trump we want our border is secure\nWe want a change in this country we want to preserve our constitution our heritage many things that I feel like Trump is demanding\nDo is you know did he have you noticed something I I didn't do this on purpose but other than our our one friend down there and King George everyone who was jumped on board here was so much spirit and energy you're all women you're all women who live in the suburbs of Washington D. C. you guys are supposed to be the secret for the Democrats this time around what's going on here Debbie\nWell you know Larry I started to\nOh women who live in the suburbs of Washington D. C. you guys are supposed to be the secret for the Democrats this time around what's going on your daddy well\nYou know Larry I started to say that it's not just he gave that live day you've got a very strong things that women that are Trump supporters and quite frankly what scary Larry\nI don't even talk about on Libya I Can't talk about it at work ... ... if you do you will get flak\nNow where are the silent majority but let me tell you if they keep trying to take over our country there I see that fountain majority ride these shaken a tiger\n[noise] All right Debbie great to hear from you a great deal from all of you the lines are absolutely jammed in so far none of you are depressed number none of you are taking the bait none of you are ah are down in the dumps and Moby because you'd think the Democrats have this I mean listen to her again\n... ... ... ... ... ... is not going to be president of the United states ... brown county\nAnd take it to the bank that was two years ago and last night\nI think she would have had election were held today like when I sang a sleeve away [laughter] there you go take it to the bank\nGuaranteed well she was wrong then as she wrong now you tell me a triple a security WMA L A more of your calls no woman and I think you've earned it we're going to give you the pay off on this great montage beyond all the false predictions we're going to play for you what actually happened on election night\nTwo years ago almost two years ago this week we're going to play that pay off so you can remember and feel it now so you can take it right into early voting for him here right now it's three Twenty one month ... committed\nRodriguez and the carpet cleaning\nThis report sponsored by compassion their national it has been a rough afternoons still is on the Baltimore Washington parkway is closed southbound in Laurel ... from one Ninety eight down to the serious crashed they brought a medivac in between one Ninety seven in the ... river bridge I've got some good news about the ...\nBetween the Springfield Interchange and and until they got all the crash activity finally over onto the shoulder lanes are open still going to be a slow ride coming up from the Springfield Interchange now from garage door repaired outcome WMA oh Weather Channel forecasts [noise]\nHow 'bout that whether it's looking good actually pretty pretty nice tonight with overnight lows of fifty nine degrees that's how warm it is it's going to be a great Halloween don't make your kids put the overcoat on over there ... they're proud of their customers\nTomorrow partly cloudy skies above ... Seventy six that beautiful weather we've got right now right now we're looking at sixty seven degrees at three twenty two\nWhen you expect more you get more roofing and more I on the dot com\nSay here's what they're telling me about now it's ... ... draw the line you know we had the bags and the ... we had the crows feed we got the laugh lines now we're talking about the sagging draw a line\nThat double chin that's what gives your age way even worse it makes it look older than you are really are but not anymore\nKenya sell now has a jaw line treatment would do a peptide it M deal technology yeah you heard me right Chinese most advanced technology ever now he tightened sake you draw the line but a plump the light bill Phillips layers of your skin and let me tell you some gentlemen if you have not been with a woman\nWith pumped up ... layers you don't know what you're missing\nNo one else has this technology that ... has it's a proprietary chemical free base so you're going to say goodbye to that double chin right now and the best news you get it for free when your order Jan yourself or under I'd bags and puffy enough\nFor results in twelve hours you're going to get tenure those immediate effects for free as well as to ...\nGo to Jenny dot com or called eight hundred five to five twenty seven twenty imagine this imagined the double chin disappearing it about a week with Virginia so draw a line treatment\nIt's a hundred percent guaranteed or your money back alright stop imagining and just call or click right now eight hundred and five to five twenty seven twenty or ... dot com that's January ... dot com\nMegawatt how why lower my Novak electric bill\nAccording to the savings ... dot com you could save up to three hundred dollars per year by using a smart thermostat\nKeep it set a sixty eight degrees per heating when you were home and lower as several degrees when you were a way\nTo do [noise] you know I depend on electricity [noise]\nTo shake your electric bill go to know that dot com\nThere's a lot to do this fall in DC but you know what there's not a lot of convenient parking fortunately you can reserve the closest to your destination in advance was funnier or\nWhether you're catching a game exploiting the district shopping in Georgetown or just sitting down for some fun spot hero is therefore you\nSimply download the spot hero lap and type in your destination spot here and we'll show you the closest parking spots in prices you can even get ten dollars off your first firefight using ... fast on the app that's ten dollars off with from us coach fast spot hero park smarter\nIvy crush I teach our mission is to keep a electronically\nYeah yeah that's ten dollars off with promo coach fat spot hero park smarter\nId crush I T our\nMission is to keep a electronic way out of local landfill were dedicated to reducing eat wings and its environmental impact into recycling refurbishing and read applying ti equipment\nServing northern Virginia Maryland and Washington DC are dedicated staff is highly experienced in the IT field if you're an IT professional looking for reliable electronic disposal for your business does it eat crush IT down ... ... e crush IT dot com or call a three three to crush the crush of tea is down in technology company\nIt didn't take long for deep breath to go Washington a red is already taken nearly one hundred thousand dollars in campaign cash from pharmaceutical ... insurance and health care company a voting them billions in tax breaks\nWell voting against lowering the cost of prescription drug Brent even voted got protections for people with pre existing condition the bread claimed he was different you know\nI'm Abigail ...\nI was proud determines the eyeing lighting ... protecting America and\nDo the same in Congress to keep the economy growing in ...\nWork to lower the cost of prescription\nI pledge to continue serving you\nNot a political party not national interest not any party leader\n... asking for your vote on November ...\nAd against hamburger candidate for Congress and I approved this\nAid for ... for Congress\nId November sixteenth that he'd be a better rubber deeper reload performing arts center and legendary lead singer of the gas who were coming in his\nIncoming scored in unprecedented string of international hit with Canada's original rock and roll superstars but get to\nYou'll miss burden coming legendary lead singer of the gas to write a November sixteenth a piano Robert ... Center for the performing arts Montgomery College Rockville campus Montgomery College dot edu slash the AC\nGraphic and whether the day's top story and you know the delivery O'Connor's shell Democrats\nWill carry the house and Senate governorship quake hike for mass [noise]\nAre you depressed [noise] or does\nThat just make you fired up after you remember all of these predictions all of the bowl bold predictions made two years ago that they came crashing down on all of their\nHead or how about Scott in Virginia Line three Scott your next step on WBAL how ya doing they hey what do you think\nWell I'm telling you now it's going to take a nuclear Holocaust to keep me from getting to the voting on election day I I even think I'm going to try to find a way of getting around and the Holocaust if I have to\nTell you I think there are more people in this area that are more fired up for this election then they work for the presidential because in a way for Maryland and Virginia it was already sort of bacon the cake I\nCannot agree more I tell you the more I hear the anti Trump the anti American but make make America great the more fired up I get All right is it is just it's almost like a a red flag to a ball\n... Scott why you're not alone man I Am shocked at the energy I'm seeing on the phone I you know what let's let's get the payoff we've heard all the bold predictions from two years ago now let's remember what happened that night\nIn fact you can talk to their\nLittle because\nAll vote I own a\nTitle to\nAnd according to the statistics that you put forth Seventy two percent of mass shootings in America I'm ... ... are committed without any mention of any sort of politics at all there a political events\nThe next biggest segment is ten percent and those are people affiliated with Islamic extremism\nThat's eighty two percent right there either economic extremism or no politics at all so I I guess the question is why why why do we have so much nasal gazing in the wake of this this last a shooting\nA with regard to within the context of American politics is that I mean they're just\nWe have so much nasal gazing in the wake of this this last a shooting a with regard to within the context of American politics is that I mean they're just they're just being pretty deceitful was that conversation\nRight well I mean to say for me it's harder to go and figure out what's going through people's minds what it will say I mean if I were to just yes uh I think Trump ... had jobs not mom was fairly effective slogans and so I think\nThe media I mean if I had to go I think the media this is kind of their way oh\nYou're you're calling the Democrats a mob look at your mob killed somebody that's interesting you know you know John what you've been watching the ... the media coverage of these things for years now and uh you know I've got to think this guy used and they are Fifteen\nAnd he killed his bed or tragically and in in a very evil way killed a bunch of people as they were worshipping in their synagogue\nIf if this were any other political climate wouldn't so dominant conversation about gun control in about a are Fifteen and and and and and the type of weapon used isn't it fascinating that they chose not to have that conversation this time around\nRight well I mean you have plenty of politicians who immediately came out on Saturday for more gun control you can find quotes from Nancy Pelosi and uh you know the governor of Pennsylvania and others who did that but my guess is\nThey're playing the long game here and they think laws are as it may seem like going after Trump for supposedly inciting somebody who actually hate the Trump uh and uh making Trump somehow peer uh anti Semitic coming here\n[noise] columns like a a Max Boot column in the Washington Post yeah earlier this week and others which\nYou know it's amazing the gymnastics that they're willing to go through to call a President Trump anti Semitic\nYeah and not not just you know it's a medic but also an anti Semite who inspires another anti Semite murder innocent people which is which is such a despicable slander\nTo me the media bias here it's\nJust been overwhelming and President Trump when he came out on Saturday and said that he didn't think the types of gun control laws would that are being pushed would help and I think he's completely right on the and then said he wished somebody there had a permanent concealed handgun\nReally just made the media go ... if you listen to the poor virtually all the Sunday Morning talk shows\nAnd they were basically indicating that he didn't know what he was talking about but the irony to me is that\nSeveral of the shows brought up a shooting a that occurred in Louisville last week where a man with targeting black and they would quote the fact that the shooter said why don't you why you\nWrite I saw that report it I saw that report it everywhere John yeah\nRight but they leave out the beginning of his boat and why he sat at the beginning of his quotas don't shoot me and the reason why he said this is the shooter telling somebody don't shoot me because he was confronted by a white man who had a concealed carry permit who who's stop the attack on the blacks\nBut they couldn't mention you know George Stephanopoulos and Jake Tapper and others who are going and talking about this case could as mentioned that a concealed carry permit holders stop this mass public shooting because it would have\nContradicted the rest of the discussion that they were having their uh basically saying that Trump didn't know what he was talking about saying that he wished that somebody with a gun there have been able to stop\nThe John I'm going to tell you I've seen that story go by the shooting in Louisville and and when I hear the you know the the the assailants said whites don't shoot whites I I just assumed that he was saying that to a potential victim like he was shooting a couple of black people many turn I returned is going on a ...\nA white person he wasn't going to shoot him because right why did he ... he was\nActually begging to not be shot by the guy with a concealed carry who actually stop this thing from happening that's why that is that's outrageous outright I mean there's\nThere's so many biases here in the ... you figure these guys must have known this story the the whole quote but\nYou know whether it's the New York times of the Chicago Tribune or others they leave out that part of the quote there there there there's so many other problems that are here like the New York times when they had their article on Sunday basically said President Trump asserts\nThat these other gun control laws like assault weapons ban in the background checks on private transfers boarded solve the problem but when they go on quote from the governor of Pennsylvania or Nancy Pelosi and the New York times article\nThey don't editorialized in the news article write about them asserting their positions there in fact if you look at the research\nTrumps the one who's right on this not these other guys\nIs why I Love talking to John ... and and also again I'd like to have a few days\nPositions there in fact if you look at the research trumps the one who's right on this not these other guys\nThis is why I Love talking to John ... and and also again I'd like to have a few days because I I don't like doing with the mainstream media doesn't suddenly trying to make political issues out of the tragic death of of these innocent people who are worse than just one\nQuick thing and that is the irony is obviously the gun control people come out within like an hour pushing for different types of gun control laws of course when a you know the problem for somebody else says you know we should pray for these people and wait\nFor me we said well you know they don't have any solution and and when they do come forward with you know getting rid of gun free zones which\nI it frustrates me no end that it that seriously taken into account by the media\nYou know there are still rag done for not trying to do something to solve it that it's somehow write a gun control people are the ones that have the moral you know knowledge to go and try to do something to fix it even when things that they put forward\nWouldn't solve these problems one mass shooting since two thousand they could have been stopped if they had had background checks on private transferred some guy for example but that's like the number one thing they go on point to all the time\nJohn lots our guests again president of the crime prevention Research Center and I do employee to check out his website it's crime research done or\nA you know you talk about these uh religious or political motivated attacks and the and the interesting thing about the uh the Islamic to a terror attacks is that they are faith based as well as political obviously there was a there was a political element to Islam is I'm\nI'm setting aside shootings for a moment it seems to me that between vehicle attacks and knife attacks we have seen quite a few that have been political and religious motivated from the radical Islamic terrorists perspective ... data on that as well so\nWe have data on that boat worldwide and in the United states since two thousand than about eighty two percent of the vehicle attacks around the world where at least four people have been killed a were done by month\nOver eighty percent of the bombings around the world has been done by Muslims\nAnd these are very heavy and outside the United states in the United states has relatively few bombings fortunately but also these mass public shootings as we've talked about before on your program\nThere much United States is relatively safe in terms of mass public shootings compared to the rest of world leaving northern Europe has a high rate of murders from these attacks but you get outside of Europe\nOr in the United states and it's much higher than what we have here a large percentage of just give you one number of the twenty five wars math public shootings in the world since Nineteen Seventy\nTwenty three of them were committed by Muslim ...\nWow that's that's sunny and you would think that that would then raise some alarms maybe we should look seriously at this but meanwhile here's Don Lemon last night on CNN I'm sure you've heard it here he is\nRight you have to stop demonizing people and realize the biggest terrorist threats in this\nCountry is white men most of them radicalized brought to the right\nAll right so uh yeah I Do love the fact that he says stop demonizing people instead let's demonize white people but that said ... obviously that is an incredibly ... uh the racially obnoxious if not racist thing to say but it it it sounds like it's also incredibly inaccurate\nWell most of them are males and most of them are white you know ... proportionately compared to their share of the population\nWell bing he used he said terrorist threat\nNo I understand yeah but but um but the radical right it's just simply false as we've talked about the vast majority of these people just want to commit suicide they're not doing that politically but they want to commit suicide in a way that will get some attention yeah\nYou know you look at something like the Sandy Hook killer\nHave put together what police described the coral dissertation studying math public shootings\nOver forty year period of time and he had all sorts of information but we graph out the relationship between the number of people killed in an attack and how much media coverage they got to be clean prove to himself as if he needed to I Would think\nThat the more people you killed the more media attention you would get his goal according to one police report in a newspaper was\nOr even in alien ... but apart from climbing water spouse caring little ms muffin biting Peter Parker what's the big worry I'm not sure spiders warrants level free got us to say finding bed bugs routes or a subpoena from the Mueller team\nBut if you are determined to take up the road exterminator what brings you to the conclusion that you need to reach for a blow torch I mean the last time I checked the shoe would be just as effective or a copy of the Oxford English dictionary although I'll assume that's one item modern handed a home where somebody would go after a spider\nWith a blow torch and that is the minute and Dennis Miller\nIf you were a level and struggles with leg cramps you've got to try Sarah works relieve this non greasy moments proven to relieve muscle cramps fast with daily use therapy works relief can even prevent muscle cramps you can get a full night's sleep or do activities you love without worry Sara\nWorks relief only takes ... minutes to apply absorbs quickly and it works there works relief as my choice for preventing\nAnd relieving muscle cramps get sterile\nWorks relief today in the pain relief out at Walmart CBS Rite Aid Walgreens or at the therapy works relief dot com\nSpring showers bring more than flowers they also bring that familiar must be smell to your basement usually caused by too much moisture molds and mildew don't\nBother with a D humidifier it just circulates the same on healthy air now there's a better way to remove damn most of the air and harmful pollutants it's with the way most your control unit we've can transform your home into a drier healthier environment satisfaction guaranteed for more information visit a dry hole one two three dot\nCom that's dry home one two three dot com\nDo you feel if it were rich W a Mayo Washington\nWashington election headquarters [laughter]\nTo\nUse it for Maria leave a heads up your travels this hour involved the beating up all your parkway crash has closed the south bound lanes of powder middle road had Rodriguez we'll have more on that coming up and just a moment to\nSay it was a band bill Montgomery County council President Bill and residential cell phone tower zoning and the council's agenda before counsellors could vote on it\nPassing a bad deal is far worse than passing Nobel\nCouncil president ... recently passed amendments to the bail thought\nTo walk or obstruct deployment and make it as difficult as possible to build wireless networks by requiring\nWhat he calls an extensive and prohibitively constantly hearing process for new cell towers and sat back six feet from homes instead of the originally proposed thirty after elections are over ... expects the new council to rework and reconsider the bell Heather Curtis sound WMA Alan ...\nSecretary James Mattis defending his department's decision to send fifty two hundred active duty troops to the southern border an advance of a migrant care of and they could reach the U.S border on a few weeks speaking with reporters this afternoon madam says his department was asked to help out the department of homeland security\nOr were there and support the secretary of homeland security ah who needs additional a military assistance we do this following storms we do this in support of the department of homeland security [noise] this was a different aspect of it but that's what we're doing\nFour months after signing an executive order creating the national council for the American worker rather than Trump held a pledge to America as workers a vet at the White House\nThe event the president said it's time to stop letting other countries take advantage of the U.S\nWhat I see some of these deals that were made I say how could anybody of agreed to its basic ... minutes it's literally first grade business it's so simple and the end result is it's tougher to get out because they've been so used to making so much money over our country and we can't let them do that anymore\nAnd the Federal Reserve's looking at easing requirements are holding capital and cash for us banks that are big but they that's smaller than Wall Street mega banks\nThe feds proposal is the latest move by federal regulators to relax government oversight or financial firms in line with objectives laid out by the Trump Administration would relax rules implemented under the twenty ten law enacted in response to the financial crisis that push the economy end of the great recession\nThe fed governors are also looking to ease the schedule for the agency's stress tests for banks based on their size and risk\nThe fed governor will bring are the only fed board member not appointed by Donald Trump warned the moves would raise the risk of meeting another taxpayer bailout too big banks got car Washington\nChecking your money ahead of the clothes that dials up two hundred and forty two points the S. and P. five hundred twenty nine the NASDAQ up one forty four W. I. L. trafficking whether an axe to find the things fascinating\nSet up your Amazon Echo the mornings a mall weekdays five to nine AM for one time set up safe Alexa unable to do any skill than to just say Alexa open details or W and here's\nThe story that may sound familiar I used to post to several jobs ... only to be overwhelmed with tons of the wrong resume than because of the worst\nIt's a close race and media trying to really depressed that turn up but I think people are starting to turn out as we were out all weekend and already this week people are turning out we want a big turnout we want people out there greener friend\nI'm Robin ... and I approve this message\nI'm Robin ... and I approve this message board by the Robin sicker campaign fund\nDr kosher here for a compass that last you know every New Years we have more new patients with a resolution that we can handle this year for the first and probably last time we have something different enroll in the ... program before Thanksgiving and receive a three hundred dollar discount offer usual programs\nThe that's right three hundred bucks just for starting now ... fast and be gone quickly so don't wait\nLose up to fifty pounds before the new year ever hits\nCalled eight hundred Seventy five two to eight one just set up your free consultation at any location or go to accomplish that last dot com\nStories wreaking well you've been leery O'Connor's saying we're\nI have a lot\nThat was President Trump just moments ago you her marine one in the background of Latin night on her party over there in the house of representatives at a different story how things should\nBe looking at my house for\n... Chang is\n\nThat as a leader for a new generation right there and then\nShe's only write if someone like more of a ... get your vote where do you stand are you ready for this thing through coming up by the way coming up and just about twenty minutes we're going to speak with Kelly Macedonia from the\nRepublican National committee will get a picture on how things are looking nationwide right here in the Washington area have been in Fairfax Evan you're you're in a bar Barbara ... district what do you think hey\nLarry yeah thanks for taking my call prevent you know I just wanted to say that yeah everybody to get out and vote for Barbara Comstock because Nancy Pelosi is trying to write this green wave\nTo buy her speakership right back to remember how good it how could it felt when she had to give that speaker's gavel to John Banner trying to buy it back and she's trying to start right here ... district\nAnd we would get out and vote for Barbara Comstock because not only does she have a litany of issues and the result that she's gotten for our district we can't let Barbara ... or we can't let Nancy Pelosi buybacks at speaker's gavel\nYeah and listen I Know that there are many people who who are you know if they were crafting their perfect Republican representative or maybe Barbara Comstock wouldn't fit every\nA nuke and cranny of that mold but we're past that point now\nThis is about keeping a majority in the house plain and simple period and this is just like it was two years ago for president it's a binary choice and I can't believe the same people who put representative wolf in the house of representatives year after year and then Barbara Comstock for the last four years\nWill then suddenly say you know what Jennifer Wexton truly represents us I don't see that at all Evan [noise]\nNo no I dont think you're exactly right you know we we have to stop Nancy Pelosi one more time that starts right here in Virginia and district on November ...\nThank you Evan I appreciated Andrew in Frederick Andrew you don't have a dog in this fight here uh let's see are you going to be in a ... district when she wins\n[noise] yeah that I Will but uh you know I figured I'd kill two birds with one stone and get liberals on board with a voter ID laws if I go down there and vote illegally\nBecause I don't mean Ninety so you're going to vote for me there and Frederick and then cross the river you can hop on the the ferry across the river get yourself some ice cream while you're there over the ah the the what is a stone to own a ... el ... rock point to a cream Murray\nGet your I mean that in the veggie burger there you go back and then you're going to vote over and loud and county for ... Andrew I cannot condone that kind of a ... illegal ... behavior\nI Know I Know but you know I I had to say\n... ... ... of a joke in sterling hokey your next step on WWE a male\nSo I have two quick points like the best thing that ever happened to Barbara Comstock is Jennifer Wexton because I now I Would never pull the lever again but I I had the early vote and I did because and only because her opponent was written for weddings and\nYou know hope you are you are in good company I got into you know a a Sebastian Gorka our friends said Gorka who worked in the Trump White house he campaigned against Barbara Comstock in the primary but when ... won that primary I for the Democrats I said I said on the air here\nA ... where do you stand now and he said I Am voting for Barbara Comstock in any Republican in that district who doesn't is basically handing the gab all the Nancy Pelosi\nMargaret said something in your interview that just drives me crazy and I and I think the the child tax credit is a good thing but she said something about it being refundable tax code should not be a welfare system if you have three kids and you don't pay any taxes\nWill get six thousand dollars back at the end of the year even though you'd pay no taxes and I just think that's wrong\nWell if you don't like that put Jennifer Wexton in the house and see what kind of tax code they work out\nI just would like to put a Republican\nWell if you don't like that but Jennifer Wexton in the house and see what kind of tax code they work out\nI just would like to put a republic a group of Republicans in there that will actually be conservative at my own\nWhen I hear you hope and we need critical mass to achieve that and let's face it some districts\nAre more Republican and more conservative than others we we know that that the reality of\nThe gate look around look at the districts around\nThe greater Washington area\nBarbara Comstock is an outlier here she's out number\nBut I trust the votes will come\nTwenty four on WBAL\nWashington Mall W. N. A. L. or Washington comes to talk of\nGetting quality medical care shouldn't be complicated but the fact is the traditional primary care model can be frustrating impersonal and confusing it's Larry O'Connor and for years now I've been sharing how happy I Am that I joined the growing number of people who've taken control of their health care and moved to a concierge medical practice\nMy doctor is Dr Jones with the concierge medical team at principle medical group\nSo what is it that sets Dr Jones apart\nWith principle medical group I receive superior primary care and personalize preventive care\nI never have to wait for appointments I'm never rush and I have twenty four seven access to Dr Jones who actually knows me and by medical history personally so why don't you check it out for yourself and schedule your free consultation with Dr Jones at his McLean office called seven three six\nSix three eighty eight twenty four or go on line two principal medical group dot com the\nLandscape of health care is changing but the principles of good tears shouldn't call seven three six six three eighty eight twenty four or online at principle medical group dot com [noise]\nFor twenty five WMA all traffic on whether every ten minutes first on the Pfizer Rodrigues says the carpet cleaning traffic\nSo we got trouble on our hands on a Baltimore Washington parkway southbound we're still closed a powder middle Rosa backup goes to route thirty to North found a looks like we might be close right before the beltway that backup stretches back to to oh to North found\nOn two Seventy naturally you leave the belt way heading to draw old Georgetown rode the new crashed there blocks the two planes that from garage door here dot com WMA oh weather Channel's forecast\nPleasant whether expected tonight to look like the rain was then as we had the Thursday and friday and a couple of other storms possible as well\nJust a few clouds around in this Halloween Night the weather looks nice and quiet around sixty partly sunny weather ahead for Thursday a high in the upper seventies a decent chance of showers a thunder storms on friday high up in the low seventies while it just starts from the weather channel on WMA out her\nRight now we're looking at sixty four degrees it for twenty seven\nChris plant here for more than forty years local residents have trusted overhead door company of Washington DC for their garage door repair needs they are the industry leader and garage door sales and service when you need garage door repair visit garage door repair dot com\nIT or distraction stories from CD WG agency needed to prepare for the future but an IT infrastructure was stuck in the past or CD WG orchestrated a converged infrastructure solution between del AMC technology to\nModernize their data center using the industry's most innovative papers structure portfolio\nService in storage buy Dell IT orchestrated by the WG learn more needy WG dot com slash del CDW gee people who get\nCancer has met its match\nProton therapy one of the most advanced cancer fighting treatment options now available at MIT start Georgetown University hospital\nPrecise than traditional radiation proton therapy targets tumors conforming to their exact shade sparing healthy tissue resulting in fewer side effects\nStar Georgetown University hospital is the first ten totally in the region to offer proton therapy to treat cancer learn more at MIT darn Georgetown\nDot org slash proton whether the days ...\nDelivery O'Connor's show\nThat you know that this has been your place to go to hear from all the candidates who are running in this area I'm pretty sure we're not\nAll of them on at least wants all the Republicans believe we of course invited the Democrats on the Democratic\nBase on basic equal time principles are\nAbsolutely welcome here are only a few of them have\nBut we're working on it so we want a couple of Democrats here before election day and we're going to do our best to get them on air I Do want to remind you that we're going to be doing a coverage of the elections starting at\nNine PM right after mark within we're going to go live here we got the whole team ... John\nUh a map you just going to be here as well as our networks feed with the great gym the legendary jumbo Hannah\nAs we take you all the way through election nights and make sure you tuna here so you can you hear a everything that matters to you here in the greater Washington area uh speaking of things that matter to you you know a lot of you were excited about that Roseanne TV show remember\nIt got really really good ratings and a lot of people like the Roseanne show the ... of it because it actually showed some respect for people\nIt got really really good ratings and a lot of people like the Roseanne show the ... of it because it actually showed some respect for people who have a different political perspective than what you usually see coming out of Hollywood it wasn't a pro Trump show Roseanne character was actually pro Trump and she gained some lively debates with people and her family who worked for Trump\nYou know not conservative the constitution loving got his onto the courts so standing on the door and the Senate and served that well you're not have another having like a chaotic come for a while\nAnd I appreciate that except or if he doesn't if we don't ... the majority of Republicans don't maintain the majority in the house then we're looking at just the such outrageous resistance and obstruction and even maybe a ... a a impeachment hearings\nOdd ... with the president's time be better spent in some of those a miracle row house races right now so he can help with that candidate over the top\nOf a you know he is spending some time and those places in Minnesota the good example of that ad where he rallied on behalf of\nThe really important the fair so I think these things strategic with this time I ... with his effort being put in that that place to maximize fern outside and yeah I mean the house races as you noted are equally as important because if he meant at the agenda items for Democrats even though it's faceless\nLikewise a a plate of investigation which they've already listed out yeah nearly a dozen that they want to ... so he had to Trump's agenda that the Trump the ... I think his side of that you know what is it in its place will be focused investigation after investigate\nThat you've been out there for many years uh ... despite how young you are but you are pro I Want to know a come Tuesday night when you start watching returns tell me some of the key house races you're watching that will sort of be a bellwether for you to tell you how the nights going\nSo one of them is Maine's second district you know of course the east coast polling locations will close before the west coast and a lot of our races that will determine whether the power from California so\nWhat you want to look at our our districts that are indicative of how California will go how fast you can hold out and one of those is that ... second district Bruce pollock when I currently out even pulling at the district President Trump won by ten points I'll be looking closely at that along with Florida Florida Fifteen\nWhere ... in Florida twenty six but her Bello and of course Murray Elvira Salazar down in South Florida all of those races are places that we should be winning and so if we can hold down that that race I mentioned in Maine and Florida will be indicative of perhaps as California races\nComing our way so that they hope early breakers and what they tell us about the west\nCoast and and there's a possible pickup right here in Washington area in Maryland six though I mean ... the Republican candidate running against David ... who's so funded in\nA ditch Jillian air he's pumping unprecedented amounts of money in a housing that raised you know Dan bones you know almost one or two years ago a to Z me four years ago with Larry Hogan running a pretty strong you'd think that she might\nBe able to jumping on the coattails how was that looking and how was the orange the participating in that race if at all well\nYou know wearing every race he can possibly participate in that one not in that category currently but nevertheless important race and and I met a mindset that Monday's lean democratic races lean Republican race as\nA you know I'm I'm not counting them out to specially of course the lean democratic one because polling with fell off a and two thousand sixteen and not as we move forward to two thousand Eighteen note at a lot of the sample sizes are very small you know five hundred people being cold to the margin of error is not one to present it for\nLike five six percent so certainly not writing it off for a quarter billion dollar data operation is available I not race had it and all of the other\nWell and of course that race would be a pickup so you're not you're not just trying to hold the seat like Virginia tend to Virginia six where you're actually potentially picking up an open seat which could which could help\nThe Republican mass toward the end there um and then what are the big surprises you think on their you know most people are saying you know looks like Missouri is going to do Republicans way India and those are closed I Know they're tied\n'em but some of them people are just sort of saying okay looks like the Republican to win that which one are you looking at right now that might be a real shock\nSo the real shock can we mentioned Michigan so I of course would know that one but New Jersey is the one that I think will be the story of the night with box you get there\nAre there and tunnels I talked to their campaign almost daily as well I said that he's down by just to ask for corrupt Senator Bob Menendez I kind of have the coming for him with his long and storied history of corruption\nBut Bob he's going to be within two points in deep lunar New Jersey that big ... with Minnesota a special Senate race Harris Karen how\nAre they are in calling in October that showed her down by just five or six days of course are deep blue territory so anything can happen but we could be talking if it's a good night definitely about\nNew Jersey possibly it often occurred as\nInteresting well hopefully we can touch base with you that night is will be doing our own richer and W. M. A. L. if not will definitely get you in the aftermath as you would\nHave your handle on all of these races and you'll be able to help sort it out thinking generally always going to talk\nThe M. A. L. if not will definitely get you in the aftermath as you would\nHave your handle on all of these races and you'll be able to help sort it out thinking Kaylee always good to talk to you\nHave a degree in part I think I might take Haley Mac than any of the art and the interesting because right now they're not considering Maryland [noise] six to be a toss up though there's not financial records are definitely the data engine from the air and sea is there a\nWe're going to see how this house [noise] develops a house race develop\nI wouldn't write any of these local races out\nBit more to say about that and also uh uh some things to say about the media in\nMajor events here I'm not into the\nWashington Mall W. N. A. L. what Washington comes to talk\nThe Washington Post endorsed governor Hogan saying polarized times he has to the political Mel\nMillions in Maryland during a\nTrip to ... ... ...\n... ... ... ... ...\n... deserves a second term\nI ran for office was completely\nAt a politics as usual\nAnnapolis washing\nI really don't care much about politics and whether somebody is a Democrat\nI care about commonsense bipartisan nearby\nWe work together with local officials are off the island\nBut we respectfully agree to disagree and we're honest with each other\nThe best job we can be ...\nFor forty five W email traffic and whether it be ten minutes first on the fives years I'd rather get and the ... D carpet cleaning trapped accent that's\nWorth sponsored by Bob Evans refrigerated side it's a mess on tonight by this afternoon southbound we still got the highway closed near powder a middle road the back of extends through one Seventy five and jazz up and they're doing an accident investigation which is going to take a couple of hours\nIn ... north bound to Ninety five stop and go all the way from the route fifty split up to that crashed just before the belt way but it looks like they got that went on to the shoulder 'cause we're starting to move again now the garage door here dot com that WMA weather Channel's forecast\nPleasant whether expected to night looked like the rain but then as we had the Thursday and friday and a couple of other storms possible as well just a few plants around in the ... the weather looks nice and quiet lives around sixty\nPartly study whether ahead for Thursday a high in the upper seventies [noise] a decent chance of showers a thunder storms on friday high up in the low seventies while a destructive it open the weather channel on WMA al right not sixty four degrees it for forty seven [noise]\nMake mealtime easy and delicious with ... side dishes like mashed potatoes and Mac and cheese their mate with real milk butter cheese potatoes center reading in the microwave and six minutes try Bob and aside from your grocery store it'll be a love at first by\nA I Want to talk to you for a second haired about my friends have renters warehouse now are renters warehouse they're the ones you want to call if you're considering a move right now are you gotta have expert property managers\nAnd they are experts over wrenches whereas me and my thinking oh geez if I'm gonna move why am I calling ranchers warehouse right well because renting\nIs the new selling and wrenches warehouse they make renting your property easy they make it affordable it's kind of crazy to do it any other way I don't know why you would want to do it yourself runners warehouse they're experts perfectly priced your house then they find you a great tendency to just take some like Seventeen Days on average and then probably Ninety nine dollars a month\nThey're professional landlords manager property twenty four seven and they do it all they collect the rent they handled the maintenance request they'll even war into those tendons trip to nine months that means if something doesn't go right with those tenants such that they don't work out they'll replace them for free\nWhich runners were house there's no upfront fees no binding contracts cancel it anytime\nThey totally redefined the industry they've made renting easy fast and worry free for regular folks like you so called ... two six to five forty three Seventy two to six to five forty three Seventy or go to ranchers warehouse dot com book a free home rental price analysis find out how much your home or rent for wrenches warehouse dot com\nThere's a lot to do this fall in DC but you know what there's not a lot of\nConvenient parking fortunately you can ... the closest to talk to your destination in advance quit spot here\nWhether you're catching a game exploit your district shopping in Georgetown or just sitting down for some fun spot here it was there for you simply download the spot here a weapon type in your destination\nSpot here and we'll show you the closest parking spots at prices you can even get ten dollars off your first park by using ... something yeah that's ten dollars off with promote coach fat spot hero park smarter\nChoice for Congress in Virginia's eleventh congressional district couldn't be more clear as an army combat veteran will bring the diversity of our district to Washington and give us real representation Jeff Davis fought on the twenty first\nAs an army combat veteran who bring the diversity of our district to Washington and give us real representation of his hold on the twenty first century physical in digital battlefield just provided real solution not just talking points and build the go nowhere", "year": "2018", "show_name": "The Savage Nation - Michael Savage", "city": "Washington", "day": "31"}