{"month": "10", "state": "MA", "station": "WBUA", "content": "Largest radio newsroom Ninety two point seven WVU wages Barry eighty nine point one WB ... Brewster and streaming at W. B. U. R. dot org W. B. U. R.\nBoston's NPR News station this [noise]\nIs it Ted radio hour\nEach week groundbreaking had talked\nThe technology entertainment design design\nCars that really would stems from Steve I'm never known that delivered and hadn't had conferences around the world gift of the human imagination we've had to believe in impossible things the true nature of reality back and [noise]\nThose talks those ideas adapted radio [noise]\nFrom NPR [noise]\nI'm Guy rise coming up [noise]\nUltimately we're interested in understanding how life works\n... where we are what we need to do is figure out how the brain does it as a biological bits of machinery\nWe now have technology that could in theory you allow an individual to upgrade their gee you know [noise]\nThis episode what makes us us first this news\nLive from NPR News in Washington I'm Barbara Klein amid protesters shouting in the Senate chamber senators have confirmed Brett Kavanaugh as the justice of the Supreme Court the vote follows a bruising nomination process that race sexual misconduct allegations against Kavanaugh\nA few minutes ago before the roll call vote got underway Senate majority leader Mitch McConnell said the allegations have now been put to rest\nThis historically tall mountain of evidence adds up to one clear message judge Brett Kavanaugh was among the very best our notion has to offer the ... and the country proud\nSenate minority leader Chuck Schumer has a different take\nFrom start to finish President Trump's nomination a Brett Kavanaugh to the United States Supreme court\nHas been one of the status moments in the history of the Senate\nThe vote to confirm Kavanaugh fifty two forty eight protesters are still gathered outside the U.S Capitol and the Supreme Court than when to take their battle to the mid term elections\nSecretary of state Mike Pompeo is preparing for his fourth trip to young young to meet with North Korean leader Kim Jong on NPR's Anthony Kuhn reports ... stopped in Japan Today along the way\nPompeo met with his counterpart tomorrow kono and prime minister Shinzo Abe's in order to coordinate their positions on North Korea in young young Pompeo will try to arrange your time and place for a second summit between Kim Jong un and president Donald Trump the two sides remain deadlocked over the sequencing of steps leading to Pyongyang's nuclear disarmament\nNorth Korea has rejected us demands that it provided full inventory of its nuclear weapons programs\nSouth Korea meanwhile suggested the U.S signed a treaty formally ending the Korean War in exchange for North Korea closing its main nuclear plant Pompeo will stop and Beijing and so on his way back home to brief leaders in those capitals Anthony Kuhn NPR News Beijing\nFrench officials tell NPR China is detaining the head of the international police organization Interpol on suspicion of financial fraud and other charges manning hung way was reportedly missing since late last month NPR's Eleanor Beardsley reports\nThe south China Morning post reported friday that sixty four year old ... hung way was picked up by Chinese authorities when he arrived in Hong Kong in September\nAnd actually Andrew Balls and the matter concerns French and Chinese authorities but in a later statement Interpol secretary general European stock said he wants an official response from Chinese authorities to address concerns ever ... wellbeing before\nBeing elected to Interpol in two thousand sixteen ... Hong way was vice minister of public security in China\nThis is NPR News Spanish\nOpera singer months ... one of the world's greatest Sopranos has died in her home city of Barcelona she was eighty five\nStains king Felipe is expressing condolences calling cobble yeah a a legend of universal culture within an equal voice the BBC's Danny ... heart report\nMumps or a couple of years voice was paying for your power [noise] I've heard here in which he needs Madame ... [noise]\nHe rose from the humble background to conquer the world's greats opera house is probably a major key international breakthrough at New York's Carnegie Hall in Nineteen sixty five\nWhen she had to replace it probably in the title role of don't exist you create your own job\n[noise]\nA standing ovation lost twenty minute but she reached out beyond the well developed ... most famously singing the Jew at sponsor low now with the lead singer of queen Freddie met for appeal to her home city and the and some of the Nineteen Ninety [noise]\nClean guitarist Brian May has posted a message on Instagram saying ... was an inspiration to the group and Spanish ten or Jose Contreras says ... had a voice of great range and the ... technique I'm Barbara ... NPR News in Washington\nThis is Ninety point nine W. B. U. R. N. W. B. U. R. dot org is you just heard in the news cast the U.S Senate has voted fifty to forty eight confirming judge Brett Kavanaugh to the U.S Supreme Court\nAnd there'll be extensive coverage coming up on weekend all things considered starting at five right here on nine point nine W. B. U. R.\nWere funded by you our listeners and tried and booksellers and cafe on Newbury Street now reopened family owned since Nineteen eighty four with a full service restaurant selection of books and gifts and nightly events\nMass Audubon discovered nature's magic at one fifty eight wildlife sanctuaries across Massachusetts the to do list can we learn more mass Audubon dot org and the American Jewish World Service working together for more than Thirty years to build a more just an equitable world learn more at age eight W. S.\nDot that radio hour from NPR I'm Guy rise so imagine a big thick book about the size of a dictionary and inside that book each and every page filled with just four letters just four letters printed over and over\nA G C and teams right before let us to be in a D. N. A.\nC. four letters that every species on the planet has is made up of four letters each representing a\nChemical compound arranged in Shasta such a way to make you feel\nThis is really where the information comes from is not the four letters but exactly how they're connected to each other so is the agency\nTea or a a junior or a CD or a a just by the way is Sam Steinberg I studied gene editing technology in Tempe says if you print\nIt out all of the Asian jeeze and sees and tease it takes to complete your entire genetic code which by the way is a lot of letters to his three point two or so billion letters you know you would have\nHit a lot of pages or if you had every pitch filled with aids g's and T's you'd have\nEight hundred dictionaries worth of genetic code\nOr something like that for one person for one person so could you say that every single out\nUh our our our physical traits the color of our eyes are characteristics or personality traits come from four chemicals\nI Would say that while I'm and this actually all the information to turn a single fertilized eggs so into an adult\nHuman is contained within that singular genome\n... years which really crazy [noise] sixty years ago\nWe didn't even know what the genome was the answer to the question what is life wasn't mystery\nAnd that of course then the question I wanted to know you know directly to explain life after ... outside of what was the essence of life\nWhat was the essence of life that was the question answered by James watching who spoke about it on the stage and and watch them along with his partner Francis Crick discovered the essence of who we are\nWe got pants and plenty of uh February fifteenth race\nAnd that was one Watson Crick discovered the hidden language of DNA\nYou know if you just for the next to tea and she likes to see you have a ... [noise]\nSo we saw of genetic information of carry this the order for\nBaseball kind of critics Discovery Health is eventually to figure out how those four letters added up to eight hundred dictionaries for one human\nWhich led to another huge milestone on the journey understanding who we are earlier today at the White House President Clinton announced the completion of the mapping of the human genome this was in June of two thousand\nMore than a thousand searches across six nations have revealed nearly all three billion letters of our miraculous genetic code I congratulate all of you on a stunning and ...\nAnd Boston University academy high school with a college education find them on ... at the Boston book festival October Thirteen\nMm\nHoward by its land grant heritage from renewable energy to global health us students and researchers are working to solve challenges at next got us out ... from the ... family owns makers of small batch Kentucky straight\nSound Kentucky forty seven percent alcohol by volume crack promotes responsible drinking and from the any each case the foundation\nIt's that Ted radio hour from NPR I'm Guy rise in our show today ideas about who we are what makes us us and we've been talking about ... who's been explaining how a new gene editing technology called CRISPR calf nine\nCould make it cheap and easy to create humans who are you based rates acting like superhero perfect vision superhuman strength perfect SAT scores right that I Know that I think that's that's the science fiction association of what\nCRISPR could allow [noise] we have long lists\nOf gene variants associated with certain traits and some of those are silly like whether or not you're a morning person [noise] but we also have long lists of gene variants that are associated with things that might be desirable like having extra strong bones\nOr leader muscles or lower sensitivity to pain or lower risk of Cornell heart disease\nAnd as those lists continue to grow\nWe now have a technology\nThat could in theory you allow an individual to upgrade their genome\nBut why would that be the science fiction version if it seems like that that technology is promising like if there was a you know way to make a child more resilient to pan or or give us a hierarchy is you can imagine that people would want to take advantage of all those things right\nI think they will I think the challenge then is to is to think about how we can ensure that that technology if it becomes available is used safely because we're certainly not there yet but also I think equitably\nThere's a great example in the world of HIV aids so it turns out one to two percent\nOf all humans have a specific genetic mutation that is associated with HIV immunity because this gene variant they have\nEssentially masks theirselves and the HIV virus can't get inside so what a friend you nailed delivered it into a fertilized egg cell into a human embryo so that that future child even though neither his or her parents have that mutation will still have HIV immunity\nWe might assume of course they would want that but it's still a game changing idea that we would be able to make those decisions and not just selected traits do inherit from their parents something we can already do with Avi A. F. N. genetic testing but kind of installing new variance into their genome that they would\nNever have gotten from their parents it's it's like a pre emptive solution for for for something that may never come come to fruition like ... like we're just saying hey just in case we're going to give you immunity against the thing that you may or may not ever meet\nAbsolutely so do you consider that a an enhancement or is that disease prevention is you know many people see\nThey divide DNA rewriting or gene editing into kind of\nTwo different categories one being disease prevention\nAnd one being genetic enhancement but I think there are many that far right smack dab in the middle so yeah with the with the HIV immunity genes easier five\nThat's disease prevention but it's preventing a disease that you may never get so in in a way it's kind of conferring a genetic advantage and I'll just state again that's a gene variant that exist naturally but only one to two percent of humans have yeah so it's clearly giving you an advantage above what we might call normal human species functioning\nBut I mean I mean a part of me wonders sweeping\nGiving that you know you know what I mean like there's a process that just kind of has sort of happened since the beginning of human evolution and we were completely be ending that\nThat's certainly one way of looking at it and yet evolution is inherently cruel\nFor someone that has a genetic disease\nThat's kind of a a crummy hand that they've been dealt so I think this comes down to the question of how secret as the genome and is it something that should remain untouched on tainted left alone\nOf course what we do in any one patient that's a lifesaver for that patient but when you think about human evolution over the course of hundreds or thousands of years now we're talking about a technology that will not only affect that individual\nBut that individuals children and their children and their children and their children and so that's where I think you have this very ... issue of directing future evolution\n[noise] you know even\nSaying that sounds hyperbolic it sounds like science fiction but I think the technology will get to the point where you could use it ... embryos to install things like HIV immunity or stronger muscles and maybe someday gene variants associated with higher IQ\nWere being a morning person if that's what you'd like to be that's where things really take off [noise]\n[noise] [noise] [noise] [noise]\nCalled a crack in creation gene editing and the unsinkable power to control evolution you can check out his ... at ... dot com [noise]\nMm\nI today's show we're asking a very important question which is who are we\n... by the way do you have the answer deem know who we are uh\nI Know who I Am a ... a a an inkling of who we are this is Steven Pinker I Am a professor of psychology at Harvard University and I write books on language mind and human nature [noise]\nSo yeah what what is it that makes us who we are\nWell if there are some uh intricately complex circuitry in the brain a\nFabricated over millions of years by natural selection better equipped us with a set of motives and emotions and mechanisms for learning and thinking that make us who we are\nOkay there's a lot to unpack here so to begin to understand what Steven Pinker just sad and to understand what accounts for the differences between us we kind of need to understand how far we've actually come in trying to figure this all out just even can you can you help us with this okay I'll do my best\n[noise] [noise] okay just to get us started human beings have debated nature versus nurture for hundreds even thousands of years that is\nWhether who we are our personalities are behaviors are either entirely inherited from our parents or whether it all comes from the environment around us that when we're born our minds are basically like links lights\nAnd that all of a structure comes from socialize Asian culture parenting experience\nThat was Steven Pinker on his head stage back in two thousand two in this idea of the blank slate it was especially popular in the second half of the twentieth century and it meant that a lot of us went through high school biology hearing stuff like that\nMan has no nature from the historian was saying okay you got that man has no instincts and the anthropologist fast we want to give the human brain is capable of a full range of behaviors and predisposed to not\nHochul a scientist Stephen J go without ... why should have been such an appealing notion well there are number political reasons why people have found congenial\nForemost I guess we're blank slates and by definition we are equal because we're all equals zero equals zero but if something is written on the slate and some people could have more of the others and according to this line of thinking that would justify discrimination and inequality\nAnother political sphere of human nature that guy\nIf we weren't blank slate weaken perfect mankind the angel dream of a fascination with any of our species through social engineering whereas if we're born with certain things and perhaps some of them like some damage to selfishness prejudice and violence [laughter] first of all\nThere are a number of reasons to outfit human mind a blank slate some of them just come from common sense as many people have\nTold me over the years anyone who's had more than one child knows that can come into the world where certain temperamental trends have forgotten all come from the outside\nOh and anyone who\nHas a child and a house that I certainly noticed that the child exposed to speak for require human language when every house that loan presumably because of some can a difference between them and\nAnyone has ever been in a heterosexual relationship knows that the minds of men in the minds of women are not English of um [noise]\nSo for years that debate about nature versus nurture has been just that a debate it's one or the other but Steven Pinker has mainly argued that this shouldn't\nBe a debate that who we are comes down to both our genes and our environment\nIt's a mistake to think that uh if there is in effect of the environment that shows that were blank slates or conversely if there is such a thing as human nature\nIn tower hill Botanic gardens were fall festivities include face painting veggie car races in beer garden Columbus Day weekend more tower he'll be G dot org [noise]\nSupport for the Ted radio hour comes from the University of Florida we're solving for next is powered by its land grant heritage from renewable energy to global health us students and researchers are working to solve challenges at next dot U. F. L. dot edu\nFrom Elijah Craig family owned makers of small batch Kentucky straight bourbon whiskey Eliza crank barred stand Kentucky forty seven percent alcohol by volume Elijah crank promotes responsible drinking and from the any each ac foundation\nIt's that had radio hour from NPR I'm Guy Raj and on the show today ideas about who we are what makes us us and according to a humorist say Frank in this short talk it's not that complicated areas on the stage [noise]\nThis is the human tests [noise] dance to see a few a human [noise]\nPlease raise your hand if something\nAgreed [noise] yes [noise]\nThen let's begin [noise] have you ever eaten a Booker long past your child\nIt's okay it's safe here [noise]\nHave you ever made a small weird sounds when you remembered something embarrassing [noise]\nHave you ever purposely lower case the first letter of attacks in order to come across as sad or disappointed [noise]\nHave you ever ended attacks with a period as a sign of aggression [noise]\nOkay [noise] period [noise]\nHave you ever\nLaughter smiled when someone said something\nTo you and then spent the rest of the day wondering why you reacted that way [noise]\nHave you ever seem to lose your airplane ticket a thousand times as you walk from the check in to the gate [noise]\nHave you ever put on a pair of pants and then much later realized that there was a loose socks smashed up against us high\nHave you ever tried to get someone else's parents were so many times that it lock their account [noise]\nHave you ever had a nagging feeling that one day we'll be discovered as a fraud [noise]\nYes it's safe here [noise]\nHave you ever hope that there was some ability you hadn't discovered yet that you are just naturally great cast\nHave you ever have broken something real life and then found yourself looking for an undue button\nIn real life [noise]\nHave you ever marveled\nAt how someone you thought was so ordinary could suddenly become so beautiful [noise]\nHave you ever stared at your phone smiling like an idiot while texting with someone [noise]\nHave you ever subsequently texted that person the phrase I'm staring at the phone smiling like an idiot [noise]\nHave you ever been tempted to and then gave in to the temptation looking through someone else's\nPhone [noise] have you ever\nHad a conversation with yourself and then suddenly realized your view [noise] gee ourselves [noise]\nHow's your film ever run out of a battery in the middle of an argument and it sort of sounds like the phone was breaking up with both of you [noise]\nHave you ever saw that working on an issue between you was futile because it should just be easier than this or this is supposed to happen just naturally [noise] have you ever realized with very little in the long run just happens naturally [noise]\nHave you ever woken up\nBlissfully and suddenly been flooded by the also remembering that someone had left to you [noise] have you ever lost the ability to imagine a future without a person that no longer was in your life\n[noise]\nHave you ever look back on that event with a sad smile\nAnd the realization that\nFutures will happen regardless [noise] congratulations you've now completed the test you are all human [noise]\n\nThat writer and humorist they Frank got a couple of other great talks at ... dot com on the show today what makes us I\n[noise] can't explain what it means to be conscious like what is it [noise] consciousness is\nThe most amazing thing for any of it and then we all know the difference between being conscious and not being conscious\nLifted and al ... he's a professor of neuroscience at the University of ethics in the u._k.\nConsciousness is any kind of experience at all whether it's a visual experience the world around us whether it's an emotional\nExperience of feeling sad or jealousy or happy or excited for next parents as are intending to do something or being the\nCause is something that happens consciousness is the word that we use to sex inscribed\nAll the different kinds of experiences that that we can have ...\nI think that pretty much sympathy for conscious system there is something it is like to be that this the wires for something that isn't conscious beret\nHow consciousness even happens and if we can recreate it artificially it's a question that we're still trying to figure out because what's more fundamental about being a human then knowing we exist\nExplains more from the pet stage [noise]\nWatching this question is so important because consciousness for each of us as ... without that doesn't ...\nDoesn't like self there's nothing at all and when we suffer we suffer consciously whether it's three mental illness or pain and if we can experience joy and suffering what about other animals\nMight they be conscious she did they say have a sense of self and ask them she says get faster and smarter\nMaybe they'll come a point maybe not too far away when my I find develops a sense of that same existence now I actually think the prospects for conscious I pretty much mystery I'm going to tell you our conscious experiences of the world around us\nAnd about sounds within it all kinds of control to these nations that happen with free\nAnd the cost of living ... [noise]\n\nI Love this idea of a controlled police nation is is that is that what we experienced said how\nWe experience the world that it's\nIt's a controlled hallucination were just essentially hallucinating all the time [noise]\nI Love the strikes I Wish I could take credit for it but but I Can't but I Love the fries because it\nPoints out that everything that we receive consciously or unconsciously but let's talk about consciousness for now\nIs a construction of the bright I mean it's easy to think that we are in our eyes and objective reality is reveal to us through the windows of our eyes what countries perception is is basically just somebody sitting inside us go looking out there and they see a red\nTable they pass in light of all gainers batter writers ahead\nOne real back to reality [noise]\nThat's right\nBut the truth is that all perceptions are acts of interpretation that acts of informed guesswork that the brain applies when I encounter sensory data I think the way I Can't think of this is that there is no light in the scholars nice sounds that movie is\nGoing on in the brain or electrical impulses whizzing around and complex passing an out of all the oldest passing much in the in the Brian ...\nAppears [noise]\nAnd in some sense we we've known this for a long time since meats and it's been pretty clear that colors red yellow green seven colors and no objective properties of objects in the world they are attributes of of reflected\nLight and and the brain the visual system will make inferences based on wavelengths of light and about what color or something it a ... something as basic as color is not something that we just passively receive from the world we actively attribute\nIt to things out there on the world and the idea of control to the nation is is just that will just applies to everything and this applies to everything that we perceive and not just perceptions of things out there in the world but who said applies to our perceptions about self about voting about memories\nOf a sense of agency about sensitive volition that every thing that we see\nIs a construction but it's it's not a random construction its construction\nAs a best guess that is reined in by the sensory ... times which is why most of us agree when we look at a table that we will say yeah I Would say well you see a table and we both see the same thing", "show_name": "TED Radio Hour", "year": "2018", "city": "Tisbury", "day": "06"}