{"month": "10", "state": "NY", "station": "WABC", "content": "When we started the company more than Fifteen Years ago we wanted to create smarter more reliable secured\nThe kind of security we'd want for our homes and families pathway alarm dot com delivers hunted solutions that are tested by nearly six million homes and businesses alarm dot com systems are available to license security experts across the U.S who have experienced designing installing in monitoring smart home system in your community\nThis means you have an effort to help you understand the options answer any questions you\nOnce you decide on the part Homer business security system that meet your needs those same experts in style your system so it's working correctly from day one and with twenty four seven professional monitoring\nThey make sure you stay protected get real protection today visit alarmed that Tom slash music to finding alarm dot com service provider in your area that alarm dot com slash music\nI don't drink I don't smoke\nAround three miles a day\nAnd just had a complete physical my family has no history of breast cancer\nIt's curious how healthy habits and good family history\nTo excuses\nAnd yet we still need\nAnd I W J Barnabas how\nWe offered the very latest in Congress to breast health services\nIncluding ... grams genetic testing and breast surgery [noise]\nNot to mention peace of mind [noise]\nWith breast health centers located throughout New Jersey [noise]\nFinding is simple\nTo me the most of breast cancer awareness month\nBy visiting our W. J. D. H. dot org slash mammal\nMaking excuses is easy\nArgue the tape aren't at his house\nLet's be breast cancer together [noise]\nHealthy together\nThey voted out as a brand new superhero sound you sound fantastic I Love those costs like the perfect ... oil what does that are only consider us through by no I got the perfect ... to ... has arrived well tell me a little more said I Love these cars Rabbani superconducting get stream apple playing or enjoy audio\nCan I listen to a C. D. C. ... loving CDC your bet you're kind of great but it's also got Bernie bought by hotspot now I Love being connected to the wife have you ever got something better blind spot ... eyesight driver says morning ... outside Julie law that technology\nIt's confidence to every threat really does for at least one for just two hundred and thirty five dollars a month for forty two months and only twenty nine sixty to cash\nOr trade George signing call a day five nine five forty one twenty five release details will visit Randy super gotten it to see the all new twenty Nineteen forest\nTo offer veiled qualified buyer subject to primary later approval poodle costs to be paid by consumer except for licensing registration is access the cage for one zero six five seven model sale in thirty one Eighteen\nBalance of nature's fruits and veggies in a capsule\nI care water in a while ago I was walking and find that site and I don't know what happened I had the after effects of that in my hand and my leg and I noticed that except that it I don't have that anymore that is one thing that I Am\nVery wet and I don't feel that they should have it like it's like my nerves are getting killed it's just wonderful I I'm very or on it\nFor a limited time used discount code W. A. B. C. and we'll take thirty five percent off your first preferred sets of fruits and veggies and have them shipped to you free call eight hundred two four six eight seven five one\nThat's one eight hundred two four six eight seven five what or go on line to balance of nature dot com and use discount code W. A. B. C.\nMuch in here is that\nThese are conspiracies that if we believe them we don't need a history book tonight so at least going way be see New York\nTo talk more about them so [noise]\n\n\nThat I've been slipping on my Casper mattress I'd pick over every mattress I ever had helps me get the best night's sleep\nOnce you try Caspar you're going to love years to Casper is a high quality mattress set an affordable price I sleep cool uncomfortable every night thanks to the unique combination of phones or provide the right pressure relief in alignment\nCasper ships right to your door for free in a small how did they do that size box\nLeaving pick it up for you if you don't love it and the refunding everything from its engineering to its packaging to letting you tried for a hundred nights it's no wonder Casper is over thirty five thousand five star reviews of all their products across Casper Google and Amazon\nPut Casper to the test in your own home for a hundred nights risk free go to Casper dot com and use code mark for fifty dollars towards the purchase of select mattresses that's Casper dot com codes mark for fifty dollars towards the purchase of select mattresses Casper dot com terms and conditions apply\nI remember when the Democrat Party was a rational party I didn't always agree with it but there were individuals scoop Jackson Zell Miller individuals like that now the stars of the Democratic party or radical they're extremists\nExtremists\nThat's who's running for governor on the Democrats' side in Florida that she was running for governor on the Democrats' side in Texas that she was running for governor excuse me for senator on the Democrats' side in Arizona that's who's running for governor on the Democratic side in Georgia these radicals\nThese extremists who absolutely obliterate\nThe success of the states but the state's stand for\nIf an idiot log like Gillum has his way he will turn Florida in the New York he won't turn Florida in uh California if you want that kind of government they don't get it but why do you have to destroy all these actually properly functioning states\nPeople are voting with their feet\nThese blue states are deep populating every single blue state has depopulated and then you have several of these red states where the populations are booming and there's a reason for it because in our country people go vote with their feet and they're leaving\nNew York and New Jersey in Illinois and California for places like Florida and Texas so why destroyed Texas\nRhonda scientist for governor ladies and gentlemen Florida fleece give 'em all the support you can run to scientists thought ... we saw at our armed forces police officers firefighters when emergency personnel and fall of you I'll see you tomorrow God Bless [noise]\nSwing me I don't\nSome ... some ... ... [noise]\n\nAlexa place it's from queens okay\n[noise] [noise]\nWith him is on music uh voices all you need to get tens of millions of salt that low the Amazon Music app today\nMany times has it happens you drive away from home turn the corner and then wonder that I thought the garage door with alarm dot com you always know what's happening at your home or business I'm Ellie one of the founders of alarm that town over Fifteen Years ago we set out to create the kind of smart security system we'd want protecting our family\nSo we developed alarm dot com to be incredibly reliable and easy to use its also backed by a nationwide network of license security expert who will professionally design and Stalin monitor the right along got some pirates Alicia for any home or if it wants to know if your garage doors close\nJust set the alarm dot com and if you forgot to close it you can take care of it with one hand\nAnd alarm dot com system can often too smart lots lighting thermostats video indoor about cameras and more we can connect whatever you need to experience the best smart security\nSolution for your home or business get real protection today visit alarm dot com slash music to find an alarm dot com service provider in your area that alarm dot com slash music\nBalance of nature's fruits and veggies in a capsule\nYour water in a while ago I was walking and find that site and I don't know what happened I had the after effects of that my aunt and my leg\nAnd I noticed that except that it I don't have that anymore that is one thing that I Am\nVery wet and I don't feel that they shouldn't but like it's like my nerves are getting killed it's just wonderful I Hope I'm very very on it\nFor a limited time use discount code W. A. B. C. and we'll take thirty five percent off your first preferred sets of fruits and veggies and have them shipped to you free goal eight hundred two four six eight seven five one\nThat's one eight hundred two four six eight seven five what or go on line to balance of nature dot com and use discount code W. A. B. C.\n[noise] [noise] [noise]\nOkay a time when\nWas getting time they can do\nIs eat a snack before the game [noise]\nThat'll make you less likely to mindlessly over indulging while you're cheering on your team [noise]\nAnother thing you can do ... says is where a belt [noise]\nIt can help you feel when you've had enough to eat she says no one for one with your drinks as well have a glass of water in between beers not only to stay hydrated\nBecause we know people tend to eat more the more they drink and last but not least get up and move during commercials and a half times the movement is good for you it's going to keep you away from the food as well [noise] I'm Dr Sanjay Gupta helping you live a better life\nLately it seems like everything we use every day is getting an upgrade on the bed we sleep in to the raise that we use when we wake up that we've neglected one of the more impulsive products in the daily routine that old worn out toothbrush I'm Simon ... and I'm a product designer after I learned how important brushing your teeth is overall health\nI worked with a dentist to ... toothbrush that makes brushing most simple affordable and surprisingly enjoyable quip how sensitive suddenly vibrations that a gentle on your gums and a built in time of the pulse who's the guy do around your mouth old typed into a beautifully slim and dies aluminium design we also to live a fresh brush heads on a dentist recommended schedule just five dollars with\nFree shipping our attention to perfection an quip the time magazine distinction\nOne of the best invention is that the upgrade your cat\nAnd stop brushing better with quit\nQuit start to just twenty five dollars and it's guaranteed for life with a regional plan sign up now I'd get quip dot com slash W W O and you'll receive your first refill packed free with a quip electric toothbrush that's your first repeal pack free at G. E. G. Q. U. I. P. dot com slash W W out what\nWe have we have incomplete information and it's early and the first three reports are wrong so I'm careful here but it does look that these are celebrities or\nDemocrats of prominent Democrats or both celebrity prominent Democrats receiving packages that at least at this point some of them coming from Florida they all look similar\nThere is also indication that we don't have good details here that they are explosive devices in much the same way uh that uh you could say it's not a bomb that's why I'm using that careful term here there was there is something explosive in there there was a timer but it wasn't a to my understanding\nAttached and they did all come through the U.S post office not my first line of delivery of a weapons so the conclusions on television are not helpful how do you measure this as an act of terror as a threat to the homeland or as a partisan talking point\nWell according to the code\nYou don't have to use violence to commit terrorism terrorism can also a a ... when you make the threat of violence for political ideological or religious and uh\nWhat we know and and let let's just look at the facts as as you know you are formed according to folk ports right on the battlefield are always wrong what we know right now is it seems as if we know none of the devices detonated we know that several of them didn't have the capacity to designate\nBecause there was no initiate to actually inside to devise\nOthers may have had some kind of\nPattern some main charge we don't know\nUh I on on the photographs that have been released a ... speaking to one metric veteran who has a ... D experience she ... and somebody said these look more like Hollywood props than anything else if you look at the packaging\nThe misspelling of individuals' names the fact that John Brennan was said while at CNN when he doesn't even have a contract with CNN the misspelling to send his name in terms of a\nA ... I couldn't even get that name spelled right so that there is a distinct arrow ... theatrics ... but the good news is we have a latest couch eleven devices\nThat's a lot of ... material\nNow the the FBI who are the best of the best the NYPD\nUh doing due diligence I think they will track down this individual who\nLooks to have a mail them from Florida at the at the end of the day that this individual will be found was it a political stunt a prank or something more serious over time will tell but message number one the most important message of all if you see any\nThing suspicious stop a report it to the authorities immediately\nThe INS trading the president indicates that unless they're conditions change we will leave the intermediate a nuclear force treaty in six months time this was signed by Gorbachev and Reagan in Nineteen eighty seven\nThe U.S maintains and has for some time that only one side is honoring if that's the United states that Russia has violated by constructing a new missile and intermediate range missile why that's important\nIs that there's no warning time you must you must launched immediately when you know these are launched especially if you're in Europe because they're short range\nOr the other complaints by the U.S for some time is that China is not a participant so that I again the Trump Administration must\nTidy up conditions that were left to be afraid by the George W. Bush administration by the Clinton Administration by the George W. Bush administration by the Obama administration [noise]\nYeah this this is very um [noise]\nJust for now the proof positive whether you look at the international trade relations whether you look at the Paris climate accord NATO geopolitics\nIs never called in stone that it is eminently reasonable to reassess the\nAh remnants the leftovers of a Cold War era especially if one side is not keeping the site of the bargain so I think one of the key characteristics of the current\nPresident is there are no sacred cows just because something has been done a certain way by the quote unquote Washington elite for twenty thirty or forty years does not necessarily mean it's the right thing\nAnd ah with the rise of China or Russia or being run by former cagey because all these things or require a reassessment and we may simply leave\nThe u._s. has Curtis Wilbur and the U.S and teach them I Hope I say those navy names correctly it through the Taiwan Strait in these last days to demonstrate that the U.S navy will operate where it wants to in international waters the Chinese in this instance the P L A navy\nTracked as opposed to dashing in front of\nThe U.S navy warships there have been complaints from the Chinese foreign ministry Taiwan is please a very much pleased and so am I but I mentioned stab to underline the fact that China not being part of the INS\nIs also part of the fact that China's not party to many of the critical treaties and arrangements that\nEnded the first Cold War and that we have a follow that is fully capable of confronting the U.S militarily as well as using cyber command you measure your measure right now does the American public understands that are the two parties Russia and China\nChina is by far right now the more threatening\n[noise] not yet\nBut they will because the president is T John Bolton special especially the travel to the joint chiefs of working or to make sure that the American public on the ... the strategic threat but China represents\nWorking hard means that after the election lettuce a cult cool cool the rhetoric and look very carefully at what entity stole the secrets of the United states when rated the OPM under the Obama administration what entity continues to throw spies\nAnd cyber espionage at the United states and all of our private businesses what entity challenges US Navy what entity brutalizes its own people what entity is practicing genocidal concentration camp\nAnd shouldn't John against the weaker people that would be one entity called Xi Jinping and the standing committee of the Chinese Communist party when we come back we'll go to our elections there frequent and there's one coming up I'm speaking with Sebastian Gorka\nHe is the national security strategy is to Fox News as well as the author the best selling author of the new book why we fight I'm John bachelor\nTax bill had a lot of that for us and blue states the limits on state and local tax deduction stay\nSo here's what to do maximize the deductions you still have like the charitable adopt the smart way to do that with a donor advise fun from donors trust they will maximize your charitable tax benefits and unlike commercial banks to give you a partner that shares your commitment to smaller government\nVisit donors trust dot org slash bachelor for free guide on how a donor advised fun with donors trust can help you [noise]\nScience fiction author Arthur ... than any of\nIf you have a home security system it might keep your home and family they followed turned on\nBut what else does it do for you I'm Ellie one of the founders of alarm dot com when we started the company more than Fifteen Years ago we want it to create smarter more reliable securing\nAnd alarm dot com system can often too smart last sliding thermostats video indoor about cameras and more we can connect whatever you need to stay in the best part security solution for your home or business\nGet real protection today visit alarm that Tom slash music to finding alarmed that service provider in your area that alarm dot com slash music\n\n... will be talking about on Seventy seven WABC Time Warner center evacuated is evening around seven thirty after reporters suspicious package daily news recording it's in a band in backpack\nOr no reports of injuries chat mourners walking by with some friends when they saw dozens of police\nOn my TV on thin ...\nTake a look at the situation is like a pretty good here the\n... century CNN headquarters which was evacuated yesterday New Jersey department of health crumbling of bacterial infection kind of Newark hospital health officials say an infant died at university hospital possibly from the bacteria infection\nHealth officials say recent inspection act on hospital uncovered major issues with infection control\nAnd we see morning show host Megan Kelly status of network remains unclear and the backlash over remarks you made defending the black face in Halloween costumes today NBC aired\nEpisode of making chilling today and said she\nCan only get to your focus on air apology yesterday here Steve regimen Seventy seven WAMC Ken\nJamie progress is number one number two employee leave a message\nHey Jamie Jamie [noise] this is your daily pep talk I Know it's been rough going ever since people found out about your archipelago group Matt harmony but you will bounce back I mean you're the guy always helping people find coverage options with an enterprise tool it should be you giving me the pep talk now get out there that high note and take\nMatt harmony all the way to national this\nBecause the casualty insurance company and affiliates Bryson coverage match limited by state law\nLets me know\nWhen you go and tell me ... know Timmy\nYou could break ranks for bringing more but you can't beat that show Timmy\nAlexa play Kendrick Lamar and says okay [noise]\nWith Amazon Music the voices all you need to get tens of millions song download the Amazon use the gap today\nBalance of nature's fruits and veggies in a capsule\nI spent years studying how to make this the best I didn't make this because I wanted to make a company other companies are starting to catch on to this and I buy every single other product that comes out so I can look at it and see it in test it and I fear that people will buy some counterfeit\nDon't be fooled this is the real stuff we have absolutely the best process and I can say that because we purchase every single one and check them out\nI mean that was on the market nothing ever worked for the first thing that's really what nothing compared with the benefits of that nature\nFor a limited time use discount code W. A. B. C. and we'll take thirty five percent off your first preferred sets of fruits and veggies and have them shipped to you free call eight hundred two four six eight seven five one\nThat's one eight hundred two four six eight seven five one or go on line to balance of nature dot com and use discount code W. A. B. C.\nI'm John best so this is the John bachelor show I welcome Victor Davis Hanson at the Hoover Institution a senior fellow riding the national Review Online about the optics that is a technical term an off the optics prior to the mid term the twenty Eighteen mid term\nWhich is the focus of every cable TV show every radio show the talk politics and certainly all of members of Congress and the White House and former\nOccupants of the White House and former members of Congress that you're a very good evening you were going to your article\nIn the national Review Online about the caravans because there's a report of a second caravan forming up and about what this means for the midterm but I Want to stop\nAnd know that all day long and yesterday we have information about possible explosive devices it's incomplete information it is at this point not reliable to take any one report and put it together another one and add things up\nI Do have an incomplete ap report tonight that the white powder mentioned earlier in the news cycles\nI Believe associated with John Brennan is not dangerous or is not what is presumed to be dangerous that would reach back to the anthrax I Do have a possible incomplete report that one of the couriers if not the courier\nHas been found on a video or surveillance craft these are all very very vague not nailed down not Reuters not a pie nothing I count on but they're floating in all the time and we have to deal\nOften before elections with incomplete information so a very good evening to you how do you measure the possible explosive devices in comparison to the genuine we can see it on video caravans for the optics of these last days good even if you Victor\nGood evening well so far all we know are incomplete reports and the substances seem to be ... the bombs don't seem to be practical and its before mid term so there's a chance for these incidents can be leverage politically but we don't want to rush to judgment\nAnd then connect rhetoric with fact and I eat somebody says something and this is a cause and effect means that these bombs means something\nBut in the case with a caravan we have hard concrete visual evidence that\nUh if those people from Honduras were able to come walk across Mexico and craft the U.S border and would do it with impunity and we really wouldn't have citizenship sovereignty or the idea of nation for that anymore it's terrible optics for Democrats were progressive that may support that when they know that\nThe majority of American people don't and it's sort of a replay of the Elizabeth Warren DNA video and the Kavanaugh demonstration for the Kavanaugh hearings him so they're just they're in an echo chamber and they think that resonates with the base but most people don't like the instability and they don't like the lawlessness and all those\nIncidents were connected by either they're lawless or there's no truth or ferocity to\nWe have a report from the Pentagon the secretary Mattis has approved additional military forces to the border\nI can guess that they're going to move quickly in the military does when given an order or is this necessary that jar we exposed and Ken the border patrol not handle seven thousand I've heard the number of fourteen thousand because Mexico is a very large country or at the border we can handle it we need troops\nOr we may because it it sort of confirms Trump's\nArgument that a war would be as they always are through history but they work and had we at wall right now it would deter people from coming\nAnd again if people come and think of how it erodes the idea of the rule of law there's people waiting years to come legally for a green card come as refugees they're put on hold people who break the wall and they look you know when you look at the visual imagery\nIt looks like fifty or sixty Seventy percent or young males and nobody seems to be starving\nAnd they're in a large country of Spanish speaking country with similar cultures that they really want to flee an ex essential prayer in Honduras they might want to seek refuge\nIn Mexico but they want to come to the United states\nAnd again it's a disconnect for the American public because they're\nIf they hear so many complaints against the United states that it's racist ... native is that in a phobic this on welcoming and yet people seem to ignore all that and think it's a pretty good place to come\nAnd they can't get the story straight whether we're not a very individual Glazer were very unbelievable to the extent that fourteen thousand or so people would want to ... on march over Fifteen hundred miles and break the law to come here and then continue to break the law by a residing here on lawful\nOptics Victor I'm cautious about this but I'm puzzling about coincidences\nAre the Democrats saw that they pulled very well during the summer\nAnd the controversy about separation of families at the border those where\nI'm at people looking to crash the boarder who were there they didn't they they did not represent something that could happen in weeks they were immediately a problem and the separation ran all summer brand for weeks in fact I think it ran right up to Capitol\nNow we have with weeks to go another caravan marching from Central America towards the border it looks to be a re creation of the original a conversation about what do we do with people at the border and now we have these\nAre possible explosive devices delivered to celebrities or Democrats or celebrity Democrats\nYou both look to you to be theatrical in some fashion in an arranged in a way that points wouldn't make sense without the mid term\nGet evening thinking radically so the president's rally within those in the Wisconsin which is about two and a half hours north of uh of Milwaukee where I live and it is in central Wisconsin so the uh the rally was held at the central Wisconsin airport\nWhich made it convenient for the president because he could apply an on air force one and have the rally right there\nAnd it meant a lot to the people of most any um it was like you said a very joyful time there um I saw very few protesters actually John which was interesting um but a lot of people the signing those red cat\nAnd a lot of people just really enjoying the performance the president put on\nOr do they use the annoyed I have not seen photographs did they use the long ramp walking or did he come from behind the crowd usually there's music playing and he appears applauding which ... ... how is his entrance\nSo he he walked down a ramp from ... air force ... yeah they love that rare few of them\nYes it was it was quite the performance and it did remind me of rallies I've seen on TV before um so I think I think he definitely has a ... year stands by 'em but it was a lot of fun and people are very excited\nAt what point do we leave the script if he was ever on script could you tell\nYeah yeah you could definitely tell so um so I you know John recently there has been the is a kind of suspicious bomb packages\nI'm On Democrats doorstep right because of that Trump was pretty on script for the first for the beginning um other rally and he he really wanted to make clear that it's his job to keep Americans safe and even though this is Democrat\nUm he cares a lot about finding out who did this and wants to bring justice so he was very clear about that in the beginning uh but then as soon as she started going into ah\nAh the Wisconsin rallies you know the content elections themselves and the issues at stake here he certainly went off script and with having a lot of some of the crowd was certainly feeding off of the reaction is getting a and with you know people were doing that the typical chance and\nThe media today has focused for some reason on this lock her up chants that they're claiming people were uh just you know chanting for ... a lot of this rally and honestly John I Can't I actually think of when this when this can't happen like I Can't recall it my recollection of of this whole event\nThough with a very quick chance and maybe a small group of people that did it at at one time but uh it's certainly strange to me that it's been a headline why\nWell let's let's think out loud car let's think out loud I Can't I Can't be certain but let's think out loud in terms of what we do a deal of reporting is getting clicks these days correct I mean you you want people to come to your website or your social media page or to re tweet\nYour remarks and and the people of Wisconsin are wonderful the people of northern Wisconsin I've been to Milwaukee I've been to Green Bay I've been to Madison but I've never been north to this wonderful place most and All right but I'm going to presume that there aren't as many people to click and most any\nAs there are in Manhattan I'm just going to get done a fair to\nSay that ... alright alright\nSo lock her up because the it's controversial an edgy and refers to a part of the president's campaign this is\nA during twenty six gene when he was um using aggressive rhetoric against his opponent Mrs Clinton lock her up has become a way of demonstrating that the president hasn't changed at all and two years\nAnd if you're going to leave with a headline about most any I'm guessing you wouldn't leave with a headline about how the crowd was entertain 'cause that would make the people of most of the clicking on that you ... you would leave with lock her up is that a fair guess\nI think that's a fair guys I think also I just sit in on the ground observation lock her up with kind of you ingest almost like this is like a a thing like if you're in if you're going to say it there was one guy that jokingly when I'm Talking on the crowd he said it was a smile and it was almost like I'm at a Trump rally I'm going to make this joke but it wasn't wasn't talking about Hillary by any chance\nLet let's let's let's remind everyone who's never who's been to a Trump rally your memory of it being happy is correct and let's be ... never been to one I attended the president's speech she packed in February\nIt is it is a ... he's chiefly a performer he's\nAbsolutely and people were just so excited I mean so so John that there's this long long line right to get through security and to the end to the rally right and you walk across the big field and you're there the small tarmac at the airport but there's this large deals where the line is winding\nThat everybody's in a good mood and the crowd and blowing up carefully and it it's sort of like a fourth of July picnic where everybody's waiting for the hotdogs\nOh absolutely and everybody's Wagner there from here and they're selling Trump here and there was music being played and to the song there are a bunch of you know American American bonds being played um but then there was also like uh we are the champions and we will rocky so I'm kind of songs eat expects from Trump\nUm but it was it was a lot of fun absolutely and the American flags everywhere\nWhat did he say about Wisconsin about the political race in Wisconsin Governor Walker icy is hard pressed and uh the reelection for Tammy Baldwin according to\nThe media I'm reading and you know you read what's your pen pals are guessing game so that Baldwin is comfortable in her lead so how did the president responded Walker and ... Canada says\nSo he ... he brought them up on stage and Walker did an excellent job of talking about ah what he stands for he was a very articulate he's strong had good energy\nI'm In the crowd went wild over him so if you can imagine Donny venue you've been to a Trump rally yes\nWe're confident that are devoted the Wisconsin I were at this rally were devoted to Walker and at one point Trump made a joke and he wasn't serious about that but he made a joke about how a he said that Walker was nasty when you're competing at that many that nasty and a good way like he was he was like a big competitor\nBut the people of the people at this rally kind of said oh and I think they have but they were a little bit nervous that he could even say something against Walker because they love and stuff\nAnd and ... who is challenging the incumbent balls\nRight so Google's live near as having a really tough guy she she did they get jobs that are taking it\nAnd she she's a qualified candidate John however I Do think Republicans will have to look elsewhere to pick up speed Baldwin uh she's she's a good he's a good politician and what she does very well in the top and is that she doesn't focus on her uh her centers of power Madison and Milwaukee where she has a lot of good Democrat buttered\nShe goes she actually goes so far and she goes to what they call out state Wisconsin which is outside of Milwaukee and outside of Madison or she campaigns at local events and\nShe's gotten her faith out there are people really people really like her grassroots campaigning on so that's what she doesn't she unfortunately does well but I I really think Walker here he is going to talk race but I think he has a good chance and the people I saw last night and their devotion to have really really made me think that he could he could make that\nDid the did either the the ... the governor or the president mentioned the Foxconn plant that's absolutely\nYes absolutely the Foxconn up you know they've been saying that it it's going to bring Thirteen thousand jobs Wisconsin ends up at the very big deal and yeah so the ... for the governor talks about Foxconn Andy how how ... have you brought that here on President Trump of course some credit as well\nBut I even I even noticed when I was talking to people in the crowd John that\nPeople were saying that not to have Foxconn brought that job to Milwaukee area but it's actually using our resources from all over the state for construction companies from\nNorthern Wisconsin are getting and played a cement companies are getting employed in northern Wisconsin and all these different companies are they are they're saying we're going to benefit and talk on\nAnd what we all care about is it snowing in northern Wisconsin\nWell thankfully for me it was not Saddam yesterday it was very cold a that was already but for the sonic got chili down in the thirties at night but no snow yet\nNo snow yet so you're looking forward to that I Know Milwaukee likes to ski in the north we're speaking with Cory Peterson who attended a Trump rally I Know I Know it's presented one way on the cable TV\nBut the fact is he goes on and on and on he ... you cannot get him off stage he loves being with people who are happy ... of the Wisconsin institutes for law and liberty I'm John bachelor this is the John ...\nGet to all maybe right now get up to forty percent off genes are wearing tease plus grab stylish new genes from is Eighteen bucks for adults twelve for kids and old maybe it'll maybe dot com valid ten twenty to ten twenty eight select styles lonely\nIf you have a home security system it might keep your home and family safe all turned on\nBut what else does it do for you I'm Ellie one of the founders of alarm dot com\nWhen we started the company more than Fifteen Years ago we want it to create smarter more reliable secured\nThe kind of security we'd want for our homes and families that play alarm dot com delivers planted solutions that are tested by nearly six million homes and businesses alarm systems are valuable to license security experts across the U.S who have experienced designing installing in monitoring smart home system in your community\nThis means you have an effort to help you understand the options answer any questions you\nOnce you decide on the spot Homer business security system that meet your needs those same experts and sell your system so it's working correctly from day one and with twenty four seven professional monitoring\nWhether they still have some relevant equipment if they have it it should be removed or destroyed and all this document which is ... ... it from their hair on in my view they need to really been a ... a peaceful nuclear program desperately need this kind of documentation\nDo you believe that the IRA will then be given access to the ... site can the United states and hope for the Europeans get together to to bring this about\nI Hope so but if it's going to be a fight because of the ... to a leader on because of the situation where you now are are ... percent starts coming\nAnd Iran and said that he will try to read it and thought that the end I think they will give you thought that there needs to be a continuous stuff pressure you know that the things they finally go the and\nSince the United states the Trump Administration withdrew from the J CPR way and I'm not certain bustle ask the question I don't have the answer to have the Europeans continued do follow through with the\nO. J. C. pill way that is take information from the Iranians who do self inspection of those exchanges continue or these last month\nI think that there has not been very much is action related to this nuclear weapon a part of the program that's what I speak I can see it from the IRA faults and I hope that now the newly for myself which is coming out\n... and yeah I I yeah I bought a governor with a gun on all the implementation all the not only that chased ... gossip cream at that and the the safe project right now ...\nAnd ... Iran to comply with the requirements upset caution agreement\nSo I just wanted to clarify here the Europeans are not doing anything in addition to what was happening before and they have not adjusted in any fashion with the U.S not in the room\nIt's hard to shake because most of it some documents and meat takes which they ... these are heavy they are on feeding so they don't pop is what they have to be talking among themselves and they end up using what they are talking with Iraq\nA diet or the governor is convening on the second on November and then be no more and to be no more also because about ten days before that he's due next week off from the right thing and I hope that this time they are a little bit more transparent and explaining what they really have done\nHe in your report you you mentioned something that Iran may have transferred some of the equipment or for nuclear weapons to the SP indeed the is separate military wing what do you have the evidence that this is true do you believe that this is something to be further examines\nYes they face and they have to look for a couple of things first of all we need to look what these people who were part of this I'm not alone which was dirt midnight the reorganized in two thousand and four\nWhat kind of where they have been doing since then had they studied the feeling that kept showing bear no known each other on decide they have done some ideas are now ... experiments ...\nAnd what kind of experiments day to day where they are what kind of equipment they have and what happened with they'll shake ... which really goes to the ocean to look out for they must be somewhere and I got ya yeah yes would have an access to the\nTake samples because he looks to me that she's two thousand two\nMore than ten Fifteen Years ago he actually\nHas never been in full compliance with it set up the case which is this information ... what we see today\nAli there was in general and anecdotal information in the years that we observe the Iranian\nAmbition that there was exchange e deep exchange with North Korea and developing ballistic missile technology deliberation and nuclear weapons technology proliferation ...\nHas that continued uh after all of this to and fro ing about Kim Jong on North Korea is still have a\nConversation or a dialogue or a ... an exchange with Iran to our knowledge\nIn this document they so which we have seen so far from these are guys there is no indication on that kind of over ... ... that North Korea but there are some other documents Asia which we have not said we need to remember that only twenty percent of the documentation of course remote control too\nBut we used to ride a depression is over there but more importantly is to find out what these people have to be working and went home office to ... for given the ... will be there\nGiven among those reluctance ... and pregnant she mano is\nThe director of ya yeah which is the un nuclear watchdog\nAnd then that is in charge is charged with his responsibility but he seems to dismiss third party evidence Sherry ... presentations across the board so given that do you think that he will pursue that course\nI don't think he has and the other choice not what we having ... and he's also the deal the Iowa yet the credibility your whole non proliferation racy\nSo I think the CIA ... at the same way we acted in two thousand two at the information on not sauce came out was also one single sauce with\nSome set the image Syrian we wrote to Iran to let the run off some western so you'll see that the history of the two thousand two so these were the I I Know how to act as there is no other choice do you mind you\nAll the ... and ... and then at the foundation for the defense of democracy he is a senior fellow also at the Harvard Kennedy School of government bell for Center for science and international affairs\nHe's our guide on what we know about the suspects nuclear weapons program in Iran that is the centerpiece of the Trump administration's effort\nTo defeat proliferation Malcolm home line conference presidents major American Jewish organizations I'm John the [noise]\n\nThe Russians have hacked our elections are infrastructure and our government secrets but the United states has master hackers to the best one is the CIA cyber race who defies all notions of what a deadly spy looks like Eric ... new novel from done books has spiked\nB. Y. T. E. bite now on sale at Amazon dot com or visit do you and then books dot com and unfortunate news Eric Anderson author of by passed away this man\nEric Anderson was a retired air force lieutenant who was a member of the U.S intelligence community serving tours in Hawaii Iraq Japan Korea Saudi Arabia and Washington DC\n[noise]\n[noise] the\nFirefighter Rafi ... firm firehouse substantial reducing the new firehouse pub stakes a savory steak crispy fried onions in our rich Belgian beer cheese sauce on top for limited time more to yours firehouse subs dot com I remember a portion of every ... by ... by lifesaving equipment first response\nAwesome joy more some save more lives somebody's I'm only ... which is pretty location by herself was only minimum one million dollars to doesn't need to borrow some public safety foundation doing any point when the person every person\nHas one of the world's most celebrated fashion\nDesigner locker found is renowned for his aspirational and cutting edge approach to dial call ever found brings his unique mission upper eastern sheet to America through ... slid collection for both women and men including ready to wear accessories cheeses and bad fashion house ... also offers\nA range of like his I wear and premium Franklin says it is available online at ... dot com and that lord and Taylor and ... are you\nIf you plan on selling or buying a home listen to this important\nMessage rex real estate is selling homes in New York for two percent total that's right only two percent not be outrageous six percent traditional real estate agents charge saving ... on average twenty five thousand dollars as a\nFully license brokerage rex loose on top of real estate website slug Zillow truly a and street easy wrecked uses advance digital marketing strategies to find qualified buyers for your home to see if you qualify\nCall five one six do one seven eight five nine nine\nBy one six to one seven eight five nine nine you weren't dedicated rex team handles everything from photography and open houses all the way to negotiating offers and closing paperwork\nIf you want to pay just two percent you've got to sell your home with rex to see if you qualify golf I Won six to one seven eight five nine nine five one six to one seven eight five nine nine which was only like ... must never once you wouldn't want to see what's going on\nLately it seems like everything we use every day is getting an upgrade\nWhen the bed we sleep in the raise that we use when we wake up but we've neglected one of the more impulsive products in the daily routine that old worn out toothbrush I'm Simon ... and I'm a product designer after I learned how important brushing your teeth is overall health\nI worked with a dentist to ... ... ... toothbrush and makes brushing most simple affordable and surprisingly enjoyable quip that sensitive suddenly vibrations that a gentle on your gums and built in time of the pulse who's the guy do around your mouth\nOnce you decide on the part Homer business security system that meets your knees those same experts install your system so it's working correctly from day one and was twenty four seven professional monitoring\nThey make sure you stay protected\nGet real protection today's visit alarm dot com slash music to find an alarm dot com service provider in your area that alarm dot com slash music\n\nFarming clear ...\nStories are we talking about on Seventy seven WABC the NYPD says reporter suspicious packages at the time Warner center turns out to be a false alarm hundreds were evacuated this evening after unintended packages described as backpacks\nWere discovered in the retail area of the building Sam martyrs walking through the area at the time\nOn my TV on fans came over to take a look at what the situation so I was pretty comparing here though is\nThe second time in two days building has been evacuated CNN is headquartered in the building\nThe recent milling of suspicious packages is taking center stage at the debate hosted earlier today by ABC seven between us Senator Kirsten Gillibrand energy will be challenges shell coral you who called the mailings acts of terror Jula brand sitting President Trump has contributed to a nasty political climate\nI Believe we need to have a role model in the White House I don't think the president has done that and he's unfortunately been convinced says\nRaleigh says ... brand supports eliminating I\nWhich is the growth that actually is primarily responsible for ... for stopping parents\nDeliverance saying she will not run for president if we elected here's the roads are you in Seventy\nSeven WABC traffic is seven W. B. C.\nCrawfish and if you're trying to get to the advent George Washington bridge it's a civil right on the western cross Bronx because of destruction as you approach the lower level\nWas banned on the west side highway you got an accident still being worked on in the one twenties Elise stretch back from the eighties trying to get up to the GW Portland river drive is your best bet right now in midtown everything's looking pretty good in and out of the city at the Lincoln in Holland settles\nIn Queens getting some delays on the west side of the hill I eat and the press island park which is used to be a part ways there's some construction there and\nSome repair work also west been on the belt parkway vice Springfield Boulevard in New Jersey nighttime repairs on the turnpike north and South Bend\nGot destruction in the truck lanes everybody has to use the Harley also sat down on the Garden State park way some work being done by age and one forty seven and from the ... dot com traffic center I'm Steve Reggie\nOn Seventy seven WABC\nMost respected us force sunny so you have these\nFootball baseball fantasy line ...\nFamous\nSo [noise]\nWell when it comes to your health and you deserve the best Hackensack Meridian hell has for hospitals ranked in New Jersey is top ten by US News World Report more than any other network and we're in the top ten percent nationally and then nothing special from Hackensack\nIn Jersey Shore University Medical center in the river and really convey medical centers back while they care and compassion you learn more and Hackensack greeting helped out or slashing us the\n\nTime John not serve alcohol line conference the president's major American Jewish organizations and it's a great\nPleasure to welcome the bravest democratic member of Congress fishes Eliot Engel Eliot Engel comes from the New York delegation he's ranking at the house foreign affairs committee let me repeat that he's ranking at the house foreign affairs committee Malcolm covers both sides of the very nicely\nBut Eliot was swept into the oval office during the Jaycee peel a debate\nWells touches of was twenty Fifteen and\nThe president in the United states had Eliot are broken in front of him in front of the debt and Eliot would not banned he would not banned his arm broken but he wouldn't Ben he voted against Jaycee peel away he was right then he's right now and we're on the eve of the sanctions\nThat the Trump Administration is visiting correctly\nOn Iran for a violation of the nonproliferation treaty Eli you're a hero you're also too modest to say anything so I'm just going to rush right by what are you watching for in these last days before November fourth what will tell you that things are going well\nFor the U.S against the Iranian predators or going badly good evening to LA\nWell thank you first of all my my my head has exploded because you've ... you've made my ego so large threat crave appreciative\nAnd um [noise] look I I've always felt that that foreign policy has to be a bipartisan you know I'll I'll be ending my\nMy fix the air as ranking member of the house foreign affairs committee and for those six years I served with the chairman ed Royce of California and we have work to to get together or we we believe that we are the most bipartisan committee in Congress and we believe that it's it's um\nThe way it should be because when you're talking about foreign affairs I'm you know partisan politics should really stop at the water's edge and we have we have conducted ourselves that way and we had a good a good six years in the uh in in the foreign affairs committee I'm\nElliot you're too generous stop it you were right about J. C. P. away and your party was wrong so here we are what are we worry about\nWell well we're always worried about the fact that of course Israel gets a undermined from a\nFrom a countries who wouldn't know democracy if it hit them in the head\nUm we always need to worry about the United nations and the fact that Israel is treated unfairly there and we need to to counter or some of the allies that are constantly being spread about Israel and the U.S Israeli relationship and I think that has to be done in a bipartisan basis support Israel\nHas always been ... by by bipartisan majorities in where people are um\nAre not doing the right thing we we have to sit down and explain our point of view I think we've got a lot of good things to explain and ah I look forward I'm hopeful that would be the chairman of foreign affairs committee of the house flips I'm I'll be the chairman\nUm I Believe I'll be the chairman you still have to ask your colleagues for support but I'm I'm I'm hopeful that it it it will be there and then I look forward to a\nYou know to working to to make sure that our alliances with our allies the strength and particularly with Israel and that um we we continue on a on a bipartisan basis because it has to be bipartisan uh to to support a support our friends are as you point daddy runs a very dangerous country um\nAnd um has always been since the revolution and uh we should not be approaching them with blinders on\nMalcolm I feel to you because he's too modest that's why he stood up to President Obama\nAnd the Democratic party handle many other issues he stood up on the move the embassy and the ... and you know Eliot and ed Royce who's leaving Congress or were really the models of bipartisanship and everybody in Congress acknowledged it and if only\nYou know others had emulated are wondering ... Elliott if you think that this this will continue and whether we'd be able to interview of the fact that we see the the partisanship\nEnhancing and in ensconced as well as the some of ... and especially when you have to admit on the Democratic left extremist coming in who do not share their views you just described about the U.S relationship with Israel and and the steps against Iran\n[noise] well I you know again I think we have a good case to make for everybody and I'm going to continue to make that case I mean I I I I think that um that that that Israel is the only democracy in the middle east um you know they get to pick their leaders we don't get to pick their leaders that they get to pick their leaders\nAnd um I think that the relationship has always been strong and we're going to work to keep it stronger than ever\nAnd do you think there'll be bipartisan support for the sanctions on Iran that are upcoming will be necessary and\nTougher rally at a week and we have to have a plan B because Iran is a bad actor\nWell Iran is is is a bad actor and um you know that's one of the reasons why we have worked or with their with Saudi Arabia ... obviously what's coming out of\nArabia now is very very difficult to to fathom with a with the er the killing of the mystic us cause so Jay I'm ...\nBut he does make things difficult you've got to members of Congress who have been long supportive of Saudi Arabia um\nLike Lindsey Graham who now have changed their minds because we\nWere very unhappy with what we see so I mean one of the things I've learned through the years is that things things shift and of course in the middle east\nThings changed pretty quickly but I think what what needs to never changes a strong bond between the U.S and Israel and I and I will say that you know a President Obama had differences with Iran as you pointed out\n... ... it could kill you miss it from the triple a foundation for traffic safety\nSo anyway we see them you\nKnow what would you do Curtis I think you've got to try to make it a few minutes has only in putting in one pocket and take a listen who would turn down even if you're a lactose intolerant great who not only from New York oh my God I'm not sure it's going to skyrocket ... wars that\nThree Seventy\nNo back to the John bachelor show so [noise]\n\n\nI'm John ... knock them whole line is here and we welcome professor ought to link Emanuel helps us understand a combination of\nMajor stories that don't work the first or second or third time you hit it you come to them but they do in fact threaten the United states this is Latin America and Hezbollah that's right you've learned correctly Hezbollah\nIs a terrorist organization that dominates the middle east dominates Lebanon dominates\nAll of the characters it touches bug where does it get its money how does it function does it Rob banks well in a way\nA professor a very good evening to you has the law and Latin America how do they go together where is the relationship good evening to you\nAnd good evening to you and thanks for having me\nHas ... has been a a active in Latin America for nearly four decades ever since its inception it has a made sure that uh she a Lebanese expatriate communities that exist in Latin America and indeed\nIn other places in the world like West Africa like uh the far east\nUm and the institutions that serve these communities are loyal to the cause\nA and by by making sure that these communities remain committed to supporting Hezbollah they'd then leverage to communities to engage\nA at the very least and fundraising and often times and that's especially the case in Latin America engage in that type of elicit financial activities that raise funds\nFor the organization now in Latin America the most profitable economic activity unfortunately today is trafficking in co pay\nThem the margins of profits are huge\nAnd the cartels which are you know expanding their reach everywhere across the globe are as society is so far and wide increasingly consumed vast quantities of cocaine cartels needs\nA allies of the global level that can help them transport the merchandise to this the markets sell it\nAnd then ... the money in a way that he looks legitimate and that's where Hezbollah comes in Hezbollah has been helping the cartels\nTransferring distribute their cocaine globally striking deals with organized crime all over the globe and he has also used the network of communities in order to um\n... the money to the cartels federal\nTrade base money laundering schemes that of course in the process because ... gets a hefty commission as payment for its services all of this money goes to fund its activities in the middle east and um you know conservative assessments suggest\nThat all of the roughly one billion dollar a year budget that Hezbollah has had the very least\nThree hundred million that he's thirty percent of its budget does not come from Iranian contributions that comes from these type of illicit activity so it's extremely significant and that means the butler is a ally and ah you know a a very significant contributor\nTo the disaster a of organized crime that he's wrecking societies eating societies from within in Latin America corrupting their systems are and in the process also pushing up immigrants uh and and crime are all the way up to our border\nBut the seems to me to be a conflict in in the way we respond to you so if we summarized we how we got to where we are today in the in especially significant I think today the president signed it has a law\nInternational finance prevention act that was passed by Congress or\nI think last week the final authorization that allows the executive to go after will cause by members indie their financial facilitators yet at the same time and I like you to comment on that but at the same time project Cassandra which appeared to be a success was launched ten years ago\nTo to a counter as well as growth\nOutside in the middle east and yet despite the science of success that it will shuttered and the and the whole team dispersed how how do you account for this appearing instead of this apparent contradiction\nWell the thing is that uh you know be the uh the the the successful endeavor of project Cassandra uh was in the shots or a um but that was under the previous administration and he was part and parcel of a political vision that suggested that\nOr the United states need to seek a the tones with Iran or across the board or that included the going off to her husband are lined up in America and other places where it was below was involved in criminal activities it incidentally involved\nI'm standing down and not getting a you know not not standing up for values and interests of the United states in Syria\nAnd other things and and that approach to Iran which caused the end of project Cassandra went away with the end of the Obama administration here you have another a new administration which has created a task force or in January twenty Eighteen to look into um the reasons why\nAre you know what happened with project Cassandra and try to revive it and that all the you know three weeks and two weeks ago has announced\nThe creation of a task force to calm but trying to smash organized crime it has listed five a top priority is among organized criminal cartels in the world that\nPose a direct threat to the national interest of United States has ... is one of them and now passes this side of this legislation will roll thereby um acquiring new very powerful tools to go after not just has below members and their activities but to go after globally\nAll those government officials and businesses that facility the\nHis Butler's illicit fine I'm so the question now is whether the Trump Administration will turn the task force it has established\nA against Hezbollah financing the task force against transnational crime and the legislation that Congress passed into a real policy that will hit as ... hertz\nAcross the globe and that's what we're hoping for\nWe have thirty seconds how long can we wait before we know whether there's a positive or negative to that question you just asked\nThe president has me or rather the attorney general has given the task force\nNinety Days to come up with a policy and concrete steps so we should know soon whether this is just an exercise in rhetoric or if it is a concrete effort to put back together\nProject the sound or something similar to it to go effectively after Hezbollah using the whole panoply of policy tools that US government has its disposal\nProfessor Emmanuel ... up to ... senior fellow at the foundation for the defense of democracy and he is the leader at the F D D center on sanctions and illicit finance\nThis is about Hezbollah knock on the ... I'm John ... [noise]\nNow it's\nLately it seems like everything we use every day is getting an upgrade from the bed we sleep in to the raise that we use when we wake up\nBut we've neglected one of the more important products in the daily routine that old worn out toothbrush I'm Simon and ... and I'm a product designer after I learned how important brushing your teeth to overall health\nI worked with dentist to ... ... toothbrush and makes brushing most simple affordable and surprisingly enjoyable quip sensitive suddenly vibrations that a gentle on your gums\nAnd a built in climate pulses to guide you round your mouth old typed into a beautifully slim and died many um design we also to live a fresh brush heads on a dentist recommended schedule just five dollars for three shipping\nBacked by thousands of dentists quip is one of the first electric toothbrush is accepted by the American dental associations upgrade your cat and stop brushing better with quit\nQuit start to just twenty five dollars and it's guaranteed for life where the regional bland sign up now I'd get quip dot com slash W W O and you'll receive your first rebuilt tax free with a quip electric toothbrush that's your first refill pack three at G. E. T. Q. U. I. P. dot com slash W W O\nA Iran has made lots of preparation for a new ... for ... as you know on November for a day or last part of the sanctions that she's banking\nSystem sanctions and the old sanctions would come\nA they have made some ... for that to for instance if they have they're prepared to more than four hundred people\nTo caddy cash to Europe to other countries it\nIn case if fed the banking system or if they can't reach anymore or at the same time as they have started to get poll or in some a shortage\nPlaces in China and Malaysia and these days days it along gate Q of dead at the tankers that living Iran they turn off their navigation system is not to be ... followed by ... you know news ages\nRight turn off their friends ponder so we ... we don't know where they're going although they all seem to be headed for China\nBut but yeah but but\nThis isn't that something that that you know this satellite can watch that ride anyway and that at the same time if they are\nTrying to do to\nPrevent any new shocked to ah any new show up to the edge every all of the Iran to cut in sea of Iraq\nAnd for this reason they have allocate to that at some\nUh exploitation hot currencies which is about twenty billion dollars and they get ready if that that will be another wave of sharks too uh that are caught in the shah of Iran injected to debt market a of a hard currency in Iraq [noise]\nBut I I think\nThat in November fourth or we can't expect any ... event but give Roger ... is it by decreasing the exploitation I'll be wrong\nAnd impact of the sanctions an economy every round definitely will weaken the economy and that you know we we can expect more protests from the people\nBut the the there were six thousand demonstrations in the past year I think uh and you know to some of these statistics Thirteen today\nUm the reports that the government is going to issue ten million ration cards or give extra money to twenty million people are they will be sensing that is the potential of uprising unrest they could explode and they're trying to tamp down\nUm ... six times on the the unrest that just in an industry I was ... in a investor factories up Iraq we have protests in other parts of the city are amongst the teachers at my own state\nAnd nurses and the ed every part but\nI you know the regime will be round definitely is the most complicated most brutal and there was prepared regime of adapt region to separate that people\nAre alarming need the leader or has made lots of people ... to ... ... people to show that the United states that\nIf he can control the country dishes and very dangerous game for it because on the other side are eighty million Iranians who doesn't like came and that\nThey are really really are under pressure but but the he has he has started to take that risk\nSanctions will bite there will be deprivation is there a timeline that makes sense to you before we can say\nThe sanctions will not force around to change and we need another tactic\n[noise] um ... as far as I Know a A R turn a humming a mixed group ration to come to negotiations table with the United states maybe\nThey use some ... ... like that you know a ... pack a day on high stakes shaking\nAt maybe they use some countries like France to a as they may be a cure for next\nEh negotiations with the United states\nI I I didn't know exactly when they come but he has a plan to make enough group pressure in that region to\nA ... for the sanctions for everything whenever he feels that she has food food is ... I think that you're going to negotiation\nBy by winter twenty Nineteen by summer twenty Nineteen is there is that a way to imagine what his plan is\n... I didn't know exactly but my guess is that the David we're ready for negotiation on spring\nSpring Ninety spring I get one more question quickly about Iraq do you see them increasing their influence into being accepted\n\nOr as you know they they lost the election to suit is I'm In a mosque by the fact that one but there are more than the others that the seats in parliament\n... and that the government to of other ... is not what they eat Iran a life that law they have another tools in Iraq like ... like the influence in India enemy of Iraq\nAnd they're trying to strengthen but they have lost in Iraq to show the United states that that Iraq is run up they've carts in any future negotiation\nMost of this as a guardian Iranian journalist and pro democracy activists Malcolm hardline conference presidents major American Jewish organizations I'm John bachelor [noise]\nHow many times has it happens you drive away from home turn the corner and then wonder that I thought the garage door with alarm dot com you always know what's happening at your home or business I'm alley one of the founders of alarm that town over Fifteen Years ago we set out to create the kind of smart security system we'd want protecting our family\nSo we developed alarm dot com to be incredibly reliable and easy to use its also backed by a nationwide network of license security expert who will professionally design and Stalin monitor the right around ... wants to know if your garage doors close just set the alarm dot com\nAnd if you forgot to close it you can take care of it with one hand\nAnd alarm dot com system can often too smart last lighting thermostats video indoor about cameras and more we can connect whatever you need to stay in the best part security\nSolution for your home or business get real protection today visit alarmed that Tom slash music to finding alarmed that time service provider in your area that alarm dot com slash music\nBalance of nature's fruits and veggies in a capsule\nI spent years studying how to make this the best I didn't make this because I wanted to make a company other companies are starting to catch on to this and I buy every single other product that comes out so I can look at it and see it in test it and I fear that people will buy some counterfeit\nDon't be fooled this is the real stuff we have absolutely the best process and I can say that because we purchase every single one check 'em out\nI took everything that was on a walk and nothing ever worked that big of a war that is the first thing that's really worth nothing compared to what the benefits of balance of nature\nFor a limited time used discount code W. A. B. C. and we'll take thirty five percent off your first preferred set of fruits and veggies and have them shipped to you free call eight hundred two four six eight seven five one\nThat's one eight hundred two four six eight seven five what or go on line to balance of nature dot com and use discount code W. A. B. C.\nAs one of the world's most celebrated fashion\nDesigners car locker found is renowned for his aspirational and cutting edge approach to dial phone call I ever found brings his unique vision of her reason she's still America through Carl ever felt\nParis with collection for both women and mom including ready to wear accessories choose and bad fashion house ... also offers a range of watches eyewear and premium Franklin says it is available online at ... dot com and that lord and Taylor and ... are you\nLately it seems like everything we use every day is getting an upgrade on the bed we sleep in to the raise that we use when we wake up that we've neglected one of the more impulsive products in the daily routine that old worn out toothbrush I'm Simon ...\nAnd I'm a product designer after I learned how important brushing the cheapest overall health I was at the dentist to ... ... toothbrush that makes brushing most simple affordable and surprisingly enjoyable quip sensitive suddenly vibrations that a gentle on your gums and a built in time of the pulse as the guy do around your mouth\nAll packed into a beautifully slim and dies Eli medium design we also to live a fresh brush heads on a dentist recommended schedule just five dollars with free shipping our attention to the section on quip the time magazine distinction one of the best invention is that the upgrade your cat and stop brushing better with quit\nQuit start to just twenty five dollars and it's guaranteed for life where the regional plan sign up now I'd get quip dot com slash W W O and you'll receive your first refill pack free with a quip electric toothbrush that's your first refill pack free at G. E. T. H. O. U. I. P. dot com slash W W O\nPersonalized plan for each patient through physical and occupational therapy speech and language therapy river spring rehabilitation makes recovery a positive meaningful journey called eight hundred and fifty six senior to lead river springs expert care counselors assist you in returning to your best self\nIf you're a senior recovering from an injury operation or health condition river spring health can assist you in living forward contact river spring today eight hundred and fifty six senior that's eight hundred five six seven three six for six more visit river spring health dot org slash rehabilitation\nDiet dot com\nForty way around bought round the stories that we talking about on Seventy seven WABC the NYPD says report suspicious packages at the time Warner center\nTurned out to be a false alarm hundreds were evacuated tonight after unintended packages described as backpacks were discovered in the retail area of the building Sam mourners walking through the area at the time\nI might be the ban came over to take a look at what the situation by what by\nTime Warner center is CNN headquarters which was evacuated yesterday fire destroyed the Long Island motel flames tour through the Sonoran motel on route one ... just before ten thirty was mourning and they've been vacant since two thousand four team when the fire and damaged the motel\nFifty six year old man died in that fire no injuries recording this morning's fire causing her investigation rapper Tyler the creator is apparently okay following a crash in Los Angeles\nHappened just after midnight when who scar struck a parked car policemen ignore rush thrown around for ... vehicle appear to be told here's some\nRogers was Seventy seven\nMen bumped traffic delays in New Jersey from the ... center inflicted on route three when spending down the road we have a crash at least one link lose heavy delays from Bruce St\nVery busy on the George Washington bridge with construction ... enough productive leads to ten minutes of my family out them lower level closed the in them Lincoln Tunnel sense to be shut down one ... of a home enclosed\nAlternate son working rules in the center for friday which conditions them on the drawing\nBoard for construction delays symptoms between the Brooklyn Bridge in South street I Am in Queens construction work I'm Alone them on the expressway and that's on the Winston sun between Springfield Boulevard and the point of view expressway friends' central the construction east between the ... and ... news well\nFrom the rain 'cause he ended up ... Seventy seven WABC\nCumulus New York is always looking for qualified individuals to fill open job positions and if you're interested in becoming part of our team at Seventy seven WABC or sister stations Ninety five five field Jay\nMasha FM Ninety four seven and reading and one of the three nine calling us today and she went to six one three three hundred and asked about current full in part time openings that's two one two six one three three hundred to one to six one three thirty eight hundred or visit WABC radio dot com and energy where John's college internships available to\nChew meal is is an equal opportunity employer [noise]\nNow back to the John bachelor show [noise] [noise]\n\nI'm John ... this is the John ... show I most well ... my colleague and friend the deputy head of the foreign policy affairs department of Azerbaijan in the presidential administration pick Mack how she asked\nWho is here from ... to comment on the visit of the national security adviser John Bolton to buck code to discuss critical themes for the region the south caucuses in the Caspian Sea bass in\nBut also for the United states of America in these last days before the U.S will impose\nVery strong sanctions on Iran which neighbors as about Sean and is dealing always with the unknown ambitions of Russia which neighbors Azerbaijan and also is keen the United states and the Trump Administration\nTo resolve the frozen like conflict between Azerbaijan and its neighbor Armenia\nDating back to the end of the Soviet Union and the late twentieth century\nPick them up a very good evening to you and thank you for visiting the first thing John Bolton visit to and to sit with and speak with President Ali or\nI Want to know that this is extremely welcome because I Believe that the U.S has not visited for some time and there have been very few visitors at John Bolton level to discuss critical matters is that all correct good evening to you ...\nA good evening John and thank you for that Senate forget it this week uh I bought with us in a relationship\nYou have to write the the oldest up this year with anticipation of high level but it's it's been a United States and other by guy on John Bolton had to use and I are poor knowledgeable person\nAnd he's also a with a quote in the current United States on station out of it but if it's is it and uh he had it for that that's a discussion with my friends I'm I'm president Ali\nAnd they had that vote change where you are on for the promotion of United States a partnership in many areas and he also right we mentioned but otherwise um is that it's important a country and read a joke but typically are important region\nAnd uh we have cost the data that we did a energy cooperation fight against terrorism security their latest cooperation and many others wears a trace of cooperation between the United states either by John\nLet's begin with energy because uh my visit last summer was right before a very important document was signed in the Caspian Sea bass and to make possible for Turkmenistan to join with Azerbaijan do connect to Europe with natural gas which\nProvides energy security for NATO and for our friends in Europe\nI'm going to assume that that is all going very well and John Bolton was there to secure how good this is that as a by John and Turkmenistan and the basins are participating in the support for NATO do I have that correct\nA and it sounds a yes Sean I just wanted to add about in general we either by John highly valued United States at ports to energy policy a closet by John ... over the age of what the gap independence a over the disintegration of the Soviet Union going up again in ... in the end of independence\nBut what about than it is it time for other by ... by the United states at all it's a ... bike and public school I mean the United states companies also joined uh the uh many construction or that taking place and if he's part of the world on to get other jobs oil and gas for the surface of the international market\nAnd since then our lunch the other topics that energy policy and a court on the other but John Cleese and ... energy security or many European countries\nWho our allies and partners uh you know I could stay\nOut of a carpet Wharton ambition gas for just let the up on top of get a tax cuts down to the gas to the European market out to be also a United States support to reach porridge it but then we go up again I guess a joke for you\nTo a joke and find out what it told me and a European Union member countries including at each other and some others\nGet that from with energy cooperation you also write the nation's a like a combination on the status of the Caspian Sea with my other productive almost an author tremendously contributed to his project what\nA finally we have an ... states of the cat fancy and also be called the constitution of the Caspian Sea provide the predictability of security in the ... I don't support what the corporation among the country\nIncluding a in a a security on the poor wedding security and safety or is that why to ask about the race and\nAnd the thing is a form of that uh approach will continue our corporation with the the two countries and of course the United states support to office for a while I watch welcome ... ... it's a with a ... for John Bolton we discuss extensively energy corporation in the United states and Azerbaijan\nThe concern here you know as we approach the severe sanctions on Iran which the U.S regards as the chief sponsor of terrorism in the planet is that\nSanctions on Iran because it's your neighbor and because you share road systems and transportation and the Caspian Sea\nThe U.S I see from John Bolton ... voice of America does not want to damage Azerbaijan economy as well I'm assuming that was part of the discussion between president ... and John Bolton that the sanctions do not hurt our friend Azerbaijan\nAnd yet you are in general other workouts foreign policy novel foreign policy we are seeing a ... an otherwise and has managed to establish that quote a partnership and ... with its a neighboring countries including Russia and Iran and some other countries\nAnd that is no alternative or having a good than normal unstable relations with the neighboring countries\nTime alley one of the founders of alarm dot com when we started the company more than Fifteen Years ago we want it to create smarter more reliable securing\nThe kind of security we'd want for our homes and families pathway alarm dot com delivers hunted solutions that are tested by nearly six million homes and businesses alarm systems are available to license security experts across the U.S to have a stain designing and sign in monitoring system in your community\nThis means you have an effort to help you understand the options answer any questions\nOnce he decided on the part home our business security system that meet your needs those same person style your system so it's working correctly from day one and with twenty four seven professional monitoring\nThey make sure you stay protected\nGet real protection today visit alarmed that Tom slash music to find an alarm dot com service provider in your area that alarm dot com slash music\n[noise]\nNow back to the John bachelor show some way [noise]\nWith John John ...\nThe Supreme Court and arguments before the Supreme Court is spectacular so I'm very much welcome Ted Frank the director of litigation and the Competitive Enterprise Institute\nWho is about to make a case standing before the Supreme Court about an issue that you've all heard of class action suit what you didn't know and I've learned from Ted now\nIs that class action suit benefits the law firms bringing them by in the case of very large class action suit such as a recent one against Google\nThe actually offended parties get almost nothing if nothing at all this is a twenty first century version of ambulance chasing to my to my amateur eyes jet a very good evening to uh this is a revelation to me that law firms are in the business\nOf chasing class action suits not to share it with the offended or harmed or litigants but to in fact cut her up for themselves or directed in some fashion or two powers of their wishes this is ... Seventeen struck nine sixty one Frank versus cows you're the Frank\nYou're arguing on Halloween to do with a federal rule of civil procedure about class action suits wear ... according to the quote that you provided to me\nWhere so doing is quote superior to other available methods for fairly unofficially adjudicating the controversy the question before the court is whether or and what circumstances\nA sigh press that trust law doctrine award of class action proceeds to provide no direct relief to class members\nSupports class certification and comports with the requirement that a settlement binding class members\nMust be fair and reasonable an adequate my amateur translation is they're going to decide whether it's okay for the law firms to get everything and the litigants or offended part is to get nothing what is your presentation to the court at good evening to\nThank you thank you for having me the presentation to the court is a before a court can approve the settlement under the rules of civil procedure to have to make a finding that it's fair reasonable inadequate\nAnd it's not fair and reasonable by definition of the attorneys are getting all the money in the class is getting nothing and trying to hide that the classes getting nothing by steering money to third parties in this case the attorneys alma mater the alumni donation using the classes money basically\nAh doesn't make an unfair settlement fair the\nParticular case if I follow correctly and Ted is my guide here I'm just reading is Google\nGoogle offending a the the class action team because it took advantage of privacy restrictions and didn't adequately\nFollow or provide information to those using it now we all use Google so we're all in on this and the estimate of the New York times article right up of this is\nWe're all due for sense that's not going to happen because it's inefficient so therefore the eight point five million dollars or portions up entirely to the law firm is that right cat\nIt it goes to law firm and then a basically a slush fund of of organizations that law firms and and Google wanted the money to go to a and you know these are suit alleging violations of federal law and if the crew\nThe violation of a class number with the entitled to a thousand dollars so that clearly didn't think they could actually prove this because they settle it for us you note force them to class member\nMan we're not asking for the force but you have this eight million dollar pot of money and you can find a way to distribute it to class members the reality is these notices in the mail\nAnd and you can make the pot of money available to people who filed claims to get the notices and say yes I Want my share of that eight million dollars and the reality is so few people ask for the money you could distribute five or six dollars per climate uh I\nI I've had these notifications over the years because of the end of certain companies that I purchased or the companies of one of the business because they sold out and they sent me this document saying you're part of a class action suit and I say I don't want anything to do with it so I run away from it\nAnd and that's what most people do a so it's possible to get money to the class if they actually want to write a they just didn't want to do that because they'd rather see the money go to their own lives\nAnd the four and the courts in this case this is the Ninth Circuit court that's a pretty big court at this out west they dominate the west the Ninth Circuit court isn't going to apply the law firms at issue and you you give me their names one's in San Francisco not Siri and John or young and the others in Colorado camera law\nThose law firms are not required by the federal government to make good to all the injured parties couldn't they do that isn't that imaginable\nIt is and that's what other circuits of done with one case was in the seventh circuit in the ... circuit and the third circuit where\nThe court says look the the attorneys have if I Do share a duty to their clients to get the money to the clients first if you set up the legal rules like the Ninth Circuit did that the attorneys get paid no matter what\nWell of course the attorneys are going to prefer to give it to a charity the Senate wants because then the defendant will say okay we can get two million dollars to class or for a million dollars to our favorite charity and the attorneys say will give the four million you you don't give the money to the class give it to your favorite charity and then we can get a larger attorney\nNow this is Google right Google were all have Google Google had easily communicate with all of us what do you want to do with your four cents John and that could give me boxes to check off you know the red cross or the ASPCA\nOr protecting of a wild habitat they could do that and the law firm ... direct Google to do that that's not that's not a painful remedy do you agree chat\nWell I mean there there's a reason they don't do that and that's because if they told the class members hey you can make a claim for a five dollar check or you can check this box and you could give it to my alma mater a ... everybody's going to demand there five dollars right there they're not or they're not going to make a claim at all\nUm they're not going to say I want the money to go to my lawyers favorites\nYou're ... if if I Want five dollars to charity I can write a five dollar check to charity or or bigger ... ... I'm ... but it it's that the lawyers are are are trying to not give consumers that choice that they don't want to because the consumers would want the money\nIs this a well known problem cat has this been going on for a long time it's sort of a deal between lawyers in courts and we're all ignorant of it\nAh I mean it's been an increasingly big problem uh and it's going to get even bigger if the Supreme Court doesn't act or this year or another nine million dollars and it was a small class it was only a billion people\nWould have been and they had everybody's address what would have been really easy to just bail everybody a check\nEven asking them to check a box\nIs it because we have too many lawyers and not enough work it just because of the lawyers in India who are doing jobs on line is there is some crisis that I didn't know that Ted we've got about a minute\nI I it's just we have the rules in place and judges aren't enforcing those rules\nBecause the the the attorneys have the incentive to maximize their own attorney says\nIf you're in a class action suit you can do something you know ask you for your forest answer your five dollars and it was a law firm as and say what the heck you didn't try to reach me you didn't try to give me any money at ten Frank is arguing this before the Supreme Court on Halloween he is the director of litigation\nAt the Competitive Enterprise Institute on John ... this is the John ... [noise]\nEvery Sunday [noise]\nDiet that house about\nForty four and clear I'm Barbara ... will be talking about on Seventy seven WABC the NYPD says report suspicious packages\nAt the time Warner center is a false alarm hundreds evacuated this evening after unattended packages described as backpacks were discovered in the retail area of the building Sean to Ghana and happened to be in the area with friends at the time\nThey have a a Gray's registration unit that goes to each one of the cemeteries and they select an unknown body from each one of those cemeteries\nThey wanted it to represent the the major battles that the the ... America had fought in er during World War one and a body was was retrieved from each one of the cemeteries\nAnd they carefully went through the uniform for to make sure there are no dog\nTags or paperwork or a diary or a letter because they're always looking to identify a body they always even right up to the air exactly right so they want to make sure that it is an\nAbsolutely unknown person they then take the um\nThe grave markers that are paper coded that show were this ... known was numbered in the they burned the right and the and we don't know what graveyard came we have no idea about the um the bodies of then brought back to shore loan France where there's a um\nThere's a fringe honor guard waiting and there's many French civilians that are there to honor our on your own\nAnd we also select several individuals that are part of a kind of an honor guard there including Edward younger\nBut ... alone\nTherefore bodies now right there are foreign born from each grave yard and they don't know which graveyard there from\nExactly they're brought into the city hall that she'll loan and their flag draped in that night and major a general in the U.S army is supposed to make the selection\nBut the French intercede and said well we used a a regular grunt they're done a lot of fighting select our our on them and it just a common soldier so the decision was made to choose a dough boy a regular job where they had been through the\nScience fiction author Arthur C clocks at any sufficiently\nAdvanced technology is indistinguishable from magic remarkable memorable experiences in modern stadiums airport transportation hubs and smart cities transformed public perception intelligent digital signs\nAnd smart censor provide the opportunity to impress me while serving the public scholar a leading level of technology company powers millions of digital signs around the world visit scala dot com today to start the conversation about bringing digital transformation your modern venue\nIf you have a home security than it might keep your home and family they followed turned on but what else does it do for you\nI'm actually one of the founders of alarm dot com when we started the company more than Fifteen Years ago we wanted to create smarter more reliable secured\nThe kind of security we'd want for our homes and families that fire alarm dot com delivers\nHeifetz elation that are tested by nearly six million homes and businesses alarm dot com systems are valuable to license security experts across the U.S who had a stain designing and sign in monitoring smart home system in your community this means you have an effort to help you understand the option to answer any questions\nOnce he decided on the spot Homer business security system that needs to me those same aspirations cellular system till expressing correctly from day one and twenty four seven professional monitoring\nThey make sure you stay protected\nGet real protects them today that alarm that term slash music to find an alarm backgrounds service provider in your area that alarm dot com slash needed\nMoney and sit in the morning here let me ask you a simple question what would you rather your adult boring old lay in bed over here or your bed\nAll jacked up on steroids party [laughter]\nThese are legal fell Royce do that\nIntroducing the most advanced sleep surface ever created my pillow mattress top of the bill America's top worship God by the way is awesome guarantees you the most wonderful deep healing sleep of your life my pillow mattress covers made of three layers that will transform your sleep just like a strand for mine I have what is well my wife and I we love at\nFirst too far away from my superiors support even distribute your body weight and temperature throughout the night it's all covered with a super ... silk fibers that zips right off is completely machine washer and dryer trust me but as uncomfortable don't spend your money on a new one by my ... much tougher\nInstead and right now for you are WABC listeners get thirty percent of all new my pillow mattress ... and to standard my pillows in one great fun to go right none of my fellow dot com today\nAnd use the promo WABC nuts my pillow dot com\nMost respected force on these\nDays off the line [noise]\n[noise] [laughter]\nMost respected us force on Sunday so you have these\nFootball baseball fantasy life [noise] [noise]\nFamous one\n[noise]\nHi it's Rena Cosby from Curtis and Cosby did you know the best time to both of your family\nAnd group holiday travel is now\nFor all of your hotel need look no further than hotel plan or dog pound day our number one in group traveled plus they have a free event planning service to\nMake sure your trip his seamless hotel minor dot com is sure to get you the best rate during the busy holiday season caller did their travel planning expert that hotel planner dot com today to ensure the death rate around the world\nI don't drink I don't smoke\nAround three miles a day\nI just had a complete physical my family has no history of breast cancer\nIt's curious how healthy habits and good family history\nTo excuses\nAnd yet we still need\nAnd I W J Barney this how\nWe offered the latest in comprehensive breast health services\nIncluding mammograms reading anagram genetic testing and breast surgery [noise]\nNot to mention peace of mind [noise]\nBreast health centers located throughout New Jersey [noise] finding is simple\nTo me the most the breast cancer awareness month\nBy visiting our W. J. D. H. dot org slash manner\nMaking excuses is easy\nArgue the tape on this house\nNext beep breast cancer together [noise]\nHealthy together\nCity or if you consider how much do the Japanese premium brand US News and World Report maybe the two thousand a gene best friends they build some of the most psychological SUVs I also was available today\nOne reason is active technology more powerful form it's out of their engines that means you spend less on gas or the best places to ... to see a five months of the ex nice as Ramsey much so beautiful place almost Seventeen as soon as Bergen County New Jersey we don't need this ... Missouri dealership in New Jersey\nHow do they do it I don't want to express funding is bringing some means no waiting around to get prices have payments quickly floods of choices for no real drive SUVs for the most of the F five is a great choice not to go to a big family to me that she thought about checking out the most of the ex nine studies the premium has to be for you visit Ramsey myself you're a test drive today the\nSpecial offers available almost lost qualified by our subject to primary ones are all ... all costs to be paid by the consumer except for the taxes some is LA is Halloween October thirty first of Eighteen\nOh\nNow back to the John bachelor show the John ...\nAnd has had brought together a compendium of these are well used to call in seminary ... these are pieces from longer worms and bugs and some of them are from or published by the literary giants of the twentieth century\nIn Germany in England France and America in the Eastern European the former hops Berg empire\nAnd there are female voices here as well that Pete has included we'll start with beer Britain because this was a smash hit of her time testament of youth and it's a very Britain lived out her life as a pacifist that is anti war this is her in the dying words\nOr two pieces destiny was not willing and I thank you sister the first is devastating peachy is writing of a woman a nurse who gets a letter\nOr who is told by a friend of hers that herbal love it has been killed and then she gets his letter three days later I thought she was going to commit suicide\nMm Mm [noise] but I mean there is a kind of amazing sort of you know the catch\n... almost you know Ira and they in you know when when she writes you know how are you know she remembered the ad in the newspaper which said\nLady fiance killed will gladly married for ... totally blind date or otherwise incapacitated by the wall so that's you know this very sort of dark humor about\nYou know ... ... ... to April do uh in those situations\nShe's recalling an ad she'd seen earlier in a paper\nAnd now it comes to her that why not why not take up later today on on wounded at random but she doesn't do that via Britain stays with becoming a nurse again and she out although I like the letter she gets from a friend of hers and he called the battle veep\nOur friend wipers which plunges you back into the humor that ghastly humor of being at the front or we know now that these men were being massacred routinely and they were calling it battle\nThere was no way out they threw\nFrontal assault against frontal assault against machine guns and enormous each guns\nAre and both armies the German army the French Army or the British Army were caught up there was never any significant movement in four years of trench warfare veer Britain doesn't know that\nAt the time that she's writing a she has a ... you have another piece I thank you sister in which he but friends a matrix or someone supervising award who is seen as arbitrary and\nA snap at ... but she regards as a friend this nursing they were hand holding the hands of the enemy is she the one that is assigned to the German prisoners is that is that beer Britain\nAh yeah yeah I think it yeah on a ... member actually\nTold her she has to she has to care for people she thinks killed her blood\nBut yeah yeah I think but it was just it was something you know that she she did you\nKnow because well I mean I think it's very very difficult for us to imagine\nYou know a ... well what was going on in you know in people's minds in these conditions um [noise]\nYou know and and also I mean obviously there's the contrast between what they were experiencing on the front to ... you know nothing and everything and they what was going on at home and you know what people were saying and the sort of\nRevulsion that they felt you know when they went home on leave in people's attitudes and to sort of general you know\nUm that it was a base in a sort of see of heroism and they knew the conditions are ... you know what was going on\nNothing more clear than the ... the inclusion of Helen ... Smith who writes a piece that is included here liquid fire and the beauty of men who are whole she's an ambulance driver and I take it she's a truck she's driving the vehicle for front back\nA hospital she's looking driving on a snowy road I take it's a dirt road and she's finding a way that she can and its\nHorrible episode because she can hear the men and back screaming and she won't stop\n[noise] right yeah you know I think it's a\nIt's obviously and and they you know it's almost you know because she's competing with the other women ambulance driver who's going to be you know in a way I mean that's that's the kind of attitude that you have to take 'em you know you just have to get on with it and trying to try and be as efficient as possible um [noise]\nBut there's a great show to feed into gallows humor in in the right thing and it's\nInteresting to know that she went on to write in a romantic levels\nAnd I liked her for that she is she she found a way to turn this Har which she experienced into\nA writing romance and lived a long time lived lived a bountiful live but certainly the her prose here is this is rough Pete I did not know this this kind of stuff in this kind of material was was celebrated at the time it means that there were all there was an audience\nFor something that was very different from the patriotic speeches they were hearing on or off from their leadership\n[noise] well I think yeah I mean I think that a lot of you know the [noise]\nBooks I mean that I've included Web Web ... I mean you know obviously in that country's you know where they were written and you know it's important to realize that the rice has\nThe foreign languages have the same stature in in their electric ... by you know in in Romania or Italian or German mixture is as people like you know Robert Graves and soon\nAnd their Britain have old folk now have entered in English and American so old oh we don't know or some of these you know righteous that certainly very well known and loved you know in their own countries\nLet's include Irene rice bone I had not read her before she again is witnessing war\nFrom the point of view of being a nurse or this or they're called the ... the volunteer a detachment", "year": "2018", "show_name": "The John Batchelor Show", "city": "New York", "day": "26"}