{"month": "10", "state": "MS", "station": "WMPN", "content": "Di di di di\nDi di\nDi\n[noise] [noise]\n\n[noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n\n[noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise]\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise]\n\n\nSome German pot from voting pack that San smile meditation features Tyler done can it's what's the would rather senator currents with happiness Jones and Nikki bloom and the ... with deep water\nIt's been a pleasure being with you this last hour for more details about anything you hurt don't forget we have to play list at undercurrents radio dot net and this is show number forty seven sixty\nThanks to Greg and the quicker Christina on his dad and show Yuri I'm ... undercurrents is made possible by your support and by the corporation for public broadcasting and envy one stations like\nKay algae in cow tag Alaska\nAnd ... in Malibu, California this is native voice won the Native American radio network\n[noise]\n\n\n\n\nYet you're MBP car tag anytime doesn't even have to be up for renewal of simply go to your county office to sign up when you get to be be car tag portion of the helps MTV continue to educate informed entertainment\nFor deep am MTV online dot org slash carjacked\nFor Twenty years so World Cafe has been looking forward to what's next in music and keeping an eye on the richness of the past I'm David dye would live interviews and music do you need to know about\nAnd music you may have never heard before but I sure did lob the world cafe has become Public Radio's most listen do popular music program don't miss our next show today to chip in ... music radio [noise]\n\nThis week on a special issue both of Mississippi US Senate seats are up for reelection and the general election state representative David barrier is vying to unseat incumbent senator Roger Wicker and Mississippi it's time for change there's also a special election to fill the remaining term senator five conference see the\nSecond Amendment rights are very important to me you've got to make sure that we can talk with writing dry I don't believe the government should micro manage alive\nIssues of substance rpm discuss brought a seven thirty pm on MTV TV\nStations have been ... be music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nThere'll be MP in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him be be online duck or gee\n\nIt's ... and like I said I'm here with you with some great music coming up we'll hear from kept mowing Taj Mahal the milk carton kids candy Staten and not go and medicine for the people let's begin with a tune by Rodney crowd that he wrote in two thousand five [noise]\nI feel like James Dean\nI was a breeze here right\nBreak from the ...\nWas waist deep in the [noise]\nNo\n[noise]\n\n\n[noise]\n\n\nGone from beginning to be shocked to use the\nMother Jones does [noise]\nNo [noise] no [noise]\n\n[noise]\n[noise] ...\nDo you know [noise]\n\nNo no no no [noise] no\n\nThe incomparable kept ... and Taj Mahal ain't nobody talking that's from their Taj ... thousand Seventeen release\nCody Canada and the departed gave us if you're ever in Oklahoma and it was Last Train with ... now and Rodney crowd with things that go up in the day\nIt's ended currents I've got to the air that Tim O'Brien turbo fruits and milk carton kids are cute at but first let's hear from an all stark health except from northern California here's wake the debt\n... ... ...\n[noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise] ... ...\n\n... ...\n... ... ... ...\n[laughter] [laughter]\nWhen\nAny any day we\nMay be\nOne thing they do do you do in this they're going to\nBring me bring in\nWay way way way like\nRanger me\nWhy do you do when you well we\n... we do the right\nYour mind ...\n[noise]\n\nMe and do the other day\nWe need\nMe maybe the bin ...\nNow they're saying about\nTo two new to the to\nWere dream ...\nLab in your way through that dream to\n\nMade\nSee\nTo do more than just being in New\nGreen do we need\nMe or a man in a while\nBeing David you needed here now in\n\nAnd ... and\nWe bond blame the\n... you need to\nBe you\n...\nMe or she\nYour dreams of origin\nLook deep and the dog\nHe you'll\nListen for their voice in the [noise]\nKnow\nMain\nWatch\nA\nSing Jimmy you saw how council no gain\nTo do is ... ... the [noise]\nJust be on your oldest is ... ...\nOh maybe\nIt makes me Joe oh God\nHours\n\n[noise]\nSure they do the gym three with John they changed the youth [noise] I was making the green\nGreen grass\nAnd the ship booze viewed\nSome trouble there was saying to me\n\nThinks\nIt just showed\nIt's the main [noise]\n[noise]\nAnd [noise]\n[noise] and\n\nWhere\n[noise]\n[noise]\n\n\n[noise] [noise]\n\n[noise] hello I Do not go to the zoo undercurrents radio live in direct ...\n...\nJust ...\nMiles\nMake you know what I mean do you do surveys\nMemory ...\nIn Beijing she's going to take them ...\n... ...", "year": "2018", "show_name": "NEW Hearts of Space", "city": "Jackson", "day": "29"}