{"month": "10", "state": "MS", "station": "WMPN", "content": "Is real job [noise]\nOh\n[noise]\nTo make the big bang bang you\nKnow I Know um [noise]\n\n\n\nNo no\n\n\nAnd then we do a lot of information out there really quickly so if you missed it it's all in play list show number forty seven easy what that under current radio dot yeah\nAnd we noticed a lot of people picking the Boston Twitter feed as well just follow which had gone underground to get the latest everyday\nCheck station website she's there weren't Facebook Instagram and Twitter and we'd like to interact with you so we'd be in touch\nDrink shore team Gabrielle Acosta one Christine understanding Joe ... a great record in support comes from the corporation for public broadcasting from the friends of under current and from envy one stations like\nGDP up in Morrow bay California in Kenya so far in Santa Fe New Mexico and this is Nita voiced what the Native American radio network\nFor Twenty years the world's ... been looking forward to what's next in music and keeping an eye on the richness of the past I'm David dye would live interviews and music you need to know about I mean you may have never heard before but I sure did lob the world cafe become Public Radio's Muslims who do popular music\nProgram don't miss our next show today to Jim ... music radio [noise]\n\nStudents are going to the polls this month to participate in a mock election for the upcoming Senate race teachers there still time to register students for the promote the voter initiative which provides a variety of ways to learn about civic engagement if your school or classes already registered\nLet the voting begin deadline for submitting vote since October twenty six more information at NBC on line ... ... and ... and the Mississippi secretary\n... ...\n... today a reader so Marlboro a leader is a quote all about the power to overeating or not do with twenty ... we want you to celebrate that power\nAs we read for the record\nFor your support for literacy for every child in Mississippi to take the pledge to read the book maybe something beautiful on October twenty log on to our website it'd be online dot org ... information in October twenty fifth let's read for the record\nThe stations have been people be music radio R. W. M. A. H. Biloxi WMA boom bubble W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at MVP online duck or gee\nAlright that's undercurrents I'm Greg with vicar welcome coming up and it went from Elvis Costello gets a snarky puppy or you know my parents my green and this from ... it's [noise]\nAnd came\n\n\n\n\nThey\nNo there\n\nDidn't you guys who were\nBorn\n[noise]\nDo your\n\nI\n\nJust I was still on the new tower a song Leonard Cohen tribute on PBS wow he killed\nMr Mrs harsh from his new album look now Elvis Costello and the fosters it was the cars were hits me from move like this Bobby Baird junior rock and roll Halloween and Kiki ups the bottom of the sea\nIt's undercurrents on your radio we are jumping right back him right now with Patrick Lin doesn't this is from his album ... all the song is like ... ... that's when does it or not to ...\n... ... ... Mm\nMm Mm Mm\nGoal is the ... le\n\nLe Le Guin ... O E number ...\n... ... oh no no he\nGo God he you know ... ... can be a good meal um\nYou know all of a ... you go ... no\n... no ...\nNo way to go away or ... or ... or ... or ...\nWho ... who do little or clothing jeeze ...\n... ... a little uh who who man or a no ...\n\n... or ... or ... ... ... ...\n...\n... or ...\n\nCome into our love no ... ... ...\nAnd they all the way\nThey uh they go\nThey go as a woman who\nUm well really old ... ... ... ... ...\nNew Jersey\n... ... ... ... ... ... ... ... ...\n\n\n\n\nFor two weeks\nDo\nYou mean\n\n\n\n\n\n\nHey this is my first nuclear didn't look at the courage to American music has been\nAnd it is that you know then\nCan do to your name in it I suppose the real thing you\nBottle then\nYou get all the way that the yeah it'll last day\nDo\nYou look on June ... back there but thank you\nThank you you know they\nDon't read do they say\nWhat no\nYo da da da\nNa na na na na na na na na\nDin new\n... when you're married\nTold me he\nIt did happen yeah\nKenny I'll\nTo\nWhere do you draw that does a little\nBut then you don't even believe\nMe\n\nJohn\n... yeah\n\n[noise]\n\n[noise] [noise] [noise] and the people doing\nLots of you know you're going to pull the bio about disarming [noise] read about [noise] you go to most of them they would let you wanted to take a drink of watching those go talk to try\nNothing\n[noise]\nThen the next thing [noise]\nNeed another place to go\nMe by the day\n[noise]\n\n\nLittle W buys you look back on the line you check your\nThat the students don't know I've been told to John getting some swim always say\nSome strings you've got them come to get your dreams you send those ...", "year": "2018", "show_name": "NEW Hearts of Space", "city": "Jackson", "day": "22"}