{"month": "10", "state": "MS", "station": "WMPN", "content": "Live in\nDay yeah\nA lot of the law that was the last oh no\nSome things that live in New Jersey and on\n\n\nWould\nAnd\n[noise]\n[noise]\n\nOh [laughter]\nAnd [noise]\n[noise]\n\n[noise]\nThat's a ... and the king bees with bang go from the complete Stax volt singles Nineteen fifty nine to Nineteen sixty eight it was Jim go steam and truth Jones on undercurrents with live with yourself\nNicole hard in any piper brought us Catholics you go and Shannon McNally was at the top of that set with role in the way the stone\nIt's been a pleasure being with you this last hour thanks for sticking around for more details about what you heard check the playlist out at undercurrents radio dot net this issue number forty seven fifty three\nThanks to Greg may quicker Christina on his dead end job Gary I'm going to be like I said on\nA new currency is made possible by your support thank you and by the corporation for public broadcasting and envy one stations like K. U. W. J. in Jackson, Wyoming\nAnd W. CJ be in Hayward, Wisconsin this is native voice won the Native American radio network\nYou know\nAn evening of Jazz Can be just what the doctor ordered takes a great Ella culturing Dinah my mom\nMakes and the contemporary giants like short written more chronic Malone and Vincent join me in Marin Michelle the W. J. yes he evening that seven to ten we talk\nOn MTV music radio um\nStudents are going to the polls this month to participate in the ... election for the upcoming Senate race teachers there still time to register students for the promote the voter initiative which provides a variety of ways to learn about civic engagement if your school or classes already registered\nWith the voting begin deadline for submitting votes since October twenty six more information it it'd be be online dot org brought to you by NPR\nYeah and the Mississippi secretary of state\nI'm an artist I like the bank I'm a chef\nI like to go like to join us for how much about what this season from northern oh now do you balance the ballot joined me Robert site John White water we're going to ... Porcello right outside of business and he's going to do a really colorful [noise]\nHe's gonna be sitting on\nA survey by people\nOn television\nStations have been ... be music radio R. W. M. A. H. Biloxi W MA boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at impede be online duck or gee\n\nIt sounded Koreans caffeine like I said I'm here with you with some wonderful music I picked out for you for the next hour including songs by Chester night and the wind Frank Bank prints and Willie Nelson and family\nLet's start with with my future elevators bandleader Michael shackled Ford plays all the instruments in South here's future elevators on a degree [noise]\nDon't do\n\nOn\nYour own [noise]\n\n\nSo strong [noise] stand names so strong\n\nWell I Know\n\n\nTo Joe\n\nYou know [noise]\nAnd it is a [noise]\n\n\nI'm just [noise]\n\n\nThat's Canadian native artist gesture night and the wind with the song history he's usually running his catering business called gesture nights panic bistro but when the idol no more protests grew he felt a powerful urge to pick up his guitar again and communicate with these people\nLast Train in front of that from Alaska with ... now Regina Carter gave us trapping ... is Bronx brought us love sick and future elevators started that sat with machine maker\nIt's undercurrents I'm Glad that he either born in Philadelphia and raised in Georgia here's Frank stay with a new one from an album produced in Nashville hears take it back to Georgia\n\n[noise] [noise]\n\nGone through a cool\nRoof me she's burned in the town where\n\nThe Jones or\n\n\nAre you do your driver during this girl\nWouldn't Brittany oh no\n\n[noise]\nConstruction in the [noise]\n\n[noise]\n\nWe started a new show\nI was in the spring [noise]\n\n[noise] you're\nNot going to get on the job\nNot the\n\n\nHello this is Francesca shock an undercurrent ... ...\nMm Mm\nYeah I just signed up for nearly ...\n\n... ... ... ... ... ... energy and the the\nL mean ... yeah\nNa\n\nNa na\nNa\nNa na\nThing the other thing\n\nAround and\nThe news I mean you\nKnow they know the thing\nA\n\nI'm just walking\nIn valley but I don't mean I Know\nThere's no talking to\nTo let's say\n\n\nThough she didn't know that\nWhat to do\nAnd\nThey tell me I can choose a\nYou know the\n... he's a he\nT. V.\n\n\nWe\n", "show_name": "NEW Hearts of Space", "year": "2018", "city": "Jackson", "day": "15"}