{"month": "10", "state": "AL", "station": "WAPR", "content": "For much of the rest of the state busy new some showers later on losing the upper fifties chance of rain about forty percent and tomorrow for much of the state but he's got his big who was hides in the upper sixties chance of rain about twenty percent we are Alabama public radio\n[noise] this is Alabama public radio service of the University of Alabama W. H. P. R.\nCute the are Michael show\nW. H. I. L. Moby W A L F in Tuscaloosa\nDevil you teach history these the Tuscaloosa\nEvery ... or I may have though we are we are we are we I we are Alabama public radio [noise]\n[noise]\nBoy and morality sparkling syncopation Beethoven second symphonies that can easily reveal that comes to mind\nThe peace debut at a time when he's definitely\nThe doctors told and it was in curable\nThis week with the Chicago Symphony orchestra eight of art conducts the second symphony when it's Beethoven's lesser known symphonic works [noise]\nWe also hear Mozart symphony number thirty eight work composed to prod pose or had become the host of a town [noise]\nPlus most are torn concerto number three between the U.S those Daniel Gingrich filled with\nAll that and more this week with the Chicago Symphony orchestra and the ... [noise]\nWelcome to the Chicago Symphony orchestra broadcast on the radio and don't mind you'll find more music interviews program notes online at ... dot org slash radio\nMozart was Austrian to the core but when his opera the marriage of Figaro to\nPrague by storm Seventeen eighty six he became a favorite son of the Kenyan capital critics gosh the tickets were scarce and its tunes were played it balls and wit sold on the street I think of it as the Hamilton of its day\nDuring this Figueroa madness Mozart was mobbed by admirers in Prague and there he conducted is news symphony number thirty eight cats in three movements the symphony incorporates his team from the marriage of Figaro in it's like [noise]\nTo do at my design and can be you know the fear of seen sets the stage for a dramatic last movement that's at times playful\nAnd muscular other parts of the symphony seem to foreshadowed demonic power of Mozart's next opera Don Giovanni [noise] you know a little while conductor eight of art will share his rules of thumb for performing\nMozart but first here he is leading the Chicago Symphony orchestra in June and Mozart symphony number thirty eight nicknamed frog [noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\nA\n\n\n\n\n\n\n\n\n\n\nThen when the\nNo\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\nI don't know\nWhat\nThey look\nFor work longer\nNa na\n\n\n\n[noise]\n\n\n\nWhen when\n\n[noise]\n\n\n\n\nMother\n\nRight now I'm\n...\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise] [noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise] [noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\nAuthor who you're\nOver to your\n", "year": "2018", "show_name": "Chicago Symphony", "city": "Selma", "day": "17"}