{"month": "10", "state": "GA", "station": "WNGH", "content": "Just as members supported TPP we're in Eighteen station radio network you can listen online\nThanks for joining me\nThis is member supported TPP where an Eighteen station radio network you can listen online at ... dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening [noise]\nYou know selling your car can be a hassle but ... is a whole different story but I was taking off your hands for off your driveway and turn it into the public radio and maybe even a tax deductions ... all the host of marketplace in here is how to do [noise]\nEight seven seven GP be one car or donate securely on line a G. P. B. dot org slash cars and thanks [noise]\n[noise]\nNinety seven point seven FM double your gp be and WG Bebe H. D. room portable Georgia Public broadcasting radio network [noise]\n\nGood morning more gruesome details are emerging about the apparent dad live journal and the mob and showed me his editors from Washington Post\nIn his piece show gee argues that when the Arab nations attacking depressed there are no longer consequences instead their silence I Know well\nKing and I'm Rachel Martin is our house Saudi Arabia maybe trying to protect their crown prince from fallout afternoon\nThe on again off again wrecked it negotiations they have stalled again over the border in Ireland\nAnd after nearly ... years the man who gave flights to big bird on Sesame Street hangs up feathered Thursday October Eighteenth actor singer ...\nThe newscast is next\nLive from NPR News in Washington I'm Dave mattingley Turkish and Saudi investigators say they've ramped up their search for evidence that Saudi diplomatic properties and is temple in connection with the disappearance of Saudi journalist ... as NPR's Peter Kenyon reports he's been missing for more than two weeks\nExperts in crime scene investigators have finished their search of both the Saudi conflict in the ... and the residents of the Saudi consul general officials said the searches\nForensic experts in crime scene investigators have finished their search of both the Saudi conflict and assemble and the residents of the Saudi consul general officials said the searches were carried out using looming all which highlights blood stains and the teams were looking for traces of toxic material according to president Richard ... fair to one\nSaudi journalist ... he has not been seen since he entered the Saturday constantly on the afternoon of October second Turkish investigators have said they have audio and video evidence to show he was tortured and killed inside the consulate an allegation the Saudis strongly deny\nPresident Trump Wednesday said he expects the investigations to be finished by the end of the week\nPeter Kenyon NPR News Istanbul\nUtilities in the Florida Panhandle say power is slowly being restored to more homes and businesses and the aftermath of hurricane Michael NPR's Hansi Lo long and Panama City says some school systems expect to resume classes next week\nSchool districts are preparing for students to return early next weekend Holmes county and Franklin County which sits along Florida's northern coast the classes are still cancelled in most parts of Florida's panhandle ravaged by hurricane Michael\nIt's not clear windows schools will reopen for students some school buildings are sheltering hundreds of families across the region as the cleanup continues after the storm\nState officials are now sending up at Base Camp in Tallahassee to provide long term housing for the utility workers and first responders working around the panhandle where more than a week after the hurricane many do not have electricity or cell phone service as you along NPR News Panama City Florida\nThe death toll from hurricane Michael is now up to twenty nine many people in the Florida Panhandle are still unaccounted for especially in hard hit Mexico beach North Dakota senator Heidi Heitkamp was apologizing for one of her campaign ads it identifies some survivors of domestic violence and sexual assault without their consent\nIt is on excusable and it's a horrible horrible mistake doing everything that we can to make sure that um we're reaching out um I've spoken to at least three four of the women who were on named who did not give permission to be named\nThe high camp reelection ad appeared in newspapers the Democratic incumbents is being challenged in November by Republican Kevin Cramer the two were scheduled to debate tonight at Bismarck state college\nOf former FBI agent in Minnesota is being sentenced today for admitting he leaked documents to a reporter prosecutor said Terry James ... stole more than Seventy documents and most of them were classified\nThe sentence today for admitting he leaked documents to a reporter prosecutors said carry James all very stole more than Seventy documents and most of them were classified as low as lawyers are seeking probation this is NPR News\nIn major league baseball the Boston Red Sox and the Los Angeles Dodgers are each uh went away from the world series last night Boston rally to beat the Houston Astros eight to six to take it three games to one lead and the American league championship series\nThe Dodgers now lead the Milwaukee Brewers three games to to win the national league championship series last night LA beat the brewers five to two behind pitcher claiming ... Shaw who retired his final Thirteen batters\nThe agriculture department is giving its approval to a new type of cop and to be grown in the U.S it has edible seeds for people and animals NPR's Dan Charles says it'll take some time before that cotton is widely available\nCotton plants produce a lot of seeds globally forty million tons of them each year they're rich in oil and protein but people and most animals can't eat them because they contain a toxin called gossip all\nScientists at Texas a and M. university have created a genetically modified cotton plant that doesn't make gossip all and it feeds people can eat this cotton seed meal so can chicken and fish the inventor say the seeds taste like chicken ... [laughter]\nThe USDA now says farmers are free to grow the new cotton class but it will be years before they're widely available and the FDA still has to give its approval before the seeds can be sold for use in food Dan Charles NPR News\nIt's been a down day for stocks in Asia following yesterday's losses on Wall street analysts say investors were disappointed in the latest trade numbers from Tokyo showing a drop in Japanese exports during the month of September [noise] I'm Dave ... NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include that John D and Catherine the MacArthur Foundation recognizing exceptionally creative individuals and this year's MacArthur fellows and more information alright max found dot org and the listeners who support this NPR station\nIf you or your loved ones were affected by hurricane Michael food and water are available at multiple distribution points across southwest Georgia a full list is available at the gym a website G. E. M. A. dot G. A. dot Gov survivors in Baker Decatur\nA full list is available at the gym a website\nG. E. M. A. dot G. A. dot Gov\nSurvivors in Baker Decatur Doherty early Miller seminal Chris Grady Lee Mitchell Terrell Thomas in worth counties are eligible for federal disaster assistance through FEMA\nThose survivors should claims with their insurance companies first then visit disaster assistance dot Gov or call eight hundred six to one three three six to if you need help with debris cleanup contact crisis clean up at eight hundred\nFour or five one Nineteen fifty for\nA full list of all survivor resources is available on line\nAt G. E. M. A. dot G. A. dot Gov\n\nRick ... Iran can really make is that\nThe concert master of the Atlanta in the\nTown in this concerto by Camille\nI'm Sarah that's killing me the S. L. I. N. G. P. B. tonight it [noise] [noise]\nThis is MORNING EDITION from NPR News I'm Rachel Martin and I'm Noel King details keep emerging about what is on those alleged recordings of Jim all cause showed jeeze torture and murder by Saudi agents\nRemember ... is the dissent Saudi journalist who was last seen October second when he went into the Saudi consulate in Istanbul, Turkey Turkey's of turkey Turkish officials say the tapes are indeed real President Trump seems to have this doubt so\nOr doesn't exist where to go for it if it exists\nNo I'm not sure yet that exist probably does possibly the full report on that for months when it comes to\nThe Mike he's referring to as secretary of state Mike Pompeo who is now back in Washington After ... meetings with leaders in Turkey and Saudi Arabia on the way home from that trip ... kept reminding reporters that Saudi Arabia is a strong give us ally\nKeeping their mind we have walks with important\nRelationships relationships between us Saudi company governmental relationships things we walk 'em together all across the world\nRelationships relationships between us Saudi companies governmental relationships brings we walk 'em together all across the world\nReduce the risk to the United states of America as a new worlds largest state sponsor terror wrong Saudis have been great partners are starting to\nThis is NPR News\n\nThe Georgia coast has long been known for shipping and fishing ... testing ground for farming\nOyster farm in the industry itself is quite small and it's why folks are so excited about what was your farming agriculture coming because it will effectively double the amount of money they can make per\nOyster reviving Georgia's oyster industry and artist Richard ... it's on second thought this morning at nine from gp being in\nThis is David Greene hosting MORNING EDITION I'm here to talk with you about the ... the one that keeps reminding you support public review you can support the programs you love by donating your used vehicle that old car truck could be worth hundreds of dollars to the station or you have to do is call and you might even receive protested up\nTo ... dot org slash cars or call each seven seven GP be one car back [noise]\nSupport for TB comes from you our listeners\nIn this fast paced world you want to have access to news when you need it check out our Web site at gp news dot org we've got the latest state national and international news available twenty four seven\nBut they're also in depth feature stories from across the state of Georgia you can also view video performances from great musicians in our gp the music present series\nFor information and entertainment you can count on gp the news ... news dot org\nMidterms are about a lot of things but mostly there were about the president's own horn Marcia is really a vote for me and this year President Trump's that's okay\n\nThat is really a vote for me and this year President Trump thinks that's okay\nI have\nAnd see what does the mouth looked like a head of an election that would change everything mixed on one one\nOne age this morning at ten on TV and the TV news dot org [noise]\n\nSupport for NPR comes from this station and from the candy to fund supporting individual dignity and sustainable communities through investments and transformative leaders and ideas learn more at\nK. E. N. D. E. D. A.\nFund dot org [noise] from the Walton family foundation where opportunity takes root more information is available at Walton family foundation dot org\n[noise] from the state of Joan be crock who's ... serves as an enduring investments in the future of public radio and seeks to help NPR producer programming that meets the highest standards of public service in journalism and cultural expression\nAnd from the William T grant foundation at WTC grand foundation dot org\nThis is MORNING EDITION from NPR News I'm Rachel Martin and I'm Noel King good morning front man worked for the federal government as a student loan watchdog until he quit in August in his resignation letter he accused the Trump Administration of abandoning student borrowers\n... saw lots of things going wrong and the student loan industry but there was one big one Cory Turner first reported this story for NPR's Planet money podcast\nA big part of ... job at the consumer financial Protection Bureau was looking in to borrow were complaints and in the spring of twenty Seventeen he and his team noticed this weird\nPattern we see cops firefighters teachers nurses who are entitled to public service loan forgiveness and they are repeatedly denied\nThe public service loan forgiveness program began in two thousand seven with a pretty simple pitch\nSpend ten years and one of those public service jobs paying down your student loans and the government would forgive whatever's left as a thank you but last year from an was hearing from lots of public servants who said they made it years into the program\nFound out their plan for financial freedom essentially just wiped out in the blink of an eye because of the mistakes of their student loan company here's what was happening\nAnd that their plan for financial freedom essentially just wiped out in the blink of an eye because of the mistakes of their student loan company here's what was happening from and says the federal government pays a bunch of companies to manage more than forty million student borrowers\nThese companies are called servicers and they handled the paperwork and answer the phones when borrowers call and ask for help and they're doing a terrible job Massachusetts attorney general more hughley is actually suing one of these servicers fed loan I spoke with her earlier this year\nTheir failure to do their job has resulted in hundreds of thousands of students having their financial future sabotage\nAnd several other states are suing the different service or ... claiming it's made mistakes too and broken the law\nIn the past both companies have denied these allegations saying it isn't their fault they're just following the rules set out for them by Congress and the education department and that they're doing their best they say to resolve bar were complaints [noise]\nNeither company wanted to talk for this story you know who did the students who thought they were going to get their loans forgiven but aren't\nI made life decisions based on wrong information\nSarah ... says her service or told her she qualified for loan forgiveness\nShe's teaching now has been in public service for six years and thought she had just four to go but recently she called the ed department and someone told her oh I'm Sorry but you don't qualify not until you consolidate your loans\nBut she was told if she does that count down to forgiveness would reset back to ten years\nI can kind of let my guard down and said this kind of sucks and she said yeah it really facts [laughter]\nTwenty nine thousand applications for public service loan forgiveness have been process so far and all of those Ninety nine percent have been denied in other words Sarah ... story he's not unusual oh well see that's actually a huge relief\nBecause I Walk around with an enormous\nAmount of healing Philly\nIts defense the education department says everybody who is eligible is being approved and they say they're working on improving the process\nBut ... a former student loan watchdog says the department under President Trump isn't only walking away from the fight to help student loan borrowers they're actually arming the other side in response to all those state law suits against it servicers the Trump Administration isn't\nTo help student loan borrowers they're actually arming the other side in response to all those state law suits against it servicers the Trump Administration is now arguing these companies they're protected from state laws because they work for the federal government\nAnd this fight is now being waged in the courts meanwhile ... men may have left governor but he continues to wage who's fight for public service loan forgiveness as a private citizen Cory Turner NPR News Washington\nFrom Planet Money comes from transfer why the service that helps people send money internationally three million people and businesses use transfer wise men receive and convert currencies and more than Seventy country\nMore at transfer wise dot com or from their app\nSome bitter sweet news this morning big bird is retiring more precisely the voice behind the man inside big bird is hanging up his bright yellow feathers after nearly fifty years on Sesame Street\nTaking a break take an RN\nIn some time to be at my dad's\nTank alone to take\nWith me here Carol\nSpinning has been on the show as big bird and other characters since the show's premier in Nineteen sixty nine and the\nBig bird character will live on but Carol spend his last walked down Sesame Street will be recorded today at a TV studio in New York he told NPR in two thousand and three that he's come a long way\nBy first TV show was in uh Nineteen fifty five in Las Vegas I was on the air force and I had a show called a rascal rabbit show maybe ten dollars a week\n... creator Jim Henson hired spending to perform big bird who towers at eight feet two inches tall spinning is five foot ten so how does that work great apparently spending stand inside the feathered suit with his right arm high above his head his right arm is big birds neck his hand is big bird's beak\nWhen he said it's hot and dark and pretty bad if you're claustrophobic\nOkay that's the out I wear a tiny little TV set the strapped to my chest and I'm watching to see if big bird is looking at whoever is talking to or looking at the children are home was removed to feathers the ruined by Velcro but we tried to do it because sometimes just his little dark spot in his chest were picking out\nThe big bird as you probably know is kind and sweet but it's been he says after performing him all day it's kind of therapeutic to switch to his other famous Sesame Street character Oscar the grouch\n\nIt's kind of therapeutic to switch to his other famous Sesame Street character Oscar the grouch\nI Love\nAnything on\nWhat Jim Harvey he didn't have a voice like that and my reputation character voices I was\nGetting desperate because it was finally down to the day before we were going to start taping and so it was I took a cab across Manhattan the taxi driver looked at me so I went to Mac as I say wow what a voice\nAnd he then\nCarol ... is one seven Emmys two Grammys and has been declared a living legend by Congress when he was featured on the cover of life magazine he was delighted\nI pointed to it I said gee I didn't ever expect to be on the cover of life magazine and the woman who sold the backseat said what do you mean I said I pointed to big British I play that\nAnd she said well I wouldn't tell people about it\n... Benny Hill retires today after nearly five decades of performing on Sesame Street as big bird and Oscar the grouch It's NPR news\nMixed in with the sand and houses that have been sort of shifted off their foundations the other side of the street than in the midst of all the rubble there are people here that are\nLooking for something that's incredibly small it is really investigative\nWork looking for clues to see where the water was how far up\nThe fires in tiny matter for the United States Geological survey they look for modern grasp it start to decide they're even inside the building signs of how hard the storm surge reached may find something they market it's our job\nIs almost looks right here [noise]\nBut [noise] there's a little something you see like pieces a grassy dirt that's accumulated on these uh these steps that are going to the wrong direction [laughter]\nFires doesn't know where the steps came from Tibet water line isn't used them time to do so she found the mark down the road someone spray painted a red line on the street like\nTwenty eight teams search on\nLittle bit scary if you look at the ocean\nIt's easy money so she found a mark down the road someone spray painted a red line on the street like\nTwenty Eighteen search line\nA little bit scary at the ocean thinking about how I came up\nThe measurements virus and addicts take could seem like a low priority if the sirens player and helicopters fly overhead but they're really important\nThe federal emergency management agency uses has stayed in part to figure out how to allocate funds and the short term was about ... minutes a former associate administrator at FEMA and now works a consulting firm I Am\nLooking at the high watermark get elected act as to what kind of damages were incurred\nSo sometimes instead of sending an inspector\n... what the damages were and then they will cut much ...\nIn the USGS data affects the long process of recovery too to Thomas is a New Orleans attorney who works as communities as they rebuild after disasters he says the USGS data helps create guidelines for these communities\nFederal government again trying to safeguard the conduct of rebuilding and try and reduce incidents occurring disaster may require certain changes in how things are built\nHouses and other structures might need to be built above a certain elevation or further from the coast\nCreate quite poignant that parallel to the degree clearing man you know the terrible search for on account of person you're taught history to find a future or is this happening you know already is that why drawing is the beginning\nThere even FEMA grants to make communities more resilient and ... says the USGS data helps communities know how to spend that money\nIf you had what in power and they didn't stand anything she probably going to go back and you might be using concrete or metal or or trying to underground utilities it that's a possibility\nDowned power lines are the kind of debris day pirates in tiny Maddox seat everywhere\nRolling into Mexico beach here specifically we're really\nTaken by surprise at the amount of damage in destruction worst I've ever seen they worked\nFast the cleanup is underway in the water marks won't be there for a long day Carper NPR News\nI'm a\n\n\n\nThis is NPR News\nI'm Robyn Young two time Oscar winning actress Kelly fields stunning new best selling memoir\nRevealed that as a child she was repeatedly sexually abused\nAs I started my early career\nNow is new until two on your TV station and gp news\nDot org support for G. P. B. programs comes from our listeners\nIf you're already a G. P. B. sustain or thank you you're reliable monthly donations provide a steady stream of support for the programs you enjoy an gp be\nNot as sustain are you at ... dot org and become one right now you're secure ongoing gift of five or ten dollars a month will feel great and it'll keep gp be strong for you and your community\nThat's G. P. B. dot org and thanks [noise]\nMaking a Chuck ... coming up with an excellent point sure we're going to get onto\nThis thing to go right\nRyan Gosling stars and first man the movie the put the Apollo eleven moon landing on the big screen but what was Neil Armstrong the man who took that try at least really like that's coming up with an excellent point from NPR\nHere on point this morning at eleven on ...\nSupport for ... comes from generous listeners like you our reporters have been honored with national awards from public radio news directors incorporated for our use of sound soft feature and our coverage of breaking news thank you for your support which allows us to keep you informed about stories that impact your life\nAnd show your parts of Georgia you don't otherwise hear about killed on us to bring you comprehensive coverage of the state check out our website a gp news dot org gp news stand with the facts\nAnd fresh air you'll hear from people who really make you think like astrophysicist Brian Greene explaining a scientific theory that our universe is just one of many and the image that I like to have in mind to imagine that our universe is like one slice of bread and a much grander Cosby look for the other slices of bread\nIt's just one of many and the image that I like to have in mind is imagine that our universe is like one slice of bread and a much grander cosmic loaf with the older slices of bread being older universes loose subject is too big for fresh air join us this afternoon at\nThree here on G. P. B. ended ... dot org\n\nSupport for NPR comes from the station and from the Kauffman Foundation working together with communities in education and entrepreneurship to create uncommon solutions and empower people to shape their lives and be more successful more online at ... dot org\n[noise] from the Pew Charitable trusts marking Seventy years of non partisan research and data learn more at Pew trusts dot org slash Seventy\n[noise] and from listeners like you who donate to this NPR station\nIt's MORNING EDITION from NPR News I'm Noel King and I'm Rachel Martin in a little over a week Brazilians will head to the polls to elect a new president it's been a hard fought campaign now an unlikely voices joined the political fray one of the founders of pink Floyd NPR's Philip Reeves has the story\nWe're up to like try to do\nIn the city of Salvador in northeast Brazil\nIs Seventy five in music mad Brazil he has many fans fractional too they\nWant to come to\nThe topic of the people I\nSit down and I don't think\nIt's a cliche she says but only like another crickets [noise]\nThis crowd has come to be into\nHis tour in Brazil\nOne of his recent shows characterized the far right candidate ... out of the neo fascist\nPeople among tonight's proud to know the ...\nCentury bc on bank clause\nVery good that already like him they got the the got about these you know\nWe are now are facing\nVery good that are already like him they got the the got about ... you know\nWe are now a paid\nAll over the world are very complicated I probably ... or you know and it's very important that pain was already like him I think in the\n... percent outside interfering in\nFocus is a political activists to campaigns are many from everything that we were the other ... in Brazil where your emotions are running\nTo the election relate to the attacks on ... an investigative journalism group that tracks the identified more than Seventy in the first ten days at the smart\nIn this city Salvador celebrated actual proceedings musician or older going wild ... with the cost was stabbed to death ten days ago after an argument about politics are\nSupposed to bolster not as rival\n... himself the stats and severely injured at a rally\nNot always said he doesn't want to vote for anyone and go to Bob in his opponents blame him to find the flames and so I think he's right or sexist or racist\nNPR search areas so in other ... begins\nAll types of groups of kids stumps they're going to\nMany crowded shopping at a you know him the slogan unites post now there was a\nBit others are booming yelling disapproval click to a picture appears on the big screen of Roma while the ... the stabbed musician from South Georgia just pay a tiff tributes [noise]\nIt's MORNING EDITION from NPR News I'm Noel King and I'm Rachel Martin\n\nForever reports from W W GBH three room portable Georgia Public broadcasting radio\nBe seven forty seven FM WG BP and W. GBH leave room for the Georgia Public broadcasting radio network [noise]\n\nLive from the G ... Jones good morning ahead we'll discuss the future of Brexit where the man who's in the running to be the next president of the European Commission that didn't just under ten minutes first in Georgia headlines\nIn person early voting for the November ... election is underway but many more Georgians are also choosing to vote via absentee ballot GB Steven Tyler reports\nIn Georgia you don't need a reason to request an absentee ballot you just have to apply with your county by November second that's what nearly three hundred and fifty thousand Georgians have done so far for this election once you make your selections you have to follow instructions on a return envelope and sign an oath\nWith things like your name address in the year you were born otherwise your ballot could be rejected\nElection day is November six\nFor G. P. B. News I'm Stephen Fowler in Atlanta\nHundreds of Georgians who cast their absentee ballots have had them rejected because of problems with signatures an issue that will be challenged in federal court next week a hearing has been scheduled to address a lawsuit the challenges George's absentee ballot signature matching law\nThe ACLU of Georgia is behind the sued they claim that ballots have been unfairly rejected\nBecause of alleged signature mismatch is within the paperwork the group on election officials to give voters the chance to confirm their identities and resolve the issue head of November's election the federal hearing\nIs scheduled to take place Tuesday Afternoon in Atlanta for more Georgia News Go to G. P. B. news dot org and shorter follow us on Facebook and Twitter at ... cents it's six oh one\nLine from NPR News in Washington encore of a Coleman the death toll from last week's hurricane Michael he's now twenty nine people with Nineteen Faye talent he's reported in Florida\nDamage remains catastrophic in some parts of the state of course the male lives near Panama City close to where the hurricane made landfall she lost her home Mayo says parts of her community are starting to rebuild but more rural parts of Florida remain in need\nLot of the smaller communities up that way or not getting a lot of attention by George Youngstown fountains [noise] um\nThey're needing help they're needing\nFlorida remain in need a lot of the smaller communities up that way or not getting a lot of attention by George Youngstown fountain [noise] um\nThey're needing help they're needing ... water ice as a commodity that is greatly needed here [noise] um\nBut I Know that people are coming I Know I've seen power trucks from\nIndiana and Michigan the Associated Press says Florida authorities are working to stop looters from taking items from damaged homes\nThe Washington Post has published a final column by missing Saudi Arabian journalist ... ... entering a Saturday consulate in Istanbul, Turkey NPR's Emily Sullivan has more 'cause she'll get she had been writing opinion columns critical of Saudi policies for the post for just over a year and\nThe post received is calling from ... assistant the day after he was reported missing\nHis editor carrying a tire wrote the post held off on publishing it hoping he would return so they can edit together now she writes that's not going to happen on Tuesday evening the New York times reported ... headed and dismembered at the embassy according to audio recordings described by a senior official\nHis column expressed the need for journalistic freedom in the Arab world\nAnd promoted the open exchange of ideas and information Emily Sullivan NPR News the White House counsel Don McGahn has left his post NPR's Scott Horsley reports McGahn was the architect of President Trump's push to shift to the federal courts in a more conservative direction\nDon McGahn oversaw the president's judicial screening process helping to install dozens of conservative judges on the federal bench culminating with the bruising confirmation of Supreme Court justice Brett Kavanaugh earlier this month\nBefore coming to the White House began served as Donald Trump's campaign lawyer it was in that role he suggested that Trump publish a list of potential high court nominees to replace the late Justice Antonin Scalia\nAn unusual political move that helped candidate Trump when the unlikely backing the social conservatives Trump tweeted about begins impending departure in late August after New York times reported on the attorneys extensive cooperation with special counsel Robert Mueller Scott Horsley NPR News Washington\nNational Weather service warns storms will persist in central Texas for the next few days rain is falling on heavily saturated ground in the area around Leno about a hundred miles north of San Antonio officials there have found the bodies of two people several surrounding counties are under flash flood watch\nAround Leno about a hundred miles north of San Antonio officials there had found the bodies of two people several surrounding counties are under flash flood watch this is NPR\nThe United nations special envoy for Syria says he is stepping down at the end of November for personal reasons Stefan de Mistura made his announcement Wednesday at the end of the U.N Security council meeting he says he'll make a final effort to bring the warring Syrian parties to agreement on a new constitution before he departs\nThe first of some three thousand Honduran migrants traveling north has passed through Guatemala and reached the Mexican border Maria Martin reports Guatemalan and U.S authorities are trying to discourage them from traveling farther\nThe leader of the migrants march former Honduran lawmaker ... this was arrested in what the ... as President Trump threatened to cut off us aid to any Central American country that didn't stop the march\nStill hundreds of migrants have made their way to the Mexican border the U.S ambassador to what the other side of yoga issued a statement in Spanish urging the migrants to return\n... it'll ...\nIdea that says a U.S border has never been so protect those who tried to enter legally will be arrested and deported he added he understood people sleep due to lack of opportunities and that the U.S is investing millions of dollars to change that for NPR News I'm ... and\nPresident Trump has presented the medal of honor to retired Marine sergeant major John Candy he cited for bravery for heroism and Vietnam he twice climbed the hospital wall in view of the enemy to reach other wounded Marines and carry them to safety Kelly is now eighty years old\nI'm core of a ... NPR News in Washington\nSupport for NPR comes from the financial services firm of Raymond James offering personal lives wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial well being first learned more ed Raymond James\nDot com good morning thanks so much for starting Thursday with MORNING EDITION on TPP and Emily Jones Republicans say that Brett Kavanaugh hearings were a wakeup call for the G O P\nWhat I think it did do is galvanize Republican voters to make sure that they both for the Republican ticket\nSay the controversy\nWhat I think it did do is galvanized Republican voters to make sure that they vote for the Republican ticket\nDemocrats say the controversy also gave them at new energy in how that says you might affect one Arizona's Senate race in Fifteen minutes\nIf you or your loved ones were affected by hurricane Michael food and water are available at multiple distribution points across southwest Georgia a full list is available at the gym a website\nG. E. M. A. dot G. A. dot Gov\nSurvivors in Baker Decatur Doherty early Miller seminal Chris Grady Lee Michel ... Thomas in worth counties are eligible for federal disaster assistance through FEMA\nThose survivors who filed claims with their insurance companies first then visit disaster assistance dot Gov or call eight hundred six to one three three six to if you need help with debris cleanup\nContact crisis clean up at eight hundred four or five one Nineteen fifty for\nA full list of all survivor resources is available on line\nAt G. E. M. A. dot G. A. dot Gov\nIt's MORNING EDITION from NPR News I'm Noel King and I'm Rachel Martin breaks it negotiations are at a standstill these are words we have said before leaders from the United kingdom and the European Union are meeting in Brussels\nAnd while they're trying to put an optimistic spin on the negotiations the interview and UK are at a stalemate over one crucial issue the Irish border\nIf they can't reach an agreement a so called hard Brexit what happened with no deal\nWhich would be a blow to the British economy among those trying to hash out a way forward in Brussels is Alexander stew he's the former prime minister of Finland he's also in the running to become the next president of the European Commission which would put him right at the center of the Brexit negotiations\nMr ... thank you so much for being with us this morning\nThanks ... what is the state of play right now do you see any progress\nWas instead of by typically a negotiation or you know sometimes to make advances and the other stuff so let me just up the book and then you move on\nUh right now the key issue is you mentioned this is the so called ... the border issue between either are Linda Northern Ireland or Northern Ireland and the United kingdom and uh usually what happens ... says uh\nBorder issue between either are Linda Northern Ireland or Northern Ireland and the United kingdom on a usually what happens needs to go ... or you're going to have to have a little bit of drama a little bit of theater and that's what we're going to see in the next few weeks\nThis is NPR News and this is ...\nGood morning I'm mentally Jones mid term elections are often seen as a referendum on the president\nAnd not only is it all about the president to some degree but there's a lot of reasons to believe that this year it'll be even more about the president\nOne big reason for that President Trump is trying to make them in terms about him will have that story in twenty minutes right here on gp being an Eighteen station radio network of Georgia Public broadcasting surfing Leesburg and beyond\nThe midterms are about a lot of things but mostly there were about the president or Marcia is really a vote for me and this year President Trump thinks that's okay\nI\nSee what is the map look like head of an election that changed everything next time on one\nGet one a this morning at ten on ... on the TV news dot org [noise]\nSupport for ... comes from generous listeners like you\nAnd University of Georgia extension offering information and publications on healthy sustainable food from going to harvesting to cooking learn more by calling one eight hundred ask UGA one or online that extension thought UGA dot edu\nAnd Miller theater and national shows to presenting country folk pioneer Mary cheapen carpenter October twenty six that Augusta's Miller theater\nTickets remarry chip and carpenter available at the Miller box office and Miller theater Augusta dot com\nFew years ago ... off was in Israel and saw\nOf a wave of violence shortly after that he was really observing our entire planet in a planetarium show music inspired by contrast\nSteve of violent shortly after that he was really observing our entire planet in a planetarium show music inspired by contrasting perspective on the next performance today from eight PM\nForm in today's tonight from eight to ten right here on gp\n\nSupport for NPR comes from this station and from farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs coverage options and more information can be found at farmers dot com [noise]\nFrom it lost seeing a collaboration software company powering teams around the world committed to providing the tools and practices to help teams plan track build and work better together [noise]\nMore at a loss in dot com and from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring John flattery Amanda peach poll riser and Kathryn ... on a new episode every Friday on prime video\nIt's MORNING EDITION from NPR News I'm Noel King and I'm Rachel Martin it was impossible to ignore the ticking clock underneath the confirmation hearings for Supreme Court justice Brett Kavanaugh\nEveryday that went by was the day closer to the mid term elections a reality Democrats and Republicans on the Senate Judiciary committee or very aware of and both sides tried to leverage the hearings to their political advantage\nSo how are those hearings playing out among voters NPR's Danielle Kurtzleben went to find out in Arizona where there's a tight Senate race between two women Republican Martha McSally and Democrat ... cinema\nTravel is super politically active\nThe regional director for the Arizona federation of Republican women and a member of the Pima County Republican win but today she's at a pizza restaurant in ... Arizona\nLunch with another Republican when Andrew\nDone I cared child if they did their\nHand like a lot of Republican when she had a strong feelings on Christmas Eve lousy for decades they\nI don't know I feel that should that should put up to that\nWith her at odds with leaks out who has said she believes Ford is an assault victims\nTravel is firmly on the mic Sally [noise] and she thinks the Ford Kavanaugh hearings have amped up enthusiasm in her\nShe believes Ford is an assault victims\nCredible is firmly on the mic Sally and she thinks the Ford Kavanaugh hearings have amped up enthusiasm in her party\nI think it helps to sleep but I think it is it on both sides on not saying one side more than the other because I'm hearing from our side\nOf the Republican protests we go to the vote we put money down\nAll of that is one reason why Jim vote was phone banking for Democrats here and send them out one night last week to stave off any Republican\nSearch is a lot of my friends that are more progressive are going to do everything they can die or\nAnd well he hasn't seen evidence of the cabinet controversy boosting turnout he has seen it inching Democrats into becoming even more engaged\nThat just made it even more [noise]\nI'm not sure if it's said okay we're going to open our hum\nBut it was definitely about what else do I do\nRepublicans may be getting more fired up now but there was already plenty of democratic fury almost two years worth of it and democratic strategist Andy Barr things his party's anger has much more staying power\nPeople tend to do stuff out of anger and look at the core sort of more than enough of that and the ...\nFor whatever anger the Democrats in Arizona might be feeling over the cabinet controversy send them on the Democratic candidate doesn't sound outraged cinema has focused a lot of her rhetoric around process like the FBI investigation affords claims\nWhen I learned that we were not going to get access to the report I was very disappointed as I think many Americans were so I was forced to make a decision without being able to see that report\nForced to make a decision that's a far cry from other Democrats who have emphasized that they believe Kavanaugh had assaulted forward right now the races in a dead heat polling shows that send him a slight lead on mic Sally has narrowed in the last couple of weeks Republican strategist John ... cabin all played a part in that trend\nReally what I think it did do is somewhat anyway galvanize go center right and Republican voters to come home if you will and make sure that they mail their ballots for the Republican ticket\nBut especially with the candidates and their allies sticking to other areas like immigration and health care as well as personal attacks democratic strategist bars says it's hard to say that the confirmation hearings are what narrow that gap\nThe undecided grew more looking and they always start to come home or at around you know\nTo balance in a debate this week\nWhen they start to come home aren't around you know ... to ...\nIn a debate this week both candidates chose not to weaponize the Kavanaugh fight too much while the president has gone so far as to call Ford's accusations a hoax mix Sally focused her criticism on Democrats and activists not Ford herself\nWay of seeing the mob rule in Washington DC and in the end Arizona's wanted a yes vote on justice Cavanaugh I can be for survivors is one myself and for justice Kavanaugh\nMeanwhile moderators had to ask cinema multiple times before she'd say how she'd have voted\nWe still haven't got enough where you know as far from you out here and that way I Would have voted no and I and I did put out a statement saying such\nWhether the cabin all confirmation gave either campaign a lasting boost the candidates are much happier talking about health care immigration and the economy Danielle Kurtzleben NPR News\nA federal regulator has publicly criticized large cell phone carriers for being slow to restore service in the areas most devastated by hurricane Michael NPR's Camila Domonoske has the story\nEver since hurricane Michael hit the Florida Panhandle survivors have been trying to get in touch with their families for some it's been a real struggle cell phone signals went down after the storm hit last Wednesday and stayed down for many customers\nWere rising in particular has lingering outages Florida State officials called the company out for lagging behind competitors after days of complaints new numbers on Wednesday\nShowed just over half the cell towers near Panama City Florida we're functioning there is no doubt run a more positive track\nMatthew Berry is chief of staff at the Federal Communications commission the agency criticized the slow pace of progress earlier this week\nWe need to keep the attention on this problem and keep the pressure on because they're still a ways to go when we can't have any ... in the next few days\nRestoring cell service is always a problem after a big storm the absence of a signal means people outside the storm's path or left worrying about loved ones they can't reach while residents have trouble contacting local authorities and their insurance companies the FCC says it usually takes a few days to approach full coverage\nAfter Hurricane Sandy it took about a week after Hurricane Maria in Puerto Rico it took six months an extreme situation\nThe problem with hurricane Michael is that several days after the storm the FCC was noticing only marginal progress and the most devastated areas\nAnd the problem with hurricane Michael is that several days after the storm the FCC was noticing only marginal progress and the most devastated areas\nWe don't agree that this is an unacceptable situation\nKrista born is rising market president for wireless in the south she says varieties and slow recovery from this storm was uncharacteristic and unprecedented for the biggest problem is not cell towers but the fiber optic cables that run to those towers\nThe storm passed just happened to go right in\nCritical area where the fiber like late and it's just an incredible amount of ...\nAnd it's not just damage from the initial storm as clean up is under wave arising as having to fix new damage to those fiber optic cables\nThousands of recovery workers you have to remove all happening you have a lot or store work that I could just have an accidental cut in an area that we've already repaired and then we have to circle back to make that that can repair\nMany people around Panama City still don't have service ... NPR News\nWhat will you remember about your friendship with democracy hoped\nThat um [noise]\nHe was just a very very kind very humble and very generous person\nI I'll Remember I'm just being so energized about being able to write freely I think it's just something in this country in America that we take for granted I'm so much\nUm but obviously looking back on it now realizing that he gave up so much everything his his family his his um being kicked out of jobs\nI I just I'm inspired by his his unwavering commitment to I'm not only you know having freedom for himself but trying to extend that to his fellow um Arabs are writers and voices and to ... he just wanted\nThe world the Arab world to be a better place and oh I'll never forget that\n... is the Washington Post global opinions editor Karen thank you so much\nThank you so much now Mm\nOh I'll never forget that\n... is the Washington Post global opinions editor Karen thank you so much thank you so much snow Mm\nThe Associated Press asked President Trump this week if she would bear some responsibility if Republicans lose the house in November the president replied no but as NPR White House correspondent Tamara Keith reports Trump may not want the blame if the GOP takes a hit but he still thinks the election is about him\nPresident Trump isn't on the ballot in November but that doesn't mean he isn't on voters' minds Alan Abramowitz is a professor of political science at Emory University he studied mid term elections and says there is a very strong correlation between presidential approval and the results for his party\nNot only is it always about the president to some degree but there's a lot of reasons to believe that now this year it'll be even more about the\nPresident and why is that well first of all because Trump has\nHas tried to make it about him whore Marcia is really a vote for me and everything we stand for\nMe to vote for him to use your vote for me I don't vote for the visit vote for me\nRemember this is a vote for me and our agenda to make America great again\nIn the a P interview Trump explained that he was making this explicit appeal because the people at his rallies are there for him and some have even told him they don't plan to vote in the midterms in twenty fourteen President Obama made a similar appeal on on on the ballot this fall [noise]\n... [noise]\nBut make no mistake these policies are on the ballot every single one\nAt the time it was seen as a gaffe many Democrats were trying to distance themselves from Obama whose approval rating at the time was in the low forties Trump's approval is in a similar spot now again Abramowitz\nMost probably going to come through at risk of losing their seats for broad rather localized election Trump but more of a local issues about things they've done for their state or district and not about the president\nBut regardless of what candidates want this is a nationalized election sixty percent of voters according to a recent Pew Research center poll said Trump will be a factor in their congressional vote with a greater share saying they will be voting against the president then for him camera Keith NPR News\nNational vote with a greater share saying they will be voting against the president then for him camera Keith NPR News [noise]\nYou're listening to NPR News\n\nServing Jessup and beyond this is ... an Eighteen station radio network of Georgia Public broadcasting good morning I'm Emily Jones the Treasury Department has decided not to label China a currency manipulator despite President Trump's complaints about the country's financial behavior\nDetails on that plus all the morning's business news in eight minutes on the marketplace morning report here on gp being in Georgia business news Kmart is closing its last two stores in Georgia\nThe company it's owned by Sears Holdings which filed for bankruptcy this week locations and Peachtree city and ... are among one hundred forty to Kmart and Sears stores that will be shut down by the end of the year liquidation sales at both stores are expected to begin soon\nGeorge's ports saw double digit growth in September ... port handled twelve percent more container units than it did in August\nIn Brunswick deport handled more than thirty seven percent more cars trucks and heavy equipment the amount of cargo moved by rail line was also up last month by thirty five percent [laughter]\nYou can always find more G. P. B. news at gp being news dot work and be sure to follow us on Facebook and Twitter as well where we're at gp news and you can have ... on your smartphone using the GB smartphone apps\nIt's six forty four\nTerms or about a lot of things would mostly there were about the president or your phone whore Marcia is really a vote for me this year President Trump's\n\nMouth look what kind of an election but it would change every one [noise]\nIt's MORNING at ten here on ... [noise]\n\n\nBecause you're on can really make is that\nThe concert master of the Atlanta in the\nWeeks but he still knows in concerto by Camille\nThe concert master of the Atlanta in the\nWeeks but he still knows concerto by Camille [noise]\nI'm Sarah that's killing me the S. L. I. N. G. P. B. tonight it [noise]\nFor NPR comes from the station and from Tara data working to transform how businesses work through the power of data using pervasive data intelligence Tara data leverage is all relevant data to deliver answers to complex business issues Tara data dot com\nAnd from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring John Slattery Amanda Pete Paul Riser and Kathryn ... on a new episode every Friday on prime video\n\nIt's MORNING EDITION from NPR News I'm Noel King and I'm Rachel Martin the midterm elections are less than a month away and Facebook is ramping up its fight against this information in twenty sixteen the social media network was caught pretty much flat footed has for an actor spread false narratives by masquerading as Americans\nFacebook has now set up a system to try to detect and disrupt bad actors on their network who are trying to de legitimize elections spreads fake information and suppress the vote NPR's Tim Mak as a look inside\nWe all live in an increasingly digital world but even within a large tech from like Facebook there is no substitute for face to face communication [noise] the last month Facebook set up an elections war room on their Menlo Park California cares about where\nIn the room that large American flag hangs above custom built that that monitor viral news spam and voter suppression effort\nFox News CNN and I'm rolling Twitter feed play on large screens along the wall and a rotating group of data scientists engineers and operation specialists occupy approximately twenty posts in the room\nHere ... check her party the head of the civic engagement team at Facebook\nLouisville's dashboard and these ... words actually have alarms on them so that if there's any spike and unusual activity the war room is alerted to them and then our data scientist will be able to look at any sort of anomalies that are detected figure out if there are actually problems the uh underneath those anomalies that we see and if there are passing along to our operations team\nWe just want to know that ... is the brother of ...\nThe problems the underneath those anomalies that we see and if there are pass them along to our operations team\nWe just want to note that ... is the brother of men in the ... party host of WVU ours on point Facebook offered him as a source for the story public officials are watching closely to see if Facebook will be able to prevent this information like that scene during the twenty sixteen campaign\nHere's what Senator Mark Warner the top Democrat on the Senate intelligence committee told NPR\nFacebook was asleep at the switch and even in the immediate aftermath of the elections they denied that there were any foreign\nInfluence there's on their platform they were dead wrong\nThese concerns reflect this in ... Facebook in American civic life\nForty three percent of Americans get news on Facebook by far the website Americans most commonly used for news according to a recent survey by Pew Research\nThe social media network doesn't want to police content generally speaking but Facebook officials think they're cracking down on ... behavior such as fake accounts and ... will help curb foreign influence operations [noise] here's ... again\nWe have actually made a huge advances in artificial intelligence and machine learning and we've been able to block in a recent six month period one plane three billion fake accounts from forming\nBut Facebook faces a formidable challenge Kevin Mandy or the sea of fire I a cyber security firm which accounts Facebook as a client recently told NPR that there are many foreign operations the analysts have yet to discover\nI strongly doubt that we've caught a hundred percent of the ones Iran's doing or Russia's doing and I would say we're more on the three to five percent on what we found meaning there's a ton of going on right now that were wholly on aware of\nFacebook told NPR that it does seem foreign information operations increasing estimate terms near which is what they expected ears Nathaniel glacier their head of cyber security policy\nOr maybe M American public media\nI'd be seven forty seven FM double your gp and ... GBH leave room for the Georgia Public broadcasting radio network [noise]\nSeven point some of them WG and believes you BPH leave room for to Georgia Public broadcasting radio network [noise]\n\nLive from the G. P. B. newsroom I'm Emily Jones good morning\nSaudi Arabia's crown prince is coming under increased scrutiny following the disappearance of journalist ... ... what is the world really know about crown prince Mohammed bin some on Saudi Arabia's to factor ruler that story and about Fifteen minutes first today's Georgia headlines\nThe southern environmental law center is suing the federal Federal Aviation administration for documents related to the proposed Camden county space port\nCenter submitted to freedom of Information Act request in March asking the FAA to publicly released documents about environmental impact impossible hazards of a space port on Georgia's coast\nAttorney Brian guest says the documents describe what would happen if a rocket fails\n[noise] [noise]\nSo far the FAA has not responded in a written statement Camden commission chair and space proponent Jimmy star line says it takes time to process quote complicated and voluminous request but he believes the FAA will comply the southern environmental law center is an underwriter of GDP\nAnd basketball the Atlanta Hawks lost their season opener to the New York Knicks one twenty six to one of seven Korean prince lead the way for the hawks with Twenty one points and six rebounds Atlanta travels to Memphis for friday night game against the grill grizzlies next\nTeam will make its home debut at the newly renovated State Farm arena next Wednesday it's\nSeven oh one\nLine from NPR News in Washington I'm core of a Coleman Turkish and Saudi investigators say they've concluded their search for evidence at Saudi diplomatic properties in Istanbul this was in connection with the disappearance of Saudi journalist ... as NPR's Peter Kenyon reports ... has been missing for more than two weeks\nExperts in crime scene investigators have finished their surge of both to show the consulate in Istanbul and the residents of the Saudi consul general officials said the searches were carried out using luminal which highlights blood stains and the teams were looking for traces of talks\nAnd the residents of the Saudi consul general officials said the searches were carried out using luminal which highlights blood stains and the teams were looking for traces of toxic material according to president Richard ... to one\nSaudi journalist ... he has not been seen since he entered the Saturday consulate on the afternoon of October second Turkish investigators have said they have audio and video evidence to show he was tortured and killed inside the consulate in allegations of Saudi strongly tonight\nPresident Trump Wednesday said he expects the investigations to be finished by the end of the week\nPeter Kenyon NPR News Istanbul\nThe former president of USA Gymnastics has been arrested on allegations of evidence tampering NPR's Emily Sullivan reports Steve Penny has been accused of allegedly covering up sexual abuse by former gymnastics Dr Larry Nassar\nMath or a former usa gee doctor has been jailed for ten counts of criminal sexual conduct more than two hundred and fifty women and girls have accused him pennies is the first to arrest of an alleged Nasser enabler\nTexas authorities say penny destroyed or head documents related to Nassar's behavior at a training facility that were crucial to their investigation\nPenny has denied any cover up earlier this year he was thrown out of a Senate subcommittee hearing for refusing to answer lawmakers questions about Nassar's abuse\nEmails submitted to that subcommittee appear to show penny telling us say gee officials not to disclose reports the youth he's being held where he was arrested in Tennessee awaiting extradition to Texas Emily Sullivan NPR News\nToday is international shakeout day it's an effort to teach people how to respond during an earthquake to drop cover and hold on\nMeanwhile officials with the U.S Geological Survey also say they've got a pilot project on an early earthquake warning system for the west coast but Doug given the USGS cautions that system is not yet ready to be rolled out to people's cell phones\nThat's the holy grail but unfortunately we are not yet at the point where mass alerting through every one cell phone is technically possible\nThe warning system is supposed to alert when an earthquake is occurring and then send out warnings that could give people several seconds warning possibly up to a full minute before strong shaking storage\nThat's enough time to slow down trains stop factories hole to surgery or get students under their desks\nYou're listening to NPR\nAnd to slow down trains stop factories hole to surgery board get students under their desks\n[laughter] you're listening to NPR\nThe death toll from hurricane Michael has increased to twenty nine people three ... had been reported in Florida where Michael made landfall last week damage teams are still working to restore full power to several Florida counties and cell phone service is still out in some areas\nOregon's court of appeals is set to hear a case of an African American man convicted by a non unanimous jury as Oregon Public Broadcasting's Conrad Wilson reports if the court granted a new trial it effectively means Oregon would have to abandon its split jury system because it's unconstitutional\nIn twenty sixteen Olin Williams was convicted of first degree sodomy by a split jury meaning there were two jurors who thought Williams was not guilty\nNow he's asking the court of appeals for a new trial\nLike Williams one of those dissenting jurors was African American Williams attorney says Oregon's non unanimous jury system violates the equal protection clause of the U.S constitution\nThe Oregon department of justice argues Williams requests for a new trial should be denied because it's not based on newly discovered evidence or and allegations of germ misconduct Oregon and Louisiana are the only state that allow non unanimous juries and criminal cases\nFor NPR News I'm Conrad Wilson in Portland\nThe first of several thousand migrants from Honduras have traveled north through Guatemala\nThey've reached the border with Mexico they're headed for the United states but us in Guatemala and authorities have been trying to stop them President Trump has threatened to cut all us aid to any Central American country that doesn't stop the group of migrants coming\nOn corporate Coleman NPR News\nSupport for NPR comes from NPR stations other contributors include Hitchcock's insurance providing customized insurance for small and medium businesses so they can do more and be more learn more at age ... CEO X. dot com or from an agent Hitchcock's insurance encourage courage\nGood morning thanks so much for starting gr Thursday with MORNING EDITION on ... and Emily Jones I had this morning it set up front and it used to work for the federal government as a student loan watchdog\nIn his resignation letter he accused the Trump Administration of abandoning student borrowers and helping the most powerful financial companies in America will have that story in Fifteen minutes\nThe Trump Administration of abandoning student borrowers and helping the most powerful financial companies in America will have that story in Fifteen minutes right here on ... it's seven seven [noise]\nAnywhere gp the forecast today should be a bit cooler ... from the even the north to mid eighties\nWe'll have mostly sending guy getting cloudy this afternoon and evening and\nIt will be chilling for much of north Georgia with Louis driving into\nAnd fifties and sixties\nNow is the perfect time to clean up the garage and get rid of that car you no longer need\nDo face the coming months with a fresh start and by donating your huge Carter G Bebe feel even get a tax deduction called eight seven seven GP be one car or donate securely on line a G. P. B. dot org slash cars and thank\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I knew well king the Washington Post has run what is believed to be the last column written by Saudi journalist Jim all cause showed ... he's the writer who disappeared after walking into the Saudi conflict it ... earlier this month\nTurkish officials say the Saudi Government murdered him but President Trump says the U.S needs more evidence before holding the Saudis responsible\nWe've asked for it if it exists rises over no I'm not sure yet that it exists probably does possibly does\nTurkish media reported the existence of a recording yesterday it allegedly captured the last moments of ... life\nSaudi crown prince Mohammed bin Salman has denied any involvement in the disappearance but some lawmakers are calling for Saudi Arabia to be held accountable Senator Chris Murphy is one of them he's a Democrat from Connecticut and a member of the Foreign Relations committee morning senator\nCornyn do you feel certain that you know what happened to democracy well gee\nI I don't know that without the evidence that the church reportedly have I can say that I feel ... um [noise] but uh I have seen no evidence and I've seen the classified information available to members of Congress to suggest\nAnd say that I feel ... and um but uh I have seen no evidence and I've seen the classified information available to members of Congress to suggest the show is alive or everything that I have seen 'em that spoke publicly available and privately to barrel\nThis is NPR News\nYou're listening to MORNING EDITION on jeep ... good morning I'm Emily Jones British prime minister Theresa May was optimistic Wednesday as European leaders gathered in Brussels to try to reach an agreement on Brexit\nSeems to be with you very harsh we sold the shoes if I Believe it feels that she knows the time to make you talk to\nOther leaders offered a less rosy assessments will have the latest on where things stand in Fifteen minutes here on gp it's seven twenty\nFew years ago ... off was in Israel and saw the effects of a wave of violence [noise]\nShortly after that he was really observing our entire planet in a planetarium show music inspired by contrasting perspective on the next performance today from a pure\nForm in today's tonight from eight to ten right here on gp\nSupport for G. P. B. programs comes from our listeners and out of the blue and historic downtown Blue Ridge for an extensive selection of specialty wines craft beers and the wind selection of cheeses from the world over information that's out of the blue dot com\nAnd the cost is Jesse Norman school the arts presenting their benefit concert titled grace the tribute to end Johnson Sunday November Eighteenth and four pm at Augusta University Somerville campus tickets at Jesse Norman school dot org\nThe midterms are about a lot of things but mostly there were about the president's Marcia is really a vote for me and this year President Trump thinks that's okay\nI\nSee what does it look like head of an election that would change\nOh\nWhat does the math looked like a head of an election that would change everything next time on one ...\nCatch one age It's MORNING at ten on the TV on the TV news dot org [noise]\n\nSupport for NPR comes from the station and from T Rowe price offering a strategic investing approach that examines investment opportunities first hand institutions advisors employers and individuals choose T Rowe price T Rowe price investor confidence\nFrom campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email temp bullets dragging drop email editor and twenty four seven customer service Morris campaign monitored dot com\nAnd from west and hotels and resorts Westin is committed to the wellbeing of travelers with offerings like heavenly beds a super foods are X. men you and to gear lending for one workout gears\nLeft behind it home west and let's rise learned more at western dot com\nThis is MORNING EDITION from NPR News I'm Rachel Martin and I'm Noel King good morning front man worked for the federal government as a student loan watchdog until he quit in August in his resignation letter he accused the Trump Administration of abandoning student borrowers\nFront men saw lots of things going wrong in the student loan industry but there was one big one Cory Turner first reported this story for NPR's Planet money podcast\nA big part obsessed ... job but the consumer financial Protection Bureau was looking into borrow were complaints and in the spring of twenty Seventeen he and his team noticed this weird pattern\nWe see cops firefighters teachers nurses who are entitled to public service loan forgiveness and they are repeatedly denied\nThe public service loan forgiveness program began in two thousand seven with a pretty simple pitch\nSpent ten years and one of those public service jobs paying down your student loans and the government would forgive whatever's left as a thank you but last year from and was hearing from lots of public servants who said they made it years into the program\nAnd found out their plan for financial freedom essentially just wiped out in the blink of an eye because of the mistakes with their student loan company\nHere's what was happening ... says the federal government pays a bunch of companies to manage more than ...\nIn the blink of an eye because of the mistakes of their student loan company here's what was happening from and says the federal government pays a bunch of companies to manage more than forty million student borrowers\nThese companies are called servicers and they handle the paperwork and answer the phones when borrowers call and ask for help and they're doing a terrible job Massachusetts attorney general more Healy is actually suing one of these servicers fed loan I spoke with her earlier this year\nTheir failure to do their job has resulted in hundreds of thousands of genes having their financial future sabotage\nAnd several other states are suing the different service or ... claiming it's made mistakes too and broken the law\nIn the past both companies have denied these allegations saying it isn't their fault they're just following the rules set out for them by Congress and the education department and that they're doing their best they say to resolve bar were complaints [noise] neither company wanted to talk for this story you know who did\nThe students who thought they were going to get their loans forgiven but aren't\nI made life decisions based on wrong information\nSarah ... says her service or told her she qualified for loan forgiveness\nShe's teaching now has been in public service for six years and thought she had just four to go but recently she called the ... department and someone told her oh I'm Sorry but you don't qualify not until you consolidate your loans\nBut she was told if she does that count down to forgiveness would reset back to ten years\nI can kind of let my guard down and said this kinda sucks and she said yeah it really sucks [laughter]\nTwenty nine thousand applications for public service loan forgiveness have been process so far and all of those Ninety nine percent have been denied in other words Sarah ... story is not unusual oh well see that's actually a huge relief\nBecause I Walk around with and norm is amount of healing Philly\nIts defense the education department says everybody who is eligible is being approved\nAnd they say they're working on improving the process but ... a former student loan watchdog says the department under President Trump isn't only walking away from the fight\nTo help student loan borrowers they're actually arming the other side in response to all those state law suits against it servicers the Trump Administration is now arguing these companies they're protected from state laws\nIn response to all those state law suits against it servicers the Trump Administration is now arguing these companies they're protected from state laws because they work for the federal government\nAnd this fight is now being waged in the courts meanwhile Seth fraud and may have left governor but he continues to wage his fight for public service loan forgiveness as a private citizen Cory Turner NPR News Washington\nFor Planet Money comes from transfer wise a service that helps people send money internationally three million people and businesses use transfer wise men receive and convert currencies and more than Seventy country\nMore at transfer wise dot com or from their app\nSome bittersweet news this morning big bird is retiring more precisely the voice behind the man inside big bird is hanging up his bright yellow feathers after nearly fifty years on Sesame Street\nBanking brain Hank in Iraq\nIn some time to be my\nTo hang up and share\nCarol spinning has been on the show as big bird and other characters in the show from your in Nineteen sixty nine\nAnd the big bird character will live on but Carol spend his last walked down Sesame Street will be recorded today not a TV studio in New York he told NPR in two thousand and three that he's come a long way\nBy first TV show was in uh Nineteen fifty five in Las Vegas I was on the air force and I had a show called a rascal rabbit show maybe ten dollars a week\nNot that creator Jim Henson hired spinning to perform big bird who towers at eight feet two inches tall spinning is five foot ten so how does that work great apparently spending stand inside the feathered suit with his right arm high above his head his right arm is big birds and neck his hand is big bird's beak\nSpend he said it's hot and dark and pretty bad if you're claustrophobic\nOkay that's the out I wear a tiny little TV set the strapped to my chest and I'm watching to see if big bird is looking at whoever is talking to or looking at the children are home was removed to feathers the wrong by Velcro but we try not to do it because sometimes you see this little dark spot in his chest we're speaking out\nThat big bird as you probably know is kind and sweet but it's been he says after performing him all day it's kind of therapeutic to switch to his other famous Sesame Street character Oscar the grouch\n\nAnything on she\nWas ... he does have a voice like that\nOh\nShe would do ... I just have a voice like that in my rough for character voices I was\nGetting desperate because it was finally down to the day before we start taping and so as I took a cab across Manhattan the taxi driver looked at me so I went to Mac and there's a wow what a voice\nAnd he then\nCarol ... seven Emmys two Grammys and has been declared a living legend by Congress when he was featured on the cover of life magazine he was delighted\nI pointed to it I said gee I didn't ever expect to be on the cover of life magazine and the woman who sold a back seat so what do you mean I said I point to a big British I play that\nShe said well I wouldn't tell people about\nPublic ... retires today after nearly five decades of performing on Sesame Street as big bird and [noise]\nMixed in with the sand and houses that have been sort of shifted off their foundations the other side of the street and in the midst of all this rubble there are people here that are\nLooking for something that's incredibly small it is\nReally investigative work looking for clues to see where the water was\nHow far it became the fires and tiny mad at towards the United States Geological survey they looked for modern grasp it start to decide they're even inside the building signs of how hard the storm surge reached and they find something they market it's a hard job\nThere's almost looks right here\nThat [noise] there there's a little something you see like a little piece of the grass the dirt that's accumulated on these uh these steps that will go into the wrong direction\nBuyers doesn't know where the steps came from the water line isn't used but sometimes if you do and he said she found a marked down the road someone spray painted a red line on the street like\n\nThis is NPR News\n\n... an Eighteen station radio network of Georgia Public broadcasting morning at Emily Jones\nWe'll talk with Melissa McCarthy about her new moving can you ever forgive me that conversation is in about eight minutes right here on gp being followed by G. P. B. news at eight o'clock\n\n\nCPB is an Eighteen station radio network you can listen to what's on your radio and you can listen on your smart home speaker\nAsk Alexa to open gp being alive o\nSeven forty point\nThat makes me chuckle body coming up with an excellent point sure we're\nOr to things have to go right before\nRyan Gosling stars is first man the movie that put the Apollo eleven moon landing on the big screen but what was Neil Armstrong the men who took that giant leap really like that's coming up with an extra points from NPR\nThis morning at eleven ...\nSupport for G. P. B. comes from our monthly sustain yours and J. P. Morgan Asset Management who believes on constrained thinking leads to better outcomes and entrepreneurship and investing their video series explores the impact of the un constrain spirited J. P. Morgan dot com slash on constrained\nAnd the historic Sam short line railroad Thomas the tank engine visits the same short line train at Georgia veterans state park in ... October Nineteen twenty first plus the twenty seventh and ... tickets at Sam short line dot com\n[noise] no the person to simply don't believe you know the person that screams loud [noise]\nStuff starts with on the ground where you may supernatural storytelling continues [noise]\nSubject [noise]\nIt starts with on the ground where you may even for national storytelling continues [noise]\nStep judge [noise]\nTonight at ... [noise]\n\nSupport for NPR comes from the station and from the three I O T providing a software platform that enables organizations to deploy artificial intelligence predictive analytics and I O T solutions that industrial scale learn more at sci fri\nI O T dot a guy from the gym pe Jim\nThe global investment management business a credential is for investors seeking alpha across private and public markets learn more it P. G.\nI. M. dot com and from Americans for the arts\nThis is MORNING EDITION from NPR News I'm Rachel Martin and I'm Noel King good morning Brazilians will head to the polls to elect a new president in ten days it's been a hard fought campaign and now an unlikely voices joined the political fray one of the founders of pink Floyd NPR's Philip Reeves has the story\nUp to like try\nIn the city of Salvador in northeast Brazil\nIs Seventy five in music mad Brazil he has many fans fracturing his age\nWho end up coming out is is to\nSee all these like grew up listening to\nSit down and I don't think\nIt's a cliche she says but only like another brick\nCrowd has come to be into\nWill tour in Brazil\nOne of his recent shows characterized the far right candidate shy of ... at the neo fascist\nPeople among tonight's proud to know reporters who do that again\nCentury bc ... bank clog\nVery good that already like him they got the good about the you know\nWe are now a faith\nAll over the world are very complicated tiny holy ... you know and it's very important\nAbout ... you know\nWe are now a paid\nAll over the world are very complicating probably take you know and it's very important\nPercent outside into theory in America\nFocus is a political activist to campaigns are many from anything we're not going to follow but thinks in Brazil where your emotions are running ...\nElection relate to the tax I tend to become an investigative journalism group that tracks the identified more than Seventy in the first ten days at this moment\nIn this city Salvador celebrated actress proceeded musician they're older trauma while the coast to coast stabbed to death ten days ago\nAfter an argument about politics\n...\nLast month ... himself is that the interest at a rally\nNot always said he doesn't have the votes anyone and dull to bother him get his opponents blame him funding players so I think is ... is a little bit and races\nAnd your search areas so another trick in the wool begins\nAll types of groups of kids stumps they're going to say\nCrowd is Jessie anyhow him with the knowledge post now there's\nOthers are booming yelling disapproval like took a picture appears on the big screen of rumble I'll do the Costa stabbed musician from South or just pay a tiff with tributes [noise]\nIt's MORNING EDITION from NPR News I'm Noel King and I'm Rachel Martin\n[noise]\nNinety seven point seven FM W. J. P. B. and ... GBH leave room for the Georgia Public broadcasting radio network [noise]\n\nLive from the G. P. B. newsroom I'm Emily Jones good morning coming up this morning we'll bring you the latest on the future of Brecht said first in Georgia headlines the state's agriculture industry suffered devastation at the hands of hurricane Michael GPS Roswell has more on the damaged on to the states pot and crop\nMore than a million acres of cotton were planted this year before Michael hit\nA great ... now there was opened up and ready to be arrested and that's where the problem you know the ... through ... ...\n... with the Georgia costs and commission she says the hurricane is one of the worst disasters that could happen to farmers\nThe ripples of the school and to be filled in rural news the door for years to go\nSpills says some farmers are just now getting assistance after Hurricane Irma hit last year and lost his top a hundred million dollars for this year's damages expected so far exceeds that ... the news on Ross throw in Atlanta\nGeorgia students who took the a C te this year out performing their peers across the country the ACT as a test across the core subjects that's used by most colleges and universities in the admissions scholarships process\nAccording to the AJC this is the third year in a row at Georgia students have beaten the national average toward U.S Department of education says the twenty Eighteen results also solve black and Hispanic students and the state outperform their counterparts nationally for Georgia News Go to the TV news\nDot org it's eight a one\nLine from NPR News in Washington encore of a cool and the first of some three thousand Honduran migrants traveling north have passed through Guatemala and reach the Mexican border angering President Trump reemerged and reports Guatemalan and U.S authorities are trying to discourage them from traveling farther\nLeader of the migrants march former Honduran lawmaker ... was arrested in what the mother as President Trump threatened to cut off us aid to any Central American country that didn't stop\nIt's march former Honduran lawmaker ... this was arrested in what the ... is President Trump threatened to cut off us aid to any Central American country that didn't stop the march\nTo hundreds of migrants have made their way to the Mexican border the U.S ambassador to what the other side of yoga issued a statement in Spanish urging the migrants to return\nFrom their little sister ...\nIdea that says a U.S border has never been so protect those who tried to enter legally will be arrested and deported he added he understood people sleep due to lack of opportunities and that the U.S is investing millions of dollars to change that for NPR News I'm ... and\nPresident Trump is now tweeting now he's threatening to close the entire us southern border with Mexico to stop the migrants he says he'll call up the U.S military to do it he's also blaming Democrats for what he claims is an assault on the U.S\nThe Washington Post published the final column written by missing Saudi Arabian journalist ... who disappeared more than two weeks ago he vanished after entering the Saudi consulate in Istanbul and fears Gen Neuman has more\nIn a column published by the post on Wednesday ... warns that governments in the middle east quote have been given free rein to continue silencing media at an increasing rate asked because he says Arab governments who suppress journalists are no longer receiving backlash\nFrom the global community he gives a Saudi Arabian government as an example earlier this year a criminal court gave a prominent Saudi writer a five year prison sentence for insulting the royal court the official body that represents the king\nBut now the disappearance of the show that she has sparked international outrage and brought renewed attention to the authoritarian kingdoms human rights record\nCIA Neuman NPR News Washington\nThe death toll from hurricane Michael has increased to twenty nine people in four states authorities in Florida report it three more iffy talent he's damaging some parts of the Florida Panhandle is considered catastrophic Christie male lost her house near Panama City\nThere are three pine trees on the house there's pine trees on the garage um that is actually\nDamage the motor home that my father has um [noise] holes in the\nAnd ... and the bedrooms and [noise] um we're just lucky\nAnd that all of us are alive\nWhat still unknown is how many people are missing\nUm we're just lucky\nWe're all not hurt and that all of us are alive\nWhat still unknown is how many people are missing cell phone service is spotty in some parts of the Florida Panhandle and people are still trying to locate loved ones\nYou're listening to NPR\nFlash flood warnings are up for parts of central Texas the national weather service says storms will persist in the region north of San Antonio flooding is already killed several people the bodies of two people were discovered in water near the town of Leno\nNow officials are watching dams along the Colorado River it is over full from heavy rain officials are releasing water downstream into areas already saturated\nCrimea is marking three days of mourning after a school shooting yesterday that left at least Twenty one people dead end fifty others injured as NPR's Lucian Kim reports from Moscow some media are comparing the rampage with the Nineteen Ninety nine massacre at a high school in Columbine, Colorado\nThe shooting took place at a vocational school in the seaside town of courage Russia which annexed Crimea from Ukraine and twenty fourteen is leading the investigation into what drove an Eighteen year old student to go on a shooting rampage\nCommunist crumbling back leader told reporters he attacked couldn't have been carried out without accomplices school shootings are rare and the former Soviet Union because of strict gun laws president whether you're putting spokesman said measures will need to be taken to minimize if not eliminate the risks of such attacks in the future\nLucian Kim NPR News Moscow\nThe world Health Organization says the outbreak of Ebola in Democratic Republic of Congo is likely to get worse unless officials devote more resources to fighting it but the W. H. O. after an emergency meeting says the virus does not yet ... constitute a public health emergency of international concern\nThe agency says there have been more than one hundred Ebola death Cindy or see It's NPR\nSupport for NPR comes from NPR stations other contributors include progressive insurance with the name of your price tool offering a range of coverage and price options to choose from now bats progressive more progressive dot com or what eight hundred progressive and the corporation for public broadcasting\nIn morning thanks so much for starting gr Thursday with MORNING EDITION on GDP on that only towns Republicans say the Brett Kavanaugh hearings were a wakeup call for the GOP\nI think it did do is galvanized Republican votes\nRepublicans say the Brent Kavanaugh hearings were a wakeup call for the GOP\nWhat I think it did do is galvanized Republican voters to make sure that they vote for the Republican ticket\nDemocrats saying the controversy also gave them a new energy how this issue might impact one Arizona Senate race in Fifteen minutes it's eight of seven\nIf you or your loved ones were affected by hurricane Michael food and water are available at multiple distribution points across southwest Georgia a full list is available at the gym a website\nG. E. M. A. dot G. A. dot Gov\nSurvivors in Baker Decatur Doherty early Miller seminal Chris Grady Lee Michel ... Thomas in worth counties are eligible for federal disaster assistance through FEMA\nThose survivors should file claims with their insurance companies first then visit disaster assistance dot Gov or call eight hundred six to one three three six to if you need help with debris cleanup contact crisis clean up at eight hundred\nFour or five one Nineteen fifty for\nA full list of all survivor resources is available on line\nAt G. E. M. A. dot G. A. dot Gov\nIt's MORNING EDITION from NPR News I'm Noel King and I'm Rachel Martin breaks it negotiations are at a standstill these are words we have said before leaders from the United kingdom and the European Union are meeting in Brussels\nAnd while they're trying to put an optimistic spin on the negotiations the EU and UK are at a stalemate over one crucial issue the Irish border\nIf they can't reach an agreement a so called hard Brexit what happened with no deal\nWhich would be a blow to the British economy among those trying to hash out a way forward in Brussels is Alexander stoop he's the former prime minister of Finland he's also in the running to become the next president of the European Commission which would put him right at the center of the Brexit negotiations\nMr ... thank you so much for being with us this morning\nThanks mostly what is the state of play right now do you see any progress\nWas instead of later typically a negotiation or you know sometimes the making of ashes and the other stuff still them your stuff and then you move on ah right now the key issue is you mentioned this is the so called ... of the border issue between either are Linda northern\nClock and then you move on ah right now the key issue as you mentioned as as as the show called ... the border issue between either are Linda Northern Ireland or Northern Ireland and the United kingdom on a usually what happens in these negotiations as fast or\nYou're going to have to have a little bit of drama a little bit of theater and that's what we're going to see in the next few weeks\nThis is NPR News\n\nYou're listening to MORNING EDITION on cheap ... good morning I'm Emily Jones midterm elections are often seen as a referendum on the president's\nNot only is it always about the president to some degree but there's a lot of reasons to believe that this year it'll be even more about the president is\nOne reason for that President Trump is trying to make these elections about him that story in twenty minutes it's a twenty\nAnd fresh air you'll hear from people who really make you think like astrophysicist Brian Greene explaining a scientific theory that our universe\nIs just one of many and the image that I like to have in mind is imagine that our universe is like one slice of bread and a much grander cosmic loaf with the other slices of bread being older unit versus the subject is too big for fresh air China\nThis afternoon at three here on G. P. B. ended ...\nDot org support for G. P. B. comes from our monthly ... and the cost is Jesse Norman school of the arts presenting their benefit concert titled grace a tribute to end Johnson Sunday November Eighteenth and four pm at Augusta University Somerville campus tickets at Jesse Norman school dot org\nAnd the historic Sam short line railroad Thomas the tank engine visits the same short line train at Georgia veterans state park and ... October Nineteen twenty first plus the twenty seventh and ... tickets at Sam short line dot com\nThe midterms are about a lot of things but mostly there about the president's whore Marcia is really a vote for me and this year President Trump thinks that's okay\n\nMostly they're about the president's own horn Marcia is really a vote for me and this year President Trump thinks that's okay\nI\nSee what does it look like head of an election but would change everything mixed on one one\nOne day this morning at ten on the TV on the TV news dot org [noise]\n\nYour radio support for NPR comes from this station and from visit St Petersburg Clearwater along Florida's Gulf Coast offering artistic draws including St Pete's Dali museum the truly collection and the museum of fine arts more at visit saint Pete Clearwater dot com [noise]\nFrom Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring John Slattery Amanda peach Paul Riser and Catherine hon a new episode every Friday on prime video\nFrom fidelity investments taking a personalized approach to helping clients grow preserve and manage their wealth learn more it fidelity dot com slash wealth fidelity brokerage services wealthy\nAnd from listeners like you who donate to this NPR station\nIt's MORNING EDITION from NPR News I'm Noel King and I'm Rachel Martin it was impossible to ignore the ticking clock underneath the confirmation hearings for Supreme Court justice Brett Kavanaugh\nEveryday that went by was the day closer to the mid term elections a reality Democrats and Republicans on the Senate Judiciary committee or very aware of and both sides tried to leverage the hearings to their political advantage\nSo how are those hearings playing out among voters NPR's Danielle Kurtzleben went to find out in Arizona where there's a tight Senate race between two women Republican Martha mix Sally and Democrat cure stint cinema\nTravel is super politically active\nEither regional director for the Arizona federation of Republican win in the end of member of the Pima County Republican win today she's at a pizza restaurant in ... Arizona\nHave lunch with another Republican when Andrew\nOn I got scared I'm trying to help the lady that\nHand like a lot of Republican when she had a strong feelings on for ... I don't know I\nHave to put it that really put up to that\nHer at odds with mixed alley who has said she believes orange is an assault victims\nTo put up to that\nWith her at odds with Nick Sally who has said she believes Ford is an assault that\nProbably is firmly on the mic Sally and she thinks the Ford Kavanaugh hearings have amped up enthusiasm in her party\nI think it helped immensely and I think it is it on both sides [noise] I'm not saying once I'm more than the other because I'm hearing from our side\nOf the Republican protest we go to the vote we put money down and\nAll of that is one reason why Jim vote with phone banking for Democrats here since sin among one night last week to stave off any Republican searching\nFor a lot of my friends that are more progressive you're going to do everything they can try ours\nAnd while he hasn't seen evidence of the cabinet controversy boosting turnout he has seen it inching Democrats into becoming even more engaged\nWith just made it even more [noise]\nI'm not sure if it said okay we're going to open our yeah\nBut it was definitely about what else do I do\nRepublicans may be getting more fired up now but there was already plenty of democratic fury almost two years worth of it and democratic strategist Andy Barr things his party's anger has much more staying power\nPeople tend to do stuff out of anger and like the sort of more than enough for them to pay ...\nFor whatever anger the Democrats in Arizona might be feeling over the cabinet controversy send them on the Democratic candidate doesn't sound outraged cinema has focused a lot of her rhetoric around process like the FBI investigation affords claims\nWhen I learned that we were not going to get access to the report I was very disappointed because I think many Americans were so I was forced to make a decision without being able to see that report\nForced to make a decision that's a far cry from other Democrats who have emphasized that they believe Kavanaugh had assaulted forward right now the races in a dead heat polling shows that cinemas slightly don't mix Sally has narrowed in the last couple of weeks Republican strategist John Seton things cabin all played a part in that trend\nReally what I think it did do is somewhat anyway galvanize go center right Republican voters to come all the fuel and make sure that they mail in their ballots for the Republican ticket\nBut especially with the candidates and their allies sticking to other areas like immigration and health care as well as personal attacks democratic strategist bars says it's hard to say that the confirmation hearings are what narrows that gap\nThe undecided grew more looking on\nStrategist bars says it's hard to say that the confirmation hearings are what narrow that gap\nThe undecided group when they start to come home or at around you know we go to hell\nIn a debate this week both candidates chose not to weaponize the Kavanaugh fight too much while the president has gone so far as to call Ford's accusations a hoax mix Sally focused her criticism on Democrats and activists not Ford herself\nWay of seeing the mob rule in Washington DC and in the end Arizona's wanted a yes vote I'm justice Cavanaugh I can be for survivors is one myself and for justice Kavanaugh\nMeanwhile moderators had to ask cinema multiple times before she'd say how she'd have voted\nWe still haven't got enough where you know asked her from you out that way I Would have voted no and I and I did put out a statement saying such\nWhether the cabin all confirmation gave either campaign a lasting boost the candidates are much happier talking about health care immigration and the economy Danielle Kurtzleben NPR News\nA federal regulator has publicly criticized large cell phone carriers for being slow to restore service in the areas most devastated by hurricane Michael NPR's Camila Domonoske has the story ever since\nHurricane Michael hit the Florida Panhandle survivors have been trying to get in touch with their families for some it's been a real struggle cell phone signals went down after the storm hit last Wednesday and stayed down for many customers\nHorizon in particular has lingering outages Florida State officials called the company out for lagging behind competitors after days of complaints new numbers on Wednesday showed just over half the cell towers near Panama City Florida we're functioning\nThere's no doubt run a more positive track\nMatthew Berry is chief of staff at the Federal Communications commission the agency criticized the slow pace of progress earlier this week\nBut we need to keep the attention on this problem and keep the pressure on because they're still a ways to go when we can't have any backsliding in the next few days\nRestoring cell service is always a problem after a big storm the absence of a signal means people outside the storm's path or left worrying about loved ones they can't reach while residents have trouble contacting local authorities and their insurance companies the FCC says it usually takes a few days to approach full coverage\nAfter Hurricane Sandy it took about a week after Hurricane Maria in Puerto Rico it took six months an extreme situation\nThe problem with hurricane Michael is that several\nSandy it took about a week after Hurricane Maria in Puerto Rico it took six months an extreme situation [noise] the problem with hurricane Michael is that several days after the storm the FCC was noticing only marginal progress and the most devastated areas\nWe don't disagree that this is an unacceptable situation\nKrista born is rising market president for wireless in the south she says varieties and slow recovery from this storm was uncharacteristic and unprecedented for rising the biggest problem is not cell towers but the fiber optic cables that run to those towers\nThe storm's path just happened to go right in a critical area where the fiber was late and\nIt's just an incredible amount of ...\nAnd it's not just damage from the initial storm as clean up is under wave arising as having to fix new damage to those fiber optic cables\nThousands of recovery workers you have to agree remove all happening you have a lot or do work that I could just have an accidental cut in an area that we've already repaired and that we have to circle back to make that second repair\nMany people around Panama City still don't have service ... NPR News\nAre those risks enough to stay the hand of the United states\nThis idea that the United states is more dependent on Saudi Arabia in Saudi Arabia is on us is ridiculous um and how is important\nWell it's important to remember that if the Saudi Arabia decided to stop selling oil to the United states it hurts the Saudi Arabia I'm frankly at this point more than that hurts the United states because we have found ways to become less dependent on Saudi oil than we were in the past I'm at the end and I would also argue that\nWe need to look at the broader scope of of the train line of arms sales to Saudi Arabia we are selling Saudi Arabia\nUm it's a much more arms today than we were ten years ago um and and so what I'm suggesting that we just returned to a level of\nArms sales to a military relationship that looks much more like it did a a decade ago um there has been a ...\nIs that we just were earns you a level of arms sales to military relationship that looks much more like it did a a decade ago um there has been a big increase in our military partnership with them over the years I'm suggesting scaling back to where it used to be\nSenator Chris Murphy Democrat of Connecticut and member of the Senate Foreign Relations Committee\nThank you senator among\nThe Associated Press asked President Trump this week if she would bear some responsibility if Republicans lose the house in November the president replied no but as NPR White House correspondent Tamara Keith reports Trump may not want the blame if the GOP takes a hit but he still thinks the election is about him\nPresident Trump isn't on the ballot in November but that doesn't mean he isn't on voters' minds Alan Abramowitz is a professor of political science at Emory University he studied mid term elections and says there is a very strong correlation between presidential approval and the results for his party\nNot only is it always about the president to some degree but there's a lot a lot of reasons to believe that now this year it'll\nBe even more about the president\nAnd why is that well first of all because Trump has\nHas tried to make it about him for Marcia is really a vote for me and everything we stand for\nMe to vote for a vote for me to receive is a vote for me remember\nThis vote for me in our agenda to make America great again\nIn the a P interview Trump explained that he was making this explicit appeal because the people at his rallies are there for him and some have even told him they don't plan to vote in the midterms in twenty fourteen President Obama made a similar appeal\nOn the on the ballot this fall [noise]\nShe'll pretty happy about that [noise]\nBut make no mistake these policies are on the ballot every single one\nAt the time it was seen as a gaffe many Democrats were trying to distance themselves from Obama whose approval rating at the time was in the low forties Trump's approval is in a similar spot now again Abramowitz\nYour most probably going to come in through at risk of losing their seats for probably ... more of a local issues about things I've done for their state or district and not about the president\nRegardless of what candidates want this is a nationalized election sixty percent of voters according to a recent Pew Research center poll say Trump will be a factor in their congressional vote with a greater share\nBashing the last election sixty percent of voters according to a recent Pew Research center poll say Trump will be a factor in their congressional vote with a greater share saying they will be voting against the president then for him camera Keith NPR News [noise]\nYou're listening to NPR News\n\nServe in Gainesville and beyond ... an Eighteen station radio network of Georgia Public broadcasting good morning I'm Emily Jones\nCash strapped Americans often turn to quick financing options like short term loans when they need a little cushion but how much they pay in charges can differ from state to state will have the story and eight minutes on the marketplace morning record\nHere on gp in Georgia business news Kmart is closing its last to Georgia stores the company is owned by Sears Holdings which filed for bankruptcy this week locations and Peachtree city and cutting ten are among one hundred forty to Kmart and Sears stores that will be shut down by the end of the year\nLiquidation sales at both stores are expected to start soon\nOr just ports saw double digit growth in September to them AS Port handled twelve percent more container unit set in August in Brunswick the port handled over thirty seven percent more cars trucks and heavy equipment\nTerms or about a lot of things but mostly there were about the president's own horn Marcia is really a vote for me and this year president focusing\nOn\nThe map look what kind of an election was to change every time one [noise]\nThis morning at ten on GDP [noise]\nSupport for G. P. B. comes from our monthly ... and ... and making by medicine helps the bully accredited life plan community in central Georgia offering active seniors and maintenance free lifestyle and the security of having a plan should healthcare needs change Carlisle place dot org\nAnd Georgia trend magazine for more than Thirty years covering Georgia business politics and economic development\nSubscription information and more are available at Georgia trend dot com\n\n\nBecause you're on can really make is that\nThe concert master of the Atlantic monthly\nBecause you're on can really make his Saturday\nThe concert master of the Atlantic and thank\nGod he's still knows this concerto by Camille\nI'm Sarah that killing me the S. L. I. N. G. P. B. tonight it [noise]\nSupport for NPR comes from the station and from the Kauffman Foundation working together with communities in education and entrepreneurship to create uncommon solutions and empower people to shape their lives and be more successful more online at ... dot org\n[noise] from the Pew Charitable trusts marking Seventy years of non partisan research and data learn more at Pew trusts dot org slash Seventy\n[noise] and from listeners like you who donate to this NPR station\nIt's MORNING EDITION from NPR News I'm Noel King and I'm Rachel Martin midterm elections are less than a month away and Facebook is ramping up its fight against this information in twenty sixteen the social media network was caught pretty much flat footed has for an actor spread false narratives by masquerading as Americans\nFacebook has now set up a system to try to detect and disrupt bad actors on their network who are trying to de legitimize elections spreads fake information and suppress the vote\nNPR's Tim Mak as a look inside\nWe all believe in an increasingly digital world but even within a large tech firms like Facebook there is no substitute for face to face communication [noise] the last month Facebook set up an elections war room on their Menlo Park California care there's no way\nIn the room that large American flag hangs above custom built that that monitor viral news spam and voter suppression effort to\nFox News CNN enrolling Twitter feed play on large screens along the wall and a rotating group of data scientists engineers and operation specialists occupy approximately twenty posts in the room\nHere ... the head of the civic engagement team at Facebook\nDashboard and these ... words actually have alarms on them so that if there's any spiking unusual activity the war room is alerted to them and in our data scientists will be able to look at any sort of anomalies that are detected figure out if there are actually problems the uh underneath those anomalies let me see\nDid it to them and then our data scientists will be able to look at any sort of anomalies that are detected figure out if there are actually like problems the underneath those anomalies that we see and if there are pass them along to our operations team\nWe just want to note that ... is the brother of men in the ... party host of WVU ours on point Facebook offered him as a source for the story public officials are watching closely to see if Facebook will be able to prevent this information like that scene during the twenty sixteen campaign\nHere's what Senator Mark Warner the top Democrat on the Senate intelligence committee told NPR\nFacebook was asleep at the switch and even in the immediate aftermath of the elections they denied that there were any foreign\nInfluence others on their platform they were dead wrong\nThese concerns reflect ... Facebook in American civic life forty three percent of Americans get news on Facebook by far the website Americans most commonly used for news according to a recent survey by Pew Research\nThe social media network doesn't want to police content generally speaking but Facebook officials think that cracking down on ... behavior such as fake accounts and ... will help curb foreign influence operations [noise] here's ... again\nWe have actually made a huge advances in artificial intelligence and machine learning and we've been able to block in a recent six month period one point three billion fake accounts from forming\nBut Facebook faces a formidable challenge Kevin Mandy or the sea of fire I a cyber security firm which accounts Facebook as a client recently told NPR that there are many foreign operations the analysts have yet to discover\nI strongly doubt that we've caught a hundred percent of the ones Iran's doing or Russia's doing and I would say we're more on the three to five percent on what we've found meaning there's a ton of going on right now that were wholly out aware of\nFacebook told NPR that it does seem foreign information operations increasing estimate terms near which is what they expected ears Nathaniel glacier their head of cyber security policy", "year": "2018", "show_name": "Morning Edition (NPR)", "city": "Chatsworth", "day": "18"}