{"month": "10", "state": "GA", "station": "WNGH", "content": "... member supported TPP we're in Eighteen station radio network you can listen online\nThis is member supported gp Pete were in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my GP beat and Georgia Public broadcasting on Facebook thank you for listening\n[noise] for MORNING EDITION and on second thought totally fickle rewind it all the teeth ... splits their support makes everything you hear on TV possible if we didn't hear from your during our fall fund drive your contribution now still make a difference [noise] please take just a couple of minutes to support the programs you rely on them\nEnjoy on the TV and do your part now at whatever level is right for you\nGood a G. P. B. dot org and click donate and thanks so much for your support of Georgia Public broadcasting [noise]\n[noise]\nNinety seven point seven FM double your G. P. B. S. W. A. G. P. H. D. room portable Georgia Public broadcasting radio network [noise]\n\nGood morning Brett Kavanaugh is now as a reward just there'll be a ... wearing night we will look forward to how the newest justice\nCabinet appointment is short to galvanize energy among both Republicans had Democrats as we move towards the mid term election I'm David\nGreene and I'm Noel King high stakes presidential election in Britain will go to a runoff a far right candidate came up just short of the votes he needed to win\nRight and some people who suffered from insomnia are turning to their phones and sleep asking for help\nThan what it is Monday I'm over ...\nSongwriter and showman brutal march thirty\nAnd the news is next\nLive from NPR News in Washington I'm Dave ... there's a ceremony tonight at the White House where President Trump will swear in Brett Kavanaugh as the newest justice on the U.S Supreme Court NPR Shannon band sense says this follows cabin all Senate confirmation over the weekend\nConservative now have a working majority of five justices and will decide dozens of federal cases on issues from auto emission standards to immigration Kevin always sworn in in the shadow of ...\nAlready a fine ... and will decide dozens of federal cases on issues from auto emission standards to immigration Kevin always sworn in in the shadow of a confirmation fight exposing and possibly deepening divides and an already polarized political system\nProtest church that demonstrations over the weekend said they were gearing up for a larger long term movement to inspire voters to head to the ballot boxes and November and beyond\nRepublican leaders say Kavanaugh's confirmation well also rallied voters among the G O P base\nSentiment and sent NPR News Washington\nSecretary of state Mike Pompeo was in China Today pump pay was briefing China's foreign minister and other officials in Beijing about his latest trip to North Korea where ... met with Kim Jong on\n... pale in China's state councilor voice criticisms of each other's government today but agreed on the need to improve cooperation between the two countries\nThe president of Interpol monk hung way as being detained in China where he's being investigated on charges of bribery and violating Communist Party rules NPR's Rob Schmitz reports\nChina's public security ministry ... of the investigation and among on Monday and you know it's been ... more than a week after mine was reported missing by his wife in the on France where Interpol is headquartered for its part Interpol hastily announced among has resigned as president of the international police agency\nAnd they own grace among said she'd received threats and at the final tax from her husband said wait for my call followed by a ... knife\nObservers in China say the fact that Beijing is willing to jeopardize its diplomatic relations bite attaining a high profile officials suggest the stakes are high\nMom was appointed vice minister of China's national police by ... former security czar who was in prison after she didn't paying became leader of China Rob Schmitz NPR News Shanghai\nFederal investigators say a weekend crash in upstate New York involving a limousine and pedestrians is the deadliest in the U.S in years twenty people were killed Eighteen of them were inside the limo\nWitnesses say the limo random stuff Simon Stow Harry New York about forty miles from Albany and slammed into a parked SUV outside a store Robert Sumwalt as chairman of the national Transportation Safety board\nTwenty fatalities is just\nI've been on the board for for twelve years and uh this is one of the biggest losses wife loss of lives than we've seen a in a long long time among those\nKilled in a limo were four sisters the group was headed to a friend's thirtieth birthday\nAnd the wife loss of lives than we've seen a in a long long time among those\nKilled in a limo were four sisters to group was headed to a friend's thirtieth birthday party this is NPR News from Washington [noise]\nIn major league baseball the Milwaukee Brewers are heading for the national league championship series after completing a sweep of the Colorado Rockies already Michaelson with member station Wu WN reports\nThe brewers shutout Colorado is six to nothing in Denver to complete a three games sleep as Iraqis Milwaukee's pitching staff held the Rockies to only two runs and fourteen hits in the division playoffs\nIt's the first time since two thousand eleven that the brewers have a dance to the championship series the brewers had to fight to even get to the division playoffs last week they beat Chicago in a one game extension of the regular season to capture the division crown at Wrigley Field\nFor NPR News I'm Marti micro thin in Milwaukee\nAnd the other and they'll divisional match up the Los Angeles Dodgers and the Atlanta Braves will play a game for their series this afternoon in Atlanta LA leaves the best of five two games to one yesterday Atlanta avoided a sweet by beating the Dodgers six to five\nIn the American league the Houston Astros are in Cleveland this afternoon for game three of their AL divisional series the Astros lead Cleveland two games to none tonight in New York the Yankees host the Boston Red Sox that's game three of their AL divisional series it's tied at a game of peace\nForecasters say a tropical storm that rapidly formed off Mexico's Yucatan Peninsula has gained new strength they say it could become a category ... hurricane with unexpected mid week strike on the Gulf Coast in the Florida Panhandle\nI'm Dave ... NPR News in Washington\nSupport for NPR comes from the Jack Kemp the Koch Foundation providing scholarships throughout the nation to exceptionally high achieving students with financial need for middle school to college more information about coke scholarships is available at J. case the half dot org\nAnd Americans for the arts\nWhen a life hangs in the balance what goes beyond a reasonable doubt really mean\nAnything [noise] and then on ... on my mind the\nG. P. B. presents the radio play beyond reasonable doubt the Troy Davis project by Atlanta\n...\nG. P. B. presents to the radio play beyond reasonable doubt the Troy Davis project by Atlanta play right we know the story follows the death penalty case of Troy Davis joining us at ten am on Sunday October twenty first on gp the radio\n[noise] she brings your news and information you can trust everyday join us for an in depth conversation about the challenges for news organizations to remain impartial and stay above reproach in a polarized society one a host Joshua Johnson will be\nJoined by journalist an editor for NPR and the G. P. B. newsroom for an honest conversation about ethics and transparency Thursday October twenty seven PM free to attend reservation required\nGDP dot org slash community for more information [noise]\n\nThere's a rhythm to our game and everything to our evenings as well as routine and I I Am saying that you can make my party you can hear\nTonight and every Monday through Wednesday at ten pm tonight to put it [noise]\n\nIt's MORNING EDITION from NPR News I'm Noel King in Washington D. C.\nAnd I'm David Greene in Culver City California the three month confirmation fight is over and Brett Kavanaugh is the newest associate justice of the U.S Supreme Court yesterday he was in his chambers preparing for oral arguments before this newly constituted court\nBut there is still a lot of bitterness over this process Republican Senator Susan Collins was on CNN yesterday defending her vote to put cabin on on the court Collins who's a moderate say she was convinced Kavanaugh will not overturn a woman's right to get an abortion\nHe says for president along a fabulous precedent bike route to me over church\nIt would have to bend gravy a slave Ron and deeply and kind of says that he noted that Raul had been reaffirmed Nineteen years later by Planned Parenthood versus Casey said it should be extremely rare that it be overturned\nOkay a lot of questions about whether this appointment will change the court will shift the court to the right let's bring in NPR White House correspondent Scott Horsley one of many journalists were following the story over the last three months either Scott good morning to All right so we have a confirmation Kevin I was on the court\nBut let's bring in NPR White House correspondent Scott Horsley one of many journalists following the story over the last three months either Scott good morning to All right so we have a confirmation now Kevin I was on the court um what are experts analyst saying about how the court might change with him seated\nKavanaugh's placement on the court cements the conservative five four majority probably for years to come up where as Justice Kennedy the Reagan appointee the Kavanaugh will replace\nCarrying a too thanks so much we appreciate it and thank you so much this is NPR News\nThis has been called the year or the woman new Virginia delegate how often her first day\nTo day in it and I'm actually here I've actually got elected\nThe day to day that dream needed now reality I'm Sarah McConnell joined me for with good reason\nJoin us for the special edition this morning at nine here on gp baby\nBoom this fall we're counting on the participation of everyone who listens to cover the rising costs of programs we bring you an GB if we didn't hear from you during our fall fund drive there still time to support the programs that make a difference in your life\nPlease take a moment now to make an online contribution good a G. P. B. dot org and click donate at the top of the page\nYour contribution at whatever level is right for you for help cover the cost of the programs you love on cheap ...\nThank you so much for your support of Georgia Public broadcasting\nSupport for G. P. B. comes from our monthly ...\nDoes your busy life keep you from staying informed ... has you covered you can listen live a gp be news dot org and on your smart home device follow us on Facebook and Twitter at gp be news\nCheckout GB music on our website we feature videos at performances from touring artists and emerging musicians and you can see short documentaries about people who make Georgia music it's at gp news dot org\nAnd now there are nine Brett Kavanaugh's nomination to the Supreme Court divided the country and the battle for many was as much personal as was political\nWhat if anything did we learn\nAnd what changes now\nWhy did the country and the battle for many was as much personal as was political what if anything did we learn\nAnd what changes now\nNext time on one hand [noise]\nOne a is this morning at ten here on the TV and he\n\nSupport for NPR comes from this station and from the state of Jones beach crook who's ... serves as an enduring investment in the future of public radio and seeks to help NPR be the model for high quality journalism and the twenty first century\nFrom the Kennan Lucy lean and family who appreciate that for three decades NPR is help them to better understand a complex nation and world through its in depth coverage of events ideas and cultures\nFrom the ... Cooper foundation commemorating Fred Cooper by supporting public radio programming that highlights issues including diversity racism equality anti Semitism and sexism and from the William T grant foundation that W T grants foundation dot org\nIt's MORNING EDITION from NPR\nNews I'm Noel King and I'm David Greene if you have trouble sleeping will join the club and we all might be interested in a new study that suggests people with insomnia might find relief in a mobile phone app\nThere are many sleep apps out there but as NPR's Rhitu Chatterjee reports scientists say some apps are better than others try searching\nFor sleep apnea phone and you'll likely come up with a long list to get a sense of which apps people like to use we all start audience on social media and got nearly a hundred responses welcome to bedtime stories from ground that's a popular part cost Christina ... it's a Ninety Michigan depends on it\nUsing this podcast um I think each one is like maybe twenty minutes and I very rarely make it all the way through\nMen miss ... from Santa Barbara California who's had insomnia since high school she's been using an app called Inskeep for about four months\nStarts with a woman kind of telling you to relax and instructing your breathing\nBeacon mind taking and the\nThe things as it used to take four hours to fall asleep now it only takes her about twenty minutes and you'll but most of\nThese things as it used to take her for hours to fall asleep now it only takes her about twenty minutes and you know but most of these apps and pot costs don't treat the underlying insomnia says Jason on a clinical psychologist and sleep researcher at Northwestern university\nHe says those ads that are really more trying to give people relax [noise] it's usually not a very stable and sustainable solution\nThat's because they don't address the reasons why people struggle with sleep like stress anxiety or bad sleep habits\nThe most effective treatment he says is a form of talk therapy called cognitive behavioral therapy for insomnia or C. B. T. I. it helps people understand the biology of sleep and why their own habits and behaviors might be messing with it\nIs you modify your behaviors you can actually work better with the way your brain regulates we'd been waiting\nCBP I'd give people tools and tips to change those behaviors for example if someone has kept up in bed by anxiety suggest scheduling a worry time during the day this therapy also helps people sleep more efficiently say by spending less time in bed and getting out of bed if they can't fall asleep\nAn important part of the media is to teach people about what's going to give you confidence that it'll be able to sleep again is twofold is fools so that from a night the night bases they're much more likely to be sleeping\nNow people can get to the beach I directly on their mobile phones to a handful of apps and studies have shown that these apps are effective one is called sleep you\nSleep you do is like an avatar of a of a real therapist was walking a patient through that process\nOwn was a consultant for the team that develops sleep you although he has no ongoing financial interest in the product he was also the co author on a recent study in which participants reported that the insomnia symptoms an overall quality of life improved after using the app\nNo CBP I asked aren't widely available and wildly cost less than ... posts in therapy that can be pricey at twenty six week subscription of one called chateau high\nCost a hundred and forty nine dollars\nBut there is one free app developed by the Veterans Administration and it's called\nCBP I coach John ... is a psychiatrist at Harvard Medical school he recommends it to his patients that anyone can access that you don't have to be a veteran however he cautions that these apps may not work for everybody one of the problems is that people\nThe commands to his patients that anyone can access that you don't have to be a veteran however he cautions that these apps may not work for everybody one of the problems is that people don't stick with them\nThat's why he says if you find something you like use it if you find something that works I think that's always a good first up the next step he says is to talk to you Dr insomnia is a complex disorder and sometimes caused by underlying medical conditions that are easily treatable [laughter]\nBesides he says keeping your ducked informed might get some extra motivation to stick to an up and make sure you always get a good night's sleep research ... NPR News [noise]\nAll right we know that giving your mental muscles work out can help keep your brain sharp as you get older the question is what does that work out look like is it crossword puzzles is computer games to find out NPR's Jon Hamilton talked to a brain scientist about her own approach to mental fitness\nJessica Lange bombs interest in brain health is professional and personal\nMy grandfather was diagnosed with my ... when I was in graduate school and getting my PHD\nYou went on to develop Alzheimer's and letting them began to ask yourself the question\nHow can I end my career help ensure that we aren't suffering from the disease finally reached that age\nToday ... is associate director of the Alzheimer's prevention initiative at the banner Alzheimer's Institute in Phoenix and she firmly believes that staying mentally active is good for your brain but ... says she's not focusing on any single activity\nJust sitting down and getting to know go isn't probably going to be the one key thing that's going to prevent you from developing Alzheimer's disease\n... says playing a puzzle game where one of those commercial brain games is like exercising just one muscle in your body that muscle will get stronger but your overall fitness isn't going to change [noise]\n... says the brain training programs used in research studies are more promising and more strenuous they're hard a few years ago lend bomb was part of a groundbreaking study on brain training about twenty eight hundred people age sixty five and older spent more than five weeks doing exercises that tested memory reasoning and speed\nBumps as they helped a bit\nThey delay the onset of cognitive impairment they keep your brain working at the same level longer compared to people who did not receive the same kind of training interventions\nLying down says it's unclear whether brain training can also prevent Alzheimer's so I asked\nHer whether she uses a cognitive training program I don't actually I think my\nChance lying down says it's unclear whether brain training can also prevent Alzheimer's so I asked\nHer whether she uses a cognitive training program\nI don't actually I think my job is mighty like kind of training\nShe's not being flip it like a lot of people laying bomb has a job that requires intense thinking problem solving and constant learning she also has kids a family and friends which means the social areas of her brain get a daily workout\n... says mental exercises maybe most useful for people who are out of the workforce and more isolated and she has some advice for anyone looking for a way to keep their brain healthy\nIf you like crossword puzzles didn't try something new and trying something new and that brings you enjoyment key given if you don't like Jon Hamilton NPR News [noise]\nFor your health comes from exact science offering color guard for average risk adults over fifty for non invasive colon cancer screening tests that can be used at home by prescription on information at ... dot com\nWithin Seventy two hours of discovering them a California privacy law if it's an acted as we would go even further and allow consumers to sue and potentially collect enormous damages for exactly this kind of data breach\nErnesto fell ... is with the digital advocacy group the Electronic Frontier foundation\nThey don't want to entertain the possibility that there would be liable to individuals for doing some sort of harm from all the data they collect\nEarly this summer a who's who in tech attended a high level private meeting in San Francisco organized by the information technology industry council according to two people with knowledge of the meeting\nIt was there that Facebook's top lobbyist Joe Kaplan warned the executives about the threat to California privacy law posed to all of them\nIt's a California law spread to other states he said it would present an even bigger problem than Europe's privacy law so companies have decided\nAll of them it's a California law spread to other states they said it would present an even bigger problem than Europe's privacy law so companies have decided to weigh in before new laws start coming in from all fronts again privacy advocate fell ...\nYou have just this year a day to broker law from ... in in dating back even further the state of Illinois has a biometric law\nA Facebook has opposed and has been trying to amend\nThe warning at the San Francisco meetings sparked an industry wide effort to not just getting behind federal privacy legislation but to actually write it\nAnd while there's no one document that lays out to proposal yet according to two people familiar with the process the working draft so far including two things and the first uh preemption clause that would essentially override any privacy laws the state's bike paths\nAnd the second in agreement that enforcement at the law be left to the Federal Trade commission aerial Sachs Johnson of the advocacy group commonsense media says that while the FTC is a watchdog it's not a very aggressive one\nSo I don't know what the FTC can do besides like put out guides or try to go after people for violating statements that they made in their privacy policy is\nMore than a decade from now we may look back and do this past year as a watershed with respect to the issue of consumer data privacy\nLate last month officials from apple Amazon Eighteen ... testified before the Senate Commerce Committee about privacy and the need for a new federal law\nA yes or no question for each of you would your company support federal legislation to preempt inconsistency privacy laws\nAnd all the executives said they would be a senator and yes yes senator or we were ... companies are working the other end of Pennsylvania Avenue is well\nGoogle CEO soon DARPA chai was at the White House just recently and Trump economic adviser Larry Kudlow announced last week that ... lives would be back for a big meeting later in the month\nRent out a little conference the president will preside over it we will have the big Internet companies big social media companies\nA reporter at the White House as Kudlow if the invitation list would include big tech players like Facebook Google and Twitter cause of nodded and said\nThat's our hope Dina Temple Raston NPR News [noise]\n[noise]\nLater this afternoon on all things considered Philadelphia has opened a nonprofit that's planning what maybe the\nMhm [noise] later this afternoon on all things considered Philadelphia has opened a nonprofit that's planning what may be the first supervised injection site in the country you can listen by asking your smart speaker to play NPR or your local member station by name is\nJeremy hops in the conflict in Yemen has turned into a proxy war involving Saudi Arabia the U.S Iran and others it's also one of the world's great humanitarian crises with more than twenty two million people needing a David Miliband has the international Rescue Committee we'll speak with him\nThe facts aren't on your\nDay for noon to to right here on GDP [noise]\nSupport for CPB comes from you our listeners our reporters have been honored with national awards from public radio news directors incorporated for our use of sound soft feature and our coverage of breaking news thank you for your support which allows us to keep you informed about stories that impact your life\nAnd show your parts of Georgia you don't otherwise hear about count on us to bring you comprehensive coverage of the state check out our Web site at gp news dot org GB news stand with the back [noise]\nTo make the ... coming up with an excellent point we're broadcasting from Philadelphia and we'll take a deep dive into Pennsylvania's adventures and ... district day we'll have a special report from the state's newly created congressional districts and what impact does racist could have the balance of power in Congress that's coming up with an excellent point from NPR's\nCatch on point this morning at eleven mind here on the TV and GPS data to\nSupport for G. P. B. comes from our monthly sustain years\nIn this fast paced world you want to have access to news when you need it check out our Web site at gp be news dot org we've got the latest state national and international news available twenty four seven\nBut they're also in depth feature stories from across the state of Georgia you can also view video performances from great musicians in our gp the music present series\nFor information and entertainment you can count on gp the news ... news dot org\n\nWhen Leonard Cohen died in twenty sixteen he left behind many unpublished poems and lyrics which have been collected in a new book on the next fresh air we talk with his son Adam Cohen who wrote the introduction at I'm also produced you want it\nThe lyrics and some of which have been collected in a new book on the next fresh air we talk with his son Adam Cohen who wrote the introduction Adam also produced you want to darker the album his father recorded shortly before his death join us\nFresh air this afternoon at three ...\n\nSupport for NPR comes from the station and from the any e Casey foundation developing solutions to support strong families and communities to help ensure a brighter future for America's children more information is available at H. E. C. S. dot org\n[noise] and from Carnegie Corporation of New York supporting innovations in education democratic engagement and the advancement of international peace and security more information is available online at Carnegie dot org\nThis is MORNING EDITION from NPR News good morning I'm David Greene and I'm Noel King the UN's international the UN's Intergovernmental Panel on climate change or I PCC is out with a landmark and worrying new report\nIt calls for urgent action to get climate change under control and warns of dire consequences if we fail Jim ... is the co chair of the PCC working group and he's a professor at imperial college London He's with us now from South Korea where this report was released the morning is risky\nOr good morning\nThe timeline in this report is really sobering can you talk about what you found\n[noise] yeah I mean the what we were asked us to do by governments was to produce a report on sort of to homework questions one was what would be the impacts of global warming of one and a half degrees compared with global warming of two degrees\nAnd then the second part of it was what do you would need to do to get down emissions and what kind of changes to society technology would be needed to achieve the kind of goal\nAnd you know there's a very ... to ... very strong messages out of it one\nIs there are big difference in terms of the impacts of climate change at one point five and two degrees on the other one is that we really need quite radical changes to the amount of emissions we have globally a on what basically we can't wait to a to F we wait too long\nThe goal of one point five degrees would cost beyond reach\nMay I ask how long is too long\nThe weight to a to F we ate way to to loan the goal of one point five degrees would pass beyond reach may I ask how long is too long [noise] well\nUh the the the um the pledges that country's made off to the policy of even three years ago stretched to twenty theft since\n... we really need action in the time and there's a very clear message to the pledges that countries may have made or not enough if we just follow these pledges we don't try to something like three degrees warming no the one point five degrees that government solves the silicon\nSo we we need more than than what has been agreed upon more than than the nations that have set goals aimed at limiting warming of the planet and had had said I I mean are you hopeful that that's going to happen\nWell it it's really up to the government to me this report stopped with the government's they invite to the scientists to tell them about this because the policy agreement said we're going to pursue efforts towards one point five degrees\nAnd all that we can do scientists just present them with the evidence and the ... if that's what you want to do this is ... employs on the report does indeed have very strong message I mean we you know given the evidence available we couldn't\nPull punches and the messages needs really really radical changes in terms of emissions reduction if you're going to avoid all the climate change impacts that go with warming be on one point five degrees\nAt very briefly in the minute or so we have left what defines one point five degrees in two degrees don't sound like a like a very ... it doesn't sound like there's a big difference between the two um why should for one point five degrees\nBut the the the reason that the ... the ... we started in the pre industrial period in the middle of the nineteenth century\nIs MORNING EDITION from NPR News I'm David Greene and I'm Noel King [noise]\nWas Ninety seven point seven FM double your G. P. B. S. W. A. G. P. H. D. room portable Georgia Public broadcasting radio networks\nI'd be seven points over there for them WG and believes you be age three room for the Georgia Public broadcasting radio network [noise]\n[noise]\n\nLive from the G. P. B. newsroom I'm Emily Jones good morning evangelical voters helped elect President Trump and twenty sixteen and now they're mobilizing for the midterms meanwhile religious leaders on the left are also working hard to get out the vote\nWill have that story in Fifteen minutes right here on G. P. B. first today's Georgia headlines [noise]\nA city official in Warner robins will not be charged with a crime after he threatened to cut off another officials head according to the telegraph Gary leaves accused of threatening to cut off the head of city housing authority CEO show Frasier\nDuring a meeting in August Frasier was not present at the meeting which was attended by the city's mayor and other department leaders are released by the district attorney says the statement was not made with the intent to terrorize Frasier mayor Randy ... says Lee was suspended for two weeks without pay for the comment\nThe Atlanta Falcons lost their third straight game yesterday falling to the Pittsburgh Steelers by a score a forty one to Seventeen the falcons now sit in last place in the NFC South division behind Tampa Bay Carolina and New Orleans is by the team dealing with a number of injuries to key players coach Dan Quinn says that won't be used as an excuse\nIn some cases there are some on the job training and we expect that uh butter stretches our entire team decimated and by no stretch where the guys we have playing or not up and capable for the job\nAtlanta returns to Mercedes Benz stadium to face the Tampa Bay bucks on Sunday for Georgia news ... news dot org it's six oh one\nLive from NPR News in Washington ... secretary of state Mike Pompeo is claiming progress after holding talks with North Korean leader Kim Jong on NPR young but as NPR's Anthony Kuhn reports from Beijing Pompeo is now in China where frictions between the U.S and China are on display\nForeign secretary ... accused the U.S of escalating trade disputes with China forming its interests in relation to Taiwan and making baseless accusations against China's domestic and foreign policies Pompeo expressed his disagreement or ... points\nInterested in relation to Taiwan and making baseless accusations against China's domestic and foreign policy Pompeo expressed his disagreement warms points palm player was upbeat though about his meeting on Sunday with Kim Jong one\nHe said he had made progress on setting up a second summit between him and President Trump although no Dieter location as yet been announced\nNorth Korean state media meanwhile reported that Kim was optimistic because he and President Trump have what Kim called deep confidence in each other Anthony Kuhn NPR News Beijing\nRomania is effort to ban same sex marriage in its constitution has failed after not enough voters turned out for a two day referendum Joanna Kakissis reports from bill crust\nConservative group backed by the Romanian Orthodox church wanted to change the constitution to define marriage as between a man and a woman\nLet their effort failed would only twenty percent of voters cast ballots today and we're a horrendous\nPosed a referendum boycotted it they cheered when the low turnout was announced an Janelle a Villanova sees hope for her country those same sex marriage he's still banned in Romania civil code she said transgender woman\nWas my dream\nIn my column that this whole I Am\nBut she admits that will take time in the country that only decriminalize till the sexuality Seventeen years ago for NPR News I'm Joanna Kakissis in book arrest Romania\nThis year's winners of the Nobel Prize in economics are William nor house and Paul Romer for their work on climate change and innovation this is the last Nobel Prize announced this year President Trump has a full schedule of campaign rallies this week NPR's Tamara Keith reports\nTrump is well aware of the history the president's party typically takes a beating and the first midterm after he takes office Trump brings it up but just about every campaign rally saying he hopes to prove every one wrong one more time\nBy electing a Republican House and Republican Senate we all\nThis week Trump has for rallies planned with stops in Iowa Ohio Pennsylvania and Kentucky each rally winds up being a combination of touting his own accomplishments bashing potential twenty twenty opponents and boosting his favorite candidates for Congress and governor\nCamera Keith NPR News\nYou're listening to NPR News from watching\nAnd it's and boosting his favorite candidates for Congress and governor camera Keith NPR News you're listening to NPR News from Washington\nFederal and state authorities are investigating one of the worst traffic crashes and the U.S in years\nIt happens Saturday in upstate New York a limousine on the way to a birthday party failed to stop at an intersection and crashed killing all Eighteen to ... people in the vehicle and to pedestrians the crash occurred in ... New York about forty miles west of Albany [noise]\nThe unemployment rate is at its lowest level in nearly fifty years which means American retailers are might have to try a little harder to filter seasonal hiring salons this year NPR's Camila Domonoske reports\nThe beginning of autumn brings changing colors the start of the school year and a wave of temporary hires as retailers get ready for the holiday crush fifty five thousand workers for FedEx eighty thousand at Macy's target is looking for a hundred and twenty thousand but unemployment is low and American workers have more options and they used to\nConsulting firm challenger gray and Christmas says companies need to offer either competitive compensation or perks\nAmazon recently announced all its employees including temps and seasonal workers will make at least Fifteen dollars an hour and target is giving new hires the chance to win a five hundred dollar gift card ... NPR News\nMeteorologists are keeping track of tropical storm Michael of Mexico's Yucatan Peninsula it's Tom sustained winds are now sixty miles per hour as it moves towards the U.S Gulf of Mexico\nIs expected to strengthen into a category one hurricane as soon as tonight and reached the Florida Panhandle later in the week\nI'm neuron NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs\nCoverage options and more information can be found at farmers dot com and the and he Casey foundation\nGood morning thanks so much for starting your week with a MORNING EDITION on ... and Emily Jones\nI had this morning one of Pakistan's most prominent as journalists are cereal aisle Nita is expected to attend a court hearing before the high court in ... for a case surrounding accusations of treason will bring you the details on that in Fifteen minutes\nBefore the high court in law poor for a case surrounding accusations of trees that will bring you details on that and Fifteen minutes right here on G. P. B.\nIt's six oh seven\nIn orange ETV forecast cloudy skies across or just stay with temperatures in the upper eighties eighty five and don't have any seven in that\nThere's a chance of rain throughout the day especially moved day in North and middle Georgia\nRain and possible overnight as well with low then right around Seventy degree\nMORNING EDITION and on second thoughts totally fickle rewind it all things considered splits their support makes everything\nYou hear on the beep off if we didn't hear from your during our fall fund drive your contribution now still make a difference [noise] we take just a couple of minutes to support the programs you rely on them enjoy on PBS and do your part now at whatever level is right for you good a G.\nP. B. dot org and click donate and thanks so much for your support of Georgia Public broadcasting [noise]\nThis is MORNING EDITION from NPR News good morning I'm David Greene in Culver City California\nAnd I'm Noel King in Washington DC on Sunday secretary of state Mike Pompeo met with North Korea's leader Kim Jong on in the north Korean capital both sides say there has been some success in working toward nuclear disarmament and in setting up a second summit between Kim and President Trump\nBut then pump pales trip ended on what seems like a down notes because he stopped to talk to officials in Beijing\nAnd tensions between the U.S and China came up NPR's Anthony Kuhn is with me now from Beijing I up any good morning and we'll start at the beginning pump ailing Kim said they made some progress in this meeting what do they what do they mean by progress\n[noise] well they mean may seem to have narrowed down options as far as the time and date a time and place for the talks are concerned we don't know if they're going to be before after November midterm elections in the U.S\nAre pumping said that you know if they can get this meeting together they expect real progress at a second summit and Kim Jong one speaking to North Korean state media was even more up BP called who's talks with Pompeo productive in wonderful those talks he said include denuclearization and other issues\nIt was even more upbeat he called his talks with Pompeo productive and wonderful those talks he's that include denuclearization and other issues and he said that he was optimistic about the way things are going with the U.S because he and President Trump have deep confidence in each other\nThis is NPR News and this is MORNING EDITION\nOn cheap ... good morning I'm Emily Jones Jamal ... is a prominent Saudi journalist and contributor to the Washington Post\nAnd he has disappeared and is fear debt more of a conversation with one of his editors at the post about what may have happened to him that's in Fifteen minutes right here on gp wearing Eighteen station radio network of Georgia Public broadcasting certain Crawford ville and beyond\nIt's six twenty\nOne of the most important to George George ... is you know early voting on our our ... you begin to firm up your choices rewind Pamela insiders\nWill be your four days a week [noise] help guide you through races from the top of the ballot down to the bottom to join me in our panels or do you do for the latest election\nSupport for CPB comes from you our listeners and the historic Sam short line railroad Thomas the tank engine visits the same short line train at Georgia veterans state park and ... October Nineteen twenty first plus the twenty seventh and ... tickets at Sam short line dot com\nAnd the ... theater and AC Entertainment presenting rain a tribute to the Beatles in celebration of Abbey Road march thirteenth than Augusta's Miller theater tickets on sale now at the Miller box office and Miller theater Augusta dot com we do usually hear music by Richard Wagner legs is\n... tunnel boys are as stride piano on the next performance today from a pm\nNight eight till ten right here on your TV station [noise]\nSupport for NPR comes from the station and from CBS with the circus American Experience explores the rise and fall of the big top and its influence on entertainment and the U.S the circus or tonight event premieres tonight at nine eight central on PBS\nFrom cancer treatment centers of America working to outsmart can search for the use of genomic testing to profile each individual's cancer and revealed possible treatment options learn more about precision cancer treatment a Cancer Center dot com\nAnd from gobble ... company that delivers semi corrupt meals to be finished at home in Fifteen minutes with one pan ... chefs do the prep work like chopping and marinating this week's menu is at ... dot com slash NPR\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Noel King one of Pakistan's most prominent reporters was in court today in a case that involves allegations of treason and sedition\nThe reporters name is Cyril al meta and the cases raising concerns about freedom of speech in Pakistan and peers de ... from Islamic bought idea\nHigh that so tell us about cereal or a meta who is he so he's a\nColumnist for new type of call dawn it's an English language newspaper and it's widely read by Pakistan's liberal elites and omega made a name for himself two years ago when he authored a story\nThat suggested that Pakistan's powerful military had been preventing the government from cracking down on militant groups based in the country Pakistan's broadly accused of harboring these Islamic militant groups that have conducted cross border attacks into neighboring India and Afghanistan\nAnd there was a lot of fallout from the article on NATO was briefly banned from traveling outside the country the information minister to resign\nAnd even though the newspaper said it stood by the story it had to publish a lengthy a denial by the prime minister's office\nSays that bombshell report is is how he came to public attention but that's not the story that he's in court over right nice so he probably\nAll right so that bombshell report is is how he came to public attention but that's not the story that he's in court over right\nNow are you so he published another story in may this year and it was an interview with the former prime minister and in that article the prime minister himself bought up the Mumbai attacks of two thousand and night and you might remember these well particularly gruesome attack say targeted hotels and a Jewish center in India ah terrorists killed dozens of people\nAnd the prime minister suggested that the attackers had been based in Pakistan now this isn't controversial abroad but in Pakistan eat created all sorts of outrage and a lawyer filed a petition to one of the high court hit\nAnd what essentially he's off in the high court to do is older the government to investigate the former prime minister for treason\nAnd he's also asking the high court to investigate I'll meet up for something called a ... which is basically that on me to somehow involved in these alleged treason\nAnd I spoke to the lawyer his name is ... uh yesterday and he said if he can find a if only to is found guilty of connive and he'll pursue more serious charges of edition against him and that carries a hefty jail time in ... I mean I think it's easy to forget\nThat Pakistan has been known for a pretty robust press a how journalists they're feeling about all this\n[noise] there's a lot of concern right now because it comes to the context of a growing cracked down on freedom of speech impacts Don\nI spoke to I'm On my ... she's the deputy director of full Amnesty International in South Asia and he was also a reporter here for many years before that and he says now is probably the worst it's been for years they've been attacks on journalists they've been pressure for some journalists to leave the country\nAnd um broad causes of had the outlet scrambled doing itself the newspaper had its distribution prevented in ... for the country and so yeah this case is being viewed with a lot of concern and Mari very briefly on me to was in court today what happened\nSo um it was quite cold case they are now being another hearing set for later this month on me that had briefly um being banned again from leaving the country and arrest warrant had been issued against him those are both being dropped but the case against him continue NPR's da de de de ...\nOr ... mania an effort to ban same sex marriage has failed to a referendum that would have changed the constitution and the social conservative country in the European Union\nIn Romania an effort to ban same sex marriage has failed this was a two day referendum that would have changed the constitution and the socially conservative country in the European Union\nBut not enough voters showed up over the weekend that invalidated any result this is a slap in the face for the Romanian Orthodox church which has warned that western liberals and you are forcing their values on the east coast you Erica kisses for ... God\nMany churchgoers in this post communist said he retired engineer Maurice toothbrush opposes same sex marriage I don't like the ... men and women was warmer\nIt's not enough for him that same sex marriages already banned in Romania civil code a problem I is that going as long as that code can be changed he sat so we need something\nMore leaders of the ... or hit on her shoulder soldiers that defining marriage as between a man and a woman saving the traditional Romanian family arch deacon unit ... says it's about children\nAnd as he every child has the rights to be raised and born mean so many like from mother and the phones that are like all the children that have ever being born\nThe church strongly backed an amendment to Romania is constitution it was pushed by conservative activists were advised by liberty counsel US Organization which opposes same sex marriage\nDirt behind old ... months in Eastern Europe\n... runs mosaic and algae Beatty rights group and ...\nWhat we're witnessing is this sort of a ... between these extremist American groups and local indigenous conservative groups trying to push forward their agenda [noise]\nTwenty four year old living at a closed down with friends at a boycott party and the ... club before the vote\nI came here because I'm a lesbian\nAnd I don't think that we shouldn't be perceive that people that are plaguing our society they think that we are some sort of the general raised that we are they are trying to like allies homophobia\nCommunications consultant ... ... is bisexual he's noticed a rise and homophobia and the weeks before\nThe vote ever to start to ever express any use that word pro as you'd be the what's fair game for hate that\nCome Sunday walking\nThe dog Oscar at the park near Boop arrests opera house it disrupts\nOf them do this and he's been Sunday walking the dog Oscar at the park near booth arrests opera house\nThis referendum doesn't this I Would remember these days is the second most important thing in my life of the printed December nights and eight to nine when the communist regime\n[noise] Romania did not decriminalize homosexuality until two thousand\nOne and only then because it was a precondition for entering the European Union Mario's to fish the retired engineer blamed the EU for pushing liberal values on his country and they turn off was that all of the nation look my daughter lives in the Netherlands now he says and we fight every day over same sex marriage [noise]\nAcross town a gay club broke out in the years when the TV news declared the mares referendum Gen\nSame sex marriage in Romania is still illegal but tonight\nThere was no change to the constitution for NPR News I'm Joanna Kakissis in ... Romania\nYou know it's still often I'm Still do pick a president Pfizer role he really wanted to guide ... print the really really loved Saudi Arabia I think and he just he just wanted to write he didn't want to be a dissident who didn't want to give opposition figure he just wanted to be free to express what he thought was his\nVersion of the truth about Saudi Arabia is past present and future and I think that's what I mean it's hard to deal with uh\n[noise] and I'm Tim we'll hope for the best um turn into mobile opinions under for the Washington Post and has been working with cars so did his editor thank you so much for your time\nThank you David [noise] we're going to go now to a tragic story from upstate New York twenty people are dead after a limousine crash this weekend Lucas Willard of member station WAMC has the story\nOn Saturday afternoon an SUV stretch limousine was carrying Eighteen people through the rural town of ... about forty miles west of Albany the two thousand one Ford Excursion limo went through the intersection of New York state route thirty and thirty eight\nOf Albany the two thousand one Ford Excursion limo went through the intersection of New York state roots thirty and thirty a National Transportation Safety Board chair Robert Sumwalt said the crash is one of the worst he's seen in his twelve years on the NTSB\nFor this is the most deadly transportation accident in this country since February of two thousand and not\nA two thousand nine plane crash near buffalo killed fifty people state police first deputy superintendent Christopher Fiore told reporters Sunday afternoon all of those killed in ... Harry we're adults\nLimousine traveled across the intersection into a parking lot ... two thousand Fifteen Toyota Islander that was an occupied and parts\nTo ... standing nearby\nWere also struck and killed\nEveryone inside the limo was killed as a Sunday afternoon state police had not released the identities of the victims pending notification of the families the names had started to emerge Amy Dunlop Johnson who identified herself as a cousin of two people inside the limo said the group was celebrating\nMy wife I'm going to be tending turkey [noise] um how old were um they ... they were going online or you can winery and\nOfficials are still trying to figure out what caused the accident\nSky Harry town supervisor Alan ... drove by the scene on his way to church Sunday Morning he called the intersection at the bottom of a steep hill dangerous Kevin ... says the town has complained to the state Transportation Department about safety issues\nAbout four years ago they finally band tractor trailer from the uh the sight rows were thirty coming down because at least two instances where the tractor trailers lost their breaks and went through the intersection\nThe accident is sure to have a lasting impact on the farming community of about three thousand\nIt it it's just a tragedy it really is it's an incredible number of people made a small\nCommunity vigil is planned for Tuesday evening NTSB staff will remain in school Harry throughout the week for NPR News I'm Lucas Willard in Albany New York\n\n\nOh\nThis is NPR News\n\nServing Anderson villain beyond ... an Eighteen station radio network of Georgia Public broadcasting good morning I'm Emily Jones\nScientist with the inter governmental planet panel on climate change or in South Korea discussing what needs to be done to stop global temperatures from rising by more than one point five degrees Celsius\nWhy that exact number the marketplace morning report has the story plus all the morning's business news in eight minutes right here on gp in Georgia does business news this ban Hilton Head international airport is getting a seven point six million dollar grant to upgrade its facility\nIt's been a morning news reports the span of airport commission recently voted to accept a grant from the Federal Aviation administration\nIt'll fund a terminal apron expansion project the commission's executive director says the project will provide space for an upcoming terminal expansion as well as critical space for overflow aircraft parking\nIs his G. P. B. S. six forty four [noise]\nAnd now there are nine Brett Kavanaugh's nomination to the Supreme Court divided the country and the battle for many was as much personal as was political\nWhat if anything did we learn\nAnd what changes now\nMixed up on one [noise]\nThis morning at ten here on gp [noise]\nSupport for G. P. B. comes from our monthly ... and the Georgia brain and spinal injury trust fund commission advising that a traumatic brain injury as one cause by an external physical force such as a car accident fall or sports the commission can help details B. S. I. T. S. dot George adopt golf\nAnd river Center for the performing arts in Columbus presenting the wizard of Oz Dorothy Toto traveled all over the rainbow to find find on the yellow brick road in this beloved musical October sixteenth and seventeenth tickets at river center dot org\n[noise]\n\nThere's a reason to our days in a reason to our evenings as well our routine that'd be selling for the night I'm Sarah that and I invite you to make my party [noise]\nAnd to our evenings as well routine [noise] I'm Sarah how can they not part of your\nHobby here tonight and every Monday through Wednesday at ten pm tonight can support each [noise]\n\nSupport for NPR comes from the station and from logged me in makers of go to meeting a collaboration meeting platform that comes equipped with features to help people stay focused to get work done learn more it go to meeting dot com\nFrom the main office of tourism offering travelers an opportunity to explore and discover their very own main thing to be inspired the original and be yourself a visit main dot com\nAnd from the ISI MC foundation at ISI MC foundation dot org\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Noel King good morning It's MORNING the winners of the Nobel Prize in economics were announced the prize will be split by two economists William Nord house and Paul Romer\nNick fountain from our planet money podcast is with me now to morning Nick happy ... Nobel day before we get to the winters we should clarify something or I Know we will get emails from economists it's not actually the Nobel Prize in economics right\nYes uh I'm gonna try to pronounces right now it's the spirit ... reeks bank prize in economics sciences in memory of Alfred Nobel and that's for a bunch of political reasons but also because economics really wants to be known as a science and with this year's pick they went straight towards ...\nIt's interesting one of the economist William ignored house is known for talking about the economy and climate together\nRight he's an economist at Yale and he's been thinking about how the economy interacts with the environment and climate for decades now this morning I called up Justin Wolfers she's an economics professor at the University of Michigan and he explained his work to me\nIt can survive is if you leave it alone won't get good outcomes on the environment for the region is every time you fire up your factory your thinking about your profits but at the same time you stupid on my greenhouse gases\nAnd so north houses work or is about how we need incentives to push us in the right direction like things like cap and trade for instance\nReally interesting choice and how about his co winner Paul Romer what does he known for right quick aside here\nThe right direction like things like cap and trade for instance\nSome really interesting choice and how is that his co winner Paul Romer what is he known for\nRight quick aside here Paul Romer works at NYU she got a couple of calls this morning but he did not answer them\nI guess two phone calls this morning and I didn't answer either warm because I thought it was some damn call so I I wasn't I wasn't expecting it deprives\nAnyways his work is about growth and why economies grow and and his question is will they grow forever and Justin Wolfers explained to me that his research says it's ideas that make economy to grow\nOld in size is that the infrastructure of creating new ideas is the engine of economic growth\nTony attention to passage number of scientists throughout their incentives to do science as as long as we can get generating new ideas with her to become\nSo in both of these choices endured house in Rome or the Nobel Committee this year is saying this work about making government stink about how to make have the right incentives for people to do things that we want them to do to prevent climate change to continue to grow that stuff is really important\n[laughter] hey nicotine is worth noting the economics Nobel is celebrating it fifty year this year and yet only one woman has ever won the prize\nRight a lot of people thought that we might have another woman this year the only woman is Eleanor or oh strum ... she won the Nobel in two thousand nine and you know fifty years is a long time for a only one woman\nNPR's Nick fountain from our planet money team Nick thanks so much thanks though [noise]\nNinety seven forty seven FM W. A. G. P. B. S. W. A. G. P. H. D. room portable Georgia Public broadcasting radio network [noise]\nIf you'd be age the room portable Georgia Public broadcasting radio network [noise]\n\nLive from the TPP newsroom I'm Emily Jones good morning ahead we'll talk with a former White House advisor about the future of the Supreme Court and Republican strategy following the controversial appointment of justice Brett Kavanaugh to the Supreme Court that's ingest under ten minutes but first today's Georgia headlines\nThe two candidates for state school superintendent have differing views on whether teachers should be allowed to carry guns in the classroom TV's Stephen Fowler reports on the Atlanta press club debate\nDemocrat older Thornton said teachers should not be armed and schools need to tackle things like mental help to prevent gun violence\nImagine the years that we've wasted and not providing those services and causing vows to increase in our schools are not addressing the mental social emotional needs ... students incumbent\nRepublican Richard woods agreed more needs to be done with the so called wraparound services but it's up to local school districts that aside incumbent Republican Richard what's agreed more needs to be done but so called wraparound services but said it's up to local districts to decide\nThis was not Amanda were not mandate any teacher from being arms so that has to be a choice on both ends\nThe whole debate is on line and G. P. B. news dot org for G. P. V. News I'm Stephen Fowler in Atlanta\nAnd sports the Atlanta Braves kept their season alive last night with a six five win over the LA Dodgers the Braves were led by twenty year old Ronald ... junior and became the youngest player in baseball history to hit a grand slam the playoffs\nAtlanta must win back to ... to advance in the playoffs while the Dodgers only need one more victory to end this theory\nThey play today at four thirty\nLive from NPR News in Washington ... the Nobel Committee today awarded it's twenty Eighteen prize for economics it's being shared by William Nord house of Yale and Paul Romer of New York university there work focuses on climate change innovation\nThe UN led Intergovernmental Panel on climate change is warning disastrous effects of climate change are happening now co chair Jim ... says the world must take immediate action\nThe evidence available we couldn't punches in the messages it needs really really radical changes in terms of emissions reduction if you're going to avoid\nWe couldn't pull their punches in the messages it needs really really radical changes in terms of emissions reduction if you're going to avoid all the climate change impacts that goal was warming be on one point five degrees\nThat's one point five Celsius scientists say limiting increases to that number would reduce flooding and gives people time to adapt to climate change\nIndonesian authorities now say more than Nineteen hundred people died in an earthquake and tsunami ten days ago they say thousands are still missing and feared dead the quake measured seven point five and hit the small city of Palo unsettled lays the island\nPolitician from the far right when it commanding lead in Brazil's presidential election yesterday but as NPR's Philip Reeves reports he failed to secure an outright victory and the first round setting up a runoff election\nVeteran congressman and retired army captain shy about so NATO needed bowls and fifty percent of the valley of votes\nTo win the presidency of Latin America's largest democracy outright he came close with just under forty seven percent after almost ... votes were counted in Rio is supposed to celebrate it as if he was this contest I'll go to a runoff which also face financial ... from a leftist workers' party\nThe stand in for Brazil's former president Luiz ... Lula da Silva who's in prison for corruption\nThis election's opened deep divisions of Brazil between those who think both NATO will combat rampant crime and corruption and others are United by his ... racist comments on his admiration for Brazil's pass military dictatorship for the Braves NPR News British and into\nThe Trump Administration is preparing to publish propose rules that could denying green cards to immigrants they use a wide range of public benefits NPR's Joel Rose reports the rules are set to be published this week\nThe Trump Administration says it's trying to ensure that immigrants are self sufficient by enforcing a longstanding law that immigrants cannot be a quote public charge\nUnder the proposed rules legal immigrants could still use public benefits like food assistance and medicate but for the first time that would count against them if they try to get a green card or bring relatives to join them in the u._s.\nPublic health officials worry that many immigrants will be afraid to use any kind of public assistance at all which could hurt both immigrants and public health once the proposal is formally published in the federal register the public will have sixty days to comment Joel Rose NPR News\nThis is NPR News\nSecretary of state Mike Pompeo\nOf sixty days to comment Joel Rose NPR News this is NPR News\nSecretary of state Mike Pompeo says he and North Korean leader Kim Jong on made significant progress towards an agreement for North Korea to give up its nuclear weapons\nHe said he expects more results after another summit between Kim and President Trump which is not yet been scheduled Pompeo spoke today in Seoul after meeting with Kim and beyond young yesterday Pompeo then left for ... for talks with Chinese officials\nTurkey's president says he's personally of following the investigation into the disappearance of a journalist from the Saudi consulate in Istanbul last week NPR's Peter Kenyon reports anchor is demanding answers from Riyadh about that said I'm Jamal because show getting Lucy the\nVictims do speaking to reporters in our current president ... once said he's still hopeful for what he called a positive outcome for ... who entered the Saudi constantly last Tuesday and hasn't been seen since Saudi officials deny any wrongdoing and say they're just as eager to learn what happened to the show as anyone else\nTurkish police are pursuing two possibilities that could show the who left the king of last year for the U.S was kidnapped and spirited out of the country or that he was killed in his body disposed of\nPeter Kenyon NPR News is to handle\nA referendum against same sex marriage failed in Romania this weekend it would have changed the constitution to define marriage as being only between a man and a woman and needed at least thirty percent of eligible voters to cast ballots but only twenty four percent did\nSame sex marriage is still prohibited by statute some conservative groups had urged the constitution be amended to prevent same sex unions should the lobby change from the future I'm nor rom NPR News\nSupport for NPR comes from Viking dedicated to bringing the traveler closer to their destination Vikings new custom build ocean fleet offers a small ship experience with all veranda spate rooms and short excursions report Viking Cruises dot com and the Emmy Casey foundation\nGood morning thanks so much for starting your week with MORNING EDITION ... and then only gallons research shows that brain training exercises can help people stay sharp as they age\nThey delay the onset of cognitive impairment they keep your brain working at the same level longer compared to people who did not receive cognitive training\nTips on mental fitness from a brain scientist in twenty minutes right here on ...\nLonger compared to people who did not receive cognitive training\nTips on mental fitness from a brain scientist in twenty minutes right here on ... it's seven I sat in [noise]\nIn your in t._v. forecasts cloudy skies across or just stay with temperatures in the upper eighties eighty five and don't eighty seven\nHere the chance of rain throughout the day especially midday and north and middle Georgia\nRain as possible overnight as well live alone fame right around that need to bring [noise]\nThis fall we're counting on the participation of everyone who listens to cover the rising cost of programs we bring you an GB if we didn't hear from you during our fall fund drive there still time to support the programs that make a difference in your life please take a moment now to make an online contribution to put a gp dot org and click donate at the top of the page\nYour contribution at whatever level is right for you will help cover the cost of the programs you love on cheap ...\nThank you so much for your support of Georgia Public broadcasting\nIt's MORNING EDITION from NPR News I'm Noel King in Washington DC\nAnd I'm David Greene in Culver City California Brett Kavanaugh was sworn into the U.S Supreme Court over the weekend ending a toxic confirmation process\nThe fifty to forty eight Senate vote to confirm was one of the closest in history and it felt largely along party lines with only one Republican voting against Kevin on one Democrat voting in his favor\nNow there's debate over how cabinet appointment might impact the mid term elections in November and joining us now is mark ... he's a former special assistant\nTo President Trump and also an adviser to the president's twenty twenty campaign he joined us from our New York studios I missed a lot of good morning or good morning thanks for having right well thanks for coming on so I Know President Trump is going to be holding rallies and supportive Republican candidates throughout this this month's as we get closer to the election how will just as Kevin is apartment play into his message\nI think it'll it'll it'll be a major motivator for Republicans is another problem is made promise kept the president ran in twenty sixteen or on delivering and nominating conservative people who who believe in the constitution and the rule of law the way it's written so it will be seen as a major victory amongst Republicans\nYesterday I'm Senator Susan Collins Republican of Maine defended her vote in favor of Kavanaugh's nomination and said this on CNN about the Nineteen Seventy three Supreme Court case that legalized abortion\nI Do not believe that Brett Kavanaugh\nIt's kind of knows nomination and said this on CNN about the Nineteen Seventy three Supreme Court case that legalized abortion\nI Can't believe that Brett Kavanaugh will overturn all the time\n\nOr this is NPR News\nAnd this is MORNING EDITION ... an Eighteen station radio network of Georgia Public broadcasting serving America's and beyond good morning I'm Emily Jones\nI had this morning why the tech industry is moving to craft a federal legislation that would preempt states data privacy laws love the story in twenty minutes right here on GAPP\nIt's seven twenty\n\nOne of the most important is your job actually ... if you drink early voting on on the ... and you begin to for your choices rewind Pamela insiders\nWill be here for four days a week he'll argue races from the top of the ballot down to the bottom to join me in our panels or do you do for the latest election news his\n\nSupport for ... comes from our monthly sustain hers and Newtown making tour of progress Wednesday October tenth in downtown making offering the chance to explore recent and future development projects in the area\nFull details at Newtown making dot com slash tour and middle Georgia State university offering a fully on my master's degree and information technology with concentrations in critical infrastructure management cyber security and digital forensics middle Georgia State visit MTA dot edu slash I. T. [noise]\nAnd now there are nine Brett Kavanaugh's nomination to the Supreme Court divided the country and the battle for many was as much personal as was political what if anything did we learn\nAnd what changes now\nNext time on one [noise]\nOne a is this morning at ten here on the TV and he said\nNext time on one [noise]\nOne a is this morning at ten here on the TV and he\n\nSupport for NPR comes from the station and from universal pictures presenting the new film first man from Damien ... director of la la land and whiplash and starring Ryan Gosling and Claire foie in theaters and IMAX friday\nFrom logged me in makers of go to meeting proud sponsor of the how I built this entrepreneur summit taking place in San Francisco at the ... center October sixteenth more about the summit at NPR dot org slash summit\nFrom Jones Day an integrated partnerships collaboratively providing legal services for more than a century forty three offices five continents serving clients says one from worldwide learn more at Jones Day dot com\nAnd from the any each case the foundation\nIt's MORNING EDITION from NPR\nNews I'm Noel King and I'm David Greene if you have trouble sleeping will join the club and we all might be interested in a new study that suggests people with insomnia\nMight find relief in a mobile phone app there are many sleep apps out there but as NPR's Rhitu Chatterjee reports scientist say some apps are better than others\nTried searching for ... from your phone and you'll likely come up with a long list to get a sense of which apps people like to use we all start audience on social media and got nearly a hundred responses welcome to bedtime stories for ground that's a popular part cost Christina ... Michigan depends on it\nUsing this podcast um I I think each one is like maybe twenty minutes and I very rarely make it all the way through\nMendez peach piecing from Santa Barbara California who had insomnia since high school she's been using an app called Inskeep for about four months\nStarts with a woman kind of telling you to relax and instructing your breathing\nBacon mind taking and long\nThese things as it used to take her for hours to fall asleep now it only takes her about twenty minutes but most of these apps and pot cost doing to treat the underlying insomnia says Jason on a chemical psychologist and sleep research\nBut most of these apps and pot cost don't treat the underlying insomnia says Jason on a clinical psychologist and sleep researcher at Northwestern university\nSays apps that are really more trying to give people relax [noise] it's usually not a very stable and sustainable solution\nThat's because they don't address the reasons why people struggle with sleep like stress anxiety or bad sleep habits [noise]\nThe most effective treatment he says is a form of talk therapy called cognitive behavioral therapy for insomnia or C. B. T. I. it helps people understand the biology of sleep and why their own habits and behaviors might be messing with it\nIs you modify your behaviors you can actually work better with the way your brain regulates we'd been waiting\nCBP I'd give people tools and tips to change those behaviors for example if someone has kept up in bed by anxiety suggest scheduling a warning time during the day this therapy also helps people sleep more efficiently say by spending less time in bed and getting out of bed if they can't fall asleep\nAn important part of the media is to teach people about what's going to give you confidence in him being able to sleep again is to follow these rules so that from a night tonight bases they're much more likely to be sleeping\nNow people can get to the beach I directly on their mobile phones to a handful of apps and studies have shown that these apps are effective one is called sleep you\nIn sleep you know is what can I have a ... of a real therapist was walking a patient through that process\nWas a consultant for the team that develops sleep you although he has no ongoing financial interest in the product he was also the co author on a recent study in which participants reported that their insomnia symptoms an overall quality of life improved after using the app\nNo CBP I asked aren't widely available and wildly cost less than ... posts in therapy that can be pricey at twenty six weeks subscription of one called shut die costs hundred and forty nine dollars\nBut there is one free app developed by the Veterans Administration and is called\nC. B. T. I coach John ... is a psychiatrist at Harvard Medical school he recommends it to his patients anyone to access that you don't have to be a veteran however he cautions that these apps may not work for everybody one of the problems is that people don't stick with them\nThat's why he says if you find something you like use it if you find something that works I think\nBuddy one of the problems is that people don't stick with them that's why he says if you find something you like use it if you find something that works I think that's always a good first up the next step he says is to talk to you Dr insomnia is a complex disorder and sometimes caused by underlying medical conditions that are easily treatable [laughter]\nBesides he says keeping your ducked informed might get some extra motivation to stick to an up and make sure you always get a good night's sleep research ... NPR News [noise] All right\nWe know that giving your mental mussels a workout can help keep your brain sharp as you get older the question is what does that work out look like is it crossword puzzles is computer games to find out NPR's Jon Hamilton talked to a brain scientist about her own approach to mental fitness\nJessica Lange bombs interest in brain health is professional and personal\nMy grandfather was diagnosed with my ... when I was in graduate school and getting my PHD\nHe went on to develop Alzheimer's and laying them began to ask yourself the question\nHow can I in my career help ensure that we aren't suffering from that disease finally reached that age\nToday ... is associate director of the Alzheimer's prevention initiative at the ... year old timers Institute in Phoenix and she firmly believes that staying mentally active is good for your brain but ... says she's not focusing on any single activity\nJust sitting down and getting to know go isn't probably going to be the one key thing that's going to prevent you from developing Alzheimer's disease\n... says playing a puzzle game where one of those commercial brain games is like exercising just one muscle in your body that muscle will get stronger but your overall fitness isn't going to change\n... says the brain training programs used in research studies are more promising and more strenuous they're hard a few years ago lend bomb was part of a groundbreaking study on brain training about twenty eight hundred people age sixty five an older spent more than five weeks doing exercises that tested memory reasoning and speed\nPlaying them says they helped a bit the delay\nThe onset of cognitive impairment they keep your brain working at the same level longer compared to people who did not receive the same kind of training interventions\nLying down says it's unclear whether brain training can also prevent Alzheimer's so I asked\nHer whether she uses a cognitive training program\nI don't actually I think my job is mighty like kind of training\nNot being flip it like a lot of people laying bum has a job that requires intense thinking problem solving and\nProgram I don't actually I think my job is mighty like kind of training\nShe's not being flip it like a lot of people laying bum has a job that requires intense thinking problem solving and constant learning she also has kids of family and friends which means the social areas of her brain get a daily workout\n... says mental exercises maybe most useful for people who are out of the workforce and more isolated and she has some advice for anyone looking for a way to keep their brain healthy\nIf you like crossword puzzles didn't try something new and trying something new and that brings you enjoyment is key don't do it if you don't like Jon Hamilton NPR News [noise]\nFor your health comes from exact science is\nOffering color guard for average risk adults over fifty non invasive colon cancer screening tests that can be used at home by prescription over information and hold our pest dot com [noise]\nWithin Seventy two hours of discovering them a California privacy law if it's an acted as we would go even further and allow consumers to sue and potentially collect enormous damages for exactly this kind of data breach\nErnesto fell ... is with the digital advocacy group the Electronic Frontier foundation\nThey don't want to entertain the possibility that they would be liable to individuals for doing some sort of harm from all the data they collect\nEarly this summer a who's who in tech attended a high level private meeting in San Francisco organized by the information technology industry council according to two people with knowledge of the meeting\nIt was there that Facebook's top lobbyist Joe Papp and warned the executives about the threat to California privacy law posed to all of them\nIs a California law spread to other states he said it would present an even bigger problem than Europe's privacy law\nSo companies have decided to weigh in before new laws start coming in from all fronts again privacy advocate fell ...\nHave just this year a due to broker law from ... in in dating back even further\nStart coming in from all fronts again privacy advocate fell ... you have just this year a data broker law from Vermont and dating back even further the state of Illinois has a biometric law\nA Facebook has opposed and has been trying to amend the warning at the San Francisco meeting sparked an industry wide effort to not just getting behind federal privacy legislation but to actually write it and while there's no one document that lays out to proposal yet\nAccording to two people familiar with the process the working draft so far including two things\nAnd the first uh preemption clause that would essentially override any privacy laws ... states bike paths\nAnd the second in agreement that enforcement at the law being left to the Federal Trade commission aerial Sachs Johnson of the advocacy group commonsense media says that while the FCC's a watchdog it's not a very aggressive one\nSo I don't know what the FTC can do besides like put out guides or try to go after people for violating statements that they made in their privacy policy is\nMore than a decade from now we may look back and do this past year as a watershed with respect to the issue of consumer data privacy\nLate last month officials from apple Amazon Eighteen tea and Twitter testified before the Senate Commerce Committee about privacy and the need for a new federal law\nA yes or no question for each of you would your company support federal legislation to preempt inconsistency privacy laws\nAnd all the executives said they would be a senator and yes yes senator senator we were ... companies are working the other end to Pennsylvania Avenue is well\nGoogle C. E. O. soon DARPA chai was at the White House just recently and Trump economic adviser Larry Kudlow announced last week that tech executives would be back for a big meeting later in the month\nWe're going to have a little conference the president will preside over it we will have the big Internet companies big social media companies\nA reporter at the White House as Kudlow if the invitation list would include ... players like Facebook Google and Twitter cut them nodded\nAnd said that's our hope Dina Temple Raston NPR in [noise]\n[noise]\n\n[noise] [noise] this is NPR News\nWell [noise]\nThis is NPR News\n[noise] you're listening to MORNING EDITION on cheap ... good morning I'm Emily\nJones I had this morning gender bending singer Sylvester had a single forty years ago that would become an algae B. T. Q. anthem you make me feel mighty real elitist any American Anthem series in eight minutes right here on the\nTV [noise] [noise] this\nFall we're counting on the participation of everyone who listens to cover the rising costs of the programs we bring you ...\nIf we didn't hear from you during our fall fund drive there still time to support the program that make a difference in your life please take a moment now to make an online contribution just go to ... dot org and click donate at the top of the pay your contribution at whatever level is right for you will help cover the costs of the programs you up on G. P. B. [noise]\nThank you so much for your support and [noise]\nI make the talk of already coming up next on point we're broadcasting from Philadelphia and we'll take a deep dive into Pennsylvania's adventures and ... district day we'll have a special report from the state's newly created congressional districts and what impact those races could have the balance of power in Congress that's coming up with an excellent point from NPR\nThis morning at eleven ...\nSupport for ... comes from generous listeners like you and Carlyle place and making by now doesn't help the fully accredited life plan community in central Georgia offering active seniors and maintenance free lifestyle and the security of having a plan should healthcare needs change Carlisle place dot org\nAnd the Miller theater and a sea entertainment presenting rain a tribute to the Beatles in celebration of Abbey Road march thirteenth Augusta's Miller theater tickets on sale now at the Miller box office and Miller theater Augusta dot com\n[noise]\nTouchdown John Milton it'll be the main commodity that football isn't justice for here in the south it's a way of life every Friday I traveled stay covering high school for for the DVD but there's still a lot to talk about joined me both parties in Georgia podcast available on DVD dot org and wherever favorite potash around\nHe was still a lot to talk about joined me a little of both parties in Georgia podcast available on GV and wherever ... around [noise]\nSupport for NPR comes from this station and from PBS with the circus American Experience explores the rise and fall of the big top and its influence on entertainment and the U.S the circus that tonight event premieres tonight at nine eight central on PBS\nAnd from it lost him a collaboration software company powering teams around the world committed to providing the tools and practices to help teams plan track build and work better together more at at Lausanne dot com\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Noel King one of Pakistan's most prominent reporters was in court today in a case that involves allegations of treason and sedition\nThe reporters name is Cyril al meta and the cases raising concerns about freedom of speech in Pakistan and ... with me now from his momma bought idea\nHigh that so tell us about cereal or a meta who is he\nSo he's a columnist for a newspaper called dawn it's an English language newspaper and it's widely read by Pakistan's liberal elites and omega made a name for himself two years ago when he also the story\nThat suggested that Pakistan's powerful military had been preventing the government from cracking down on militant groups based in the country Pakistan's broadly accused of harboring these Islamic militant groups that have conducted cross border attacks into neighboring India and Afghanistan\nAnd there was a lot of fallout from the article on NATO was briefly banned from traveling outside the country the information minister to resign and even though the newspapers that it stood by the story it had to publish a lengthy a denial by the prime minister's office\nAre said that bombshell report is is how he came to public attention but that's not the story that he's in court over right\nNice so he published another story in may this year and it was an interview with the former prime minister and in that article the prime minister himself bought up the Mumbai attacks of two thousand a night and you might remember these well particularly gruesome attacks I targeted hotels and a Jewish center in India\nAh terrorists killed dozens of people and the prime minister suggested\nSo these were particularly gruesome attacks targeted hotels and a Jewish center in India\nAh terrorists killed dozens of people and the prime minister suggested that the attackers had been based in Pakistan now this isn't controversial abroad in Pakistan eat created all sorts of outrage and a lawyer filed a petition to one of the high court hit\nAnd what essentially he's off in the high court to do is older the government to investigate the former prime minister for treason\nAnd he's also asking the high court to investigate I'll meet up for something called a ... which is basically that I'll meet I somehow involved in this alleged treason\nAnd I spoke to the lawyer his name is ... uh yesterday and he said if he can find a if only to is found guilty of connive and he'll pursue more serious charges of edition against him and that carries a hefty ... I mean ...\nI mean look I think it's easy to forget that Pakistan has been known for a pretty robust press a how journalists they're feeling about all this\nThere's a lot of concern right now because it comes to the context of a growing crack down on freedom of speech and talks Don\nI spoke to I'm On my ... she's the deputy director I'm full Amnesty International in Southeast Asia and he was also a reporter here for many years before that and he says now is probably the worst it's been for years they've been attacks on journalists they stay in precious to some journalists to leave the country\nAnd I'm broke causes of had the outlet scrambled doing itself the newspaper had its distribution prevented in parts of the country and so they have this case is being viewed with a lot of concern and Mari very briefly on me to was in court today what happened\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Noel King [noise]\nNinety seven point seven FM WG Bebe and W. GBH leave room for to Georgia Public broadcasting radio network [noise]\n\nLive from the G ... newsroom I mentally Jones good morning nearly Ninety boats burned at a massive blaze out of north Georgia boat storage facility over the weekend to go in that county fire officials were called to a boat business near lake lanier early Sunday\nTo find half the storage area burning according to the fire department eighty six boats and four vehicles were destroyed the cause of the fire is under investigation the national Park Service is working on a plan to protect vulnerable nesting animals from predators GPA's Taylor band has more\nLots of what the Park Service called species of concern hang out at national park sites throughout the southeast endangered loggerheads in camps Ridley sea turtles wiping clovers the southeastern beach mouse the MPs is working on a comprehensive plan to protect those critters from predators like raccoons and coyotes\nDoug Hoffman is the wildlife biologist for Cumberland Island national seashore he says experts will share knowledge across parks\nWas produced is based on what we know from our my imports but also be used in other smaller cars they really don't have the knowledge base that some of those two\nMPs is hosting too WebMD or is this week in accepting public comment through October twenty six virginity News I'm paper geared\nFor more Georgia News Go to Jean ... news dot org and be sure to follow us on Facebook and on Twitter where we're at ... news\nKeep the baby is an Eighteen station radio network of Georgia Public broadcasting including eighty nine point seven and then in Macon it's eight oh one\n\nLive from NPR News in Washington I'm nor rom an international panel of climate change scientist says preventing as extra single degree of aid and the next few decades could mean the difference between life and death\nMost nations have set a goal of reducing global warming to nine tenths of a degree Fahrenheit the inter governmental panel on climate change says that world leaders could make that one point eight degrees half\nAs many people would suffer from\nIntense of a degree Fahrenheit the Intergovernmental Panel on climate change says that world leaders could make that one point eight degrees half\nAs many people would suffer from lack of water and it would be substantially fewer heat waves downpours and droughts this year's Nobel Prize for economics is going to two economists who've been working on climate change and innovation their yell universities William Nord house and Paul Romer of New York university NPR's Nick fountain has more\nIn both of these choices endured house in Rome or the Nobel Committee this year is saying this work about making government stink about how to make have the right incentives for people to do things that we want them to do to prevent climate change to continue to grow that stuff is really important\nNPR's Nick fountain reporting Central America has been battered by heavy rains and flooding from tropical storm Michael at least a dozen people have died in thousands are homeless Maria Martin reports\nCasualties from torrential rains has affected a large portion of Central America including a Salvador Nicaragua in Costa Rica but Honduras has been the hardest hit\nOver five thousand reported homeless in that country and at least six people have died including a young mother and her two children in what the mother flooding and landslides are also reported as the storm hits north hitting Mexico and Cuba before making its way to the U.S Gulf Coast\nHeavy rains in the region are expected to continue through the week and what a mother there's another potential natural disaster brewing us at least a dozen moderate eruptions have been reported of the volcano costs cycle\nWhich last up to in June\nFor NPR News I'm Martin\nIt could strengthen into a hurricane as early as tonight as it moves into the Gulf of Mexico it could hit the Florida Panhandle later this week\nMission manager as continue to search for signs of life from NASA's six wheeled Martian rover called opportunity as NPR's Joe Palca reports the rover has been heard from since\nThe rover shut itself down in June after a dust storm on Mars prevented it solar panels from generating power\nThe skies over the rover remained turban for weeks but now they're clear enough that the rover should be able to generate enough electricity to wake up and phone home so far it hasn't\nIn addition to waiting for the rover to contact earth mission managers are suffering the rover with commands in case it's awake and waiting to hear from them again so far nothing although mission scientists will be said if this was the end for the rover they say it had an amazing run\nA wake and waiting to hear from them again so far nothing although mission scientists will be sad if this is the end for the rover they say it had an amazing run lasting fourteen years longer than its original mission I had called for Joe Palca NPR News this is\nNPR News\nThe visuals are being held across Bulgaria today to honor journalists Victoria Marron over her body was found over the weekend near the Dan River she'd been raped beaten and strangled married oh that was the third journalists killed and the European Union in the past twelve months\nTurkey is asking Saudi Arabia for permission to search the Saudi consulate in Istanbul Saudi journalist ... has been missing since last Tuesday when he went to the consulate for paperwork to marry his Turkish fiance Turkish officials suspect the writer was killed there Saudi officials deny that is\nThe major league baseball playoffs continue with three games today NPR's Tom Goldman reports Houston and the LA Dodgers have a chance to clinch their opening playoff series\nThe Houston Astros are looking very much like baseball's defending champions they leave the Cleveland Indians two games to none and their best three at a five game series and pitching is a big reason why I asked for his pictures of held Cleveland batters to six hits in sixty at bats\nThe Indians are hoping the series shifting back to Cleveland helps them get their all fence going\nThe Dodgers also can advance to the next round with a win over Atlanta\nBut the Braves grabbed the momentum Sunday beating LA with tubing home runs a grand slam by twenty year old Ronald attuned your junior and a solo home run by Freddie Freeman that turned out to be the winning run finally arch rivals Boston and New York resume their series today tied at one game each Tom Goldman NPR News\nIn football in Cleveland beat Baltimore and overtime yesterday this is the brown second when this year after ending last season with no wins at all I'm neuron NPR News in Washington\nSupport for NPR comes from a campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email to ... a drag him drop email editor and twenty four seven customer service more at a campaign monitor dot com and Americans for the arts\n\nGood morning thanks so much for starting a week with MORNING EDITION on TPP and handling counts I had this morning in Romania this weekend a referendum that would have defined marriage as between a man and a woman failed\nI'm an only child I had this morning in Romania this weekend a referendum that would have defined marriage as between a man and a woman failed religious groups had been pushing for the constitutional change as a way to strike down same sex marriage will bring you the details in twenty minutes right here on G.\nP. B. it's eight oh seven [noise]\nIn your TV forecasts cloudy skies across or just stay with temperatures in\nEighties eighty five and don't and eighty seven in that\nThere's a chance of rain throughout the day especially midday in North and middle Georgia\nRain as possible overnight as well with Lowes thing right around Seventy degree [noise]\nIf you recently supported gp during our fall fund drive thank you were already putting your dollars to work to bring you the programs that matter to you on the beach if you didn't get a chance to donate during the drive your online contribution now will still make a difference [noise]\nPlease take a couple of minutes to go to G. P. B. dot org and click the green donate but not the top of the page thanks so much for your generous supportive G. P. B. and the service we provide every day [noise]\nThis is MORNING EDITION from NPR News good morning I'm David Greene in Culver City California\nAnd I'm Noel King in Washington DC on Sunday secretary of state Mike Pompeo met with North Korea's leader Kim Jong on in the north Korean capital both sides say there has been some success in working toward nuclear disarmament and in setting up a second ... between Kim and President Trump\nBut then pump pales trip ended on what seems like a down notes because he stopped to talk to officials in Beijing\nAnd tensions between the U.S and China came up NPR's Anthony Kuhn is with me now from Beijing Anthony good morning Noel let's start at the beginning pump ailing Kim say they made some progress in this meeting what do they what do they mean by progress\nWellesley may seem to have narrowed down options as far as the time and date a time and place for the talks are concerned we don't know if they're going to be before or after November midterm elections in the U.S [noise]\nUh ... said that you know if they can get this meeting together they expect real progress added a second summit and Kim Jong one speaking to North Korean state media was even more upbeat\nYou know said that you know if they can get this meeting together they expect real progress at a second summit and Kim Jong one speaking to North Korean state media was even more upbeat he called his talks with Pompeo productive and wonderful\nThose talks he's that include denuclearization and other issues and he said that he was optimistic about the way things are going with the U.S because he and President Trump have deep confidence in each other\nThis is NPR News\nAnd this is MORNING EDITION on TPP good morning I'm Emily Jones\nJamal ... is a prominent Saudi journalist and contributor to the Washington Post and he's missing and feared dead level conversation with one of his editors at the post about what may have happened to him\nIn Fifteen minutes right here on ... an Eighteen station radio network of Georgia Public broadcasting serving a dares fell and beyond it's eight twenty\n[noise] when Leonard Cohen died in twenty sixteen he left behind many unpublished poems and lyrics or some of which have been collected in a new book\nOn the next fresh air we talk with his son Adam Cohen who wrote the introduction at I'm also produced you want it darker the album his father recorded shortly before his death join us\nFresh air at this afternoon at three ... [noise]\nTouchdown John Milton GB fourth reminding you that football busy justice for here in the south it's a way of life every Friday I traveled stay covering high school for ... G v but there's still a lot to talk about joined me for the football friday's in Georgia podcast available on DVD dot org and wherever favorite potash ... [noise]\nAnd now there are nine Brett Kavanaugh's nomination to the Supreme Court divided the country and the battle for many was as much personal as was political\nNow there are nine Brett Kavanaugh's nomination to the Supreme Court divided the country and the battle for many was as much personal as was political what if anything did we learn\nAnd what changes now\nNext time on one [noise]\nOne a is this morning at ten here on the TV and he\n\n[noise] support for NPR comes from this station and from Amazon Prime video presenting the return of the man in the high castle where America's history is under siege but the resistance rises to fight for the world they want the new season has now streaming on prime video\nFrom zoom zoom offers cloud video conferencing online meetings and a video conference room solution and one platform featuring digital video and audio with screen sharing account registration and more at zoom dot U. S.\nAnd from babble European made language learning program Bible teaches practical conversation and Italian Russian Swedish and other languages available in the app store or online at B. A. B. B. E. L. dot com\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Noel King good morning It's MORNING the winners of the Nobel Prize in economics were announced the prize will be split by two economists William ignored house and Paul Romer\nNick fountain from our planet money podcast is with me now to morning Nick happy ... Nobel day before we get to the winters we should clarify something or I Know we will get emails from a condom is it's not actually the Nobel Prize in economics right\nYes uh I'm gonna try to pronounce this right now it's the spirit ... reeks bank prize an economic sciences in memory of Alfred Nobel\nIt's interesting one of the economist William ignored house is known for talking about the economy and climate together\nRight he's an economist at Yale and he's been thinking about how the economy interacts with the environment and climate for decades now this morning I called up Justin Wolfers she's an economics professor at the University of Michigan and he explained his work to me\nKey and saw it is if you leak markets alone won't get good outcomes on the farm in the region is every time you fire up your factory your thinking about your profits but at the same\nGood outcomes on the environmental side of the reason is simple every time you fire up your factory your thinking about you'll profits but at the same time you stink it on my greenhouse gases\nAnd so north houses work uh is about how we need incentives to push us in the right direction like things like cap and trade for instance\nSome really interesting choice and how that is Colin Powell Rome or what is he known for\nRight quick aside here Paul Romer works at NYU he got a couple of calls this morning but he did not answer them\nTo foreign calls this morning and I didn't answer either warm because I thought it was some andme call so I I wasn't I wasn't expecting it deprives\n[laughter] anyways his work is about growth and why economies grow and and his question is will they grow forever and Justin Wolfers explained to me that his research says it's ideas that make economies grow\nOld in size is that the infrastructure to create new ideas is the engine of economic growth\nDon't need to pay attention to patents number of scientists that are out there they're incentives to do science as as long as we can keep generating new ideas we can get you know because\nSo in both of these choices endured house in Rome or the Nobel Committee this year is saying this work about making government stink about how to make have the right incentives for people to do things that we want them to do to prevent climate change to continue to grow that stuff is really important\n[noise] hey nicotine's worth noting the economics Nobel is celebrating it fifty year this year and yet only one woman has ever won the prize\nRight a lot of people thought that uh we might have another woman this year the only woman is Eleanor ... she won the Nobel in two thousand nine you know fifty years is a long time for only one woman\nNPR's Nick fountain from our planet money team Nick thanks so much thanks though\nSupport for Planet Money comes from his Cox insurance offering the Hitchcock cyber readiness report to provide businesses with perspectives on cyber security threats and how to protect against them learn more at H. I. S. C. O. X. dot com slash cyber security\nRight in Romania an effort to ban same sex marriage has failed this was a two day referendum that would have changed the constitution and the socially conservative country in the European Union but not enough voters showed up over the weekend and that invalidated any results\nToday referendum that would have changed the constitution and the socially conservative country in the European Union but not enough voters showed up over the weekend that invalidated any result this is a slap in the face for the Romanian Orthodox church which has warned that western liberals and you are forcing their values on the east coast you advocate kisses for book arrest God\nMany churchgoers in this post communist said he retired engineer Maurice toothbrush opposes same sex marriage I don't like men who is man and woman was warmer it's not enough\nFor him that same sex marriages already banned in Romania civil code a problem I as that goes on as long as that code can be changed he sat so we need something\nMore leaders of the ... or ... church ... voters that defining marriage as between a man and a woman saving the traditional Romanian family arch deacon unit ... says it's about children\nAnd as he every child has the rights to be raised in more family like from Missouri and the phones that are like all the children that have ever being born\nThe church strongly backed an amendment to Romania is constitution it was pushed by conservative activists were advised by liberty counsel US Organization which opposes same sex marriage\nDirt behind old use me months in Eastern Europe\n... runs mosaic and algae Beatty rights group and ...\nWhat we're witnessing is this sort of a ... between these extremist American groups and local indigenous conservative groups trying to push forward their agenda [noise]\nTwenty four year old ... code dance with friends at a boycott party and the ... club before the vote\nI came here because I'm a lesbian\nAnd I don't think that we shouldn't be perceived that people that are plaguing our society they think that we are some sort of the general raised that we are they are trying to like allies homophobia\nCommunications consultant ... ... is bisexual he's noticed a rising homophobia and the weeks before\nThe vote ever to start to ever express any use that word pro as you'd be the what's fair game for hate them\nTo become the Sunday walking\nYour dog Oscar at the park near Boop arrests opera house\nThis referendum doesn't pets I Will remember the day is the second most important\nAnd they walking your dog Oscar at the park near booth arrests opera house\nThis referendum doesn't cuss I Would remember these days is the second most important thing in my life of the during the summer Nineteen eighty nine when the communist regime [noise]\nRomania did not decriminalize homosexuality until two thousand\nOne and only then because it was a precondition for entering the European Union Mario's to fish the retired engineer blames the EU for pushing liberal values on his country and they can offer that quote the name of my daughter lives in the Netherlands now he says and we fight every day over same sex marriage [noise]\nAcross town a gay club broke out in the years when the TV news cleared the marriage referendum that\nSame sex marriage in Romania is still legal but tonight\nThere was no change to the constitution for NPR News I'm Joanna Kakissis in ... Romania [noise]\nHe was still often I'm Still go take a Austin Pfizer role he really wanted to guide ... print the really really love Saudi Arabia I think and\nHe just he just wanted to write he didn't want to be a dissident who didn't want to give opposition figure he just wanted to be free to express what he thought was his version of the truth about Saudi Arabia is past present and future and I think that's what\nMakes it hard\nUm to deal with uh\n[noise] and I'm Tim we'll hope for the best um turned to mobile opinions editor for the Washington Post and it's been working with ... says editor thank you so much for your time\nThank you David [noise] we're going to go now to a tragic story from upstate New York twenty people are dead after a limousine crash this weekend Lucas Willard of member station WAMC has the story\nOn Saturday afternoon and SUVs stretch limousine was carrying Eighteen people through the rural town of ... theory about forty\nStation to leave and the has the story on Saturday afternoon an SUV stretch limousine was carrying Eighteen people through the rural town of skill Harry about forty miles west of Albany the two thousand one Ford Excursion limo went through the intersection of New York state roots thirty and thirty a\nNational Transportation Safety Board chair Robert Sumwalt said the crash is one of the worst he's seen in his twelve years on the NTSB for\nThis is the most deadly transportation accident in this country since February of two thousand and not\nA two thousand nine plane crash near buffalo killed fifty people state police first deputy superintendent Christopher Fiore told reporters Sunday afternoon all of those killed in ... Harry we're adults\nLimousine traveled across the intersection into a parking lot\n... two thousand Fifteen Toyota Highlander it was an occupied and parts\nTo even ... standing nearby were also struck and killed\nEveryone inside the limo was killed as a Sunday afternoon state police had not released the identities of the victims pending notification of the families though names had started to emerge Amy Dunlop Johnson who identified herself as a cousin of two people inside the limo said the group was celebrating\nMy wife I'm going to be turning thirty hum I feel like um how a where um they ... they were going on winery Carolina\nOfficials are still trying to figure out what caused the accident\nSky Harry town supervisor Alan ... drove by the scene on his way to church Sunday Morning he called the intersection at the bottom of a steep hill dangerous Kevin ... says the town has complained to the state Transportation Department about safety issues\nAbout four years ago they finally band tractor trailer from the uh the sight rows were thirty coming down because at least two instances where the tractor trailers lost their breaks and went through the intersection\nThe accident is sure to have a lasting impact on the farming community of about three thousand\nIt's ah it's just a tragedy it really is it's incredible number of people made a small\nCommunity vigil is planned for Tuesday evening NTSB staff will remain in school Harry throughout the week for NPR News I'm Lucas Willard in Albany New York\n\nBe our News I'm Lucas Willard in Albany New York\n\n\nThis is NPR News\n...\nServing Bainbridge and beyond this itchy ... any team station radio network of Georgia Public broadcasting good morning I'm Emily ... [noise] I had this morning scientist for the Intergovernmental Panel on climate change or in South Korea to discuss what needs to be done\nTo stop global temperatures from rising by more than one point five degrees Celsius\nWhy one point five degrees the marketplace morning report has that story in eight minutes [noise]\nMORNING EDITION and on second thought to political rewind and all things considered listeners support makes everything you hear on TV possible if we didn't hear from you during our phone fund drive your contribution now will still make a difference [noise] please take just a couple of minutes to support the programs you rely on and enjoy on TPP\nAnd do your part now at whatever level is right for you though to G. P. B. dot org and click donate and thank you so much for your support of Georgia Public broadcasting [noise]\nIt's eight forty four [noise]\n\nSupport for TB comes from you our listeners and the historic Sam short line railroad\nThomas the tank engine visit so Sam short line trained at Georgia veterans state park in ... October Nineteen twenty first plus the twenty seventh and twenty eight tickets at Sam short lines dot com and we'll start health system a proud member of the Mayo Clinic care network will start doctors can consult with male and complex cases keeping patient care at home\nWell star dot org slash male will start Mayo Clinic working together working for you [noise]\nAnd now there are nine Brett Kavanaugh's nomination to the Supreme Court divided the country and the battle for many was his much personal as was political what if\nAnd now there are nine Brett Kavanaugh's nomination to the Supreme Court divided the country and the battle for many was as much personal as it was political what if anything did we learn\nAnd what changes now\nNext time on one hand [noise]\nIt's\nMorning at Penn right here on TPP [noise]\n\nSupport for NPR comes from this station and from the N E E Casey foundation developing solutions to support strong families and communities to help ensure a brighter future for America's children more information is available at H. E. C. S. dot org [noise]\nAnd from Carnegie Corporation of New York supporting innovations in education democratic engagement and the advancement of international peace and security more information is available online at Carnegie dot org\nIt's MORNING EDITION from NPR News I'm Noel King\nAnd I'm David Greene a politician from the far right in Brazil nearly pulled off a historic victory yesterday a victory that would have changed the political landscape in Latin America\n... and our oh a retired army captain one by far the most votes in the country's presidential election and was just a few percentage points away from a first round victory last night his supporters though we're celebrating outside his house in Rio de Janeiro as if he had one [noise]\n\nIn fact there will now be run off so he has not won at this point at least we're joined now from Rio de Janeiro by NPR's Philip Reeves morning Phil good morning so how close was this\nIt was quite close to when he needed to get both of them they just get more than fifty percent of the valid votes in fact he go forty six point two percent\nThat's much better than the polls have been saying and the remarkable performance given that he has no big policy behind and he had very little access to TV advertising and he spent three weeks of the campaign in hospital after being stabbed and severely injured at a political rally\nBuddy for how specially on social media and now he's not a strong position to go on and possibly win what he's in a strong position to win actually just\nAmazing story I mean ... not only was the campaigning from a hospital um doesn't have a party behind them as you say it was a really controversial figure right so what's the appeal\nJust an amazing story I mean ... not only was the campaigning from a hospital um doesn't have a party behind them as you say also really controversial figure right so what's the appeal here\nWell there's a tremendous amount David of public anger in Brazil people have lost the loss of faith in establishing politicians in this because the massive corruption investigation which has exposed\nGr often upper scale in the highest places here the country's headed West Africa recession and it's come out of that but its economy still stagnant this epidemic of violent crime\nAnd both ... who's actually being in Congress for more than a quarter century has done a good job of positioning himself as an outsider and he's kept in\nTo this hunger for something radically different and that was obvious when you talk to people outside his house celebrating last night I mean listen to sue to feel that she was sixty two at a speech therapist\nWhat I deal with these days on\nBrazil needs to change she says it's it's in the hands of corrupt politicians and people are unhappy\nAnd and what both in our did very well was channel that frustration and anger towards his chief opponents which is the workers' party which was in government for most of the ... when the time when all this bad stuff is what's happening so people have been willing to overlook both an hour's ... from the ...\nAnd racism and making homophobic remarks\nAnd also his oft expressed admiration for Brazil's past dictatorship [noise] so what happens\nNow that there's a runoff in and is he likely to win it\nYeah it goes to a runoff on the twenty eighth of October this'll be between ... and for them to a Daschle who was the workers' party candidate he came in second\nHe's a full my education minister and former mayor of Sao paolo but most importantly he's the stand in for the former president Luiz ... Lula da Silva who wasn't able to run in this race because he's banned because he's been convicted of corruption as in jail now that she got just twenty nine percent", "year": "2018", "show_name": "Morning Edition (NPR)", "city": "Chatsworth", "day": "08"}