{"month": "10", "state": "GA", "station": "WNGH", "content": "Over at your classical dot org you can augment your regular classical music listening with curated streams including the peaceful play list of piano music just as members supported G. P. P. we're in Eighteen station radio network you can listen online or G. P. B. dot org and you can find\nIt lists of piano music this is members supported gp Pete were in Eighteen station radio network you can listen online at ... dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening\n... here and if you're in your car I Want you to try something roll up the windows all sealed inside a good smell\nCan you smell that that was the great cologne experiments of two thousand for it you should not have gone with the dollar store for that one boy you can lose that older car smell by donating your vehicle one of your favorite causes like public radio it only takes a few minutes and just like that you've supported the station and well you were on your way to a life of better smell [noise]\nGo to ... dot org slash cars and thanks\n[noise] Ninety seven point seven FM WG P. B. S. W. A. G. P. H. D. room portable Georgia Public broadcasting radio network [noise]\n\nThe pressures Saudi Arabia faces for the disappearance of a writer the kingdom has one prominent\nVirus and the Supreme Court justice Brett Kavanaugh the president says if the Saudis here we go again with you know you're guilty until proven innocent lives Stephen\nAnd I'm Noel King also this hour we have an audio mirage this year's winner of the Nobel Peace prize he's only\nFive years old but she's on a mission to draw attention to atrocities committed again ... ... people in federal that jumped in many\nMy finger pointing in Washington will get very\nNine years old today and the news is next\nLive from NPR News in Washington I'm Dave ... secretary of state Mike Pompeo is an ... today for a meeting with Turkey's president on the disappearance of Saudi journalist ... NPR's Peter Kenyon says the talks come a day after Pompeo was in Saudi Arabia to try to get answers\nTo bump into arrives from Riyadh where he met with king some on and crown prince Mohammed bin some on on the show you disappearance Turkish authorities have said they have audio and video evidence to show was killed\nWhere he met with king some on and crown prince Mohammed bin some on on the ... disappearance Turkish authorities have said they have audio and video evidence to show was killed inside the consulate the Saudis deny wrongdoing and have yet to respond to media reports they're planning to acknowledge show gays accidental death during questioning\nFollowing President Trump's suggestion that rope killers may have been responsible the New York times linked for Fifteen Saudis who arrived in assembled a day of the show the disappearance to the crown prince Peter Kenyon NPR News Istanbul\nThe death toll from hurricane Michael is now up to twenty six authorities in Bay county along the coast in the Florida Panhandle say at least twelve people were killed by the category forum supports storm there\nIt includes Mexico beach in Panama City where there's heavy damage and flattened homes and others were killed by the storm in Georgia North Carolina and Virginia\nThe Justice Department says Fifteen indictments have been issued against members of one of Mexico's largest drug cartels they were accused of trafficking into the U.S tons of cocaine mess and heroin laced with setting the indictments were announced by attorney general Jeff Sessions\nThese ... every day are taking advantage of our porous southern border to move and push their illegal drugs for large profits billions of dollars tens of billions of dollars expanding suffering and death in our country\nThe Trump Administration is offering a ten million dollar reward for information leading to the rest of the cartels leader who was known as el ... show he runs ... new wave of gender Russia on sales of recreational marijuana are now legal in Canada as Dan ... reports the change took effect this morning\nAs the clock struck midnight in different time zones hundreds of Canadians who had lined up to be the first to buy marijuana legally celebrated people and new Finland where the first to by legal marijuana and count down to the magic hour were held in major cities in Toronto there was a New Year's eve style party my puffin poor painting class in Vancouver and\nProtest from those who aren't happy with the age restriction of Nineteen or older but some provinces such as Ontario are critical that police still aren't equipped to reliably screen for drug impaired driving and recent surveys adjusted that nearly eight out of ten Canadians have no interest in smoking legal pot for NPR News I'm Dan carp and check in Toronto\nWall Street is coming off a day of sharp games the Dow added five hundred forty seven points or more than two percent the S. and P. five hundred also rose more than two percent of its largest one day advance\nIf sharp gains the Dow added five hundred forty seven points or more than two percent the S. and pay five hundred also rose more than two percent of its largest one day advance since late march this is NPR News\nHarvard University's dean of admissions is defending the school's admission policies and a federal lawsuit alleging bias against Asian American applicants Kirk Carapezza with member station WBUR GBH and Boston reports on testimony in that case\nThe group students for fair admissions is led by a conservative legal strategist who works to oppose race conscious policies in any form the group's lawyers point to it too doesn't Thirteen internal investigation into Harvard admissions records\nIt sounded a few Asian American applicants were described with terms such as quiet shy and good at math and lumped together with other applicants of the same ethnicity on the stand for a second day Harvard longtime dean of admissions William fitzsimmons said the university doesn't endorse those comments but of course then\nFits him and said race is never a determining factor but it can make a difference in some cases his testimony will continue on Wednesday for NPR News I'm Kirk Carapezza in Boston\nThat trial is expected to last three weeks in major league baseball the national league championship series is tied at two games apiece last night the Los Angeles Dodgers beat the Milwaukee Brewers two to one and Thirteen innings LA's\nCody Ballenger singled home many Machado from second base with two outs in the bottom of the thirteenth for the win the game lasted more than five hours game five is this afternoon\nAnd the American league championship series the Boston Red Sox lead the Houston Astros two games to one last night Boston beat Houston eight to two in game three of the A. L. C. S. game for is tonight in Houston\nI'm Dave ... NPR News in Washington\nSupport for NPR comes from dream wave maker of luxury massage chairs from Japan with Shiites viewpoint detection and sixteen program to massage news including warning night and stretch fashions retailers nationwide more a dream wave chair dot com and the ... foundation\nYou or your loved ones were affected by hurricane Michael food and water are available at distribution points across southwest Georgia a full list is available at G. E. M. A. dot G. A. dot Gov\nTo mobile phone charging stations you're open in Albany at eleven hundred northwestern over boulevard and one hundred west Ogle Thor boulevard another charge\nA dot Gov to mobile phone charging stations are open in Albany at eleven hundred northwest over boulevard and one hundred west ... boulevard another charging station is open and Donald Seville at three oh one widely avenue anyone can charge their phones with these locations\nIf you need help with debris cleanup contact crisis clean up at eight hundred four or five one Nineteen fifty four\nCrews are still working to clear roads and restore power do not attempt to handle or cross damage power lines report them to your power company immediately\nAnd survivors and Baker Decatur Doherty early Miller and seminal counties are eligible for disaster assistance through FEMA those residents should file claims with your insurance company's first then visit disaster assistance dot Gov or call eight hundred six to one three three six to [noise]\nTo put too fine a point on it but sometimes you just want to listen to music\nAnd sometimes you don't even want to choose what it is [noise]\n... let me do that you think for\nOn the TV Tonight it\nThe only decision you need to make it to the\n[noise] and this is MORNING EDITION from NPR News I'm Noel King\nAnd I'm Steve Inskeep watched the real purpose of a diplomatic mission by Mike Pompeo\nPresident Trump sent the secretary of state to look into a murder but at least in public Pompeo has offered many smiles while not asking very many questions Saudi Arabia is suspected of having a writer killed so ... odd for and apparently friendly meeting with crown prince Mohammed bin Salman\nA little while [noise] [noise]\n[noise]\nToday Pompeo has moved on to turkey where the writer Jamal ... was last seen walking into a Saudi consulate and this murder is complicating relations with the country that the Trump Administration depends on\nNPR's Michele Kelemen is traveling with the secretary of state and she joins us from the airport I Believe in Ankara turkey I've ever show either Steve okay so uh my palm pales in Turkey has been talking with reporters about this trip through a quick trip through Saudi Arabia let's hear what he told reporters a little bit earlier\nTold me they were going to conduct a thorough complete press for an investigation they made it\nSaudi Arabia let's hear what he told reporters a little bit earlier\nTold me they were going to conduct a thorough complete press for an investigation they made a commitment to to hold a anyone\nTo any wrongdoing that may be found\nFor that whether they are a senior officer official\n\nIt's NPR news\nIn twenty eleven to state of Georgia executed Troy Davis for the murder of an off duty police officer can certainty over his guilt math on a new radio drama tells a story\nOn way all the talk he gave me an impression that I should say the Troy Davis was the one who shot the office of the other witnesses\nBeyond reasonable doubt the Troy Davis project that's on second thought this morning at nine ...\nIf you or your loved ones were affected by hurricane Michael food and water are available a distribution points across southwest Georgia a full lifted today a little at G. E. M. A. G. A. dot Gov\nTo mobile phone charging stations you're open in Albany at eleven hundred northwest over boulevard and one hundred west ... boulevard another charging station is open a Donald Seville at three oh one widely avenue anyone can charge their phones these locations\nIf you need help with debris cleanup contact crisis clean up at eight hundred four or five one Nineteen fifty four\nCrews are still working to clear roads and restore power do not attempt to handle or cross damage power lines report them to your power company immediately as survivors and Baker Decatur Doherty early Miller and seminal counties are eligible for disaster assistance through FEMA\nThose residents should file claims with their insurance companies first then visit disaster assistance dot Gov or call eight hundred six to one three three six to\nA record number of Native American candidates are running for office we could have an outsized influence on the mentor still both major parties are giving these communities cause for concern\nWhether it's Senator Elizabeth Warren is DNA test for new rules making it harder for men\nStill both major parties are giving these communities cause for concern\nWhether it's Senator Elizabeth Warren DNA tests for new rules making it harder for many Native Americans to cast ballots next time on one [noise]\n... It's MORNING a tan right here on your TV station [noise]\n\nSupport for NPR comes from the station and from the doors do charitable foundation whos clinical scientists development towards support promising early career physician scientists and their research efforts to improve human health\nFrom the state of June ... who's ... serves as an enduring investments in the future of public radio and seeks to help NPR be the model for high quality journalism and the twenty first century\n[noise] from the public welfare foundation committed to advancing justice an opportunity for people in need more information at public welfare dot org\nAnd from the Conrad Hilton foundation working to improve the lives of disadvantaged and vulnerable people throughout the world learned more health and foundation dot org\nIt's MORNING EDITION from NPR News I'm Noel King\nAnd I'm Steve Inskeep good morning when the Nobel Committee said that not humor rod was one of the recipients of this year's peace prize they cited her courage\nShe refused to accept the social code requires women to remain silent on to say any of the view this to which they had been subject to the\nFour years ago Islamic state fighters enslaved thousands of women and girls in Iraq many were repeatedly raped and sexually abused and otherwise\nNot him rod was one of those women she was only Twenty one years old at the time and from a tiny but ancient religious minority group the ...\n... people into their money and they just on a simple life they they can they can leave we\nGroup in Iraq in even hand but and they are they're very key piece peep when she said yeah they just want to live in peace and they say\nTo feel safe I talked to ... and NPR's Washington studios earlier this week it was her first full interview since she won the Nobel Peace prize with the help of an interpreter she spoke mostly\nThe ... and NPR's Washington studios earlier this week it was her first full interview since she won the Nobel Peace prize with the help of an interpreter she spoke mostly in ... which is her native language about what she now hopes to achieve\nUm diminution a gym we have set it over and over that it's important for us the justice is done out of the six thousand years the women who were abducted by ISIS we hope to see at least one ISIS number who did this\nTo one as a woman to be punished for the crimes they've committed against gives me the women and we hope to see them in court in public\nI think it is easy to see winning the Nobel Peace prize is a kind of combination or end of a person's career you've you've done what you said how to do\nIn your case at twenty four years old that is clearly not true you clearly feel like you have a lot less to do what is next for you after winning the prize\nI'm twenty five twenty five ...\n... after I delivered our message and we have as a community delivered our message to how we would like to see the reconstruction of our homeland infringe are take place and to provide security for ... said that they can go back\nAnd we would like to see this never happen again not to any other community or any other religion or any other group are you angry\nUs in the ... I Can't just simply say I'm angry cheap because of that word only will not describe how much we have suffered but what I can say is that we are right we have the right to speak about this we have the right to deliver a message\nIf anger doesn't quite capture it what is the word what do you feel everyday\nOr chemicals to showed him a you know like I said what makes us feel good at least is that we are delivering a peaceful massive die we are not delivering a message to hurt anyone when I meet with students and residents for anyone\nI speak about what happened to us and I deliver my message with a clear conscience that I advocate for people\nDuring our half hour interview not humor odd seemed at times pretty shattered but also strong she says that strength comes from her UCD identity she calls the rape of using the women and the murder of UCD men including many people in her own family a genocide she wants these atrocities to be classified as\nShe calls the rape of using the women and the murder of UCD men including many people in her own family a genocide she wants these atrocities to be classified as war crimes but even after winning the Nobel Peace prize she's not sure if that's going to happen and she sometimes finds herself frustrated oh\nWhat a ... and sometimes I feel that my message has not been clearly heard what that is not my fault because I feel like too much is going on in terms of woman being victims and it's not the first time and certainly it's not the last time\nAnd perhaps every year a woman someplace in the world or groups of woman thousands will be victims of sexual violence or terrorist groups and so I feel like this is not new to people and it's not going to be the last time I think people have become numb to this kind of news\nI'm your mother\nYour mother was killed by the Islamic state and I wonder when you think about her now\nWhat do you think she would think about everything that you've done what do you think she would think about you having won a Nobel Peace prize being the voice of the ... community to the rest of the world how do you think your mom would feel [noise]\nKnew some of the day because I had the hookah hybrid on when I received this news it was around probably five\nAM in the morning and the U.S we diverted on the first thing I did was look at her picture and cry but because they felt they needed her her ... and not just her what the eighty woman the ... are women that were with her\nAnd then we're all executed for no reason just for being ... and for being older women I feel like they will be proud\nProud\nYou are twenty five years old you've just gotten engaged congratulations things [noise] your life is not what you thought it was going to be just a couple of years ago what kind of life do you want for yourself now\nHad a mother and a yes we have got engaged but it's still difficult for me to deal with all of that whole much as much as I Try to come close to finding a simple life nicer things come up and then we have to deal with them and they'll continue this work\nBut I Hope that I can say oh I Want to learn English I work on my English in school and I want to create a family with my fiance and being able to live a simple life\nAnd I want to learn English I work on my English in school and I want to create a family with my fiance and being able to live the simple life and to be ...\nI Hope you get exactly what you I don't\nIt was really a pleasure speaking to your not him right thank you so much [noise]\n\nThank you for listening to us on your local member station you can keep the conversation going with us on social media\nI'm Noel King you can reach me on Twitter at Noel King Rachel Martin is at Rachel NPR David Greene is at NPR green and Steve Inskeep is at nprinskeep to find out more about the people who put this show together\nEveryday go to our website NPR dot org slash MORNING EDITION and click on the staff attached to read about are amazing crew of editors and producers [noise]\n\nAnd then there's the fight over how people may vote early voting starts today in North Carolina is so popular that more than half of North Carolina votes were cast early in two thousand sixteen for two thousand Eighteen lawmakers altered the rules in ways that could lower turnout\nHere's Alexandra Olga member station WFSU ag\nTo prepare for early voting elections director Adam Reagan in Gaston county just north of Charlotte is passing voting machines by running sample ballot through that [noise]\nThese machines were meant to be inside early voting locations throughout the county but the new law requires\nAll sides with any county to be open from ... to ... pm during the week and as a result Reagan can only open three sites that election\nEarly but he was very popular and guest county and and I would have loved to have more early voting locations it came down to having more locations you know helping more voters versus our responsibility to the county\nSome democratic lawmakers see this as another\nI mean we're locations you know helping voters versus are British eerie responsibilities to the county\nSome democratic lawmakers see this as another attack on voting rights in a state where a voter id redistricting and early voting rules have all been struck down by the courts at various points in the last few years\nDuring a June debate about early voting democratic state representative Amos Quick said the requirement that if one side is open on the weekend the rats also have to be could discourage counties from having any weekend hours\nWeekend early voting has been referred and has been for a certain population and certain religions lose right to vote as not only been alive it would have been rejected in a recent court decisions\nHe's referring to black voters and appeals court ruled a twenty Thirteen law that among other things cut early voting by a week targeted African Americans with quote surgical precision but Republicans who champion this law argue they're only trying to minimize confusion here state representative David Lewis also during the June debate\nWhat we set out would be in use you to do was to be able to but if you or reliable and the older dog voters would know the early voting sites or size or their county was open for most of 'em in the morning to sit on the evening\nThe law has some bipartisan opposition run riot is the Republican Party chair of ... county about fifty miles north of Charlotte the county has had to cut its early voting sites in half frustrated as to where to go with ... and he says even though this may not seem like an unfunded mandate\nThat's exactly what it translates to being at the end of the\nWorld counties with smaller election budgets like ... are disproportionately affected by this change well individual locations maybe open longer they released Seventeen percent fewer sites this election MIT political scientist Charles Stuart that third says that for voters convenience Trump's hours\nAnd there's a lot of research has been done that suggests that whenever you move a polling place further away from a voter that are less likely to grow their\nStewart says the rule change could simply shift turn out to election day which could mean longer lines at the polls in a state or voting rights have become such a political hot potato elections officials say they just go with the flow Becky Gallup Harris the elections director in ... county\nDue to court cases legislation all of that kind of thing factors in and it just seems like we always has something to lecture and that\nTakes us in a different direction the\nRemains will voters adapt as easily\nThen and it just seems like we always had something to like and that\nTakes us in a different direction the question remains will voters adapt as easily\nFor NPR News I'm Alex ... [noise]\nIt's NPR News I'm Jeremy hops in for his new book journalist\nBen Bradlee junior went to one Pennsylvania county that voted twice for Obama and then for Trump's and profile voters they're or talk to a woman\nLiterally some by God she believes are from ... to cure America's political dysfunction that's next on on hearing their [noise]\nHere and now is new until two on G. P. N. G. P. B. news dot org\nSupport for G. P. B. comes from our ... our reporters have been honored with national awards from public radio news directors incorporated for our use of sound soft feature and our coverage of breaking news thank you for your support which allows us to keep you informed about stories that impact your life\nAnd show your parts of Georgia you don't otherwise hear about count on us to bring you comprehensive coverage of the state check out our website a G. P. V. news dot org GB news stand with the facts [noise]\nI'm a good chunk of already coming up with an excellent point fears wants to change the American market place with its mail order catalogue and at stores that sold just about everything now is filing for bankruptcy will take a look at the retail industry is latest disruption that's coming up at an excellent point from NPR\nMorning at eleven right here on T. V. S. T. TV news out or\n\nSupport for G. P. B. comes from you our listeners in this fast paced world you want to have access to news when you need it check out our Web site at gp news dot org we've got the latest state national and international news available twenty four seven\nBut they're also in depth feature stories from across the state of Georgia you can also view video performances from great musicians in our gp music present series\nFor information and entertainment you can count on gp the news ... news dot org\nAnd the next fresh air the creator of the net flicks comedy series bow jak horsemen Raphael ... Blacksburg so jak as an animated comedy with cast of humans and animals bow jak as a horse was a depressed alcoholics excess former sitcom star the series satirize is Hollywood\nComedy with cast of humans and animals bow jak as a horse was a depressed\nAlcoholic sex is former sitcom stars the series satirize is Hollywood and pop culture and the new season is set\nThe afternoon it's three on TV and TV news dot org\n\nSupport for NPR comes from this station and from the levels and foundation committed to improving lives through invention in the U.S and in developing countries and working to inspire and enabled the next generation of inventors more information is available at ... dot org\nFrom the John D and Catherine the MacArthur Foundation recognizing exceptionally creative individuals this year's MacArthur fellows and more information or at Mac found dot org and from the listeners who support this NPR station\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Noel King\nThere are reports of a surge of new Ebola infections and the Democratic Republic of Congo today and emergency committee of the world Health Organization is meeting to advise on whether the outbreak should be declared a public health emergency of international concern and ... and\nThen has the story that definitely they show has only sounded the alarm this way for times most recently in twenty sixteen when CSI got arrested in Latin America and before that in response to the twenty fourteen twenty Fifteen Ebola outbreak in West Africa that infected more than twenty eight thousand people\nThis outbreak and the deer see has been much smaller about a hundred and eighty confirmed cases so far but it's centered in a particularly challenging area\nApproach and that could be it a little quicker you shouldn't conflict\nPeter ... is a top official with the W. H. O.\nAs one million ... million residents internally early on they voted democratic Republican\nAn armed rebel group called the allied democratic forces has been launching attacks on government forces UN peacekeeping troops and also civilians now it's on a says despite that when Ebola first surfaced in early August\nWe're quite confident we would go up there with\nThe government W. H. O. and partner organizations launched a major effort to treat infected people and administer and experimental vaccine to anyone who had contact with them the strategy started to show success\nA major effort to treat infected people and administer and experimental vaccine to anyone who would had contact with them the strategy started to show success\nAnd then what happened to amber is a major\nViolent attacks by the rebels including one in a city called Benny where they killed more than twenty people mostly civilians\nPopulation of interested enough is enough\nPeople who for years have felt completely abandoned by the government and the international community started turning against the health workers who were seen as an arm of the government people would say\nLook you can't even go to a physical security\nWhy should we go along with this unfamiliar anti Ebola campaign you're pushing\nNow salon stresses that the vast majority of people are still cooperating but rumors that started the vaccination campaign is actually a plot to spread the disease members at a safe burial team were attacked with rocks and severely injured and often after a rebel attack whole neighborhoods shut down in protest\nWindow to live in the streets of barricaded by young people of terms burning cars are objects and sometimes for the ... or other weapons\nIn the last week and a half the effects of this have started to become clear with not just a rise in the number of new cases each week but ever more cases who contracted Ebola from someone the W. H. O. had not previously known about\nThat's the situation that the emergency committee that's meeting today has been asked to assess David Hayman is an infectious disease expert and an advisor to the W. H. show\nSome fielded by calling ... emergency more increased political importance of the event will pursue we increase the mobilization of\nThe deli they chose asked for thirty three million dollars to help neighboring countries prepare for the possibility of a spread across their borders and declaring this kind of emergency could also have a wider affect\n\nNinety seven point seven FM double your gp be and W. GBH leave room for to Georgia Public broadcasting radio network\nI'd be seven forty seven FM WG baby and believes you be each room for the Georgia Public broadcasting radio network [noise]\nLive from the G. P. B. newsroom I'd Emily Jones good morning I had secretary of state Pompeo traveled from Saudi Arabia to turkey where he needs to target the Turkish foreign minister to talk about the missing Saudi journalist we'll have details in just under ten minutes\nFirst today's Georgia headlines vice president Mike Pence visited parts of the state yesterday that were impacted by hurricane Michael\nHistory comes on the heels of President Trump's visit on Monday ... spoke at the annual sunbelt ag expo and agricultural trade show in Moultrie he reassured farmers the federal government would be there to help\n[noise]\n\nDo you all\nCrop damage is expected to top one billion dollars [noise] the Atlanta Hawks slope and they're twenty teens season tonight against New York Knicks at Madison Square garden GBDs Taylor can has more\nOdds makers are expecting the hawks to compete for a championship this season but the team will have some younger players worth watching rookie point guard for young will look to lead the office for Atlanta along with third year player tore in print the team will also future veteran employers like Jeremy limb and Vince quarter\nThe oldest active player in the league\nAfter starting the season on the road tonight the hawks will play their first game in the newly renovated State Farm arena next week for the b._b._c. news\nOnto the dance\nFor more Georgia news ... news dot org it's six oh one\nLine from NPR News in Washington encore of a Coleman cleanup continues along the Florida Panhandle and in parts of Alabama and Georgia from hurricane Michael at least twenty six people are known dead from the storm sixteen people in Florida and the others in Georgia North Carolina and Virginia what's unknown is how many people are missing\nSecretary of state Mike Pompeo says the Saudis have committed to investigate the disappearance of a Saudi journalist but so far he won't say whether he believes the Saudis killed the man in their consulate in Istanbul as NPR's Michele\nThe disappearance of a Saudi journalist but so far he won't say whether he believes the Saudis killed the man in their consulate in Istanbul as NPR's Michele Kelemen reports\nAs he boarded the plane from Riyadh to hunker secretary San Pedro was describing his visit to Saudi Arabia as a success the Saudi king crown prince and foreign minister he says all understand the need to quickly investigate the disappearance of Jim out because showed Jake\nThey want to have the opportunity to complete the investigation or a wife and I think that's I think that's a reasonable thing to do to give them an opportunity for them all just draw to evaluate are the ones that they\nCould show she was last seen entering the Saudi conflict and it's simple October second where Turkish authorities say he was killed the Saudis initially said he left the consulate but now appear to be changing that story Michele ... NPR News traveling with the secretary in ...\nTexas Republican Senator Ted Cruz and his Democratic challenger representative Beto O'Rourke held a second debate on Tuesday from member station ... K. E. R. A. Rachel ... Lindley reports they sparred over health care abortion and border security\nWith less than a week before early voting starts in Texas crews work never missed a chance to pounce sometimes simultaneously\nClay you very much older I get a long way in that exchange kept our question on border security congressman O'Rourke not only opposes the wall but he has said we had too many fences and walls already on the border he wants to tear down the ones we have\nThe El Paso Democrat said the U.S should focus on beefing up ports of entry\nA better idea of who and what comes into our country demonstrably Mexico safer\nSen Cruz came into the debates just hours after a new CNN poll showed him leading his challenger by seven points for NPR News I'm Rachel Lindley in San Antonio it is now\nLegal to buy recreational marijuana in Canada the new Canadian law took effect today than carpet check reports that Canada is the first to G. seven nation to legalize recreational pot\nCelebrations in part parties when well into the night as many Canadians marked a day they believe would never come prime minister Justin Trudeau is campaign promise to legalize recreational cannabis as now reality anyone Nineteen or older will be able to buy marijuana\nBut just days before legalization a new survey suggests to nearly eighty percent of Canadians have no interest in smoking legal part\nThan carbon jak reporting from Toronto [noise] this\nDays before legalization a new survey suggested nearly eighty percent of Canadians have no interest in smoking legal part\nThan carbon jak reporting from Toronto and this is NPR\nEuropean Union leaders are gathering in Brussels today for a meeting on the future of the United kingdom's exit from the emu known as Brecht said today is supposed to be a deadline for ... the United kingdom diplomats to reach a deal on how the u._k. will leave the block next march\nIt's been tough going negotiators are stalled over what to do about the border between Northern Ireland which is in the u._k. and the republic of Ireland which is a member of the new\nChina's government is find a vaccine maker more than one billion dollars for manufacturing hundreds of thousands of batches a faulty vaccines NPR's Rob Schmitz has more\nNews surrounding that effective vaccine sparked outrage in China over the summer including rare public protests outside government buildings by parents who asked how they could trust the authorities to protect their children the government is fine ... technology one point three billion dollars for creating at least a hundred thousand defective review vaccines\nAuthorities insist they were only ineffective not dangerous according to state media ... violations included blending different patches of vaccine fluid falsifying dates of production and using expired fluid to produce some of the batches Rob Schmitz NPR News Shanghai\nIsraeli warplanes have hit targets in guns and after militants they're fired a rocket that struck Israel officials in Gaza say at least one Palestinian has been killed\nThe Israeli military says the Palestinian rocket hit a house but there were no injuries reported no group has claimed responsibility for firing the rock an\nEncore of a ... NPR News in Washington\nSupport for NPR comes from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial well being first learn more at Raymond James dot com\nGood morning thanks so much for starting your Wednesday with MORNING EDITION ... and Emily Jones\nI had this morning pro public eye and time magazine reports of some of the girls a charity in Liberia was supposed to be helping became victims raped by a charity staff member a conversation with investigative reporter Finley young\nThe area was supposed to be helping became a victim raped by a charity staff member a conversation where investigative reporter Finley young about the charity more than me in Fifteen minutes right here on keeping it six or seven\nIf you or your loved ones were affected by hurricane Michael food and water are available a distribution points across south west Georgia a full list is available at G. E. M. A. dot G. A. dot Gov\nTo mobile phone charging stations you're open in Albany at eleven hundred northwest over boulevard and one hundred west or both or boulevard another charging station is open a Donaldson bill a thrill one Wiley avenue anyone can charge their phones of these locations\nIf you need help with debris cleanup contact crisis clean up at eight hundred four or five one Nineteen fifty four\nCrews are still working to clear roads and restore power do not attempt to handle or cross damage power lines report them to your power company immediately as survivors and Baker Decatur Doherty early Miller and Seminole counties are eligible for disaster assistance through FEMA\nThose residents should file claims with their insurance companies first then visit disaster assistance dot Gov or call eight hundred six to one three three six to\n... It's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Noel King\nSecretary of state Mike Pompeo traveled to turkey today right after a visit to Saudi Arabia Pompeo was sent by the Trump Administration to try and find out what happened to Saudi journalist Jim ... the writer disappeared after entering Saudi Arabia us consulate in Istanbul\n... been critical of the Saudi Government and many people believe he was killed by Saudi agents but the Saudis so far are denying any knowledge and President Trump so far seems to be taking them at their word\nNPR's Peter Kenyon is with us now from assemble Hi Peter\nI Know so secretary of state Pompeo was on something a fact finding mission here uh what did he learn or not learn in these meetings in Riyadh and in Turkey\nIf you learn anything new from the Saudis there's been no public discussion of that so far he did say Riyadh is committed to a full transparent investigation\nOf the Saudis as you note deny any involvement in ... disappearance ah their stated position is still that he left the consulate freely within an hour of arriving and they don't know where he is a there are however these multiple media accounts reporting the Saudis were preparing to acknowledge it showed you died in the consulate during questioning\nTurkey ... certainly got a very different story\nThat counts reporting the Saudis were preparing to acknowledge it showed you died in the consulate during questioning\nNow in Turkey ... certainly got a very different story a Turkish investigators have said they have audio video evidence of the show just killing\nThis is NPR News\nServing daring and beyond ... an Eighteen station radio network of Georgia Public broadcasting good morning I'm Emily Jones\nThe Centers for Disease Control and prevention says it has confirmed it sixty two cases of a cute to laugh at ... deaths in children it's a rare condition causing weakness in the arms and legs and sometimes paralysis or details in twenty minutes right here on TPP\nIt's six twenty [laughter] it was\nJust ... moved from a large software to re ... more informed ever were on the radio was baseball was four days a week [laughter] if you were not just and now you can watch every Sunday Morning you're on\nYour nose for the most of the political rely on the radio and TV [laughter]\nSupport for CPB comes from you our listeners\nAnd the Georgia brain and spinal injury trust on commission advising that a traumatic brain injury as one caused by an external physical force such as a car accident fall or sports the commission can help details of B. S. I. T. S. dot Georgia dot Gov\nG. P. B. has been honored by the Georgia Associated Press media editors winning the top award for radio the pacemaker award we were also honored for best specialized reporting best anchor and best newscast CPB news stand with the facts\nWhen Debbie wrote this music for a ballet was picturing a game of tennis too young women and one young man in tennis love means nothing\nWe love is everything romance and adoption on the corner from us\nIn tennis love means nothing\nWe love is everything romance and ... on the courts from a concert by the New York philharmonic on the next performance from a piano [noise]\nTonight from eight to ten here on TPP\nSupport for NPR comes from this station and from T Rowe price offering a strategic investing approach that examines investment opportunities firsthand institutions advisors employers and individuals choose T Rowe price T Rowe price invest with confidence\nFrom campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email tablets a drag and drop email editor and twenty four seven customer service more campaign monitored dot com\nAnd from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring John Slattery\nAmanda Pete Paul Riser and Kathryn ... on a new episode every Friday on prime video\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Noel King\nMore than me is a charity that aims to educate and protect Liberian curls its founder is an American woman named Katie ... she has thousands of social media followers they're my lawyer tells stories about life in West point which is a slum in Liberia's capital\nStories like the one about a girl named Abigail here's my lawyer\nA little girl in Liberia who doesn't have a mom or dad a girl who was on the streets selling herself I don't live in years old because she didn't have a glass of clean water there are still on the streets when her dream is to go to school\nBut according to a report just released by ProPublica and time magazine some of the girls that more than me was supposed to be helping were victimized they were raped by a man who is a staff member with the charity Rachel Martin spoke with Finley young who wrote the story\nBefore we get into what went wrong with this charity more than me I Want to ask what was going right what's ... more than me apart from other charities at the beginning\nI think that more than me I'm particularly for undercut the mile or hugging incredible ability to connect with those who could commit money or resources to their mission\nOn I think that in a way\nBut clearly it's find or keep the mile or had an incredible ability to connect with those who could commit money or resources to their mission\nAnd I think that in a way this is a story about about social media on about how you present the story level really engage with hearts bubble make people reach into their pockets and think that the individually by taking a small steps are making a difference\nSo who is Katie mylar why did she start this organization\n... a woman from New Jersey who had a long background in doing various forms of gift community help and volunteer work who ended up in Liberia in two thousand and six on an evangelical internship\nAnd then from there she continued her relationship with the country and she started ... first registered in two thousand and eight\n[noise] she didn't have a lot of nonprofit management ditch you\nKnow and ... has been very clear and her own promotion of the organization that what she brought to this wasn't incredible depths of love it's a love driven organization\nHer co founder a man who really helped her start this organization on the ground in Liberia was an army Macintosh Johnson\nTell us about him\nI never met Macintosh Johnson but he was someone who was fundamental in starting up of disorganization he was a he was a guy who had had a childhood interrupted by war who told numerous people he'd be a child soldier\nEm and then in in West point had also been part of the vigilante groups which is a a group of you know community members who in the absence of of police um you know help to provide those kind of that kind of support to the community so he was a well known guy in the eighty of West point where he ... he was well liked\nAnd he became very highly trusted really very very quickly\n[noise] can you explain exactly what he was feeling the systematic way that he was abusing these girls\nJohnson was heavily involved in the recruitment of girls and he was the point person for the organization in West point it was viewed as his organization along with Katie my either and he was using that power according to what the girls told the court to abuse those who are within his high school of power\nAccording to what they told the court girls as young as ten years old I'm were exploited on numerous occasions and [noise]\nAnd when they talk to the court they all said that well he he threatened to remove me from the scholarship\n... the founder of the organization now while he was doing [noise]\nSomething that we ask Katie and ...\nFellowship did Katie ... the founder of the organization now what he was doing\n[noise] something that we ask Katie and something that we've reported or responses in the piece one detail of this which also helped in power Johnson was the fact that ... had an intimate relationship with them but she's conceded in an interview by that same year and twenty eleven\nThere was some form of conversation takes place which involves Johnson's ex wife who [noise]\nWho says that she said something along the lines of you know I told her that she loves the children but she didn't she didn't really get to\nMy lower recounts that conversation differently she'd Harrods she described I think there's rumors that Johnson had been in sexual relationships with young girls and she said she fold up and she asked the girls themselves and they said that he was a good man\nThere's a second level of tragedy to the story in that after Macintosh Johnson was arrested he stood trial it was a hung jury and after that it was revealed that he had HIV rain [noise] while it\nWas it was known by people within the organization and there were rumors it was never formally revealed that he had aids when he died\nAnd as a consequence you know potentially all of those who have contact with them which according to reports on to our reporting and also with the court documents and organizations internal documents was many many girls\nThat are potentially at risk now it's important to say that the ten girls who actually testified in court those who actually were willing to bring a case they were to be tested and one of them tested positive\n[noise] it's so complicated right because as you outlined in the piece Katie ... at one point to you in a bottle to whether or not her organization was responsible for that says\nYou know where are your schools where the schools that you have dealt in Liberia she clearly feels that even if her organization willfully or not turned a blind eye to this to be that it has been a net positive for the girls have Liberia\nYeah I think that you can see in in a lot of the responses we had in the charities leadership so there was this sense of why are you telling the story you know look at these other girls that we've educated\nBut I think that to to view this as you know just a an unavoidable thing that happened in the early points of the organization it just that's not a logic that we'd applied to to\nSexual abuse within an institution in any other context\nIn Liberia still allows the organization to operate schools there\nApply to to sexual abuse within an institution in any other context\nIn Liberia still allows the organization to operate schools there\nWell the story it's really hard in Liberia because of course a lot of people are involved in the building up as an organization like this you have local government to ... mile or had strong support from first of all from the president Ellen Johnson Sirleaf\nAnd then also the local local donor community I think I'm a local community the sense of\nA lot of people that feeling that something had gone wrong and this and this organization but didn't know the ... so there's a whole lot of soul searching going on on the government has announced a full investigation involving seven different ministries they've said that they are looking into reopening the case [noise]\nUm and they're living as well as more technical stuff like well how do we heard was a process for credit thing these organizations have we hold them accountable they're looking into whether the HIV aids policy was was followed and the school\nThat was Finley young for pro public I talking to Rachel Martin since his story was published Katie my lawyer has temporarily stepped down as CEO of more than me this is NPR News\nThe story the condition is known as a cute blasted my light is or a FM for short it can start with symptoms such as droopy eyelids and difficulties swallowing the CDC has confirmed sixty two cases in the last few months mostly in young children since\nThe CDC began tracking the disease four years ago and total of three hundred and eighty six cases have been confirmed\nLung case was a seven year old boy and his mother Susan coin says her son came down with an ear infection this was back in the fall of two thousand fourteen\nSo I took him to the pediatrician and she put him on a antibiotic\nBut within a few days Evan complained of severe pain in his back and legs he became extremely lists are jak and went downhill quickly\nTotal control and both his arms and legs you know one minute you have a healthy head and the next minute your kid is totally paralyzed it it it would be on horrifying to us\nIt's not clear what caused the evidence sickness and the CDC's Nancy ... says unfortunately the cause of this\nIt it was beyond horrifying to us\nIt's not clear what caused Evan sickness and the CDC's Nancy ... says unfortunately the cause of this condition is still unknown\nI'm frustrated that despite all of our effort we haven't been able to identify the cause of this mystery illness we don't know maybe at higher risk for developing and get them or the reasons why they may be at higher risk\nNothing ... says given the rise in cases the CDC is escalating its response and consulting with a variety of experts to solve the mystery they do know that some kids who get it have also had viruses such as enter a virus another possible risk factor is West Nile virus\nWhich so far there's no common pathogen that links all the cases\nDespite extensive laboratory testing we have not determined what pathogen or immune response or the arm or like weakness and paralysis and most of these patients\nGiven that the symptoms are similar to polio a disease that have been almost completely eradicate it ... pointed out that this does not polio\nRight now we know that polio virus is not the cause of these apps and cases CDC is tested every specimen from A. F. N. patients none of this stuff and then have tested positive for polio virus\nThe CDC says despite the increase in cases ask them is a very rare condition affecting fewer than one in a million children but she says it's good to be aware of the signs and symptoms the Ninety percent of those affected our children there are some cases and adults\nWe recommend seeking medical care right away if you or your child develops sudden weakness of the arms her legs\nAnd do the CDC can't give any specific information about what's causing a FM ... says it's good to take general precautions\nParents can help protect their children from serious diseases following prevention steps like washing their hands thing up to date on recommended immunizations and using insect repellent to prevent mosquito bites\nIn the case of Susan coin son Evan he's healthy again he was treated with steroids Andy was an occupational and physical therapy for Eighteen months\nFully recovered he has regained all movement and all strength in a foreign land\nBut this is not always the case some kids who've been diagnosed with a FM continue to have paralysis and require ongoing care Allison Aubrey NPR News\nOngoing care Allison Aubrey NPR News\nThis is NPR News\nServing bringing and beyond that says ... an Eighteen station radio network of Georgia Public broadcasting good morning I'm Emily Jones\nThe number of people living in poverty has decreased according to the world bank but new estimates comes with a couple of footnotes we'll dig into it in eight minutes on the marketplace morning report here on ...\nIn Georgia business news a California based sales software company it's expanding its regional headquarters in Georgia\nSales force says over the next five years it'll add six hundred jobs that its new sales force tower Atlanta the company says its new space will include community spaces where local nonprofits will be able to meet to free of charge\nSales force develops customer relationship management software that's used by retailing service companies to track sales and marketing to customers you're listening to G.\nP. B. it's six forty for\nA record number of Native Americans Saturday to running for office we could have an outsized influence on the mid term both major parties are giving these communities cause for concern\nWas that was Senator Elizabeth Warren ... tests for new ways making it harder for many Native Americans to task about what's next on on what [noise]\nThis morning at ten here on GDP\n\nSupport for G. P. B. comes from our monthly sustain hers and Georgia trend magazine for more than Thirty years covering Georgia business politics and economic development subscription information and more are available at Georgia trend dot com\nAnd Miller theater and Bob no check presents featuring an evening with Texas songwriters Lyle Lovett and Robert Earl keen October thirty first of the ... Miller theater tickets on sale now at the Miller box office and Miller theater Augusta dot com\nTo put too fine a point on it but sometimes you just want to listen to some music and sometimes you don't even want to choose what it is [noise]\nI'm Sarah ... let me do the choosing for you\nOn gp the night at ten\nThe only decision you need to make is to listen\nI'm Sarah ... let me do that you think for you\nOn gp the night it\nThe only decision you need to make it to me\nSupport for NPR comes from this station and from logged me in makers of go to meeting a collaboration meeting platform that comes equipped with features to help people stay focused to get work done learned more it go to meeting dot com\n[noise] from indeed used by over three million businesses for hiring where employers can post jobs and you screen or questions to build their short list of preferred candidates learn more it indeed dot com slash higher and from listeners like you who donate to this NPR station\n\nAnd you're listening to MORNING EDITION ... good morning mentally Jones going at county is the first into our time to have an all girls high school flag football league\nAnd then we want it to lose highschool lost their first two games but before the season started gp that Ross around talked with players and coaches about what it means to have an all girls' football team\nIf you close your eyes and listen to a practice that sounds the same for the most\nPart it rains out except\nOn most field of players are all\nGirls around her\n\nThoughts of sport being football team all girls there was another factor that sets this legal part becomes at no cost to the school or players\nThat's because the Atlanta Falcons are the financial arm being without seeing pays for uniforms wraps and other costs that come with wanting to lead and what better place to start the week in Georgia's largest school district actually Jeter as a sophomore on the loose high school team she says having the falcons support means a lot\nI appreciate that they did this for is you know the biggest like a big opportunity for and I think it's like oh my God if I can see this you know\nG there is vying for starting wide receiver spot for dilute wild cabs I went out to watch them practice a few days before the first game systems have coach ... Wilson says the lack of experience for girls playing football shouldn't hurt them every girl\nOut here is athletic and a couple of might not\nIt was soon have coach ... Wilson says the lack of experience for girls playing football shouldn't hurt them\nEvery girl out here is athletic and a couple of them might not have grown up\nNecessarily playing football with their big brother's every every week but they understand you know running throwing catching\nEach high school and the ... will have a team they'll play twelve games this season before a tournament style playoff interest and joining the Wildcats went well beyond the twenty roster spots coach Wilson said that led to some tough cuts even in their first season\nNot information meeting had fifty three girls ready to come out and play football and that's just who showed up I had twenty more just emailed me say hey I'm playing softball I'm playing volleyball\nCannot come out a little bit later it's like yeah I I got about Seventy girls that want to play but\nI don't have enough slots spots\nOn the team may be limited the effect of bleed goes beyond the girl was on the field Kimberly American coaches I call in show high school she says besides the actually the nose up a game this points to a larger narrative of quality\nWe always tell our kids the sky's the limit but then we put limits on them when girls can't play guy football so I think that this huge\nBank and says this is an opportunity for girls to show their skills on the field in an organized format just like boys where our rafts there are rules and they weren't too when you\nActually Jeter says she grew up watching her brother play and try it out because she wanted a chance to show her skills\nTried something new it was like growing up I was always painful by him in the yard and stuff like that\nShe says she's happy to have the same chance to play a game she enjoys just like boys her age is very important to me\nHow you doing anything that way they're doing that like if someone ... guided about it when that\nFrom a pen American public media [noise]\nNinety seven point seven FM double your G. P. B. S. W. A. G. P. H. D. room portable Georgia Public broadcasting radio network [noise]\nAnd believe GBH leave room for the Georgia Public broadcasting radio network [noise]\n\nLive from the G ... newsroom I'm Emily Jones good morning\nAhead the disappearance of journalists ... in the Saudi Arabian consulate in ... in ... and has focused scrutiny on us Saudi relations\nWill have more in just under ten minutes in Georgia news of the day after President Trump's visit to the state to survey damage to farms from hurricane Michael farmers are wondering exactly what help they can expect ... grand Blankenship reports the storm is only the latest in a string of disasters for agriculture\nMany south Georgia cotton farmers were already nervous about paying back to the bank this year after they were extended credit when Hurricane Irma damaged last year's crop ... cotton farmer engine operator and south Georgia's Marion County he says hurricane Michael leave struggling farmers with another big question\nHere we are doing another year people going through a device go with the sushi or you know\nGeorge agriculture to Mr Gary ... says the restructuring of debt to keep farmers afloat could be so big it could take an act of Congress for pecan farmers the loss of decades old trees is compounded by the one hundred million dollars in losses\nDue to the trade war with China project could be News I'm grant Blankenship and make\nAnd today's forecast cloudy skies for North and middle Georgia again today we should have sunshine in South Georgia temperatures ranging from lower seventies in the north to low nineties and the southeast and there is a slight chance of rain today\nFrom or Georgia News Go to G. P. V. news dot org and follow us on Facebook and Twitter at ... news it's seven oh one\nLine from NPR News in Washington encore of a Coleman the death toll from hurricane Michael is rising nearly a week after the storm made landfall\nAt least twenty six people have been killed and Florida officials say that number sixteen people perished in that state what's unclear is how many people are missing NPR's Debbie Elliott has more\nOf the debts are reported in Bay county where hurricane Michael made landfall last week with a hundred and fifty five miles per hour winds search and rescue efforts continue thousands of people are still unaccounted for the response has been hampered by heavily damaged and for ...\nOur wins search and rescue efforts continue thousands of people are still unaccounted for the response has been hampered by heavily damaged infrastructure roads electricity and communication systems\nProlonged cell phone outages have made it difficult for friends and family to check on people who remained in the Florida Panhandle during the storm\nGovernor Rick Scott has been critical of telecommunication companies or not restoring service more quickly Debbie Elliott NPR News\nSecretary of state Mike Pompeo has arrived in on corrupt for talks with Turkish leaders over the disappearance and suspected murder of Saudi Arabia and writer ... ... spent a day in Riyadh talking with the Saudi king and crown prince and says they've opened an investigation\nNo exceptions to withhold account just for the river where they they understand the importance of assertions\nThey're determined to get to the bottom of it and if they will conduct the reform ...\n... a critic of the Saudi Government vanished October second after entering the Saudi consulate in Istanbul, Turkey Turkish officials have said they believe he was killed inside and his body removed something the Saudis deny\nPresident Trump initially said there would be consequences if the Saudis were found to be responsible now he's comparing criticism of the Saudis to allegations of sexual assault against Supreme Court justice Brett Kavanaugh the Trump says is innocent\nThe U.S is offering ten million dollars for information leading to the rest of the head of Mexico's most powerful drug cartel NPR's Carrie Kahn reports the Justice Department announced the reward as part of a crackdown on the ... new generation cartel\nAttorney general Jeff Sessions says the ... state based ... models at least five tens of cocaine and five tens of math and to the U.S each month it's one of the five most dangerous criminal groups in the world\nThey announced reward is double what the U. S. offered last march for the rest of the cartels leader ... to get us advantage\nMexico is also offering a reward of about one point six million dollars for oh the editor Rashed known by the nickname amen show\nUs prosecutors also announced Fifteen indictments against members of the ... got a new generation officials say the cartel has influence in Seventy five percent of Mexico and in several countries around the world Carrie Kahn NPR News Mexico City\nYou're listening to NPR the Taliban are claiming responsibility\nYou around the world Carrie Kahn NPR News Mexico City you're listening to NPR\nThe Taliban are claiming responsibility for a bomb blast that killed a parliamentary candidate in Afghanistan the explosive was hidden in the office of Abdul Jabbar ... who was standing for re election in uh southern Afghan province\nHe's the seventh Afghan political candidate to be killed by the Taliban were by ISIS\nHarvard University's dean of admissions is defending the school's admissions policies against allegations of bias against Asian American applicants\nFrom member station WBUR GBH in Boston Kirk Carapezza reports on the latest in the federal case on affirmative action\nThe group students for fair admissions is led by a conservative legal strategist who works to oppose race conscious policies in any form the group's lawyers point to it too doesn't Thirteen internal investigation into Harvard admissions records\nIt found that a few Asian American applicants were described with terms such as quiet shy and good at math\nAnd lumped together with other applicants of the same ethnicity on the stand for a second day Harvard longtime dean of admissions William fitzsimmons so the university doesn't endorse those comments but of course them if it's him and said raise is never a determining factor but it can make a difference in some cases his testimony will continue on Wednesday\nFor NPR News I'm Kirk Carapezza in Boston\nThere was no winner drawn in last night's mega millions lottery the jackpot ruled over it is now swelled to eight hundred sixty eight million dollars the Associated Press says that's the second largest jackpot in us history\nThe next drawing will be on friday corporate Coleman NPR News\nSupport for NPR comes from NPR stations other contributors include Subaru featuring the all new three row ascent with seating for up to eight and a choice of second row captain's chairs love it's what makes us Subaru a super will learn more at ... dot com\nGood morning thanks so much for starting your Wednesday with MORNING EDITION ... and ...\nAnd this morning not a I'm a rod was held captive by ISIS fighters and subjected to horrific abuses yet she refused to remain silent a conversation with this Nobel Peace prize winner in Fifteen minutes writing\nRafik abuses yet she refused to remain silent a conversation with this Nobel Peace prize winner in Fifteen minutes right here on ...\nIf you or your loved ones were affected by hurricane Michael food and water are available at distribution points across southwest Georgia a full list is available at G. E. M. A. G. A. dot Gov\nTo mobile phone charging stations are open in Albany at eleven hundred northwest over boulevard and one hundred west Ogle Thor boulevard another charging station is open and Donald Seville at thrill one widely avenue anyone can charge their phones these locations\nIf you need help with debris cleanup contact crisis clean up at eight hundred four or five one Nineteen fifty four\nCrews are still working to clear roads and restore power do not attempt to handle or cross damage power lines report them to your power company immediately\nAnd survivors and Baker Decatur Doherty early Miller in seminal counties are eligible for disaster assistance through FEMA those residents should file claims with their insurance companies first then visit disaster assistance dot Gov or call eight hundred six to one three three six to\n... It's MORNING EDITION from NPR News I'm Noel King\nAnd I'm Steve Inskeep President Trump has dug in supporting Saudi Arabia's crown prince\nIn the same way that he dug in for a Supreme Court justice literally the same the president compare to judge accused of sexual assault with a Saudi leader accused of ordering a murder here we go again so the president and an AP interview guilty until proven innocent\nHis secretary of state just visited Saudi Arabia as well as turkey or a Saturday writer disappeared but my palm pale explicitly said he did not ask about the facts of the case he only said he wanted a transparent process\nWhat are the Trump Administration and the Saudis doing Washington Post columnist David Ignatius knows people well in both capitals Washington in Riyadh and he's in our studios David welcome back\nThank you you would think that a U.S administration would be acting in support or as an advocate for a U.S resident too has disappeared this writer has disappeared who's connected with your paper I guess we should mention\nUm butter the two countries actually working together\nHere well that's that's the biggest fear after Trump's comments and pump as visit to the U. S. is trying to help Saudi Arabia cook up a a process that will uh rather than putting out the facts put out a a cover story that ah the supports the Saudi leadership we should be the ...\nA process that will uh rather than putting out the facts put out a a cover story that ah that supports the Saudi leadership\nWe should be demanding as American citizens that our government our our president sector I said hold the Saudis accountable the democracy or she was my colleague at the Washington Post but he lives in Virginia lives\nThis is NPR News and this is MORNING EDITION on jeep ... good morning I'm Emily Jones North Carolina has fewer early voting locations this year so some people will have to travel farther\nAnd there's a lot of research that suggests that whenever you move a polling place further away from a voter that are less likely to go there\nKnew early voting rules in North Carolina and concerns over voter turnout that story in twenty minutes here on cheap e B it's seven twenty\n[noise] it was just ... it was but moved from a large software to re ... forms were on the radio was ... I was fortunate to\nBe we're not just and now you can watch every Sunday Morning you're on she joined us for the most useful drawn about political reform on the radio and TV [laughter]\nSupport for G. P. B. comes from our monthly sustain hers and Carlyle place in making by now doesn't help the bully accredited life plan community in central Georgia offering active seniors and maintenance free lifestyle and the security of having a plan\nShould healthcare needs change Carlisle place dot org and Miller theater and national shows to present in country folk pioneer Mary cheapen carpenter October twenty six of the best as Miller theater\nTickets were married taping carpenter available at the Miller box office and Miller theater at ... dot com\nA record number of Native American candidates are running for office we could have an outsized influence on the miss her [noise] still both major parties are giving these communities cause for concern\nWas that was Senator Elizabeth Warren DNA test for new ways of making it harder for many Native Americans to cash about as much time on one\nOne day It's MORNING at ten\nTest for new ways making it harder for many Native Americans for tax about what's next time on one [noise]\nHair one ha this morning is Han right here on your TV station [noise]\n[noise]\nSupport for NPR comes from this station and from Amazon Web services used by millions of customers a W s provide the range of cloud services and functionality from tools to security to compliance more information to build on ... W s\nFrom it lost in the collaboration software company powering teams around the world committed to providing the tools and practices to help teams plan track building work better together more at ... dot com\n[noise] and from Lyndon mood bell learning process is committed to helping all students learn to their potential they're learning centers and on line private school offer instruction and reading comprehension Lyndon mood bell dot com slash NPR\nIt's MORNING EDITION from NPR News I'm Noel King\nAnd I'm Steve Inskeep good morning when the Nobel Committee said that ... that was one of the recipients of this year's peace prize they cited her courage\nShe refused to accept the social code requires women to remain silent on the face of the view this to which they had been subject says\nFour years ago as ... fighters enslaved thousands of women and girls in Iraq many were repeatedly raped and sexually abused in other words\nNot him rod was one of those women she was only Twenty one years old at the time and from a tiny but ancient religious minority group the ...\n... people and their money and they just on a simple life they they can they can leave we\nGroup in Iraq in even hand but and they are they're very ... piece he ... he said yeah they just want to live in peace and can you say\nFeel safe I talked to ... and NPR's Washington studios earlier this week it was her first full interview since she won the Nobel Peace prize with the help of an interpreter she spoke mostly in ... which is her native language about what she now hopes to chief I'm diminishing um\nWith the help of an interpreter she spoke mostly in ... which is her native language about what she now hopes to achieve\nUm diminution I'm ... and we have set it over and over that it's important for us the justice is done out of the six thousand UCD women who were abducted by ISIS we hope to see at least one ISIS number who did this\nTo one me as a woman to be punished for the crimes they committed against gives me the women have been we hope to see them in court in public\nI think it is easy to see winning the Nobel Peace prize as a kind of combination or end of a person's career you've you've done what you set out to do\nIn your case at twenty four years old that is clearly not true you clearly feel like you have a lot left to do what is next for you after winning the prize\nI'm twenty five to twenty five ...\nAnd ... after I delivered our message and we have as a community delivered our message that we would like to see the reconstruction of our homeland infringe are taking place at and to provide security for ... so that they can go back\nAnd we would like to see this never happen again could not get any other community or any other religion or any other group are you angry\nUs in the ... I can just simply say I'm angry cheap because of that word only will not describe how much we have suffered but what I can say is that we are right we have the right to speak about this we have the right to deliver a message\nIf anger doesn't quite capture it what is the word what do you feel every day\nOr what chemicals to showed him out you know like I said what makes us feel good at least is that we are delivering a peaceful and I said look we are not delivering a message to hurt anyone uh when I meet with students and residents and anyone\nI speak about what happened to us and I deliver my message with a clear conscience that I advocate for people\nDuring our half hour interview not humor odd seemed at times pretty shattered but also strong she says that strength comes from her UCD identity she calls the rape of using the women and the murder of UCD men including many people in her own family a genocide\nShe wants these atrocities to be classified as war crimes but even after winning the Nobel Peace prize she's not sure if that's going to happen and she sometimes find yourself first\nShe wants these atrocities to be classified as war crimes but even after winning the Nobel Peace prize she's not sure if that's going to happen and she sometimes finds herself frustrated oh\nWhat goes on and I tried them annoying and sometimes I feel that my message has not been clearly heard what that is not my fault because I feel like too much is going on in terms of one of the victims and it's not the first time and certainly it's not the last time\nAnd perhaps every year a woman someplace in the world or groups of woman ... will be victims of sexual violence or terrorist groups and so I feel like this is not new to people and it's not going to be the last time I think people have become numb to this kind of news\nI'm your mother your mother was killed by the Islamic state and I wonder when you think about her now\nWhat do you think she would think about everything that you've done what do you think she would think about you having won a Nobel Peace prize being the voice of the ... community to the rest of the world how do you think your mom would feel [noise]\nKnew some of the day they had the hookah hybrid on when I received this news it was around probably five\nAM in the morning and the U.S we diverted on the first thing I did was look at her picture and cry but because they felt that he needed her ... and not just her what the eighty woman the ... are women that were with her\nAnd they were all executed for no reason just for being ... and for being older women I feel like they will be proud\nProud\nYou were twenty five years old you've just gotten engaged congratulations things [noise] your life is not what you thought it was going to be just a couple of years ago what kind of life do you want for yourself now [noise]\nOr her ... month on a yes we have got engaged was just too difficult for me to deal with all of that so much as much as I Try to come close to finding a simple life nicer things come up and then we have to deal with them and they'll continue this work\nBut I Hope that I can say oh I Want to learn English I work on my English in school\nAnd I want to create a family with my fiance and being able to live a simple life\nAnd just be safe\nI Hope you get exactly what you want to\nYou know what I'm saying and being able to live the simple life and just be [noise]\nI Hope you get exactly what you want [noise]\nIt was really a pleasure speaking to your not humor I thank you so much [noise]\n\nThank you for listening to us on your local member station you can keep the conversation going with us on social media\nI'm Noel King you can reach me on Twitter at Noel King Rachel Martin is at Rachel NPR David Greene is at NPR green and Steve Inskeep is at nprinskeep to find out more about the people who put the show together everyday go to our website NPR dot org slash MORNING EDITION and click on the staff\nTaps to read about are amazing crew of editors and producers [noise]\n\nRight and a state where a voter id redistricting and early voting rules have all been struck down by the courts at various points in the last few years\nDuring a Jew and debate about early voting democratic state representative Amos Quick said the requirement that if one side is open on the weekend the rats also have to be could discourage counties from having any weekend hours\nWeekend early voting has been prefer and has been about certain populations and certain religions right to vote as not only been alive and well there's been rejected in recent court decisions\nHe's referring to black voters and appeals court ruled a twenty Thirteen lot that among other things caught early voting by a week targeted African Americans with quote surgical precision but Republicans who champion this law argue they're only trying to minimize confusion here state representative David Lewis also during the Jim debate\nWhat we stood out would be an issue to do was to be able to make you more reliable and the older dog voters would know that the early voting sites or stocks in the county was open from ... I'm In the morning to sit on the evening\nThe law has some bipartisan opposition run riot and the Republican Party chair of ... county about fifty miles north of Charlotte the county has had to cut its early voting sites and half frustrated just word we'll go we'll juice and he says even though this may not seem like an unfunded mandate\nThat's exactly what it translates to being at the end of the day\n... counties with smaller election budgets like ... are disproportionately affected by this change well individual locations maybe open longer there will be Seventeen percent fewer sites this election MIT political scientist Charles Stuart that third says that for voters convenience Trump's hours\nAnd there's a lot of research that's been done that suggests that whenever you move a polling place further away from a voter that are less likely to go there\nStewart says the rule change could simply shift turn out to election day which could mean longer lines at the polls in a state or a voting rights have become such a political hot potato elections officials say they just go with the flow Becky ... at the elections director in ... county\nDue to court cases legislation all of that kinda thing factors in and it just seems like we always have something like that [noise]\nTexas in a different direction\nThe question remains voters adapt as easily\nFor NPR News I'm Alex okay\nIt's NPR news\nYou're listening to MORNING EDITION ... good morning I'm Emily Jones and Jonah Hill's directorial debut a Thirteen year old boy from a troubled home finds his crime through skateboarding\nEl talks about his movie mid nineties and eight minutes right here on GDP\nThan at eight o'clock it's ... [noise]\nYou're listening to MORNING EDITION here on gp being born Eighteen station radio network of Georgia Public broadcasting including eighty nine point seven FM in making and you can listen to us on your radio but you can also with an online at gp the news dot org or using the G. P. V. smartphone app\nI make the chalk river already coming up with an excellent point tears once changed the American market place with the mail order catalogue and its doors at Seoul just about everything now is filing for bankruptcy will take a look at the retail industry the latest disruption what's coming up with an excellent point from NPR's [noise]\nThis morning at eleven right here on ...\n\nSupport for G. P. B. comes from our monthly sustain yours and regions bank offering regions mobile banking mobile deposit an online banking with Bill pay convenient tools to manage finances the supply information is available that regents dot com slash online banking\nLater today on this American Life\nOne month before Seventeen people died at Marjory Stoneman Douglas High school in Parkland, Florida school did this intense training everybody in the school board revamped new procedures what they were supposed to do in case someone showed up at school and started shooting we wondered did it help\nThey haven't seen people down to the city was due to make things worse for\nStrategy started to show success\nAnd then what happened in September is a major ...\nViolent attacks by the rebels including one in a city called Benny where they killed more than twenty people mostly civilians\nPopulation of interested enough is enough\nPeople who for years have felt completely abandoned by the government and the international community started turning against the health workers who were seen as an arm of the government people would say\nLook you cover even during the security\nWhy should we go along with this unfamiliar anti Ebola campaign you're pushing\nNail salon stresses that the vast majority of people are still cooperating but rumors has started that the vaccination campaign is actually a plot to spread the disease members at a safe burial teams were attacked with rocks and severely injured and often after rebel attack whole neighborhoods shut down in protest\nWindow to live in the streets of barricaded by young people sometimes burning cars are objects\nAnd sometimes ... the ... other ...\nIn the last week and a half the effects of this have started to become clear with not just a rise in the number of new cases each week but ever more cases who contracted Ebola from someone the W. H. O. had not previously known about\nThat's the situation that the emergency committee that's meeting today has been asked to assess David Hayman is an infectious disease expert in an advisor to the W. H. show\nSome fielded by calling the public health emergency or increased political importance of the event will pursue we increased the mobilization of funds\nThe deli they chose asked for thirty three million dollars to help neighboring countries prepare for the possibility of a spread across their borders and declaring this kind of emergency could also have a wider affect\nTime students and I'm Noel King [noise]\n[noise]\nBe seven point seven FM WG BP and believes you be each room for the Georgia Public broadcasting radio network [noise]\n\nLive from the G ... newsroom I'm Emily Jones good morning\nI had this morning the role of Latino voters in Florida's Senate race that's in about Fifteen minutes but first today's Georgia headlines with only weeks before the midterm elections or does election system\nIs facing a pair of lawsuits tied to voter registration problems and issues with absentee ballots TV's Stephen Fowler reports\nMore than a thousand absentee ballots have been rejected across Georgia so far about a third of them come from when a county libertarian candidate for secretary of state's my Duval is one of the plaintiffs\nAmong [noise]\nOne of the most common reasons for addiction is putting twenty Eighteen instead of the voters birth year when signing off from the ballad\nThe suit wants minor errors like that to be accepted and counted groups of also sued over a state law that puts registrations on a pending list of their application does not exactly match the database for ... years I'm Steven Fowler in Atlanta\nA new report from the government Accountability Office says Medicaid expansion could improve the health of Georgia's adults with low incomes\nThe twenty sixteen study released this week finds that people in states without Medicaid expansion and we're more than twice as likely to go without needed healthcare as people in states that did expand Medicaid they are also less likely to have regular checkups in dental care and more likely to get medication because they can't afford it\nGeorgia is one of Seventeen states that has not expanded Medicaid\nFrom Georgia News Go to G. P. B. news dot org and said oh one\nLine from NPR News in Washington encore but Coleman secretary of state Mike Pompeo is going on for a turkey for discussions about the case of missing Saudi Arabian journalist ... ... Turkish officials have suggested he was killed inside as Saudi consulate in Istanbul and his body removed\nThe Saudi Government is vehemently denied that secretary Pompeo traveled to Saudi Arabia to speak with the Saudi king and\nSchool and his body removed the Saudi Government is vehemently denied that secretary Pompeo traveled to Saudi Arabia to speak with the Saudi king and crown prince and NPR's Michel ... says reporters question ... about that conversation\nWe asked him directly to the Saudis tell you that they killed ... and he said he didn't want to discuss the facts and the case and he didn't and he said the Saudis didn't either he said that was reasonable to give them time to investigate any also a cold district incredibly successful\nBecause he said they agreed to fully investigate this um which by the way something they've said before and\nOf course you know early on they said that to show he left the conflict and their story seems to seems to be changing but we didn't really hear I'm a I'm a away in on any of that\nNPR's Michel ... traveling with the secretary in on correct turkey\nLeaders in the European Union are gathering in Brussels for what it's supposed to be the deadline for a deal to ease the United kingdom out of the block by next march NPR psoriasis are hiding Nelson reports from the Belgian capital no deal appears to be forthcoming\n... a lot still needs to happen even if the leaders were to agree on a breakfast strategy during the summit here\nExperts have to hammer out details of the continental sized divorce and the twenty eight you parliament's must ratify the deal that President Donald Tusk says negotiations are once again stalled over the same thing I guess before what to do about the border between Ireland\nWhich is a member state and Northern Ireland which is in the u._k.\nIs looks like a ... of the gold yellow [noise]\nI was also a guy come to you and your version of those are great for the call\nThem and British prime minister Theresa May to deliver new facts that could break the log jam psoriasis are heading out and NPR News Brussels\nWall Street opens in about an hour and a half\nAfter closing the day sharply higher on Tuesday the federal government released news showing the labor market is in good shape with a lot of job openings\nAnd big companies release better than expected earnings news this week NPR Scott Horsley says President Trump is complaining about rising interest rates even as the stock market looms up\nThe Federal Reserve has been slowly but steadily increasing interest rates and that boost costs for all kinds of debtors including the federal government itself the federal deficit balloon by Seventeen percent\nSaying interest rates and that boost costs for all kinds of debtors including the federal government itself the federal deficit balloon by Seventeen percent and the fiscal year that just ended and the government's expected to borrow more than a trillion dollars in the upcoming year\nNPR Scott Horsley this is NPR\nOfficials in the U.S southeast have increased the death toll from hurricane Michael at least twenty six people have been killed sixteen of them in Florida where Michael made landfall a week ago additional people died in Georgia North Carolina and Virginia the number of missing people may be in the thousands\nAbout Ninety percent of all the immigrant children taken from their parents at the U.S border have now been released from us custody but as NPR's John Burnett reports more than two hundred children remain in shelters\nThe office of refugee resettlement that oversees the government's youth shelters reports that two thousand three hundred and sixty three migrant children who were taken from their parents as part of the Trump administration's controversial zero tolerance policy had been released as of Monday\nOf the remaining two hundred and forty five kids still in shelters a majority of them are there because their parents were deported back to Central America\nThe American civil liberties union which successfully sued the government to reunify families says almost all the parents back in Central America had been contacted to find out if they want to be reunited with their children\nAnd ACLU attorney says two thirds of those deported parents want their kids to remain in the U.S where there'll be safe from criminal gangs and food insecurity in their hometowns John Burnett NPR News\nThere's been an explosion at a college in Crimea region that Russia annexed from Ukraine officials say at least Thirteen people have died in the Kremlin says the blast could have been an act of terrorism\nRussian officials believe the blast may have been caused by an unidentified explosive device on core of a cool and NPR News\nSupport for NPR comes from NPR stations other contributors include Hitchcock's insurance providing customize insurance for small and medium businesses so they can do more and be more learn more at age ... CEO X. dot com or from an agent Hitchcock's insurance encourage courage\nMorning thanks so much for starting your Wednesday with MORNING EDITION on TPP mentally counts public on and time magazine report some of the girls that a charity in Liberia was supposed to be helping became victims\n[noise] public on and time magazine report some of the girls that a charity in Liberia was supposed to be helping\nBecame victims raped by a charity staff number more have a conversation with investigative reporter Finley young about the charity more than me and Fifteen minutes right here on CPB\nIt's eight oh seven\nIf your your loved ones were affected by hurricane Michael food and water are available a distribution points across southwest Georgia a full list is available at G. E. M. A. G. A. dot Gov\nTo mobile phone charging stations are open in Albany at eleven hundred northwest over boulevard and one hundred west ... boulevard another charging station is open and Donald Seville at three oh one widely avenue anyone can charge their phones with these locations\nIf you need help with debris cleanup contact crisis clean up at eight hundred four or five one Nineteen fifty four\nCrews are still working to clear roads and restore power do not attempt to handle or cross damage power lines report them to your power company immediately as survivors and Baker Decatur Doherty early Miller and seminal counties are eligible for disaster assistance through FEMA\nThose residents should file claims with their insurance companies first then visit disaster assistance dot Gov or call eight hundred six to one three three six to ...\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Noel King\nSecretary of state Mike Pompeo traveled to turkey today right after a visit to Saudi Arabia Pompeo was sent by the Trump Administration to try and find out what happened to Saudi journalist Jim ... the writer disappeared after entering Saudi Arabia us consulate in Istanbul\n... been critical of the Saudi Government and many people believe he was killed by Saudi agents but the Saudis so far are denying any knowledge and President Trump so far seems to be taking them at their word\nNPR's Peter Kenyon is with us now from assemble Hi Peter\nI Know so secretary of state Pompeo was on something a fact finding mission here uh what did he learn or not learn in these meetings in Riyadh and in Turkey\nWell if you learn anything new from the Saudis there's been no public discussion of that so far he did say Riyadh is committed to a full transparent investigation\nOf the Saudis as you note deny any involvement in 'cause she'll get disappearance or their stated position is still that he left the consulate freely within an hour of arriving and they don't know where he is a there are however these multiple media accounts reporting this out\nThere is data position is still that he left the consulate freely within an hour of arriving and they don't know where he is a there are however these multiple media accounts reporting the Saudis were preparing to acknowledge ... died in the consulate during questioning\nTurkey ... certainly got a very different story a Turkish investigators have said they have audio video evidence of the show just killing\nThis is NPR News\nServing core deal and beyond ... Eighteen station radio network of Georgia Public broadcasting good morning\nAnd Emily Jones the Centers for Disease Control and prevention says it has confirmed sixty two cases of acute flattered my LA deaths in children and that's a rare condition causing weakness in the arms and legs and sometimes paralysis will bring you the latest in twenty minutes right here on ...\nIt's a twenty\nOn the next fresh air the creator of the net flicks comedy series bow jak horsemen Raphael Bob Blacksburg so jak as an animated comedy with a cast of humans and animals bow jak as a horse was a depressed alcoholic sexist former sitcom star the series satirized the\nHollywood and pop culture and the new season is set\nAfternoon it's three on TV and ...\nDot org support for CPB comes from you our listeners\nAnd the John Ensign James L night foundation helping public radio advance journalistic excellence and the digital age night foundation beliefs informed and engaged communities are essential for healthy democracy more at night foundation dot org\nAnd Miller theater and Bob no check presents featuring an evening with Texas songwriters Lyle Lovett and Robert Earl keen October thirty first at Augusta Miller theater tickets on sale now at the Miller box office and Miller theater Augusta dot com\nA record number of Native American candidates are running for office we could have an outsized influence on the mentor still both major parties are giving these communities cause for concern\nNative American candidates are running for office we could have an outsized influence on the miss her still both major parties are giving these communities cause for concern\nWas that was Senator Elizabeth Warren DNA test for new rules making it harder for many Native Americans to task about what's next time on one [noise]\nMarijuana a this morning a tan right here on your TV station [noise]\n[noise]\nSupport for NPR comes from this station and from T Rowe price offering a strategic investing approach that examines investment opportunities firsthand institutions advisors employers and individuals choose T Rowe price T Rowe price invest with confidence\nFrom Viking dedicated to bringing the traveler closer to the destination by river and by the offering a small ship experience with a shorter excursion included in every port learn more at Viking Cruises dot com\n[noise] and from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring John Slattery Amanda peach polarize er and Kathryn ... on a new episode every Friday on prime video\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Noel King more than me\nIs a charity that aims to educate and protect Liberian curls its founder is an American woman named Katie ... she has thousands of social media followers they're my lawyer tells stories about life in West point which is a slum in Liberia's capital\nStories like the one about a girl named Abigail here's my lawyer\nA little girl in Liberia who doesn't have a mom or dad a girl who was on the streets selling herself at eleven years old because she didn't have a glass of clean water there should be no girl on the streets when her dream is to go to school\nBut according to a report just released by ProPublica and time magazine some of the girls that more than me was supposed to be helping were victimized they were raped by a man who is a staff member with the charity Rachel Martin spoke with Finley young who wrote the story\nBefore we get into what went wrong with this charity more than me I Want to ask what was going right what's ... more than me apart from other charities at the beginning\nI think that more than me I'm particularly\nI Want to ask what was going right what's at more than me apart from other charities at the beginning\nI think that more than me and particularly its find or keep the mile or had an incredible ability to connect with those who could commit money or resources to their mission\nAnd I think that in a way this is a story about about social media on about how you present the story level really engage with hearts but will make people reach into their pockets and think that the individually by taking a small steps are making a difference\nSo who is Katie my other why did she start this organization\nKitty mother's a woman from New Jersey who had a long background in doing various forms of gift community help volunteer work who ended up in Liberia in two thousand and six on an evangelical internship\nAnd then from there she continued her relationship with the country and she started ... first registered in two thousand and eight\n[noise] she didn't have a lot of nonprofit management did she\nKnow and kicked him ... has been very clear and her own promotion of the organization that what she brought to this was an incredible depths of love it's a love driven organization\nHer co founder a man who really helped her start this organization on the ground in Liberia was an evening Macintosh Johnson\nTell us about him [noise]\nI never met Macintosh Johnson but he was someone who is fundamental in starting up of disorganization he was a he was a guy who had had a childhood interrupted by war who told numerous people he'd be a child soldier\nUm and then in in West point had also being part of the vigilante groups which is a group of you know community members who in the absence of of police um you know help to provide those kind of that kind of support to the community so he was a well known guy in the eighty of West point where he operated he was well liked\nAnd he became very highly trusted really very very quickly\n[noise] can you explain exactly what he was stealing the systematic way that he was at these in these girls\nJohnson was heavily involved in the recruitment of girls and he was the point person for the organization in West point it was viewed as his organization along with ... and he was using that power according to what the girls told the court to abuse those who are within his high school for power\nAccording to what they told the court girls as young as ten years old I'm were exploited on numerous occasions and [noise]\nAnd when they talk to the court they all said that well he he threatened to remove me from the scholarship\nTen years old I'm were exploited on numerous occasions and [noise] and when they talk to the court they all said that well he he threatened to remove me from the scholarship\nGet Katie ... the founder of the organization now what he was doing [noise]\nSomething that we ask Katie and something that we've reported our responses in the piece one detail of this which also helped in power Johnson was the fact that my mother had an intimate relationship with him but she's conceded in an interview by that same year and twenty eleven\nThere was some form of conversation takes place which involves Johnson's ex wife who\nSays that she said something along the lines of you know I told her that she loves the children but she didn't didn't really get it\nMy my lower recounts that conversation differently she'd Harrods she described I think is rumors that Johnson had been in sexual relationships with young girls and she said she fold up and she asked the girls themselves and they said that but he was a good man\nThere's a second level of tragedy to the story in that after Macintosh Johnson was arrested he stood trial it was a hung jury and after that it was revealed that she had HIV rain [noise]\nWhile it was it was known by people within the organization and there were rumors it was never formally revealed that he had aids when he died\nAnd as a consequence you know potentially all of those who had contact with them which according to reports on to our reporting and also if the court documents and organizations internal documents was many many girls\nThat are potentially at risk now it's important to say that the ten girls who actually testified in court to those who actually we're going to bring a case they were to be tested on one of them tested positive\n[noise] it's so complicated right because as you outlined in the piece Katie ... at one point to you in a bottle to whether or not her organization was responsible for this says\nYou know where are your schools where the schools that you have dealt in Liberia she clearly feels that even if her organization willfully or not turned a blind eye to the cities that it has been a net positive for the girls have Liberia\nYeah I think that you can see in in a lot of the response as we have from the Chinese leadership to there was this sense of why are you telling this story you know look at these other girls that we've educated\nBut I think that to to view this as you know just a an unavoidable thing that happened in the early points to organization it just that's not a logic that we'd applied\nBut I think that to the view this as you know just a an unavoidable thing that happened in the early points of the organization that just that's not a logic that we'd applied to to sexual abuse within an institution and any other context\nIn Liberia still allows the organization to operate schools there\nWell the the story is really hard in Liberia because of course a lot of people are involved in the\nBuilding up as an organization like this you have local government to ... mile or had strong support from first of all from the president Ellen Johnson Sirleaf [noise]\nAnd then also the local local donor community I think I'm a local community or the sense of\nA lot of people at a feeling that something going wrong in this and this organization but didn't know the ... so there's a whole lot of soul searching going on on the government has announced a fool investigation involving seven different ministries they've said that they are looking into reopening the case [noise]\nUm and they're looking as well as more technical stuff like well how do we are both our process for credit thing these organizations have we hold them accountable they're looking into whether the HIV aids policy was was followed and the school\nThat was Finley young for pro public I talking to Rachel Martin since his story was published Katie my lawyer has temporarily stepped down as CEO of more than me this is NPR News\nThe condition is known as a cue to slash said my light is or a a ... for short it can start with symptoms such as ... I Lived the difficulties following the CDC has confirmed sixty two cases and the last few months mostly in young children\nSince the CDC began tracking the disease four years ago and total of three hundred and eighty six cases have been confirmed\nOne case where the seven year old boy and his mother Susan coin says her son came down with an ear infection this was back in the fall of two thousand fourteen\nSo I thought you were to the pediatrician and she put him on a antibiotic\nBut within a few days Evan complained of severe pain in his back and legs he became extremely lists are jak and went downhill quickly\nHe total control and both his arms and legs you know one minute you have the healthy head and the next minute your kid is totally paralyzed it it it was beyond horrifying to us\nIt's not clear what caused Evan sickness and the CDC's Nancy mess\nAt your kid is totally paralyzed it it it was beyond a horrifying to us\nIt's not clear what caused Evan sickness and the CDC's Nancy ... says unfortunately the cause of this condition is still unknown\nI'm frustrated that despite all of our effort we haven't been able to identify the cause of this mystery illness we don't know maybe at higher risk for developing and get them or the reasons why they may be at higher risk\nNothing ... says given the rise in cases the CDC is escalating its response and consulting with a variety of experts to solve the mystery they do know that some kids who get it have also had viruses such as intro virus another possible risk factor is West Nile virus\nWhich so far there's no common pathogen that links all the cases\nDespite extensive laboratory testing we have not determined what pathogen or immune response or the arm or like weakness in paralysis and most of these patients\nGiven that the symptoms are similar to polio a disease that have been almost completely eradicate it meant than you pointed out that this does not polio\nRight now we know that polio virus is not the cause of these Athens cases CDC is tested every school specimen bum a F impatience none of this stuff and then have tested positive for polio virus\nThe CDC says despite the increase in cases a FM is a very rare condition affecting fewer than one in a million children but she says it's good to be aware of the signs and symptoms the Ninety percent of those affected our children there are some cases and adults\nWe recommend seeking medical care right away if you or your child develops sudden weakness of the arms her legs\nAnd those are the CDC can't give any specific information about what's causing a FM ... says it's good to take general precautions\nParents can help protect their children from serious diseases following prevention steps like washing their hands thing up to date on recommended immunizations and using insect repellent to prevent mosquito bites\nIn the case of Susan coin son Evan he's healthy again he was treated with steroids and he was an occupational I'm physical therapy for Eighteen months\nIs fully recovered he has regained all movement and all strength in all foreign land\nBut this is not always the case some kids who've been diagnosed with a FM continue to have paralysis and require ongoing care Allison Aubrey NPR News\nContinue to have paralysis and require ongoing hair Allison Aubrey NPR News\nThis is NPR News\n[noise]\nServing for ... and beyond this is ... an Eighteen station radio network of Georgia Public broadcasting good morning I'm mentally Jones\nThe number of people living in poverty has decreased according to the world bank but the new estimates comes with a couple of footnotes what those are plus all the morning's business news in eight minutes on the marketplace morning report right here on ...\nTV is on your radio but we're also on line at the TV news dot org and you can take us with you on your smartphone using our mobile app\nIt's eight forty for\nRecord number of Native American candidates are running for office we could have an outsized influence on the mentor still both major parties are giving these communities cause for concern was that was Senator Elizabeth Warren ... test for new ways of making it harder for many Native Americans to cast ballots [noise] that's next time on one [noise]\nThis morning at ten here on gp [noise]\nSupport for ... comes from generous listeners like you and Newtown making the nonprofit working to revitalize historic downtown making new towns expanding the existing eleven miles ... heritage trail and connecting the riverfront trail to the ... national monument more Newtown making dot com\nAnd we'll start health system a proud member of the Mayo Clinic care network will start doctors can consult with male and complex cases keeping patient care at home well star dot org slash male will start Mayo Clinic working together working for you\nNot to put too fine a point on it but sometimes you just want to listen to some music and sometimes you don't even want to choose what it\nNot to put too fine a point but sometimes you just want to listen to music and sometimes you don't even want to choose what it is [noise]\nI'm Sarah ... let me do the choosing for you\nOn GPS tonight at\nThe only decision you need to make is to\nSupport for NPR comes from the station and from the lentils and foundation committed to improving lives through invention in the U.S and in developing countries and working to inspire and enabled the next generation of inventors more information is available at ... dot org\nFrom the John de into Catherine the MacArthur Foundation recognizing exceptionally creative individuals' this year's MacArthur fellows and more information or at Mac found dot org and from the listeners who support this NPR station\nGood morning you're listening to MORNING EDITION ... and Emily county ... county is the first in Georgia to have an all girls high school flag football week\nIn week one to lose highschool lost their first two games before the season started GBDs Ross corral talked with players and coaches about what it means to have an all girls' football team\nIf you close your eyes and listen to a practice that sounds the same for the most\nPart it drains except\nOn most field of players are all\nGirls was bragging rights\n\nFor sport being football team all girls there was another factor that sets this legal part becomes at no cost to the school or players\nThat's because the Atlanta Falcons are financial arm being without seeing pays for uniforms wraps and other costs that come with one of the week and what better place to start but we live in Georgia's largest school district actually Jeter as a sophomore on the loose high school team she says having the falcons support means a lot\nI appreciate that they did this for is you know the biggest like a big opportunity for and I think it's like oh my God if I can see this you know\nG there is vying for starting wide receiver spot for dilute wild cards I went out to watch them practice a few days before the first game\nG there is vying for starting wide receiver spot for dilute Wildcats I went out to watch them practice a few days before their first game systems have coach ... Wilson says the lack of experience for girls playing football shouldn't hurt them\nEvery girl out here is athletic and a couple of might not have grown up\nNecessarily playing football with their big brother's every every week but they understand you know running throwing catch it\nEats high school in the ... will have a team they'll play twelve games this season before a tournament style playoff interest in joining the Wildcats went well beyond the twenty roster spots coach was so sad that led to some tough cuts even in their first season\nMy information meeting had fifty three girls ready to come out and play football and that's just who showed up I had twenty more just email me say hey I'm playing softball I'm playing volleyball\nCan I come out a little bit later it's like yeah I I've got about Seventy girls that want to play but\nI don't have enough slots spots\nOn the team may be limited the effect of the league goes beyond the girl was almost failed Kimberly man can coaches I call in show high school she says besides the acts as an open up a game this points to a larger narrative of quality\nWe always tell our kids the sky's the limit but then we put limits on them when girls can't play guy said also I think that this huge\nBank and says this is an opportunity for girls to show their skills on the field in an organized format just like boys they're our rafts there are rules and they want to win actually Jeter says she grew up watching her bribery play and try it out because she wanted a chance to show her skills\nYou know I'm trying something new but it's like growing up I always think about him in the yard and stuff like that\nShe says she's happy to have the same chance to play a game she enjoys just like boys her age is very important to me\nGoing the way they doing that like if someone ... excited about it when that", "show_name": "Morning Edition (NPR)", "year": "2018", "city": "Chatsworth", "day": "17"}