{"month": "10", "state": "GA", "station": "WNGH", "content": "Member supported keeping the we're in Eighteen station radio network you can listen online or G. P. B. dot org and you can\nThis is members\nSupported gp Pete were in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening [noise]\nYou know selling a car can be a hassle but donating it is a whole different story let us take off your hands off your driveway and turn it into public radio and maybe even a tax deductions ... resolve the host of marketplace in here is how to do [noise]\nAll eight seven seven GP beat one car or Sunni securely on line a G. P. D. dot org slash cars ten thanks [noise]\n[noise]\nIt was Ninety seven point seven FM double your G. P. B. S. W. A. G. P. H. D. Rome portable Georgia Public broadcasting radio network [noise]\n\nGood morning California is a heavily democratic state where he Republican congressmen won reelection for years what happens this fall as Democrats trying to retake the house MORNING EDITION\nComing up a California father and daughter in different generations and radically different politics I'm David Greene Laguna Beach California and I'm Steve Inskeep in Washington we also hear a critique of the influence of Saudi Arabia and money executives in Silicon valley well from\nAlso this hour Israel raise an American who was detained at an airport for more\nNeed is friday October Nineteen Michael Steele the former chairman of\n\nLive from NPR News in Washington I'm Dave ... parliamentary elections in Afghanistan will go ahead as planned tomorrow but not in the southern province of Kandahar\nVoting there is being delayed for a week following yesterday's deadly insider attack at a high level us Afghan security meeting contours police commander was killed along with a regional intelligence chief when an elite Afghan guard open fire at the conclusion of the meeting\nThe provincial governor was severely wounded and singing\nBuild along with a regional intelligence chief when an elite Afghan guard opened fire at the conclusion of the meeting the provincial governor was severely wounded in Singapore today defense secretary Jim Mattis was asked about the long term ramifications of the attack claimed by the Taliban is\nChoices of the Afghan forces\nPracticing law for Afghanistan\nThe top us and NATO Commander in Afghanistan General Scott Miller was that the meaning in ... he was not injured the Taliban had been trying to hold the country's parliamentary elections the group issued a warning today telling Afghans not to take part\nPresident Trump was in Montana last night campaigning for Republican Senate candidate less than three weeks before the midterm elections Eric Whitney with Montana Public radio reports from Missoula\nThis was the president's third visit to Montana since July to campaign against Senator Jon tester who he holds responsible for sinking his previous nominee for VA secretary Dr Ronny Jackson\nWhat he did was unfair what he did what he did was vicious what he did was they was judge Kevin houses\nMore people came to the rally than the airport hangar it was in could hold more than a thousand also attended a protest rally on the other side of town for NPR News I'm Eric Whitney in Missoula, Montana\nIn major league baseball the Boston Red Sox are going back to the world series last night in Houston the red Sox beat the Astros four to one to clinch the American league pennant NPR's Tovia Smith says Boston wrapped up the ale championship series with a pair of home runs\nBussed in took an early lead with a home run to left field then cemented in fixed wing Raphael Denver's snack that three run Homer\n... defense was equally strong and look for a moment like a replay of Wednesday nights controversial call when right fielder movie that slipped up to catch a fly ball headed over the wall and the field I'm called fan interference\nThis time than steered clear and ... up and made the catch starting pitcher David Price called it special but not enough and that for more wins to take the two thousand Eighteen titled\nThe Sox will battle either the Milwaukee Brewers or the Los Angeles Dodgers\nTovia Smith NPR News Boston\nThe Dodgers and the brewers will be squaring off tonight in Milwaukee and game six of the national league championship series Los Angeles leads it three games to to this\nBrewers worldly squaring off tonight in Milwaukee and game six of the national league championship series Los Angeles leads it three games to to this is NPR News from Washington\nTemperatures in the eighties or making things more difficult for people in the Florida Panhandle who are still without power in the aftermath of hurricane Michael\nBottled water remains at a high demand across the region as crews and residents continue clearing debris left by the category for hurricane Michael is blamed for at least twenty nine deaths mostly in Florida\nAnother death is being blamed on Hurricane Florence the remains of a woman reported missing two weeks ago had been found in the Rowan oak river in southwest Virginia that brings Florence is death toll to at least fifty three most of those killed by the storm or in North Carolina the hurricane came up short near Wilmington\nThe Justice Department says stark kissed has agreed to plead guilty to price fixing as part of a broader investigation of collusion and the canned tuna industry NPR's Emily Sullivan reports\nFederal prosecutors announced the plea agreement on Thursday which include the sign of up to a hundred million dollars that play comes amid a government investigation if they can tune industry that began in twenty Fifteen [laughter]\nThree companies star cast bumble bee and chicken if the sea are accused of conspiring to keep their prices artificially high and the same ... deal a former started his executive and two former bumble bee executives pleaded guilty to price fixing\nBumble bee pleaded guilty last year to the same charges a star cast and paid a twenty five million dollar fine chicken in the sea hasn't been handed any charges prosecutors say the company exposed a scheme and cooperated with their investigation Emily Sullivan NPR News\nI'm Dave ... NPR News in Washington\nSupport for NPR comments from NPR stations other contributors include visit St Petersburg Clearwater along Florida's Gulf Coast offering artistic draws including St Pete's Dali museum but your who collection and the museum of fine arts more er visits saint Pete Clearwater dot com\nThere is Joshua Johnson the host of one a and I am coming to Atlanta I'll be moderating a conversation about how news organizations try to remain impartial in our increasingly polarized society I'll be joined by journalist and editors from gp beat hand NPR for an\nHonest discussion on ethics and transparency join us on Thursday\nSociety I'll be joined by journalist and editors from CPB hand NPR for an honest discussion on ethics and transparency joined us on Thursday October twenty fifth at seven PM will be a gp studios in Atlanta it's free but you need a reservation to get it and go to a G. P. B. dot forget slash community\nSupport for G. P. B. programs comes from our listeners in this fast paced world you want to have access to news when you need it check out our Web site at TB needs dot org we've got the latest state national and international news available twenty four seven\nBut they're also in depth feature stories from across the state of Georgia you can also view video performance has some great musicians in our gp the music present theories\nFor information and entertainment you can count on the news ... news dot org [noise]\nHi I'm Neil tests or with GPS B jazz joining Friday nights from eight to midnight I'll be featuring artists like Herbie Hancock Billie Holiday and Michael Wolff whether you're a long time jazz fan or have just discovered it CPB jazz ready to entertain you\nFriday night from eight to midnight here on DVD [noise]\nThis is MORNING EDITION from NPR News I'm David Greene\nAnd I'm Steve Inskeep here are two basic realities about California first it's an overwhelmingly democratic state which Hillary Clinton won with millions of votes to spare it is also home to a number of Republican members of Congress they have represented the state's redder areas for many years now and today I Am in\nOne of several districts where Democrats are mounting challenges as they try to retake the house Republican Dana Rohrabacher\nHas served the forty eighth district for just about three decades now most recently he made some news for his open embrace of Russia the Democratic challenger here hardly ruder\nHas a real chance and David I Know you've been talking with voters who will be helping to make that decision here and a few weeks water anything has changed in that district well I mean this is a district Orange County that has always been pretty conservative and and it's still so in many ways but you know it's it's been getting more\nModerates and I've been speaking to people that are wealthy people here who voted Republican in the path to try and keep their taxes low but now have turned against President Trump there's a huge Vietnamese community here Steve and the younger generation that community is I think more left leaning been there\nThis is low but now have turned against President Trump there's a huge Vietnamese community here Steve and the younger generation that community is I think more left leaning than their parents but I Want to introduce you to to voters are in surf city usa Huntington Beach um this is a conservative city in this district where\nThis is NPR News\nThe winner of that other vote the great American read will be the next Tuesday GB host cats objectivity aside and flagrantly plug their favorite\nReading that kind of connected me more deeply to reading books into appreciating characters and understanding stories the gloves come off plus black lightning starting a piece of William it's on second thought this morning at nine from keep eating is\nThis is David Greene host of MORNING EDITION I'm here to talk with you about that poking the one that keeps reminding you support public radio you can support the programs you loved by donating used vehicle that old car truck could be worth hundreds of dollars to the station or you have to do is call and you might even receive it tested a\nG. P. B. dot org slash cars or called eight seven seven street the big one car can back\nSupport for TB comes from you our listeners\nYour support allows ... to bring you end up stories from across the state or reporters take the time to look at what is happening why it is happening and how it will affect you we have bureaus in Atlanta Augusta\nMaking ends savannah we take the time to look at the whole picture gp brings you stories that you won't hear anywhere else and you can listen online\nCheck us out at gp be news dot org and stand with the Democratic congressional\nCollectively raised more than a billion dollars\nAnd live prepare to go big and go public in early estimates put the final cost of hurricane Michael over ... billion dollars\nAnd live prepare to go big and go public in early estimates put the final cost of hurricane Michael over ten billion dollar\nFollow the news and follow the money on the friday news roundup from New Hampshire next on on one [noise]\nOn the TV and eating out or\n\nSupport for NPR comes from the station and from William in Florida Hewlett Foundation committed to supporting ideas and institutions to advance education for all preserve the environment and promote vibrant performing arts more information is available at Hewlett dot org\nFrom the any e Casey foundation developing solutions to support strong families and communities to help ensure a brighter future for America's children more information is available at a E. C. F. dot org\n[noise] from the state of June ... who's ... serves as an enduring investments in the future of public radio and seeks to help NPR be the model for high quality journalism and the twenty first century [noise] and from the listeners who support this NPR station\nIt's MORNING EDITION from NPR News I'm Steve Inskeep in Washington\nAnd I'm David Greene in Laguna Beach California there is a competitive race here\nIn California is forty eighth congressional district voters here might really help determine control of the house of representatives than we have been spending time\nListening to what is on their mind so this is Orange County it's home to the largest Vietnamese population in the United states' part of this district is actually known as little Saigon and tea anthem trend lives here she works in community affairs for utility company she is raising two kids\nOr parents also live in this community but she\nSays their lives and her's are so different\nMy parents are pretty much their lives are in little Saigon my dad works at a pharmacy\nAnd so they're like during the Vietnamese community right and for me I go out in the world I experience race is that I Know what it feels I could be discriminate against I I think my parents to have that because really they their lives or hear their communities here to go to a Vietnamese mass they go to their customers are meeting these are our ... our diverse [noise]\nNow I realize my experience as an American very different from my dad\nAnd these generational differences extend into politics older Vietnamese Americans have tended to vote Republican many of them fled communism and\nAnd these generational differences extend into politics older Vietnamese Americans have tended to vote Republican many of them fled communism and they see Republican presidents from Reagan on as being tougher on communist leaders some younger people like ten term trend has been leaning more democratic and that is one reason\nThe party believe they can unseat the Republican incumbent here\nSo when we went to visit the anthem trail we had heard there were some political differences in her family though I'm not sure she herself new quite how stark they were\nHigh high she invited Islam into her parents' home for kids were playing around with eating snacks and they were orbiting around the grandfather [noise]\nHell trend ... father he primarily speak Vietnamese and his everyday life including when he talks politics with his daughter\nHe's been backing Republicans since he first started voting in Nineteen Ninety two and he told me it was certainly no fan of president bronco bomber who he said just wasn't tough enough on the world stage\nWhom are like him very much\nAnd then what now I guess we're\nToday we have Trump what do you think of Trump so far\nIn this country who do a good job\nUnemployed rate low uh-huh and the\nStock market in ... in Greece and\nSo the economy is important to you yeah\nAnd that this is this is um I open it [laughter] I didn't realize how he he thought of trying to see how they talked about that so it is the first time you know how to surprise 'cause then I'll have a conversation hold on the other stuff that he does against the media\nAgain scientists civil society we grow up knowing how I'm ... now as the crackdowns on freedom of press on basically writes\nWomen don't have the same rights there and see some of that happening now in America you know in some factions that government is scary because that was something that I never really a match as\nWe would be a situation where we have a prize said basically calling to press the enemy that people like we hear that from communist Vietnam and so we don't hear a you know I Would never have imagined that would be valid today\nCould you say that you're dead and yeah I'm just I just wonder why\nWhen Trump calls the media enemy of the people\nWhat your reaction to that [noise]\nDid you say that you're dead and yeah I'm just I just wonder why when Trump calls the media enemy of the people\nWhat your reaction to that [noise]\nI like all go home and yelled out to you directly to\nSome time to press talk about what these changes\nBut they don't care about their to think\nThrough just has to yeah CNN again from fall to both the same\nSo they're not there by us yeah Fox News clearly as fire and I don't know if your desk\nIs the al ... they spend a lot I think in the lap while I'm Trump boxes like trying to you know make a phone [laughter] [noise]\nDo you think do you think the media\nIs too negative about Trump it's not fair\nTo say that Russia interfered in to the left in this country mhm\nBut when they know that\nWhy I said oh I shouldn't before the election they weigh on deal from\nBoth elected\nAnd the main issue [noise]\nSo if if they find out that Trump worked with and the Russians where that would that bother you yeah\nBut you don't get your don't believe that you\nNeed to improve on that I don't need to believe them\nYou know I don't do that but I don't eat an FBI ... no doubt no doubt at all he believes\nThat the Mueller investigation should continue so that they have we have the facts I agree with that\nThere is something you agree on yeah\nThere are a lot of families who've been divided over\nTheir views of from what you hear like dinner conversations that yeah to go really badly in I mean people get it from the table yeah it I mean this is it doesn't seem to be happening in this you know\nBecause I don't think our country should be torn apart because of one percent I clearly have strongly against you know what the president stands for\nBut I also believe it's important to me I respect my parents I Know what their experience has been and and we came here so that we can have the freedom to have different views to have these kind of conversation because they don't happen in Vietnam and so the fact that my dad has a different view from me on this particular issue that doesn't bother them because we have that freedom that's why my parents let Vietnam to be here in the first place [noise]\nEverybody got to go to vote yes you would\nFall choice\nAnd fall if you are the ...\nEverybody\nGot to vote to vote yes you would follow toys\nAnd for future either we're thinking\nToo big everybody should vote yeah\nAnd my father I didn't mention the any he after the war he was a political prisoner for ... banging on the other\nTwo or three years he was held in a\nPolitical ... no they\nThey do the ...\nYeah we're the communist tries to you know and basically get ... ...\nIt's it's powerful to hear\nYou say that people should vote going from the history that you have\nYeah I think we need to protect our democracy\nAnd don't worry about we're both drone right because the if we were wrong the next time we\nMake it how we have another ... ...\nThat was the anthem trend and her father couch trend there to voters here in orange County California and we're going to take you to other corners of this district elsewhere on the program this morning this\nEven in the public ones there is a growing sense\nThat they are standing on top of an indefensible mountain that America has been led by plutocrats who are fundamentally motivated by the bottom line but who have spun us all a tale of how they're trying to transform civilization and things need to change but in a private conversation Steve I Will tell you deep\nIn the bowels of these institutions\nThere is a generation of younger people who frankly do not believe the stories\nThat their elders and their elders are like in their thirties and forties the case of Silicon Valley do not believe their stories a bunch of people coming up in the valley frankly have a much more sophisticated understanding of power the very power they wheeled in the privileged they wield that some of the people who founded these companies have been catastrophic Lee blind to\n[noise] on a bearded us is the author of the book winners take all thanks very much for coming by\nThank you Steve are an American graduate student has been released from the airport in Tel Aviv after being detained for more\nThere is take all thanks very much for coming by thank you Steve\nAre an American graduate student has been released from the airport in Tel Aviv after being detained for more than two weeks we're more from NPR's Daniel Estrin in Jerusalem\nLower cost them is twenty two years old and a recent graduate of the University of Florida\nShe landed in Israel at the beginning of the month for a master's program and human rights at an Israeli university but authorities at the airport denied her entry under twenty Seventeen law banning activists affiliated with the pro Palestinian campaign to boycott Israel\nAll cause I'm used to have a small chapter of a pro boycott student group but now she says she no longer supports the boycott she was held at the airport while she fought in court for the right to enter Israel\nHer story caught international attention following several other cases of Israel detaining left wing critics at the airport and border and it caused some embarrassment in Israel\nAnd some of the Senate\nDeputy foreign minister the peaceful to belly told\nIsraeli radio last week that Israel's ban on all costs him was not very successful she said Israel should reconsider how it applies at century band when it turns into an international issue we lose more than we when she said\nBut Israeli strategic affairs minister ... ... who led Israel's campaign to ban all costs them defended the move\nThe little guy and he said don't just look at articles in New York Times and the media critical of Israel he argued there are thousands of pro Israel students and the U.S will contend with pro Palestinian activists on campus too will support our move without costs some\nProponents of the boycott divest meant and sanctions movements say there peacefully protesting Israel's treatment of Palestinians but Israeli leaders have called it a campaign to undermine Israel's legitimacy as a country\nLaw customs case reached Israel's Supreme Court which ruled that caused some had not been involved in boycott activities for more than a year and had demonstrated an academic curiosity about Israel [noise] she was released from the airport yesterday ... is her lawyer\nVictory for free each academic freedom and law Laurie ... thought pleasing had absolutely no place in a democracy\nA right wing Israeli activist groups that it would be closely monitoring all costs them during her time in Israel to ensure she did not promote a boycott the Hebrew University of Jerusalem which had supported al ... case in court said it looked forward to having her on\nAnd Israel to ensure she did not promote a boycott the Hebrew University of Jerusalem which had supported al ... case in court so that looked forward to having her on campus next week Daniel Estrin NPR News Jerusalem\nThis is NPR News\nI'm rather young the disappearance of journalists your mouth and shows he raising questions about the relationship between the U.S in Saudi Arabia President Trump visits Florida in Georgia to survey damage from Michael and the midterms are right around the corner our weekly roundtable let it all the new next time here and now\nToday from named telltale on your TV station NDTV news dot org [noise]\nSupport for G. P. B. programs comes from our listeners our reporters have been honored with national awards for public radio news directors incorporated for our use of sound soft feature and our coverage of breaking news thank you for your support which allows us to keep you informed about stories that impact your life\nAnd show your parts of Georgia you don't otherwise hear about count on us to bring you comprehensive coverage of the state check out our Web site at gp news dot org GB news stand with the facts [noise]\nI'm David Folkenflik coming up on the next month point a black teenager witnesses a friend killed by a white police officer that's the storyline of the new film the heat you give we're joined by the director and by young activists who tell their stories of what it means to be black in America today\nThat's coming up in the next on point from if your\n... this morning and eleven here on the\nSame as diamonds Papadopoulos I Am the medical director of metro darn Metrodome is a dermatology slash terminal logic surgical practice in Atlanta with a team providers I wanted to participate and underwriting for public radio the integrity of what I was listening to\nMade me feel like I wanted to be part of a\nMessage and that represented us\nAnd there was something very positive about two hours\nTo find out more about becoming a corporate sponsor emails sponsorship at ... dot org [noise]\nRipped later this week on science friday a sleep sciences spill the beans on insomnia night ... and that\nOne of the great things about being a sleep researcher as if I took a nap and miles in the afternoon [noise]\nWas white and jeans\nI'm In ... and now one of the great things about being a sleep researchers just ... miles from the\nMost white genes may decide your bedtime on science friday from WNYC studio [noise]\nThis afternoon it's three on TBN gp news data work\n\nSupport for NPR comes from the station and from the ... foundation fostering improvements in learning and enrichment for disadvantaged children and the vitality of the arts for everyone ideas at Wallace Foundation dot org [noise]\nFrom the ... foundation since Nineteen eighty five supporting advances in science education and the arts towards a better more just society more information is available at size seems foundation dot org and from the John D and Catherine T MacArthur Foundation at Mac found data work\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep in Nineteen sixty five when President Lyndon Johnson went to Congress to propose the voting rights act he outlined some of the bill's provisions\nFinally this legislation will ensure\nThat properly registered individuals are not prohibited from voting\nBut even though when it comes to voter registration laws there is a good deal of confusion and in some cases controversy here's Noel King with commentator Cokie Roberts who answers your questions about how politics and the government work\nAhead of this year's election some states have already closed voter registration while other states allow people to register at their polling places on election day what is the deal with this patchwork system what is the deal is All right here's our first listener question\nThis is claiming a heart from San Francisco California I'd like to ask Cokie whether voter registration laws were controversial before the voting rights act in Nineteen sixty five how the laws changed since the Supreme Court granted black citizens great vote and wait for the ... barriers to voter registration\nThe basic answer is yes voter registration laws were controversial uh at first people staffing the polls were just expected to know everybody didn't and their neighborhood but did an Eighteen hundred Massachusetts instituted the first voter registration\nAnd as the century moved on it became more widespread partly in a move to make sure that non citizen immigrants didn't vote by the late nineties early twentieth century is a rural dominated state legislatures\nIt's spread partly in a move to make sure that non citizen immigrants didn't vote by the late Nineteen the early ... centuries a rural dominated state legislatures impose registration on city voters again it was named immigrants and at fraud by big city political machines\nAnd what about the the rest of her question there what about the effects on black citizens versus white citizens' well of course\nBlack men were given the right to vote and the fifteenth amendment in Eighteen Seventy but the Jim Crow laws and the south effectively stripped African Americans of their voting rights in terms of rights of course white women and black women couldn't vote nationally until the nineteenth amendment in Nineteen twenty\nBut you know before the sixty five bill a lot of whites in the south couldn't vote either just because the registrars had frozen the roles they didn't want anybody new voting\nAll right we have a couple of questions about current controversies\nMy name is Rachel ... men from Shaker Heights Ohio why the candidate for governor allowed to purge voter rolls shouldn't he recused himself a secretary of state while he's a candidate\nI assume this is in reference to Georgia Republican gubernatorial candidate Brian Kemp who is the current secretary of state and this and thinking about ... himself he's provoked a lawsuit by buddy more than fifty thousand new voter applications on hold for minor inconsistencies\nThe lawsuit charges discrimination saying eighty percent of those applicants are members of racial minority groups\nThough they can't vote earlier or by mail they can still vote if they show up the right polling place was proper ID\nOkay that that idea of proper ID that gets right to our next question\nHi my name is Amy paying their tour and I live in Omaha Nebraska when I heard about the Supreme Court ruling the ideas for voting would need to have a street address it didn't faze me and I heard that a lot of Native Americans on reservations only have a post office address how is that going to affect their ability to vote\nMORNING EDITION from NPR News I'm Steve Inskeep and I'm David Greene\n\nWas Ninety seven point seven FM W G. P. B. and deadly GBH the room portable Georgia Public broadcasting radio networks\nSeven four seven FM W. J. P. B. and W. GBH be room for the Georgia Public broadcasting radio network [noise]\nFly from the GB newsroom I'm Emily Jones good morning I had will travel to California's forty eighth congressional district where a political newcomer is trying to unseat a long time Republican congressman\nWe'll hear from voters in just under ten minutes in today's Georgia headlines next week a federal judge in Atlanta and we'll hear a lawsuit challenging ... signature matching law for absentee ballots as TV's Stephen salary reports it's one of four ongoing lawsuits aimed at Georgia's election system\nOn Tuesday a judge well here's a case brought by the American civil liberties union of Georgia they argue the voters who signature does not match ... should not have their absentee ballots rejected as a Wednesday only one hundred and Seventeen of more than Seventy two thousand ballots have been rejected because signatures didn't match\nThere are also ongoing lawsuits targeting absentee ballot rejection rates the state's pending voter list and the touch screen voting machines election day is November six produce the News I'm Stephen Fowler at Atlanta\nThe Atlanta based Centers for Disease Control and prevention is warning women who are pregnant or may become pregnant to get vaccinated for the flu according to the CDC changes in the immune system heart and lungs during pregnancy can lead to a greater risk of severe illness from the flu\nHeld officials say a flu shot can produce a pregnant woman's risk of hospitalization by an average of forty percent\nAn estimated eighty thousand Americans died of the flu and flu related complications last winter making it one of the deadliest seasons in recent history for more towards the news ... news dot org\nIt's six oh one\n\nLive from NPR News in Washington I'm corporate Coleman President Trump says it certainly looks like missing Saudi Arabian journalist ... is dead\nTurkish officials have claim they have recordings that prove ... was killed in a Saudi consulate in Istanbul it's a charge the Saudis deny Trump says if Saudi Arabia is to blame the response will be quote very severe\nAfter talking about missing Saudi journalist ... who is feared dead Trump attended a rally in Montana last night that's where he praised the Montana ...\nAfter talking about missing Saudi journalist ... who is feared dead Trump attended a rally in Montana last night that's where he praised the Montana congressman for attacking a reporter last year NPR's Don Gonyea reports the attack was by congressman Greg ...\nJune fourth day was elected in a special election in twenty Seventeen that's when he assaulted a reporter from the guardian newspaper he pleaded guilty to a misdemeanor assault last night the president ... visited that attack calling Jean forte quote my kind of guy\nThat your body slams president recalled first hearing of the assault and I said oh this is terrible he's going to lose the election then I said well wait a minute I Know Montana pretty well I think it might help him today from campaign\nThan Arizona which has a close US Senate race Don Gonyea NPR News Missoula, Montana\nEarly voting can start in eight Florida counties this coming Monday and extend through election day November six from member station WFSU Lynn had her reports the move adds a few extra days for voters to get to the polls in Florida counties hit by hurricane Michael\nJackson County supervisor of elections office has no electricity the bay county supervisor of elections office has no roof and the usual precinct voters may be accustomed to have likely been damaged\nIn Tallahassee Leon county deputy elections supervisor ... says governor Rick Scott's executive order gives impacted counties greater flexibility like keeping a handful of early voting sites in each county open longer\nBecause one of these counties as you probably have heard they just can't get to the site so they're just gonna run to the cycle all the way through election day\nElections supervisors in the panhandle are grappling with this place to voters infrastructure damage and spotty power and communications for NPR News I'm Lynn had her in Tallahassee\nThe navy says us sailors near Japan are being evacuated to shore after a navy helicopter crashed aboard an American aircraft carrier John Matthews reports from your kosco Japan some injuries are reported that they are not life threatening\nVehicles ... USS Ronald Reagan was conducting routine operations and the Philippines see according to an ... person one of his image sixty Seahawks crashed into its flight ... shortly after takeoff the maybe hasn't revealed damage your casualty details just sort of interest sailors are stable and its mission will continue\nJohn ... he is reporting\nBut maybe hasn't real damage your casualty details just sort of interest sailors are stable and its mission will continue John ... he is reporting this is NPR\nElection officials in Afghanistan have postponed national elections for the province of Kandahar there'll be held on Saturday in the rest of the country but Kandahar is vote will be delayed by a week that follows a Taliban attack yesterday and the governor's compound that loved Kandahar as top police official and intelligence official dead\nThe provincial governor was wounded the top US military official in Afghanistan was present but escaped on injured three other Americans were wounded\nAfter a year of scandals a group of Facebook investors is asking CEO Mark Zuckerberg to step down from his role as chairman of the board and bears Jasmine Garsd has more\nTruly an Asset Management owns over eight million dollars worth of Facebook stock investor group says Facebook needs an independent chairman not its current CEO Mark Zuckerberg\nSomeone who can protect investors from risky decision making\nTruly am has announced that it is not alone it's proposal has been co signed by the state treasurer ... Rhode Island Pennsylvania and New York city comptroller\nThese kind of shareholder moves are mostly symbolic as a way for investors to influence the company's behavior ... co founded Facebook has its majority shareholder which would make it hard for a proposal like this to pass Jasmine Garsd NPR News New York\nThe Justice Department has opened an investigation into child sexual abuse allegations against Roman Catholic priest in Pennsylvania as follows a wide ranging and skating state grand jury report released last summer it alleged three hundred priests abused more than a thousand children for decades\nThis is NPR\nSupport for NPR comes from the do the investments taking a personalized approach to helping clients grow preserve and manage their wealth learn more at ... dot com slash wealth ... brokerage services are wealthy and Americans for the arts at Americans for the arts dot org\n\nGood morning thanks so much for starting friday with MORNING EDITION on cheap ... good morning and Emily Jones ahead we'll hear from an undocumented immigrants who lives in the U.S legally at least for now who's taken an unusual path\nSo it started working as an original Journey Through to them those officers with somebody else also will simply ...\nSo I started working as an immigration attorney it's weird to be in those offices with somebody else who also is on the same situation\nHe talks about his hopes to make his legal status Herman in twenty minutes here ...\nI keep using forecast funny guy in North Georgia this morning cutting clown hearing all the time of cloudy day elsewhere in the state with high framing\nSlight chance of rain on that night when I was in the\nInterstate will hear anything in your car I Want you to try something roll up the windows you all sealed inside ... a good smell\nCan you smell that that was the great cologne experimental two thousand for it you should not have gone with the dollar store for that one boy you could lose that old car smell my donating your vehicle one of your favorite causes like public radio it only takes a few minutes and just like that you supported the station and well you are on your way to a life of better smell [noise]\nGo to G. P. D. dot org slash cars and thanks\nIt's MORNING EDITION from NPR News I'm Steve Inskeep in Washington and I'm David Greene in Laguna Beach California and those waves is behind me I Know they're not your typical soundtrack for election coverage but here in orange County California there's a really interesting race that could help determine\nWhether Republicans hang on to control of the house Republican congressmen Dana Rohrabacher\nHas served the forty eighth congressional district here for nearly three decades but there is a political newcomer Democrat hardly wrote a who seems to have a shot at and feeding him this district that has been moving to the left and we got a hint of why that is the other night\nWe were in Laguna and\nThe gal it's one of the super wealthy towns in the hills above the Pacific here\nAnd this is where some very rich voters are changing the political landscape\nWords you're gonna get parents make Daniel for that with her editor\nEric giving his name so we could pull through the gates we then went up to a house where there was a Porsche parked\nIn front of this huge fountain and our hosted to rate and tone brought us inside David nice to meet you too at Antonio is Iraqi American he moved from Baghdad\nTo the U.S when he was six years old he served in intelligence in the U.S military and then he made a bundle\nIs Iraqi American he moved from Baghdad to the U.S when he was six years old he served in intelligence in the U.S military and then he made a bundle running and then selling medical device companies that's for his politics\nAnd this is MORNING EDITION on gp being good morning I'm mentally Jones in California Democrats are hoping to flip a reliably Republican House seat but it won't be easy\nFrom what I'm hearing if they get powered all they're going to do is investigations and mph that is that when\nMy heart what voters in California's forty eighth district are saying about the upcoming terms and Fifteen minutes right here on cheap ...\n... one\nOf the most important George elections in decades he takes place in just Eighteen days and I ... as you begin to firm up your choices for political rewind panel of insiders will be here for four days a week to help guide you through raises from the top of the ballot to the bottom of the ticket joined\n... Jim Galloway and the mayors of Columbus and Sandy Springs today you do for the latest on what your news [noise]\n\nSupport for G. P. V. programs comes from our listeners\nAnd we'll start health system a proud member of the Mayo Clinic care network will start doctors can consult with male and complex cases keeping patient care at home\nWell star dot org slash male well star and Mayo Clinic working together working for you and regions bank providing online tools tips and calculators designed to help businesses and consumers understand a wide range of financial topics\nAnd making for money decisions resources that regents dot com slash insights\nMeals hesser with G. P. B. jazz joined me Friday nights from eight to midnight I'll be featuring artists like Herbie Hancock Billie Holiday and Michael Wolff whether you're a long time jazz fan or have just discovered it CPB jazz ready to hundreds\nIt's like Herbie Hancock Billie Holiday and Michael Wolff whether you're a long time jazz fan or have just discovered it GB jazz ready to entertain you\nFriday night for me to midnight here on DVD [noise]\n\nSupport for NPR comes from the station and from little passports a monthly subscription service for kids each package includes game souvenirs and activities from a new country designed to spark curiosity and cultures around the globe a little passports dot com slash radio\nFrom campaign monitor any email marketing platform used by more than two hundred thousand customers worldwide with email template the dragon drop email editor and twenty four seven customer service Morris campaign monitor dot com\n[noise] and from Amazon Web services used by millions of customers a W s provides a range of cloud services and functionality from tools to security to compliance more information at build on dot a double us\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep we're hearing all morning about elections the United states let's take a moment to check on democracy in Afghanistan that country has been planning parliamentary elections this week up most of the voting will proceed but in a very large and populous province\nThe voting has been postponed that after an attack that left to senior officials dead including a top police chief\nPamela constable covers Afghanistan for the Washington Post and she's on the line more to the program\nI'm Glad to be with you I guess we should figure out what was supposed to happen this week and what is the original plan what's at stake and what's the campaigning been like\nThe original plan was to have a very big nationwide election more than two thousand five hundred candidates for two hundred and forty nine seats in parliament candidates of all all flavors and philosophies\nAh there was lots of excitement about the election but also lots of current and worry\nPartly because the frets by the column on which has now come true awe and partly widespread of widespread charges on that there was going to be massive fraud [noise] do you think a lot of positive uh campaigning a lot of new fresh faces a lot of it is yeah\nThat there was going to be massive fraud so you've seen a lot of a positive uh campaigning lot of new fresh faces a lot of enthusiasm but also a great deal of of worry a A N and an anxiety at the same time\nSo you've been reporting but in Kandahar Province really large important province the voting will be delayed for a week brought this does raise a question what is possibly going to be any different a week\n[noise] right and we don't know that obviously this is a a a measure taken on an emergency basis um just to to sort of calm things down I mean kind of hard to very large province which is tough loss\nIt's the least have its intelligence chase and the governor has been gravely wounded um there's a huge security vacuum and people are very nervous and worried so I think this is obviously a measure designed for short term relief of that\nI'm obviously decision will be made later on I I Would take and hope that that elections can be held there because it's a favorite populist lots and lots of voters but let's let's see what happens tomorrow um let's see if there's violence elsewhere or not\nUm and to what extent that happens how how bad it is I suspect a generally speaking out they're going to be taking famous one day at a time here\nDoes you'd feel and the rest of the country with ... like a democratic process does do do feel like you're in the middle of a reelection campaign where the people's will might be expressed\n[laughter] I Do it does a it's been it's been a a a a nice experience so to speak out compared to previous\nElections here um you know record record numbers of candidates out and about a four hundred women are among the candidates with which is extraordinary\nA for a very traditional society like this one on the other hand candidates although they've been busy\nAn active have not been doing a lot of public campaigning they've been prudent they've been cautious they'd had inside events um it had a loudspeaker trucks but you have not seen a massive public rallies a few have been held in the provinces and some of those have been attacked\nI'm so and as we mentioned earlier Ken you hadn't candidates have been killed and\nWell okay criminal constable of the Washington Post in Afghanistan and thanks so much\nThey're very welcome\nThe music means it's time to record the morning you were a jury will be two years old when I moved from Mexico on a tour\nIs it means that it's time for historic or that morning and you were ... home was two years old when parents brought him to the United states from Mexico on a tourist visa they never left pecan was allowed to stay in the U.S thanks to the deferred action for childhood arrivals program or doctor and he went to law school in two thousand twelve it was around then\nThat he meant Ari on it or most CEO on a bus he leader asked her on a date and that's when ... Cohn told her that he was undocumented sort\nOf make you feel apprehensive about dating me\nNo it didn't make the apprehensive it was almost like it's okay it's cool but not even fully crafting what that meant I was a U.S citizen and I think I didn't realize I Would start living some of that indirectly through spending time with you\nSo it started working I was an immigration attorney is where to be undocumented it's weird to be in those officers with somebody else who also is simply to ration you mentioned to me that sometimes you're scared of yours or of nervous when I go to immigration court or when I go to eyes\nBecause I imagine you going in there and talking smack and just kind of standing affair clients and I just imagine you saying the wrong thing [laughter] comment that should have you ever been afraid I'm I'm always afraid [laughter] um\nWhen I went to my first I check in with a client on the fourth floor and it's just completely packed to the brim and you cannot walk around and it's very hot it's almost suffocating sometimes I'm curious if they know about my status\nYeah we've kind of unspoken system for\nYou telling me in the morning that you will be\nAnd I check in and then I said please be careful and then you take me when you're out in safe and they said\nThank God [laughter] it does way me down a little bit it is a very specific cloud hanging over us [noise]\nIt just feels like we're at pause travel plans are paused long term plans are caused you know we ... we want to\nA house we really can't take too many steps in any direction until we have this resolved so it is hard [noise]\nWanted our wedding day feel like for you um I think I I thought that'd be yeah like it's a it's it's a start something new for us they've been together for over five years now\nBeen very supportive and very scary [noise]\nAnd so many ways\nYeah like it's a it's it's a start up something new for us we've been together for over five years now you've been very supportive and burger [noise]\nComedy where\nI Wonder how you feel when you no longer have\nTitle of undocumented person\nBut I'll be there with you [noise] um [noise] ready to [noise]\nThat was your Tara become an authority on it or most view although they were married earlier this year it's unclear whether it be comb all receive a green card and become a permanent resident\nInterview was going to be archived along with hundreds of thousands of others why Britain Congress\nMajor support for StoryCorps comes from Subaru featuring the all new three row ascent feeding for up to eight and a choice of second row captain's chairs love is what makes the super super and learn more it Subaru dot com [noise]\n\nOr these friends with people who you\nAnd it's like I call it the Trump arrangements syndrome I'm no you've heard of it but it's there are so different people when you bring up from it's like a flip the switch for them\nNow about three miles away in another hundred to a beach home we spoke with Shane of leases them\nInto giving orders it's all ... and ... everything else right back here in\nThe middle school teacher who's running for city council and seemed to have nothing at all in common with on a killer then again these are two women who politics are motivated by the same emotion fear she noises that she remembers feeling it at her middle school the morning after Trump was elected\nOn that day when I Know that so many people were just devastated and in shock and calling back into the covers I knew I didn't have the luxury of doing that because I had hundreds as Latino students at my school that we're going to be terrified\nScaring them they were worried that their parents were going to be deported\nBecause I had hundreds as Latino students at my school that we're going to be terrified\nBut we'll we'll scaring them they were worried that their parents were going to be deported\nAnd some of their parents were she told me only making her students more nervous\nAnd it definitely has an effect on how they learn\nIn what way when you're living in fear it's really hard to learn about things like cells\nAnd body systems [noise]\nI have several students who we've been trying to get their parents to come in for conferences or tend to focus their child's individualized education plan that won't come because they're afraid of getting picked up\nAnd the students have shared with me and my mom doesn't have paper so we don't leave\nThey can't they're afraid to come to school\n... this is a Democrat and that's the way she's going to be voting next month for heavily router over Republican congressman Dana Rohrabacher but she says what she wants most is lawmakers were willing to work with the other side I have to\nBelieve that there are people on both sides of the aisle that really do want to work together\nThat this divisive mass I really\nWant to believe that that's not who we are as a nation because it's\nIt's amazing just as a journalist who watches these debates from afar um\nIt seems like so quickly you are labeled as someone who just wants to protect immigrants in this country doesn't care about the safety of people and people on the other side are labeled as racist and there's just no way to to actually build bridges\nThat is how it looks if you're reading things on the Internet\nBut if you're out there in the community and you're walking with us you'll see that there's far more than it does bring us together then divides us [noise]\nAnd so you'd be ready to to to settle people down here we are just calling the president racist and say\nThat's that's not helpful let's let's try and work through this [noise]\nI I Would do that absolutely\nDon't know that I Would actually be able to come out and say he's not racist but I think I could say something along the lines of continuing to\nNarrative is not helpful\nWhat is something that we can talk about that is helpful\nThat was the voice of Shane laces and before that we heard from Donna killer there to voters here in orange County California and we're going to take you to other corners of this district elsewhere in the program [noise]\nYou're in orange County California and we're going to take you to other corners of this district elsewhere in the program [noise]\nThis is NPR News [noise]\nCertain tabby island and beyond that his his G. P. being an Eighteen station radio network of Georgia Public broadcasting good morning I'm Emily Jones [noise]\nI had this morning\nMany link doctors over prescribing painkillers two opioid abuse to start up in Nashville is acting as a watchdog for health insurers will have that story plus all the morning's business news in eight minutes\nOn the marketplace morning report right here on cheap ... in Georgia business news the state the unemployment rate ... three point seven percent in September\nThat matches the national average and is the lowest rate in Georgia since may two thousand one\nLabor secretary mark butler says the number of jobs and employed residents are also at record levels\nYou can find more Georgia news at gp be news dot org it's six forty four\nDemocratic congressional elections we've raised more than a billion dollars for\nPrepare to go big and go public and early ... was the final Costa ... Michael ... billion dollar\nFollow the news and follow the money on the fighting is Rhonda from New Hampshire one [noise]\nThis morning at ten on G. P. B. [noise]\nSupport for ... comes from you our listeners and the historic Sam short line railroad Thomas the tank engine visits the same short line train at Georgia veterans state park in ... October Nineteen twenty first plus the twenty seventh and ... tickets at Sam short line dot com\nAnd Miller theater and Bob no check presents featuring an evening with Texas songwriters Lyle Lovett and Robert Earl keen October thirty first ... Miller theater tickets on sale now at the Miller box office in Miller theater Augusta dot com\nNext time on studio three sixty\nSixty is career Harlan Ellison wrote ... short stories novel beauty shows comic books movies\nA huge put to fire a plumber and use it how many ... and ...\nSo I find ... short stories novels TV shows comic books movies a huge output if I were a plumber and you said how many times have effects and I said and thousand you wouldn't say boy what a prolific plumber somebody supposed to do I'm a writer delete Harlan Ellison much time on studio three sixty\nTonight at ...\nSupport for NPR comes from this station and from farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs coverage options and more information can be found at farmers dot com\n[noise] from I drive maker of remote PC providing real time remote access to PCs max and servers from anywhere for use when telecommuting or for remote management learned more remote PC dot com slash NPR and from Americans for the arts\n\nGood morning I'm Emily Jones you're listening to MORNING EDITION on TPP when hurricane Michael swept into southwest Georgia a week ago it hit the regents farms with a bomb like intensity cotton fields near harvest were blown bear and decades old pecan grove were leveled\n... grant Blankenship visited ... farm in southwest Georgia to see how recovery from the storm is beginning\nTucked away in the corner of the panel pecan grove near the town of Pretoria is one of those things that Mitch ... says lead the decades he's been living and working here we're\n[noise] phone\nFlock\nOf about a half a dozen water birds fly through cypress trees ordering a bubbling spring fed pool right now it's full of debris from the hurricane but this summer swimming ... is in fact cold\nSo wow [laughter] a lot of fun luggage ... has\nBeen the farm manager at ... for Twenty years the family that owns the plantation is mostly scattered to Colorado in Rhode Island\nFor folder this is the only homeless kids have ever known he says it's been a good life this means everything to me which is why the scene when we turn from the spring is so painful it's one of the thousands of the country some a century old lady blow by hurricane Michael [noise]\nOlder and I've been riding around ... to get an idea of just how bad things are we stopped at one of the farms former money make one of those varieties or he is actually called a money maker is actually called the money like\nHere's the biggest one great just ... it's ripped up from that\nAnd one of the oldest Bradley's or he is actually called the money make is actually called money like [noise]\nHere's the biggest one great is this ...\nIt's ripped up from the tap root which is in case in red clay maybe thirty yards away pecans are piled like gravel and dry stream\nBed Andrew could get a hearing in and Savage a lot of these\nThese Titanic trees on the ground or in the way the tractors that usually do the job Bolger says these problems with the ... are all over the gross but good luck finding the labor to get them up\nI had a crew Monday in that now don't have a group so our I paint them Tony ... a students' day\nThat's twenty five cents a pound a good ... bringing a hundred pounds a day so that's a twenty five dollar paycheck and harvest Bolger says the problem was the crew didn't want to wait until the end of the week to get paid so this oldest most profitable grove on the farm is done in a good year these natural be headed to China except\nThis year you would in contract or a nut because John wouldn't buy\nThat because of the tariffs on pecans that cropped up in the U.S China a trade war Georgia growers had been looking at a year when nuts intended for China would be dumped into American markets depressing prices and now\nThat I don't know that we can supply what what are Americans would lead\nThere still money to be made in the smaller grove a seven year old trees though it did not escape damage Derek woods is walking those\nRovers either [noise] lots of trees that are still standing\nHave broken taboos you can tell when the leaves looked dead so we're just cutting those trees down do you have do you have any clue how many trees you you've cut down so far\nAll without by woods comes with small bulldozer to pick up the limbs but Bolger says there's still plenty of Han work to do we get Doris ... normally observing here they're they're picking up new behind this\nFrom eight PM American public media\n[noise]\nNinety seven point seven FM WG P. B. S. W. GBH be room for the Georgia Public broadcasting radio network\nWell your genes and believe GBH leave room for the Georgia Public broadcasting network [noise]\n\nLive from the G. P. B. newsroom I'm Emily Jones good morning the disappearance and presumed to death of journalists ... has raised tensions between the U.S in Saudi Arabia and prompted some criticism of President Trump's approach to the issue\nHere from a veteran diplomat on this in just under ten minutes and today's Georgia headlines people living in areas affected by hurricane Michael who receive government food assistance\nHave until the end of the month to apply to replace food last in the storm division of family and children's services interim director Tom ... yesterday extended the deadline to October thirty first around one and a half million Georgians receive that supplemental nutritional assistance program assistance\nTo help feed their families [noise]\nOutpost health in Savannah is testing a new kind of breast cancer screening mammograms work better for some women than others in some cases breast tissue is really dense making cancer tougher to seat\nThat's where a machine called soft few comes in and it takes a three D. ultrasound so doctors can see a detailed image of every part of the breast\nRadiologist Patricia Shapiro says well it won't replace mammograms it could become another tool for doctors by putting\nAll of these modalities together we have\nA better chance of finding had breast cancer and our whole goal is to catch breast cancer when it states zero or stage one because those are going to be ...\nShapiro says soft view has caught cancers that did not show up on men of grants from Georgia News Go to G. P. B. news dot org and follow us on Facebook and Twitter at ... news it's seven oh one\n\nGuy from NPR News in Washington I'm more of a Coleman President Trump says it certainly looks like missing Saudi Arabian journalist ... dead he managed after entering a study consulate in Istanbul, Turkey earlier this month\nTurkish officials have suggested they have audio evidence that ... was murdered inside a claim the Saudi Government vehemently denies today Turkey's foreign minister says his government is not shared any audio with U.S officials\nSecretary of state Mike Pompeo agreed\nThrough ... spoke on his way to Mexico City\nAnd with U.S officials and secretary of state Mike Pompeo agreed herded\nThrough Pompeo spoke on his way to Mexico City he's going to talk with Mexican officials about thousands of migrating Hondurans they're now in northern Guatemala at the Mexican border\nUm during are trying to cross headed for the United states President Trump has threatened to call up the U.S military to seal the southern us border to stop them\nThe Afghan government is delaying parliamentary elections in the southern province of Kandahar as follows a Taliban attack Thursday that killed two senior security officials Jennifer glass reports from Kabul\nThe decision was made by Afghanistan's national security council after the Taliban killed Kandahar powerful police chief in head of intelligence Thursday's attack inside the provincial governor's compound narrowly missed us and NATO Commander general ... Miller\nThe Afghan election condition which made the request to delay will announce the exact date the rest of Afghanistan is scheduled to vote Saturday turnout will be crucial but the first time there is an electoral role of eight point eight million\nThe Taliban and Islamic state had both down to disrupt the vote and colon Afghans to boycott it voter registration and political campaigns have been beset with violence ten candidates had been killed and two hundred and sixty others had been killed or wounded for NPR News I'm Jennifer glass in Kabul\nA new NPR poll on life in rural America shows many people in small towns field they're doing better than their parents and have a positive outlook on their economic future NPR's Kirk Siegler reports this counters stereotypes often portrayed by politicians and mass\nMedia the NPR poll was done in conjunction with the Robert Wood Johnson Foundation and the Harvard th Chan School of public health\nMany surveyed said their hometowns did face serious economic challenges but there's also optimism Rob Clements lives in rural delta County Colorado one struggling national resource based county that seeing an influx of new people and jobs largely thanks to technology\nIs fun to see you see people out on the streets with a smile on their face and you know I'm not worried about where their next paycheck is going to\nCome from climates daughter was recently able to move back to her home town to take a job with a local company installing broadband Kirk Siegler NPR News\nThe national weather service says flash voting persists in central Texas rivers are overflowing and officials are releasing water from full dams along the Colorado River you're listening to NPR authorities\nAre overflowing and officials are releasing water from full dams along the Colorado River you're listening to NPR\nAuthorities and Florida have increased the number of fatalities from hurricane Michael to at least twenty people overall at least thirty people were killed by the storm in Florida Georgia North Carolina and Virginia hurricane destruction remains widespread especially in the Florida Panhandle\nNow officials in Virginia have announced a new hurricane death but this is from Hurricane Florence which made landfall last month the Associated Press reports this increases the death toll from Hurricane Florence to at least fifty three people in three states Virginia and north and South Carolina\nUS Navy helicopter has crashed on the flight deck of an aircraft carrier operating in the Pacific the crash has caused injuries but the navy says none are life threatening John Matthews reports from your couscous Japan the home of the carriers seventh sleep\nThe image sixty Seahawk crashed shortly after takeoff while the USS Ronald Reagan was on maneuvers in the Philippines seat\nThe navy has declined to say how many feelers were hurt or how badly the helicopter and carrier were damaged but a spokesperson says all sailors injured or in stable condition and the Ronald Reagan is fully capable of continuing its mission Indians do Pacific region maybe additional says the cause of the crash is still under investigation\nFor NPR News I'm drug use in ... Japan\nThe Boston Red Sox aren't going to the world series they defeated the defending champion Houston Astros last night in Houston for two one two when the American league championship that Boston will play either at the Los Angeles Dodgers or the Milwaukee Brewers Tuesday night at home this is NPR\nSupport for NPR comes from the three I owe the powering enterprise digital transformation with artificial intelligence predictive analytics an ... solutions learn more see three I O T dot AI and the ... foundation at ... dot org\n\nGood morning thanks so much for starting gr friday with MORNING EDITION on ... on Emily Jones\nVoters in California's forty eighth congressional district could help determine control of the house of representatives we'll hear why the Vietnamese American vote in orange county is key to their race and Fifteen minutes right here on jeep ... any teen station radio network of Georgia Public broadcasting\nAmerican vote in orange county is key to their race in Fifteen minutes right here on ... any team station radio network\nOf Georgia Public broadcasting ... and beyond its seven ... than [noise]\nThe the weather will have high is from the seventies mid eighties today cloudy skies in middle and south Georgia sunny morning with increasing class later on\nCould be a bit of rain happening any\nBodies guy tonight as well and the chance of rain in the north and lo and\nYou know selling a car can be a hassle but donating it is a whole different stories split I was taking off your hands off your driveway and turn it into public radio and maybe even a tax deductions to resolve the host of marketplace in here is how to do [noise]\nEight seven seven GP beat one car or donate securely on line a G. P. D. dot org slash cars ten thanks [noise]\nIt's MORNING EDITION from NPR News I'm David Greene and Laguna Beach California and I'm\nSteve Inskeep in Washington D. C. President Trump has acknowledged what increasingly seems like reality or a ... a reporter asked him do you believe us Saudi journalist us residential market show gee is debt\nAh it certainly looks that way to me very sad certainly look this\nMarks one of the few occasions on which the president has endorsed the broadly accepted outlines of the case ever since the Washington Post writer walked into a Saudi conflict and vanished in Turkey suspicion is falling on the Saudi Government get the president has suggested conspiracy theories about who could be responsible for a gruesome murder\nAnd said Saudi crown prince Mohammed bin cell bond was being held guilty until proven innocent what does the U.S approach really mean for the Saudis and for Americans\nAnd for freedom of the press will talk that through with Victoria Nuland of the center for a new American security she's on the line she was assistant secretary of state under President Obama ambassador to NATO under President George W. Bush to morning\nOr good morning Steve ... with you know watching from the outside what does President Trump's goal appear to be\nWell I think it's important that President Trump seems to the ...\nGood to be with you know watching from the outside what does President Trump's goal appear to be\n[noise] well I think it's important that President Trump seems to acknowledge reality as you said in your opening that this was a grisly murder of\nThis is NPR News\nAnd this is MORNING EDITION on TPP good morning I'm Emily Jones Saudi Arabia invest heavily in us tech companies\nIf you have a start up and big dreams of changing the world making it a better place a lot of those people have been very happy to open up to Saturday investors\nMore on the close ties between the Saudis in Silicon valley and how that might change falling to suspected murder of journalists from all ... and\nFifteen minutes here on the TV it's seven twenty\n... one of the most important George elections in decades he takes place in just Eighteen days just ... as you begin to firm up your choices for political rewind your panel of insiders will be here for days a week to help guide\nYou through raises from the top of the ballot to the bottom of the ticket joined me the ... Jim Galloway and the mayors of Columbus in\nSandy Springs today you do for the latest election news\n\nSupport for ... comes from our monthly sustain hers\nAnd making magazines seeking sharing and celebrating the good life and the good stories and making and middle Georgia since Nineteen eighty six more information plus how to subscribe and advertise at making magazine dot com\nDoes your busy life keep you from staying informed TPP has you covered you can listen live the TPP news dot org and on your smart home device follow us on Facebook and Twitter ... G. P. B. news democratic congressional\nCollectively raised more than a billion dollars for\nPrepare to go big and go public in early estimates put the final cost of hurricane Michael over ten billion dollar\nFollow the news and follow the money on the friday news around us from New Hampshire liquor\nEarly estimates put the final cost of hurricane Michael over ten billion dollar\nFollow the news and follow the money on the friday news around us from New Hampshire listening on one [noise]\nOn the TV and eating out or\nInstead of\nPortraying PR comes from the station and from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring John Slattery Amanda ... Paul Riser and Kathryn ... on a new episode every Friday on prime video\nFrom T. I. A. T. I. A. is\nCommitted to helping those who are driven by purpose reached their definition of success investing advice banking retirement learn more AT T I Am a dot org\n[noise] from logged me in makers have go to meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more it go to meeting dot com\n[noise] and from Americans for the ...\nIt's MORNING EDITION from NPR News I'm Steve Inskeep in Washington and I'm David Greene in Laguna Beach California there is a competitive race here\nIn California's forty eighth congressional district voters here might really help determine control of the house of representatives and we have been spending time\nListening to what is on their minds so this is Orange County it's home to the largest Vietnamese population in the United states' part of this district is actually known as little Saigon and tea anthem tram lives here she works in community affairs for a utility company she is raising two kids\nOr parents also live in this community but she says their lives and her's are so different\nMy parents are pretty much their lives are in little Saigon my dad works at a pharmacy\nAnd sell their lives are in the Vietnamese community right and for me I go out in the world I experience race is that I Know what it feels like to be discriminate against I I think my parents have that because really they their lives or hear their communities here they go to a Vietnamese mass they go to their customers are ... or ... or ... diverse\nNow I realize my experience as an American very different from my dad\nThese generational differences extend into politics older Vietnamese Americans have tended to vote Republican many of them fled communism and they see Republican presidents from Reagan on as being tougher on communist leaders\nAmericans have tended to vote Republican many of them fled communism and they see Republican presidents from Reagan on as being tougher on communist leaders some younger people like ten term trend have been leaning more democratic and that is one reason the party believe they can unseat the Republican incumbent here\nSo when we went to visit the anthem tram we had heard there were some political differences in her family though I'm not sure she herself new quite how stark they were\nHigh high\nShe invited us into her parents' home her kids were playing around they were eating snacks and they were orbiting around the grandfather [laughter] how Tran is ... father he primarily speak the Vietnamese in his everyday life including when he talks politics with his daughter\nDecent backing Republicans since he first started voting in Nineteen Ninety two and he told me it was certainly no fan of president Brock Obama who he said just wasn't tough enough on the world stage\nWhom are spending like him very much\nAnd and then what now I guess we're today we have Trump what do you think of Trump so far\nSofa in this\nCountry who do a good job what do you like what\nYou're unemployed rate low uh-huh\nAnd the\nStock market in a row seat in Greece and\nSo the economy is important do yeah\nAnd that this is this is um I up\nIn a [laughter] I didn't realize how he he thought of trying to see how they talked about that so is this the first time you had a surprise because then I'll have a conversation hold on the other stuff that he does against the media\nAgainst like just civil society we grow up knowing how undemocratic Vietnam as the crackdowns on freedom to pass on basically writes women don't have the same right there and to see some of that happening now in America you know in some factions of government is scary because that was something that I never would imagine\nWe would be in a situation where we have a president that basically calling to press the enemy of the people like we hear that from communist Vietnam so we don't hear a you know I Would never have imagined that would be reality here today\nBecause you say that you're dead and yeah I'm just I just wonder why when Trump calls the media enemy of the people\nWhat your reaction to that\nMenu malign like oh and you know not to you\nMedia enemy of the people\nWhat your reaction to that\nMenu ally like I'll go home and your doctor you\nAre from time to press talk about what the ...\nBut they don't care about the food thing\nYou're just has so yeah CNN again from\nFall to both him\nSo they're not there by us yeah Fox News clearly a fire and I don't know if you're does have an el\n... in la la la I'm Trump\nTo Fox is like trying to you know make a phone [laughter] [noise]\nDo you think do you think the media\nIs too negative about Trump it's not fair\nTo say that Russia interfered in through the election in this country ...\n... ... when they know that\nWhy don't why shouldn't before the election [noise] the way until drum\nBoth elected and the money issue\nSo if if they find out that Trump worked with the Russians where that would that bother you yeah\nBut you don't you don't believe that you\nNeed to improve that don't need to believe them you know through the\n... FBI ... no doubt no doubt all he believes that\nThe Mueller investigation should continue so they may have we have the facts I agree with that\nYeah there's something you agree on yeah\nThere are a lot of families who've been divided over\nTheir views of from what you hear like dinner conversations that\nYeah to go really badly in I mean people get it from the table yeah it I mean this is it doesn't seem to be happening in this\nNo because I don't think our country should be torn apart because of one person I clearly have strongly against you know what the president stands for\nBut I also believe it's important to me I respect my parents I Know what their experience has been and and we came here so that we can have the freedom to have different views to have this kind of conversation said they don't happen in Vietnam and so the fact that my dad\nHas a different view from me on this particular issue that doesn't bother him because we have that freedom that's why my parents let Vietnam to be here in the first place\nEverybody\nGot to go to vote yes you would fall choice\nAnd for future either we're tending\nTo think everybody should vote yeah\nMy father I didn't mention the ...\nFall choice\nAnd for future the weird thing\nTo think everybody should vote yeah\nAnd my father I didn't mention any he um after the war he was a political prisoner for ...\nA two year three years he was held in a political concentration camp or not I have\nTo do good re education and um\nYeah where the communist tries to you know basically get him to change his thinking\nIt's it's powerful to hear\nYou say that people should vote from mhm history that you have\nYeah I just think we need to protect our democracy\n... drone motorized because the if we were wrong than it will make it dry how we have another ... ...\nThat was the ... trend and her father couch trend there to voters here in orange County California and we're going to take you to other corners of this district elsewhere on the program this morning this is NPR News\nEven in the public ones there is a growing sense\nThat they are standing on top of an indefensible mountain that America has been led by plutocrats who are fundamentally motivated by the bottom line but who have spun us all a tale of how they're trying to transform civilization and that things need to change but in the private conversation Steve I Will tell you deep\nIn the bowels of these institutions there is a generation of younger people who frankly do not believe the stories\nThat their elders and their elders are like in their thirties and forties the case of Silicon Valley do not believe their stories a bunch of people coming up in the valley frankly have a much more sophisticated understanding of power the varied power they wield and the privileged they wield that some of the people who founded these companies have been catastrophic Lee blind to\n[noise] on a bearded us is the author of the book winners take all thanks very much for coming by\nThank you Steve are an American graduate student has been released from the airport in Tel Aviv after being detained for more than two weeks we're more from NPR's Daniel Estrin in Jerusalem\nAmerican graduate student has been released from the airport in Tel Aviv after being detained for more than two weeks we're more from NPR's Daniel Estrin in Jerusalem\nLower cost them is twenty two years old at a recent graduate of the University of Florida\nShe landed in Israel at the beginning of the month for a master's program and human rights at an Israeli university but authorities at the airport denied her entry under twenty Seventeen law banning activists affiliated with the pro Palestinian campaign to boycott Israel\nAll cause I'm used to have a small chapter of a pro boycott student group but now she says she no longer supports the boycott she was held at the airport while she fought in court for the right to enter Israel\nHer story caught international attention following several other cases of Israel detaining left wing critics at the airport and border and it caused some embarrassment in Israel\nAnd then I thought was a hot dog stand that\nDeputy foreign minister the peaceful to belly told\nIsraeli radio last week that Israel's ban on all cost them it was not very successful she said Israel should reconsider how it applies at century band when it turns into an international issue we lose more than we when she said\nBut Israeli strategic affairs minister ... who led Israel's campaign to ban all costs them defended the move\nThe little guy and he said don't just look at articles in New York Times and the media critical of Israel argued there are thousands of pro Israel students and the U.S will contend with pro Palestinian activists on campus too will support or move without costs some\nProponents of the boycott they've estimate and sanctions movements say there peacefully protesting Israel's treatment of Palestinians but Israeli leaders have called it a campaign to undermine Israel's legitimacy as a country\nLaura al ... case reached Israel Supreme Court which ruled that costs them had not been involved in boycott activities for more than a year and had demonstrated an academic curiosity about Israel she was released from the airport yesterday ... is her lawyer it for free speech\nAcademic freedom and there were a large Keith ... I thought we had absolutely no place in a democracy\nA right wing Israeli activist groups that it would be closely monitoring all cost them during her time in Israel to ensure she did not promote a boycott the Hebrew University of Jerusalem which had supported al ... case in court said it looked forward to having her on campus next week Daniel Estrin NPR News Jerusalem\nFor a city of Jerusalem which had supported al ... case in court so that looked forward to having her on campus next week Daniel Estrin NPR News Jerusalem this is NPR News [noise]\nYou're listening to MORNING EDITION on gp beat can morning I'm Emily Jones I had the Nineteen Seventy eight Halloween movie was directed by John Carpenter and he also composed it's creepy minimalist score\nThere's new Halloween coming out and partner has also scored Michael Meyers at twenty Eighteen homecoming will have that story in Fifteen minutes right here on TPP an Eighteen station radio network of Georgia Public broadcasting including eighty nine point five at them into Lonegan law\nTonight on G. P. B. T. V. football friday's in Georgia features the Roswell hornets facing off against a wall to readers that ball in high school you're all accept path begins at seven followed by kick off at seven thirty that's tonight on TPP TV [noise]\nDavid Folkenflik coming up on the next on point a black teenager witnesses upfront killed by a white police officer that's the storyline of the new film the heat you give we're joined by the director and by young activists who told their stories what it means to be black in America today that's coming up on the next on point from it\nThis morning at eleven ...\nSupport for ... comes from generous listeners like you and Miller theater and national shows to presenting country folk pioneer Mary cheapen carpenter October twenty six that Augusta's Miller theater tickets remarry chip and carpenter available at the Miller box office and Miller theater Augusta dot com\nAnd the historic Sam short line railroad Thomas the tank engine visits the Sam short line train at Georgia veterans state park in ... October Nineteen through twenty first plus the twenty seventh and ... tickets at Sam short line dot com\nThe next how I built this we meet the guy who created ... crowd sourced a way to make the Internet more informative and those early days was very funny you could just be the first person to say Africa is a complement Planet Money we discovered the ins and outs of the non disclosure agreement a contract that has the power\nAfrica is a constant thing printed money and he discovered the ins and outs of the nondisclosure contract that had the power to buy her silence to an hour of economic an innovation on Planet Money and how I built this from NPR's\nAfternoon at for support for NPR comes from this station and from the department of homeland security with e verify dedicated to providing employment eligibility verification for all businesses and the employees that helped them thrive\n... verified dot Gov slash go\nAnd from the alliance for lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more it alliance for lifetime income dot org\n\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep the United states is not the only country debating how to protect its southern border Mexico the country to the south is also trying to secure its southern border the border with Guatemala\nAuthorities are sending soldiers immigration agents and federal police there they're aiming to stop a caravan of migrants who are hoping to leave Central America and in some cases cross through Mexico on to the United states James Frederick reports from ... Mexico\nTwenty three year old Honduran daisy crews who says she's swinging abusive gang member boyfriend crust into Mexico two weeks ago but then on Thursday she turned around after making a decision to head back south towards the border with Guatemala to join a rally for the migrant care of\nA winter they\nLook and\nShe says she came to supporters fellow during here so they don't feel alone [noise] crew's joined about fifty other migrants an activist since you like to go a town that sits on the Mexico Guatemala border the police and activists soon clashed in chaos broke out and you can hear in the cell phone video from the [noise]\nEating ... Mexican American migrant activists who helped organize a similar my grand caravan in the spring the first part to President Trump's higher federal police alleged ... previously vandalized an immigration vehicle\nAs migrants tried to stop ... arrest crusade police got rough with everyone even women and children than than me\nThe vandalized an immigration vehicle as migrants tried to stop ... arrest crusade police got rough with everyone even women and children\nThey made me she says an officer told her to shut up they pointed a gun to her seven year old son and\nThreatened to kill it to others present during the incident corroborated her story spokesmen for Mexico's federal police tells NPR he was not aware of that specific incident and says activists initiated the aggression to clash and the Mexican border town is a foreboding sign of what has to come\nAs a caravan of thousands gets closer\nDozens of federal police in riot gear have already been stationed on the bridge connecting Mexico in Guatemala\nMexico human rights commission came to see what he does go to try and head off the tensions the group's spokesman had got costs us ... says he wants to Mexican police to keep one thing in mind is the caravan approaches\nTo assemble ... senior cells and uses for fighting for the rights of Mexicans to be made in the U.S he says the least we can do is respect the rights are Central American brothers and sisters here in\nMexico while most they're still on their way about four hundred migrants from the Caribbean or already just across the border and the Guatemalan town of mine [laughter]\nIt's a peaceful compared to the clashes next door in Mexico families relaxing the shade chatting and laughing eating and drinking donated food\nAnd water and you have a twenty nine year old single mother for who says their families flee gang violence doesn't want any trouble with filling and Sunday\nShe says we come with the spirit of tension used violence nothing like that were just looking for a\nBetter life but as things stand now race for children and the other migrants will be met by force at the Mexican border for NPR News I'm James Frederick ... die goal Mexico\nI'm Steve Inskeep and I'm David Greene\n[noise]\nSeven forty seven FM W. J. N. double your GBH room for debate Georgia Public broadcasting radio network [noise]\n\nLive from the G. P. B. newsroom I'm Emily Jones good morning [noise]\nWe'll hear from voters in California's forty eighth congressional district where a political newcomer is trying to unseat a long time Republican congressman\nThat's in just under ten minutes in today's Georgia headlines hurricane Michael could cost Georgia around three billion dollars in lost agriculture the University of Georgia and Georgia forestry commission released early estimates of the damage caused by last week's storm they report around a million acres of timberland was destroyed a billion dollar loss\nDepending on what farmers are able to harvest cotton losses could range from three hundred to eight hundred billion dollars\nThe cons and produce losses combined are expected to tally up to another billion dollars\nPoultry producers and peanut farmers losses are estimated in the tens of millions hurricane Michael's impact on cattle and ... tourism remains to be seen state agriculture commissioner Gary Black says these early last estimates are likely to grow\nThree children and Georgia have been diagnosed with a ... ... polio like virus according to state health officials the cause of a cute flash at ... or a FM is not known Centers for Disease Control and prevention says the disorder mostly affects children\nIt's symptoms include paralysis of arms and legs it's similar to polio West Nile and other viruses and that's what makes diagnosis more difficult according to the CDC\nScientists say it may be linked to other viruses that genetic disorders or toxins in the environment for more Georgia News Go to Jean TV news dot org\nLine from NPR News in Washington encore of a Coleman President Trump was in Montana last night campaigning for a Republican Senate candidate less than three weeks before the midterm elections Eric Whitney with Montana Public radio has more from Missoula\nWas the president's third visit to Montana since July to campaign against Senator Jon tester who she holds responsible for sinking his previous nominee for ... secretary Dr Ronny Jackson what he did was unfair\nCampaign against Senator Jon tester who he holds responsible for sinking his previous nominee for ... secretary Dr Ronny Jackson\nDid was unfair what he did what he did was vicious what he did was was judge Kevin\nThousands more people came to the rally than the airport hangar it was in could hold more than a thousand also attended a protest rally on the other side of town for NPR News I'm Eric Whitney in Missoula, Montana\nPresident Trump says it certainly looks like missing Saudi Arabian journalists democracy ... gene is dead\nOfficials in Turkey has indicated they have audio evidence that ... was murdered inside the Saudi consulate in Istanbul the Saudi Government vehemently denies this turkey said today it has not shared any audio with the U.S government\nOfficials in the U.S southeast say that at least thirty people have died from hurricane Michael officials in Florida have increased the death toll there and people also perished in Georgia North Carolina and Virginia\nIn Florida's panhandle hundreds of families remain displaced and bears ... long reports many are still in emergency shelters in schools in the worst affected areas\nThe damage from hurricane Michael's high wind and storm surge has made many homes unlivable hundred sleeping in school gymnasiums around Florida's panhandle aren't sure where they will go in the emergency shelters close\nAngela lips Panama City lived in an apartment building for seniors that was damaged by the storm she says she's trying to take things day by day for now and not get too worried about what's next\nYou wreck yourself that it's the same\nWe have five ... is accepting applications for vouchers that can be used for temporary stay in hotels or condos before residents by more long term housing undo along NPR News bay county Florida\nWall Street had another down day on Thursday the Dow Jones industrial average drunk one point three percent the tech heavy NASDAQ Composite index film to point one percent margin Sandy is chief economist for Moody's Analytics says investors have a number of worries\nSo higher interest rates prospects but the Federal Reserve will continue to push retire overvalued stocks the people are nervous that the stock market has come too far too fast and of course there's a trade war ah that's escalating with China and that's not good news so you combine all that together and investors are nervous\nWall Street opens in about Ninety minutes the national weather service says flash flooding persists in central Texas rivers are overflowing officials\nThey're nervous Wall Street opens in about Ninety minutes the national weather service says flash flooding persists in central Texas rivers are overflowing officials are releasing water from full dams along the Colorado River it's surging downstream towards saturated areas this is NPR\nThe Justice Department has opened an investigation into child sexual abuse allegations against Roman Catholic priests in Pennsylvania\nThis follows a wide ranging skating state grand jury report released last summer that alleged three hundred priests abused more than a thousand children for decades the grand jurors called for action by officials and state lawmakers and their report\nInterior secretary Ryan Zinke is drawing criticism after an internal watchdog report suggested he violated department policy on family travel NPR's Nathan Rott has more\nTo report by the interior Department's Office of the inspector general found that I think he's wife and others troubled in government vehicles and it does make you happy park police security detail go with them on a vacation costing tax payers twenty five thousand dollars\nThere's no policy prohibiting the ladder the report says but does it gets department rules to have family trouble in government vehicles\nVicky did get permission from the agency's solicitors office for the family travel and a spokeswoman for the interior says that proves he followed proper protocol think he's facing more than a dozen other investigations Nathan Rott NPR News\nElection officials in Afghanistan have postponed national elections for the province of Kandahar\nThere'll be held on Saturday in the rest of the country this follows a Taliban attack yesterday in the governor's compound that left Kandahar as top police official and intelligence official dead the provincial governor was wounded the top US military official in Afghanistan was present but escaped an injured three Americans were\nWounded on corporate Coleman NPR News\nSupport for NPR comes from NPR stations other contributors include a log me in makers of go to meeting a collaboration meeting platform allowing people to come next around the globe to get work done learn more at go to a meeting dot com and the listeners who support this NPR station\n\nIs NPR station of course is cheap ... good morning mentally Jones thanks for starting friday with us [noise] I had an undocumented immigrants who lives in the U.S legally at least for now has taken an unusual path\nYou hear friday but that I had an undocumented immigrants who lives in the U.S illegally at least for now has taken an unusual path\nSo I started working as an immigration attorney it's weird to be in those offices with somebody else all sorts of central tradition\nAnd that's the story for this man and his wife talk about their hopes to make his legal status permanent at in twenty minutes\nIf you or your loved ones were affected by hurricane Michael food and water are available at multiple distribution points across southwest Georgia a full list is available at the gym a website\nG. E. M. A. dot G. A. dot Gov\nSurvivors in Baker Decatur Doherty early Miller seminal Chris Grady Lee Mitchell Terrell Thomas in worth counties are eligible for federal disaster assistance through FEMA\nThose survivors should ... planes with their insurance companies first then visit disaster assistance dot Gov or called eight hundred six to one three three six to\nIf you need help with debris cleanup contact crisis clean up at eight hundred four or five one Nineteen fifty for a full list of all survivor resources is available online\nAt G. E. M. A. dot G. A. dot Gov\nIt's MORNING EDITION from NPR News I'm Steve Inskeep in Washington and I'm David Greene in Laguna Beach California and the waves behind me I Know they're not your typical soundtrack for election coverage but here in orange County California there's a really interesting race that could help determine\nWhether Republicans hang on to control of the house Republican congressmen Dana Rohrabacher\nHas served the forty eighth congressional district here for nearly three decades but there is a political newcomer Democrat hardly wrote a who seems to have a shot at an feeding him this district that has been moving to the left and we got a hint of why that is the other night [noise]\nWe were in Laguna and the gal it's one of the super wealthy towns in the hills above the Pacific here\nAnd this is where some very rich voters are changing the political landscape\nEric McDaniel that with her editor\nEric giving his name so we could pull through the gates we then went up to a house where there was a Porsche parked\nIn front of this huge fountains and our host to read and tone brought us inside David nice to meet you too and Antonio is Iraqi American\nHuge fountains and our host to raid and tone brought us inside [noise] nice to meet to Antonio is Iraqi American he moved from Baghdad\nTo the U.S when he was six years old he served in intelligence in the U.S military and then he made a bundle running and then selling medical device companies that's for his politics\nThis is NPR News\nAnd this is MORNING EDITION on cheap ... good morning I'm Emily Jones in California the Democrats are hoping to flip a reliably Republican House seat but it won't be easy\nFrom what I'm hearing if they get powered all they're going to do is investigations and impeach that doesn't when\nMy heart we'll hear from voters in California's forty eighth district about the upcoming midterms in Fifteen minutes right here on ...\nMy my ripped later this week on science friday a sleep sciences spill the beans on insomnia Knight animals and now\nOne of the great things about being a sleep researchers ... miles from the I've known since ...\nPlus why genes may decide your bed time on science friday from WNYC Studios [noise]\nThis afternoon it's three on TBN gp news dot org\nSupport for deep ... comes from generous listeners like you and the historic Sam short line railroad Thomas the tank engine visits the same short line train at Georgia veterans state park in ... October Nineteen twenty first plus the twenty seventh and ... tickets at Sam short line dot com\nAnd J. P. Morgan Asset Management who believes and constrain thinking leads to better outcomes and entrepreneurship and investing their video series explores the impact of the un constrain spirited J. P. Morgan dot com slash on constrained democratic congressional\nCandidate collectively raised more than a billion dollars for their campaign\nPrepare to go big and go public in early estimate\nThey collectively raised more than a billion dollars for their campaign\nAnd live up here to go big and go public in early estimates put the final cost of routine Michael over ten billion dollar\nFollow the news and follow the money on the friday news Rhonda from New Hampshire on one [noise]\nOn the TV and eating is down or\n\nSupport for NPR comes from this station and from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial wellbeing first learn more at Raymond James dot com [noise]\nFrom Rhodes Scholar a not for profit offering learning adventures for adults and natural settings across the country learn more at R. O. A. D. scholar dot org slash retreats [noise]\nAnd from gobble immune kept company that delivers semi ... meals to be finished at home in Fifteen minutes with one pan gobble sous chefs do the prep work like chopping and marinating\nThis week's menu is a global dot com slash NPR\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep we're hearing all morning about elections the United states let's take a moment to check on democracy in Afghanistan the country has been planning parliamentary elections this week up most of the voting will proceed but in a very large populous province\nThe voting has been postponed that after an attack that left to senior officials dead including a top police chief\nPamela constable covers Afghanistan for the Washington Post and she's on the line more to the program\nI'm Glad to be with you I guess we should figure out what was supposed to happen this week and what is the original plan what's at stake and what's the campaigning bin Laden\n[noise] uh the original plan was to have a very big nationwide election more than two thousand five hundred candidates for two hundred and forty nine seats in parliament candidates of all all flavors and philosophy\nA there was lots of excitement about the election but also lots of current and worry partly because the frets tried to call on which has now come true awe and partly widespread of widespread charges on that there was going to be massive fraud\nBecause of threats by the Taliban which has now come true and partly as widespread of widespread charges on that there was going to be massive fraud so you've seen a lot of positive uh campaigning lot of new fresh faces a lot of enthusiasm but also a great deal of\nOf worry a and and and anxiety at the same time\nSo you've been reporting in Kandahar Province really large important province the voting will be delayed for a week brought this does raise a question what is possibly going to be any different a week\n[noise] right and we don't know that obviously this is a a a measure of taken on an emergency basis\nUm just to to sort of calm things down I mean kind of hard to very large province which is tough loss it's police chase its intelligence chase and the governor has been gravely wounded um there's a huge security vacuum people are very nervous and worried um so I think this is obviously a measure designed for short term relief of that\nI'm obviously decision will be made later on I I Would taint can help that that elections can be held there because it's a favorite populist lots and lots of voters um but let's let's see what happens tomorrow um let's see if there's violence elsewhere or not\nUm and to what extent that happens how how bad it is I suspect a generally speaking or they're going to be taking things one day at a time here\nDoes you'd feel and the rest of the country ... like a democratic process does do you feel like you're in the middle of a reelection campaign where the people's will might be expressed\nI Do it does a it's been it's been a a a nice experience so to speak out compared to previous\nElections here um you know record record numbers of candidates out and about a four hundred women are among the candidates was which is extraordinary\nA for a very traditional society like this one\nOn the other hand candidates although they've been busy an active have not been doing a lot of public campaigning they've been proved that they've been cautious\nThey've had inside events um they've had a loudspeaker trucks but you have not seen a massive public rallies a few have been held in the provinces and some of those have been attacked\nI'm so and and as we mentioned earlier Ken candidates have been killed and\nWell okay constable of the Washington Post of Afghanistan and thanks so much\nThey're very welcome\nThe music means it's time to record the morning\nIt's an Afghanistan thanks so much\nUm Mm\nThat music means that it's time for historic or this morning and you were a general being home was two years old when errands brought him to the United states from Mexico on a tourist visa\nThey never left because I was allowed to stay in the U.S thanks to the deferred action for childhood arrivals program or DACA he went to law school in two thousand twelve it was around then\nThat he meant Ari on an air most CEO on a bus he leader asked her on a date and that's when ... Cohn told her that he was undocumented\nDidn't make you feel apprehensive about dating me\nNo it didn't make the apprehensive it was almost like it's okay it's cool but not even fully crafting what that meant I was a U.S citizen and I think I didn't realize that I Would start living some of that indirectly through spending time with you\nSo I started working as an immigration attorney it's where to be undocumented it's weird to be in those offices with somebody else who also is on the same situation you bunch and to me that sometimes you're scared of yours or of nervous when I go to immigration court or when I go to I\nGuess I imagine you going in there and talking smack and just kind of standing affair clients and I just imagine you saying the wrong thing [laughter] comment that should have you ever been afraid\nI'm I'm always afraid [laughter] um when I went to my first I check in with a client on the fourth floor and it's just complete packed to the brim and you cannot walk around and it's very hot it's almost suffocating sometimes I'm curious if they know about my status\nYeah we've kind of unspoken system\nFor you telling me in the morning that you will be\nAt a nice check in and then I said please be careful and then you take me when you're out in safe and they say\nThank God [laughter] it does way me down a little bit it is a very specific cloud hanging over us [noise]\nIt just feels like we're at pause travel plans are paused long term plans or pause you know we ... we want to\nA house we really can't take too many steps in any direction until we have this resolved so it is hard [noise]\nOur wedding day feel like for you um I think I I thought that piece yeah like it's a it's it's a start is something new for us\nWhy did our wedding day feel like for you um I think I I thought that piece yeah like it's a it's\nIt's a start up something new for us we've been together for over five years now\nYou've been very supportive and burger and [noise]\nAnd so many ways\nI Wonder how you feel when you no longer have\nTitle of undocumented person\nBut I'll be there with you [noise] so [noise] ready to her\nThat was your Tara become an authority on it or most of them although they were married earlier this year it's unclear whether become receive a green card and become a permanent resident\nAn interview was going to be archived along with hundreds of thousands of others why Britain Congress\n\nMajor support for StoryCorps comes from Subaru featuring the all new three row ascent feeding for up to eight and a choice of second row captain's chairs love it's what makes a super super and learn more it Subaru dot com\n\nOr these friends with people who you know their friends and it's like I call it the Trump arrangement syndrome I Know you've heard of it but it's there are so different people and when you bring up from it's like a flip the switch for them\nNow about three miles away in another hundred to a beach home we spoke with Shane and ... for them\nTo come in and of course it's all campaigned preferred buffet and everything else right back here really\nIs a middle school teacher who's running for city council and seemed to have nothing at all uncommon with on a killer and again these are two women who politics are motivated by the same emotion fear she noises that she remembers feeling it at her middle school the morning after Trump was elected\nOn that day when I Know that so many people are just devastated and in shock and calling back into the covers I knew I didn't have the luxury of doing that because I had hundreds of Latino students\nDevastated and in shock and calling back into the converse I knew I didn't have the luxury of doing that because I had hundreds of Latino students at my school that we're going to be terrified but will what was going them they were worried that their parents were going to be deported\nAnd some of their parents were she told me only making her students more nervous\nAnd it definitely has an effect on how they learn\nWhen you're living in fear it's really hard to learn about things like cells\nAnd body systems [noise]\nI have several students who we've been trying to get their parents to come in for conferences or to discuss their child's individualized education plan that won't come because they're afraid of getting picked up and the students have shared with me and my mom doesn't have paper so we don't leave\nThey can't they're afraid to come to school\n... this is a Democrat and that's the way she's going to be voting next month for her leave router over Republican congressman Dana Rohrabacher but she says what she wants most is lawmakers who are willing to work with the other side\nI have to believe that there are people on both sides of the aisle that really do want to work together\nThat this divisive mass I really\nWant to believe that that's not who we are as a nation\nBecause it's it's amazing just as a journalist who watches these debates from afar um\nIt seems like so quickly you are labeled as someone who just wants to protect immigrants in this country and doesn't care about the safety of people and people on the other side are labeled as racist and there's just no way to to actually build bridges\nThat is how it looks if you're reading things on the Internet but if you're out there and the community and you're walking with us you'll see that there's far more than it does bring us together then divides us [noise]\nAnd so you'd be ready to to to settle people down here we are just calling the president racist and say\nThat's that's not helpful let's let's try and work for this\nI I Would do that absolutely\nI don't know that I Would actually be able to come out and say he's not racist but I think I could say something along the lines of continuing to\nNarrative is not helpful\nWhat is something that we can talk about that is helpful\nWas the voice of Sheena laces and before that we heard from Donna killer there to voters here in orange County California and we're going to take you to other costs\nThat was the voice of Sheena lasers and before that we heard from Donna killer there to voters here in orange County California and we're going to take you to other corners of this district elsewhere in the program [noise]\nThis is NPR News\n\nServing rock barn and beyond ... an Eighteen station radio network of Georgia Public broadcasting good morning I'm Emily Jones\nA group of advertisers is taking Facebook to court over misleading information on users watching videos on the site the data was enough for some advertisers and news organizations to rearrange their entire business model a lot of that story plus all the morning's business news in eight minutes on the marketplace morning report here on TPP\nIn Georgia business news the state's unemployment rate ditch to three point seven percent in September that matches the national average and is the lowest rate in Georgia since may two thousand one\nLabor secretary mark butler says the number of jobs and employed residents indoor job are also at record levels\nYou can find more Georgia news on our website gp being news dot org and be sure to follow us on Facebook and Twitter as well or at gp be news and you can take gp be with you wherever you go using our smartphone\nDemocratic congressional candidate collectively raised more than a billion dollars for\nUber and Lyft prepare to go big and go public and early estimate was final ... Michael ... billion dollar\nFollow the news and follow the money on the fighting is Rhonda from New Hampshire one [noise]\nIt's MORNING at ten right here on GDP [noise]\n\nSupport for G. P. B. programs comes from our listeners and the Georgia brain and spinal injury trust fund commission advising that a traumatic brain injury is one caused by an external physical force such as a car accident fall or sports the commission can help details B. S. I. T. S. dot George adopt golf\nNext time on studio three sixty\nSixty is career Harlan Ellison wrote countless ... short stories novels beauty shows comic books movies but if you put your fire a plumber and you said how many ...\nWe're Harlan Ellison wrote countless ... short stories novel TV shows comic book movies a huge output if I were a plumber and you said how many toilets or districts and I said in thousand you wouldn't say boy what a prolific plumber somebody supposed to do I'm a writer delete Harlan Ellison much time on studio three sixty [noise]\nTonight at seven on TPP\nSupport for NPR comes from the station and from the ... foundation fostering improvements in learning and enrichment for disadvantaged children and the vitality of the arts for every one ideas that Wallace Foundation dot org [noise]\nFrom the ... foundation since Nineteen eighty five supporting advances in science education and the arts towards a better more just society more information is available at size seems foundation dot org\nAnd from the John D and Catherine T MacArthur Foundation asked Mac found dot org\nGood morning you're listening to MORNING EDITION on jeep ... and Emily Jones when hurricane Michael swept into southwest Georgia a week ago it hit the regents farms with a bomb like intensity cotton fields near harvest were blown bear ended decades old pecan grove were leveled\n... grant Blankenship visited a pecan farm in southwest Georgia to see how recovery from the storm is beginning\nTucked away in the corner of the pie pecan grove near the town of ... is one of those things that Mitch ... says lead the decades he's been living and working here we're [noise]\nPhone thing or another soldier\nFlock\nA half a dozen water birds fly through cypress trees bordering a bubbling spring fed pool right now it's all the debris from the hurricane but this summer swimming is in fact cold\nSo wow [laughter] a lot of fun ...\nHas been the farm manager at ... for Twenty years the family that owns the plantation is mostly scattered to Colorado in Rhode Island\nFor older this is the only homeless kids have ever known he says it's been a good life this means everything to me which is why the scene when we turn from the spring is so painful it's one of the thousands of the country some century old lady blow by hurricane Michael [noise]\nOlder and I've been riding around ... to get an idea of just how bad things are we stopped at one of the farms former money make one of the oldest ... that's actually called a money thing\nOlder and I've been riding around pie in order to get an idea of just how bad things are we stopped at one of the farms former money make\nOne of the oldest ... it's actually called the money make is actually called the money like [noise]\nHere's the biggest one drink just ...\nIt's ripped up from the tap root which is in case in red clay maybe thirty yards away pecans are piled like gravel and dry stream bed\nAndrew could get a hearing in and Savage a lot of this\nThese Titanic trees on the ground or in the way the tractors that usually do the job poster says these problems with the cons are all over the gross but good luck finding the labor to get them up\nI had a crew Monday in that now don't have a group so our I paint them twenty five cent they students' day\nThat's twenty five cents a pound a good ... bringing a hundred pounds a day so that's a twenty five dollar paycheck and harvest Bolger says the problem was the crew didn't want to wait until the end of the week to get paid to the oldest most profitable grove on the farm is done in a good year these natural be headed to China accept\nThis year we didn't contract or a ... because John Wooden bat\nThat's because of the tariffs on pecans that cropped up in the U.S China a trade war Georgia growers had been looking at a year when nuts intended for China would be dumped into American markets depressing prices\nAnd now that I don't know that we can supply what what are Americans would lead [noise] they're still\nMoney to be made in the smaller grove a seven year old trees though it did not escape damage Derek woods is walking those\nRovers would have changed [noise] lots of trees that are still standing have\nBroken tap root she can tell when the leaves look dead so we're just cutting those streets down you have do you have any clue how many trees you've you've cut down so far\nOver out by woods come to small bulldozer to pick up the lens but Bolger says there's still plenty of hand work to do we get ... normally have reserve ear they're they're picking up new behind this", "show_name": "Morning Edition (NPR)", "year": "2018", "city": "Chatsworth", "day": "19"}