{"month": "10", "state": "NV", "station": "KUNR", "content": "Welcome to the music of America [noise]\nTwo hours you're invited to hear some of the greatest music ever recorded big band the blooms balance and broad [noise] now here's your host Bob Carol\n[noise]\nGoing to build a very good eating every body big bands blues ballads and Broadway right here on the music of America I Am your host bond euro blame liberties rates bombs on Reno public radio [noise]\nPublic radio [noise]\nTonight will be having selections from the year Nineteen fifty and specifically from the year in Nineteen fifty four Frank Sinatra will serenade us with a song or two\nWe'll hear Carly Simon Bobby Darin will entertain and these gentlemen will be here the ... fire banned from Canada way welcome to the music of America [noise]\n[noise]\n\n\n[noise]\n\n\n\n\nGoing\nThey do they do and then you must you land back to that and the bad guy in the ground the dad around the neck and about\nAnd he he stands up but they but that you\nYou\nKnow the trouble to die and then you lie to them that that you bet you that you\n\nWe do they do then you will boost demand about ... million make my ... my wreck and you make\nLike Manuel Manuel met that had been up the body you\nMiss me about that you have other than that and then I\nDo know none none\nAround town\n\nAnd then you know Bush landed that should end and then beat me all the heck\nThey now the heck Atlanta tens of bonding and then by when I'm On a kid my arms around you\nKnow\nCars on then you I Do listen to the end of that you've been you know what I\n\nI Do\n\n\nAnd ...\nMiserable\nMiserable\nI use the around the\nShuttle ... and\nVets are poor mom prior\nAnd never show rainbows name my\nMine I'm beginning to see you know like\nAnd they you know lie in\nLittle far [noise] shuttle by then ...\nBig ...\nBobby Darin on the music of America an old song recorded first by Harry James I Believe with getting a gallon\nBack in the Nineteen forties a song called I'm beginning to see the light well welcome again every body Bob Carol with you on this side of the microphone\nFor the next two hours playing the greatest music ever recorded on the music of America and we do it once a week on Sunday night from six until eight o'clock right here\nOn eighty eight point seven F. M. K. U. at our online K. U. R. dot org always enjoy getting your emails to these three where our part of our opening a selection of musical goodies and ah the old Perry Cuomo hit a bushel and a pack\nAnd then it was a St Louis blues march the spirits fire ban will have some more of their music they're great group out of Canada some more of their music tonight for your right here on the music of America\nFor\nNineteen fifty for what are the ears were saluting that I here's Joe Stafford\nHey man you ... do ... do they tell me a lot of the mood is low\nNo\nLand and they can then this week\nSo slow\n\n\nHis new once again people wish they would not ... gay man you're loving we die they\nWant them on my\nOwn em robot is leaving so it was\nCalm the\nDo\nYou need some help\nMuch\nDo you know\nWhen you're on July ... tree in the raising of my Jewish Saddam those sweet ...\nThen signed a contract with Columbia Records and that's some of the music we're going to hear tonight right here on the music of America we're going to hear Sinatra from those early years on Columbia Records and you're going to hurt right here on the music of America\n[noise]\nI can be happy I can be sad\nI can be good or I can be\nBad it all\nDepends on you\nI can be lonely\nAnd I can be lonely out in a crowd\nBy can be humble or I can be\n... it all\nDepends on you [noise]\nI can\nSave money are banned then go\nBlame honey well what do\nI Know that I can be bad\nI couldn't be king\nThe man\nIs on your [noise]\n\n\nI can be happy I can be sad\nOr I can be bad about ... ... and you\nI can be very lonely when I'm Out where the crowd I couldn't be humble or I can be ... by ruby\nDee Ben ... on you\nCan have a great deal of money by Brandon go\nBar and did you\nBlame the ball what I Do\nAh it can be bag or I can be getting\nCan be all that ails the\nDeep end zone [noise]\nFrank Sinatra from what we call the Columbia years Columbia Records so I pray for oh six or seven years before he left for capital records Frank Sinatra and it all depends on you\n[noise] the big band sounds the Benny Goodman [noise]\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n\n[noise] [noise]\n[noise] [noise]\nWhat would you go along with me [noise] Susan ... that'd be [noise]\nWill diagnose balls on the land or\nSea down ... down to New Orleans or then made us\n[noise] oh ... I mean he does [noise]\nWell ... ... and the light bulbs me [noise]\nThat was just reading\nThat is a history is the word dog that lives\nFor me in New Orleans and Leno Rene you'll never know a lot of jobs that much really blessed to be\n... or well done really\nWell right yeah\nMy dad's ... blue [noise]\n[noise] [noise]\n\n[noise]\n\n[noise]\nNa na na na\nNa\nNa na na [noise]\n\n\n\n\nGlad\nYou have you with me as long as it will be\nYou know the way the world ... ... they call it ... [noise]\n\nI Love the\nBeing here with you\n\n[noise]\n\nNo no no no no\nNa na\nNa\nA\nThe\nLies that long around\n\nDo not ball a jar to\nLog in this\nAs a well you know\nI'm\nI'm a golf cart them\nHe did a\nA ... a\nAnd I have no way to do with\nYour so sue ...\n...\nHe was\n\nA then gun ... ranked\nThing\n\nI'm a grown man on a ...\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\nIt just made me\nNow that the way that they knew\nIt was then\nKnow I mean you\nThen when we thought they\nStill\nGetting a little bit that money and you\nBe good then\nWind up being a man\nTo be there you\nMay not and I was well to me that\nDay you know you you\nTwelve minutes before the top of the ...\nTwelve minutes before the top of the hour here on the big bands who is ballads and Broadway\nBut Gerald behind the microphone that Reno public radio eighty eight point seven Emad online eighty a K. U. N. R. died or yes\nDo it that way K. U. N. R. dot org mirror you as performed by the D's three just a moment ago and then we heard a great sound to the ... fire banned the gentleman from Canada I Can't get started with you it\nWas a at last as a\nPerformed here on the music of America by Aretha Franklin and then domino a song out of the Nineteen fifties with Tony Martin all happening right here on the music of America\nYou\nKnow [noise] ...\n[noise] you\nKnow I Know oh I oh\n\nThis I Try [noise]\nI Do my my love\nFor you\nA a\nA\nMan on um\n... ... [noise]\nMy when\n\nI speak your knees\nIn my ... year\n[noise]\n\nYou know ...\nIf you know ...\n\n\nYeah I'm a new\nYou I\nOh\nYou know no no no\nNo\n\nNo\nOh\nNo\nOoh\nIt's the dirtiest hit parade [noise]\nWhat state you're back to the year Nineteen thirty six as we salute the Nineteen thirties hit parade you're on the music of about\n... Paul [noise] oh\nI didn't write what ... was [noise] I looked around ... ... ... [noise]\n...\nWell my my friend\nNot I'm afraid to\nDo\nIs huge drop of kids don't seem as we need to me [noise]\nThis is Rob just misses the one here says use to be [noise]\nThis new law does do seem to have an\nEven buy a\nHome a\nThis is Rob ...\nIs not for me for a new wearing much too so [noise]\nRaul man\nDoes seem\nYeah now ...\n... ...\n... ... [noise]\n... ... ... is not\nFor me for a new law says no\n\n\n\nTo one or two\nTo one another\nOr non ...\n\nLess than ...\nOthers to\nLetter to\nGo to\nThe ... there's no sign\nShare a\nSay\nMe but\nI no\n\n...\n\n\nI'm In the morning\nI'm On the ...\nBlocked the damn ...\nBut a lot and\nNot me\nOne room or I'm having\nAll the\n... with my ...\n... from I knew\n...\n... ...\nHas nothing to do\nA\nThe\nParis man on\nI saw it in ...\nYou do then ...\nThen no not\nLine and\nMan man to\nThe ... ... ...\nAnd ... show much\nLuck that lucky\nI mean nothing to do\nDown on all day\nAnd you know I'm fine and\nIs in\nMy\nNow on it then they\n\nMay have\nLot a lot on it means nothing\n\n\n[noise]\n\nSaluting some of the early years and Frank Sinatra tonight on uh the music of America we call the Columbia years when Frank was assigned to about six seven year term with Columbia Records before I went over to Capitol\nA good thing uh Frankie Lane found that saw before Frank Frank get a very nice job of the ... song that lucky old son your music of American it was not currently Simon just to add to that I'm a food to want you are then from Nineteen thirty is dilute the Nineteen thirties jukebox\nTon\nUh\n[noise] trained or come from a\n\nNon now we're in very smooth grow\nFor a young man who\n[noise]\nRemember\nDay doing during\nGrow again they need the\nMoney to do with the [noise]\nVery ... all the music of America and moon blow the theme from picnic as I've mentioned before if you do that motion picture William Holden\nA at ... Kim ... that's the dance scene to that particular to me that at the ticket or a song during that movie is the sexiest scene in the movies without taking your clothes or was it was very sexy scene between William Holden and Kim dope\nOh is it very sexy scene between William Holden and Kim Novak ... Perry ... on the music of America\nWe heard the great sounds of the ... fire band here on the music of America and a medley of\nThree to ... and then it was a Mr stand man from Nineteen fifty for a record it and that's one of the years we are saluting tonight on the music of America as we're playing big bands blues ballads and Broadway\nRight Wendy by the name of J. P. Morgan to entertain\nTook those oh ... oh\nAnd one\nFrom your uh\nYou know\nThis\nYou know\nBeen neat\nWe\nWe\nThem blow this\nWell\n...\nOh\nMan then no one will be\nOh\n\nOh\nAh ...\nNa server\n[laughter]\n\nSo right\n\nDon't know why don't I don't know\n\n\n\n\n\n\n\n...\n\n\n\n[noise]\n\n\n\n\n\nBut they did but he did but they hop in the opposite but my my\n\nView I when I asked the kono wow on the ground\nLittle ball rhythm gotta shine\nHe's a great big blonde one job I was a ...\nD charge you a nickel to John one\nSigned a letter like new\nYork New lawyer one and then\n... big long list your the buggy walk you\nInsurance giant ball that is all I bought a\nMan the way this cat make the\nBut the hip but the hip hop Andy how did they get the help of the city\nOr in the business\nYour money when the building on\nBody gets a little\nWhen a few and hold on\nEverybody gets a little more than\n... joy who\nEnsure shy\nSo long that bag da da da\nDa da\nDa da da da da da da da da da da da\nDa da da na\n\nRid of big bottom jaw\nIn the\nJaw\nMan\n\n\nNew York oh\n...\n\n\n\nOh\n\n\n\nWith them [noise]\nI have a\nOn the line on the bomb\nRead on the men\nKnow around June\nTo do the I mean in the rat\nIn the rye\nNeed a job and I thought oh\nNow than\n\nThen I think the big\nAnd\n\n\n\n\n[noise]\n[noise]\n\nThere again the spit fire banned this die in a tribute to the Jimmy Dorsey sound on the music of America where the metal the of three Jimmy Darcy classics green eyes am a polar end Tangerine\nAnd then Joe staffer joked that from our spotlight year Nineteen forty four I'll walk alone\nBob journal with you about Thirteen and a half minutes before the top of the hour you're on big bands blues ballads and Broadway\n\nHold off on teams will be in the eyes of the [noise]\nYeah some of the good life [noise] unless you are on\nAll the sadness you see you\nOf how they got that when you or\nI Do want\nWant to know\nDo agree\n\nDoing a\n...\n\nThink that they can be done\nYeah my name's joined in the\nAnd so\nBand do and\nThey buy\nOn that day\nAnd every body again\nBeen pretty well and they\nAnd I'm\nVery ... game win them happy and they\nBlood and then that had\nRead it again but [noise]\n", "year": "2018", "show_name": "The Music of America with Bob Carroll", "city": "Reno", "day": "08"}