{"month": "10", "state": "DC", "station": "WMAL", "content": "Said cornerstone first financial\nMark I'm a cornerstone to him a bit of ... W E mail ... for years they're committed to providing personalized service\nAnd the best pricing and products available rising home values are bought trillions in ... home equity and this rise in appreciation is allowing homeowners\nTo use their houses are virtual ATM so if you're considering home improvement so limited ... pm I or looking for a pre approval for your next home purchased than take my advice and called my friend mark Livingstone with cornerstone first financial\nCalled too old to six to five twelve Twenty one today\nThat's too old to six to five twelve Twenty one or online at cornerstone first dot com do you why they all have and what bridge W a male Washington\nShot one thousand dollar ties\nAnd kill you have A L accumulate station [noise]\nKavanaugh investigation Trump well I'm In the White House is awaiting the results of the FBI probe into sexual assault allegations lodged against Supreme Court nominee Brett Kavanaugh\nAs he headed for a speech in Philadelphia the president said things appear to be going well for Brett Kavanaugh but he edited all all depend on what comes out of the supplemental investigation being conducted by the FBI indicated it would be unacceptable if Kavanaugh is found to have lied to Congress\nI lie to Congress has been a lot of people over the last year that have lied to Congress to me that would that be acceptable Trump\nSays he's hoping for a positive vote on Kavanaugh's nomination later this week where he bowed lander at the White House\nIn New York Times investigation has found that Donald Trump who has long portrayed himself as a self made billionaire received at least four hundred Thirteen million in today's dollars from his father's real estate empire Maine senator Angus King\nThere's nothing wrong with inheriting money from your family the question is how do they get there and was done in such a way as to avoid a tax laws in a legal way avoidance of taxes again this is legal but uh the the article raises serious questions about the methodology of how the money was was transferred\nFor alleged members of a white supremacist group have been charged in connection with last year's deadly protests in Charlottesville, Virginia us attorney Thomas ...\nAfter these four men arrived in Charlottesville light and the day early evening on August eleventh [noise] safer ... and the tiki torches rally on the grounds of the University of Virginia which culminated in violence against numerous UVA students and counter protesters\nOn Wall street the Dow Jones industrial average rose by triple digits closing up one hundred twenty three point the and the down one the NASDAQ off like thirty eight point I mean have\nOf giant beer a new voltage outside the fallout Kavanaugh hearings has had little effect in Virginia's hotly contested\nTempting rational district Democrat Jennifer Wexton currently leads Republican Barbara Comstock by a range of nine to four points depending on voter turnout\nOld can only give you a certain sense of where things stand day\nPatrick director was among the polling Institute but it appears falling from the Kavanaugh hearings isn't changing people's mind a lot of this\nHas been baked and simply because voters views President Trump Democrat\nJennifer Wexton currently leads Republican Barbara Comstock by a range of nine to four points depending on voter turnout\nGoals can only give you a certain sense of where things stand up for what is actually going to happen\nPatrick Murray director of the bottom of polling Institute and it appears falling from the Kavanaugh hearings isn't changing people's mind a lot of this\nHas been baked in like the voters views of President Trump\nThe poll shows Republicans having some success with attack ads against western but Democrats are still expected to pick up the seat loophole has a seven point two percent margin of error when delayed one W. A. L. M. W. O. L. dot com\nIn Arlington County is about to ask people to stop recycling glass bottles and throw them in the regular trash\nAfter all the years of separating trash Arlington County manager march towards now says they can't afford the extra cost\nIn Arlington glass actually makes twenty two percent of our residential recycling stream it actually has a negative market value\nEric ... with the Arlington department environmental services\nSo we're paying seven to two dollars a tons of that material when if we put in a trash could actually forty dollars and sixteen sense of time so\nAll that classical either be tossed into landfills or incinerated far ... W on the L. A. W. N. A. L. dot com\nVirginia democratic governor Ralph Northam says he's going to be to a GOP drawn map aimed at big scene it unconstitutional racial gerrymandering Northam said today that the GOP led general assembly three drawing effort into partisan W male news time NATO for now double your mail traffic\nThere's just a little bit of a slowdown looked in Gaithersburg north bound on two Seventy five boroughs of middle ...\nVienna westbound sixty six now so it's not the street\nAnd the left lane at one twenty three but on the east bound side no accidents just east bound\nYou know accidents just east bound ... delays from the dollars connector sycamore tree and south Ninety five to sell so from Lauren down to the Oscar\nGarage door repair dot com here's the WMA oh weather\nAre thunder storms tonight low sixty nine sunny tomorrow high eighty three summers over\nWhat what a lot of money for you when you were share one thousand dollars four times each week this\nWeek the nine o five AM and twelve o five three or five and six Ofeibea the national ... one nine\nOne thousand dollars every week the\nRules that info checkout W. N. A. L. dot com members don't cry day W. M. A.\nL. in our house bedtime is complicated my wife is always freezing and when she layers up to bed I get way too hot Hi I'm Scott tan and founder of born branch makers of the world's most comfortable seats loved by three us presidents if you're like us you'll love our plain old betting\nBack for a limited time at bowl and branch dot com\nThey're unbelievably soft warm and breathe double so Murthy stays warm and I don't know ... it's like magic we let you sleep with them for thirty nights if you're not impressed send them back for a full refund\nR. flannel sheets coming fourteen stunning patterns and colors you're guaranteed to find a style you love\nBut don't wait last year they sold out in just a few weeks ... dot com today for fifty dollars off your first set of sheep plus free shipping with criminal code relief\nThat fifty dollars off plus free shipping right now at bowling branch dot com promo code relief but one branch dot com spelled B O L L and to branch dot com promo code release your carpets cleaned Tibetan you need heartbeat to go to Joe ... dot com now\nFor you once again based on fact for the\nOf van\nEverybody Martin living here are number eight seven seven three one three eight one one eight seven seven three one ... one one\nI mentioned to you that the New York times and you probably hear this all over the news because it's so in ... us has a story out now [noise] did you go on their website there very clever they think I'm they keep having a picture of his father and then super imposing Donald Trump on his father's face\nBecause New York times if it's anything it's objective not [noise]\nAnd then the headline of the pieces Trump engaged in suspect tax schemes\nAs he re britches from his father [noise] now the Democrats have been saying that they're going to get a hold of Trump's taxes should they took her to the house\nWhen you can see how they work hand in glove with the media [noise]\nAnd so what does a president to do what is a person like Donald Trump to do with an article like this that goes on and on and on and\nHe can't win\nBecause what are you going to do put out a a a thirty thousand word the peace\nDenying it all and then they come back and hit you again\nI told you this was a coup and that's exactly what it is [noise]\nBut let's let's ah the sub headlined the president has long sold himself no see this as a news story\nThe president of the song sold himself as a self made billionaire but at times investigation found that he received it lasts for ... at least four hundred and Thirteen million in today's dollars from his father's real estate empire much of it through tax Dodgers in the Nineteen nineties\nI'm surprised they didn't go back to his high school years [noise]\nNow the New York times is located in New York City ladies and gentleman Donald Trump's empire is located in New York City Donald Trump's been there a long time he's well known in New York City you may have seen his name's on a few buildings as a matter of fact [noise] probably sell them on TV for a period of\nTime but the New York times\nIs writing this now [noise]\nReally [noise]\nPresident Trump participated in dubious tax schemes during the Nineteen nineties including instances of outright fraud that greatly increased the fortune he received from his parents an investigation by the New York times has found [noise]\nTrump won the presidency proclaiming themselves a self made billionaire and he has long insisted that his father legit there in New York City builder Fred she Trump provided almost no financial help but the times investigation based on a vast trove of confidential tax returns in financial records reveals that Mr Trump perceived the equipped\nWell better filters are manufactured right here in America and shipped free within twenty four hours and you can sign up for the scripts and so you never have to think about air filters ever again\nYou wouldn't put a square peg in a round hole so why would you deploy a traditional firewall in a modern decentralized network\nFire walls have new requirements for businesses leveraging fast paced applications and public climbed platforms like eight ws Asher and Google Cloud\nWere in the cloud generation now so you're fire walls have to be engineered to fit right in and claim your clock network trying barracuda ... generation network or application firewall free at barracuda dot com slash fire walls\nWere road here's why it's important to five twenty nine at them and I am six thirty mile to give me washing\nWashington comes to top that Washington is run out a way to surprise you while you're not going to want to live in the mornings on Wednesday morning from my benign on WMA um\n\nWell I read most of the New York times article during the ... yes I read very quickly and uh [noise] just\nTrashing the president trashing as family trashing his father\nTest are really quite\nThan they cherry pick their commentators like some law professor who's an expert on gift taxes and so forth [noise]\n... exactly did they give a law professor to look at [noise]\nSo this is all intended to generate demands or to support the demands by Democrats on Capitol Hill for the president's tax returns going back Twenty years Thirty years whatever is necessary [noise]\nThey are they're really seeking to destroy anyone who disagrees with them anyone who wins an election with whom they disagreed anybody who might go on the Supreme Court with whom we disagree [noise] this is all\nOut political warfare now ladies and gentlemen it is all out political warfare\nThere's no question in my mind about this\nAnd the things that some of these media type say on TV\nAre really are I'm concerned spring while a behavior and will spur more wind behavior\nThese politicians being chased into restaurants you know I find certain politicians on Capitol Hill contemptible I Would never go into a restaurant and confront them or disrupt their dinner or anything of the ...\nIt's a totally different mindset\nI wouldn't go to a protest with a bag of the way they suck full of uh pennies or coins or rocks forever for the purpose of slamming somebody in the back of the head\nI I think that the what the left has reaped is upon us\nAnd we're always on defense\nThere never on defense\nJonathan Lexington, Kentucky they great W. V. I. okay go they mark how're you doing today very well thank you sir\nSo I wanted to come in and talk come on and talk about like up there at that and so I don't have people fight wasn't able to watch your show but I got ...\nLet me just say he's doing a bad job that doesn't even very interviewed on even quicker tip of the iceberg\nBut let me let me just say one of the reasons I was disappointed that the time it was there and among many is a I Believe this man is presidential material\nAnd I think a great a disservice was done to you to me to him on Sunday night I think he's president for material and I and I thought he demonstrated that during the course of the interview and he was talking about the national scene in silver wasn't a parochial interview of any kind\nOf buddies got charisma he's extremely articulate he's very conservative\nHouse than I Would say um during the primaries that if we give Ted Cruz and Donald Trump it'd be like that and he had a rocket conservative values the truth but the straightforward attitude of Donald Trump but despite that no matter who I talked to Kentucky everyone hates and for some reason I\nThought well I'll tell you why I don't know about everyone 'cause he's taking on you've got a disastrous pension situation you're the worse than the entire country worse than New York Illinois and California [noise] uh he pushed for right to uh [noise] so just the right to work in your state\nOr he's pushed to uh to cut spending and cut taxes so he's doing all those things are worthy entrenched a left and there are supporters and government and in the media oppose so he's been trashed but [noise]\nBut he really is terrific in many respects\nI'm so grateful that you said that because people need to hear that and if we elect an out next year than to say that we don't\nYou don't go into a great if he does he\nAll right Jonathan thank you for your call\nLet's go to John Philadelphia, Pennsylvania that great W. P. H. T. go\nA mark on the Philadelphia how are you thank you buddy I'm great thank you good good yeah it's like nobody can less Kathy Griffin says it's okay right yeah right okay so\nWhere where in Philadelphia are you right now where are you from\nNorth Dakota human Mercer county New Jersey so berserk box no barrier yup yup yup\nReal nice like Delaware Delaware River Indian summer so where you are so far I go right into the Democratic cut\nSomething that's working I mean they use this in the journal would almost worked against Trump they improved and squeak by in the Alabama Senate special election and now they're trying to perfect it against capital and I I really don't see how to counter again unless\nIt's financial that they can go after somebody else's financials because that seems you know people either hung up on factor on money and it's a toss up so I'm looking for a way to to to beat this back\nHe just fight them with the truth that's all you can tell you I mean it reminds\nMe of the story of the king of when they\nHave a new crop of the green came in and you know he started feeding it to people they all started going thing is like what are we going to do what are we going to do that had some great leftover for last year and they set aside some people actually only last year's grain that these Democrats are certainly ... silly discouraging to go I Love your show\nTry and try and keep your cannot keep keep doing it out\nAll right John appreciate your call [noise]\nLet's continue\nSort in Salem Oregon the gray K. S. L. and go\nTo mark I root for sure what you're doing a love for them and put the bottom of the first hour about the federalist papers yeah and I wanted to add one thing to that yeah a drawn out of them understood\nOr even Republican ... there were coming up it wasn't enough\nFor me so vote [noise] our constitution was married for her was married only for moral and religious people and corporate governance of any other career was\nOver I agree but it doesn't do us any damn good we're living in the middle of this thing and we're trying to save it right\nRight that's where we need to get people back to religion morality but I also have a question from a terrible thing to watch and all that nonsense are wondering how many people would we have in politics Fifteen foolishness disqualify them\nWhat we have very few in the Republican side on the Democrats' side how many people William politics of adult foolishness to define them and I think every day and want to thank you for your call my friend\n[noise] and the worse the higher up the Democrat chain they go Bill Clinton's accused of rape they nominated for president Ted Kennedy or with Chappaquiddick doesn't require any further explanation or he's the darling of the left and always will be right\nWing go right down the list the White House has responded to this New York times had\nRead Trump has been gone for nearly Twenty years and it's sad to witness this misleading attack against the Trump family by the failing New York times\nMany decades ago the IRS review and signed off on these transactions\nThe New York times and other media outlets credibility with the American people is it an all time low because they are consumed with attacking the president and his family instead of reporting the news the truth is the market is an all time high unemployment is a fifty year low taxes for families and businesses have been cut\nWages are up and so forth and so on\n[noise] perhaps another apology from the New York times like the one they had the issue after they got the twenty sixteen election some virus only wrong is an order [noise]\nTwenty years ago we don't know why the Irish didn't look at it they gave it a pass says the New York times isn't this fascinating who's going to do an anal exam additional burger families officials burgers at New York times I'm just curious\nAll the me I can tell you that way\nI Can't stress enough that you must protect yourself from side to steal personal information email address is Social Security numbers medical cards passwords and retailers are being compromised every day you can't stay vulnerable it's why I switched to my\nFor years making like a two Seventy five an hour you got to make that and lobster and steak city he learned how to cook and when he\nWants a Happy Meal he will go and he will boil up a corn beef or cabbage and so anyway we we put together a bunch of the stories of of ah people and they're happy foods and they're sweet stories a lot of them are really funny and uh we put it together came out today it's doing great a\nHappy cookbook let me let me ask you the ... to make America that's why it's so great that happy cookbook and we have it up on march ... Twitter get it on Amazon any major bookstores but it is it's a nice you know diversion from all the stuff that's going on but I didn't know you know Greg Norman\nGreg Norman a actually just between you and me and my wife and I spend a lot of time down or in the Jupiter, Florida\nUh in the Jupiter, Florida area and they don't give away your address for God's sakes\nNo Jupiter, Florida is large yes I'm ... and so I we have met a Greg Norman through Fox and friends\nAnd uh you know we'll go down there every once in a while and he's got a little golf course it will play out and have a very nice guy and one of his recipes isn't the cookbook and he loves this thing called crispy crackling pork loin which is you take a pork loin and you've got to get a special caught because uh\nMost pork lanes don't have can on it but you need the skin because you're put in five hundred degree of it and you just absolutely knew the thing you cook it for three hours and\nThe skin becomes so correctly they it's a delicacy and I was talking to Stuart various it's Stuart what's yours and I was expecting something completely different ships I Would think a very ... [laughter] I was expecting something British\nUh but he said exactly the same thing and apparently it's a it's a an English thing it's popular in Australia and so\nThat's one of the recipes in the in the cookbook if in fact it's on the back cover the darn thing\n... and you've got a lot of very cool recipes in their ... by you and your wife too which is a which is really something worth a look you know let me ask you a question here is is there a couple times\nComes up with this long article and I've now read most of it really trashing the president trashing his father traction making these these these brought statements about how they're essentially tax cheats going back twenty more than Twenty years [noise] and um\nAnd they said they basically lost the IRS and they said well the Internal Revenue service basically you know look the other way and so for\nNow the Internal Revenue service doesn't look the other way right and this is a huge uh you know family business such a privately held business I don't know how they got access to all this stuff so I don't know if it was in the ...\nAnd the filings with the state or or whatever it was but they are trashing ... he's not a self made man and look at all the money he got when he was a kid and and on and on and on this is really a set up isn't it for the Democrats will keep saying we want Trump's taxes and they're kind of hand in glove working with each other here and a political way\nBut that's their playbook that only God I mean they're still litigating the twenty sixteen election they cannot believe they lost to this guy\nAnd why did they lose because he cheated and he didn't just cheat at colluding with the Russians he cheated his entire business career and his family cheated his dad cheated they screwed people in the welfare system so that they would get rich and ... you know the allegation is you know\nHe had said that he started Donald Trump did with just a million of his father's dollars\nBut you know this story says oh what are they talking about I think I think I read\nFour hundred and Fifteen million dollars is what his dad gave him so he wasn't a self made guy he was a bold and to his father who was a cheater as well crazy\nBut you know let's let's see what the facts are right now it's just one of these allegations that it's been linked to a major\n... isn't the problem isn't this the problem is a huge article yes one allegation after another and what are we going to spend the next six weeks on this right through the mid term elections it's all time though I don't ever remember anything like this when the Kennedy family or how LBJ became a multimillionaire just\nA poor man they speak to that got elected to the Senate he died a multi multi millionaire I mean so much and and Trump makes all this money before even enters the presidency\nAnd they just can't wait to get their hands around his neck\nHow many times mark have we seen in the last year because it's been very effective that are members of the left and the Democrats in particular have or\nHave worked with politician he would you want to talk about a collusion look at the link between the press and some a\nLiberal Democrats for instance uh I was watching the special report program on Fox News and and a a young correspondent who used to live at my house or Peter do see that who you're talking about a minute ago he's out in Montana and he was covering the story about uh the reelection campaign of John tester\nAnd Jon Tester's got a problem right now because a lot of Montanans are veterans and they don't like what he did to Dr Ronny Jackson who is the president's picked to run the VA because if you remember\nJon Tester bleak these are allegations unfounded allegations are I think he first started out on the floor of the Senate or it was in a committed Harry\nHe had these pages of stuff about how Ronny Jackson was a drunk and he crashed the car or some place and he did these inappropriate things that he was given people bills and all that stuff and you know what then it got into the bloodstream of the media and everybody was talking about\nAbout it in the White House came out like within a day and said look we've done it a ... an investigation we can't find anywhere that he crashed the car or these other allegations but the damage was done\nAnd he was dead it was a kill shot it all started with unfounded allegations and that brings us right to where we are today how many times have we\nSeen these things and it's just that they keep doing it because it's work\nWhile I wanted to recommend that people have a little diversion here this is a really wonderful a cookbook and uh [noise] it's a wonderful thing to put on your cocktail table to you and your wife are on the cover that happy cookbook steam and Cathy do see I Want to wish you all the best with is\nSick you great one worked well right God Bless you God Bless you All right\nSteve do see actually a really really nice guy and his wife has to have met her some time ago wonderful suddenly to great shows at Fox and friends [noise] but all you folks out there this is a fantastic cookbook\nLast wife has this cookbook I could you not she has this cookbook it comes out today or we got what three four days ago how they write back months\nWashington Mall W. N. A. L. on more Washington comes to talk\nLarry O'Connor here from my friends had renters warehouse and I'm here to talk about tea and tea that's top notch tenant people respect your property pay the rent on time and good neighbors to those around them\nTop notch tenants of the key to making renting rock and you find them by partnering with ranchers warehouse once your property is in rent ready condition renters warehouse taps hundreds of Web sites and bats thousands of potential runners to score you top notch tendons in just a few weeks on average\nThey do the walk through and they do a thorough background and credit checks they assist with least documents inspections and rental licensing everything to build a solid foundation for a great relationship between you and your renters plus roaming Ninety nine dollars a month renters warehouse manages your property twenty four seven to keep you Andrew renters happy\nThere is no upfront fees no binding contract you can cancel it anytime find top notch tenants for your home by calling to to sixty five forty three Seventy or good or renters warehouse dot com right now that's renters warehouse dot com renters warehouse great tenants live here\nHunting creek windows can lower your utilities improve your comfort ... said he said ... percent Mary Walter here and you've heard me feeling you in on the fact\nThat ... says it while they design build and didn't sell replacement leaned isn't you will never pay the mailman mark up\nMostly new dealers are just brokers any mark up with no value will Thompson creek window company is different because they are the manufacture and they sell directly to use the homeowner with no middlemen\nSigned direct from ... creek means you get high quality windows portable price and now is the best time to call for a price for the cold weather sets in\nHis incredible mom half Sam my feeling is that one\nFifty percent off last zero interest until may twenty twenty eight five five fifty seven ... today and ask about their incredible fall half on sale the counting creek downtown for details you get more for your money counting creek and all eight five five fifty seven creek today\nHey it's Larry O'Connor and I love this time of year don't you nothing better than lying in bed on on on a night and drifting off to a quiet rest full night's sleep\nBut if you or your loved one has sleep apnea the sounds of snoring maybe keeping you up all night you've probably tried the seat pap mask but if it's just not working for you you're not alone now there's a silence masked free treatment option available right here in Washington DC area it's called inspire\nInspired is asleep solution that works inside your body with your natural breeding process it delivers mild stimulation to keep your airway open during sleep giving you and your partner the restful sleep you need\nInspiring is FDA approved and currently offer to more than a hundred and fifty leading medical centers across the country visit inspire asleep dot com to learn more review important safety information and to find a doctor who can help determine if inspired is right for you\nYou and your way out of there will not be another Donald Trump running for president again but I think every Republican since from this point forward\nWill recognize that they need to bring a little bit of what he's brought they need to take that into the political opponents we have a raid against us or there's one kind of candidate we're never going to need to go with what\nAre you looking for an exciting career driving a double decker bus through some of our greatest cities joined the mega bucks to human land over\nCome to their upcoming jobs there on October eleventh and twelfth mega ... now hiring drivers and mechanics offering competitive pay pay the health benefits paid dreaming paid vacation four O. one K. employee referral program\nPotential first earnings of fifty sixty thousand dollars end up five thousand dollar sign on bonus so come to the mega bucks job there at the double tree Largo D.C us capital on October eleventh and twelfth from ten AM to buy beer\nFor more information to order scheduled an interview visit coach usa jobs that coach usa ... jobs during ... must be Twenty one years or older and have a CD or a or B license with passenger doors but their break so don't forget to attend the job beer\nOr visit coach usa ... job that's coach usa Doug jobs\nYou know if it were rich W a male Washington\nOld are you in jail cumulus stations [noise]\nAnd they all knew just six nine Maria leave a heads up the if you're traveling in Montgomery County this hour a multi vehicle crash along I two Seventy south near Montrose road it's been out there for a few hours that is still causing problems right now at least one person has died in that crash and there remains a lot of rescue crews on scene\nAnd Rodrigues we'll have more coming up\nDid you get the first ever nationwide wireless emergency alert system test with hundreds of millions of cell phones today\nIt was much anticipated then much ado about nothing a standard emergency alert tone vibrate written message that said it was a test no action required\nBut technology demands a wireless component to the long standing emergency alert system heard regularly on television and radio stations\nThe alert for the first time ever was sent to some two hundred twenty five million mobile devices across the country those that were turned on of course and had enough reception bars it was originated by FEMA was supposed to have been tested last month but was postponed because of Hurricane Florence Jim rope Los Angeles\nTo New York times is reporting President Trump received at least four hundred Thirteen million dollars from his father over the decades much of that are dubious tax Dodgers including outright fraud White House press secretary Sarah Huckabee Sanders has that story in the times that's not true\nThe president's lawyer address some of the specific claims and walks through how the allegations of fraud and tax evasion or one hundred percent salt and highly defamatory there was no fraud or tax evasion by anyone\nA big night a capital one arena for the home opener for the capitals and the raising of the Stanley Cup banner\nFans outside capital one arena or oh rocking around\nThey're actually taking the call from us today so we've been celebrating ever since before they do that they raised the Stanley Cup manner\nIt felt like to me that the law is really about\nPans here now and now they're saying like how when they hear will be hard about their own eighty\nTwo games ago you know to get into the playoffs and sixteen one's after that and we're back to back\nCapital one and we had a Kurdish sound WMA I'll end up ... if you\nDon't have tickets for tonight's game you can watch it and the pre game better raising ceremony outside of the capital one arena that is free checking your money tonight the Dow finished the day up fifty four points the S. and P. five hundred up to the NASDAQ up twenty six W A L trafficking whether next I find this thing fascinating\nSet up your Amazon Echo your morning sum of all we have five to ... for one time set ups they elect stop and able to do any skill than it was just a Alexa open W A L it's insane details that don't believe in a yoga so\nHere's a story you might relate to I used to post their job ... only to end up with hundreds of resume to sort through\nIt took a week to go through all of those rising just to find a handful of people who are right for my job\nIt was overwhelming settled process for not smart\nI mean it's not easy to find a network architect\nRight for my job it was overwhelming settled process for not smart\nI mean it's not easy to find a network architect financial analyst childcare assistance but then it went through the recruiters\nGet the word forming their powerful matching technologies can thousands of resonated prevented by people with the rate and get a little education and experience for my job\nActively invited them to a blind so I could hire qualified candidates strapped to mark\nThe way the recruiters rated number one by employers in the U.S tried to preclude her now for free of debris gr dot com slash free that the recruiter dot com slash free once again the recruiter dot com slash free ... recruiter\nSmartest way to hire based on trust pilot rating of hiring sites that were went down to review your carpets cleaned Tibetan you need heartbeat to go to Joe ... dot\nCom read news there's a quick way you could say money switch to a guy go guy go could help you get great coverage at a great price and it only takes Fifteen minutes to see if you could say Fifteen Percent or more own car insurance go to guy go dot dom today and see how much you could say\nWe will mail traffic and whether that Rodriguez and the ... and traffic center\nSays roared sponsored by Geico Fifteen minutes good say Fifteen Percent or more on car insurance\nAfternoon starting in Gaithersburg cell phones on two Seventy wherever crawl through shady grove wrote in local of expressed planes that crashed the traffic buying just one lane where the espresso local lanes meat south of Montrose road\nIn Tyson's corner the in a little bit of always crawl route seven to the two Seventy ... which is in turn Jim north bound the outer loop with about ... I'm from Connecticut Avenue on the north bound to Seventy [noise] all the way up to middle brought mouth Raj still repaired on calm fears of WMA oh weather Channel's forecast\nCurrently honey tonight low sixties big there is a chance for a shower tomorrow high eighty eight partly cloudy riding high and low Seventy to eighty four and ... says the eighty six at Reagan National line Maria leaf on Washington Mall doubled you on the L\nTo the national keyboard party can I'm five eight or nine that's party nine five eight or nine P. A. R. T. Y. nine five eight going\nYour rent free and messaging rates may apply\nThe ones that will be in a you\nMars\nYears [noise] knows Roger underground the bowels\nFor you once again based on drugs for the\nEverybody Mars living here are number eight seven seven free eight one three eight one one eight seven seven three one two three have won one as time goes on ladies and gentlemen\nIt is Dr Christine forge credibility that is becoming less and less\nSo and it was weak to begin with\nNow her ex boyfriend says wait a minute\nShe never brought up a sexual assault of any kind to me and they were living for six years she never had a problem flying we flew in a propeller plane in Hawaii\n\n[noise] she lived in a five hundred square foot apartment for a period of time so much for\nThe issue with the respect the claustrophobia\n\n[noise] he said that when they broke up a he broke up because she had been cheating on him and\nShe continued to use his credit card she lied about using it and then he said to her I'm going to turn this over to the fraud people at the credit card company and then she confessed to Jeb that in fact been using his credit card now I Want you to think about that\nWith Kavanaugh fee through ice when he was in college in a bar\nThat is a a a fence so egregious\nOr it should die him machine on the Supreme Court there are a lot of credibility questions that have been raised\nThis report at a real clear investigations he's serious website about the\nTwo doors member she said there were two doors at the front of her house because of her psycho sees as a result of her a molestation\nAt the un identified a home and there are two doors because\nThe need to escape the mentality that she needs to skate in case one of the doors are shut what we now know that's not exactly right\nOf that need to escape the mentality that she needs to escape in case one of the doors are shut while we now know that's not exactly right there are two doors All right but the new door\nLed to a room that was re configured which also had a bathroom which was re configured\nFor businesses apparently we're run out of this room that you start adding this stuff up ladies and gentlemen you got a problem here\nSeventeen million dollars in us how much Congress has paid out and sexual harassment settlements against is bone and members why won't they tell us who are these senators are [noise]\nThis is Corey Stewart on the Republican running against Tim Kaine is one of the senators who judged Brett Kavanaugh guilty even before hearing the fact\nTim Kaine of the Democrats resist anything and everything are president does because they hate President Trump may hate Brett Kavanaugh and may hate anyone who supports traditional American values\nAnd well Tim Kaine and the Democrats falsely accused judge Kavanaugh over high school rumors they won't tell us which of the senators are sexual predators why not senator Kaine what are you ... are you on that list [noise]\nIsn't that the Saturday you applied to judge Kavanaugh I'm Corey sort and I approve this message because Tim Kaine and aligned Democrats can never be allowed to run the U.S Senate again never\nMade more by ... dot com\nBalance of nature's fruits and veggies in a capsule\nI care in a while ago I was walking and find her right right right and I don't know what happened I had the actor accept that in my hand and my great\nAnd that that ... that it I don't have that\nThing that I Am very [noise] I don't feel any that she didn't like attack by terrorists are getting killed it's just wonderful I I'm very very on it\nFor a limited time used discount code mark to receive a fifty percent discount on your first preferred whole health system and have it shipped to you free call one eight hundred two four six eight seven five one or go on line to balance of nature dot com again use discount code mark\nThinking of selling your home Debbie answer rentals with color Williams will guarantee one hundred percent of your asking price or they'll pay you the difference call it for for three four four sold\nOr voted Debby has the buyers dot com that have the buyers dot\nCom Limbaugh joins us in Studio mornings on them all Thursday morning five to nine I W Mam\nOrder to believe Dr stores you have to suspend [noise]\nReal ability to reason\nJust given three different\nAnswers as to when\nThe assault happened mid eighties early eighties and all of a sudden actually was the summer in Nineteen eighty two after she lawyers up\nYou have to believe that she\nWaited waited\nUntil now to reveal that the individual who assaulted her was in fact judge Kavanaugh never said anything anybody else although her husband now has circled back and said oh I remember her telling me doing marriage therapy okay we'd like to see the notes they won't return it they won't release than us so that's not believable\n[noise] she can't remember key details about the night who invited her to the\nParty how she heard about the party how she got to the party how she left the party where the houses exactly with any specificity and of course most importantly how she left the party with whom she left the party how she traveled back home when she got back home\nTo the\nAlleged assault has not been corroborated by single person including none of the people she's named including as well her lifelong girlfriend link Kaiser but apparently it's not change based on reports today [noise] she hasn't provided a consistent account of the alleged assault\n\nAnd she had big trouble remembering important recent events like in her discussion with the Washington Post reporter whether she actually gave portions ever therapists notes to the report and others in July the whole copy of the therapists notes or read from the therapists no she doesn't remember\nShe can't remember if she had an actual copy the therapists knows when she called the Washington Post or she had gone to her therapist's office and read the ... I Can't remember any of that she won't provide the notes to the committee\nWhere she had gone to her therapist's office and read the notes can't remember any of that\n\nShe won't provide the notes to the committee\n\nShe won't provided to the committee she can't remember the day that she had the polygraph or this is very reason this month six weeks eight weeks ago whether it was on the day her grandmother passed away or not she can't remember if it was video or audio recorded and the committee would like to know they want to see\n[laughter] in fact she was traumatized during the course of the [noise] excuse me lie detector tests did she claims\n[noise] they\nTalk about the psychological impact it had that she doesn't want to fly she was difficulty flying now we know that was a flat out lie\nAnd say that yes a flat out lie\nShe's flown west coast east coast east coast the west coast she's flown to Hawaii French Polynesia Costa Rica all over the world\nBut when she was asked to shop for a hearing she couldn't fly\n\nAlthough it has said that she was already on the east coast [laughter] she didn't know that the Senate Judiciary committee Republicans the majority had offered to go to California to interview her\nIn any form\n[noise] and uh\nWhy didn't you know people say her lawyers must have withheld that information maybe the large didn't withhold the information maybe she just didn't give a forthright answer\nWe know from her ex boyfriend\nThat she never mentioned Kavanaugh's name she never mentioned sexual assault in the six years that they live together and then a few years before that that the day that we know she had no problem with claustrophobia because she had an apartment that was five hundred square feet that's a small apartment\nThat's a very small apartment [noise]\nWe know that she never mentioned Kevin O's name to her boyfriend her live in boyfriend have six years\nSo you have to believe the unbelievable\nTo believe her testimony against Brett Kavanaugh you have to believe the unbelievable you must spend your reasoning and now that I've gone all through that she's not the bubble lady\nShe came forward she said it was or civic duty she's presented herself to the American people and we get the judge said it's not the only body that gets the judge you and I get the judge and we don't have to self censor them to be rude and hateful and all the rest I'm not that and we're not doing that\nNow what a cabin I'll say that was so unbelievable or contradicted absolutely nothing that I'm aware of what that he may have had more drinks one day then another day he's the one who showed up with this calendars\nHe's the one who had witnesses who said he was never there\n\nBut you say the FBI didn't interview him or afford now according to Ford's lawyers who are very upset and of course the Democrats won in the same but that's not the nature of this investigation it's not a criminal investigation\nThey testified in public under penalty of perjury there's nothing else for them to say\nSo why do we continue to play foot see what the Democrats we should play brass knuckles where the Democrats say enough already and Mr flake M Ms Collins of ms Murkowski do you want is wrong with the Democrats go ahead we're having a vote this is over\nWe're not going to participate in any further\nAre not going to participate now and the trashing\nThe FBI I'm not talking about the senior people at the FBI now they're trashing the FBI if there lecturing us for Eighteen months about the FBI\nThat's not the senior officials in the FBI who are doing these interviews these are special agents I have no doubt the hard working men and women and the FBI that the Democrats\nClaimed alike but they hate all law enforcement let's be honest\n\nSo enough said enough we don't need to deal honestly we don't need to deal with people who are\nDiabolical diabolical\nThat includes flake that includes Collins that includes Murkowski who brought us to this point I guarantee you if I were their husbands or flags whites who are being treated this way they wouldn't agree you know what maybe we should extend this for a week\nWhy\nWhat took place this week an endless speculation endless analysis of what\n\nInsanity is you\nPlace this week an endless speculation endless analysis of what\nThe insanity is ubiquitous\nIt's all over the media all over the media I'll get to them later as I always do\nTo actually believe Dr Ford Israeli suspend the ability to use your brain\nAs applies to Brett Kavanaugh\nIf something happened to her and it may well\nNothing to do it Brett Kavanaugh of it right back\nThe office of a senator and you have no common decency year this spend golly in the shadows who've done this whole thing\nYou you are disgusting Schumer you've destroyed the Senate Judiciary committee confirmation process ten times over your the sleaze year this snake you're beneath contempt\nOnto the next four Blumenthal go\n... mocking attack on a credible immensely powerfully eloquent survivors and I notice he keeps\nUsing this word survivor like a Holocaust survivor\n[noise] survivor\n\nI don't know who she is I don't know what took place but it's an interesting word to be applied here that she is\nPer se survivor\nSo a survivor ladies in general you can't question a survivor so why do they want the FBI to investigator\nWhat's that all about that is the questioner go ahead\nIs a market suspect in this regard I find it can be out early the president says\nThis is make or who's course subjective\nI find it to be utterly disgusting stopped talking about your soon to be a husband that way although we all find him to be overly disgusting quite frankly go ahead well yesterday even though he has her own oh nobody ever heard of this woman outside of Hawaii a week or two ago\nNow\nShe can't get on TV enough you understand for a lot of people\nThis is a career making at least as far as the cook left his concern a career making event for the media ratings through the through the wrist watch\nWhy they keep running the same loops saying the same things doing the same story I Know I'm In this business I see what they're doing on TV trust me on this they're not going to walk away from this they they they love it\nYeah I had\nSeen that before and that's\nI didn't think it was me nor disgusting not like the attacks I've seen from the Senate Judiciary committee not like the attacks I saw from Saturday Night live not like the attacks I saw from Jimmy Kimmel and bits\nOr Steve Colbert\nOr the other clowns who aren't even funny on late night TV those attacks attacks I've seen on the media\nAgainst Kavanaugh suggesting he's a pedophile they don't care about the women in his life his wife and his two little girls do they they didn't care about Clarence Thomas his wife did they they didn't care about a ... wife did they\nGo ahead\nI don't think the President's Day locking anyway I just don't think that is they have hair harming others just\nDidn't isn't isn't it ironic that they go to her about the behavior of the president\nIs this is this some kind of a ... I I don't even know what's going on here then Benny card and this lose or go ahead\nWith the little awkward for those who may was outrageous\nI got the labeling cabinet was that outrageous to you\nHow about belittling Sarah Palin does that outrageous to how 'bout belittling any conservative women are Republican women\nOr women who've been molested by by a Kennedy or buy a Clinton is that outrageous to carton because if it is we've never heard from before we've never from you but for you\nJerk go ahead\nWas the lack of respect\nFor us in the United States Supreme court\nThat's that's pressure so the president has a lack of respect for the Supreme Court you see these people are are insane and sickly sickly\nThey can't possibly believe the stuff that ... percent of their mouths go ahead\nThey can't possibly believe the stuff that ... percent of their mouths go ahead\nPlease or credit man's word ...\nOh that's our friends Susan Collins president's comments were just plain wrong hope\nThe president's comments were wrong she doesn't even attacked his tone it's his comments let's hear it again to go\nWhat he's going through [noise] thirty six years ago this uh\nI mean you're right I mean [noise]\nWell do you think it was it was one of them are good [noise]\nHow did you get home I don't remember how did you get there I don't remember where is the place I don't remember how many years ago when I don't\nKnow [noise] I don't know [noise] [noise] what\nWas it and I don't know where's\nNow says where was I don't know but I Wonder if that's the only thing I remember [noise]\nMan visiting Saturn a man's life is shattered his wife is not subject does that matter does it\nMatter that a man's life is in tatters that a man's life has been shattered does that matter did you hear Schumer Blumenthal our ... our Hirono or Norton or Clinton or Carter Collins did they show any sympathy for this other human being who isn't Robin this none\nNone none whatsoever it is today who are disgusting and it is they were outrageous\nWayne need more information now you don't you idiot it's right there in front of your face go ahead\n[noise] beautiful incredible young kids they suddenly it was in college what about\nThose young girls young Kavanaugh girls what about them\nWhat about him nobody\nTalks about them that they have to watch this day in and day out with their father her father who did not do this\nBased on Dr for its own testimony and under our law is an innocent man\nYou have to accept oh but the Democrats are telling you whether they generalize the issue in order to universe allies the contempt where they don't want to see the therapists notes\n\nAnd I could go on and on and on about why the hell should I I'll be right back [noise] much\nHim Washington Mall W. N. A. L. more Washington comes to talk summer's over\nWhat about the bottom could mean the money for you when you were share one thousand dollars and four times each week this\nWeek the nine to five AM and twelve o five ... five and six o five ... a few of the national keyboard attacks it's a nice ... nice you\nOne thousand dollars to see every weekday\nRules that info checkout WMA el ... and ... would have a day from W. M. A. L.\nMid Rodriguez the deed carpet cleaning traffic center it's been a long afternoon and it's going to be a long evenings southbound on two Seventy starting in Gaithersburg and shady grove roads\nWere both you express and local lanes are affected by the accident just below Montrose road where those express a local lanes meat that's causing those big north found a liaison to Seventy right off the belly and all in the seventies for\nAll the way up to middle road map and garage door he appeared on here's the WMA oh weather Channel's forecast\nLike well you tonight low sixties big chance for ... hours tomorrow high eighty eight\nMembers diamonds voters Mrs Romney modus versus the place for large diamonds when it comes to major diamonds up to ten parents in size you'll find them at move with diamond people to move its diamonds are truly beautiful\nHand selected by my brother's it was a world recognized the experts\nWe choose the best diamonds and we'd reject any they don't meet our rigorous standards are diamonds apart is ... ideal proportions\nTo reveal their maximum beauty with diamonds or ... [noise]\nNothing can match the magnificent and nothing can payment\nPrices for it will cost diamonds are hard to be\nWe live up to a legend reputation for incredible value every day\nEvery major diamond whopping pen carrots and find the source of the\nMuch better quality of the most value\nGo to movies Simon dot com\nI Try and would love\nMuch better quality and the most value\nGood movies diamond dot com\nI Would love\nTo move a diamond dot com\nOr eight hundred or love\nI'm Rob witness there over five hundred members of Congress but you know what I Do different\nEvery day I eat my breakfast right here in the first\nIt keeps me focused on what\nRight now eight hundred three nine o nine five to eight that eight hundred three nine o nine five to eight by calling your addiction team you're taking the first steps to recovery their advisors are ready to take your call right now your future is still a bright\nPlace the help you need could be one phone call the weigh eight hundred three nine o nine five to eight\nThat eight hundred three nine o nine five to eight this call is completely confidential and if you have private insurance there could be little to no cost to you even\nIf you already been to a treatment give them a call there was no need to let addiction ruin yours or love one's life take the first steps now at eight hundred three nine o nine five to eight eight hundred three nine o nine five to eight that's eight hundred three nine o nine five to eight\nOh you are they all if it were rich WMA all washing\nDishes [noise]\nThey all news it's Seventy nine more relief authorities say five South Carolina law enforcement officers had been shot in Florence county corresponding ... says the suspect is in custody\nThe Florence county emergency management department we did that the active shooting situation is over local law enforcement officials say three Florence county sheriff's deputies and to city officers were shot no word yet on their condition\nSo it wasn't rights and that was mailed to the Pentagon this week but it was close\nA Pentagon spokeswoman says this suspicious substance found and she landed loves to mount or the Pentagon this week was not the poison rice in itself\nWas caster beans that substance from which rice and as Dr one of the envelopes was mailed to defense secretary Jim Mattis the other to admiral John Richardson the envelopes never made it to the Pentagon and they were flat did a sorting facility on the Pentagon ground corresponded\nLinda Kenyan three Republican senators upset with President Trump for talking about Christine Blasey Ford in Mississippi rally\nAt the White House briefing press secretary Sarah Sanders insisting the president was not mocking Christine Blasey Ford but simply paraphrasing a shorthand version of what happened at the hearing when she couldn't recall a lot of details\nHe was stating facts that were given during Dr Ford's testimony and it's and it has to make a decision based on those facts\nSanders and the White House he's okay if the FBI does not do separate interviews with Ford in ... cents each delivered extensive testimony to the Judiciary Committee a lawyer for forty at least indicated she was not contacted as of Tuesday night ... the White House in\nSpite of a lawsuit that tried to block it the first ever wireless emergency alert system test blasted from cell phones across America\nThree people filed the lawsuit claiming the alert hijacked personal devices without giving users the choice to opt out\nWhile the judge said there are concerns were significant there was not enough to block the test but it tells us read to get a lawyer to help them pursue it the test happened briefly\nThe standard emergency alert system tone in a written message calling it a test no action required it's important to know that the alert was generated from FEMA or not the president and his voice was not used the alert is designed to alert Americans about natural or man made disasters and security dangers Jim rope Los Angeles\nLots of excitement a capital one arena this hour for the cabs home opener and the raising of the Stanley Cup banner [noise]\nReally really tough derby but they've got the good foundation they've got a good coach out other hand to greet him I tend to the leadership of\nAl ... and he has a lot of players love them very well respected show chemistry there so we'll we'll see if the game plan comes together and\nHold on one\nPerson not there tonight at camp sport were Tom Wilson has been suspended for twenty games by the NHL or our blindsided hit to the head of an opponent during a preseason game tonight to baseball second winter go hold wild card game\nNew York Yankees host the Oakland A's and to do or die match up the second year in a row in New York has played in the wild card game and for the second year in a row\nA whole wild card game the New York Yankees hosts the Oakland A's and to do or die match up the second year in a row in New York has played in the wild card game and for the second year in a row they turn to their a St Louis several Reno a record of just one out and gave up three runs in last year's game to the Minnesota Twins again the Yankees would come back to when\nOakland will not use the traditional starting pitcher but we'll instead throw a ball game\nWith Liam Hendricks expected to start the first inning he spent two months in the minors after being cut from the roster in June\nYou could see a lot of homers in this one as the Yankees led the league in ... with two sixty seven while the AIDS finished third with two hundred twenty seven I'm Johnstone us doubled your mail traffic in what their next\nTo end up your Amazon Echo Tahir ... plan we have nine to new okay let's play that one time set ups they elect dot ... gill who was injured they elect them open WMA ours was a fun to be able to talk of\nTension all authors page publishing it was looking for authors have you were in the book and want to get it published page publishing we'll get your book into bookstores and Brazil on line at Amazon apple I do in other outlets\nThey handle all aspects of the publishing process for you printing ... publicity copyright an editing go eat under advisor or one thirty six eighty nine now where you're free authors who should get that seat under advisor or one thirty six eighty nine for your free author somebody should get again eight hundred bonds or one thirty six eighty nine\nAre used to post a job board send me tons of resumes just to find a few people who are right from my job that'll process was not smart man I went to the\nTechnology can read the lower me find the right people\nAnd actively invites them to apply so I get qualified candidates\nSmart for different groups Britain number one by employees in the U.S right now for ... dot com slash free that different groups dot com slash free ... recruiting sway the higher because of the rating of ... I remember when I was a radio show me your carpets cleaned Tibetan you need heartbeat to go to Joe how\nAre you an al ... like in weather here that Rodriguez and the ... center\nThis afternoon it has been all about two Seventy still is in fact we're still almost or crawl southbound in the expression local lanes from shady grove wrote down to the crash so it's only one lane through\nRight where the expression local Ajmi north bound onto Seventy we've got traffic sold out from the way up to about falls rode we still have the left lane blocked with responders to\nNow from garage door repair dot com here's the WMA a weather Channel's forecast\nHighly honey tonight low safety things chancellor shower tomorrow high eighty eight partly cloudy friday hide from the low Seventy Seventy nine right now in more intend to eighty ... eighty four at Reagan National Maria leaf on Washington small liberal you I'm A L\n\nUnderground goes\nSomewhere on deliberate comes to your local number script to\nOnce again I'm Sorry for\nOf\nHello everybody march living here are number eight seven seven three one three eight one one eight seven seven three one\n... one one you know\nVery very sad news to report to the [noise]\nNews Thirteen W. B. T. W. this is in Florence\nSouth Carolina [noise]\nOne suspect is in custody and one officer is deceased\nAfter five law enforcement officers and one other person was shot\nIn Florence South Carolina according to Florence county coroner Kevin von look can one of the officers has died no other details on other victims conditions is available Florence county emergency management official said on Facebook\nThat a suspect is in custody and the active shooting situation is over fish oils are asking people to stay away from the area as there is still an active crime investigation in progress\nAccording to chief deputy Glenn Kirby with the Florence county sheriff's office the suspect surrendered to deputies after talking with a negotiator and has been taken to the hospital for treatment\nKirby also says a twenty year old male inside the home was shot and is still alive that secret to be confirmed that three Japanese and to city of Florence officers had been shot according to a ...\nThat's all we know [noise]\nYou know I'm going to tell you something to thinking about this today [noise] keep bringing these stories that were more divided than ever before\n[noise] keep bringing these stories that were more divided than ever before\nNot clearly were not more divided than we were doing the civil war but we're certainly more divided than we ever before up to the since that time it's my\nTen people will blame this on Donald Trump know\nWho's Brock Obama before Donald Trump\nIt's rock Obama's Democrat Party\nThe radicalism or the left the Olympic ... tactics\nThe choirs I'm Marxist policies\nSpurlock Obama's Democratic Party\nDonald Trump created thousands and thousands of jobs in New York [noise]\nBoth directly and his buildings and indirectly through suppliers\nBut that's not the way communist think\nIt's not the way they think at all [noise]\nSo what Trump supposed to do go to a Fifteen thousand word document\nRespond if one after another after another of course not to the New York times knows he's not going to [noise]\nBut who you're going to believe\nThe Trump family or the New York times [noise]\nI've talked about this many times I had before me an article that appeared\nTo suggest one of many on April Eighteen twenty Thirteen and the Daily Beast [noise]\nBetween Nineteen thirty nine in Nineteen forty five the New York times published more than twenty three thousand front page stories\nOf those eleven thousand five hundred were about World War two\nTwenty six word about the Holocaust [noise]\nSo why did the paper of record\nWhich president Franklin Delano Roosevelt is said to have come through every morning decided to bury the bulk of the Holocaust coverage deep inside the newspaper nestled between the advertisements [noise]\nBut why does media today rely on\nWhy do media today rely on the New York times\nWhen it comes to the greatest active genocide in modern world history\nIn New York Times covered it up\nIn that destroy any credibility any institution has [noise]\nI Know what I'm saying falls on deaf ears I really do throughout the media they don't care\nI'll be right back\nIn Washington Mall W. N. A. L. on more Washington comes to talking leaky\nFaucet ... running toilet lights that don't work or worse yet a heating and ac system that's been ignored for years it's time to take action Hi I'm Chuck teach go to a action home services dot com license in Maryland Virginia and D.C was a one hundred percent satisfaction guarantee\nSeven oh three nine to two Nineteen hundred\nProblem solved\nThere is no shortage of roofing companies in northern Virginia so how do you choose the company that is right for you hey it's Chris plan to him for more than two decades my friend Cairo hospital roofing more\nHas been northern Virginia is most trusted contractor for affordable roofing siding windows and doors ... believes that choosing a contractor comes down to more than just price that's why he holds his team to the industry is highest level of professionalism if this focus on quality and service that result turned homeowners\nConsistently recommending roofing had more to their friends and neighbors now would you call roofing and more mentioned WMA out you get a five hundred dollar credit on a second surface in addition to their current roofing specials\nCalled roofing more at seven three four six seven zero two zero six on line up roofing more IMC dot com that's real figured more IMC dot com\nWhen you were expect more you get more at roofing more\nLarry O'Connor here for my friends had renters warehouse and I'm here to talk about the empty that's top notch tenant people respect your property pay the rent on time and good neighbors to those around them\nTop notch tenets of the key to making renting rock and you find them by partnering with ranchers warehouse once your property is in rent ready condition renters warehouse taps hundreds of Web sites and bats\nAnd you find them by partnering with ranchers warehouse once your property is in rent ready condition renters warehouse taps hundreds of Web sites and bats thousands of potential runners to score you top notch tenants in just a few weeks on average\nThey do the walk through and they do a thorough background and credit checks they assist with least documents inspections and rental licensing everything that builds a solid foundation for a great relationship between you and your renters plus roaming Ninety nine dollars a month renters warehouse manages your property twenty four seven to keep you Andrew renters happy\nThere is no upfront fees no binding contract you can cancel it anytime find top notch tenants for your home by calling to up to six to five forty three Seventy or go to ranchers warehouse dot com right now that's renters warehouse dot com renters warehouse great tenants live here\nMe garage door repair visit garage or a ... dot com Hi Chris plant here and you've probably heard me say that a lot and here's why for over forty years overhead door company of Washington DC has been the gold standard for service and repair\nTheir professional experts truly care about giving you the best experience possible hey nobody wants to garage door to break down but if it does you'll be glad you called the experts so one more time remember when you need garage door repair visit garage door repaired dot\nCom are you worried your identity could be held hostage you should be because ransomware does exactly that this is Tom Kelly studio of my id care making every American safer from the effect of R D theft as a tall order but that's my goal so here's a tip the best thing you can do to help protect yourself from ransom where there's the backup your computer often\nIf you have questions about identity theft and even if you're struggling with fraud today my id care can help\nGet Fifteen Percent off at my id care dot com slash mark my id care dot coms last mark\nAccording to the department of energy the most expensive utility for most Americans is their electricity bill adding to your financial Missouri this allergy season has been one of the wars in years so now is the perfect time to order a new set of age vaccinators from filter by dot com with over six hundred scientists to choose from including custom options\nYou'll find the perfect ... ships free within twenty four hours with filtered by dot com they're made in America\nEvery day just about every single day five point nine at the end and am six thirty thank you\nWashington comes to talk on the cross plan show is an incentive for them to wish that white men be sure to have their genitals to sign a among\nYes facts we deal on facts here [noise]\nAnd the bottom of we support hears liberty and individual lives and all those sorts of things you know [noise]\nDo you want to hear about the renovation of a ... to forge house no you don't just take my word for it there's a great piece as I said it real clear investigations\nAnd of course ah now we're to believe that the FBI failed to do a thorough job [noise]\nAnd uh [noise] we'll see how this goes by the better go so [noise] now as a result of this you've probably been hearing during the day but we have the most recent numbers as a result of this apparently you have had enough\nPay PM which has a fairly liberal site\nThe headline is poll Kavanaugh hearing galvanized Republicans erasing Democrat enthusiasm edge\nThis came out less than three hours ago the highly\nContentious fight over a judge Brett Kavanaugh Supreme Court confirmation hearing has helped galvanize Republican voters to erase say longstanding democratic edge in voting enthusiasm according to a new poll from merits college for NPR and PBS news\nIn the poll eighty two percent of Democrats in eighty percent of Republicans say the upcoming elections are very important that negligible to point difference and voter enthusiasm is down from eight ten point edge Democrats\nOut when Maris poll that question in July and much lower than other polling from earlier this fall\n[noise] the Democrats lead on the generic congressional ballot also ... points in September to six points now slightly below what they'll need to feel confident and winning the house this fall\nThe poll does find that a solid plurality of voters believe Dr Christine Blasey Ford over Kavanaugh that he sexually assaulted her when they were teenagers\nNow there was another poll by the way not in the polls but it's out there so we can discuss it there is another poll after that says that when you tell the same responded\nThat there's not a single witness or core operation or any evidence then the support moves to Kavanaugh\nSame responded that there's not a single witness or corroborate nation or any evidence then the support moves to Kavanaugh you see\n\nThis or just one Paul but it's not the only public survey in recent days that shown a shift toward Republicans since Ford came forward whether accusations Democrats privately have told T PM in recent days that they saw an uptick in GOP interest and intensity and the days leading up to the Kavanaugh hearings\nAnd they tightening in polls in states where the candidates that have wider leaves\nThough some say they've seen some evidence that the hearings themselves [noise] help their side so [noise]\nTotally last week I think this will backfire I Hope it backfires you've seen the ah the ugly underbelly of the left or the right track\nParents live and it goes on I Wonder if he ever through any ice cubes I just wondering if we ever throw ... because\nWe now have standards the media have standards now they don't have standards for themselves of course\nOkay let's see there's some breaking news here I see Mr producer they Capitol Hill police have elected a staffer on Capitol Hill\nWho say arrested ... Democrats staffer on Capitol Hill accused of releasing personal information\nOn Republican lawmakers so we'll be digging into this during the break I Wonder if we'll get the medal of freedom should they democratically elected president United States you know they don't care\nBut we'll get the particulars\nCan you remember this was in the meeting we touched on it that uh they gave out the are the names and addresses but this is just sort of the institutionalized activity that's been taking place alone isn't it chasing down members of Congress and members of the Trump Administration\nAnd now of course McConnell going after McConnell at the airport let's go to\nJeff Florence are you in North Carolina or South Carolina South Carolina and that's what I saw it in the where the story just broke the great W. E. E. B. go ahead\nYeah sir I'm yeah I'm just wanting to call and I'll talk to you more or I've heard a lot of stories bounced around already on Twitter I'm an outlet for them to clear to me and my daughter or actually I was taking her to see be at a local Catholic Church in town and we were right near the intersection\nI'm less than a quarter mile from where it was going down and a lot of cars for going by swat armored vehicles will go on and we could hear the shooting\nIt was it was you know ... lots of shots gunshots and that will get quiet and then you would hear it again well we we were stuck for like ten minutes and then finally someone come by that y'all you just need to get out area\nSo we turned around and went back home but unfortunately five officers\nWere shot or have passed away and\nWho are are touching go they're not sure if they're going to make it so and but I just wanted to clear something up to um the area happening on the nicer neighborhoods in our whole community I'm so\nTired and I don't I don't think I mentioned that one way or another ... no no\nNo I'm not saying that I just read the story line what they're saying it was a ... they're trying to say now that there was a well trained militia shooting out with the police officers here in town and it was not that it all out of his horn declared that up\nBecause well unless a militia or is it can be one person I Believe they have one person I suspect right exactly\nIt was a it was an older gentleman and a one person suspect but you know\nWait a minute I've ever tell me about the suspect because I haven't read that yet\nYeah have you have an older gentleman and apparently they run and gentlemen owns a killer but he's an older killer yeah Hillary Yes sir\nYes sir either killer and I'm a a very ... they weren't very conservative wart hold him and that's one of the shooting broke up\nSounds like you just flip that I don't know I hate it but I you know I just was bringing things on Twitter already people making up stories and they get off Twitter now stay off there are no tell me about it so that's why we try to listen you have that way we can get real store [noise]\nWell thank you you just gave us the real story and I very much appreciate that [noise] for those listening for the first time this evening\nA five five officers were shot\nAnd another individual as I understand that\nOne pronounced dead on this gentleman pointed out the two are critical I\nCan't confirm that you have\nA so there was a slaughter of police officers in Florence South Carolina in Florence South Carolina horrible\nGo to Rick Philadelphia, Pennsylvania great affiliate W\nCarolina Florence South Carolina horrible\nLet's go to Rick Philadelphia, Pennsylvania a great affiliate W. P. H. T. go\nHey mark how you doing I'm Talking much for all that you do\nYou think you will go cushy [noise] um I I'm just sitting here listening about the tax returns about Trump and I'm just getting more and more noise\nYou know I'm I like to do all kinds of them because it is a very smart businessmen and that's what I Want to or country on we're seeing the results of that I didn't want an idiot and there are but one of the things about tax returns about when Hillary\nWas running for Senate or she had all the roads inch of New York\nThey had to buy a property in New York I have been in the mortgage but for a long time and my company nationwide gave him more which\nThey had a problem qualify on the other day they could qualify justifying additional income\nProperty and the back of the house but they are just as a carriage home\nWhat they said there's like ... ... president that requires lifelong protection but the CIA Secret Service rather and that's what they're doing they rented a house out to the secret service to cover their mortgage payment\nFish can be applied and delegated but this was how the Clintons box with a mortgage on the backs of the American people\nMhm I'm not surprised I seem to recall that they were running to the secret service but I never put one on one together or I made friends thank you I appreciate that [noise] is there any place that teaches young adults to seek what his true beautiful\nAnd good to even understand what those things me\nHow about understanding the principle that all men are created equal or why America's the world's freeze nation there is a place where students study these things Hillsdale College and my putting in the work to understand the central truth students graduate ready to lead in any field of they're choosing [noise]\nThat's true it is a great school as an Hillsdale students learn what it means to be a good citizen you can learn this too he'll sell offers a stellar education do to through the free monthly subscription to in prime is and it free online courses like constitution one oh one\nThe fact is every American can learn like Hillsdale student from the same professors most remarkably of all Hillsdale provides a service to our nation without taking a single penny of taxpayer money not one penny\n\nI encourage you to learn how Hillsdale conserve view by going to a website just for you live in Hillsdale dot com that lives in Hillsdale dot com L. E. V. I. N. free Hillsdale dot com now [noise] it's my understanding\nThat life liberty and living will be aired I'd it's normal time ten pm eastern time seven pm Pacific time on this Sunday\nAs you know was pushed to eleven PM\nThis past Sunday\nWhat's remarkable about that is weird over one point three million viewers eleven PM and nice matter of fact we had over one point one million viewers as it was getting close to midnight no nobody\nDoes that but I can tell you I'm not going to do it either so let's hope it sticks to the ten pm timeframe we're going to have a a wonderful show and we're going to be discussing\nThe coverage of the Kavanaugh case the coverage of the Trump presidency that is the media\nA show specifically focused on that for the entire hour we're going to have Mollie Hemingway of the federalist and Joe conscious of the hill newspaper and I'm going to have an extensive discussion about the coverage\nThat is taking place of the U.S Supreme Court nominee as well as the president United States among other things you're not going to want to miss it and you actually can stay awake and watch\nWhat's amazing about this the week before we had the highest viewership of any program for the entire weekend on Fox on CNN on MSNBC Saturday or Sunday\nMorning noon and night and then they moved us last week so we're hoping that uh that will be locked into our time's flooded ten pm we've built it you know when I first came on the network there ten PM\nOr they're running reruns as I recall her again points sexism points sevens and stuff like that and now they're getting I got two million point six point seven that's like six seven hundred thousand\nViewers\nBecause of you mostly because of you and my radio audience\nA hundred thousand feelers\nThat's because of you mostly because of you and my radio audience you're loyal you're interested just smart you want substance test you want to laugh too and that's what we do\nWe don't have the same format the the format acts as I call it leading with a monologue and Fifteen guests and we're standing in one scene where sitting in another way of a panel and another ... that's just cool to\nHave a smart discussion\nSit across from each other\nAnd talk about these matters that matter to you and me that's all and it's been wildly successful\nEven though it's ten pm eastern on Sunday nights been wildly successful that's because of you not me not the guess because of ... I Believe the long form interview is very important", "show_name": "Mark Levin Show", "year": "2018", "city": "Washington", "day": "03"}