{"month": "10", "state": "DC", "station": "WMAL", "content": "Back what ... Hi I'm Mark Livingstone with cornerstone first financial and this rise in appreciation has led to record numbers of people using their homes as ATMs would the elimination of some he locks being tax deductible credit card debt on the rise in interest rate increases looming now is the time to act\nIf you're looking to fix your house up eliminate PM I or take cash out for any reason even if you're working with another company use doses of sounding board to make sure you're getting the best deal for you and your family whether a purchase or refinance and\nAsk about her hometown heroes program we guarantee we'll meet or beat any competitor on this very station or oh pay your mortgage for an entire year\nSome restrictions apply call now at two o two six to five twelve Twenty one that's two to six to five twelve Twenty one or cornerstone first dot com\nDo you what I Would which do you uh Mayo Washington shot one thousand dollar time\nYou'll you have A L\n[noise]\nHurricane Michael hurricane Michael they're down on Georgia is a category ... storm Florida is starting to assess the damage after it made landfall this afternoon at Mexico beach as a strong category for storm storm chaser ... is that handle that city beach\nAirforce base out the Mexico beach down to ... go out a storm surge their costs so much devastation objects I really hope that nobody stayed behind us especially a a federal lawsuit it'd be\nAt least one death has been blamed on the storm with\nThe power out for nearly four hundred thousand homes and businesses in Florida governor Rick Scott noted a request was made for his state\nFunded landfall or course that President Donald Trump issued a major disaster declaration to our federal resources to flow quickly to the impact of communities\nAt an event in Pennsylvania this evening President Trump said the federal government will provide assistance for storm victims in all states effected providing food water and work crews Robert who sat in Trump announced his plans as he send thoughts and prayers to hurricane Michael storm victims this evening at a rally in Erie, Pennsylvania\nEvery one word for today should with local officials and I'll be traveling\nTo Florida a very very shortly so we just want to wish them all the best and [noise]\nGod see God God Bless\nThe Dow dropped by more than eight hundred points today with a correspondent Alison Kodjak reports is one of the worst dive in history\nWhere saying investors are really worried about rising inflation a writing interest rate as we see inflation go up or saying that said take this take this course of raising interest rates\nFederal authorities have charged in New York man poll Rosenfeld with building a two hundred pound bombs that they say he planned to detonate on election day on the national mall in Washington DC\nA male new data to override appears Amanda died after falling off and electric wheelchair doubt um escalator Columbia heights metro station metro officials say the man\nWas seen on camera trying to use the elevator but when it did it immediately show up you will go on to the escalator he made it to the top before somehow losing control and falling backward service station is continuing as normal the investigation is ongoing some students at a local high school are being interviewed by leave for police as part of an investigation into her reported sexual\nAssault investigation began last friday according to police department spokesman Sam she knew that after\nA call that came and concerned about an incident that possibly took place within the school\nSources tell the lab in times of football player with sexually assaulted in the ... or a high school locker room after practice but she says they're not yet classifying the incident as a sexual assault\nIt's too early in the stages of investigation for us to really give a clear concise answer as to what took place\nThe school system set in a statement it can't share details because of federal laws protecting student privacy Heather Curtis ... dot com\nDespite the national no call list the Federal Trade commission got four and a half million complaints last year about robo calls more than doubled the complaints from just a few years ago now Virginia's attorney general is cracking down\nDid it's really annoying the attorney general I'd go to everybody else out there is getting them to\nVirginia attorney general mark herring is calling on the FTC to create new rules to allow your phone service provider to block the legal calls\nAlso create some rules that will allow the private phone companies to work together to oil which would make calls to come in but black or the robocalls including\nSo called neighbors spoofing that allows cause to appear on your phone with your same area code Barbara Britain W. A. L. L. W. N. A. L. dot com\nWMA all news tomato for now W. I. male rabbits\nWhether the carpet cleaning traffic center\nIt or not we're so busy on the ...\nTomato for now ...\nWhether the hunting carpet cleaning traffic center\nBelieve it or not we're still busy on the beltway with a deli and but says on the it'll look from the two Seventy spurred a Mormon temple in Alexandria the ... and the Eisenhower connector over to the Wilson Bridge then again in mere appeal for my sixty six the gallows wrote an a heads up and up between land over and Lana\nTo oh to offer for fifty are going to see 'em start preparing to work soon enough where they've been catching a lot of the pavement fingers surface\nGarage door repair dot com here's the W. M. A. L. weather Channel's forecast\nKillers and senator storms tonight low Seventy three more storms tomorrow high near eighty [noise]\nThe Redskins result to win tickets to a game this season and FedEx feeling from WMA I'm proud Redskins radio network affiliate here is the first clue on this skins player was elected to the trouble to I see the rest of the glue that W. O. L. dot com slash Redskin I guess the correct Redskins player and you'll be entered a win tickets to see their skins\nTake on the cowboys on October twenty first met here every Redskins game right here on one of those ... ... am six thirty\nM. A. L. the choice of a lawyer is an important decision should not be based solely on advertising\nThis that is brought to you by case legal media attention if you were a loved one headed I BC filter implanted in your body to prevent blood clubs to your heart or lung you may be entitled to financial compensation the FDA has issued an advisory that these IPC filters may break conquering veins Oregon's causing serious injuries including heart or lung damage internal bleeding\nEven death even if you're not experience any injury of this time the ivy the filters are considered a ticking time bomb by many\nGold out for free legal consultation at\nEight hundred for eight nine six five seven five there are no fees unless you get a settlement since two thousand five there have been thousands of injuries associated with IPC filters you must protect your legal rights called eight hundred for eight nine six five seven five now to see if you may be eligible to file a claim time restrictions may apply\nGo eight hundred for eight nine six five seven five that's eight hundred for eight nine six five seven five again eight hundred for eight nine six five seven five\nMe your carpets cleaned Tibetan you need a need to go to Joe ... dot com\nMario hunter sitting in for Mars live in today seven seven three one ... one morning as we talk about the fact that four weeks from the Knight for weeks from this moment right now [noise]\nTwenty eight days Marco event will be sitting behind this microphone talking about uh what the next two years with the Democrats in charge of the house and or the Senate might look like\nOr he will talk about the historic victories that the Republican Party enjoyed in retaining power retaining control and majorities in the house and the Senate it's going to go one way or the other\nAnd and so and when we we have to be a part of that\nThere's no way\nWe can sit back and let the mob takeover and then that's why you're seeing the CNN and the Washington Post and Democrats say that you can call them a mob\nWhen you see in taking to the streets in disrupting trafficking stopping your car from going down the street and a a burning things on the campus of a public college because as a conservative is about to give a speech\nOr storming into a private restaurant and screaming until an elected official leaves so that people can at least that's what they mean when they said no justice dumped ... take them at their words\nAnd so now's the time to keep the mob from taking over our government they have not earned the rights to be in charge in fact they have earned the right to go to jail\nAnd I would like to hear from you about what you're going to do to be a part of that about keeping them from office and then there's one other part of this that I Want to discuss with you that I find it very interesting as I Am just mercy myself\nIn election news I by the way by way of introduction on a radio host in Washington D. C.\nBelieve it or not we actually do have a lot of conservatives in the Washington area a lot of Republicans and by the way a lot of a non conservatives even liberal Democrats who listen to my program and enjoy it they listen to talk radio because we give them a chance to actually be a part of the conversation I wouldn't you love to pick up the phone and tell Anderson Cooper why you think he's full of crap\nWhen did you loved to pick up the phone and tell Lester Holt how he just got that story wrong can't do that\nBut I my home station in Washington WMA ah which is a station to mark within appears on he comes on right after me on his warm up act\nFor three to six in the afternoon and then he comes out right after me uh he uh eastern time of course a new people can call in people who disagree I Love being you know mark clubs having people who disagree with him called in and take it\nIm right after ... uh he eastern time of course or do people can call in people who disagree I Love it you know mark clubs having people who disagree with him call in and take issue with something that he said that's what makes talk radio so dynamic there's nowhere else in Washington that you can get that that's why our radio station so popular\nI don't really know what they think they're in gain is other than grabbing control of the Senate\nBe Congress or the house and the White House I get that I Know that what they're after\nBut you can't release the mob you can't release the towns and expect them to just calm down when you get that price ... they're fanning the flames of destruction for the very fabric of this country\nThey don't care about the constitution of ... it's it's sad\nAnd it just drives me crazy I asked Andy\nThis is a brilliant brilliant point and we got to pause on it for a moment 'cause you're absolutely right ... lives in their strategy is powered by any means and and that's why they're only ... you're so right it's not like you can then say okay we won the election everybody calm down here no no no no\nThis is if I can use it off repeated phrase that you see on cable news all the time by these pundits this is the new normal until the Democrats stepped up and say we are willing to lose\nIf it means we stop what we're seeing in the streets right now we are willing to relinquish our position in the government if that means we can come back to a place of civility that's the only thing that will stop it and I don't think they're willing to do that\nPower is too important to them it's a great point it's not like they're going to be able to call off the dogs\nThey're not and and you're right they're not going to do with this horrible and I I had not heard that clip that you played earlier that I'm\nEric Holder colder yeah ... Andy thank you for bringing that up because I got to take a quick break but I wanted to play that uh once again so everyone can hear it this is this is Eric Holder this is the former attorney general under ... he he was the second\nLaw enforcement official the second top law enforcement officials going to the top of law enforcement official technically the prison United States is but he was he was the duly appointed attorney general to carry out law enforcement at the federal level in this country he was campaigning down in Georgia I Believe for the woman who's running for governor there\nAnd here he was ... they're not hiding it from you they're\nTelling you exactly who they are all over you know my wife like really high um which will give me an ra\nIt was filled with says you know when they go low we all know [noise]\nThey go low we [noise]\nWas just reading about that's\nWhat this new Democratic Party is about when they go low we kick them and the sheer and they laugh and they applaud and that's who they are now there's no denying it now at least we have clarity so now some clarity from you what's your response\nWhat are you going to do eight seven seven three one three one one I Am Larry O'Connor and this is the mark I live in show [noise] much\nHim [noise] Washington Mall W. N. A. L. and more Washington comes to talk\nAsk any a Mac member what they like most about belonging to the conservative alternative to A. R. P. and they'll tell you how much they love reading a max magazine a Mac advantage a Mac as pleased to announce that they're now publishing a Mac advantage six times a year\nThat's six issues of a Mac celebrated magazine and it's all part of an a Mac membership get your copy of the latest edition of the a Mac advantage magazine by joining right now a Mac dot U. S. A. M. A. C. dot U. S.\nYou wouldn't put a square peg in a round hole so why would you deploy a traditional firewall in a modern decentralized network\nFire walls have new requirements for businesses leveraging fast paced applications and public client platforms like eight ws Asher and Google Cloud\nWe're in the cloud generation now so you're fire walls have to be engineered to fit right in reclaim your club network trying barracuda ... generation network or application firewall free at barracuda dot com slash fire walls [noise]\n\nGuy\nGod don't gas\nOne seven seven cars ... K A risk ... won the seven seven cars ... donate your car today [noise]\nAnd seven cars to donate your car today [noise]\nBond that is because there\nAre a wreck cars lurking why in a car to donate your card day\nAlso accepting boats motorcycles RVs in real estate donations\nDoctor will Sunday on tennis therapy some green broke PMS near all health centers\nDepression is one of the you know those those that takes over your identity so people wake up every morning you look in the mirror and you see that depression version of you you do that enough times and that becomes you\nAs the most experienced provider in the U.S green broke TANF delivers life changing PMS therapy non drug in office treatment for depression that allows you to go right back to your daily activities\nI look forward to talking to patients who have their treatment because so many of the murder mission so many of them are so happy that you really do get to see people walking out of here feeling completely well\nGreen broken PMS ... in many convenient locations throughout Maryland and Virginia green room welcomes all insurance to see if tennis therapy is right for you ... around loved one visit green broke PMS dot com that's green Brooke PMS dot com\nLarry O'Connor here from my friends have renters warehouse and I'm here to talk about tea and tea that's top notch tenants people respect your property pay the rent on time and good neighbors to those around them\nTop notch tenants of the key to making renting rock and you find them by partnering with ranchers warehouse once your property is in rent ready condition renters warehouse taps hundreds of Web sites and vets thousands of potential runners to score you top notch tenants in just a few weeks on average\nThey do the walk through and they do a thorough background and credit checks they assist with least documents inspections and rental licensing everything that builds a solid foundation for a great relationship between you and your renters plus roaming Ninety nine dollars a month renters warehouse manages your property twenty four seven to keep you Andrew renters happy\nThere is no upfront fees no binding contracts you can cancel it anytime find top notch tenants for your home by calling to uh to six to five forty three Seventy or good or renters warehouse dot com right now that's renters warehouse dot com renters warehouse great tenants live here\nEvery time you go on line your Internet provider an advertising companies can track what you do and sell your personal information so how can you protect yourself computer\nExperts recommend using a VP and the software I use called express VPN Mesa it's super easy for anyone to stay private online these days I don't use the Internet without express VPN express VPN secures and makes anonymous your Internet through data encryption and hiding your IP address\nThe act takes Ninety seconds to set up on your computer or phone you click a button and pulls you are protected\nSo if you want to protect yourself from hackers in spies visit express VPN dot com slash marks to get this special offer three months free whether one year package\nThat's express VPN dot com slash marks for three months free with a one year package don't risk your online data any longer ... express\nBBN dot com slash mark today\n[noise] here's why this is important in a five point I Am an am six thirty mile to give me watching it\nWashington comes to talk tomorrow on the cruise plant show where Hillary Clinton threatens the country you're either for us so there will be no civility WROL\nOn her in for the great one mark Levin seven seven three one three Avon one Markey Columbia South Carolina listening on WB oh see I'm Larry O'Connor it's the Merkel didn't show\nPay market Europe [noise] ...\nWe lost Markey let's go to Matt Brunswick, Georgia and right next door to South Carolina was W. V. I. G. I'm Larry O'Connor ...\nHey there how you doing good what do you say I say that uh this\n... rules by and say oh this is crazy and that's the way our government to Iran and I could never see that happening in my small town\nWas a a a\nBig old pal will drive a truck has gotten to the resort in a bar or be in trouble\nAll the violent rhetoric of the right Matt self defense is a beautiful thing [noise] it's a very one three eighty one\nOh oh the violent rhetoric of the right Matt self defense is a beautiful thing [noise] it's a very one three day one one at a moment I'm gonna tell you about a guy who built the bomb for our town sway\nNow you know what that is\nNow you know this is community organizing\nThis is what comes from eight years of a community organizer\nIn the oval office\nInspiring his people his followers\nTo get in your face [noise]\nDo you want to know what community organizing his community organizing is when they go low we kick some community organizing is there will be no civility unless we were in the house in the Senate\nCommunity organizing is standing in front of somebody's house with a bullhorn screaming at them because you're upset with the job they have 'cause they they they work for a bank or they work for an oil company where there are a lobbyist\nPromoting something other than killing unborn babies the lobbyists who worked for Planned Parenthood oh they're they're wonderful people doing the Lord's work\nBut a lobbyist who wants to make fracking legal so that our economy can dominate the rest of the world and we can be energy independent oh no no no they need to be disrupted that's community organizing community organizing is barge it into a restaurant and screaming until an elected official has to leave\nThat community organizing that's what we're witnessing here\nDon't say that it's snuck up on you don't say that you weren't warned [noise]\nBut I Want to remind you of the words of our president some of his ... honestly some of his greatest words in this soundbite from his rally Saturday Night\nI think that you know I've been to a couple of his rallies I've seen many of his speeches and he goes in ... he goes off prompt er and he's a very entertaining when he does it although it's kind of like being on a rollercoaster ride without the seatbelts your\n... specifically the ones that go upside down and you got to hang on or you're all falling out and landed on your head sometimes it feels like that do very well where's it going with this but I think this this was part of the speech and these may be some of his best lines here's a ... the president Saturday Night\nMagazine is\nNow are doing we left wing ma and that what I [noise]\n\nAnd you said yours are\nPiling you believe in the rule of law\nNot the rule of law\nBoom that's that is the bottom line takeaway from what we saw over the last several weeks this is what has been the awakening\nFor Republican voters who were pretty happy with the house in the Senate in their party's hands with the White House in their hands with all the cutting back regulations of the president's been able to achieve with a tax cut that got through with a booming economy\nWith unemployment at a low of a level that we haven't seen since we put a man on the moon in Nineteen sixty nine most Republicans have been like you know life is pretty good right now I\nGet why did why it's fine you know everything's good do you know I don't need to now after what we've seen\nHow they up ended the rule of law how the up and did the\nBasic western jurisprudence understanding of innocent until proven guilty when we saw that they would stop at nothing even accusing an innocent man of being a serial gang rape is so that they can keep power\nAnd inflicted that power and their agenda on you and then when they even last that they took to the streets marching disrupting\nLike a mob that's been the great awakening now now you know\nYou're on notice twenty seven days the clock is ticking in some places you can vote now make sure you do it\n[noise]\nEight seven seven three one three eight well you can't get in but if someone hangs up you can get and let's go to Tony Vienna Michigan My home state I was born in Michigan Tony you're on the mark within show\nSo much I'm Sorry for white voters but I'll do my bounced for\nOver ... ... on the phone call up to ... ... ... of their own talk show or Fox in order for you know ...\n... that's very kind and they think I Will say well look what it meant to glacier\nPhone coupons for\nThat's very kind of and I think\nI Want it now looks like one would have meant today sir I'm voting for survivors you know what I'm Talking about this I'm not sure I'm not sure you came on a bomb\nIs long ago it was over ... [noise] those loans or [noise] or on\nA vote in the world you know what comes to America\nAnd because [noise] um [noise] he was ... you know ... ... ...\n... ... I don't ... don't come along I don't believe we went along but he didn't really seriously you know he went and\nLooked at Tony I'm Sorry today in your apologized for your voice going in I I'm only making out like every few words I and I don't know if it's the phone connection but I just want to make sure it's pleasant for everyone listening but I Know you wanted to raise the issue of Obama and I and I think you're echoing what I said this is\nThese are the community organizing tactics this is why when his when he won his campaign he didn't dismantle his presidential campaign apparatus you know that right it was Obama for America was the uh was what's his campaign\nOr a organization uh oh by you know every every candidate creates an organization of fundraising organizational structure right when he became president\nHe didn't dismantle\nHis his fundraising capability or any of his outrage or any of the things he just converted Obama for America to a political action committee called organizing for America was still owe SAC he could keep the same logo went from Obama for America to organizing for America it has been a constant\nConstant community organizing effort at the highest level with the greatest budget that any community organizing entity is ever had and it in ... it literally has created an army of protesters who work every day every single day you know the woman\nWho are confronted Jeff Flake in the elevator you already know by now that she's the head of a community organizing a company that's partially funded by George Soros Foundation we already know that we've talked about it from the day it happened\nRight oh it was so organic it was so natural this woman stopped Jeff Flake and the elevator and start yelling at him about her alleged sexual assault a\nThat here's what you may not have seen she's making over a hundred and fifty grand that woman she's making over a hundred and fifty grand\nCommunity organizing doesn't come cheap but there's a whole lot of money in it right now and they keep raising more and more and more and they have\nArmies that are dedicated disrupting our society disrupting our government and disrupting your life and the only way to stop them is to keep them out of power we cannot reward these tactics\nAs soon as you ... what is rewarded we'll be repeated you want to stop to what you're saying in the streets right now you need to stop them on\nElection day ah let's go to\nEllicott City Maryland not listening on my home station WMA yellow dusting\nHi Larry I'm so happy to talk to you I'm I get in that sense I excited I'm excited to [laughter]\nSo um I had an idea that now thinking about how to get more people to like kind of like the common sense okay NBA expose that like the truth and outlets in or rely on the mainstream media\nAnd I decided I'm going to invite a bunch of my friends who are mostly liberal and you know DC area I'm and I'm also a millennials are that [laughter] but oh All right I'm going to invite a bunch of them to listen to different talk radio shows throughout the week and then during the weekend we all get together and debate it\nAnd try to talk it out and see if they gain conservative perspective 'cause I feel like if you're listening to talk radio right now like\nAny kind of have common sense in Ukraine you already know what's going on but it's different for people that kind of just\nI don't know that give yeah CNN and MSNBC and they don't know and it can bike\nThat's cool so do you think there'll be down for it 'cause I I worry about millennials that they're not really open to you know there's sort of in their lane you know and and they just ... like they know what they know when they're not interested\nYeah I I have hope though I've had conversations recently and it was okay and I think\nTalking to people that are made in my age group and a lot of them you agree that this is just like insane and just unfair wow that if we can kind of like get into it more and talk about more issues I mean in common than I Am [laughter] yeah [laughter]\nKnow does to the I I hear your voice I that's how I feel sometimes to thank God I've got a the time that I had with a microphone so I convinced I don't know what it's like for you guys don't ever\nI I hear your voice that I that's how I feel sometimes to thank God I've got a the time that I had with a microphone so I convinced I don't know what it's like for you guys that don't have a radio show does it eat great to hear from you in a tell all your millennial friends a ticket to tune in and just listen I think that's a great idea\nThank you weren't expectations tomorrow morning show mornings on them all you got ... silver springs W when I [noise]\n...\nAnd God gang gang a guy\nLong so I'm Seventy cars into your wrists cars were too long the seven seven cars to donate your car today\nBarn in God\nOur cars and why ban cars to donate your\nAlso accepting boats motorcycles RVs in real estate donations eleven would rich WMA all washing\nYear old are you in a yell at me what station [noise]\nMale news it six sign Maria leaf a heads up tonight if your travels take you along westbound Maryland route thirty junior for made two lanes close tonight due to a large sinkholes that's taken over the roadway\nWe're not really sure what happened yet we're still investigating that with our contractors in Arkansas it could be a pipe was underground at just with all the rain that we've had since spring just finally gave way\nThat's Marilyn state highway the spokesperson Charlie gifts lower the sinkholes located near the ramps the W. parkway only ends are expected to be reopened by midnight ad Rodrigues we'll have more coming up hurricane Michael roared ashore Wednesday as a powerful category for near Mexico beach and corresponding Erica Hill has been surveying the damage\nEntire neighborhoods have been wiped out in this area and Panama City one woman told me it looks like a war zone and she said\nAnd the area where she was outside of a shelter where she was saying there aren't trained downed power lines down there's virtually no cell phone service for many people that means for first responders and well\nThe president spoke about the storm during an event at the White House this afternoon\nPrayers are with those who lost their lives\nAnd their families then our hearts are with the thousands or\nSustain property damage in many cases is Charlie wiped out\nPrior to that speech the president welcome Kanye West's an NFL great Jim Brown does the oval office\nIn a stream of consciousness monologue it mirrors how we're supposed to operate the times Kanye West in the oval office facing the person didn't\nBring jobs in America are\nEntertainment I Do we make everything that China and not America there were cheating on our country\nIs comments running the gamut all the way to an infinite universe than the earth the use of the F word he was wearing a make America great again\nThere was something about when I put his hat off and made me feel like Superman and you made a supermax case for me to make them anytime he wants\nSmart cookie smart he gets ... book often did either one\nTens of millions of maturity beneficiaries an owner of retirees can expect an increase in benefits next year as a place that just hire the government today announcing a boost of two point eight percent which translates to an extra thirty nine dollars a month for the average retired worker\nChecking your money tonight that don't finish the day down five hundred and forty six points the as the five hundred down fifty seven the NASDAQ\nDown Ninety three double your mail trafficking whether next\nAmazon Echo your morning sum of all we have five to ... is the greatest thing ever from one time set ups they elect ... and ... and ... to listen to elect bill open WMA yell is go time deals you'll you'll\nA love hate relationship with your credit card you love the freedom inconvenience the credit card gives you what do you hate the high interest rates and let's face it they're hiding Seventeen Eighteen even twenty percent NPR that's pretty outrageous but with a light streamed credit card consolidation loan rather than throwing your money away on high interest payments you can get\nEighteen even twenty percent NPR that pretty outrageous but with a light streamed credit card consolidation loan\nRather than throwing your money away on high interest payment you can get a much lower ranked as low as five twenty nine percent NPR without paying and today if you want an even lower rate apply it linked green dot com flashback for special discount plan with a light green your weight is that rates continue to ride your rates won't\nBudge they'll stay low you can get a loan from five thousand to a hundred thousand dollars which means you can pay off your credit card and start paying an interest rate you can really live thanks to like train\nReady to start saving a plane now at light green dot com slash bat that's right get your expert is down by applying today life's dream dot com slash and burn that light string dot com slash best\nSubject credit approval rating was there were ... percent discount terms and conditions applied officers took it to change with I've noticed is electric dot com forward slash best for more information\nMichigan business friendly environment the ranks among the best ...\nAre you and get up to seven dollars self select Eli de these high efficiency bulbs left at least Fifteen times longer than traditional incandescent lighting get instant discounts that participating retailers near you details at SMU code dot co-op slash LAPD\nFemale trafficking weather here that Rodriguez ... traffic center at his\nWord sponsored by smack oh in Hanover still only one right lane getting by that sinkhole on west bound route thirty two between the VW parkway in Dorsey run road I was going to give you a recommendation highway one hundred\nBut it's ... boulevard I Ninety five so you might want to consider one Seventy five andme airfield was found sixty six with another long delay from the belt way all the way to the Bull Run rest area east bound for route seven's sycamore tree now from garage stories about Tom here's the WMA weather Channel's forecast\nRain tonight low fifty seven sunny tomorrow high sixty four shower some showers on Saturday Heinz fifty eight sixty nine right now in Gainesville Seventy seven in Silver Spring Seventy eight at Reagan National ... beef on Washington Mall don't do a male\nThe national keyboard free to nine five eat one nine nine five eight or nine text F. R. E. E. nine\nFive eight nine ... them from your rent free and messaging rates may apply for ... and a\n[noise] no drove around the house or\nOnce again made some time for the\nOf\nA show Ben Bergen send filling in for the great one tonight always an honor to be sitting in his chair speaking with you for the next several hours as mark away back within the next week um\nI have a warning tonight if you are African American whatever you do do not become a Republican\nBecause if you do the Democratic party is going to try to check you into a mental hospital they are going to say that you were an educated they're going to say that you clearly are not well mentally\nThe same people that say that we don't need a shame people and we don't need to bully people the same Democratic Party that says we don't need a shame people and we need to let people be open about mental illness and we need to bring it out and not make it something that people should be embarrassed about are the same exact people today\nThat are shaming African American man because\nHe didn't do what they told them to do\nI'm going to bring up an analogy here and I know people are gonna get mad at me for doing it so before you freak out and start tweeting at me or sending the evil messages on Facebook [noise] listen to what I actually have to say through the end of this comment before you lose your mind and I mainly talking to a liberals that are listening because we know they're listening\n[noise]\nDemocrats are upset\n\nThat a black man\nBy the name of Kanye West as not supporting the people that they told him\nTo support think about that\nAnd when he supported the president they first said he was an Uncle Tom\nThey said we would we would we would shame him health shame him and just saying that he's mentally on well clearly this is the person that mentally on well then they said the president's taking advantage of uh\nHealth shame him and just saying that he's mentally on well clearly this is the person that's mentally on well then they said the president's taken advantage of a mentally on well man\nThen you had people on TV who are African American\nWho went on TV and said this about Kanye\nWest is what happens when they grow don't read [noise]\nYou've heard that right I'm going to play it again this is what African Americans who are Democrats set on national\nYear just can't get by the single we got one right lane getting by and it's sort of crawl between the Baltimore Washington parkway in Dorsey Ron wrote\nOne Seventy five the best work around for the time being so very slow north found on the GW parkway and McLean from the CIA to the beltway in both as a what a long delay north bound onto something ... from the belt way all the way to ... dropped\nNow from garage door repair dot com here's a WMA yell weather Channel's forecast\nRain tonight low fifty seven Tony tomorrow sixty four\nYou can't change the whole world but you can be part of the change in the world for a child living in poverty by becoming a compassion international trial sponsor you can choose a child to sponsor now with compassion dot com slash radio that compassion dot com slash radio [noise]\nIs the nation's largest geek feed network\nBeyond that is the complete reliability of ... out to eat\nThat means whether you're downloading files\nWiping paint car is\nBy email and your ...\nYour business the line even if the power goes out and\nA business owner you mean the reliability limited time make the switch to contact me get an amazing deal on fast reliable Internet\nOne more way he can take your big beyond started with one hundred fifty magazine Internet eighty nine Ninety five per month when you add ... out the fact that the one place science entered dollars taping per year one eight hundred five oh one six thousand stays on passing\nOn fast offering ten twelve Eighteen hours for a while you were\nClearly termination be applied to come in Texas in these extra subject to change connection pro backup limited up to six hours [noise] my name\nIs Khan wrenching I Do imaging from addicts and cyber security and I tell everybody on the University of Maryland University College graduate\nProfessors at U. of M. UC are very knowledgeable they work in the industry because I got a degree from you I'm using I got promotions that helped me move up in the world can earn more\nBurn your degree on line for ... sake university designated by the end of ... center of academic excellence information assurance\nUnlock your potential at University of Maryland University College made for you\nNext undergraduate that some stark ... twenty second\nOur advisors can help you to them at the right plan for you to earn him in demand degree from a risk factor university ... started today they could do and the dot edu flash radio dot edu last rate yeah certified to operate in fucking if I\nWant a five point not F ... am six thirty Washington Mall W. N. A. L.\nDid you ever look at the stains and your coffee cup and didn't realize that's exactly what happens to your teeth\nPower swamps is the five minutes solution to get your teeth white without visiting the dentist\nThis is John Green up the c._e._o. of Paris swabs in your teeth are staying from coffee tea or smoking all it takes is five minutes with power swabs in\nFive minutes you'll see an average of to shape wider tea and in Seventy six shapes its clinically proven to white natural teeth as well as caps Anthony years the secret is it to the church and that was developed by Dr Martin ... that live stains off of your teeth best of all there is no matter if you strip search trees that you have to leave in\nYour mail for an hour just rub your teeth for five minutes and you're done to try parents rubs risk free call one eight hundred\nSix seven eight nine ... nine six night that's one eight hundred six seven eight nine ... nine six night\nI guarantee you're white wide smile will have your friends talking about how great you look try which free today one eight\nHundred six seven eight nine ... nine six night that's one eight hundred six seven nine o nine six nine\nWorking downtown are heading out to an event download the spot hero at simply type in your destination compare prices in reserve your parking spot used from a ... fast on the spot here a while to say ten dollars off your first far that's ... fat hero mark smarter\nIn the morning on the mall diner ... joined us live an exit patient in Silver Spring friday morning five to nine on several un I I'm\nWeb major the bread than the United states of America in the oval office he says things that could really make\nSense like we have to start cheating our country by outsourcing jobs to China and laugh goes in\nHe says things that really makes sense like we have to stop cheating our country by outsourcing jobs to China\nAnd they'll laugh goes in full attack mode they've been attacking him for days because this is what a black man leaving the Democratic plantation looks like you say something about China that makes sense about outsourcing our jobs and just remember the black Democrats will say this about you how it was what happens when they grow don't read\nThere it is [noise]\nThat's what happens out when I when Kanye West's was ripping on George Bush after Hurricane Katrina this guy was brilliant\nSo revolutionary mind of the black community this guy was unbelievable he was he was the love of the Democrats like because he was a powerful black man with a lot of talent who was challenging a white president United States of America who clearly doesn't like black people\nBut now oh\nNow you're just a black dude didn't read\nKanye West's\nMet with Trump in the oval office he also talked about his childhood and when he was growing up now again this is the ... there's the new line is the president is taking advantage of a mentally ill black man\nAnd exporting that black man as a token black man of his racist White House that's a new line that we've seen come out in the last half hour\nKanye West as a black man that can't thing for himself\nAnd and clearly the only reason why I'm saying for himself was because he has a mental issue and so then the ... the United states of America is abusing this black man and I guess the Democrats saying we need to bring you back to the plantation to the mental hospital right that's what we got to do\nThat helps you\nYou know I I Love and he says that he goes he's talking about is Maggie had his make America great again how he says my own friends tried to bully me people to come after me they attacked me they threatened me\nAnd in a way it gives me power to where the ... of course now that definitely means that he is a negro that they they can't read or doesn't read I guess since it 'cause it's even more insulting if you say the negro that doesn't ring it was what happened when negroes don't read there it is yes yes that's what it is\nHe talks about that how he explains that he likes wearing the make America great again hats he understands that America should be something we should be proud of that we should stand up for that African American job unemployment rates all the time what was or a good thing that was the last administration was doing was clearly not working\nBut Donald Trump now what a what a terrible person he is exporting this man he is exporting him he is exporting him and he's using him and he's a terrible person here it's a disgrace what they're doing\nOne eight seven seven\nThree eight one thirty eight eleven bin ... filling in for the great when mark Levin a let me go to Scott thanks for wedding you are on the mark of in show hello\nHow are you doing buddy doing well sir or you know it it's a shame because all over the TV today and I'm In Staten Island New York which is you know it's it's I Would say it's probably about Ninety percent in Trump world right here in Staten Island\nOf like the rest of New York is terrible but I'm watching TV and every place it literally this kit\nUh things on it a lot on his medicine oh it's horrible he's going against the African Americans um he can't get a break uh it's just it's despicable what to do with the guy now because he's a Trump fan and it's it's horrible but these people [noise]\nIt misses this is the public shaming and the assault which is exactly what he's explain what explains so well\nI mean you you look at the last week you bet to celebrities that have gotten into politics right you had you had Taylor Swift to comes out for a Democrat and says she's terrified of Congress woman running for Senate in Tennessee Marsha Blackburn and it terrifies her what would she what she would do\nIf she got elected to the U.S Senate\nAnd Democrats came out and said this is a brave\nIndependent woman they threw down the woman card right this is what does that brave independent woman she's brave she's a role model every woman should should have should look at her and teach your children\nAnd your little ... daughters and your and your grandkids to be like Taylor Swift because this is what a strong brave role model of a woman looks like then west comes out for Donald Trump and now he's a token negro that doesn't read he's mentally ill he's an Uncle Tom\nTerrible and and and the things that these guys they say about him it's it's really really bad I mean it's on believable lakes like they want to put in that they want to institutionalize the guy now right no they they want a kitten\nIt's really really I mean it's on it's like they want to put and they want to institutionalize the guy now right\nNo they they want to kidnap him and they want to bring it back to the to the plantation of the Democratic party and then lock him up in solitary confinement and their mental ward so they can control the black man because right now they can't control I mean when they can't control a black man who's who's speaking truth to the world [noise] they'll tell you do undermine\nYou and say\nYou're mentally and saying God Bless you good to talk to you my friend ... filling in for mark or van more coming up we'll be right back\nWhen they're banging on the doors the Supreme Court after they don't get their way while they say they want to impeach the president nine states America if you vote for them and they're ready to impeach\nBrett Kavanaugh from the Supreme Court if you get them ... control of the house for the Senate\nThat's what they're saying and don't forget\nNow Taylor Swift the beautiful white woman is a role model and a brave woman because she came out and supported Democrats Kanye West comes out for Trump and he's a token negroes mentally ill Uncle Tom\nWho clearly is being used by the president United States of America\nBut only let you look at and people in Oregon and everything they've done to all the the peaceful Republican rallies there too\nThere were directing traffic this last week is screaming at why people take their orders you saw that on TV\nIt's nuts and and my question to the American people is at what point are we going to say enough is enough let's stop this must be done and let's wipe the slate clean\nWell ... I'm waiting for the the the Democrats to say that socialist Alexander Cortez um\nWho claimed the electoral college as an institution that has its roots in slavery\nAnd by the way the Democratic party has its roots in slavery so\nI'm just curious are we going to eliminate the Democratic party as well because the Democratic party has its roots in slavery but this is a woman that literally claims electro college is an institution that we should abolished because I had the truth in slavery just like the party that she's a part of and this is also a woman who came out and said\nThat she is going to be integrated\n[laughter] I'm\nWaiting for a Democrat to say this is what happens when you don't read the constitution when you don't understand how the country weren't so when you don't understand how the world works this is what you were quite\n... thank you sir nice to talk to you appreciate the phone call one eight seven seven three eight one thirty eight eleven let me go to Tony you're on the ... show a calling in from Caroline nice to have you with us\nAs I say I said have been ... I've met them articles and show it's a it's a habit of mine who's my own job sorry about that go ahead\nI ride service and that kind of\nTravel because you got to have to drink like\n... ... each other time\nTravel I think\nI Want to me what kind of wrestling [noise]\nChange it that low grade and he spoke\nAbout we have to talk of the founding fathers had in line what the declaration\nOf wanting to fly to ally with the conscious which would be God they don't care what the people that's the way they got into that case going by killing so a\nLot of chicken which would be um\nWhatever that means or that the\nSkate free all the group like the Democrats tend to laugh at the same time he had a [noise]\nWell it was real it was wrong it was unscripted and and and now we're we're the Democrats probably way last week saying that NBC a and inside why the terrible thing by putting a mentally unfit man on their TV show exporting his popularity\nOr yeah there were there were nowhere to be found were the last week nowhere to be found\nMe last week was the week that they should have been out there saying how dare you take advantage of ... NBC Saturday Night live how dare you put him on stage and his mental state 'cause that's what they're saying today I didn't see anybody at NBC\nTanya NBC Saturday Night live how dare you put him on stage and his mental state 'cause that's what\nThey're saying today I didn't see anybody at NBC News saying this is what happens when when when a negro that in the rain we take them on Saturday Night live Saturday Night live I tell you that's what happens\nYou know you you this is this is what you need to understand this is your own educated ignorance pool\nWas what happened when they grow don't read there it is\n\nYou just don't read you don't agree with us we will try to destroy your life and say you need to be in a mental hospital ed you're on the mark Levin show Ben ... and I go ahead\n[noise] hey ban uh this is ed from Minnesota just up to the city's listen as an African American I'm really really just disgusted by what the Democrats did but\nI shouldn't be surprised because this has to play book [noise] see I like Tania used to be you know democratic a party believer until I fell off the Democratic plantation just probably three years ago\nHe said well you don't think in the black community like they want us to think when Tom were sellout\nOr whatever they want to call us we don't think we can't read\nBut I can read and I understand I understand exactly what's going on what's going on here is when we don't do what they say they will do whatever they can to be a little less to destroy us to try to to to make whatever it is that we have to say\nAnd and make it small I support the president I like what he's doing I liked the fact that the African American unemployment is low once it's ever been pretty much I like the fact that\nWe have jobs in our community the nation is driving\nAnd I don't like what the Democrats are so\n[noise] [noise]\nWell I look at the Democrats so I'm like what are they selling and and I did it I didn't talk about this the other day\nUm with some college kids and I said All right what is it the Democratic party can run on this time\n... they they they can't run on the economy being bad right 'cause they're using the party of doom and gloom they can't run on health care\nThey can't run on unemployment they can't run on on race or an African Americans being left behind or Hispanics being left behind so they have to make it personal\nAnd the way you make it personal is anyone that you don't like you turn them into a racist for a gang rape is Brett Kavanaugh\nYou you turn them into a mental a ... a mentally insane person Kanye West you'd you'd turn Donald Trump into some sort of unhinged individual that out of control and can't be trusted with nuclear codes or the economy but you can't say economy anymore because the economy is killing it\nAnd so what you do is the only thing you can run on this time it because you can't fear among right it's hard to fear mongering country and just saying you\nMust smoke for us because we're going to make the economy better that doesn't work the economy's killing it right now and everybody knows that you can't you so so the only thing you do is you have to undermine the legitimacy of the person\nYou have to undermine the legitimacy of Marsha Blackburn intent and Tennessee by the way the Taylor Swift it you know she terrifies me I cannot imagine thought\nA it scares me and makes me want to get in a fetal position because she couldn't attack or on the issue so you have to attack or on the I'm I'm afraid of view you attack the president the same way you say that well the president's really not in charge of this country the Russians and they concluded together and we're going to sell that until we can't sell anymore anymore and this man needs to be at peace\nAnd then you do the same thing with Kanye and then you don't like the fact that Brett Kavanaugh's when the Supreme Court so you scream and yell and you'd throw things at center at home than you surround them at dinner and you and you look like an angry mob and then you say it's ... it's it's unfair to call this a mob that we are not an angry mob that you are an angry mob and you are\nA scary person and I should be afraid of you and everybody else should be afraid of you know that's what they're running on their running on personal attacks and emotion because there's not a single issue\nAt the Democratic party can run on right now that they can win on you I mean the main core issues you can't tell us we're in an unjust war and innocent people are dying and we need to come home because we're not in a big war right\nRight right have had that for ... for years that they ran on you know you want to get to that you want to stop spending all this tax money Iraq Afghanistan you want to give kids a good education and you want to stop spending money on defense and stopped seeing these poor boys over to be killed and these women to be killed and since wars you don't have that\nThis time right you're totally right\n... the playbook kids make it personal undermined the individual turn the individual into a scary scary person Brett Kavanaugh's around here is like\nWhat do you like questioning you interrupt him what\nMind the individual turn the individual into a scary scary person Brett Kavanaugh's rail here's my question\nTo you this is my question you started to interrupt you regret what we did with conservatives and especially African Americans in your opinion to try to stem the tide track I\nWell it wasn't him a crash Democrats I Do believe would have taken control of the Senate if it wasn't for them over playing their hand with Brett Kavanaugh\nAnd I think Democrats are angry they're inspired they're furious and they realize that another four years of Donald Trump being president\nCould destroy the Democratic party is we know it because if you have an economy that's doing this well and it keeps doing well and you have trade agreements are being changed and you have American Jobs coming back and you have well when in point numbers it's extremely hard to beat that person\nCalled term providers speak with big Lou with eight hundred five nine owes Seventy five sixteen big we will find it turned my policy for you even if you have type ... diabetes are overweight or have high blood pressure to providers help thousands of people like you think they can afford term life insurance\nTo buy a million dollars of affordable term life for you all you need to do is called big Lu at eight hundred five nine owes Seventy five sixteen ... will make sure the scales are tipped in your favor\nGoal eight hundred and five nine Seventy five sixteen big Lu we'll answer your goal and worked if if you went to a term life policy that you can afford remember big lose IQ he's on meds to goal eight hundred five nine oh Seventy five sixteen eight hundred five nine oh Seventy five six team\nDo you feel if it would which do you uh Mayo Washington\nUn accumulate [noise]\nAnd they all knew it then and only relief showers in thunderstorms are continuing in our area this hour as his National Weather service forecast or a Martin\nWe expect them to last through the evening and then taper off around midnight or maybe shortly after the heaviest rains will probably be a little bit before midnight\nThere is a flash flood warning right now and in fact for Prince William spot Slovenia and Stanford counties until one AM we'll check the complete WMA a weather channel forecast coming up on a couple of minutes\nMaryland state highway cruise today have been trying busy trying to repair a large sinkhole long West I'm Marilyn thirty two near the ramps the Baltimore Washington park weight as a state highway spoke to a ... at\nThis time I Do believe they had it pretty much stabilize that that way they can get cameras down there and find out what's going on down there whether it's the soil issue or whether it is a pipe or something and then we can proceed with a fair\nWeather permitting the crews are hoping to make that the repairs the sinkhole throughout the evening at Rodriguez we'll have more on that coming up and a couple of minutes\nSaturday Night live to prove on the liberals are promoting if he don't\nA veto threat why why why\nThree and power\nThat is Tony west he met at the White House with President Trump today and in a nearly ten minute long speech in the oval office west talked about prison reform liberals trade policy among other things\nWe our job to America\nEntertainment I did when we make everything that China and not an America that were cheating on our country president\nTrump's ... is a longtime friend the to also had lunch together the remnants of hurricane Michael continue to push through the Carolinas and Virginia the storm has left at least six people dead and North Carolina governor Roy Cooper is reminding residents to stay home and safe\nI Know that or Carolinians have been through a tough to get through this\nThere tomorrow with the skies clear the winds die there\nWe can get back the job rebuilding and recovery\nIn our state a spokesman for the Maryland department of natural resources says she was demoted for criticizing gubernatorial candidate Ben Jealous on Facebook and now she's suing\nIn the post candy Thompson called jealous derogatory name because he didn't let a local newspaper reporter into his debate with Republican governor Larry Hogan that's according to court documents they also say she used her personal Facebook accounts to respond to a post on her friend's Facebook page in September\nThe capital Gazette reports Thompson suing the agency saying her demotion violated her First Amendment rights at an agency spokesperson tells WMA al Thompson wasn't demoted he says she submitted her resignation in July and was scheduled to lead the department next month\nHeather Curtis ... stock\nPrices continue to fall on Wall street for a second day in a row\nThe Dow Jones industrial average was down almost five hundred and forty six points as oppose the bill a lawsuit point one three percent now seem to thirty socks that make up the Dow the more than five percent of their value in just two days after the five hundred how to fix down day in a row their skin\nNow see in the thirties socks that make up the Dow lose more than five percent of their value in just two days after the five hundred how to fix down\nDay in a row there's concern about rising interest rates lower down booming sectors of the economy because of the higher cost of doing business correspondent\nSteve cancer bound the down today finished the day down five hundred and forty six points the S. and P. five hundred down fifty seven the NASDAQ down Ninety three double your mail trafficking whether an ax\nYou can listen to WMA yell at home at work or anywhere in the world on your Amazon Echo device for one time that they all look at the end they will WMA all skill once that whenever you want to listen simply say like a play WMA out\nMore details that W. M. I. L. dot com\nResults may vary notice solicitation for legal services soup you owe the IRS back taxes payroll taxes have not found your returns the IRS will get you they can pick your property take you to court even put you in jail with one called to wall you'll never need to talk to the IRS again our average\nClients settles for about ten percent of what his old we offer free face to face consultations in your local area called eight hundred Seventy seven zero for three three that's eight hundred seven to seven zero for three three [noise]\nWhenever it rains it's hard not to think about the folks right here in our community who have no roof over their heads wouldn't it be nice to give them a dry place to sleep tonight or warm cup of soup or just simply an umbrella well you can by giving to the salvation army where every donations\nFights for good visit Salvation Army ... listen and give up on now to help fund programs that provide shelter food and hope to our neighbors most to me that celebration army dog loose and and do dot org [noise]\nGetting instant cash offer on your home go they carry shell dot com\nBubble Janelle ... like in weather here that Rodriguez when the G carpet cleaning traffic center\nAs well as Murray has been caving is updated it's been a rough my westbound on route thirty two and hand over and it looks like it's going to be into the light only won the right lane getting by that sinkhole\nWestbound on thirty two between the Baltimore Washington park we endorse Iran wrote equally slow westbound on highway one hundred was there a traffic jam from around the mills boulevard nine Ninety five [noise]\nMight want to consider one Seventy five even though a lot of spots it's only two lane big delays southbound on nine Ninety five a new engine from the Fairfax County where I go to the ... down to Fredericksburg now from garage\nDoor regret on Tom but WMA of weather Channel's forecast\nFlash flood warning is in effect right now for prince William's ... county on one hand and just issued a flood warning now for the city of Alexandria in Fairfax that until twelve forty five the rain will beginning late tonight then turning partly cloudy after that we'll fifty seven\nSunny tomorrow high sixty four Seventy six of Reagan National line Maria leaf on Washington Mall several people now\nKnow underground bowels\nOnce again based on drugs or the\nOf man\nToday goes\nTo the oval office\nThan refers to himself as the amount of her [noise] and after losing their\nMind over that tonight and I'm about to blow up their fake outrage welcome ... filling in for the great when Michael Bennett night it's always an honor to fill in for mark he'll be back with you next week so Valerie Jarrett just tweeted out\nQuote imagine if Iraq Obama invited someone in the oval office to set him up\n[laughter]\nUm he did Valerie when you worked for the White House he did it was called the vice president of the United states of America vice president Joe Biden said the president Brock Obama when they were grandstanding over signing of Obamacare\nTo a national TV audience on the biggest said you're going to have the White House is a big F ing deal and should the president's hand and and slapped him on the back\nSo spare me the fake outrage right Kanye West\nSaying enough in the White House and and just for the poor side note here ... do you have any idea how many how many African Americans endorsed Brock Obama that use the N word on a regular basis who use in math and their movies in math\nIn their lyrics to their music\nTalked about popping caps and then the pigs you guys are the party that supports it endorses Colin Kaepernick who wears socks depicting police\nHats in the in the pigs you guys are the party that supports it endorses Colin Kaepernick who wears socks depicting police officers as pigs you're the party at the door says black lives matter when they're walking around chanting F the police\n\nAnd now all of a sudden you're out there going imagine it Brock Obama invited some of the oval office who said enough\n\nVice president of the United states of America looked at the ... the United states of America\nThen said to the ... the United states of America this is a big F ing deal when they signed Obamacare I didn't see any of you said anything then\nYou you will get the antifa protesters this week that were directing traffic and yelling at white people is that not a mob mentality is the Democratic party not endorsing teeth but they do the Democratic party not endorse black lives matter saying F the police and what do we want that cops and when do we want them now and that's a mob mentality\nEverybody knows that it's a mob mentality then I appreciate the phone call ... thank you one eight seven seven three eight one thirty eight eleven one eight seven seven three eight one thirty eight eleven Ben Ferguson filling in for Marco then we'll be right back [noise] much\nWashington Mall W. M. A. L. more Washington comes to talk\nHere's the truth about most Tom security companies they're like dealing with another bad cable company you spend hours waiting around for technicians hours on the phone to get questions answered and then when you're at your limit you remember you know I'm locked in twenty three year contract if you're looking to protect your home and family\nGoal was simply safe home security simply save his real comprehensive protection beautifully designed to look good in your home simply safe as backups\nIn place to keep you safe protecting your home even if you lose power or Internet where if someone attacks\nThe system and best of all he got twenty four seven monitoring what police and fire dispatch for jazz Fifteen dollars a month and unlike other home security companies simply say has no long term contracts it is the best around the clock protection you can find get ten percent off simply said today at simply safe mark dot\nCom and you'll also get free shipping and free returns that simply safe mark dot com for ten percent off your simply say home security system simply safe mark dot com\nMature for hepatitis C\nBreakthroughs in HIV treatment multiple sclerosis and diabetes\nMillions of lives saved and approved by science\nIs still science is often not a straight line to success\nTraveled by a hundred and forty thousand researchers America's by pharmaceutical companies\nTwists and turns the tri men's and women's souls\nHere's frustration entity are dead ends\nSupple success can follow\nCan ears to brave patients thousands here in D.C enrolled in clinical trials to help find new breakthroughs one in which might save their life\nAnd perhaps one day you are\nWelcome to the future of medicine for all of this all work together we go bowling message from America's by a pharmaceutical company\nDoes it go boldly down all day it's\nLarry O'Connor and believe it or not Thanksgiving at my holidays will be here in the blink of an eye I Can't believe it's true though so is your home ready for entertaining your family and friends or your carpets looking or smelling\nTo be embarrassed by dirty carpets just called zero ... they'll have your carpets looking smelling and feeling\nBrand new again they've done it for me and I got to tell you is there were ... clean is the\nBest whether it's your home or your office is zero will have your old dirty carpets looking new again don't spend all that money replacing your carpets when all you need is a zero reds clean stains and orders from the kids or pets will be gone forever allergens in mold will be removed you can breathe easier again don't have\nCarpets that's no problem as there were ... clean can also work wonders on hardwood floors tile and grout cold zeroes right now ask for the W on a special get three rooms of carpets cleaned for just a hundred and forty seven dollars plus a hallway clean for free\nMinimum supply called seven oh three three eight to twelve Twenty one Seventy three three eight to twelve Twenty one or online at zero ... D. C. dot com spell it forwards or backwards if Hussein zero are easy\nIf you're looking to sell your home and the metro DC area then called Debbie ... associates of long in foster Debbie and her team have been doing real estate for Thirty years and then help people just like you sell and by over seven thousand homes there the number one team and long and foster\nFor good reason Debbie dual role is changing the way real estate is sold whether you're wanting maximum value or maximum convenient Debby has you covered they're friendly and ...\nDebbie do rule is changing the way real estate is sold whether you're wanting maximum value or maximum convenient Debby has you covered they're friendly and professional team gets you more money period new gimmicks necessary it's as easy as three two one sold three contact Debbie to get in on site evaluation and\nOne in twenty four hours have an offer on your home and just suggested list price gold Debbie's team that's five seven one two hundred five three to one that's five seven one two hundred five three to one or visit three two one home sold dot com and he is\nSo I've had\nMy share of mechanics calling me saying well they found something wrong that needs replacing when I've taken my car in for an oil change those surprise high repair bills are terrible especially when you're not covered by manufacturers warranty and you're paying out of your own pocket to fix them that's why I recommend extended vehicle protection from car shield if your car\nHas five thousand to one hundred and fifty thousand miles\nCar she'll can save you from paying for high repair bills replacing your engine or even a simple sensor can cost thousands when you're protected by car she up you can have your favorite mechanical\nDealership fix your car it's your choice car she also provides twenty four seven roadside assistance and a rental car while yours is being fixed for free get covered by the ultimate and extended vehicle protection ... eight hundred cars sixty one hundred and mentioned code live in\nEr visits car she'll dot com and use ... to say ten percent\nThat car shield dot com or eight hundred cars sixty one hundred used code L. E. V. I. and just say ten percent\nDeductible may apply [noise] there's a lot of time calling for the\nCall someone else I'd point nine out than I Am ... pretty well Washington\nOr Washington comes to talk tomorrow the\nGross pointe show there will be no\nMatter what you are down there will kick you that was just reading or any of them are on the show\n[noise]\nDo you want to make it liberal become on hands and I\nTell them they support a mob mentality of violent [noise]\nTen anger\nThey'll tell you you're in saying\nThey don't like it when you use the word\nMop to describe them well I don't like it we endorsed groups that advocate for saying F the police or you know chant pigs interbank blanket pigs in a blanket fry bacon\nAs black lives matter did while police were escorting them over a bridge Minneapolis St Paul I don't like it when they chant what are we went dead kept Twenty one of them now but you know people say it's unfair to say the Democrats are acting like mobsters mob mentality [noise]\nAll right you tell me if Maxine Waters of this sounds like mob mentality and\nMe to do that because you are doing now is la la\nDo we need to hear that I'm not even\nYou don't want us to say\nA mob at all does it [noise] you don't want to\nThat he had done and on\nAnd on the other\nOne about the fact that they do I do you need\nGod he's not the one thing about it but he can I've been on the run another dictator Kim Jong\nWe're doing\nThat very fact that all of God's you have\nAll of them and\nA chance\nTo tell you what would be along with the president that\nMuch for coming out here\nMight be coming out here it's really not going to be\nTo straighten\nThey can\nWayne kicked him out and\nThen we stepped on him [noise] yeah no mob mentality there is there a ... page sorry five that so she started chanting in a moment and Paige and Paige hard if I kept telling him talking about the president got ITS America I Know my mentality from\nMy mentality where the me too movement Brett Kavanaugh mob mentality when I say that you can't you don't need evidence before you say someone does a rapist\nOr if I'm going to the grocery store or if I'm going to the post office\nIf somebody stopped friend come ... and I'm a number and their younger man yelling and screaming that's what mom sure you know ... um and I think that's what for middle America by so that's what everybody thinks you know I'm an average guy I'm hurt\nYou know persevere and buying a lot I have a concealed weapons promote I'm I'm armed\nWell you look at you look at the interview and the conversation that came from from Senator Paul and his wife saying that she sleeps\nWith a gun on it and that's not that's the real world of being a outspoken conservative in America today\nUh I I have to protect myself with a gun I'd been targeted I've had to use my gun to protect myself a I've had a significant number of legitimate death threats I've had people that come after me and my family um ... that is the intolerant left\nThey will come after you with everything they have a and and and there are no rules anymore and and and Brett Kavanaugh's proof of that when I say there is no rules anymore what to Brett Kavanaugh what they tried to do to Brett Kavanaugh by saying every day\nEvery day it was something else well he's you know he he he didn't write me but but he planned rate so then he was he was involved and gang rapes but didn't game right me but he was playing the parties the gang raped me well then I think it was a gang rape is any drinking college any drink in college I think the game right people in college\nHe sexually assaulted me we didn't actually sounds to me but he might have been the room when other sexually assaulted me\n... built up for somebody like ... ... he was the perfect gentleman I mean this is probably the best American claim of person over I'll bet on those high school or college in Arizona\nI don't think it will say I think he was probably a jock\nWho was the captain of teams who drink and party with his friends and that doesn't mean that you're a rapist yeah you know and and and today it was interesting 'cause on the view today\nThey were having a conversation about this he want to talk about mob mentality uh and and and I we I appreciate the phone call but they were talking about this mob mentality Abby Huntsman\nUh was defending Maloney as me to comment saying call for evidence\nAnd and the view show exploded around her\nMillennia Trump talked about the me too movement and she said you know in this exclusive interview with ABC News that she stood with women and the me too movement but added quote that we need to have really hard evidence\nThat if you're accused of something show the evidence you cannot just say to somebody you know I was sexually assaulted or you did that to me because sometimes she said to me it goes too far and away they portrayed some stories it's not correct It's not right and I agree with ...\nWell you know the view of course took on Trump's comments and and sunny house and took a swipe at Trump claiming that the first lady was telling women everywhere your word is not enough um that's that's not true I mean it's\nI Can't support the me too movement while also saying that we need to make sure that the me too movement is held to\nA level of accountability that our court system says is a is adequate and correct that you must have evidence you can't just destroy someone's life you don't believe me look at the kid his parents are now suing a five high school students who are falsely accused their\nSon of sexually assaulting them destroyed his wife\nHis friendships destroyed his entire life they\nWell the assaulting them destroyed is live\nDestroyed his friendships destroyed his entire life they everybody's walking around saying and then they finally recanted their stories and they're suing as they should\n\nThere are people you out there was this or a football player recently there was a ... film I think it was on HBO down about him he went to prison missed out on the best years of his career because he was falsely accused of rape thing a girl and it came out they finally that he didn't rate for\n\nWe should believe in the presumption of innocence over guilt but the mob guilt but the mob mentality of the left is if you are a woman you must be believe no matter what and the man is guilty automatically\n\nUntil he proves his innocence\nIf that's not a mob mentality I don't know what is\n\nYou can go out there and and accuse somebody of doing I mean Abby Huntsman said today evidence should always matter\nEvidence should always matter\nI had no problem with saying to Mrs Ford I had a problem with her story when that\nDidn't add up take it motion out of it\nThe reason why I didn't believe Mrs Ford is because she got to hand pick the people that were in the house in the room and people said the president was mocking Mrs forwarded that campaign rally when you know she said to you know Brett Kavanaugh you know tried to ... murder me and raped me remember that\nWhat you were to happen I don't know where it happened I don't know how did you get there I Can't remember how did you leave I don't know you tell anybody know\n\nMillennia Trump said exactly what every and this is where I Believe the midterms are going to backfire on the Democrats I Do I really do believe this there are too many mothers out there that have sons\nThat have husbands that have nephews that have dads\nAnd they saw what they did the Brett Kavanaugh based on a political assaults and nothing else and the assault is still going\n\nThe assault is still going Democrats are saying elect us to one of the houses put us in charge of houses or the Senate and we will impeach Brett Kavanaugh\nNot based on fact based on emotions in a mob mentality\nBased on the fact that got nothing else to run on so let's turn every Republicans into a racist or sexist sexual assault individual turn them into gang rape is that's what you gotta do to turn them into that\nTurn them into that\nOne eight seven seven three one thirty eight eleven one eight seven seven three eight one thirty eight eleven when they go to Steve thanks for waiting you're on the market then show Ben ... filling in and I go I had\nA band thanks for taking my call you're in a great job to the steely eyed mismanaged today thank you\nI'm a ... you know it just kills me I'm a you know when they said well what they said the economy was basically what the gentleman said was you know he doesn't understand is histories he's on learned or whatever is exact comment was that don't call\nI'll ... I'll happily play it for you because it's this is what happens when a black person gets off the Democratic plantation\nTell you what is what happens when negroes don't read up there you go\nOkay well here's some don't read for him you know the damage the demon crap party as I call them is the party of slavery they are John Wilkes booth was a Democrat and took out Lincoln who they take as their number one hero\nOr they were the party the KKK [noise] and er Jim Crow segregation okay those are things we're all supposed to know but I learned just recently that the Democrat Party not one party member voted for the passage of the thirteenth fourteenth fifteenth amendments that ended slavery\nSo what does that tell you basically they're not the party of freedom and that's been the problem for a long long time and it's time Americans just grab the bootstraps and we do something about it because it's never going to end with these people they're the plantation owners\nAnd if somebody like Kanye leaves the plantation then all hell breaks loose sparked my my uh French [noise] but uh you know they're the anthrax Freedom Party a\nYou know search suicide van records has the\nFrench but uh you know they're the anthrax Freedom Party a\nWell you get your ticket you know search suicides in record says is the face and Democratic Party she said the electoral college is an institution that has its roots in slavery\nSo therefore it should be abolished where the Democratic party has its roots in slavery and it certainly we already of slavery right and so shouldn't we eliminate that institution as well using her logic\nThe party still exist okay after World War two [noise] what do you think [laughter]\nThe Democrat Party abolished you know why because Lincoln was assassinated had Lincoln not been assassinated saying things that I'm sure a million Americans are just you know thanking them selves right now\nWhat do you live what what if the Democrats what if the confederacy ... won the war where would we be now I don't think it's a country we want to live in\nThat while the Democrats are telling you right now the country are living in as an evil country controlled by evil white rapists so", "year": "2018", "show_name": "Mark Levin Show", "city": "Washington", "day": "11"}