{"month": "10", "state": "NY", "station": "WRUR", "content": "\n\n\n\n[noise] Mm\n\n\n\n\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise] [noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n\n\nMusic from eastern Iverson ... and Dave King better known as the bad plus that is or something from their latest record inevitable western or to call you will lose all your\nWrote a band out of Portland before that ages and ages from over a year Russell is the son known as ...\nMany represented there along with the band wrote a reconnection weird want you to know why It's MORNING music to start that set from ... latest worthy\nOf beetles cover that was weight and this is double you are you are in W. I. T. H. my name's mark ruby your every week with mystery train but more on line at different radio dot org or find us on Facebook if you'd like pages for\nBoth stations thank you for this program as well I'll be back next week with more of this sort of thing to have you on board\n[noise]\nMm\n\nMm [noise]\n\n\n\nSupport for different radio comes from our members and from Smith Center for the arts in Geneva presenting black violin a violin viola duo blending hip hop and classical to bust genre isn't challenge stereotypes Sunday October twenty eight that eight PM tickets at the Smith dot org\n... hurricane micro continues to wreak havoc through the Gulf Coast region\nSo when I was so ... ... ... you're just about every ... voice again in the rain just hitting up against the house you can't live with something major\nI Know they changed the latest some historic gathering hurricane this afternoon on all things considered from NPR News\nTomorrow afternoon at for a W ... I felt shot I still feel Sean\nHundreds of thousands of veterans who've received less than honorable discharges had been denied VA benefit\nIf you have the TST and because of that pie DSD you act couch you should not lose eligibility for you were veterans benefits that that's what's been happening\nYear the VA finally offered to treat these veterans that are they doing enough on the next MORNING EDITION from NPR News\nTomorrow morning at five on the ... are you are ... the Rochester\nYou're listening to W. R. U. R. S. in Rochester a broadcast partnership at the University of Rochester and W. ... public broadcasting to learn more about the laboratory for laser energetic log on to Rochester dot edu\nA bad for down the river\n\n\n\n\nMother and father in law to have you done to\nUs to be a mile though again in my late ...\nDo I do like to get a good way\nDo as we uh my ghetto low too I guess we'll\nWe'll do boy do they like to do that gives you a good way\nRoger ... you know to me oh ...\nLaws but I don't like it gives you like them but we would\nGo to the other ... none of 'em and\nYou ask me a ... word against Wilders\nEvery day but I don't like it but I can show them that way I Would rather\nUs we apply online though the other I don't know like when you're in your late ... likely to get nearly as bad but the way you want to go to\nA game that you're older you know\nOh no no no no no we we all know\nI don't like it gives them the way under\nRather than what we've\nIn other you\n\nKnow yeah\nWell\n\n\n\nHow\n... ... ...\n\n... ... ... ... ...\nKnow Mm Mm Mm Mm Mm Mm Mm Mm Mm\nA young\nCatalog geo ...\nCannot deal\n\nIs the lead them by\nIs it a less than five\n\n[noise]\nAnd er\nThe road ...\n... ... ... ... there's not been on the\nRoad ... ... ... ... ... ... ...\nMe land or dream or\nKnow\nA a um\nDa da\nNa na na\n\n\n\n\n\n\n\n\n\n\n\nYou're listening to W. are you are actually I'm Rochester broadcast partnership at the University of Rochester in public broadcasting don't learn more about the the Anthony Center for women's leadership log on to Rochester dot edu\n\n\n\n[noise]\n\n...\n\n...\n\n...\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYeah me too is\nA cab\nYou play\nYou saw cabinet\nPlay ...\nUm yeah\n... well\n[noise] [noise]\n[noise] [noise] [noise] [laughter]\n\n[noise] [noise]\n[noise]\n[noise] well ...\nWell ... ... ...\n...\n\nLittle town\nAs a ...\nIt was John ... is Raj\nBooming the [noise]\nThen they're trying to do that with the sun\n... joining us saying we then\nSome of the child the older you because it shows\nI got the strength to carrier\nYoung men\nNeed to drink in the\nEleven years you're not in in\n\n\nI\nA lot of um\n\nGod\n\nAnd and\n\nUnder\nDog owner or not\n\nNa na\n[noise]\n[noise]\n\nOh no no we're waiting to be\nThey meant to be young\nBe mentioned to me [noise]\nGet me a job now\nThey do not way they're being that\n[noise]\nDa da da\n\nDa\nDa da da\n\n\n...\nA ... do well\nMe me me by the end you know oh you ... do they do\nNeed the whole day ... when a game and there's no one\nLee draw\nMean\nYou look\nDo you mean\n\nThey know\nThat I mean I\nThink you'll love it but we're still is the baby you owe me\nIn law\nWe'll be banned in now and no no\nOf a shame indeed and\n\nYou're listening to eight eight point five W ... FM in HD Rochester a broadcast partnership of the University of Rochester in W. acts like a public broadcasting also on line at W. O. U. R. dot org\n[noise]\n... [noise] the\nSchool in little league slow [noise]\n... [noise] from the boom\nBoom boom boom boom boom boom boom boom boom boom and will change [noise] ... ... per ... per ... machine\nOr Palm Beach team [noise]\n\nSupport [noise]\nEach ... each each each cage to continue to ... [noise] to be coming in each each and\nThis is the key is to reach [noise]\n\n\nNot a skier\nNow\n[noise]\n\n[noise] [laughter]\n\n\n[noise] well ...\n...\nMean I don't know ...\nWho really\nA noise\nOr a\nAnyway in\nThe spring\n\n\n[laughter] yeah\n\n\n\n... ...\nHere\nAnd [noise]\n\nGod\n\n\nNa\nNa\nNa\n\n\nAll right those three transgender very warm and then the answer I mean you know we're rearrange like really their fault by who who who who buy in court to up their album strawberry jam and the last one was winding by deer hunter all cryptic right up next we\nSwung by low die off their ... ... ... ... na\n\n[noise]\n\n\nOh right the last two here in WMU are worse ... roping ... followed by Standing Alone by ... and uh uh uh well ... has the right to Jordan which is pretty old at this point the classic right from the mid nineties\nUm but uh that that can include ... semi ambient sort of she gave the portion of the show tonight we're going to continue with a song like hey this is girl in amber of the album guilt injury uh\nUh\nUh\nUh someone\nI'm ... I'm a little bit of traveling for the spin them down\nGod no tolerance for go one real close to ... Charlottesville but it's wrong to do on\n...\nIt's been since Ninety Days they look\nTo bring those live for Britain was known more\nThat's ... ... no\nBomb on demand a\nNew one\nJust like you know if you want\nDo three in the water a\n... you know and he let the word ... no ... to ... to ... by ... by ... being down in a while\nTo get a ... a night when you do oh David Woods jobs have been in now is to ... to ... go on a ... when you died should\nDo more to the theater was it a little bit of a stand in the middle of the bill for when they were English known I had\nBusiness it's been this now students I mean maybe the\nSince being as bending down\n...\n\nDo have three [noise]\nDon't drink the water in a ... and I\nReally was a ... a\nA\nA salad\nEarly age range of things\nUh\n\n[noise] [noise]\n\n...\nAh\n\n\n\n[noise] [noise] [noise] [noise]\n[noise] [noise] nah\n...\n...\n\n\nMatch\n\nA\n\nNa na\n\n\n\n\nYeah [laughter] yes\n... is that\nYou don't do ...\n[noise]\n[laughter]\n\n... [noise]\nWe actually coming in to\nThe gym noted many\n\nUh I I mean [noise]\nUh no\nOh right those three closing or show for nothing ... familiar ... from citizen why ... why do by most of the some of the last one was Alan by perfume genius again no shape\nAnd a night this has been a ... dance rugby town Wednesday night night time you're ... thanks tuning in hope but you do so next week thanks [noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\nThis is W. R. U. R. S. than Rochester a broadcast partnership at the University of Rochester and do you expect side public broadcasting to learn more about athletic activities concerts in lectures at the University of Rochester log on to Rochester dot edu\n\n\n\n\n\n\n[noise]\n\n\nMm Mm Mm Mm Mm shared the\nBread that we shared a pack a lot of the\nNew credit card Oh nice to be doing in in ... the the\nMan you just want to go\nThe changes in the mood\nEarly ... back in the early\n... when people live in Queens new\nMm Mm [noise]\nMiddle East in the back\nDoor in\nMovie is\nA little bit tired and and\nAnd the\n\n\nThe news\nYou know\nWhen\nThe news\nIn\n\n\n\nTell me what by the way for me when I got that going between the ball and then the making of the local\nThat was kind of a mother you know they can then da da da da da da da da\nDa da\nDa da da\nDa da da da da da da\n\nDa da da da da\nDa dun dun dun dun dun dun dun dun dun dun dun dun dun dun\nDun dun dun dun da da da da da da\nDa da da da\nDa da da\nDa da da da da\n\n\nDi di thankful that may not be able to check that\nIt's all I Know that when you're dead you're not allowed to be up three men in my bank and the plane to store was short on what they will show\nUp and down and get them to show your daily open minded up and then they don't know what else they go to a lot of other young women you know\n\nHold all day long [noise]\nNot a lot of the whole I don't know in law who didn't want to know\nWhat you're going\n\nTo be\nWhy don't you know they go\nPeople\n\n...\nA good thing\n\n\nIs bringing the strategy on John I'm from\n[noise] you can bad investment\nSquare couch chard\nAfricans do you pay\nTo\n\nBe around\n... ... ...\n... or some\nOther than you know\nI knew there was\nA law uh your\n... there there was no fun you know\nOr you\nKnow the jury\nIs going to try to get down\nThe\nRoad\n\n\n[noise]\n\n[noise]\n\nNo no no I'm\nA young man and playing she's waiting\nGame ...\n... things na na na na name in the it inside\nAnd they're doing\nSo bad thing they name in the ... they had\nPeople on\nI see things now man\nYou need\nTo do then rain roles and [noise]\nWhy there's no snow sad\nVive la ... grand\nLa la la la la la I'm seeing a is\n\nRees right ball and go\n... and a little\nBottom line I read ... Ron\nMiss me God ten ...\nBeen a broom get in\nMen are rainbows and\nKnow knives you name ...\nRemains a dream Dr green line brandy [noise]\nLoving la la la la la\nBerger\nTo strangers on the cob shot the sidewalks and the nature of the [noise]\nThe murder man distracts me there's no way and said I have a plan\nThat brings me back ... ...\n... then there's ...\nMillion man or world that you're offering is ed\nThanks for dinner [noise]\n\n[noise] ...\nIs the best man in\nBore hole where they can\nDo a show in New York where you\nNeed to be [noise]\n... the man said give yourself away [noise]\nReading Roman [noise]\nBut you don't know how it feels to thank you\nBe the same and I\n... ... ... ... ...\nGirls that made all the foreign powers mistaken banished when miners ma\n... kids\n...\nLet\nMe know a one man and\n[noise]\n[noise] you know and you mentioned that had not\nGone down some have been let down by\nThe\nTime\nOn the run off and on and I know I Know I mean I Know\nI mean I Know about that by\nNow\n\n[laughter] I Know my [noise]\n[noise]\n\nAnd I\n\nThink I Would do\nLooks like it was from Barstow\nThis ... minute speech no talking for you to join a gym the\nAnd butter burgers by ... but um some ways we really very end up doing that does about these games to spring\nThat's where there's no stopping to really are the [laughter] I\nThey know dodged a off the air\n[laughter] I don't\n\nStudents they are and wherever they\nAnd dry and there's a roller no no I Do do do things by being gone all lives jurors will they see a\nDone by the thing is just ... [laughter]\nOh show there's a time\nWe started and\nSure\nAnd Don ...\n...\n... don't go ...\n... ... don't go ...\n... ...\n... ...\n... ... ... ... ...\n... different radio on eighty eight point five\n[noise] [noise]\nThey also know\nMy doctor and\nChange the minds on\nI Do a pilot\n\nThis is W O R U R FM Rochester a broadcast partnership at the University of Rochester and W. ... public broadcasting the university creates exceptional opportunities for interdisciplinary study and close work with faculty\nAnd\nAA and\nAnd\nAA [noise] na\nNa na na\nNa na na\nNa na\nNa\nNa out on the\nBeen in and out of their candidate\nThem and what did you turn them in the long jump in on the bunny in the\nBack and do\nNot need to be done in the band on that but that\n\nMay they may but\nI've never been to not be alone in the bathroom in the\nIn their own little brown now though that when I'm In I'm In the\nBag maddening\nNo no no no no nothing ...\nNothing more than ...\n... ... ... ... ... but the bomb bomb\nBomb huh\n[noise] [noise]\n[noise] do you tend to die at night but that that\nMay they may say that I'm On a\nSong about Mm Mm Mm\nMm Mm Mm Mm Mm [noise]\nIn the\nSun in the summer it's been a ... ... ... hello pat burrow madness fan and um\n[noise]\nYou know who's playing sad Shaw how na na na na na na na na they knew for a new ...\nSweet sweet\nSmile how they know now do the same\n\nWay so you do the same it's the woman then you lose that makes you want to play the game\nNot Mm Mm Mm Mm Mm\nMm Mm Mm Mm Mm Mm Mm no I mean\nHow long will be in a\n... year old man they don't mind the ... the ... ...\n... and all the San wave man\nAnd a woman so\nThen when we return bag and no\nOh no no and to shame\nJohn Day when I saw you know how long have you is do the same\nIt's the woman then you know the main sue while on a plane\nIs Mm\nMm Mm Mm\nMm Mm Mm Mm Mm Mm Mm Mm\nHello ... my dream is ... ... ... ...\nIs is not a new way in the middle\nOf June ... ...\nWords on a rainy background you know just be nice to be summer and\nUm oh um no shame John\nMaine where do you do is to say\nIt's a woman then you know what made you want um Les\nMis nine\nAnd a million dollars a barrel no [noise]\n\nDon't know the answer is our men are making it hard to make a\nTo actually walk around the block a God that\nSo in a man from the outside\nLady di da da\nAnd\n\nAnd ...\n...\nNow\nAverage age of ...\nThe guard\nI knew there was anything good\nOr bad guys to me\n\n...\nWell mommy I mean especially when\nThere a way to the new\nRole they win a ring is a little\n\n\nGone na na\nNa na na na na\nMen men\nAnd\nLong as it down and\nNa\nNa\nNa na\n\nNa na na ... in it\nAnd then\n... then\nNa na\nNa na\n\n\nNa\nNa na\nNa na\nNa na na\nRight\nDid not down\nTo them does that\nHe wrote you\nNa don't lie they say\nOh your ... and\nKnow the way you\nThan a\n\nMan\n\n\n\n[noise]\nYou know ...\nI Know I'm not a\nYou\nKnow her\n[noise]\nI knew\nSay well maybe the\n\n\n\nYou call me the\n\nThey\n\nNa na na na na na na na na na na na na na na na na na na na na na\nThat do you weigh the\nEvidence mommy oh dum da\nI show my thinking it was kind of the\nThe ... the truth and not by the\n\nTo be seen in the ...\n[noise]\n\n[noise]\n[noise]\n\n[noise]\nIt's different radio on eight point five\nIn the morning and out to the end of the injured in the in the gold and blue nope no\nAmerican if you're going to go there you know there are willing to pay and Oregon you make it right down to the bone ... nine years old and you know\nThe rainy rainy go the ... the cook a lot to read it in there and you're lucky if you can find\nMe no no no no no no no you're not you know then you have time to go back in the bathroom\nBill but now I don't know what I mean I Know I don't know three rolls around and they're they're finally a a burning building and\nThe robot will come out of your beat the down home and then they are known to man in Rochester New York and a\nGirl going right into the top be you're not you're not going to bring the whole\nThing with the one you love to go back and not all day long you been ... been banned under peeling the get go round and round and round and\nDa da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da\nDa da da da da da da da da da da\n\nDa da da da da\nDa da da da de ...\nIs long muster up only to bomb a no brainer swing your bail di di di ... said the Taliban who you're with\nThe with the fact because then you know the wild Dina on the ... the money that they may be the big Jon Benet na boy or girl\n[laughter] you know in time and she is um you know she's a good\n[laughter] you\n\nI'm a nurse\nIn mind the ball and he was they those products\nAnd build upon it\nA little\nBaby and I'm going to be the one thing you do need them\nTo leave leave these will all be we're not rent a room and I know you go in there you know Mr\n[laughter] you know and I'm ...\nI'm sure you're there and and what a Jew shoe bomb oh\nI'm sure you put it that way but they go\nOn\nThe\nEast coast in there to see a very old man\n\nHere and there are here [laughter] [laughter]\nAnd\nYou should write a\nLetter o\n\nIdiots by about some double your are your ... that many the Rochester online at W. R. U. R. dot org ... we are you are\nYou in the broadcast partnership with the University of Rochester in W I took like public broadcasting Michael Black with you on this Thursday morning I'll be with you until three\nSome great music to get you up to the world can stay with tell your slang or let's start with music from Regina factor and uh this is older in smaller from different radio but we are you are\n...\nKnow fly\nBy\n[noise]\nAll the time\nYou are sending but I think I can give me your from the people can't get better and they really want to know how to do my\nYou\nYour\n\nUm [noise]\nThis will be a roller rink Turner was recovering from tape deck hard you're on the radio before that we would Mac for rumors and\nStuck in the new John ... from two thousand six of these ... doctor\nFormer member of the light that came out a couple of years ago on older and ... and just a reminder we are winding down her one dry we are going to be here just today and tomorrow\nIt's your chance to support the music on different radio do where you are you are going on line at W. R. U. R. dot org and hitting that donate button at the top of the page and when you do that you'll be techno paid or you can choose to become or knew what number when you do that\nYou're pledging safely and securely and ensuring that the music keep playing on double you are you are we thank everyone who so far has supported her radio do we are you are online so we are you are done or what's wrong with a song on this other music from our young from white rich ... just as a Superman\nOn FM eighty five different radio [noise]\n[noise] [noise] [noise]\n[noise]\nNa na na na na na na na I Want to hear [noise] na\nNa na I Can't do any day [noise] you know and the na na na na na\nNa na na na na na na na na na\nNa\nNa na na na na na\nNa na na na na na na\nNa na na\nNa na na na na na na na na\nNa na na na na na na\nNa na na na na na\nNa na na na na na na\n\nNa na don't want to\n[noise] na na na na na na na na na na na\nNa na na na na na na na I can [noise]\n[noise]\nReally know when you\nWere reading game that we didn't jak\nMay\nMom and\n\n[noise] [noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\nAnd\nOur\nReno\nUp the days you go\n\nTo the games yeah\nMm Mm Mm Mm Mm Mm\n... ...\n... ...\n\n... ... you read on the bad and then you that it did they gain\nBut um\nWell that the ...\nThe new ...\nDay by day but it makes it has\nUm and\nAnd you\nAnd oh that is a\nBut ah yeah\nNa na\nIn Atlanta in a in a\nBay and there you\nAnd\nNa na na\nNa na\nA\n\nKnow things going on\nWhere you want me\n\nBack he'll\nGet the\nOn the bus down\n\nThe bud downgrading\nDream na na\nThe\nOther a dragon and\n... code chair\nTry to address this poetry and all in a way\n\nLive in the brain\nYou know it's the same name\n\nGoing right girl and [noise] God\nEveryone happy just saying you\nKnow [noise]\n[laughter] [noise]\nWhat can the government or job\nBoom\n[noise]\n\nTo\nRow deserves\nA chance to drill\nDo you mean the the\nLaw\nWho know me well\nMm\nDeem that day\nAnd drew oh\n\n\nWe\nKnow that you\nMember to me the\nI think a good and I'm\nA you know\n[noise] [noise] [noise] [noise] [noise] [noise]\n[noise] ... you know Scalia come into the soil you\nCan you can join us ... ... yeah 'cause you don't use those same clinicians\nCountry can get is a lot in ... she doesn't look good and it's just that you go to the end of the gum says yes\n\nThen the shell but into\nOf the same but\nJust to make me\nThat's the way in the end of my God so\nYou know I\nThink he got a good show called the\nBills that they don't\n\nThe same\nAs the\nThat are\nStill you may\nYou may come\nTo me\n[noise]\n[noise]\n[laughter]\n[noise]\n[noise]\n[noise] [laughter]\n[noise]\n\nDo you just don't make me\nHe's still\nSell\nThough [noise] [noise]\nThe\nReal amazing artist actress\nA Monet from dirty computer that's make me feel she's a very busy person Suzanne Vega Carol mail from nine objects of desire going back to Nineteen Ninety six Chris ... at least they could buy from rocket of health and arcade fire with Mavis Staples from the reflect your tastes that came out last year and\nI give you power here on different radio W. R. U. R.\nHow's it going to tell one o'clock hour this morning and do we are you are ... Rochester online at W. R. U. R. dot org Michael Black with you on this Thursday morning\nAnd we have great music this hour coming up from Robin Roberts and we'll also hear ... walk one then our box so much more here the Jay hawk starting off for so long as the road for this hour\nWith it's up to you on different radio W are you are\n[noise]\n\nNa na\nNa na na na\nKnow small just ...\nYou know\nYou know\n\nKnow the truth I\nI can stay in a while\nEven\nNa na na na\nNa na\nNa na na na na\nLiterature dreaming that are\nTo read but then ...\nAnd\nTwo na na\nNa\nNa na\n\n... he was a good\nJob I\nAnd ... in\nNa na\nNa na na\nNa\nNa na\nNa\nI'm\nVery happy song from park at court that is the wide awake the title track that their brand new record Barry bond group the perform live but who getting in tune from who is now going back to Nineteen Seventy one Amy man going through the motions from forgot norm and the Jay Hawk Down the line it up to you\nAnd it's up to you to become our newest member of that we are you are with your pledge of support during her on Dr this week go online to W. R. U. R. dot Oregon and look for that donate but in the top of the pay that will allow you to make a secure safe donation\n... the programming coming in that we are you are at W. R. U. R. dot org and we thank you for your support your the wall while we're this is letters from the waste land on different radio do what you are you are [noise]\nThe leader\nDo we know who's\nBe your [noise]\nView\nBrennan may\nBe true you write\nOur na\n\n\nJunkie do drugs you know\n\n[noise]\nOr\nA\nA\n\n\n\nKnow murder [noise]\n\n\n\n[laughter]\nAnd [noise] and and and and\n\nAnd\nWe're so sorry in\n\nMinnesota or read any we'd guns do anything\nWhen those are already in the\n... the\nThere's no one laughs the man\n\nSo starving movie um\nDay with those\nWill be no\nAnd ... and\nA much a\nName and\nRan ran\nA on a\n\nDe\nThe drawing\n\nEvery day [noise] because\nI don't have to do to participate in both ... and I also don't got another couple of them depend upon\nOut on the ground Milan and monitor\nAnd Iran does\nEver been and the ...\nTo\nTown and there\nMade you pick\nDa\nDa\nDa\nI think\nYeah yeah\nYeah\n[noise]\n... ... ... ... ... ... ... ... ... ... ... ... ...\n... yeah ... ... ... ...\nThey go by now we\nBeer alive got hired the\nWrong ... bit a little\nThe screen door to the\nOh no\nNo no no no the one law\nA new one mom or\n... or ...\nAnd when you how do you\nA ... ... in London where\nLive in a limited time\nNot say\nAnd the\nHere and there is no\nLeon lied about the ah the way\nThrough the day\nI'm On a new one\nThat I'm a man in ruins\nDi di di di\nDi di\nNa na\nNa na\nThere\n[noise] how\nNa na na na again I'll Try new\nA\nMan but\n[noise]\nSay about him and say you\nAway but she went on the same\nMm Mm Mm Mm\nThe\nTown the town\nGuy\nFrom their ... you know\nNa\n\n\nThat's been polled Trump songs for Silverman and that is Jesus when you're a different radio\nDavid brothers before that with living die which was featured in the motion picture this is ... what was their album carpenter Robbie Robertson bureau falling from how to become clearer Boynton Beach house with zebra from ... dream Yusuf John Stevens and I should have known better on different radio W are you are\n\n[noise] nah\nRich\nLead the\nHe\nNa\n\nAA in [noise]\nNot\n\n\nMan\nThen na na na\n\nMaybe\nI Know and will be the\n[noise]\nI\nAnd\nHer\n\nBut\n\n[noise]\n\n\nUm [noise] in\nA blender and\n...\nNa\nNa na na\nNa na\nI and [noise]\n\nNow we have a\nTeen about dying you\nAbout this we needed to be a guy in\nDa da da da da da da\nDa da da da da da da da da da\nOut on the job than\nThank you may be a wall on the dominant\nThanks you may\nTown again and again and again I'm by you\nTo be the real fine\nJaded\nKnow\nWhen I when I\nWondering where would I mean without\nEleven thing I did when\nReal well when\nEnough money all the time and\nBank your baby\nI just want to thank you I\nMean it is indeed a pie you\nMay be a\nKnow\nYeah\nOut of town thank you very\nBeing a guy you\nWay and Annie di you\nBy the time it would be the\nJames Taylor closing are stuck in our this morning with no we don't do that he was a year from\nGuerrilla who knows where time goes and if you're just like you might have that same question Matthew Sweet and Susanna Hall from under the covers going one they're McLaughlin with wall one from after going to jump Stevens from Carrie in law and I should have known better\nAnd speaking of how we did how do we do with the music plays on W. are you are as an opportunity to show that support of keeping the music coming with your pledge like going online to do what you are you are done or your pledge to support keeps the on the air\nAnd the music playing at the W. R. U. R. dot org with her that donate bought into the top of the page and we thank you for supporting different radio do where you are you are\nOr third and final hour this morning gets underway here on different radio double your are your ... D Rochester online at W. R. U. R. dot org\n... coming up in sixty minutes Michael Black with you and ... and we'll start off with the band well back to uh the album ... dog man may with going back to Memphis on different radio W. or you are\nYounger bang bang bang bang bang bang\n[laughter]\n[noise]\n\n\nTrying to make er\nAn all time favorite I Am\nGet back on the phone call\n[noise] but then after [noise]\nKnees\n... lady luck from can't we met some here on different radio do we are you are home brothers before that from in here at the final round in the band starting off the our going back many but\nOf course you'd have ... ... ... or ... or ... in a row here ... ... he went by from the denial drunk drivers killer whale\n\nWe're going to grow Ruth ... or ...\nOr ... oh you do good girl girls ...\n[noise]\nWe're going to\nOn our governor\n... ... ... as I was just\nA bomb on drugs too good girl ... the ...\n\nJust they\n[laughter]\n\n[laughter]\nMeaning ...\nYou in his new on July ...\n\n...\nShowdown movies\n... down\nA young man\nAre living in these days they'll bring the\nA ... do\n... Joe\nShow there is no\nDay ...\nNo no no no\nWay over\n...\nAnd\nThat up\nBank and the\nSaying that you get up\nI got it right to get up\nNot come back but not when\nYou get up on what I thought\nTo dinner\nAnd my\nMother\nIn\nJang\n\nThat something\nThat they're going\nCome up and\n\n\nGet out\nFind that\nYou know I\nWhat happens is when you come up\nIn the\nMorning\n... ... ... ... ... ... ... ... ...\n... ... ... ... ...\n... ... ...\n... the the ... ... ... they still\nSeems to be\nBy the ... ... ...\n... ... new\nBe ... ...\n... ... ...\n...\n... ...\n... ...\nAnd then show\nA\nMan with\nThe machines\nBit much longer\nThan a ...\n... ... ... ... and ... then\nThe you\nKnow ... ...\nWhen ...\n...\n... ... ...\nNa na\nMiddle aged I'm\n\n... you know\nThey can go\n...\n... ... ...\n... ...\n...\n... ...\nOn the show\nIn the ...\nThe machine\nI'm\nDo a\nReal man\n...\n... ... ...\n... ... ... ... not be a bit just bringing me up and down the path in Britain though we go\nDown me out and they are they in\nThe [noise] we were the\nBig no no some of the things that they\nMay not be a\nBit during it may have the dog would be\nThink the the bank and we all those\nJust ... they said\nPatch the day we\nCan get [noise]\n[noise]\nMay have not read who should have\nGone down to ... kill in Brian\nThing happening isn't that funny how did they go\nMy job to share that\nBig thing that we honor\nTo get on\n\n\nYou ever do\nThey can go buy\nBack in time and we do\nVery\n\n\n\n\n[noise]\n\n[noise] ... ... ... ... ... ... ... ... ... ... ... ... ... ...\n... ... ... ... ... ...\n... ... ... ... ... ...\n... ... ... yes or no deal ... ... ... who\nAre not then ... and\nI Know well well\nI\n\nNot\nKnow\nHer better than they do they\n\nBut\nI'm the same\nI'm Lynn and then all of them do\nCrazy name crane they know\nWhat you can get treated me to\nGet them back and do will build", "year": "2018", "show_name": "The Difference", "city": "Rochester", "day": "18"}