{"month": "10", "state": "NY", "station": "WRUR", "content": "I Do know your eyes brew whoa\nWhoa\n[noise] sure ah Saddam\n\nTurn what's been frozen food\nMm mhm mhm [noise]\nInto a river of gee\nMm\nNo I mean the way you know somebody who ... who lived in\nA while now let's turn blue just issue than breathing\nMm Mm\nUnder the frogs\nWell if I'm heated tempting\n\nAlong but I'm sure we're in just a touch of her name\n\nYou said your your immunity stretches I never would\n[noise] [noise]\nOh and I seem to know them but I just saw yeah\nMm Mm\nAnd I know the coal\nThat comes with that first you can\nDo and\nThere's just not enough he ended up fires burn him and then you know\nMm [noise] to know your eyes I'm\n\nSure that um [noise] I'm trying what's been frozen ...\nMm into a river rose cheating\n[noise] Mm [noise]\nMm\nI'm ...\nI'm\nThe original that came out an album Thirty years ago called slow turning the song is icy blue hearts and he'd do Harris did a lovely version of that as well but that's the songs writer John highest performing live for acoustic cafe\nJohn sorry in Studio guest this week we recorded are session at sound stage studios in Nashville right there on music row\nAnd you will find John's brand new album on the new west records label it is called the eclipse sessions\nAnd many thanks to him look your head and ... for making our sessions that sound stage sounds so great it was a pleasure to work with he wants to get to and thanks again to our hosts at the American music association as well as the ... music Center for making our sessions down there this year possible\nI understand a line at a cafe dot com that's her official websites and while you're there you can view lots of videos over the last few years\nA plus your tons and tons of archived audio in Studio ... performances and interviews that we have aired recently here an excuse to cafe again just go to a C. A. F. E. dot com a cafe dot com\nYou're the Twitter and Instagram you can find us there at a cafe radio of course we're on Facebook as well but you can always email me directly if you'd like\nRob at a cafe dot com R. O. B. at a cafe dot coms went back and just wrap everything up here and tell you all about next week [noise]\n[noise] Mm [noise]\nTo cafes may possibly part by new west records and the eclipse sessions from John Hi creator of classics bring the family and loved hurting John hired a new at the eclipse sessions screaming\nAt available everywhere now more information at John Hyatt dot com mixed joining us\nTo stand on who's to say thanks again to John hired for joining us down to Nashville prevent the number seven and songs from the brand new album called the eclipse sessions which you'll find on the new west record label\nAlso baking as possible this week the international acoustic music awards accepting ... through the night of November and if you stick dot com rebuilt the art and nonprofit venue for better than fifty years you can find out about them the art dot org Leon speakers Emily I lost more about both at Leon speakers dot com and the seat facility music center\nYou can find out about their twenty Eighteen and Nineteen schedule\nLike going to ask the emcee dash online that or the next week on the program brand new great music from Paul well our cat power also be on bridges in her in Studio guest will be the more intriguing workout or at a production of audio radio riding affection helps as far as I Need to Franco ... theme the million dollar retro it magnets wrote the word first then dummies\nTill next time I'm your host Dr Reinhardt every week\n\n[noise] they weakling rain the English me to the next World Cafe we'll hear live performance I knew and classic signs including tenderness and save it for later and the story of how Elvis Costello convinced energetic singers out all the time in\nThe wake thing and the English speech collapse and the next world cat [noise]\nMonday afternoon it to end up we are you are ... Rochester [noise]\nHi this is Steve Inskeep with NPR's MORNING EDITION our goal is to bring your news that matters to keep you in touch with information that you need to make sense of the world\nWhat can seem like a senseless time over the course of a day a week a month the news unfolds and were there with your day by day listening to MORNING EDITION every day\n\nTomorrow morning at by bond that we are you are up I'm an HD Rochester\nIt's strictly treats dosing double in Halloween in the global village like ... to stay with me for the next download the music scene usually global the late ... if you there [noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise] [noise]\nAnd she told me and\nNot ... ... a day and jelly\nBeans yeah now a\nButton and a little bit but you\nKnow I don't know when [noise] uh yeah and a leg but on\nThe in\nThe day and they can't find\nYou know when I'm In\n\nI'm not going to be [noise] in the news in the new people to be removed and the million and ...\nAnd the only thing we move in a ...\nBy by for men\nWe're right back to those were shaking durable grade the baby again the mommy mommy I'm sure there will be on all\n... side of that but I saw an endless\nIn the ... when the can of\nTommy ... had the winner this worm they did that and\nTo her and I\nLive by our\nShow I watch the kids\nFrankenstein the Dutch based on Halloween\nI'm dirty or one we'll\n\nAnd\n\nMy\nWay to make\n\nNa\n\n\nWedding or a ... a\nA [noise]\nUh-huh\n\n[noise]\n\nTwo two and a lot of time\nAnd and and I don't I\nDon't know [noise] [noise]\n[noise]\nAnd\nAnd\nThe [noise] [noise] ... and\n... and ... now and [noise]\n\n\nAnd um\n\n[noise]\n... ... ... ...\n\nIt tell the lead in the global village were back in the moment with the dog story if your heart that stand\n\nWow\n... I'm like yeah\n... ... ... ... ...\n... ... ... ...\nWhat they do a short drive\n[laughter] [laughter]\nDoes he still got a big advantage and when the big job ... ... it's called fat free on ...\nAsked him why are all is race and then a\nTournament then why don't you don't live here and ready to be putting them all day and a driver you know they're in a driver on this on the other line for that matter than the ... like the ... anniversary own eyes\nRoll call partner my nine year old ... Jones do not smoke double ... vice more role um\n\nBush ... in Manhattan that ball with live like the old ...\n\n...\nAlmost mysteriously live with allies would stop and rolling his eyes Joe tournaments and\nI'm Sorry I'm but I'm afraid that there's more to go to a v I kinda got to be making a ... on the damn it in the last man down the river and low gone in their\nHands on and get into a cup of coffee on big Neal\nMan\nYou know you got to change\nThey say they\nCan be when I come home\nThat day [laughter]\nMy out this dog and my\nOh you're in a\nBank\nWhich Jane and Jonah though who\nThey die in a way\nSomebody who will\nPay like a bomb and well\nKnow you've got to say they like\n\n[noise] ...\n... ... ... ... ... ... who who who who who are doing\nThings together but I'm just thinking about me and I just don't care about\nMom and then you're done I go my\nGot my ... you know when they're running I [noise]\n\nYou\nWhat\nPrize manage\nHim with them to do\nKeep thinking\n\nDa da da da da da da da\nA cell phone to call them\n\n\n\n\n\n\n\n\nNa na na\n[noise]\n\n\nIt's how we were really the right there for the most the most scary than just a moment [laughter]\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\nAnd ran ran na na\nNa\n... no I was the last ... does\nAnd it was\n... no no\n\nAnd oh\nI'm In the in the or in the law that a ... a big wall and it was all\nLive and die and [noise]\n\n\n\n\nNot a ...\nI'm All right\nWell I'm a dog the queen na\nNot a\nNew online or\nOn [noise] yeah\nI don't know I'm On a diet rich guy challenge yeah [noise] yeah\nI mean I\nI I'm\nToo long I\nNa na na na na\nOn a on a\nOn\nDay I die na na na na na na na na na na na na\nAA\nAround um\nTown and I began to train them rages on\n...\nA dream to the day I die\nIn Israel ... the crude God\nBridge or John isn't really mad at me and I don't\nYeah [noise] um [noise]\nI'm a\nTown which I Am\nI on [laughter] [laughter] [laughter] yeah [noise]\nOh yeah\nWe both like blues country yeah gospel like mixed up somebody up sections of the record store jazz it's old categories like be useful searching the music a lot but you don't need boundaries on the radio\nThis is Marguerite inviting you to join the war mystery train journey into the rolling landscape of American music for all these ... grew up together\n[laughter]\nWednesday night at six so different radio\nDating his heart but using dating apps it's pretty easy the picture and swipe right yes or no oh no that's huge wrinkles dirt not my type it's a very rapid fire like by ... by now that life is a question bumbling tinder are fighting a legal battle over who owns it\nThat story was the last week of campaigning before ... this afternoon on all things considered from NPR\nDoing tomorrow afternoon at foreign double your your ... Rochester\n\nYou're listening to double you argue are up but I'm an HD Rochester online at W. R. U. R. dot org that we are you are the broadcast partnership of the University of Rochester in WXXI by public broadcasting Michael Black with you one day last week about Hoover hard to believe the ball going by so that\nGot some great music do three when the world cafe comes away with tell your slang or what's wrong with dogs this is from stories don't in from a window seat on the radio W are you are\nA good mom she fell in love ma and set in a check to the museum a rush ...\nTheir money not directed\nIt looks like a\nBar in a church that bloodline regions through\nSpring early\nTwo wars from the band\nWhy now\nYou do see everywhere they're going on\nThat God each time they\n[noise] maybe she managed driver\n\n...\n[noise] the nose\n\nSo non was bad dude in some way below me about breed a dream of captain and explorers eating\nTheir back and join them and they all born to me in\nMile long comes into view\nSo I reached out\nShe was named brand jak\nTo see where I Am\nI find that the hero and that is\nA man I Am riding [noise] you know starting in it and it's okay\nTo ... stay calm serious just reevaluate that way I\nNa na [noise]\nThey [noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise]\nMm\n[noise]\n\n\n[noise]\n\n\n[noise]\n...\nIt's W. already ... music from the arc that out on my mind from yours screaming Lee\n... though on the attraction this years girl from this year's model going back to Nineteen Seventy eight an Elvis just dropped the brand new record\nKinda reminiscent of his Nineteen eighty two albums so some really good stuff that will be coming up that you'll be hearing them different radio Katie wind coming home for watershed and or I might have mentioned this before but there was a great PBS\nSpecial coming up in December where she performs in concert the entire ... new album is one of those ... from ...\nHim from the forty niners parallels that will be great to see that and dogs rumble window seat\nUp next dire on different radio double you are you are your other pretend they're starting off course lungs in a row this is a Chinese plastic on the radio W are you are\n\nWhen they bought [noise]\nYou know when you get to see\nThey get on and he\nDidn't feel like\nYou're not missing\nHow bad\nIt can be on the Chinese\n[noise]\n... not happening to\nAt the end of the three were they told me question in my\n\nBack to the hot again\n\n\n\n\nWell you should do the [noise]\nThe people around the things that make me want to hate must not be home to me [laughter] you know human pathogens she\nTracked him down here living in my um [noise] have you done to hope I can do other than you would have a time [noise] ... do you really\nLove\n\nThan when you look at the beginning of the Chinese lasted\n... ... ... ...\n... ... ...\n...\n\n... yeah they'll no\nMoney\n\nIn my um\nMm Mm\nYeah no real me alive yeah they'll never mind\nNo no\n\nMm\n\n... ... ... ... ... ...\n... ... ... ... ...\n...\n... years down the road with mine do\nDo do\nDo together we can see why we went on\nTo do ... do\nYou do and believe me you're not there to do\nThe do the\n... last October\n[noise]\n\nAnd and in\n\n... little\nTurtles are you\n... you know I'm Eugene how are you sure you heard the girls are no rules ...\n...\n... [noise]\n...\n[noise] you know I was real little ...\nUsually it'll be a little\nStudio at all\nAre real show the\n\n...\nDo you\nLive in the\nSeries\nLooks really the [noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n...\n\n\n...\nYou can\nLive with the\n\n... [noise]\n... and\n\n\n...\nIn ... ...\n\n... ...\n\n\n\nYeah I really\n\n\n\nWay you owe me\nKnow what they show you\nIn ...\nShip\nGo to the\n\n\n\n\nShe\n\nGod [noise] like in the next\nBig suing him and we don't know I won't stand out and did we go [noise]\nI did not know how many venues that you know being the baby and\nYou may be in a guy and you can be in a guy you may\nAnd will in Iran in line to learn is oh damn thing and I\nGuess that we know now that I did not respond and we\nActually did and I got a new baby and a guy you'd be and I got a little\nBit of it is three [noise] I got the the way my three\nYoung\nMen and I don't care you know they would you\nKnow mom\n\nI got a huge big guy you may have been a huge big [noise] I've got a little money\nDoing\nGosh Judy will weigh in on it and you guys got [noise]\nYou\nNa na na\nNa\nNa na\n\n\nAnd\n\n... ... ... ... ... ... ...\n... ... ...\n...\n... ... my cousin\n... ...\n... to\nThe new\nBreed on me I\nNa na na\n\nThere you can do um\nLot like you know ... ... oh my\nI Do think that that sounds\nLike to say [noise]\n\nOr a beer with the sun song closing on our first hour here this morning on different radio there'll be are you are that's where more and wow will go I must be a high from eight and Paul Simon all around the world or the myth of the fingerprints that is from Nineteen he does like the great land in many Rogers\nOh what's on and off Iran different radio do what you are you are ... the Rochester online at W. R. U. R. dot org\nAs we get into our second hour this morning at different radio W are you are Michael Black with you until three one tally slang or has the world's yup they let's start the ... would you then they will go back to Ninety nine point nine degrees is what makes the way I never made a point by double you are you are [laughter]\n[noise]\n\n[laughter] yeah\n[laughter] than I Do and that's how I was right after I cut\nBack the way [laughter] bringing my yeah but I keep an eye on them and I said and [noise]\nAnd and [noise]\n\n\nAnd I\nKind of like\nGigantic\nMega [noise] my [noise] differently [noise] but [noise] I keep an eye for the sheer\nI don't want to address other\nThan that [laughter] [noise]\nAnd they're bringing it might like to share a contender for counseling banks and I hear from you know and there's\n[noise]\n\nA\nRemain years\nAnd ...\nShe saw the pictures and she pain in\nRain green\n...\nTree\n\nA\nBeing held her and um\nShe been doing for a two man\nBody and she fell down\nBefore she God\nKeep my friend\nBelieve our tracks\n[noise] ...\nAngry and\nNot miss yeah nah\nTree in\nThat read history\nWell the ...\n[noise]\n... ...\n...\nI mean well the and the ...\nYou said are leaving the mud Jane and watch my blood began the lower\nBut I'm going to bring a\nI'm going to bring my ...\nMy ... brother\nAnd I am going great\nI'm going to bring my\nVote in bringing a really big change\nNa na na na na na na\nI'm burning of diesel Vernon dinosaur\nMm Mm no I don't see the river down through the water and ... the fact because all the time going\nMy ... my ... big change over time\nVery [noise] I Am going to bring my do to bring my real estate king age\nAnd ... ... ...\nRain and I told your do you\nRate\n\n\nGod\nHa ha ha ha ha\nHa\n[noise]\nWhen I\n\nWas\nKnow only\nAnd she you know\nThere are mental when\nTreat the name of running\nA\nYou or you can [noise]\nYeah right man she is in\nThe ... I don't mean\nRight by\n\n\nDaughter in law\nAnd\n\nAnd\n\n\n... ... [laughter] [laughter]\nNo rain man no way for me yeah there are all you get done Neal bone is the thing is the game but when I was in New York\nCity or the uh the ... you know they do they know when I'm not\nWhen Ron why don't they I'm I'm\nDon't mind the\nAnd make it out right\nNow\nI\nThink you know but the fact\nYou give me a ... and ... then they'll yeah by\nThe main\nBody the body at least when they you know like they do and then\nMy\nAnd then there's no good and then\nThe rain but\nThe thing that I've done my own thing you know Jane or wouldn't mind\n\nBeing so to me but I Know plenty on a\nThey may have now added a lot\n[noise]\n\n\n... that's the title to their to sell them three records a search here ... W are you are right is rain from a Dell going back to her first album night he was in San ...\nFrom there when the light away album and the title track she jumped up\nNearly breath as a new record as he released this year really good ... ... ... album future and the ... just a short or dial on yup and eighty point why don't we are you are\n[noise]\nGave me\nNa na na na\nNa\nNa na\nHe ...\nHe\nNa na na na\nLittle bled been they knew\nMe P. E.\n\nNa na na na\nNa na\nAnd\nSaying\nMan\n\n\n\n\n\nThey are in\nOr maybe\nAm and their day\nNew\n\n\nNa\n\nNa\nAl\n\nNa na\nNa\n[noise]\n\nIt's hard to believe it's been a year so Tom Petty passed away a ... I Know that uh surely is ... she's got a new record out\nOf the ... released tracks and some other a rarity this goes back to our promises in the waiting to hear a word when girls wrecking ball of course the\nGillian ... song ... wild wild life from true stories were van Morrison they liked the title track to Nineteen Ninety five albums\nAnd from the future in the past new music ... brown and short or violent different radio double you are you are\n\nNow beginning to wonder why we're the warning on if I may point bond that we are you are ... the Rochester online at W. R. U. R. dot org World Cafe coming your way in sixty minutes with Sally Jewell then Michael Black with you with ... with max this is do your own way on the radio W are you are\nIn the news in the in the\nDry ... new in the ... now and then the chain evening being you know and it was in the hot new mom we are\nNow being in the bank is stronger than anything they want to get young young\nNa\nNa na na no dad and the\nIn\nThe gym you're while they were going out and and now in\nWe will be\n[noise] you\nKnow they can be you know we\n[noise] you know didn't know\nGood thing in the middle\nAnd [noise]\nNa na na na [noise]\n\nNo [laughter] [noise]\nAnd\n\n\n\n\nNa\nNa na na na na na na na na young\n[laughter] [noise] how ya know damn\n\nBang bang\nAnd\nMoney for a while when they're young and wind up in the long term view on a big job done\nYou know in the big yeah do you do not see the the way the ribs and gave me that I did and shame on you\nThey came to that died\nAnd the shame on you I Can't see it in my\nConveyed an\nWhen your daddy can\nOn land anytime I\nMind the town I live in Maine and no\nAnd they're not there\nThing here I Am a shame\nAnd damn na\nNa na na\nYou\nMay be that they're not\nAm saying that keeps me she had to get\nDown to the park and walk\nThey can do well in the ...\nNa na\nNa na na\nThe CD [noise]\n\nNa na na\nCharge you John Campbell brown he can't\nI think we're on a name Bob Kerrey\nNa\nNa na na\nNa na na na na\nNa\nNa na na\nNa\nNa\nNa\nNa shame\nStrain on ...\n...\n[noise]\nYeah I go ooh\nTreat me and me ...\n...\n... oh my\nWhoa you love me the ... or ...\nJob in a ...\n...\n... ... new\nGuy\n\nDid ... ...\n... ...\n...\n... ... ... ... ... or\nA wall and the girl a leading close to ...\nAh ... we go\nTo John in the ...\n... ...\n... ... ... ... ... ...\n...\n... ... jobs under the ...\nOr live longer your how we think we're\nAll new law\nWhere the where ...\nGo to John in a ...\n\nIt yeah on line ...\nGets re really lovely oh yeah\nMm ... ...\nNa na\nNa\nNa na\nNa na na na ...\nAnd [noise] um [noise]\nChit chat rooms well\nBadly yeah and the\nDa\nDa da da\nThe euro [noise] taking\n\nThe\n\n... ... ...\n... ... do you do you do\nAbout it a bit in the back go my head on the mood of do you get you know go to the world to weigh\nIn between the people\nWho didn't get the job in the ... the uh\nThe you know to know about their own very ... better than the non the\nBoehner voted that broke the stove and then and then the titans are always just total unknown and then we'd only had a ... volt\nAnd no\nAnd I know\nWhen you were in\nMen and\nNeed for a job go\nAnd we were there and I'm\nDoing good stuff but no one\nYoung guy I'm a big joke cast up\n... is this you know\nWe just can't stop them from the from what I've been on a cell\nThe girlfriend the mole narrow di\nDi di da dum dum Tom\nAnd\n\nJack johnson you all I had a series that goes back to sleep through the static here on different radio little jangling from Edward Sharpe and the magnetic zeroes from up from below zero everyone's in love with you from Trenton in the blue jays spell titled try something\nMore than three\nGo back to Nineteen sixty seven act the ball yeah love the Greek Jimi Hendrix capital made up saying no different\nRadio W are you are\n[noise]\n\nDo do do do do do you mean you can get in\nOn the street you can use to do this British let's just let them\nThat the you know ... and all\nNeighbors on the jump the peace movement\nAnd keeping\nThe ... bill\nWhen I moved to the point you know\nA disability is done the ball and\n[noise]\nAnd do those ... ... ... ...", "show_name": "The Difference", "year": "2018", "city": "Rochester", "day": "29"}