{"month": "10", "state": "NY", "station": "WRUR", "content": "You know you\nSee how you or me too I\nMedia how are you\nName to\n\nMe to [noise] I can\nOh yeah me too\n\n\n\n[noise] [noise]\n[noise]\n\nUm [noise]\n\n\n\n\n\n[noise] [noise] [noise]\n[noise]\n\n\n[noise] [laughter] [noise]\n\n\n\n\n\n\n\n\nRight you're listening to eighty when die Wu are you are the money's the Rochester broadcast partnership but at the University of Rochester and W F ... broadcasting also on line at W. R. U. R. dot org\nAnd you just heard about the good song but most recently\nBuilt by halfway bite the hand by what genius and come back it by ear and ... and I'm going to have heard of murder play us out with you always when you're drinking either ... Kelly deal Kelly deal\nFrom the breeders thanks again for listening\n[laughter]\n\nKnow\nWhatever\nThis is W. R. U. R. FM Rochester a broadcast partnership of the University of Rochester and W. ... public broadcasting to learn more about the school of medicine and dentistry or the school of nursing log on to Rochester dot edu\nI think I'm Alone I'll go down ...\n... and I think ...\nWay in the world was lonely ... not\n... I'm\n... oh ...\n...\nAnd I say\nModel oh lord\nSee the world does not really the only thing going\nMany moons ago down I'm\nRoger all along about ...\n... I Can't walk on\nMuch being more\nThan ever see the world you're\nSingle well no no no no\nNo no uh the ...\nWars bomb on the on the walls or we'll do the non\n... no\n...\nNo ...\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\nCalled the ... men are making a deal that good a non\nOn me so\nTo walk around the block a gun on the job\nIn China and a man from the outside\nNames I\nA new song orange red over\nAnd brings them but they and they have no ...\nReally very\nThe ...\nKnew who they say you know what I'm saying ...\nMan has to me no\n... ...\nRajan Menon ... the\nThe town she reminds bomb music playing in\nNew way to the new\nNot doing it so\nThat no one gets\n... and it's and it's done\nAnd you know\nIdea why\n\n\nYou\n\n\n\n\n\n\n\n\n\n\n\nBall ball\nGive me the breadwinners right down\n[noise] [noise]\n[noise] but I\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise] [noise] [noise]\n[noise]\n[noise] [noise] [noise]\n... ... ...\n... ... ... ... ... ...\n... ... ... ... ... ... ... ... ... ... ... you know ...\n... ... ... ...\n...\n... ... ...\n...\n...\n... ... ... ... ... ... ... you don't hear a\n...\n... ... ... ... ...\nOr ...\nWhole new world leaders do [noise]\nWhat I mean\n[noise]\nThe movie was ... years\nWhile longer than\n... ... ... ... ...\n... oh really no need\nTo know the names are doing [noise]\nMm well well\n... ... ... ... ... ... ...\n... ... ... ... and you know [noise] ... ...\nMm\nMy ...\n...\n...\n...\n\nAnd you're listening to eighty point five different radio [laughter] [noise]\n[noise]\n\n[noise] [noise]\nI'm\n\n[noise] nah\nLaid a\nHand and he was\nHe\n\nIn love\n\n\n\n\n\n\n\nThe man ball\nDie\nNa na\nNa\nNa\nNa\n...\n... ... ...\n...\nYeah so\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\nMm\nThan ...\nThe ...\nThe ... the\nSome ... ...\n... will do\nThe ... in the journal job to do is change the\nThere's a lack of ...\nSit and spin\nAnd then\n...\nJourney this another the train was little\nTrain the soup and on to the news a\n\nA little bit\n... and\n\nIdiot by about ... ... are you are ... Rochester online at W. R. U. R. dot org\nBut we are you are in the broadcast partnership with the University of Rochester WXXI by public broadcasting Michael Black with you until three when how your slang or hit the world can bay\nShe's got rave among teen on this morning looking forward to that let's start off with music from al ... and do we know now we know that she and yeah the sentimental hardened for radio W are your ...\n\nWhat is that he\nDidn't\nKnow\nHow like in\n\nWas na\n\nNa\nToo there was no more years then\nHe\nDidn't know who\nJust like keep\n\n\n\n\nNa na na\nNa na\n\n\n\nAnd I\n... ...\n...\nTo home\nDue to since she\nKnew that John do you know when you\nTo the kids know that is so cool so let me just on state do you\n[noise]\n\n... that's ... bought titled tractors two thousand Seventeen album my morning jacket from the beach or you Grateful Dead from built the last ... heart and she had him from volume one sentimental\nHere's Courtney Barnett this has all been gardener indifferent radio W are you are\n[noise]\nAgain then they then\nWe can and men and\nI Know\nAgain on Indiana oh\nI've been to God and\nAnd I do some green men\nHand shaky\nCon changes and I'm a\nSupport for W. argue our digital media comes from our members\nFrom capital ... a small batch come boots your brewery located on railroad straight were fermentation meets labor like ginger beat and more open to the public on Saturdays from tended to growl are available to go on line at cat ... dot com\nReally [noise]\nNah\n\n[noise]\n[noise]\n\n[noise] so\nCan join\nThe\nHow much they no regrets but\nDon't come during\n\n\nI'm really not so which is\nA ... I'm On a good girl girl those jobs are\nPang\nNa na na na na na\nNa ... which is\nA bomb on a good girl goes the strong job ... ...\nOn\n\nMm Mm\nMm [noise]\nOh how ... she'll go go do you\nYou know single genes drink one or the\n\n... the mayor\n... do well we may be\nOn all the way\nThey are the way the\n...\nThey they are the way\nWe William ...\nThey [noise] [noise] [noise] [noise]\n[laughter]\n... there were maybe ... ...\nYou know this whole man on the\n... ... ... ... [laughter]\nThen hopefully\nThe way they in a way\nThat we will grow\n[noise] [noise] [noise] [noise]\nMm Mm Mm\nMhm [noise] mhm [noise]\nAnd I am\nMom is ... ... S C I Belong to the point to die in bed\nWith oh then then the ...\nMid may\nWell be yeah and all the rain\nMan a\nCould have been ah Shay can\nTurn around my common na na na young when jobs\nYou live in\nYou know you know\nYou must be a\nSome rain down\nSo yeah back\n... and ...\nShaky na\nNa na na ...\nAnd then on the job of\nA man named\nDum de man and made a ...\nBeen doing those bonds and then and\nThen the thing I did get in and out on\nNa na na\n...\n... ...\nMy ...\nMy ... na\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\nShe used to\nShe didn't know\n\nI Am\nShe just didn't seem\nA\nN shakes\nAnd\n[noise]\nBaltimore you or\nI don't know what I'm going on the line ...\n...\n\n\nThat July tango here the ball and that causes that our first hour this morning here on eighty five FM Gillian Welsh before that\nPermit Bible an orphan girl at the actually a song that she wrote that sounded like was the classic I'm also featured in many different artists covers\nCrosby unnatural window on the water and that of the last the whale and critical mass and went on the water here on eighty five ... W are you are\nWe going to our second hour this morning and if that many point five that we are you are ... Rochester online at W. R. U. R. dot org Michael Black with you on this Friday morning until three when we have the world can't say what's wrong with the print long\nAnd this was a really huge hit kind of a damaged her as an artist from the album I Do not want what I haven't got this issue NATO counter nothing compares to you on the radio W are you are [noise]\n\n\nThey go on I can\n\nThe\n\nNo [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNa\nIf you're a ban on gay my baby\nHe me I didn't know\nThem did the ban on new\nNews mhm\nNot going on Oh yes they did to me down\nMaybe I'll run into you well\nTo get back yard\n\nWe on bridges that is better man from coming home you're on the radio\nFor label another sorted love song Derek in the dominoes and keep on girl one wild love it yeah and a church love that song like he likes to John Sherwood judges ... starting all we are nothing compared to you\nYou get to work this is in the state at any point five W are you are and\n\nBig here in the last ...\nWe got\n\nHas\n\n\n[noise] [noise]\n\n\n\n\n\nAnd I don't\nKnow [laughter]\n[laughter]\n\nYeah [laughter]\n\n[laughter]\n\n[laughter]\n[noise]\n[laughter]\n\n[noise]\n[laughter] [noise]\n[noise] [noise]\n\n\n[noise] Mm\nThem and you know\nGive me a job\nAnd actually\n\nI Know\nThat is the law\nDay a\nDay\n\n\nThe\nDay\n\nDay\nThat\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNa na na na na na na na\nNa na na\nNa\n\nNa na na na na na\nNa na na na\nNa na\nNa na na na na na\n[laughter]\nAh\nNo [laughter]\n[noise]\n[noise]\nMaybe\n[noise]\nEnron\nYou do and [noise] and [noise] why do\nWork at a job\nThey do\nThey go\nGetting involved because we\nI think that we need to be in\nLike your job\nSeems\nMoving in the in the ... the\nMondale right now and a\nThey got that no\nWe we go to a baseball\nYou know ... ... ... ... which one way\nThat to me when ...\n...\nAnd ... ... did you go to the beach\nThat all of them so you've been you know\n...\n... for the\n\n... says oh\nUse it to me in the dead\nYeah and that's the big\nToo I mean\nYou know when that just ... when do those things the\nMore the way you really need the ... oh\n[noise]\nUm [noise]\n\n\n\n[noise] want\nDo it now and I'm\nDoubt no\nManufacturing jobs about said dad\nThe water\nHuge I'm not a\nBomb\n[noise]\nNow and it and you know\nThe moody blues causing out are stuck in our this morning with west Gen that's from Nineteen Seventy the question of balance cheers for fears this is from their album hurting and pale shelter and the art\nOut of my mind from yours dreaming like here in eighty five FM W are you are ... Rochester online at W. R. U. R. dot org ... radio\nAs we get into our two o'clock hour here on double you are you are Michael Black with you or another sixty minutes or so when the world cafe comes away with telly slang or let's start off with cold play this is from X and y and talking to her radio W are you are\n[noise]\n\n[noise]\n\n[noise]\n[noise] nah\nI ...\nI Try\nNa\n\nNa\nNa\nNa\nNa\nGang style that out in ... in\nOr\nOh man that gym bag a banker me batty\nThan I Do and I\nBigger town I'm a bad day\nFor me to [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise] the\nMusic of Tom Waits from swordfish trombone than sixteen shell syrup thirty six going back to Nineteen eighty one here on that we are you are steely Dan before that from Nineteen Seventy five eighty lied in Black Friday and Paul from cold place starting all the our\nNext and that we are you are from what went down here is all those melt when my gate on that point five different radio\n\nHe came in\n\n\n... leaving a\nThe\nThe job was to mom they need to be drawn\n\n\nSee\n\n\nThe\n[noise] um\n[noise]\nChange people do do you\nDo a ...\n...\nUm and they know the new map we're seeing the the ...\nBut you know go actually go\nAnd no bill\n... to\nRoom just try to\nBut how many now the wrong way I'm not a bad actors\nThat you know I get back to me that Bush and the\nGuy and she and she and she had in my dreams [noise]\n... and ...\n[noise] it would be the ... that you know\nI Can't do that and she\nShe didn't know that much you know I'm sure\nAre many jobs do\nMeet Janis shot I\nGot a game it would be the case you know I get mad at them but that the only\nShe [noise] and\nThe guy and she\nAnd\n\nShe said she [noise] you know\nIn there and you know I think\nThat that\nMay be ... no ... we ...\nKnow they know the ... you may have been a while to\nKnow\n...\n... ... ... ...\nThe\nHave been made\nThe ... you will um\n...\nBe broken hearted and boy you will have\nTo give me a great way to do about the long road again hobby\nIt you know people can you can do can you can hardly be new\nWorld I mean those freedoms knock on\nYou can go and\nThere and saying you\nThe black guy live at\n\nNo ...\n\nHuge you\nAnd and that and say hey you know\nName legend\nAnd not\nOnly do\nOh\nMan\nMe feel\n\nThe pain of\n\n\n\nSay\nHere we are now\n\nAnd\nThat I mean I'm sure I Am I'm not going to\nAsk for\nCan you do not\nHave a\nOr I don't\n\nThe American\n\nDown by you\n\nDo that\nI don't know I don't\n\nRight here\n... [noise]\nThat ... that is love song from an album the same thing that came out about ten years ago from what I'm\nHoping launcher career and boy she has been on fire lately not only singing in acting on Broadway and doing some other things but uh just the fact that she's actually written the way that if it weren't for Hamilton probably would have won\nThe actual Tony Award for the year for waitress David Wax museum before that born with a broken heart for everything they Moby with honey from playing bears Dan titled truck to read and pouring rain\nRecord Nineteen eighty particularly the mid eighties or you read the ... sweet dreams are made up to the radio W are you are\nThe ones who do not know that\nWe\nDid we have a job all the way we now know Google's no they don't know how long do you do you do not ban on my you know they want\nDo do you know all day long to be a\n\nReal games on the navy and\nMy job I don't know the average looking man\n\n\n\nI don't\nKnow\n\nKnow how long how long\nHave a ban\nOn all day and one\nThing after a long time we knew\n[noise] oh\nNa na na na na na na ve and then saying\nNo you don't know I have read de dum\n\n\n\nDe la ...\nYeah the la di di di di", "year": "2018", "show_name": "The Difference", "city": "Rochester", "day": "05"}