{"month": "10", "state": "MN", "station": "KZSE", "content": "Programming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nAnd a cycle of constant breaking news we're here to break that news down and get to the heart of the matter\nThis election is to make ... make a new NPR News discovering what matters\nThe twin cities forecast calling for mostly cloudy skies not as silly as last night a low right around forty two degrees southerly wins\nFive to ten miles an hour and we're all cloudy with the chance for rain in the morning Rene becomes more likely by afternoon back into the low fifties for a high on Thursday and then tomorrow night a continued\nGood chance for rain and Fridays still some showers\nExpected around the metro area with a high and low fifties once again\nServices more about the foundation at ... dot com [noise]\nSupported by Charles Schwab Charles Schwab believes in asking questions and being engaged Charles Schwab on your tomorrow learned more ... dot com it's hard\nI Know but please do ignore all those down arrows on Wall street today and consider instead\nThe housing markets maybe data privacy and what a tire company has to do with good food\nFrom American public media\nThis is marketplace [noise]\n\nSupported science identity investments taking a personalized approach to helping clients grow preserve and manage their wealth learned more infidelity dot com slash ... finality brokerage services and they'll see ... online test prep for the ACC SAT\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org purchases\nOr debt consolidation figure dot com [noise]\nIn Los Angeles I'm ... resolve it is Wednesday today the twenty fourth day of October get is always to have your long everybody we will give them\n... of ... a glance perhaps to the market events of this Wednesday yes it was ugly in equities as far as the down the U.S and the five hundred are concerned whatever the gains they made from New Year's Day yesterday might as well never have existed both of those indices are negative for the year but\nTwo things one that is what markets do people they go down to also there is something more structural that we wanted to talk to you about new home sales fell five and a half percent last month\nThat's according numbers out from the Commerce Department this morning a sluggish and is not seen in two years also sales of existing homes or their slowest in nearly three years\nSo with prices going up and interest rates going up as well we asked marketplace adjusting to talk to some home buyers about how they are navigating the biggest purchases most Americans ever make\nBrowsing through online real estate listings in Brooklyn Molly shorts realized or five hundred thousand dollar budget for a new place wasn't giving her a lot of options\nUnless you have a ton of money to spend there's not a lot out there\nHigh home prices are by no means only in New York thing prices are high economists say because even Tories are low and that means competition for the homes that are on the market is fears Alison ... house hunting in Duluth, Minnesota in a realtor has been sending your updates twice a week\nWe've like that's far maybe an exception of one or two houses is you know off the last within a couple of days\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org\nCastro has been watching interest rates rise since last year back in February he decided it was time to put a down payment on a new home that hadn't been do yet\nI'm I'm like man we'd better do something and lock it in and I I didn't know we'd have to wait and to get a closing date to lock it and\nHe still has enclosed lock in a mortgage rate because the house still isn't finished and he's nervously watching his interest rates rise even more in New York I'm Justin how for marketplace\nThe technology news of this Wednesday comes to us from Cupertino, California by a big data privacy conference in Brussels, Belgium Apple CEO Tim Cook did not hold a whole lot back today blasting and think about this for him and\nHis colleagues in Silicon valley as and this is a quote a data industrial complex selling and profiting from your private information and mine cook even call for federal data privacy regulations in this country which has audience in data privacy friendly Europe applauded\nOne is obliged to ask though why cook decided to speak up now and also not for nothing because it is a business\nWhat's in this whole thing for Apple from Washington marketplaces Scott song has that one\nTim Cook said our data are being\nWeaponized against us with military efficiency\nThe warning comes at a convenient time for Apple Facebook and Google face embarrassing data breaches for the phone maker can say we're different we don't sell data we want rules to protect it that's a venture capitalist gene monster loop ventures sees it\nIt's a great branding opportunity for Apple really ... themselves ... among the big tech companies and that they make money off selling it invite\nA device rather than your digital secrets in mind but not all their money Google\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nAfter cook spoke Google and Facebook execs endorsed us rules on data privacy but good luck industry get ahead of regulators and help shape what the rules will be Molly ... teaches law at the University of Connecticut\nCompanies do want to have a seat at the table and voice for them to wait and tired of it is I think is probably becoming less and less viable\nRegulators are coming fast new privacy rules in Europe impose defines on tech companies that don't comply and now California allows users to sue companies after a data breach I'm Scott Tong for marketplace\nWe're told you a month or so ago I think that somebody formerly known as Dunkin' Donuts would henceforth drop the doughnuts and work on building a brand as a beverage first company\nWe learned today that Duncan is going to be ruined lattes and kept you knows in America and those edits Ninety two hundred stores by the holidays so from W E s a in Pittsburgh march blizzard bearish has the pivot to call the\nSecond franchises a path to put in a lot of work in the company's ... the fancier coffee Dunkin' already makes espresso drinks but makes opponents have to train employees at forty nine Duncan restaurants in the Pittsburgh area to blend drinks since the milk with news with his breath on machines\nIt hasn't been as difficult as it would seem and mainly because for the most part we're just really changing a couple of steps in the process\nEarlier this year the company invested a hundred million dollars into its business much of that on improving espresso drinks that Scott Murphy chief operating officer at Duncan and I'd say are franchisees for actually investing even more than that number hockey already accounts for more than fifty percent of sales at some Dunkin' location\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nDunkin' prepares to take on Starbucks step one was dropping the word donuts from its name that Peter boat right at Carnegie Mellon\nThey're still gonna sell donuts but this allows them to emphasize a new direction for a new era\nDuncan has a lot of room to grow it required it eight hundred and sixty million dollars in sales last year last Starbucks reported twenty two billion I'm Erika ... for marketplace\nOn Wall street today which seems very very far from those bombs and bomb scares on the east coast it was bad but let me say this again it was normal we'll have details one would do the numbers [noise]\nThis is as we mentioned the other day the most expensive midterm election in every five billion dollars give or take in a record amount of that record amount is going to political advertising we're going to seat depending on where you live I guess but\nWe're gonna see sixty percent more ads and then we did in the two thousand fourteen midterms and with election day almost upon us one issue is soaking up a huge chunk of that airtime\nHealthcare specifically the fate of Obamacare and protections for people with preexisting conditions marketplaces Kimberly Adams has that one\nWith just Thirteen Days until the election anywhere there's a close race you're probably going to be hearing a lot of this\nLike three hundred thousand North Dakota and he has a preexisting condition that's why I'm taking on both parties and fighting for those with preexisting conditions\nNorth Dakota California in West Virginia\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nAnti intercom a business messaging platform for automating sales and marketing tasks theater ...\nQualifies leads and schedules demos with them automatically for more than twenty five thousand businesses more at ... dot com [noise]\nSupport comes from sales force sales force essential is a C. R. M. tool built for small businesses and start ups learn more about sales force essential that sales force dot com slash essential programming\nAnd supported by Robbins caplin L L P for eighty years helping clients cut through complexity get to the heart of the problem and rewrite their odds in high stakes litigation Robbins caplin dot com each day brings new challenges that affect\nUs all intents divide over how welcoming Minnesota should be the people from other countries\nThey need to get to the heart of the matter indignant could allow insurance companies to bring back lifetime limits to get you the facts and be an hour and a seven\nOut of ten people will answer pollsters questions support allowing people to buy into government programs they don't qualify for\nThis election season tune in to make the issues makes sense NPR News discovering what matters\nIs six Twenty one of the daily comes originated six thirty cloudy and fifty two degrees and the twin cities this is\nMarketplace I'm ... result running a small business\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot\nOrg to learn more supplies and rented insurance continued rise but a pilot project in New England is helping some of those small businesses work together to minimize cost and maximize their services are young reports now from WB you are in Boston\nGretchen roll down runs a small nonprofit daycare center in Somerville, Massachusetts just outside of Boston\nShe travels a lot here at the Elizabeth Peabody house from reading preschoolers to making sure a troublesome roof is holding up on a rainy day\nAll kinds of water damage all they're\nEven more important keeping certified early childhood caregivers on staff\nAnd Massachusetts about thirty percent of employees in this industry leave their jobs every year mostly because of pay which is only about fourteen dollars an hour on average in the state\nBut Melania sorrow who works with preschoolers at the Elizabeth ... says hey isn't the only thing that matters I feel like I'm In this for the long haul sorrow has been caring for children at this day care for four years so I mean it's hard but again it's very rewarding to see them take what you you teach them\nThis daycare runs on tight margins and roll down says it's hard to stay competitive with pay\nWe you know barely make it so anything that could help us in the expenses side of things it's really helpful\nOfficials in Massachusetts are hoping a new pilot program could help roll down squeeze a little more room into her budget by making the supplies and services she needs like a recent roof repair a little more affordable than India\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nConfined discounted rate for everything from office supplies to accounting services basically the program treats the Elizabeth Peabody house and eleven other daycare providers like one big purchasing group that means more business for participating vendors\nFor almost a year in and we will continue to grow and expand it\nWe shared services model is still in the pilots stage in Massachusetts but in neighboring New Hampshire these purchasing groups are now common with more than two hundred participating providers\nIt costs the state about a half a million dollars a year to run the program it saves daycare providers five to ten thousand dollars a year and ... says most have been using that money to invest in their workers\nThey are using them um to stabilize salary is to be able to provide raises offer them discounts in savings\nPaying workers so they stay on longer saves money on hiring and training Marcy white book because with the center for the study of childcare employment at the University of California Berkeley she says daycares nationwide or trying everything from housing stipends to tuition reimbursement to retain staff\nThe strategy have been filled by it was a hole in the bottom of it but we haven't really restructured have these programs work\nSince the childcare sector is mostly private keeping fees competitive doesn't leave much room for increasing worker pay which is problematic because someone with similar credentials can make about twice as much working in a public school\nDo need to figure out how to transform the way we finance this for now\nProgramming and supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot\nOrg to learn more of this program you've probably heard a segment that we do called I've always wondered questions from you none too small\nAnswers from us about the everyday economy today we're launching I've always wondered video series and one of the questions we tackle first is how did a tire company become to go to guide for fine dining\nMichelin and it starts to get the answer well honestly you've got to go to YouTube page but here's a little taste if you will from celebrity chef ... the founder of the Los Angeles Michelin star restaurant patina on the economics of those Michelin stars\n[noise] started procedures and the restaurant business to get raided by the mission guy with a Michelin star and helps you get more recognized [noise]\nHe opens the door for appearances it opens the door for having a second restaurant or certain restaurants but there's a quote un as excess and there's a financial success [noise] one stars one star so there's no pressure\nWhen you two or three star chef you become a slave of your own business\nYou have to constantly investing to direct strong\nYour staff level is high you have a ... I have a million dollars in ... in the wine cellar you won't make any money so you work for the ... to have three stars\nLots of chefs in Europe they gave their stores up because they feel it's too much pressure on them and on the restaurant and on this stuff and financial [noise] I think a lot of\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nToday if I Would actually three stars will give them up [noise]\n\nWhile acknowledging that video killed the radio star as I said we've got a new video version of this series I've always wondered on her YouTube channel we are at marketplace a PM subscribe while you're there [noise]\n\nIt's fun to do it on the way out today in which if you listen to real hard you can probably hear Tesla CEO Elon Musk breathing a huge sigh of relief but also to be clear\nCredit where credit's due Tesla reported profits today at a schedule actually in the freezer looking for is huge upside surprises the company reported more than three hundred million dollars in profit in its third quarter the most it's ever made almost all of it attributed to doubling production of that critical model three today and he's been having so many problems with [noise]\nCrank turban handcrafted and small batches for a full flavored sipping experience forty seven percent alcohol by volume allies you Craig Kentucky straight bourbon whiskey barge town Kentucky thinks wisely drink wisely\nAnd buy for X. dot com for X. dot com is committed to empowering and helping traders seize opportunities and the foreign exchange market learned boring for X. dot com for X. dot com it's your world trading for\nExtracting involves significant risk of laws anti personnel Capitol you can download the personal capital apt to help you plan for retirement and see all your\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nAnd your nearest chosen DARPA mentality engineer the broadcast forests I'm tired rebel we'll see tomorrow but [noise]\nThis is APO marketplaces supported by Bremmer wealth management offering clients centered wealth planning Asset Management and trust services to help clients reached financial goals visit Bremmer dot com to learn more Bremmer wealth management for what's ahead\nAnd it's a sense of safety from the Mexican authorities themselves the Mexican government was deported somewhere around Seventy thousand people this year so people have a reason to be afraid that they could be deported if they're caught and there's a sense that was something this big\nIt would look really bad if the government tried to crack down so most people in the caravan has\nDecided not to apply for papers or try to do this in a legal way and they're just moving forward with a sense and and the hope that they'll be allowed to make it all the way to the United states\nNow this happened earlier this year in the spring another caravan made its way north it was only Fifteen hundred people some two hundred actually manage to get in the U.S and that ... attracted attention because of the president's reaction because of President Trump's reaction\nRight I remember those yeah he he called them invaders um sent the national guard so many people are making a comparison to that first ... van in the spring but oddly a lot of the people who are migrating right now say that they haven't even heard of that earlier caring\nMan from what you're saying this is not unique\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward we it's time to talk forums on race YWCA M. P. L. S. dot org\nWhy they're making this journey northward toward the U.S\nSome of the surprises have been the number of you know mothers with small children\nI mean\nThe number of strollers along the way so we have so he ended up\nBeing I mean it's hard to imagine how you would decide that it was worth it to take a three month old on something like that that's the youngest child I met was three months old and\nI was I knew him in and then when I knew that there\nHad to or a year old and there are lots of toddlers\nAnd for the most part people say that the children are actually not an impediment\nTo\nBut they're the reason that they're going on but\nShe says she she actually wouldn't\nNot had the baby because she said well I never left before she says you know being a single mother and not having\nOffer her child you know part of the reason that she joined the care of in\nTheir elderly people you know a man with the crutches\nEntire extended family\nYou know might as well do they say [noise]\nWas a hard look at where we can do\nIt would be hard to put a number on it but it's easy to say that half of the group for more are young and that makes sense they're able bodied back and when you're going through\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nIt's very hard to pull those two things apart and then there are groups that face grave danger\nOf getting somebody said by the way I'd met for people today and now this group is carrying I'm a gay pride aside\nWhen I'm On data they love the niche was gay and he said he\nGay men and a trans woman who had left El Salvador and high tailed it to the border to try to join the caravan they're facing discrimination in their country to discern and fills\nThe trans woman said that she was told that if she went through with the operation that\nThey would cut off her breath so as one man told me if you stick around long enough you're going to find everything in this group\nThe basketball court where some of the migrants last Monday Night is\nRight and that's the river on\nMigrants have been climbing up to us how it leads to the river [noise]\nDebate this morning [noise]\nYou don't get my finances is down there but I'll walk then he got out once he won the selling your life at all I Know are doing what I Do think\nSo I met this man who told me his name was than he'd been walking for twenty days I met him as we walk down to the river is going to banning and he told me that he had two daughters him in the best\nProgramming is supported by why WC Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nEat for gay would get get aid in sick when I say ... photos\nOf the wounds that little ... he says his limping and he says that one of his seat is not doing well but he's not going to stop and rest because he wants to keep going with the caravan because he feels safe for instance there's safety in numbers [noise] um and the and then there are so many of them\nAnd now that were and what does in his mind what happens when he reaches us and how does this change of circumstances\nSo the majority of people I've interviewed feel that it's always hard to get across the border and this will just make it easier for them to get through Mexico and get to the border I don't think they're thinking necessarily about what's going to happen when they arrive\nBut he's clearly has it in his head the but something good happens or else he wouldn't be taking this journey\nYes I think people really do feel that this caravan has given them hoped that they may actually make it I think having crossed the border into Mexico and not having been\nSuccessfully turned back to ... and then being given food and water and use clothes and really being welcome here has given them the whole\nAs unrealistic as it might seem that the same thing might happen when they reach the U.S a lot of people are drawing that comparison saying you know we made it across the border into Mexico we can make it across the border into the U.S\n\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nOffering beds that adjusts on each side for ideal comfort the newest beds I designed to automatically adjust to keep you know sleeping comfortably all night you can find a sleep number ... near you sleep number dot com\nAnd by dabble a meal perhaps service delivering fresh made dinner kids that are table ready and Fifteen minutes with just one pan gobbled as other prep work so you spend less time shopping and more time with family learned more gobbled dot com slash daily\nPrograming supported by center point energy services with over a century of experience in business energy needs including consulting strategy and pricing information at Central point energy dot com slash energy services\n[noise] and Jonathan Capehart politics is your favorite reality show or if you're just trying to keep up with this rapid pace of the mid term elections we've got you covered\nJoined me every Monday through Thursday for America on the line alive news in college show will have the latest political news analysis and your calls on the issues that will matter most to you when you cast your ballot\nAmerica on the line a national conversation [noise]\nProbably that's what I did seven on NPR News ... empty\nThe world which you could hear on friday it is now six forty eight forty six degrees in Rochester and St Cloud forty seven in Duluth fifty two and fog of war head of the twin cities guys are mostly cloudy and the temperature is fifty one degrees\n[noise]\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot\nOrg to learn more has been reporting on a group of Central American migrants traveling through Mexico yesterday was an interesting\nTurning point morale is high in ... after people were able to get into Mexico and they had done this long march from ... to ... the first leg of the trip and things went relatively well\nAnd then it was the second leg of their Mexican journey\n... two weeks and they all set out with a lot of energy and there are piling into truck walking and there was a young man Twenty one years old and then when he was on a truck which I gather was quite crowded ... and he fell off the back", "year": "2018", "show_name": "Marketplace", "city": "Rochester", "day": "24"}