{"month": "10", "state": "NY", "station": "WAMC", "content": "Streaming support for WAMC come from Berkshire orthopedic associates an affiliate of perks or health systems providing orthopedic services in the Berkshires including ... robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nYou out yeah you personally you personalize it and internalize it but this is not about you or me it's about WAMC about like a programming nobody wants to make me cry right I'm I ... I don't know you well and there might be somebody who does yeah\nI got a I got a few enemies but uh I Hope they're not listening\nWanting to make money currently listeners are my main one\nAnd I know they'll call in they'll make that flight feel helpless\nWrap up this ... wanting a hundred and ... seconds to thirty five seconds thirty five seconds to make three thousand dollars\nYou know what a hundred and thirty three Ninety six do if the if it comes in on the phone that up when we go to the idea and the new cat that will count and we'll get the challenge of course not gonna happen\nHundred and three ... three Nineteen sixty or online at WAMC that or thinking to anonymous relate them for helping us trying to reach the challenge eight hundred three two three Ninety sixty were online at WAMC dot or one\nEight hundred three two three nine to ... to her online at WAMC dot O. R. G. and we are out of time now\nThis is Northeast Public radio WAMC up ... points we Albany W. R. UNH the Ninety\nPoint three rooms in Utica there'll be ... point nine kings them somebody one was sorry the only one seven Middletown WC EL HD Ninety One nine plans for W ... Ninety three three Kevin Harry ...\nWAMC wage do you want to find one great Barrington W W E S H the eighty eight nine months ... go it'll be ... Ninety point one Stanford W ANR eighty eight by\nBrewster WAMC am fourteen hundred Albany\nLive from NPR News in Washington I'm jak sphere six days after hurricane Michael hit parts of the Florida Panhandle are still without electricity or drinkable water NPR's Quil Lawrence reports many are still missing after the storm\nHundreds of people are still living in shelters thousands or starting the painstaking process of trying to file insurance claims or hire contractors or get assistance from FEMA\nWhile the search for survivors is over poor phone and Internet service has made it difficult for people to let their loved ones no they're okay in the devastated town of Mexico beach it's still not clear how many of about two hundred people who stayed through the storm might not have survived\nEleven thousand military personnel and their families evacuated from ten to air force base which took a direct hit they're still waiting for permission to get back to their homes on the base Quil Lawrence NPR News Miramar Beach Florida\nPresident Donald Trump is denying he ever offered a million dollars to a charity over choice for Senator Elizabeth Warren to take a DNA test to prove whether she had Native American ancestors\nHe said exactly that this past summer to rally in Montana worn widely expected to run as a twenty twenty presidential candidate today released results of a DNA test binding quote strong evidence she is Native Americans in her family tree\nDrop as long taunted Warren calling her Pocahontas during the campaign wanted a message on Twitter today requested the money go to a Native American women's group\nThe archdiocese of Washington DC is released a list of twenty eight priests credibly accused of sexual abuse over the past Seventy years NPR's Tom Gjelten says the move comes just four days after Pope Francis accepted the resignation of the Washington archbishop cardinal Donald Wuerl\nNotice accompanying the release of the list the archdiocese set of came from a review of its archives ordered by cardinal Wuerl in twenty Seventeen list was drawn up according\nSupport for streaming on WAMC comes from the Davis financial group providing the base financial planning and wealth management services to individuals families and business owners and the pioneer valley and beyond Davis financial G. R. P. dot com\nIs either removed from the ministry arrested or die before his case was fully pursued\nThe archdiocese has not opened his files to law enforcement as victim advocates have called for the survivors network noticed snap dismissed the move as quote a hastily assembled PR stunt Tom Gjelten NPR News Washington\nPaul Allen who cofounded Microsoft with his childhood friend Bill Gates has died down and reported to have died from complications from non Hodgkin's lymphoma in Seattle just weeks after announcing he'd restarted treatment a decade after first battling the disease\nAvid sports fan Elena owned the Portland TrailBlazers and the Seattle Seahawks he also gave more than two billion to a wide range of philanthropic interests\nBill Gates in a statement said today I'm heartbroken by the passing of water my oldest and dearest friends\nPaul Allen was sixty five years old\nStocks close lower today the Dow down eighty nine points to the NASDAQ votes sixty six points yes and he was down sixteen points today this is NPR\nA pair of senators on the Senate intelligence committee or is urging Canada to block a Chinese company for being included and Canada's five gee mobile network development and goes barbers front has more senators Marco\nRubio of Florida and Mark Warner of Virginia penned a letter of warning to Canadian Prime minister Justin Trudeau thing there are significant danger that would come from allowing the telecom giant Huawei to get involved in candidate five gee development\nTheir letter comes after the head of the comedians Center for cyber security said it was unnecessary to ban the company\nThe U.S lawmakers say there's evidence to suggest that no major Chinese company is independent of the Chinese government they fear that including Wally would expose Canada and its allies including the United states to security risks\nThey suggest that candidate reach out to the U.S intelligence community for more information on his national security threat by a best friend ... Washington\nItems given to colonel Harlan Sanders driver and friend will be auctioned off next month including one of the Kentucky Fried chicken founders trademark white suits and matching Stetson hats or message options of Dallas says that Dick Miller's missed the last decade of Sanders life working for him and stayed on after his death in Nineteen eighty\n... says he wants to sell the memorabilia so someone who can appreciate it also included in the collection driver's license credit cards and inscribed belt buckle in a wrist watch\nNow known as KFC the chicken chain was founded in Nineteen fifty two bystanders who died during the great or rather during the great depression sold fried chicken from his roadside restaurant\nIn Kentucky I'm jak spear NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include T I Am a CIA is committed to helping those who are driven by purpose reach their definition of success\nInvesting advice banking retirement learn more AT T I Am a dot org\nOne hundred and three two three Ninety six to her online at WAMC dot O. R. G. one eight hundred three two three nine to fix to I'm Sara Lee do I'm Jim ... and your\n[noise] your hair flying Italy they got it right [laughter]\nBeen on phones or they were eating we haven't you know what I'm going to change that finally\nI prompted them at the right time finally I stopped messing up we've got to get back on driver of them [laughter] what a hundred and three two three nine to sixty were online at WAMC dot O. R. G.\nSupport for streaming on WAMC comes from the Davis financial group providing fee based financial planning and wealth management services to individuals families and business owners and the pioneer valley and beyond Davis financial G. R. P. dot com or challenge okay [noise]\nI Hope the good news uh mitigate that the good news medicate okay good news is that anonymous from Albany New York said I can I liked that moxie I can tell you guys are trying\nYou can have until nine\nAnd then anonymous or mold and bridge said if you make that challenge you get to seven hundred and fifty thousand dollars by nine o'clock tonight\nI Will give you twelve hundred and fifty dollars more to tip it over little make you look even better for the big bosses in the morning okay when Alan and raise sit down and sex we want to look good yeah\nI've always so help us one eight hundred three two three Ninety six to that means we need to raise just over three thousand dollars by nine o'clock okay then we get one thousand dollar challenge that gets us to seven fifty and then we\nWish it up even that much more ... anonymous remote and bridge is donating\nOne thousand two hundred and fifty dollars to the station if we can do this so that you found nothing to sneeze at\nThree thousand dollars in an hour logistically is no problem we have enough people here to take pledges we have enough phone lines up\nWe have the Web or the Web site is up and running the to the technology is ready to go mhm so if you want to make a pledge and close it up there should be no problems\nIf you go off without a hitch however is one major part as one factor that we haven't considered that ah causes a lot of these slow down and that is we need to hear from you\nAnd if you're not calling we're never going to make you know so that's what we need we need to get you on a phone\nMake that call talk to one of her volunteers\nAnd make your pledge that we can make that three thousand dollars close up tonight and have a you know be able to go home\nRelatively happy yeah satisfied in a job well done yeah\nAnd uh I guess is pretty close to the end of the fund drive absolutely about as close as we wanted to get tonight the three quarter mark but we can't do it without you and if you want to push us over that mark\nNow is a great time to call one eight hundred three two three nine to sixty or online at WAMC downward make your pledge help us together as we have two ... two thousand two hundred and fifty dollars\nOr you can get a pat passes to a museum sure those are great perks but this isn't a shop you're not buying those things those are just are thank you gift because the real reason that you give is because you believe in the station\nOr if you listen to the station you know generally we liked to assume and uh I don't think we're wrong to do so that you\nShare some kind of ideology with us and that is that\nThis news coverage these a performance programs the music um and ... just interesting information that you can derive from the station is important and deserves a place where it can be accessed freely by all people in the area and indeed worldwide\nWith our online access now thank you to the Internet absolutely it's a wonderful thing now if you think I'm not important sometimes um you know that's something that you\nHave in common with ... you know that's why we work here that's the project that we think is important that we've chosen to dedicate our careers to\nOne eight hundred and three two three nine two things to her online at WAMC dot O. R. G. we have just under forty minutes to try to raise two thousand four hundred and forty three dollars through your pledges\nIn any increment available within your budget one eight hundred three two three nine to six to or online at WAMC dot O. R. G. then anonymous in Albany is going to give us a thousand dollars to get us to the seven hundred and fifty thousand dollars raised point in the entire drive\nAnd then anonymous and molding bridge is going to give us\nTwelve fifty like dominoes when I was you know one eight hundred three two three nine to six to less we lose track of how marvelous today has been\nYeah it's it's easy to get down with the negativity of tonight but overall it's been amazing and a lot of\nFantastic people have called up in ... um it's not like we're we have been alone alone in the dark and title and the everyone hurtful I might have been less people but we did with lots of challenge we're trying not to emphasize the negative\nBut ended up buddy [laughter] thank you\nWon a hundred and thirty two three Ninety six to her online at WAMC dot O. R. G.\nThe lock box all told the lock box goes from one from what it is open until on race that down at six o'clock in the morning\nStreaming support for WAMC comes from Tom ... woods to warmth in homes and businesses throughout the northeast today's self stoking automated would heat would boilers dot com\nThe lock box had five hundred and forty two thousand nine hundred Fifteen dollars and it when we started so that's a good start we are currently at seven hundred and forty five thousand nine hundred and Seventeen dollars that's a lot of money so much money which ... which equal support which equals\nOn the propping up from everybody out there who lessons one eight hundred three two three nine to stick to it is it is crass and and potentially an for to talk about money as much as we do but you have to kind of get used to it to make this thing work right you know\nYou I'm trying to talk about your finances at the dinner table but we we get on the radio and say\nCall and give us your money but you know that we [noise]\nIt it is it is dollars and cents it is currency but it does also so much more than that to be able to bring you the programs that I produce the gyms works on finding and and supporting the underwriters structure\nUm we need to hear from you we can't do it without you the underwriting does a lot up gives us a lot of our operating budget but the fund drives give us a lot also\nAnd I don't remember the division but it's a it's maybe like half and half about equal yeah okay so so without the fund drive more not here\nYeah it's a three it's a it's a a three legged stool and I can't stand without one of its like the third being grams okay [laughter] I was like I was like don't worry don't worry the metaphor works [laughter] no bread we\nWe run into some metaphor problems earlier but I think this one's All right\nThe first one was great yeah it just took us a while to get their vehicle turned our strong suit [laughter] you\nKnow I don't know how they work one\nHundred and three ... three nine to six or online at WAMC dot O. R. G.\nThirty seven minutes about to reach that goal we really would hope to\nHope to hear from you eight hundred three two three nine to six to one eight hundred three two three nine to six to her online at WAMC dot ORG we're going to think of these people now absolutely 'cause we we um [noise] it is a very tricky balance like you have to stay positive and be thankful yeah as your failing yes [laughter]\nFor everything you know all all of you who have life so far tonight you have made a huge difference absolute and or if we make that goal you're the difference that you've made will be magnified by that\nSo if you know somebody else who has been a kind of on the fence of it it's a nice time to just see it say nudge nudge there is a challenge going on right now might be a good time to jumping\nRight you could hop on social media if you know that you have fellow listeners who are on there if you if you shared WAMC articles on your your Facebook page or whatever thing you could say it's fun drive I pledged\nHid\nUnder three ... three Ninety six or online at WAMC dot org\nThings to Thomas Kelvin of Amsterdam New Yorker pledged on line and WAMC dot O. R. G. that very same Internet we just mentioned social media live what a cool breeze and ruins and all of it and none of it thank you to Jeffries that'd be available Massachusetts and Jamie join them Glanville New York\nThanks also to Valerie members Massachusetts loved WAMC love Alan and all the volunteers thanks to Dorothy upgrade Barrington Massachusetts I appreciate the station we're from anonymous and run back who loves afro pop worldwide the book show local news and the night cruise thank you\nI'm On behalf of James and in and sort of me and saying you would not have been from ultimate New York and to Nancy bearer of Amherst, Massachusetts thanks to the volunteers for taking call tonight in the thank you\nMuch for the volunteer very cool yeah we're we're so grateful\nStreaming support for WAMC come from Berkeley Center for weight loss surgery with a focus on life skills and support for a long term success with we've district to me in gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nBut I'm Glad it there for those that do enjoy that's what I always say I love that because there are a lot of people who you know the opera is one of those things that is I guess when you hear people talking about the opera the first thing that you come to your mind is like it's an acquired taste is not for everybody not everybody loves it\nBut there's a lot of people who listen to WAMC who say operas not my thing [noise] but I think it deserves to have a place and I were out to important and I think it's great that you said exactly that thank you so much anonymous Greenwich New York who says I always listen to the weather and I'm Glad you get to hear thanks so much on them is\nA and a James version of north Adams and Lou I'm running out of space over here move your one hundred I I Know the food is good\nI don't know how to make choices I'm James version of north Adams, Massachusetts fled says only fund drive I enjoy listening listening to hey even now good you'd say that and thank you and you know what that's a lot of commitment because he says I enjoy listening to the ... and he's still help us and it so that's you know I mean it's yeah\nI Know what it's all that it is a new oil and you know it I Will say it's probably not nearly as fun to listen to if the phones are ringing so basically\nThere and you're headed we've got amped up we have thirty three and a half\nMinutes to raise I don't know how much about two thousand I say ... ... yeah twenty five hundred bucks just about yeah little bit less one eight hundred three two three Ninety six to one eight hundred three two three nine to six to fill in front of volunteers we have just had another ...\nIf you will but several are still here and they are ready willing able capable\nSavvy super sweet folks and they want to talk to you one eight hundred three two three Ninety six to they want to help you want to facilitate your pledge facilitate your donation to WAMC to supporting what we usually do here\nYeah your when you when you called us support us you are not here saying I Love the hundred years of my money I mean some people some people say that many people do and that's fine but there's a reason that we only do it three times a year that's not what the station is it's\nA labor that we have to go through three times a year to keep the station or why ... what do you know you don't dislike doing it or I don't personally I like sitting down here I like hearing from people and I like seeing all the volunteers and of course with all the food but\nThe real reason that I what's your what's your favorite part and putting here though uh I get to sit across from just a delightful person ... who is just a great guy\nOh and Sarah ... of course\nWe always have fine [laughter] should we joke which to 'em [laughter]\nSo um yeah you know we're we're here this this is just a procedure that we do three times a year to keep the rest of the station alive year round because that's the stuff that we really believe in that we think needs a place and that we're trying to keep on air for years and years to come\nAnd if you agree with that ideology if you want to get back to regularly scheduled programing if you want to listen to mountain stage tonight vice you still got some of that but there's you know what if you were tuning in expecting normal programming and you're not hearing it bomber\nBut there's something you can do and it's very important yeah we we need to hear from you we need to get in those pledges in to make our goal\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including may go robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nTo Iraq or online at WAMC dot O. R. G. one eight hundred three two three nine to six to or online at WAMC dot or gee we had a couple of volunteers on phones and now we have none once again the volunteers are\nYou know we ask a lot of you yes plenty wait a minute wage Twenty one minute but um if you want us to still be here that's also a big ass\nAnd uh so if you think that's important make that pledge\nUm we can ej ask something of each other and uh you know that's a healthy relationship wanting a hundred and three ... three Ninety six you\nMake that pledge now keep the station here for years and years and years it takes two minutes of your time and um you'll feel really good about it afterwards instant gratification one hundred and three two three Ninety six you were online at W. A. M. C. dot\nOne eight hundred and three two three nine to six to her online at WAMC dot O. R. G. we have just about twenty minutes one eight hundred three two three nine to sixty left to make these two challenges these very generous people have offered to give us one thousand dollars\nThat will get us to these seven hundred fifty thousand dollar pointing to drive if we raise the rest of what we need to get us within one\nStreaming support for WAMC come from virtually Center for weight loss surgery with a focus on life skills and support for a long term success with we've district to me and gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nAnd then re when they show up in the morning one eight hundred three two three nine to six to think you to Martin in Maryland from Chatham we love the station appreciate hearing the pod cast for things we miss great you too as a person who upload I have I Do have an Internet\nSemester on Tuesdays and Thursdays does the Web the Web postings for me but the rest of the time so Monday Wednesday friday and when I don't have an intern the roundtable segments got online set is one of my job I Do that so when I Know that people have listened to them I Am glad because it does take a bunch of time\nYou get people who like maybe can't listen at that time but they still want to hear it so that's a huge help and then also nice option if I hear something on a roundtable that I Love\nAnd I'm like I got to share that with a friend you can WAMC dot org and do it and if you like having that future you know that's another thing that you know your donation goes to\nUm keeping our Web presence on line I'm paying for the salaries of people who you know you spend a lot of time every day doing that like you were saying yep and um and you know all those things have costs and that's in yet another service that we want to provide\n'em that we just to ask you to help out to pitch in for wanting a hundred and three two three Ninety six\nEighteen minutes forty seconds thank you to anonymous of Cornwall bill New York who called up we also heard from Linda O'Donnell of meta Morris, Pennsylvania we heard from anonymous uh soccer his New Yorkers as I like the program and even the upper great thank you to Frank print ski of water really New York I'm Glad the station is here at the time I\nThink you and thank you to David in Tom uh these trials of New York eight hundred three two three nine to six to her online at WAMC dot ORG one eight hundred three two three nine to six to that was a lovely little flurry but most of the volunteers are blankly staring right at my face again\nAnd I want them to stop it they'll give us a call one eight hundred three two three nine to its really piercing [laughter]\nIt can be and then when I when I called them out on it they'll smiled not lovely but the before the smile there's disappointment there's simmering rage yeah\nThey came here on their night there evening they spent with us and all they want to do is talk on the phone they're kind of weirdly addicted [laughter] they'll give them a call ... hundred and three two three nine to six to er WAMC dot O. R. G. don't mess it up anti\nHundreds three two three nine to six to second feed has its perks I the the other way [laughter]\nI don't get psyched out oh we heard from a Carolyn ... town\nOf a South Hampton Massachusetts thank you very very much getting them out real a blanket which is awesome like it very cozy ... you know that's been a theme ... things hoodie hunker blanket crank prank radios kind of\nUm we also heard from and foster of Poughkeepsie\nSays I Love the station uh I've lived all over the country and have not heard a better stations that is very sweet and and really really wonderful and gratifying to hear thank you\nWon a hundred and three two three nine to six to we have a pledge from online Mary camera in Rome New York said thank you for your clearer signal in the ... area of Iraq and and for your interesting programming even your fundraising is interesting lively impassioned and persuasive thank you Mary that's generous\nThrough to there's a kind of democratization of what I don't like is happening at low you're ... you're listening earlier [laughter]\nHundred where do we are trying yeah\nSupport for streaming on WAMC comes from the Davis financial group providing fee based financial planning and wealth management services to individuals families and business owners and the pioneer valley and beyond Davis financial G. R. P. dot com\nIt's like a one eight hundred three two thirty nine and six to or online at WAMC dot O. R. G. we have one volunteer in a phone now and we would like\nEverybody else to take a couple of more calls and the next Seventeen minutes before we go and I think it was actually one eight hundred three two three nine to six to will take one more little underwriting break and then come back or even to the Bush right\nThrough support for WAMC comes from Ferris coin and jewelry Nineteen and when I say this every time one Ninety nine wolf wrote Albany New York I'm Mr Right from the beginning\nFares quite and jewelry one Ninety nine wolf wrote Albany New York since Nineteen thirty featuring estate inventions jewelry diamond engagement rings\nAnd wedding band loose diamonds with certificates color gemstone first coin dot com the CNN companies celebrating their fiftieth anniversary and looking ahead to the Next Fifty years planning designing construction and maintaining the built and natural environment C. S. C. O. S. dot com [noise]\nThe ... Subaru Hadley, Massachusetts a new and use humor dealer certainly the pioneer valley Hartford in Springfield\nOffering new super is plus used cars trucks and SUVs you assume route dot com [noise] New York state cheapen wall festival at the duchess county fairgrounds rind back sheep wool and fiber artists book signings foods October twenty twenty first such as fair dot com\nCommunity advocates for sustainable energy and presenting the renewable energy and sustainable living there Saturday October twentieth from ten to four I don't steward school\nFor more information stopped and why pipeline dot org Paul Smith college the College of the Adirondacks offering degrees in entrepreneurial business environmental science coterie art hospitality recreation and more\nExperiential education with hands on academics Paul Smith dot edu inquiring minds bookstore in Newport and sovereignty is probably independent with books vinyl CDs fair trade coffee and tea is a place to unplug rediscover community and conversation\nInquiring books dot com\nSo Napoli insurance agency and Greek bearings in Massachusetts offering financial products including life insurance and annuities information available at four when three five to eight one Seventy one zero twenty railroad public has great Barrington Massachusetts seemingly inspired pubs there now offering traditional wood fired near politician pizza\nCatering menu and ours twenty railroad dot com\nBubble or schools Saratoga Springs giving children the education and tools for the challenges of an average in the world while there are Saratoga dot org\nChance gallery Stockbridge featuring the works over fifty internationally known artist working glass including Belgium who we\nChance galleries dot com jak Miller contractors full service general contractor building and renovating homes in the pictures in southern Vermont traditional craftsmanship and applied building science more information that jak Miller contractors dot com [noise]\nThe high collection and art museum and historic house in Glen falls New York open Tuesday through Saturday tend to five and Sunday twelve to five hide collection dot org\nThe spotty dog books in El Hudson an independent bookstore with twelve beers on top in a historic firehouse\nArt supplies for all skill levels trivia night music and other events ... dot com the preservation league of New York state protecting the Erie Canal legacy and it's teaching tug earlier position available online\nSore pass as a future preserve and why ask dot org Thirteen minutes drills jewelers three teen Delaware avenue del mar featuring American handmade jewelry and gift where costume jewelry designs engagement rings estate jewelry insurance appraisals and in house and you will repair specialist\nJoyous jewelers dot com\nStreaming support for WAMC come from Berkeley Center for weight loss surgery with a focus on life skills and support for a long term success with we've district to me in gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nHow we Massachusetts a new and used Subaru dealer certain defining valley Hartford in Springfield avenue Z ruthless used cars trucks SUVs ... dot com one\nEight hundred and three two three nine to six to one eight hundred three two three nine Tuesday to her online at WAMC dot O. R. G. we have a goal to make\nIt to the seven hundred and fifty thousand dollar point in the drive by nine o'clock which is twelve minutes from now hopefully one\nDay a hundred and three two three nine to six to or online at WAMC dot O. R. G. one eight hundred three two three nine to six to\nFrom inside the room that's how things are going to the phones are ringing off\nOur pledge hunter and hunter is Tom and Kathy Leonard Nassau New York you guys have definitely been coming here longer than I've worked here right how long\n[noise] Twenty years that's dedication two decades to zero why do you do it [noise] they love this oh well we got okay so again to things can be true it once\nTom said insanity and catty because we love the station\n[laughter] both overthrew will come into the night crew so instead of the ... [laughter] they may have jobs [laughter]\nCome during the day they work jobs gene now now what are you hungry and self deprecating hunting under three two three nine to sixty or online at WAMC dot O. R. G. well thank you for being\nHere [noise] they like hanging out with Wanda [noise] the other ... the rest of the volunteer yes and then whoever we're no Wanda", "year": "2018", "show_name": "Alternative Radio", "city": "Albany", "day": "16"}