{"month": "10", "state": "AZ", "station": "KOFA", "content": "We also bought gets on the Arizona community radio network at eighty nine point five FM kj ... Williams Ninety point one F. M. K. U. E. press get Ninety point stepping up from kj ... came in and make one point three ... watched that\nSunny skies today in Yuma hide your Ninety degrees partly cloudy skies in the evening with the Loeb around sixty seven twenty percent chance of showers throughout the day in Kingman today mostly sunny skies a hundred Seventy seven and a bit breezy out they're mostly cutting in the evening all over around fifty eight slight chance of showers in Prescott today mostly sunny hind you're Seventy\n... in the evening about twenty miles per hour wind gusts with ... guys willow run forty six slight chance of showers in ... partly sunny hide your sixty in the evening mostly cloudy hello around thirty nine\n\nPut money into a little bit of everything here about radio Thirteen twenty and where we can get oatmeal and never got can come up with a little bit of that I Am ... and ... and this is across the ocean by new empire [noise]\n\nCreation\n\n[noise]\n\nNo no no I'm a ...\nDay man\nMean did did I don't want to\n\nBerlin to piss\nThe top ...\nNo I didn't know they they\nAre\nAbout it in the news business ran\nThe numbers did not\nI'm praying on Amazon made you made you a\n\nThe\nKnow how it feels like no no well\nWe ran in ...\n\n\nMan\nOh ha ha\nThem in my mind\nFEMA we bring the dog and you\nYeah I mean one\nWay or the journey with any\nI Know we didn't know Jeremy I'm too young\nI mean in a dream in\nThe\n\n\n\nThink you're listening to morning radio Thirteen twenty am in human and border radio easy don't work we've been in service to Arizona west in college for more than forty five years\nToday's border radio days sponsors the gamble families celebrating the sixty eighth birthday a rock and Roll Hall of fame and duck the Tom Petty it's hard to believe it's been over a year since it was Tom time to move on to a room at the top even though for them he will live forever the gambles would give anything for one more day one more night\n[noise] [noise] a brochure first produced by the Arizona highway department in Nineteen twenty five Arizona highway devolved into one of the most respected and Roberto publications in the world\nJoined K. A. W. sea and retired Arizona highways publisher when holding at the next spirited discussion to learn the story of this remarkable magazine Wednesday November seventh from five thirty to seven at St Paul's cultural burn formation does it K. A. W. C. dot org this has been made possible in part by a grant from Arizona humanities\nYou to keep it to you to be all that down to watch it on and do what you're gonna do I tell you about fashion so I used to keep\n\n\nDon't start write a song Jim what is\nAnd that may not be\nGoing on and then start right at the graduate is\nThat that may not have to keep an\n\n\n[noise]\n\nThat you've done that it go walk into the show got the journey there'll be there'll be ... I'm In a whole lot better thing then you let it go\n\n\nBy my laundry maverick drain on\nWait wait wait wait wait wait don't know I Know what\n[noise]\n\n\nThe ... I think they didn't know\nThe bean\nBeing made to the Taliban and he was asked but maybe by ... be the best time to do that I Want to be other you know I had a\nYeah I thought oh my God can you do it all they've got a new they stay in battle matter Steve\nI'm sick in the\nOther\nBut if we go\nHe said oh that would be\nTo be not dreams patrolling the living\nI've got\nUm second knocking on your way\nWe go\nPay off but I don't I Can't hear you on the\nThere and it up to try to stand\nSpeed up the\nTo get up there but they are in the\nIn Missouri and go\nTo the parents\nNot\nA\nNo stranger to\nNo\n\n\n\n\n\n[noise]\n\n\nThe way we now know well they don't all day long do you do\nWho do not ban on gay and you know I\nNot want to know them on the\n\nGames on the movie and you don't\nReally know\nWe don't\nLaw bam on\n\nNo\nI mean\nRead gene I'm the\nMom\n\nAnd she will give\nMan I'm going\n\nBe a\n\nGood\nMan [noise]\n\n[noise]\nYou're you're bored or radio surging ... am on the radio FX so Donald will be up and started and select gave us Stay\nYour favorite station your support for border radio helps power that unique radio station bringing your local artists from across Arizona and the software as well as Native American and Latin voices were not like any other station on the dial that is why you listen and we hope that's why you support pleased donated eight seven\nNative American and Latin voices were not like any other station on the dog that is why you listen and we hope that's why you support pleased donated eight seven seven eight three five to nine to or on line that border radio is the dog or\nTwenty percent chance of showers throughout the day in Kingman today they'll be sunny out on your Seventy seven mostly quality in the evening a low around fifty eight foot chance of showers debating press good mostly sunny a high you're Seventy review in the evening about twenty miles per hour window with mostly cloudy skies in the lower around forty six\nIn Flagstaff a slight chance of showers partly sunny and you're sixty\nMostly cloudy with low around thirty nine in the evening\nAnd you would see son he's got the high end you're Ninety degrees part of the club in the evening hello around sixty seven\n\n\nMean I don't know\nNa na na na na\nNa na na na na na na na na na na na\nNa na na na na na I'm\nBeen dragging me back up going that\nRoute time and again I oh\n\nI Know\nI Do\nIn your day to\nDay\nMan I\nKnow my way as a young\nMy hands de de can say oh man what\nWay way\nGot one boy you know the common than they did talk to fill out a lot more harder\nEvery time and again I mean it's been\nA\nGoing to be here today to\nDe de de\nDe la ... way way way\nI mean I can say", "show_name": "Putumayo World Music Hour", "year": "2018", "city": "Yuma", "day": "20"}