{"month": "10", "state": "AZ", "station": "KOFA", "content": "We also broadcasts an Arizona community radio network in eighty nine point five FM cage you see a drink Williams Ninety One F. M. K. J. C. P. prince get Ninety point seven F. M. K. J. C. K. king meant in Ninety One point three offense like staff\nSunny skies today in Kingman highs reaching up to eighty three leader in the northeast ones around six miles per hour blowing into the evening with clear skies with love around fifty five\nIn Prescott sunny skies today high switching up to Seventy six mostly clear in the evening with the love around forty six and a light variable wind in Flagstaff sunny skies hide your Seventy with a cold winter throughout the day most of the clear in the evening with the love around thirty eight and you must sunny skies hydrogen up to Ninety five mostly clearing the evening with a low of around sixty six\n\nGood money into a little bit of everything here better radiate Thirteen twenty am where we bring you all the new and never forgot to music combined with a little bit of I I Am and I'm listening and this is the fact that market team that [noise]\n[noise]\nOf know from the ah [noise]\n\n[noise]\n[laughter]\nEverything and they have to you and your and your ... and in the short term\nMaybe they get into that and make sure she started to notice\n[laughter] so while\nWell\nI\nStore\n[noise]\n[noise]\n\n[noise]\n\nDown and said that there will be\nLack I never want to go\nA problem they might go away\nThe bottom and then the law I Know I don't\nGone but have you back but\nI don't want to do\nHill or\nMy da da da\n\nDa da da da da\nKnow the ... and ... why bother and then I found that out and do\nBetter than me and I love going\nNot go up and lock my\nDamn I'm not trying\nTown of about\nA\nUh\nThat I don't want a spa rather than going\nA half hour and I God\nGathered around\nThe\nBuilding was surveys are still willing to go to the point you don't need to be\nThe\nMost of the shows bottle so most people in the ...\nGoing to be\nSomeone who was doing the building you\nKnow we don't need to be in the\n... to ... to ... you\nKnow if you ... even\nThough the bully those who do\nThe ... the ...\nDa da da da da da da da da da da da da da da\nDa da da da\nDa da da da\nDa\nDa da da da da da da da da da\nDa da da da da da da\nDa da da da da\nNa\nNa\nNa\nNa\nNa\nHey\nMe\nThe need to do the new the new the new the new the new the new the new the new the new the new ...\nI'm Alone alone [noise]\n\n\n[noise] you weren't you to board radio searching twenty am in Yuma and border radio easy dot org we also broadcast on the Arizona community radio network\nYour support for border radio helps the power this unique radio station bringing you blues jazz rock oldies in so much more border radio isn't like any other station on the dial that's why you listen and we hope that's why you support\nPlease donate now at age seven seven eight three eight five to nine to or online at border radio ... dot org\nSunny skies in human today hydrogen up to Ninety five they called north east wind blowing throughout the day with most of the clear skies in the evening and the low around sixty six in Kingman sunny skies ties reaching up to eighty three and northeast when I'm Around six miles per hour blowing into the evening it was clear skies no up around fifty five\nAnd ... guys hind you're Seventy six mostly in the evening alone around forty six with some light variable wins in Flagstaff sunny skies behind you're Seventy today mostly in the evening with the lower around thirty eight\n... general manager of border radio makes the contributors to called or don't either online during our recent pledge drive to sport noncommercial music and student mission is on the station\nWe're always encouraged to hear from our listeners that you value our community service so thank you very much for your support [noise]\nWhen you grow\nMan\n[noise]\n[noise]\n[noise]\n\nAnd\n\nWhat is what is the way I mean what is going to bars so you know what it is the ... mine but ... says Bob assigned to the ...\nThe ...\nHas to be a ship and know gosh if there was\n...\nBusy all the time and we were\nThe ... the ... ...\nDegree no does you know why but you know ... ... thing you do\nDo we know dies you get in a while but now you know the thing is you eat a a\nTwo\nLane says ... scotch and why does\n...\nAs soon as they try\n[noise]\nSo I still think you know God Knows what can you think you know I'm so high you know I'm Still ...\nYou know to me I'm dumb man bullies do it to be wildly\nLong and a young young dumb down Don Young Don Young young young dumb and\nYoung guys who [noise]\n[noise] [noise]\n[noise]", "show_name": "Putumayo World Music Hour", "year": "2018", "city": "Yuma", "day": "27"}