{"month": "10", "state": "CA", "station": "KEIB", "content": "And then\n... says ... I'd be Los Angeles and dreaming audio at patriot data LA's preempted due to sports programming ... will resume streaming audio at the conclusion of the game\nAnd the best is ... I'd be Los Angeles streaming audio and patriot John LA's preempted due to sports programming\nGE I'd be evil resume streaming audio at the conclusion of the game from\nBen this case the I'd be Los Angeles streaming audio patriot dot L. A. preempted Judah sports programming Kiki id will resume streaming audio at the conclusion of the game\n\nBans is K. E. I'd be Los Angeles dreaming audio patriot dot LA's preempted due to sports programming\nK E R B will resume streaming audio at the conclusion of the game best is Kate I'd be in Los Angeles streaming audio and patriots donnelley's preempted due to sports programming K E R B will resume streaming audio at the conclusion of the game\n... best is K. E. R. I. B. Los Angeles I'm streaming audio patriot dot L. A. preempted due to sports programming\nKiki id will resume streaming audio and the conclusion of the game has this ... I'd be in Los Angeles streaming audio expatriate dot LA's preempted to to sports programming\nKatie id evil resumes streaming audio at the conclusion of the game [noise] best is Kay eat I be Los Angeles streaming audio at patriot Donna LA's preemptive due to sports programming\n... id will resume streaming audio at the conclusion of the game\nIn this case I'd be Los Angeles streaming audio patriot dot L. A. is preempted due to forge programming Katie id will resume streaming audio at the conclusion of the game\n\nBest is K. E. I'd be Los Angeles dreaming audio at patriot dot LA's preemptive pseudo sports programming Kiki id will resume streaming audio at the conclusion of the game basses case I'd be Los Angeles\nAnd streaming audio patriot dot L. A. preempted due to sports programming\nK E R B will resume streaming audio at the conclusion of the game the fans is Kay eat I'd be Los Angeles streaming audio patriot dot L. A. is freedom to do the sports programming he id will resume streaming audio and different closing of the game\nFor the\nBest is K. E. I. B. Los Angeles streaming audio and patriot donnelley's preempted due to sports programming\nShaky IBM evil resumes streaming audio at the conclusion of the game for best is Kay eat I'd be Los Angeles streaming audio at patriot dot LA's preemptive due to sports programming geeky id will resume streaming audio at the conclusion of the game\nFast is K. E. I'd be Los Angeles streaming audio patriots dot alleging preempted due to sports programming geeky id will resume streaming audio at the conclusion of the game\nPasses K. E. I. V. Los Angeles streaming audio at patriot dot LA's preempted due to sports programming kinky id will resume streaming audio at the conclusion of the game\nIs K. E. I. B. Los Angeles streaming audio at patriot dot L. A. preempted sports programming he id will resume streaming audio at the conclusion of the game\n... I'd be Los Angeles streaming audio patriot LA's preempted due to sports programming ski I be evil resumes streaming audio at the conclusion of the game\nThe\n... I'd be Los Angeles streaming audio and patriots LA's preempted do the sports programming geeky I'd be evil resumes streaming audio at the conclusion of the game and passes K. E. I. B.\nLos Angeles streaming audio at patriot Nadal a preemptive do the sports programming Kiki I be evil resumes streaming audio at the conclusion of the game [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWell when you consider\nAs I said earlier as I was talking with some of my staff and and other people I work with I said you know if you just dig into the twilight language just becomes very appropriate as we're getting closer to Halloween and it's hard to explain this as I said if you get an inkling\nAnd ... and you're not you can't be honest totally with people about it you can be for you you ... you can say well yeah this is what is happening but then you tell them what this could be something that is diabolical\nAnd it's something that could be a curse if it's something that could be this and this because all of the paranormal points are being\nConnected all the dots in the paranormal in the in the paranoia or you\nCan adopt that are happening to the puzzle pieces are coming together to patterns are showing themselves\nAnd I know that many of you\nHave picked up on my subtle hints such as references to the numbers like nine and eleven talking about plagues pedestal one's biological terror\nIt'd be evil up the Julian Assange so brilliantly describes is being put everywhere for the surveillance apparatus\nBut I Know some of you have not been lost on any and all\nOf the metaphors the beams would name drops the word drops the you know there's this there's a metaphor home at a Ford is not lost on any of you in the toilet languages have been used not only by me but by the media\nNow twilight language for those of you but don't know what language is the language of symbols numbers and he didn't sign posts all these things that points to a supernatural paranormal explanation as to why\nThings happen in the world strange things Julian things things that don't make sense to you and trust me the next few days things are not going to make much sense jeep especially those who are completely\nEnsconced in the cabinet or Ford saga okay ... and many of you know me\nAnd you know maybe you listen to me all these years understand that I see the world in patterns I'm a person who wants to detect symbolic language and\nSymbolic actions and numbers and all these things that runners the mind waiting for a kind of secretive city to unfold you understand what I'm trying to say\nI mean when you share this type of speaking with people they're not always receptive and tend to think that you're prone to magical thinking and this is what you can can you can't say everything until it's more evidence you know most prophecy most\nThat are paranormal or I actually talked about attribute back I'm jumping on it now just so you know how my mind is going and how\nHe's doing just back\nIn those who are in power\nThose were making the decisions those who are saying this is this and that is that our grading the division of the people creating such an anger such a division\nBut who knows what comes next [noise] the only one who truly does\nIs the confidence strict stir the confidence church do we know what the devil in those shortage employ Tripoli six seven three thirty seven hundred Tripoli six over three thirty seven hundred I'm quite Louis used to be ground zero and we'll be back [noise]\nFox News I'm Carmen Robert Democrats [noise] I've been trying\nTo destroy judge Brett Kavanaugh\nPresident Trump that's a stage in Rochester, Minnesota for his latest matter rally and all he blasted Democrats are posing Kavanaugh's nomination he did not mention wonky person\nNotably there was no mention by the president of Dr Christine Blasey Ford won a judge Brett Kavanaugh's accuser ... he received the blowback from members of his own party en beyond went on Tuesday night at a rally in Mississippi he appeared to mock sports memory at the alleged highschool assault\nFox has a ... in Rochester the Senate takes up a key procedural that friday and expected to vote on the confirmation this weekend thousands of house keepers cooks and other workers that Mary Shelley ended hotels go on strike in San Francisco and Jose after\nMonths of negotiations for better pay Fox News\nOr traffic on the Patriot am eleven\nWhich I was tapping into these in part time span Tony racket stadium Wayne mapping thing that that last ... remains bought for clean out catheters just crawling along coming away some Colorado strain of work done in my cat and designers [noise]\nFor your show [laughter] [noise]\n\n\nAwesome awesome\nOf those [noise] so we got\nAll the way to describe well there are a lot of ways tribe in one way to describe I actually wouldn't we usually have a Jack\nAll us find\nThe parent can provide [noise]\nCars on awesome block day Saturday Night [noise]\nWhy they're tracking what you've done\n\nYour head all Muslims\nOne Lorraine structural balance along shipping so long and pains bars harmless prison [noise]\nSpiders column\nBelieve their weddings inside our brains most men [noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\nI'm quite Louis [noise] you are listening to ground zero [noise]\nSo they write the arch of bail in Washington DC just the day before the cabin I hear it [noise] now you wonder why there's so much chaos so much anger is so much darkness the male is a demon or a lord of\nThe air associated with rubber worshipping ritual\nA derivative of bill is bills about which is\nWill suffer or bike was for another common name for state in the hills above means literally lord of the flies but suggested that the spelling is a derogatory play on the name ... which means lord a pipe places or the exalted one\nBill is also known to the AMA nights as ... like the more bites new image ... and the ... as do shower\nMales female counterpart is Astrid or start Jay or Easter or Ishtar and of course this is where we get the fertility symbols the rabbit the egg I mean all of these that identify with the planet Venus which of course is the bright morning star in the bright morning star again we\nConnect to supersede ancient times adults would gather around the altar of bail\nAnd inputs would then be burned alive as a sacrificial offering to the ... it was the bail was the corn bull God and it had arms that held the child and then there was a fire that was built a defeat they would pull the arms and they would drop the child into the into the fire\nAnd made horrific screams the stench of charge human flesh men and women alike would engage in bisexual orgies but the ... of the horn God\nThe ritual convenience was intended to produce economic prosperity by prompting bail to bring rain for the fragility of Mother Earth many secret society that called groups that state of its someday\nBill will be resurrected or the spirit of bill will be resurrected will once again to take his place as the ruler of the world\nChristian scholars are entirely convinced that there is some sort of connection between the ancient demon bail in the coming of the anti Christ now drunk every passenger scripture whether it's\nMuslim scripture Jewish Christian there's a story about an empire they will appear to serve God but in reality will be an economical trap\nOr state religion is called the this is called the new world order the beast system and Christians believe that if the empire of the anti Christ and we know the story so well but it's almost like it's programmed into our DNA it it it it's obviously a response\nWhenever we years something they'd even smacks of apocalyptic uh talk I mean what was it just a few weeks ago\nWe were talking about the red pepper property we were talking about the building of the third jump all I mean all of these\nThings seem to be coming together I mean can you see this coming together or am I just like losing my mind because you know we have a rabbi on the show a hip hop Begley on the show we have another people commenting on all this\nAnd we're asking ourselves well somebody wanting to nudge the war between God and the devil in the future is this is this some sort of eschatology on a charade or play or some melodramatic played that they want to play out there that the revelation of the Methodist what is going on I mean we're wired for this right\nAnd show to regular observers but don't know anything about the background of the arch\nWhich say well what's the big deal when I say well look at the coincidence", "year": "2018", "show_name": "Ground Zero with Clyde Lewis", "city": "Los Angeles", "day": "05"}