{"month": "10", "state": "CA", "station": "KEIB", "content": "And the best\nIs K. E. I. B. and Los Angeles streaming audio at patriot dot LA's preempt into the sports programming\n... I'd be evil resumes streaming audio at the conclusion of the game for best is Kay eat I'd be in Los Angeles streaming audio patriot LA's preempted due to sports programming geeky id will resume streaming audio at the conclusion of the game\nFast is Katie I'd be Los Angeles dreaming audio patriot dot allies preempted due to sports programming E R B will resume streaming audio at the conclusion of the game\nPasses K. E. I. V. Los Angeles streaming audio at patriot dot LA's preempted due to sports programming\nKinky id will resume streaming audio at the conclusion of the game\nThe best is ... I'd be Los Angeles streaming audio at patriot dot LA's preempted due to sports programming ... I'd be will resume streaming audio at the conclusion of the game\n... I'd be Los Angeles streaming audio patriot dot L. A. is reinstitute a sports programming ... I'd be evil resumes streaming audio at the conclusion of the game and\n\nThen there's ... I'd be Los Angeles is streaming audio and patriot dot LA's preempted do the sports programming geeky IBM evil resumes streaming audio at the conclusion of the game and passes K. E. I. B.\nLos Angeles streaming audio patriot LA's preempted do the sports programming\nKiki id will resume streaming audio at the conclusion of the game [noise] basses K. E. I. B. Los Angeles streaming audio at patriot dot LA's preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game [noise]\n[noise] [noise] the\nBest is Kate I'd be Los Angeles and streaming audio and patriot dot L. A. is preempted due to sports programming ... I'd be will resume streaming audio at the conclusion of the game\n... I'd be Los Angeles streaming audio and patriot dot LA's preempted due to sports programming from the id will resume streaming audio at the conclusion of the game the best is Katie id Los Angeles streaming audio and patriot dot L. A. preempted due to sports programming\nGeeky id will resume streaming audio at the conclusion of the game in this case I'd be Los Angeles streaming audio patriot Donna LA's preempted do the sports programming ... id will resume streaming audio at the conclusion of the game\nPasses K. E. I. B. Los Angeles streaming audio and patriot John Elway he's preempted due to sports programming eat I be evil resumes streaming audio at the conclusion of the game\n... K. E. IP Los Angeles and streaming audio and patriot dot L. A. is preempt into the sports programming can you be evil resumes streaming audio at the conclusion of the game in\nThis case I'd be Los Angeles streaming audio at patriot dot LA's preempted due to sports programming\nGE id will resume streaming audio with the conclusion of the game [noise] band is Kay eat I'd be Los Angeles dreaming audio it patriot dot L. A. is preempted due to sports programming\nKatie id will resume streaming audio at the conclusion of the game in this case I'd be Los Angeles streaming audio and patriot dot LA's preempted Judah sports programming\nKiki id will resume streaming audio at the conclusion of the game will [noise]\nFans is Kay eat I'd be from Los Angeles streaming audio patriot dot L. A. is preemptive due to sports programming GE id will resume streaming audio at the conclusion of the game\nIs K. E. I. B. Los Angeles streaming audio and patriot dot L. A. is preempted due to sports programming GE id will resume streaming audio at the conclusion of the game\n...\nK eat I'd be Los Angeles streaming audio at patriot dot LA's preempted due to sports programming Kiki id will resume streaming audio at the conclusion of the game\nIn this case I'd be Los Angeles streaming audio it Patriot's LA's preempted due to sports programming for GE id will resume streaming audio at the conclusion of the game\nIs Kay eat I'd be sauce Angela streaming audio patriot dot L. A. is preemptive due to sports programming for GE id will resume streaming audio at the conclusion of the game\nAnd bend is Katie I'd be in Los Angeles and streaming audio patriot dot LA's preempted due to sports programming\nK E R B will resume streaming audio at the conclusion of the game\n... I'd be Los Angeles dreaming audio and patriots LA's preempted do sports programming kinky id will resume streaming audio at the conclusion of the game\nThe fans is K. E. I'd be Los Angeles dreaming audio patriot John LA's preempted due to sports programming\nKiki id evil resumes streaming audio at the conclusion of the game\nAnd the\nBad news K. E. IP Los Angeles streaming audio and Adrian ... preempted due to sports programming kinky id will resume streaming audio at the conclusion of the game\nIs Kay eat I be Los Angeles streaming audio patriot dot LA's preempted do the sports programming\nCan't eat I'd be evil resume streaming audio at the conclusion of the game [noise] man says Kate I be Los Angeles streaming audio patriot dot L. A. is preempted\nDue to sports programming independently ... vehicle resumes reading audio and their conclusion on the kind of money to come more easily back this idea that one of those ... be a new law now as to their credit reading audio at patriot died I\nGuess the ... on the conclusion of the game was obviously ... Angela but it was three me audio patriotic LA's preempted during the day they're usually I only evil resumes dream and I don't want to lighten up the game\nBut I did a waiver you might be in Los Angeles one mil dreaming audio ... LA's really due to the board the programming one on one level\nResumes streaming audio what they're going to loosen up the game take a moment myself was ... I'd be 'cause ... let me driving audio editing Adrian dot L. A. as preempted due to more its programming\nKiki I'd be able to resume streaming audio emitted inclusion of All right I'm going to be afraid I ... I'd be Los Angeles\nStreaming audio an honor to LA for him on the border ... dreaming audio conclusion ... that ... and John LA's ... program\nHere that you can go over the highest dreaming oil mousse game boy your conversation\nIs way one state I be ... to like a tree in LA ...\nOwner you ought to conclusion of the\nHotels are practically conversation about you as white ... I'd be ... category dreaming audio and check out yet not LA's ... joy ... value it actually losing them if you have no censorship no agenda ever ... today on the angel\nAnd I was reading on I ... do the sport I programming ... be will resume streaming\nKnowledgeable rape or cry when did it become OK for men to be lazier softer fatter we need to bring the better this country back to greatness that it's easier than ever with aids list male Macs a patent pending formula with an agreement that helps boost your total testosterone\nPromoting greater increases muscles size and twice the reduction of body fat percentage that exercise alone plus an amazing sixty four percent increase in nitric oxide\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\nThe use of screens as mayor has soared terrifying attractions in one\nLocation designed to ski a lot of\nVotes the choice to LA I have four year old ...\nAnd she was there for me and ah she did everything she could to support me so I wanted to pull my resource Stewart team to support her and so that's why\nI'm a fourth of July I came to the office night put together a go from me page for her\nAnd if you've been to the Facebook page you see the Janine is there and I tell the story as to why and how we came to this and\nThe general support that has already been pouring in for Janine he's amazing and I'm so thankful and grateful and Janine even since her love and thanks for all of the prayers and all of the support and ah we do have a goal but we're going to try and see if we can surpass that goal\nBecause that would give us more incentive to at least get some more things in check that she can use to get better quickly um and and what we're doing is we're we're ... we're literally having to plan\nKind of ... kind of been a two month way or how to get around all the things\nWe need to do financially to get out of the situation we're in and we're still of course paying on my medical bills from my cancer skill or because of mine was a little more extensive hers is of course we can cover now because of the fact that you know over time\nYou know you're able to beat financial goals but we were coming up short so I wanted to ask\nAnyone out there if you could to go to the go find me pages on my Facebook it's also you can see it on my uh my ground zero site you go there and take a look at that and if you can help contribute to helping my wife\nAnd Liam too you know we keep the family together and and that way we can we can still\nYou know well to provide help to the family\nAnd it's hard to ask that's why I'm having a hard time trying phrases because ... you know I'm dealing with a lot of things right now behind the scenes\nAnd it's just it's so good let me tell you this from my heart is so good\nTo know\nThat your loved in that people support families mhm\n[noise] so that's why I'm going to say about that and um it does my heart good with all the bad news in the world [laughter] there are a lot of good people out there to listen to my program\nA lot of good people that are looking out for my beautiful white Janine thank you thank you so much Janine says thank you too so I'm gonna I'm gonna let this go just go to my go find me page I put out for Janine help us out please I really appreciate that very much and I show is a\nIs going to be a mind bender for everybody and the reason why it's so fun subject for me ah you know one of the weirder aspects of quantum mechanics could be explained by an equally weird idea\nBut I've always talked about and that's retro causality we're talking about causation that runs backwards in time but then it can also run forward in time Feinstein\nCame up with the idea of spooky action at a distance quantum mechanics he said that's how you'd be a radical explain or\nBring about evidence to show that retro causality exists which is the particle equivalent of you getting a stomach ache today Thanks to tomorrow's bad lunch\nAt the idea that you got a stomach ache but there was nothing that you ate the gave me the stomach ache but something that you're about to eat is going to give you the stomach jak does that make any sense\nI don't like explaining it that way that's kind of a waste science would explain I like explaining it as for example\nYou're at a bar\nFox News I'm Carmen Roberts\nI second swearing in for justice and Brett Kavanaugh as President Trump apologizes for what the justice went through to make it to the Supreme Court capital says it didn't change him\nI Will continue to heed the message of Matthew twenty five I Will continue to volunteer to serve the least fortunate among us\nHis words are unlikely to change the minds of Democrats DNC chairman Tom per se told his supporters that Republicans must quote pay a price for putting Brett Kavanaugh on the high court\nPakistan Callaway Boston crash of New York sixteen to one to take a two one leading the playoff\nSanchez on the ground zero for\nThe Boston Red\nSox with sixteen runs on Eighteen hats and the first ever cycle in the postseason by rock hall that\nCall on TBS referred to home scoring single double or triple and a home run\nThe commercial airline industry is booming\nWith this level of demand the industry needs more aircraft technician we are the eight [noise]\nI'm like Louis you're listening to this program and it sounds a little familiar it's because of the best to ground zero please hold all your calls\nSo I Want to welcome back in the program we'll talk about a serious topic [laughter]\n\n[laughter] [laughter]\nYou're not already I don't want\nTo hear that last one emerges in Colorado and I don't like the last one emergency [noise]\n\n[laughter]\n[noise]\n[noise] [noise]\n\n[noise]\n\n\nHey what's going on about\nThis topic [laughter] [laughter]\n[laughter]\nWhat you got for eight hours each one of the house of the\nTime what a lot of money to save money [laughter]\n\nI'm quite Lewis\n\nYou are listening\nTo ground zero the numbers called I triple a six seven three seven hundred [noise]\nTrouble lazy seven three thirty seven hundred\nRetro causality has always been one of my topic\nFavorite of mine because it it it's always kind of weird to think that yes maybe something in the future could influence the\nPast or vice versa and I and I started thinking about that back during the nine eleven days seriously um it was because of the fact when nine eleven happened I just felt like time stopped\nAnd I felt like a that there were some things that happened during that that that era that reminded me of things in the past the quite possibly were affected by that very moment in time I I and I don't know why my brain went that way\nBut it just happened to go that way for some reason\nI mean we're in the round the fringe analytics I like saying that it's better that conspiracy theory we should start using that right were fringe analysts [laughter] like that idea\nRather than say you're a conspiracy theorist you're fringe analyst and that means you analyze everything that's fringe including paranormal entire political\nBut uh in the realm of fringe analytics and and being a fringe a analyst there's a whole lot of maybe using coincidences that should never be ignored even when they sound outrageous\nGame show when I played that audio just now the broadcast demand on the tape or the man on the radio back in Nineteen forty five he could have made a lucky guess right but I'm a sucker\nFor time travel would prophecy especially when it has that paranormal vie to it and how would lead you down the roads that take you to what it's called the further beyond the modern conspiracy theory there is a notion of predicted programming\nAnd we talk about this all the time as it seems to be a pervasive way to approximate or otherwise force structure the future in some way\nIt is proposed that to what is called revolution of the methods\nThat were warned or were being prepared to accept certain ideas means or ideology\nWe see it in film and TV shows and many things that eventually come to pass what we see like for example I don't know about you but if you if you go on the Internet a lot you see The Simpsons predicted a lot of things even even the nine eleven attacks being predicted the election of Donald Trump which I think it's fascinating\nSo\nWhen we see these things happen and we wonder about retro causality we wonder how these people who are in the arts can somehow\nPredict the future or at least give us something to think about in future tense like science fiction I remember I was at a uh a convention one time\nIt'll be convention and we I was on a panel discussing just what science fiction writers got it right there was this one science fiction writer that I was sitting there so I didn't know who he was he was a local\nScience fiction writer ... science fiction is never gotten it right and I says I beg to differ man I says you write it you're right science or I read it okay I I read the comics I read the books I see the movies and there are a lot of things\nThat people like Harlan Ellison who just passed away got ride for people like Ray Bradbury or Isaac Asimov got right Philip K Dick amazing right he got a lot of surprise um and and so when you're when you're thinking about this revelation of the map but it's a it's a very deep\nFascinating conduit to time travel and to the fantastical concepts that most people considered the stuff of science fiction and while the idea that someone can Journey Through time and change the course of history", "year": "2018", "show_name": "Ground Zero with Clyde Lewis", "city": "Los Angeles", "day": "09"}