{"month": "10", "state": "MA", "station": "WBUA", "content": "Fair trade issues and the president might be on the right track\nSays Enrique out a trade expert at Singapore management university yeah then you impact that would be a re sharpening of the supply chain is to the detriment of China some companies have already shifted production out of China because of things like increasing labor costs and heavy regulation\nThe U.S tears and knew us MCAA deal\nHas just accelerated the process that overdose that already with the censure and associates affirmed that advice as foreign investors in China he says about ten percent of his manufacturing clients are starting to set up production lines outside China but are they as President Trump once relocating to the U.S\nI don't have a single line that loop and moving back to the u._s. or all of them are looking at a um Asia\nTo countries like Vietnam and Cambodia he says trade expert Henri ... says nations that have a free trade agreement with the U.S also benefit like a Wall Street is like a Singapore like Korea he says however that any boost to us manufacturers could be short lived\nBecause China can produce so many things that other countries can't end more cheaply\nMichael's accord with the consulting firm ... international says the U.S MCA won't dislodged China from its central role in global trade\nSign or you're going to be part of the world trade supermarket and a major exporter\nSays the CEOs he advises had no immediate plans to shift production he's telling them to wait and see he says there are no winners in a trade war and he's optimistic that U.S China trade tensions will soon be resolved\nFor marketplace [noise]\nWere founded by you our listeners and by the Cancer Center at Beth Israel Deaconess where researchers and physicians believed that imagining a world without cancer isn't their dream it's their job\nLearned about the standard of cure and the idea of sees promising research at B. I. D. M. C. dot org slash standard of cure\nAnd frankly Allen combining legal strategy with a fish and sea to address your legal needs with offices in Boston and throughout the north east online at ... dot com\nThis is not the point nine WVU are only some islands in the studio with magna ... Jay Clayton and we are in the final minutes of this fund drive this fall fund drive\nWhich is a very important one she was well they're all important but this one is especially because we have been asking you for contributions for quite some time now and you have come through for us we have a new tally right now and uh Jay Clayton I guess it's a good one\nIs a very good one and I want to thank everybody who has given so far and in particular a donor who called and said you know you guys have been working really hard and this is really important to me and to our community\nShe made it very sizable gift and that along with all the other gifts that have been coming in we appreciate them all equally we have Ninety One hundred dollars left to re\nAdolescent yep nine it all down hundred dollar right what was it wouldn't last time we spoke it was something like sixty seven thousand or something like that just want to say thank you to this perhaps you every everybody yeah this person called ah I guess within the past him in a few minutes and um and this is a surprise and it's a very welcome surprise insurers\nSo here's the situation a mega really quickly and we've got Seventeen minutes to go Seventeen minutes for you to make your contribution Ninety One hundred dollars again is what's left to raise\nWe are going to end the fundraiser at seven o'clock as planned as promised\nThat means you've also got you're Seventeen minister contributing get a chance to win that Subaru so here is the number one eight hundred nine zero nine nine to eight seven one eight hundred nine zero nine nine to eight seven or W. B. U. R. dot O. R. G. and\nThroughout this fundraiser you know we've been saying give what you can give what's right for you which is why we appreciate and I want to say this over and over and over again we appreciate everyone who calls end with the contribution whether it's five dollars whether it be the thousand dollars\nThat's what's right for you and I think you know almost more than the dollar value is the the sheer act the demonstration that you believe that an informed public with that armed with trustworthy information that's armed with independent information and analysis and informed public\nAnd informed community where you live that is what is vital to the functioning of our democracy and I think people are very powerfully feeling that in this day and age and that's why thank you every single person who's called in with their contribution here for ... to W. B. U. R. and if you still haven't\nThere's still time one eight hundred nine zero nine nine to eight seven is the number to call\nOr W. B. U. R. dot or you know I think making what you said is very much correct I mean it to 'em and whether it it doesn't matter really what the pledges we appreciate a pledge of the tens of thousands of dollars we appreciate\nTens and fifteens and twenties as well because the sentiment behind it as a saying the sentiments as we appreciate what you do um you were a singular and what you do and we want you to succeed and apparently this person who was so\nGenerous just to call in and bring us this close to the end of the fund drives successfully a said we want to see that they want to see us make the final goal we will with your help we will end it successfully at seven o'clock one eight hundred nine zero nine nine to eight seven or W. B. U. R. dot org\nSo again we're about Fifteen minutes away from the end of the fundraiser Fifteen minutes for you to make a contribution help us raised the remaining seven thousand dollars in our goal we thank you if you've done your part already\nIf not you want to do it right now because you've also got only Fifteen minutes left you make a contribution when you're eligible to win your choice of across track or an outback\nUp to ... uh twenty Nineteen Subaru from city side Subaru in Belmont we thank them for providing that let's hear from somebody who won the cross truck earlier in a fundraiser a car just like the one that you could win right now here is uh one of our listeners Sylvia Perry\nMy family is constantly seeking out mountains or the coast we have a basement full of gear which needs to be loaded up every time we go someplace\nAnd for us the super cross check is just about the most perfect vehicle in which to do those adventures let's super cross checked particularly seems like a car meant for outdoors the kind of people who want to get to remote places so it's small and zippy and\nHe can fit skis or hiking or camping gear and it easily\nOne eight hundred nine zero nine nine to eight seven is a number to call if you want to get in on that opportunity to uh when the sweepstakes for this year's twenty twenty Nineteen Subaru that we're offering you get your choice of two if you wanted to if you win\nBut you know we keep saying you can get it on their sweepstakes you can help W. B. or meet its financial goal for this fundraiser but really I think the most important thing that I Want to say over and over again is\nReally all of us collectively have a civic goal we have a civic goal of keeping W. B. you are an independent strong source of news and information you can trust I think that's something worth leaving in\nAnd something worth calling eight hundred nine zero nine nine to eight seven six the eight hundred\nDollars to go Thirteen minutes left in the fund drive thanks a lot\n\nOf reports that three quarters present close to twenty six thousand six twenty seven now ducked down a hundred and forty five point one point eight percent finished in Seventy eight Seventy nine us be five hundred down twenty three agents present twenty nine\nTalked about holiday hiring rights or drive over to UPS dropped off three ten percent FedEx lag behind seven tenths present those back has got to get where they're going somehow write checks dogs in a slump today after that Bloomberg hack stories apple or one of the recording presentable Bloomberg by the way it has never found militia chips in any server it offered\nAmazon slumped too and to ... percent also disputed details of that report you're listening marketplace marketplaces\nSupported by criminals HR payroll talented timekeeping and one unified system designed with the streamlined implementation approach for\nSmall and medium size businesses across the globe learned more criminals dot com criminals workforce innovation networks hand by sea three I change the software platform for digital transformation using artificial intelligence and I owe teen to solve\nPreviously ensemble business problems learned more in the three I O T dot AI\nAnd by Drexel University Drexel University is academic design and transformative cooperative education program prepare a visionary leader to address the challenges of a changing world more at Drexel dot edu slash ambition camp point\n[noise]\nInteresting day in the U.S China economic\nRelationship a big story and Bloomberg Businessweek maybe you saw this about how the Chinese army had hacked into computer hardware used by some of the biggest tech companies in this economy was to companies by the way the night we should say\nLit a vice president Mike Pence said in his speech this morning but he expects joined it to be more proactive than ever in trying to influence us politics and also some pressure understanding what the new NAFTA is going to mean for the global supply chain under the terms of the new deal and yes I noticed technically the U.S MCI", "show_name": "Marketplace", "year": "2018", "city": "Tisbury", "day": "04"}