{"month": "10", "state": "PA", "station": "WVYA", "content": "\nThe\nMusic from the date young cherry pro main ... from the album volume two\nFrom Canada and to keep up the dizzy Gillespie tunes sell those by a a while the arrangement was Dave young Victor are burned George was are they gave the name but no instrument [laughter] burned or John ... sex or Kevin ... caught\nWas featured on trumpet and de risk depot was on piano from the Dave young dairy pro main ... of them called volume two wrapping up tonight to all that jazz you're on WB I we have more jazz at midnight from ...\nAnd stay tuned it's mixed bag coming up next year on WB I Am FM\nThis was W. V. I. A. eighty nine point nine a pound W. V. I. H. D. once granted we'll sprinkled in in Williamsport W. B. Y. eight eighty nine points that I Am in Mansfield WTO eighty eight points ... and at like ...\nW ... Ninety One point five FM stream live at W. B. A. dot org we're in Allentown to not eat on point three and in Bethlehem at what five point seven members supported public radio W. V. I. S.\n\nNext time I asked me another actor Diane Guerrero talked about her writing process and immigration activism\nI thought maybe ... could be an apple um I Know what this feels like I Know what family separation age so I decided okay All right from thing the new the needle in any way\nThe joined me up your iceberg for NPR's our that those war games and trivia\nTo borrow at eleven AM on W. V. I. A. up at\n\nGood evening welcome to mixed bag is George ... we have some new music to share with you as we do daily tonight the paper kites from Australia\nAnd also singer songwriter Brandon gender and then after that it's up to you it's our traditional friday request program we um take requests for contemporary music by that I mean do you know Nineteen nineties to the current time\nAre you in the varieties of rock you don't hear elsewhere on the radio alone with folk and blues and world music and so on five seven zero six five five to eight zero eight for request a mixed bag well let's get to the person the new releases waste late the the first one\nFive seven zero six five five to eight\nZero eight for request a mix but well let's get to the person the new releases late the the first ... which is the latest album by the Australian group\nThe paper kite from El born\nUh this is about their well at least be fifth album ... six felt much think that there are six that has come our way and it's a kind of nice mellow Django we ringing guitar melodic music and I'm just albums got on the corner where you live\nAnd there have been here for two and a three rather starting off with the deep burn blue\nFollowed by flashes and then a piece called\nWhen it hurts you so you're using the paper kite from Australia the\nQuote on the corner where you live and we'll start with Pete go deep burn blue\n[noise]\nI Know\nA drag and\nThe\nThat now is now a\n\n[noise]\n\n\n\nNo no no [noise]\n[noise]\n[noise] bad [noise]\n[noise] baggage or [noise]\n[noise] I think\n[noise]\nNa\n\n\n\n... ... ...\nNo\nOne she sure\nKnow about the um\n... and the judge me as\nThe these these are my\nGuests are so ... [noise]\nUm I work from ...\nTo doing well to me [noise]\nKnow when you do write\nUpon them by\nI saw I saw that they would ...\nStatues on posters\n... year\nWhole new some tremendous received can [noise]\nYou think's going\nYou think could\nOr at least that is what do you see\nWould you rather than\n\nNa\nNa\nNa na na na na\nDon't you come home to long\n... how long can you\n\nA main problem is a much than the one that\nYou have done\nI'm On the TV\nAll on the\n... to\nTo ... I'm\nStill may\nHave cheese ...\nNo\nI don't know ...\n\n\n\n\nFrom already going to change\nPieces laying\n... who\nMany the\n\n\nCan go to visit the baby boom\nAll the rest of the ... I wouldn't want to go out for a long way\nTo go to the ARPA do those things made no bones about it [laughter]\nTo be honest\nI wouldn't want to me oh wait\nTo go to the um but you know the men don't do that by\nThey are closer to\nNo money instead of just I've been on the line\nThat\nThe region against the debt invest in the in the ... you lose your dining in and they\nOf open my windows down that road\nBlankets and and and and you can do and can keep you from being in income\nAlways been a lot about the cheap cold blooded other men you know who else from neighborhood to go bad the only way to the gym to gym there will be used as a graduate degree regret in Virginia you're you're you're ... where do you agree with him on the street or mugged embarrassed to Georgia newborn\n\nBut you don't\nKnow the\n\n[noise] [noise]\n[noise]\nWhy like private insurance but I don't know what are the guys that were all blame I thought oh they're going to be more and more than you might be you know more about those that are being ... by the\nNa'vi about that but I'm real name I\nThen to get a better model in the new\nNow but the idea that\nOn a\nBen\n... members are being but I won't be able to put him on the door she and my other\nI mean yeah you know the month old you are you there were no way in the mail but okay my bird learn blood I work at all but I won't be the end you'll not be that threat but I live by the law where men don't forget about that well uh yeah yeah you\nGot to be made but I don't\nThey got them yeah we'll go get lucky I don't mean to me now\nAm a man I I'd\nGo\n\nThe um um vocalist to move some guy who's well known Bob I'm always on here as well a lot of a well known African musicians appearing on that jam or called the garbage him from the up and throw down your heart the Africa sessions Baylor flick on ... you're on WB I asked\nAbout coming up we've got more music if you'd like to put in a request for tonight's program we have opportunities for that our telephone number four requests is area code five seven zero six five five to eight zero eight\nFive seven zero six five to eight or eight request a mixed bag covering the varieties of eastern interesting recent a rock folk blues world music and so [noise]\nThis is W. V. I. eighty nine point nine of them do the vi HD ones granted Wilkes Barre ... and we're in Williamsport it WTY eighty nine point seven have him in Mansfield a W T I O eighty eight point three of them\nWere in a while and pop academically P. A. Ninety One point five of them streaming live at W. V. I. A. dot org we have a translator in Clark summit at Ninety point three of them you're arts any information station listener supported public radio W. V. I. S.\nCatastrophe on the Florida Panhandle the latest on the clean up and with the coverage from hurricane Michael\nAnd we'll just stormed scrambled from close to watch political races in that swing state before the midterms also certify genius he talked with a new MacArthur Fellow who's bringing music under served communities all that and the latest news from Washington and around the world on weekend edition from NPR News\nSunday Morning eight to ten on W. V. I Am [noise]\nThe Williamsport symphony orchestras conducted by maestro Edelstein opens October sixteenth with works by Racine each ... and Brahms\nGrammy nominated in chart topping violinist Caroline Golding plays Chuck ... violin concerto [noise]\nSports in for the October sixteenth at the community art center five seven zero three to six twenty four twenty four or Williamsport symphony dot org [noise] sponsors who the capital group at my coming college\nHere's the weather forecast for northeastern Pennsylvania mostly cloudy tonight with showers after midnight lows in the upper thirties chance of rain eighty percent for Saturday cloudy with rain showers in the morning then partly sunny in the afternoon with high in the lower fifties chance of rain he's eighty percent\nFor Saturday Night mostly clear patchy frost after midnight blows in the mid thirties on Sunday mostly sunny with patchy frost\nA with high in the mid fifties on Sunday night mostly cloudy in the evening than becoming mostly cloudy with forty percent chance of showers lows in the upper forties Monday showers are likely with hides in the upper fifties chance of rain sixty percent Monday nights mostly cloudy\nShowers blows in the upper forties Monday showers are likely with high in the upper fifties chance of rain sixty percent Monday nights mostly cloudy fifty percent chance of showers lows around forty and for Tuesday mostly sunny with high in the mid fifties at Wilkes Barre Scranton airport fifty degrees\nForty four in Mount Pocono fifty three in Allentown in Williamsport reporting fifty two degrees cooler but it's been\nThis is a mixed bag this George Graham once again if you'd like to put in a request for something in the varieties recent a rock that you don't hear elsewhere on the radio about the folk world music and so on if you'd like to call the number to call it use five seven zero six five five to eight zero eight for requests well\nUm I generally we generally you know we don't bother with the the same old easy here elsewhere on the radio the the stuff from the sixties and seventies but I did get this request\nWhich goes back to the Nineteen thirties [laughter] but uh this is such a window influential artist will uh will included in the show for tonight or had a request for some uh uh Robert Johnson the great a blues man from Nineteen thirty six I'm going to play two tracks\nFrom the collection the complete recordings and um for two two classic Robert Johnson tons of people have covered many times over the years rambling on my mind at a crossroads blues here's Robert Johnson by request here on WB I\n\n[noise]\n[noise]\n[noise] [noise] [noise]\n[noise] no no no no\nThat that\nMan [noise] [noise] [noise] but you know I'm not\n\nI\nDon't think\nYou know mom\n[laughter] and then\nYou meet a lot of time\nAnd\n[noise] that can't saying I\nAm and\nThey end up saying the\nDa da da da da da da\nDa da da\n\nDa\nDa\nAnd I'm not\nThat\nI did to me it's a long time\n\nI got it\n\nI mean I Love\nThat\nI've done a thing\nThat\nI that really was the only one God\n\n\n[laughter] Mm Mm Mm Mm no\nI was wrong [laughter] mom ...\nAnd ... and\n... them mommy\n[noise] Mm Mm Mm Mm\nMm\nMm Mm\nMm\n[noise] Mm [noise] Mm\n[noise] Mm [noise]\nMm [noise]\nYou know even if he bought it for me ...\n... ...\nDown on the job for me um [noise]\n[noise] Mm [noise]\n\nMm [noise]\nMm [noise]\nGotten all night long enough to ... the mark a\nNew\nGeneral ... they run around [noise]\n[noise] [noise]\nIt can be wildly wrong\nI mean they do\nNot Adam crawl through the back you know\nThe ... [noise]\n[noise]\n\n\n\nOvercome mom [noise] a dive upon them down to a man a new but come\n[noise]\n\n\n\nOh yeah\nIt is a ten\nA woman\nMy nickname Neal oh\nMan and ...\nThe nickname the oh\nMan and ...\nMe man there ain't no line\nYou know to live in fear is no way up\nEconomic\nWanting to live in\nThe\nWhat is\nMy\nMan ... ...\n... I'm now\nLobby\nKnow winning yup\n... you\nHe's in the job\nAnd then she had no\nNo no no\nNo no\nLive mom mom lures him\nWhen you plug in may and\nAll the\nWay in a\nMeeting my\nNew\nAnd then I couldn't help money along man down them don't mind gal ...\nTo try\nRead the new\nWhen you can get another\nNever read ... ...\nMm\nMm the\nI'm going to lead the dead baby\n\n\nHas he named trading man\nLong\n... ... ...\nI'm\nOnly again how much I Love [noise]\nHow long and the main\nShoes go live in the\nLong that the\n[noise]\n\n\nTo me so\nHe is trading been\nThat he trained in\nThat's Chuck with el from a two thousand twelve album back to the woods and or evening trained on mixed bag WPRI we ah had a request for some a music from\nFrom um with Robert Johnson so that kind of inspired me to do and acoustic blue said we began with two from Robert Johnson from Nineteen thirty six and a rambling on my mind and crossroads blues from the collection called the complete recording then more contemporary material I'm the I'm\nA song if I had position of judgment day Robert Johnson song done by Rory Block from her album called the lady and Mr Johnson a Robert Johnson songs and Chris Smith or in another old blues song a cold sitting on top of the world from his latest album called call me lucky\n\nYou\nKnow the guy\nA\nThe\nBank and all that they both want to thank Mr but maybe you could do that and not pay rent to ... ... ... ...\n... ... theloop open\n\n\nGo see the the ... the longer balls in the\nBack of the issues in the\nIn the loop de la\n\nDay\nI mean you know the\nThings shall\n\nThe long\nAnd he\n\nDid\nHe\n\n\n[laughter]\n[laughter]\n[noise]\n\n\n\n\nPeople should understand that then\nWho vine and getting all the plants but now\nPossible to read a lot\nWhen they apply I I'm\nNot going to do well to do three drunk and I don't want me to the yoga the man\nRyan how\nAre you okay\nDay\nCare there is no way\nJust like the ... the thing to do with the young lady\nThat I didn't understand the true\nBeen written ... meeting in\nDo\nYou do us great again don't want it and then the other\nDay a\n...\n\n\nI'm\n\nPaying for them now I don't know where you\nDinner\nYears old and not even you\n\n\nHe he he he\n[laughter]\n\nAll one man\nNeed to correct me\nStory\nThat is that in ... when we\nWere all that and then\nMore by by\nKnow the\nThe the\n\n[noise]\nSays\nHe didn't do\n\n[noise]\n\nData\nNo losers and he's a silver spoon gangster the million dollar blue CGI his finger on the train tracks a match do\nThe bees you choose your cells\nLove was criminal baby she made the life of crime\nThat it ain't none of them so blameless when she was a bone in his mind\nThese guys are seen to be\nShows and the other day\nTo ...\nBoom the bird and the the John shot\nAnd said run from the album called picture him happy and another old bowl wrapping up a set of rather jazzy vocals and away we began with Sheila\nAnd ... from the album called picture him happy and another old bowl wrapping up a set of rather jazzy vocals and away we began with Sheila Nichols from her new album called all of nature and a piece called come to the garden then after that it was a group called love salad\nOr led by I'm Josh Davis who's on the faculty at a ... a university a piece called I'm\nSam a five point eight from love salads album called\nTotal eclipsed me after that Haley Lauren from her new album called from the wild sky a piece called paper man that in turn is followed by Jamieson Ross ah from earlier this year from the court all for one we're the type of people for one from Jamison Ross\nThan the Liz writes and someone called barley from her album called grace\nFrom I think late two thousand Seventeen and just now been ... from his two thousandth Seventeen album cold picture him happy and a song called on to another old bull about a certain public figure\nA mixed bag here on WB I act but we've got more music we are here until eleven pm on Friday nights so stay with us here on WB I Am FM coming up and eleven at women in music with Lanny good men and then coming up Monday at nine we're going to feature an hour of funky music funk influenced music that'll be Monday on mixed bag\nThis is double vi offend me eighty nine point nine W. V. I. A. F. M. H. D. one Scranton Wilkes Barre hazel to W. B. Y. eight eighty nine point seven FM Williamsport W T I O\nEighty eight point three FM means Berg Mansfield and W. P. A. U. Ninety One point five FM Palmyra township with a translator and feelings grow fats Ninety five point seven and Louis burgers one hundred point one and on the Web at ... dot org\n[noise]\nLet's wait wait wait don't tell me give you what you've always needed a break from the news astronaut Scott Kelly tells us why you need to double check you ran an ad has been floating in space ... reveals for most challenging roles monster can we hear often go these terrible ... of the exploding lasagna\nI beat her said will join us for a mini vacation for your soul and the news quiz from in the U.S [noise]\nTo borrow morning a chance Sunday evening at seven on WB I Am\nAt the weather forecast for northeastern Pennsylvania mostly cloudy tonight with showers after midnight lows in the upper thirties chance of rain hundred eighty percent\nFor Saturday cloudy with rain showers in the morning then partly sunny in the afternoon highs in lower fifty chance of rain in the morning is eighty percent\nFor Saturday Night mostly clear patchy frost after midnight lows in the mid thirties on Sunday mostly sunny with Patrick frost with high in the mid fifties on Sunday nights partly cloudy in the evenings and becoming mostly cloudy with a forty percent chance of showers lows in the upper forties\nMonday showers are likely with high in the upper fifties chance of rain sixty percent Monday nights mostly cloudy is ... percent chance of showers those around forty and Tuesday mostly sunny with high in the mid fifties\nAt ten pm at Wilkes Barre Scranton airport it was forty nine degrees forty two in Mount Pocono fifty three in Allentown in fifty one in Williamsport\nThis is mixed bag is George ... coming up at eleven o'clock following this evening's program it's women in music with Lenny Goodwin from Boston\nWilliam support because it was mixed bag to see George Graham coming up at eleven o'clock following this evening program it's women in music with Wendy Gordon from Boston\nAnd then coming up but at midnight it's jazz from cures corrupt last half hour we had a tickets to offer to concerts by ... Dusten Douglas and the electric vehicle that I I had a caller on the line and then I lost it and uh so that caller would like to get back to me\nOr I can give them to take information get the tickets for Justin Douglas and the electric gentlemen were next next friday at the river street jazz cafe in Wilkes Barre\nAll right let's continue now and this is a band called ... D J uh this is from there are two thousand fourteen album called E. D. J. and this is a tune called for the boy who moved away you're on WB I ...\nNo no\n\n...\nAnd\n\n...\nJust I'm\nI'm\nNa na na\nDay in the ... the\nServed in the ... the ...\nAnd three in the country and animals and [noise] Mm\n[noise]\n\n\n\n\n[noise] [noise]\nOh\n\nNo\n\n\n\n\nA lot of money you know be in\nKnow she really\nNeeding\n\nNo way\nThe\n\n\n\n\nNo\nWell it's to\nMe is\n\nNo no\n[noise] [noise] [noise] [noise] ... ...\n... ...\n...\n... ... or ... ...\nThis is talk to those during the\n... and ...\n\nAnd ... in\nThe song to the ... we could\nA kid there is no sir\nGood and very good ...\nLeading those\n\n\n[noise] I don't\n[noise]\n\n\n\nI describe I didn't mean to\nKnow the guy said in a\n\nDish become ... ...\n... ...\nA sketch the German people close\n...\nThey should\nShe\n...\n\nAgrees that she'd germ\n\nThe shape I'm\n...\n...\n... ... ...\n...\n\nShe brings you know\nWe met in ...\nShe ...\nMy story line\n... ...\nAnd a three day means of carrot juice George ... to ...\nLonely change too and\n\nIt'd be more by\nIn\nStay brown from the three ...\nBuild up so we're leading now in\nDo you mean by oh\nBut it's not\nAll the hiding away and I live in the wake\nMe na\nWe don't we don't know near\nDo any some basketball we'll keep\nWas just no special night\nWith a\nYou\nSummer in a city look into action leg as well [noise]\nLooking for term limits duration of", "year": "2018", "show_name": "Mixed Bag with George Graham", "city": "Williamsport", "day": "13"}