{"month": "10", "state": "PA", "station": "WVYA", "content": "For more here on WB I Am FM\n\nProgramming on WB I is made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your arts that information station W. V. a a family\nSupport for WBAI comes from the citizens voice provided loser in county was breaking news every day for the past forty years citizens voice thanks their readership received news at home or on the go the citizens voice here to stay more information as citizens voice stock top this is W.\nV. I. S. eighty nine point nine ... found W. V. I. H. D. one ... in Williamsport WTY eight eighty nine point seven have him in Mansfield WTO eighty eight points ... and ...\n... ... ... Ninety One point five FM streaming live a W. V. I. A. dot org we're in Allentown Ninety nine point three and in Bethlehem at one of five point seven member supportive public radio W. V. I. S.\n\nI felt shot I still feel showing hundreds of thousands of veterans who've received less than honorable discharges had been denied VA benefit\nIf you have the TST man because of that Patriot's day you act couch you should not lose eligibility for your veterans' benefits that that's what's been happening\nLast year the VA finally offered to treat these veterans but are they doing enough on the next MORNING EDITION from NPR News tomorrow morning from five to nine on W. V. I. A. F. out\nOr something of dumped explain something special color what you will or history our values lifestyle here we haven't forgotten to care [noise] ... grown to be one of the most scientifically advanced than innovative health care organizations in America that we've never\nForgot where we come from we care such an old idea is almost seems brand new\n[noise]\nGood evening and welcome to mixed bag to see George Graham we'll get new music to share tonight to a couple of singer songwriters I'm Greg Smith and also kayaking cater coming up in the first half hour then at eight thirty it's a world music set\nAnd tonight at nine it's our weekly album reviewing a Canadian blues man who's been on music scene since the Nineteen eighties a colon James his new album is called miles to go which will be featuring\nAt our nine pm Wednesday night weekly album review would start with the new releases the first to choose from singer songwriter Greg Smith was caught so far and apparently consist of material that he had previously issued on the series of independent to\nA releases and um there's a lot of material on this good singer songwriter the album called so far we're going to hear three tunes first of all make your point followed by always the same and then one called medal Lena so here's Greg Smith\nCalled so far and we'll start with make your point\nAnd um [noise] um [noise]\nKnees\n\n\n\nOh yeah\nAnd\nSo you\nKnow the\nReally seen them all\nWay and then uh\nYou know and\nThen you know no rain and say hey what she came to this day and\nAnd ... man\nAnd so on and make that much\nWhen they ...\nAnd the guy\nAnd\n\nIn ... ... ...\n...\n...\n\n... and ... may\n... to ...\nTo\n... and\nThey want\nHere\nAnd\n[noise] and\n[noise]\n[noise]\n\n\nAnd I I'm not sure\nWho\nDrove up to the\nUh\nDo\nWe know\nIn may\nAnd\nDrove up\n\nTo me\nOr the middle East that much and they\nPay a fine to\nSearch and paying\nA fine and then\n...\nIn a bag and a A R and\nTo me and I didn't serve in the church\nAnd they and\nUm and then go\nAnd leave me here\n\n\nAnd [laughter] na na na na na na\nNa ...\n\n\n...\n... ... ... ... ...\nThe man oh man\n... ... and then they\nGo\nTo ...\nMorning go up\nThe kids she would be\n... ...\n... ... ... ...\n... you\nI mean you know\nThe man you know living in\nMiddle of the ... to ... ...\nAnd ah it can you\nThey may\nWhen I'm done\nWith crab\n\nJust pull you in which the seed secure in\nThe city\nThing from the is worse thing you need to be\nAnd the key issues they did was\nThe the school\nWhen she\nCame here and the ...\n\nAnd [noise]\nMade a name for the you\n\nThey\n\nDon't eat the\nMeat and these were very good\n... ...\nThe lead to\nThe door to\nWe'll watch them she lets them\nWe'll watch man she knew that they\n\nAre sent to the degree to the the ... to\n\nOn the ground the hand that feeds into\nMain body really does is\nOn the ground there\n[noise] [noise]\n[noise]\nWell some of the top of the school\nIs man of the things we do that and the cats but between students high [noise] [noise]\nBeen a goodly we clean\nNow let me sit next to him lovely to be fought in\n\nOf the\nReally doesn't\nHave any kids\nMe was the\n... de la ... been doing in the\n... [noise] the ...\nThing they were\nReally they did in ...\n\nI panic can't\nJane Fonda\n\n\n\n... [noise]\nLike you see\nWhen they did when when the\nWhen\nThe ... the [noise] uh then\nMaybe he really knew what to do\nThey say well let's do it was a\nBig summit then then going on\nWhen I\n... I mean [noise]\n... yeah\n[noise]\n... can be\n[noise]\nWe're\n\n\nWe can\nAnd it was a lot of people to learn how\nLate to go to the movie\nBut\nOr da da da da da da da da da\nDa da da da\nDa da da\nDa da da da da da\nDa da da da da da da da da da da da da da da da da\nDa da da da da\n\n\n\nDa\nDa da da da da da da da\n\nDing ding ding ding\nDing ding ding\nDing ding ding ... leading player\nThe building\nJunkie people can do\nThe in the in the middle of the day\n\n[noise] [noise] [noise]\n[noise]\n[noise] [noise]\nMoving in\nThe ... the\nThe men and\nWomen are getting ... getting in your ...\nI mean can you get to do ...\n...\nDuke\nIn Durham and be can be can be good looking men\nThe mood in Newport\nNews\nIn the blue to be in ... in the game and they\n\n\nDuring the\nThe answer to this\nThe just the lab and then I turned on me in line for the just the beginning when it wants to ... to ... I put on your body for the day\nYou know they want more\n\nThat's from the Brazilian group also coup Canova and a tune called dish up her law firm the of our kind of Boston wrapping up a world music ... covered a lot of different countries we begin with and Julie key Joe from beneath ... piece called him ... from her two thousand fourteen album called eve featuring the criminals quartet\nAfter that to music from two thousand ten album by the group called afro Cuban some featuring\n... I'm Molly in Cora players and ah and ah musicians from Havana, Cuba and we're in a piece called cover almost from the album called afro Cuban some than from the gypsy kings from around two thousand fourteen from their album called a sub or flamenco we heard the title peace\nAfter that or from the various artists collection called ... to my present so South Africa the group called ... from the ... in a piece called ... from South Africa then from a kind of a Mexican American band doing some um\nI'm sort of course we do in money actually musical group called loss since ... since ... list which translates to the mocking birds from Europe in Colorado so therefore wrote a piece called regrets uh yup well since ... it's hard to say\nAnd uh just now music from ... from the un quote our kind of bought from Brazil and a ... a mixed bag here on WB I ate\nA world news except what we've got some a Canadian blues coming up at the moment it's from colon James who the album is called\n... to go in and out interview coming up at the moment so stay with us here on WB I [noise]\nThis was WBRC eighty nine point nine of them WBAI each one rented ... we're in Williamsport it WTY eight eighty nine point seven at the end in Mansfield a W T I O eighty eight point three of them were like well I'm pop academically P. A. U. Ninety One point\nEighty nine point seven have him in Mansfield a W T I O eighty eight point three of them were like well I'm pop academically PA you Ninety One point five of them streaming live at W. V. I. A. dot or\nWe have a translator and Clark summit Ninety three I found your arts any information station listener supported public radio W. V. I. A. [noise]\nIt's great classic style jazz on WB I asked him from the ... channel Monday through Thursday from ten pm to midnight\nMany of the world's great jazz musicians have recorded fork here scare oh now part of ... hey people like Clark Terry Phil Woods teddy Wilson Gerry Mulligan and many others\nYou can hear the ... channel on W. B. I. A. H. D. three now top off your day with great jazz on WB I Am FM Monday through Thursday from ten pm to midnight and overnight on the weekends\nProgramming on WB I made possible by our members and by auto bookstore\nAuto bookstore in Williamsport and W. V. I. H. T. V. invite you to vote for your favorite novels in the great American and read\nA nationwide celebration of America's Best loved books Tuesday nights at eight pm on WB I ATV throughout October more information is available at W. V. I. A. dot org slash great American ... or ... auto bookstore\nHere is the weather forecast for northeastern Pennsylvania\nThere's a freeze warning in effect from midnight tonight until about ten am tomorrow I guess we're ... well overdue for a freeze warning\nOr tonight partly cloudy with a slight chance of showers in the evening than a slight chance of snow showers after midnight those in the upper twenties on Thursday a slight chance of showers in the morning mostly sunny with a slight chance of rain showers hide in the mid forties chance of rain precipitation at twenty percent\nThursday night mostly clear lows in the lower thirties\nFriday Sunday with hides in the mid fifties\nFriday night mostly cloudy at fifty percent chance of showers those in the lower forties Saturday mostly cloudy with a fifty percent chance of showers hides in the mid fifties Saturday nights mostly cloudy lows in the mid thirties enforce Sunday partly sunny with hides in the mid forties\nAt the Wilkes Barre Scranton airport forty five degrees forty one in Mount Pocono fifty three in Allentown in forty seven in Williamsport this is mixed bag and time now for our weekly album review\nNot exactly known as a hotbed of the blue which seems such an American creation especially with his origins with African Americans in the south but due to the proximity along the border many American Blues artists that played in Canada\nAnd a solid blue seen has developed going back to people like Ronnie fucking who organized group that would become the band and as included artist like the late Jeff Healy Tom lab and and the powder blues band and a critic blues man\nCorey Harris this week we have the latest release from an artist within over thirty year career colon James whose new album is Eighteen studio record is called miles to go\nColon James ... was born in Regina, Saskatchewan at age sixteen heard the late genes cotton and Winnipeg folk festival and was smitten eventually came to perform with regional blues fans\nIn Nineteen eighty four when the late Stevie Ray Vaughan was book to perform in Regina the scheduled opening act was not available and call and James was invited to fill in and had only a few hours to put together it's set with the band flying colors\nOn was impressed and invited call him James to perform an encore with him and then to join vaughn's tour as a regular opening act including in the U.S\nWith the career boosts that provided common James it said that Stevie Ray going\nOn tour as a regular opening act including in the U.S\nWas the career boost that provided come and James you just said that Stevie Ray going suggested dropping his surname on the stage name\nIn Nineteen eighty eight released his debut solo album which included some hit singles in Nineteen Ninety three James released common James and the little big bad which preceded some of the other records of the period that got into big band reporting like those Brian ...\nIn Nineteen Ninety seven James did an acoustic album called national steel and found himself on the folk festival seen for a while\nBut his heart was mainly in the blues and had been renewing his commitment to the blues in his recent release it\nHis last album blue highways issued into thousands sixteen was a collection of some of his favorite blues covers with his tasteful arrangement now he was out with miles to go which includes a song hurt James cut and played back at that folk festival when he was sixteen\nAnd which James do including two versions on the new release\nLike its predecessor miles to go features a nice balance a tight often sophisticated musicianship with classic ingredients for a good cross section of the blue styles from upbeat born Leighton dance ... tracks to classic slow blues drew a couple of acoustic tracks James is not a blues shelter\nBut conveyed the spirit of the blues in a more laid back style\nHis guitar work is also clean and articulate even when the two supposedly get down and dirty\nThe backing musicians are first rate and include a horn section on several tracks plus the African American gospel style vocal group the Sojourners the band in Vancouver made recording includes Jesse O'Brian and Simon Kendall on keyboards\nChris gesture in a rhythm guitar ... on harmonica steep pelletier a base in Jeff picks on drums\nThe record opens with one more mild that song James hurt harmonica man James cutting play at that full folk festival it's a Muddy Waters composition but James credits cotton for the arrangement\nThe James version features prominent harmonica Steve Mariner it's a rather typically strong type big blues arrangement with warns with a detriment\nMore down in the swamp musically is another Muddy Waters June ... still a fool which has the classic blues lyrics about infidelity\nA business for [noise]\nGenes includes an old song by Arthur crude up called dig myself a whole was rather apocalyptic lyrics which somehow seem relevant today are tempered by the bouncy rather good time arrangement\nNa\nLittle G\nO\nG do rather than the\n\nI Do love the\nDo rather than the\nDollar a day\nThey're\nMore\n[noise] better\nThan\n... ... ... and\n... ... ... ... and ... ... ... ...\nThe whole world didn't end up going to\nBe the law in the same song\nDo enough you know we're sure well when you're alone\nA job why why go generic\nWant to know about\nMy baby doll\nMom's baby down\n[noise]\nIn the ...\nJust before the birthday\nWhen you did\nDid not come down the\n\nJones you man\nAnd don't you worry\nA ... ... ... [noise]\n[noise]\nOn the dashboard ... routing number\nWas up in the news but the\nTravel back nine this fall or\n\nHow I hate to be low\nFor\n\nA kid cry former [noise]\nNow what do they say oh\n\nKnow wanted to talk to [noise]\nAh trouble to they\nDon't even know how to live and\nThey love [noise]\nNah\n[noise]\nGee how I have to be you\nKnow\n[noise]\nArchie line and former bay\nAh you know what the other day I go\n\n[noise]\nMother\nAnd my father had two\nBrothers in the army\nDon't know what to do\nLike this fall and\nGee how I hate to be\n\nI keep ... for a long way\nBut ah no one another\nA key ... well not really\nA no one of the day I don't\n\nMm [noise] [noise]\n[noise]\nWell I'm about to tell me and you can\nDo well but it only water go all the man\nI'm On the question\nWould be okay and do that a body count to ... what is so low man\nWas so love a man\nMay well oh love them and\nTraveled in bed for countries\nI've been there for well know bothers me\nWhat is so cool though man\nThat's a tough job can\nLove right on time\nThe doctors low beta man\nThey know the boat is a\nBible and you know I was right as far as that jazz none that man man ain't no birds and\nThe law that is not\nIn the book\nKnow\nRead about it from the\nI'm by no means what it was so bad\nMm\nMm\nAnd it's a long time frame asking do you ...\nEnters wall um a favor\nAsking you ... ... ...\n... said to\nBe good low ... kept\nClean\nIt's so long leading man has nowhere\nLonely and lay that has no ... Mm\nLoans that they\nHave and you know\nIt's a bad ... is on the chain Mm\nHave you with the good cop and so\n\nHave you with ... or ... or the copper so Mm mhm\nThen\nOh for\nGood low there in the pool boy on the ground\nAnd there's two ... ...\n\n... Mm\nJuly to you know lo\nO lo J. ... O. to that\nVery in ...\nAnd it will vary by\nAsking you", "year": "2018", "show_name": "Mixed Bag with George Graham", "city": "Williamsport", "day": "18"}