{"month": "10", "state": "PA", "station": "WVYA", "content": "\n\n\n\n\nThat's music from the saxophone quartet called for if you are with the addition of guest saxophone quartets weird to piece of the cold there you go thinking again and first we heard a piece called to be in love with the Miami saxophone quartet including a Gary killer Gary Lindsey\n... colleague Nick ... and just now with the group called sex to promote some Borg\nWe're to be called news time music from the group for the sexual quartet mark Watkins ray Smith send to make you and John Goodman sooner or the members of this quartet called for\nAnd that's a new release on jazz hang records and uh the elements cold there you go thinking gift wrapping up our sampling of new jazz recordings here on WB I Will have more new jazz\nReleases Tuesday and stay tuned it's mixed bag coming up next year on WB I say\nThis is W. V. I. eighty nine point nine up at W. V. I. H. D. one granted wheelchair he's holding in Williamsport W. B. Y. eight eighty nine point seven of them in Mansfield WTO eighty eight point three I found out at like while in pop back\nW. P. A. U. Ninety One point five FM streamed live a W. B. A. dot org we're in Allentown and not eat on point three and in Bethlehem at one of five point seven member supported public radio W. V. I. okay\n\nWhat percent of the food in American supermarkets to actually think is the definition of food is something that's a state\nWhat percent of the food in American supermarkets you actually think is\nThe definition of food is something that sustains nurses yeah as nourishment is something that increases your health so forty percent of the stuff than Americans markets wouldn't qualify as food ... forty\nPercent wouldn't qualify sued right how we connect with our food that next time on the radio hour from NPR Saturday new no W beyond a about\n\nProgramming a W. B. I. is made possible by our members and by Lindy corporation to pitch them for decades Libya specialized in underground municipal utility pipeline construction now focusing on harvesting the natural gas from under our feet in North east Pennsylvania\nSupport for WBAI comes from Scott packet connecting businesses directly to the Internet with Pennsylvania's public broadband network skyrocket brings a tear one Internet private network connections and managed network services to Pennsylvania's businesses in rural communities Scott ...\n[noise]\nGood evening and walk into a mixed bag is George grand during this first portion of the program and get some electric singer songwriters and roots rock band\nAnd then at eight thirty it's our weekly venerable music set the one time each week we pull the old stuff and we're ... we're going to spend the half hour um one band still be doing in the Nineteen seventies recordings\nAnd then tonight at nine it's mixed bag new releases and a tonight to a a blues band called the west coast feed also group called ... and Lauren Henderson coming up in the ... let's get underway with a kind of her roots the set here with the\nRock singer songwriters and roots rock band this is the band called ghost wagon from the cook cook in the dark\nAnd this is a tune called fading away music from the band ghost wagon [noise]\n[noise]\nNah [noise]\nPaying\n\nPaying [laughter]\n[noise]\n\n[noise] nah\nNa na\nNa na\nNa na fun I'm a man\nWere retreating ...\nBatman movie or a baby and [laughter]\nAnd ...\nNa na na na na na na na\nI'm sure and\nNa\nNa na\nNa na\nNa\nNa\nNa\nNa na\n\nNa na na na na na na na\n...\nAnd\nI'm loyal\nTo draw a ... and\n... o\n... man and and really limited and ah if you\n\nKnow man I don't\nMust be getting back\nDay he\n\n... ... ...\nBeen ... ... ... did not have been\nAnd then and\nAnd in the winter I\nWould be a ...\n... ... ...\nThe ... na na\n... genes\nThey get it and it is from a man\nBut then there was a\nThen and then\nTo man the\nIn the news last\nAll they want when they knew each\nIt's the day and\n\nEnemy that no\nThey gave me a\n\n...\nCan build\nA bomb on any go\nI'm not\n... ... ... ...\nNo I'm not\nBall\n\nA tab on and then show\nNa na\nNa na ...\nBall\nThat long\n...\nBe\n\n[noise]\n\nThe\nLittle bit you know ...\n\n[noise]\nThat's a band called he's coach hill from their new album called ... or ... everlasting in the name of the Ottoman someone called leave me I'm Sorry loved me a little bit more\n\n\n\n[noise]\nWay already know why that tune adding\nBrain didn't judge Judy ...\nA screen news the last\nThe screen and then you're going to be\nIt by a stream has\nWould know what I meant the thoughts on the\n\nBall ball ball ball ball\nBall or\nChanged your view on that day and the\nJohn Fong show we in films then then the complex [noise]\nDo you have seen in the ... you know\nAnd be done to tell you you're on the veil now on\nThe\nDo you want and what\nBrought down\nNo ...\nLes\n\n\n\n\nDi\nDi di di di come\n\nThe one you know how you get all the\nRoads\nOne\n\nBe the the the the the key to keep the\nPeace in the beep beep beep beep beep beep beep beep beep beep beep beep beep beep beep\nBeep beep beep\n\nThey the\nTalked\nMap of the\n\n\n[noise]\n[noise]\n[noise]\n[noise]\nThings [noise]\n\nFrom steely Dan rather venerable music set Nineteen seventies mostly in the last one was from Nineteen eighty\nA classic tunes although some of the lesser known steely Dan pieces but some were good writing buddy a great band would began with a project called you gotta walk like you talk at a pre steely Dan collaboration\nWith water Becker Donald Fagan a Denny Diaz from Nineteen Seventy one and from that we heard roll back the meaning after that from the way down album pretzel logic\nAnd with the water Becker Donald Fagan and Danny de as from Nineteen Seventy one and from that we heard roll back the meaning\nThat from the steely Dan album pretzel logic from Nineteen Seventy four we heard them doing a cover of the Duke Ellington piece east ah East St Louis to to Lou\nFrom the pretzel logic album Nineteen Seventy four then from the Seventy two ah debut album can't buy a thrill only a fool would say that from steely Dan after that from the Nineteen Seventy five album Katie allied we heard everybody's where everyone's going to the movies then\nFrom the royal scam album from Nineteen Seventy six we heard the caves of all to mirror then after that from Nineteen Seventy seven the I guess I I Would call it their magnum opus the are the most interesting in most to elaborate steely Dan ... the title track from the Nineteen Seventy seven album Asia featuring Wayne Shorter on sex\nA and I'm Steve get on the Drake great drum work and er Larry Carlton was on guitar or Joe Sample of the of the crusaders about electric piano there's just a great performance there\nAsia from steely Dan from Nineteen Seventy seven and from the last steely Dan out before they went into hiatus from Nineteen eighty from the album Groucho we heard time out of mind music from steely Dan here on WB I our venerable music set the one time each week we play old stuff\nBut if you're not ... got grand new music coming up in a moment as we explore new releases tonight a music from the west coast feed also group called ... both funky bands and also singer songwriter Lauren Henderson coming up in the next hour a mixed bag so stay with us here on WB I [noise]\nThis is W ... or an F. M. W. B. I. H. D. once meant and we'll see very ... and we're in Williamsport at W. B. Y. eight eighty nine point seven have him in Mansfield a W T I O eighty eight point three of them\nWere in a while and pop academically P. A. U. Ninety One point five out now\nStreaming live at W. V. I ain't got or\nWe have a translator and collect some it at Ninety point three I found your arts and information station listener supported public radio ... C I F [noise]\nImmigration authorities are rating more and more American businesses\nIt looked like something that you typically when the to the movies not something you ever find on living out in real life\nThe Trump Administration is going after employers who hire undocumented workers\nThis country will not survive if we don't straight in the way they can come over here and we're\nThe immigrant labor on the next MORNING EDITION from NPR News tomorrow morning from five to nine on W. V. I. A. F. ...\nSupport for WBAI comes from the citizens voice providing loser and county with breaking news every day for the past forty years the citizens voice thanks their readers who received news at home or on the go the citizens voice here to stay more information at citizens voice dot com\nSupport comes from customs container solutions a manufacturer of customers standard role was front and weird dumpsters and specialty containers serving the environmental construction energy waste and recycling industry's information at customs container solutions dot com [noise]\nIs mixed bag here's the weather forecast to expect a\nA freeze warning in effect from one AM to eight am friday tonight clear with low in the lower thirties for friday's sunny with highs and the upper fifties Friday nights mostly cloudy a chance of showers after midnight looked in the lower forties not as cold tomorrow night with a chance of rain being forty percent\nFor Saturday showers are likely with high in the upper fifties chance of rain sixty percent Saturday Night mostly cloudy with a chance of rain showers lows in the mid thirties a chance of rain fifty percent Sunday partly sunny with high and\nSixty percent Saturday Night mostly cloudy with a chance of rain showers lows in the mid thirties a chance of rain fifty percent Sunday partly sunny with hides in the mid forties Sunday night partly cloudy lows in the upper twenties\nOn Monday mostly sunny with ties round fifty Monday nights mostly cloudy with Lowes in the upper thirties and Tuesday partly sunny with ice in the mid fifties at nine o'clock at the Wilkes Barre Scranton airport it was thirty five degrees thirty two\nIn Mount Pocono forty two in Allentown\nAnd thirty nine in Williamsport was mixed bags to George\nGraham and after having the material from\nA nearly forty years ago from the ... got some brand new material a group called the west coast feed also ... both of funky groups\nAnd Lauren Henderson coming up start off with the west coast feed this is a an eight member banned including horn section and a violin I'm kind of a big blue the foreign band or they've only been together for about eight for about one year now they based in Seattle, Washington\nAnd I guess the ... west ... feet as a kind of a broadcast term that when a programs are produced on the east coast and there's usually a west delayed\nA presentation of the show for the west coast the west coast feed so I guess that's where they came from anywhere we gonna fortunes starting off with the I Know you watch that a piece called sky pines\nFollowed by sound of an echo and then you'll be long to me so here the band called the west coast feed\nTheir album the west coast feed and we'll start with a tune called you know you watch\n[noise]\n\nTo remain in charge\nGetting chatting\n[noise]\n[noise] do manage in China and\n[noise]\n\n[laughter] no no\n\nWe\nBut\nThere\nAbout\n\nThe time\n[noise]\nUm\nAnd\n[laughter]\n[laughter] [noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\nBoy\n\n\nThat's the the Seattle band called the west coast feed from their new album the west coast to feed and weird fortune starting off with you know what you want\nA or no you know you want it followed by sky pines in sound of an echo and just now you belong to me the from eight piece Seattle based band their debut album called the west coast feed and that's an independent release and uh their website is the west coast feed dot com\nMusic from the band here on WB I ate tomorrow night will be open for request as we are most friday evenings\nThere's something interesting in recent you'd like to play for you you can give us a call for tomorrow night show at five seven zero six by five to eight zero eight coming out of Lebanon or rather a ten after mixed bag tonight we have judgment cures corrupt but next up we have another new release this one is from me another funky bend number large group\nUm one more even than the west coast speed which is an eighties group the ninth piece group from\nFrom ah Brooklyn New York called ... which is the Turkish word for tow pads monkey band and uh we're going to hear three Tuesday I was called life in the city the ban organized in two thousand Lebanon this there\nFor like the album we'll start with a piece called make you famous than the one and the lonely and then a piece called if I ever fall asleep so you're the man trick was yep code life in the city and we'll start with Mickey famous\nOf the day these are real legal\nThe computer do then we\nOn the show right there\nUp eating the wrong\n\nAnd let me just stay\nOne even taken down\n\nBe in a bad\nJuniors on by the\nUsually they don't know well now we gotta go bad\nWhat do you know\nAnd it\nSeems\nWhere\nThey\n\n\nBe burned in a way to the\nYou put it in a way to keep all the way\nTo keep it away in\nBut in a way\nThat's music from the Brooklyn based nine piece ensemble ... as the album called life in the city where three tunes first of all make a famous photo by one in lonely and just now if I ever fall asleep\nWhich they probably will probably won't with that to dance music from the ... P. U. R. K. U. A. Z.\nTheir website is trick was banned a cop on mixed bag exploring new music each day you're on WB I\nYou're tuned to W. V. I. A. F. N. eighty nine point nine W. B. I. F. M. H. T. one Scranton Wilkes Barre hazel it's W. B. Y. eight\nEighty nine point seven FM Williamsport W T I O idiot point three FM Maine's Berg Mansfield in W. P. A. U. Ninety One point five to ... with a translator Lewis burger one hundred point one Indian Bethlehem at one oh five point seven\nAnd on the Web at W. B. I. dot org\n[noise] some and adding that to the edge of Celtic music absorb insulin style from the Celtic hotlines I Know right in the world like smaller than you think we take that next week and the ... [noise]\nSaturday evening at eight on WB I Am found [noise]\nHe well he\n\nThis is mixed bag to see George Graham and we're in the midst of our Thursday extended sampling of new recordings and the other one we have is any pie by singer songwriter Lauren Henderson the album is called rip tide sheets and native of um [noise] of um Massachusetts but divides her time between New York\nAnd Miami uh studied at Brown university were on an MBA but also went to Pueblo Mexico and studied indigenous culture there so there's a mixture of of different elements in this uh this project is called rip tide it's a a six song short links\nAlbum and a ... year three out of the six starting off with a piece called a mom a followed by rip tide and then a piece called ... so here's music from Lauren Henderson the E. pi is called ripped side rip tide and we'll start with a mommy [noise]\nHis last name\nIs still he's come in\nIs now you have\nSearching through the skin\nAnd now he's taken a\nI didn't plan on being a chance\nAgain I didn't win or being in use a ... you and\nSay you know during the mental status today\nAnd I mean they go on a drive\nAnd can you do when I'm thinking of a\nSo fans and I'm the only New York city you live my email stuff don't\nWe will change\nRain and then\nIn ... and ...\nWould have said oh she's\nYou know when I was being in a\nTo show that and I'm certainly not news and\nSay you know the email do stunts\nI'm ... I'm In uh do you\nThe king and I do when I'm doing and you\nShow things and I was really no use to use any use I mean\nAre families are struggling and none of\n\n\n[laughter]\n\n[noise]\n\nLatin acts now there's a little vain and that they should get China to more chose women\nThin ms ... that can be found down but with my they didn't need to you know when I get most of the brain cells that show ... days I don't think ah there's within the smell and know Stan money though this that\n... and I needed\nTo learn and now\n... I'm a\nThe\nIn their lives and\nMe then and then we can say she said you guys made me sick they\nDon't just do this time they shouldn't do this version of the men they get very dense in the sky but an incentive to see all\nThis ...\nShe ... and\nI needed and John\nI knew you\nThe little time\n\nChange the pen\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\nChance to show somebody in\nLast ... willing to\nGuys polish Jew for lying around tends to get to a\nLegal noodle [noise] to be to\nIt in Beijing has to deal with", "year": "2018", "show_name": "Mixed Bag with George Graham", "city": "Williamsport", "day": "19"}