{"month": "10", "state": "PA", "station": "WVYA", "content": "Music of freedom we heard a piece called all is one John diversity himself played the electronic valve instrument that synthesizers sounding peace or into a solo on that and uh one of the dreamers was did the uh the word lists vocal and there were some other of the dreamers in their some of them are going just by their first name\nFor fear of being deported a music from John diversity in the big band featuring ... artists the um called American dreamers voices of hope music freedom wrapping up tonight's edition of all that jazz for this Friday\nEvening we've got more jazz at midnight with jazz from ... stay tuned it's mixed bag coming up next year on WB I hey\nThis is W. V. I. A. eighty nine point nine FM W. V. I. H. D. ones granted we'll ... he's written in Williamsport WTY eight eighty nine point seven have him in Mansfield WTO eighty eight point three ... and at lake while I'm pop back\nW. P. A. U. Ninety One point five FM streaming live a W. V. I. I. dot org we're in Allentown in Ninety nine point three and in Bethlehem at one of five point seven member supportive public radio W. V. I. S.\n\nIt's great classic style jazz on WB I asked him from the ... channel Monday through Thursday from ten pm to midnight\nMany of the world's great jazz musicians have recorded for Kia scare oh now part of ... hey people like Clark Terry Phil Woods teddy Wilson Gerry Mulligan and many others\nYou can hear that cures hero channel on W. B. I. A. H. D. three and now top off your day with great jazz on WB I FM Monday through Thursday from ten pm to midnight and overnight on the weekend\nProgramming at W. B. I. is made possible by our members and by Pennsylvania College of technology inviting you to the limits of modern warfare stalemate technology and the sounds of front and the first World War presented by Dr John deck during the next edition of the technology and society colloquial series\nOpen to the public at seven PM Thursday November right in the club academic center auditorium at Penn college more information is available at P. C. T. dot edu slashed ...\n[noise]\nEvening and welcome to mixed bag to see George Gray and we've got new music for your Celtic from a group called the child's play and also singer songwriter in damning\nAnd then after that it's up to you it's our traditional friday request program if there's something recent you'd like to play for you and the variety to rock you don't hear elsewhere on the radio moment folk and blues world music um and Cajun zydeco Celtic and bluegrass jazz wrote fusion the number to call his five seven zero six five five to eight zero eight\nFive seven zero six five to eight oh wait on your program of musical discovered\nWell as mentioned we've got a Celtic music from a group called ... play this is the large fiddle Celtic fiddle ensemble or who have done some work for PBS um I think there was a PBS special involved with this group and other joined by a number of deaths including a Karen Casey the book was to\nGot her start with the group a [noise] a sellouts or the album is called the bloom of youth and we'll start with a piece called I'm cooking then de ... uh then after that a a medley\nOf tunes are including buddies [noise]\nStrapped spray that wouldn't whale and the farmers daughter and then the film the drum the Joni\nHe's a including buddies\nStraps brave but wouldn't whale and the farmers daughter and then the ... the drum the Joni Mitchell so we get Casey on the book so here's the group child support a bill called the bloom of youth and we'll start with a piece called ...\n... ... ...\n... ... where were you were little\nDa da da da da da da da da\nDa\nDa\nDa da da da da da\nDa da\nEating them and they don't\nPut\nThe put the nail\nBomb opinion on that and that did it\n\nOn tonight's mixed bag\nYou have any release we have is from a Twin Cities Minnesota based singer songwriter and damning or album is called dash and temper you see some of these songs had been issued on each piece in singles or a digitally and now they're up on this come put together and a full length album\nAnd we're going to hear four of them starting with the devil and his daughter followed by all I did was take followed by oh how I miss being single and that or too cold water so here's\nAn damning the album called dash and to temper and we'll start with the devil and his daughter\nGo oh man oh\nJeez well\nI [noise]\nNo I mean the ... [noise]\nNow patients have not had any [noise]\n\n\n\nAnd you\nMan [noise]\n[noise]\nThey matter and he and his name and\nYou know they can gain and the guy\nYou know we can\nAngel you wean na na\nNa na na na\nNa\nAnd on\n\nNo no no no\nBut you know these man\nAnd\n\n\n\n[noise]\n[noise]\n\n[noise] and\n... and ... you know a girl in the ... thing [noise]\n\n\nFor dinner [noise] nah\n...\n\nDo\nYou think\nYou're\nMaking\n... [noise] ...\n[noise] ... [noise]\nThe\n... sign ...\n[noise]\n[noise] what\nBeen to college you know\n... people\nTrying so\nThe\nThe ...\nMan\n\n\nNa\n\nNa going on\n...\nCritics man and\nHe\nFinally ... you're signing ...\n\n[noise]\nOh well I've\nNo one\nAgain in June the home\nPrinting knees [noise]\nOh well I\nReally high [noise]\nAnd all around\nNa na na renting\nThe last\n\nShabab\nThing about\n[noise]\n\n\n\n... ... ... ... ...\n... maybe\n... ... ...\nKnow the dog will decide who you\nThere's no new ... new book ... is\nThey'll call those he doesn't\n...\n... ... and\nNo no job how to me you\n\n... ... ... ... miles\nKnow ... yeah and and all of\nOld ... and he\nWe don't know no one\nOr ...\nWhoa\nMind na\nNa na na\nNa\nThen ...\n[noise]\n[laughter]\n[noise]\n[noise] ...\nThe like the ...\nThe very ...\nHe says that\nThey're very ...\n... ... ...\n... the way to ...\nTo go to Jean Vern ...\n...\nBut ... says no then you\n... percent sure\nAnd I know one day soon to be four in\nIt's your job\nGosh I'm ball on\nNot man that I\nSame ...\n... you\n[noise] you know ...\nThat's music from black Morris nights by request featuring Ritchie black more of the guitars and things from an album called under a violent moon and we heard Morningstar wrapping up a rather varied set which began with ... from their\nMost recent recording gets you a piece called triangle tier maybe tranquil tear\nAfter that music from Geneva magnets from her album called love is an army and we heard the title piece she was joined by Brian Steven's on the other vocal than an Australian group called sons of the east in the piece called into the sun from their album called already gone music from sons of the east\nThat a band called the red treads in a piece called Manhattan Bridge\nCeremony from the ... on top\nFrom a rabbit treads interest now by request\nMusic from black more it's night and a tune called morning star from the album called under a violent movies on mixed bag here on WB I act\nWell I've got a lot more music coming up we're going to remember a friend who passed away recently in a moment and then coming up that will be here till eleven o'clock and in Lebanon it's women in music would lead to good man here on WB I [noise]\nThis was W. V. I. eighty nine point nine up M. W. V. I. H. D. one Scranton ... and we're in Williamsport WTY eight eighty nine point seven have him in Mansfield a W T I O eighty eight point three of them were like well I'm pop academically P. A. U. Ninety One point five about them\nStreaming live at W. V. I. A. dot org we have a translator and collect so much at Ninety point three I found your arts any information station listener supported public radio W. V. I. S.\nA. average daily host of life from here [noise]\nYou know they see this country is more divided than ever but there's one thing we can all agree on that the people just mentally I Hope you'll join us for a glorious evening a musical comedy that just might bring us a little closer together\nDuring the Saturday for a live broadcast from a Fitzgerald Theater in Saint Paul Minnesota with the ... the war in treaty and Mr Gabriel ... tomorrow evening at six Sunday night at eight and\n\nHere's the weather forecast for northeastern Pennsylvania tonight mostly cloudy with a chance of showers in the evenings and a chance of showers after midnight lows in the upper forties chance of rain fifty percent for Saturday mostly cloudy with a fifty percent chance", "year": "2018", "show_name": "Mixed Bag with George Graham", "city": "Williamsport", "day": "20"}