{"month": "10", "state": "PA", "station": "WVYA", "content": "That's a serial killer on the television series Dexter I um\nI killed since and people know I didn't I didn't kill anybody so joined meal you're iceberg for NPR's our puzzle games entering the U.S [noise]\nSaturday at eleven AM on W. V. I. I got that\nIt doesn't take long to become addicted to opioids in fact Thirteen Pennsylvanians die from them every day [noise] Geithner is\nCommitted to ending opioid addiction with prevention and treatment in the last three years we've reduced the amount of opioids we prescribe like fifty percent\nAnti doping three medication assisted treatment centers to help patients recover from it takes me learn more at guys are diehard slash had enough she [noise]\nGood evening welcome to mixed bag this is George ... coming to you pre recorded this week but we have a full slate of features on our musical agenda got some eclectic bluegrass during this first portion of the program\nThen at eight thirty or so we've got the date sampling of new releases interesting album by singer songwriter and Malcolm Holcombe and it kind of a a gypsy uh\nFlamenco influenced version of some rock heavy metal tunes by an artist named Terri eludes coming up and then at nine it's a homegrown music pre Halloween special we've gone into our archive and are going to be featuring some somewhat spooky song by regional artists and that's coming up tonight's mixed but\nWe've got some blues and sold on tonight's mixed bag here on WB I Would start with an a pop a bitch from her three disk set trilogy and this is a tune called is tomorrow was today [noise]\n\n\nWe're all over\nAgain well\n\n\n\n[noise]\n\n\n[noise]\n\nBe three in my mind\nDont know\nNo vote\n[noise] the bomb\nDon and da da da\nDa da\n\n\n\nNo we don't have the data grown\n\nMen and broken injury\nThe out of the\nWay to\nIn Vegas\nDay well why\nDo they do [noise]\n\nJohn hands down in a\n[noise]\n\nDay the love and a lot\n\n\n\n\n\n\nAnd\nThe\nNight in Iran\nDi\nDi\nDo\n[noise]\n\n\n... ...\n...\nNa na\nUsing from electricity suitor and offer loving you from the album of the same name rubbing up a set of blues in Seoul which began with Anna pop a bitch from Serbia from her album called trilogy in a piece called if tomorrow was today that have been from Midwest a couple of siblings group called trampled under foot\nAnd a song called dark of the night from their album called a badly music from the band called trampled underfoot\nThen the ... trucks band was Grammy winning group from their album called live at the Fox Oakland and a tune called let me get by extended version of the piece was also the type of one of their album\nAnd after that to music from Chris appears soul singer so called don't fight it from the cold you've got to see what Chris appears just now electric pie Souter was our guest on the ... music series while back\nAnd offer loving you from her album of the state next to blues and so on two nights mixed back you're on WB I at\nW. B. I got them at NPR are like nothing else you got enough for ballot back to base journalism your programs that nourished remind you look forward to the next driveway moment that keeps you in your car when you just can't miss even one second of that great story\nPrograms that nervous remind you look forward to the next driveway moment that keeps you in your car when you just can't miss even one second of that great story independent journalism and intelligent entertainment that's why you listen\nThere's nothing else like it listeners support makes it possible your contribution pays for programs you care about that keep you informed and feed your curiosity\nThen it's All right well let's see do we do a\nDance go ...\nUm the other day and\nWell do you\nDo this you're gonna\nEnd up dropping the chance to\nRoad runner lord my\nIn my college in ...\nRight here in ...\nIn my closet ... but yeah and\nIn the rain and the good\nStruggle loans you have a ... game\nThose lines and their brain movies do out there and\nStreet ...\nDo have a\nBrain to dress in\nAnd um my\nCome air or how about\n...\n... river\nClose to know who's going to do was miles from\nMe and you know ... ...\nWorld the way to de debris there have been known for a new which uh\nNew\nShows Joe God\n... and the na na\nNa na na you know ...\n... do you live ... ... do\nYou a little a mile long dom ...\nNa ve man man\nPraying in the in\nThose uh na\nYear that is a good night's man a German [noise]\nA little and my mom's gone bad you know\nNa na ve those uh that\n\nThat is music from Malcolm Holcomb his album is called come hell or high water and weaker fortunes first of all left alone public by I don't want to disappear then October morning and gone by the all the sunrise\nFolk songs from a real a veteran who's been on the music scene for quite some years now since he's Thirteen album and that's how I Believe called proper records P. R. O. P. E. R. records music from Malcolm Holcomb H. O. L. C. O. M. B. E.\nIt's mixed bag were spotlight the new releases a little later on a pre Halloween collection of spooky songs from our homegrown music archive so stay with us for that\nTomorrow night we featuring a special album presentation than you recording by Gabriel ... very interesting solo album of songs inspired by a lake the train trip that he took that's coming up tomorrow night at night well\nLet's get to where are the new releases sort of so many interesting album by a rocker named up cherry you lose ... L. O. U. S. and what he does is some versions some covers of songs many many of them from the heavy metal but some from a classic rock days with the kind of\nFlamenco influenced backing it and or the other was called gypsy dreams will start off with the Peter Gabriel tune in your eyes followed by the duty brothers talk long train running and then the tune by rainbow called kill the king hears music from Terry it loose the album called gypsy dreams and we'll start with in your eyes\n[noise]\n[noise]\n\n[noise] Mm [noise]\nHe\nLives in their mouth\n\nYeah\n...\nWay and then a\nDelight to have\nLady\nRead a\n\nLong as three that\nMe he became an idea\nThink that I\nThe ...\nLive in the bill much bay", "year": "2018", "show_name": "Mixed Bag with George Graham", "city": "Williamsport", "day": "31"}