{"month": "10", "state": "PA", "station": "WVYA", "content": "'cause like from meds toiling in violin and a medley of meet the Flintstones and\nUm I got rid of them based on the same court changes I guess there from the album called plays the sixties playing the sixties meds toiling in the ... men and before that it was the\nWD are big band led by trombone is Marshall jokes doing piece called switch back solos by Carlino stress Meyer on Alto sax Paul Hitler on tenor sax in Hungary decker on drums music from the cologne base WD are big band with Marshall jokes on the leading the group\nAnd playing trombone wrapping up tonight's edition of all that jazz tomorrow evening will be exploring new jazz recordings and in a moment it's mixed bag so stay tuned here on WB I\nThis is W. V. I. A. eighty nine point nine ... W. V. I. H. T. ones granted we'll ... in Williamsport WTY eight eighty nine point seven have him in Mansfield W TI eighty eight point three ... and at lake while I'm pop back\nW. P. A. U. Ninety One point five FM streaming live W. V. I. A. dot org we're in Allentown in Ninety nine point three and in Bethlehem at one of five point seven member supportive public radio W. V. I. S.\nOh it's great classic style jazz on WB I asked him from the ... channel Monday through Thursday from ten pm to midnight\nMany of the world's great jazz musicians have recorded fork here ... now a part of ... hey people like Clark Terry Phil Woods\nTeddy Wilson Gerry Mulligan and many others you can hear the ... channel on WB I. A. H. D. three and now top off your day with great jazz on WB I Am FM Monday through Thursday from ten pm to midnight and overnight on the weekend [noise]\nProgramming a double you'll vi is made possible by our members and by Lindy corporation if pitched in for decades Lydia specialized in underground municipal utility in pipeline construction now focusing on harvesting the natural gas from under our feet in northeast Pennsylvania\nSupport for WBAI comes from sky packet connecting businesses directly to the Internet with Pennsylvania's public broadband network sky bracket brings tear one Internet private network connections and managed network services to Pennsylvania's businesses in rural communities Scott ... dot net [noise]\nEvening and welcome to mixed bags George Graham we have some new music to share with you including Elvis Costello was a new album and also the markets king band at eight thirty we've got a reggae set in tonight at nine an hour of electric instrumental music some jazz rock fusion and some rock instrumental and maybe\nSome electronic stuff along the way as well on tonight's mixed bag here on WBFO hey let's start with a new Elvis Costello Abbott and this is his first studio album since two thousand ten [noise]\nUm and uh it puts them back together with his group being postures from way back I think he started working with these guys in the\nEarly eighties or even late seventies and um [noise] Elvis Costello was touring and had to cancel a few dates are in July due to a cancer treatment but I guess he's bounced back now\nAnd uh the new album is called look now we're going to hear fortunes first of all a piece called underline than don't look no further by dishonor the stars and then photographs can live so here is Elvis Costello his new album called look now and we'll start with the ... underline [noise]\n\nBy your ears Elvis Costello ... new album called ... now and we'll start to the to go under a lot\n\nThose words\n... ... years Dr\nThe Jones\nShe is ...\n... ...\nJoke pick J.\nThe child\n\nPre\nThe ...\n\n... ... ...\nMm Mm no new no\nTroops in Dr seuss mhm [noise]\nOh no\nNo\nNo\nGotta G our when I had\nDidn't treat you well\nThat you\nAnd I'm a home\nI was gonna say when we\nWake\nMay use the word\nBlonde joke\n\n\n\nNa\n\n\n\n\nTo ... to to\nThem\nYou're no\n\nThink you know pre\nTo ... what do we do go over there we\nLove this right\n... do we do go over the the\nWas re the man\nThat\nYour blood\nYou're going to do\nDo you love\nAre here to tell her\nHe\n\nWho are getting into that no no no no I'm a\nNew\nTo look for in\nGeneral\nLike that you\nAnd gave up with the others are moving here there you have to go\nSaid you're going to be my first\nYou know or the other\n\nI'm older\nA\nBrain do my job for\nGrew\nVery mental\nCare either ... or ...\nOr ...\nThey do things that go with\nThey do to read I don't know that we will\nDo we do know who are you guys don't do\nTo go to\nAnd look why would that mean\nTalking with that last year to\nLeaving on me that they need\nAre gone you know these people in your heart\nNew book you'll be back on your ... your ...\nIn jail because they know how people talk ... mom\nFunded one near ... will be a new leaf told me not me talk to your brain that you\nUm the de\nDum de\nI'm not going to get a new topic\nTo go\nAnd look for you know with the record appointments tightened a cheap one segment\nBut didn't know holding goals that they could\nPick up where were you know ... to\nLike you know Russia I don't know maybe cutting meat there must be\nAre in the number one what you're saying\nAlways want to be run by the majority\nMean I like everybody\nKnow one day you're not going to be I don't want that to be tied up you know the\n\n\nThe ... they will be in the end and the\nThey searched and searched and searched and\nThat's the best\n[noise]\nThat's that's I mean there are many on average\nUrban diners\nEverywhere I go\nOver there are very young you arrive and\nStuff like this that and\nSo not with each other\nThere's really nothing\nTo do my brother and we are rich began\nAre generally on diet\nExercise\nAnd there's a rebellion in the rye they need to be but then the young guys but then a young guy by\nThat is rising Josh\nJosh Renault pieces\nReject the prince the food that they\nEver get into those don't\nThat they create a\n\nDi\nGo\nGo and within a young guy\nA on their side\nDish every day in the\nThe ... who is in the new\nOn Iran most shows they're busy ... nobody's going to nominate some time bomb to\nIn good company by the time\nKnow if you know open your mind and enjoy the bloods on\nHis comedy is John John is\nOn this call is rabbi next Sean Diddy\nBonding is on his\nHas come to rabbi Shawn day [noise]\n\n\nHe was a ... an shaggy from their joint album for for eight seven six named after telephone\nOr area codes for the u._k. and Jamaica rubbing up a reggae set on tonight's mixed bag we begin with a band called slightly stupid in a piece called too late from the album called everyday life everyday people\nThen after that it was a J Douglas from Jamaica from the album called lovers paradise in a piece called celebrate my love than Ziggy Marley Bob Marley son someone called rebel ... rebellion rises from the rebellion rises from the Marley\nSpend another real veteran reggae artist ... motives from his album from this year called the ...\nAnd a piece called in this jungle\nThen to reggae band from the island of Guam and the Pacific the group called for peace man\nThat is in favor of of the lack of war for peace rather than that for your P. I. E. C. it's a ... a sea banned for peace and to the tune called up for a ... hour from there I'm caught always love\nAnd just now staying and shaggy from their joined them for for its seven six and a piece called a morning is coming\nOn mixed bag here on WB I ... I said well we got a an instrumental\nCollection coming up the electric instrumental on tonight's program tomorrow night we have got hungry music with the the um bluegrass band called the coal town runners recorder here at the w._b. ice studios back in two thousand Fifteen and so that's coming up tomorrow night nine here on WB I Am [noise]\nIs W. V. I. eighty nine point nine up M. W. B. I. H. D. ones granted Wilkes Barre ... we're in Williamsport it WTY eighty nine point seven at the end it meant to be able to W. E. T. I.\n... V. I. H. D. once granted Wilkes Barre ... we're in Williamsport it WTY eight eighty nine point seven at the end it meant to be able to W T I O eighty three of them\nWere like well I'm pop academically P. A. U. Ninety One point five of them streaming live at W. V. I. A. dot org we have a translator in clock so much at Ninety point three up at your arts and information station listener supported public radio doubled in the eye [noise]\nNations I eat as a stand up comic with cerebral palsy and that's part of a stick\nIn their ... I Would win the gold medal counters and yet it's not fun\nI'm female I'm the same old and I live in New Jersey [noise]\nThrough the pain that next time on the Ted radio hour NPR [noise]\nSaturday afternoon W. V. on a up at\nProgramming a W vi is made possible by our members and by Lindy corporation of pitched in Lindy is committed to the local development of clean safe and abundant Marcellus natural gas harvested from under our feet in northeastern Pennsylvania\nSupport comes from customs container solutions a manufacturer of customer standard Ross front and weird dumpsters and specialty containers serving the environmental construction energy waste and recycling industry's information at customs container solutions dot com\nHere's the weather forecast for northeastern Pennsylvania\nMostly cloudy tonight with Lowes in the upper thirties for Tuesday mostly cloudy with a chance of showers in the afternoon high in the mid fifties\nChance of rain forty percent Tuesday nights mostly cloudy a chance of rain showers in the evening load in the mid thirties chance of rain thirty percent for Wednesday partly sunny in the morning then becoming mostly cloudy with high in the mid forties Wednesday nights mostly cloudy lows around thirty\nThursday mostly sunny with high in the lower forties\nThursday nights partly cloudy loose in the mid twenties\nAnd friday mostly sunny with highs and the upper forties look no to Saturday mostly cloudy with a chance of rain or snow with high in mid forties precipitation probably for Saturday is\nFifty per cent at the Wilkes Barre Scranton airport to forty one degrees thirty four and my Pocono forty eight in Allentown in forty seven in Williamsport [noise]\nThis is mixed bags George grammar going to do something we do from time to time is features some stuff without singing some electric instrumental\nRock and fusion and maybe even some other\nStyles in the mix here but start with a great blues Iraqi instrumental by guitar stay fields this is from his two thousandth Seventeen album called a an leashed and this is a tune called anticipation you anticipating you ... fields here on WB I may\nGo\n\n\n[noise]\nAnd\n\nA\n[noise]\n[noise] [noise]\n\n\n\n\n[noise]\nJeeze\nShipping\n\nThe [noise]\n\n\n[noise]\n\n[noise] she\n\n[noise] she was a\n\n\n[noise]\nLittle twenty guitar music from a band called the insect surfers from their two thousand fourteen album infra green\nAnd we'll get a tune called el Diablo Diablo habanero wrapping up a set of instrumental on tonight's mixed bag electric instrumental fusion and stuff like that we begin with music from day fields blues and rock guitar player from the un quote unleashed\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise] [noise] [noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n", "show_name": "Mixed Bag with George Graham", "year": "2018", "city": "Williamsport", "day": "23"}