{"month": "10", "state": "PA", "station": "WVYA", "content": "But ...\n\n...\nDa da da da\nDa\n\nNa na na\n[noise]\nOh whoa whoa whoa\n[noise]\n[noise]\nTo\n\n\nWill\nBe\nBad as ... and then\nOf the\n[noise]\n\nDon't even know who\n\n\nHe was like from ... Barnes and Larry McKenna their joy album called the more I see you and we heard the title track in just a piece called three miles out\nA booty Barnes on the left and Larry McCann on the right if you're listening in stereo Lucas brown on Oregon Byron bulky Wilkie Landrum on the drums\nAnd that's a new release on seller live records wrapping up our new jazz releases segment for this evening tomorrow night big bands stay tuned to mixed bag coming up next on WB I hey\nThis is W. V. I. A. eighty nine point nine ... W. V. I. H. D. ones granted we'll ... we'll soon in Williamsport WTY eight eighty nine point seven have him in Mansfield W T I O eighty eight point three I found out at like ...\n... ... ... Ninety One point five FM streaming live a W. V. I. A. dot org we're in Allentown Ninety nine point three and in Bethlehem at one of five point seven member supportive public radio W. V. I. hey\nIt's great classic style jazz on WB I asked him from the ... channel Monday through Thursday from ten pm to midnight\nMany of the world's great jazz musicians have recorded for ... you know a part of the IRA people like Clark Terry Phil Woods teddy Wilson Gerry Mulligan and many other\nYou can hear the ... channel on W. B. I. A. H. D. three and now top off your day with great jazz on WB I asked him Monday through Thursday from ten pm to midnight and overnight on the weekend [noise]\nProgramming a W vi is made possible by our members and by Lindy corporation of pitched it for decades Lydia specialized in underground municipal utility in pipeline construction now focusing on harvesting the natural gas from under our feet in northeast Pennsylvania\nSupport for WBAI comes from boom city Brewing Company in restaurant in the heart of Williamsport a proud like coming county corporate club sponsor helping to make W. V. I. F. M. programming possible thank you boom city Brewing Company in restaurant [noise]\nEvening and welcome to mixed bag this is George ... we have a set of progressive rock contemporary progressive rock is our first to\nThat eight thirty is the day sampling of new releases a couple of rocky singer songwriters frankly LA and uh also Brooks Forsyth actually more of a country guy and that'll be coming up in the eight thirty segment and then tonight at night is homegrown music within a bluegrass band from northeast PA who unfortunately broke up a couple of years ago but they're live music was on an ogre music or\nThe group the coal town ...\nRecorded here at the station back in two thousand Fifteen and that's on tonight's mixed bag here on WB I well let's get underway with the progressive rock stuff here\nBack in the seventies it was all the thing with the you know the classic rock groups like gifts and Emerson lake Palmer but uh uh in recent years bans had been keeping things complicated musically\nI think one of the the interesting ban an inter best bans along the kind of wine is is a freeze muggy we're both are jam band and an art rock and this is a track from their new\nA limited edition\nCD full length album called you and a piece called seasons music from um freeze biggie\nYou have a limited edition\nCD for like the album called you and a piece called season music from ... ... you're on the ... and\nDidn't want to wear a wire bra but at the time\nA good\nDa da da da da da da da di di\nAnd we're we're not going to bed by ... points shy\n... and bad for your call and I cannot\nDollars on the line and blah blah blah\nDi da da da\nDa da da\nDa da da da da da da\nAnd ... and ... go off\nAnd then in ...\n\nDied when he was green\nThe news or in the chain you down\n... and the big money\nShow them the new\n...\nYour your\nLewis\nWhat's your last day brings down\nHouse\n...\n...\n...\n\n\n\n\n\n... she\n[laughter]\nYou're\nA new\nYou'd be really they really\nNeed anything\nFor a day [noise] and and and and in a\n\nIn a\nWay way\n\n\n\nGot\nWe all know the da\nDa da da da da\nOur on\n[noise]\n[noise]\n\nAnd\nAnd\nThe\nOf the ... and it didn't\n\n\n... Europe apps and me and she can scale of the ... ... ... now for the whole ball robbing the national news\nYou know Don Roche may need to be\nMost children there's lots of cigarette\nSmoke and the guilt school moved\nTo the name of the people to do just won't do it all glad\nFemale lead you say well\nA year or\nAnd the reason we don't man\nWhen you're not ...\nThe machine is gay and all of\n\nKnow\nYou know my mom\n\n\n\n[noise]\n\nMedia that Google\nShoes you know I Will hold\nIn town we ...\n... oh\n[noise]\nMy boss and then\nI'm just about a mile [noise]", "year": "2018", "show_name": "Mixed Bag with George Graham", "city": "Williamsport", "day": "24"}