{"month": "10", "state": "PA", "station": "WVYA", "content": "\nTierney sucking doing the ... song consider me gone from her album the sting variations with\nChristian Jacob on piano Kevin axed on base and rape Brinker on drums and before that from back in Nineteen sixty four Sonny Rollins with blue in ... in a trio with ah probably about ... on base and a royal courteous on drums\nFrom a collection called sunny Romans and company Nineteen sixty four\nThat's it for tonight's edition of all that jazz but we've got more jazz coming up at midnight with ... jazz and tomorrow night's tune in for jazz standards with Sasha Feinstein at nine pm followed a ten by the Saturday edition of all that you stay tuned it's mixed bag coming up next year on WB I\nVisit W. V. I. eighty nine point nine F. M. W. V. I. H. D. once granted Wilkes Barre ... and we're in Williamsport it WTY eighty nine point seven at the end in Mansfield a W T I O eighty eight point three of them were like well I'm pop packet W. P. A. U. Ninety One point five about them\nStreaming live at W. V. I. A. dot org we have a translator in clock so much at Ninety point three of them you're arts any information station listener supported public radio W. V. I. S.\nHelper and live from here with the early enough that even at partly to live in San Francisco this weekend [noise] you know the one with the Golden Gate bridge\nTune in for that's Lindy knocking hand answer rain gutter rap rats\nRadio movie there with our new music director Mike Allen Danielle and argued that team with our allies in America correspondent Tom pop I don't know [noise] tomorrow evening at six Sunday night at eight [noise]\n[noise]\nThe Williamsport simply officer conducted by my store Edelstein opens October sixteenth with works by Racine each ... and Brian\nGrammy nominated in chart topping violinist Caroline Golding plays Chuck ... violin concerto [noise]\nLame sports in the October sixteenth a community outsider five seven zero three to six twenty four twenty four or Williamsport symphony dot org [noise] sponsors who the capital group at my come in college\n[noise]\nEvening welcome to mixed bag is George Graham it's friday so we're open for request if there's something you'd like to play for in the varieties of recruit a material from Nineteen nineties on a in the varieties rock you don't hear elsewhere on the radio moment folk blues world music and so and give us a call if you'd like at five seven zero six five five to eight\nZero eight for requests on tonight's mixed bag and of course we have new music to share this is your program of musical discovery guaranteeing you brand new music each day and a bit later on the Gary Doug was bad will start off with a new recording\nShare they seem to your program of musical discovery guarantee you brand new music each day and a bit later on the Gary Douglas bad will start off with a new recording by veteran of our music series going back to I think the late Nineteen Seventy is a great veteran singer songwriter currently based in Saratoga Springs New York\nMichael ... his new project is called family recipe\nAnd or we're going to hear for pieces from this starting off with the the title track family recipe then it's three am followed by beach house Nineteen Seventy three and then a tune called that's why Republicans he trains the IRS music\nFrom singer songwriter troop adore Michael ... called family recipe and we'll start with the title piece\nMm\nSome ...\nYou know mother's\nFamily ...\nBorrowed from\nSally in his name in the upper right hand corner\nLabs ... than staying\nTo equalize the scholarship do\nHalf cup John ... has been a\nQuarter\n...\nPer a day\nA family was in tatters\nGod to or not we\nWe uh\nWe had to lay down in Florida\n...\n\nSorting through a dead man did matter\nOr was\nShare you rose one that's what we live today\nFor the day which\nWas we were on a date for God and cookie\nWins ...\nKnow you can't\nLose fountain pinning\nHit her my dues\nFamily rents ...\nBorrowed from\nBorrowed from around\n\n[noise]\n[noise]\n[noise]\n... ... a\nBuys a nine to five\nChallenging [noise] why it's such\nA good um\nYeah I can\nKids used to\nIt is three and\nWell they had went wrong\nYou've had one in the right\nFor them to\n\nTicks a\n[noise]\n\n\nChristian to dream on that with their hands you know what you think is right I think is wrong\nShowed me a whole battle show in jobs and some\nOf the yeah the na na\nIs in the late ...\n[noise]\n\n[noise]\n\nNa\n\nNa\nA\nAn anger\n\nFor someone who\nModel ... then we will\nYou\nWe didn't know\nIt will be the middle\nWe'll all be dead and go\nYears old so\nDa da da da\nWill change you know in\n\n[noise]\n[noise]\nAnd\n... where you know\n... ... ... ...\n... ... ... ...\n... ... ... ...\n... ... ...\n\nTo\nTo place and then\n... ... ...\n\nOr ... or\n... ... and\nShe\nCalled me\n[noise] ...\n... ...\nJury and they are\nAnd shoot the\nCar keys\n\nAnd she was\nGone and you know\nAnd she still na\nDog\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis is W. V. I. A. eighty nine point nine I found W. V. I. H. D. ones granted wheelchair he's holding in Williamsport WTY eight eighty nine points that I Am\nIn Mansfield W TI eighty eight point three ...\nAnd at lake while in pop back WPN you Ninety One point\nFive FM streaming live W. V. I. A. dot or\nWere in Allentown in Ninety nine point three and in Bethlehem at one of five point seven members supportive public radio W. V. I. S. [noise]\nNext fresh air weekend hammer Jenkins tax about writing and directing her new movie private life during captain Han ... as a couple in their forties trying to have a baby by any means necessary\nAnd New Yorker staff writer at an asthma attacks that Mark Zuckerberg and the crisis at Facebook trainer\nSunday evening at six on W. V. I. A. F. at [noise]\n\nSupport comes from Bloomberg children's museum or you and your children can meet your favorite superhero suddenly heroes alliance this Saturday costumes are encouraged with games crafts and more this Saturday October sixth from tend to to what the blues gr children's museum more five seven oh three eight nine nine two oh six\n\nHere's a weather forecast for northeastern Pennsylvania mostly cloudy tonight with a slight chance of rain we've petri drizzle after midnight patchy fog after midnight with those in the lower fifties for Saturday\nMostly cloudy with a pet you fought in the morning a slight chance of light rain in petri drizzle it in the morning then a slight chance of showers in the afternoon with high in the upper sixties chance to bring twenty percent\nFor Saturday Night mostly cloudy lows in the upper fifties on Sunday mostly cloudy in the mornings and becoming partly sunny with a chance of showers and thunderstorms hides in the upper seventies for Sunday with a\nForty percent chance of rain Sunday night mostly cloudy with a chance of showers and thunderstorms low in the lower sixties\nUh warm night Sunday night\nForty percent chance of precipitation Monday Columbus Day partly sunny with a chance of showers and sundry storms with ties in the mid seventies chance of rain thirty percent Monday Night mostly cloudy thirty percent chance of showers lows in the lower sixties and for Tuesday partly sunny with high in the mid seventies\nAnd nine PM at the Wilkes Barre Scranton airport sixty degrees fifty eight in the Poconos sixty seven in Allentown and sixty three\nIn Williamsport but there's a mixed bag this George cram coming up on Monday we're going to do another of our collections of a collective instrumental as long as you don't think is is that the title so joined us for that people playing not singing\nAnd it's Monday but rubble for requests for people singing and playing or whatever or something in the recent\nUh last twenty twenty five years or in folk rock blues world music the other distinctive style as we cover on mixed bag five seven zero six five five to eight\nZero eight for requests had a request for the Australian band halfway um listener said they have a new album or which one fortunately we don't have so this is from their two thousand Fifteen album called any old love and uh this is a tune called honey\nI light cue music from the band halfway from Australia [noise]\nOn and on and\n\n\n[laughter]\nYeah ... ...\n... ah\n\n... ...\n\nPer per per\nNumber to call her on her\nFrom the number or\nA\nCrop up the\nDramatic\nA lot\nWe have been a little\nWent straight and Baja\nMy my under a\nKnow about the bell global lie\nAll over Iraq and all\nTo be a\n[noise] I\nLot about the momma\n\n...\nA a\nUh\nFor a\n\nA\n\nA\n\nA\n\nA\nA\nA\n\n\n\n... ... ... ... ... ... ... ... ... ...\nSherry have pawn shop around and go do some like food ... love grown cool the long came up ... ... ... ... ... there's no turning\nAround ... rural\n\n... did in his pocket drove down town and try to walk down\nAt the bottom ... there's a love note Carmen ... right you know ... ...\n...\n... ... you\n\nHave no job on\nPlane down or the blacks are so\nLong because I'm black\n\n\nReally back seat in another room we share everything that you know not every day teach them or not waiting for\nA dollar a dollar job throws a road that around ... ...\nYou know you ... do ... ... ... and as I Do see the the\n...\n... marine matter\nBroke down to Florida for a man a let me give you\n\n...\n\n... [noise]\n[noise]\nA I'm a man and\nBut I Know I'm\n\nThat I'm\n... ... ...\n... ... to\n\n\n\nI didn't know you come\nTo the nine ... no not that you need to get that died you know when you're the you're on the bench being and know your food to feed you know and you'll be ... in the navy\nAnd\nFrom their most recent album called crack up\nAnd a piece called fool's errand than a piece called be still from Becca Stevens from her two thousand Fifteen album perfect animals from Becca Stevens and just now music from markets eating going back to two thousand ten\nFrom his album as if you had wings and a piece called eleven a mixed bag here on ... we are here\nTill eleven PM then and eleven o'clock it's women in music with Lenny Goodman so stay with us for that coming up on Monday we'll be featuring a set of eclectic instrumental is wide ranging people would just don't think so stay with us for that Monday on mixed [noise]\nThis is W. B. I. F. M. eighty nine point nine [noise]\nW. B. I. F. M. H. D. one Scranton Wilkes Barre results in W. B. Y. eight eighty nine point seven FM Williams porch W T I O eighty eight point three FM means Berg Mansfield and W. P. A. U. Ninety One point five FM Palmyra township with a translator Lewis burger one hundred\nPoint one and in Allentown at Ninety nine point three and on the Web at W. V. I. A. dot org [noise]\nNext I don't ask me either we've got comedian Tom Arnold star of the new show the hunt for the Trump tape [noise] plus singer songwriter Jill so we'll put born with their very own Jonathan Gold than any music parity game about artists to go by one name so joined me\nHere at for NPR's our at where again and your idea [noise]\nTo borrow at eleven AM on W. V. I asked them\nHere is the weather forecast for northeastern Pennsylvania mostly cloudy tonight with a slight chance of a light rain\nAnd patchy drizzle after midnight and also patchy fog with close in the lower fifties chance of rain twenty percent for Saturday most cloudy patchy fog in the morning and the chance of a drizzle and light rain\nAnd then a slight chance of showers in the afternoon high in the upper sixties chance of rain twenty percent\nFor Saturday Night mostly cloudy with Louis in the upper fifties on Sunday mostly cloudy in the mornings and becoming partly sunny with a chance of showers and thunderstorms hides in the upper seventies\nChance of rain forty percent Sunday night mostly cloudy a chance of showers and thunderstorms blows in the lower sixties chance of rain forty percent Monday Columbus Day\nSunday night most cloudy a chance of showers and thunderstorms blows in the lower sixties chance of rain forty percent Monday Columbus Day partly sunny with the chance of showers and thunderstorms hide in the mid seventies chance of rain thirty percent on a\nMonday Night to expect mostly cloudy skies with low in the lower sixties chance of brain thirty percent and for Tuesday partly sunny with high in the mid seventies at the works very Scranton airport sixty degrees fifty eight in the Poconos sixty seven in Allentown and\nSixty three Williamsport this is mixed bags George well let's continue on had a request for the regional bluegrass jam band\nA cabinet this is from their two thousand Fifteen album celebration and this is the title piece celebration music from the band the cabinet\nAnd [noise]\nHave any generic [noise]\nOh I'm\nYork they breathe or maybe Dairy Queen\nYou're not hungry he's been with the way we come back in the cold and you make your mood\nBrain then that's when he\nCharity hospital hot gems one driver said\nThe law but this is why I say good Bye bye\nNo\nNo no I\nWas just weird to see one of those three things we learned to type one such budget burned in the late to do the\nBy their space to do that you love to buy\nNight I Would love to go but it's about half\n[noise] well that\nMum on track to my\nDa\nDa\nJob by by bill ...\nDing\nClear up the peaks and valleys\nYears I mean again do phobia ... going\nIn the near and dear\nAs busy as the million dollars is\nMovies do this you know and\n...\n... ... ... ...\n...\n... ... ... ... ... ... ...\n... ... ...\n... ... ... ... ...\n...\n... ... ... ... I was like I\nThey\nThe ... de de yeah\nThey are\nA job will be the ... ...\n... Mm ...\n... ... ... ...\n\n... for\nAd on\n...\nAll\nGet out and where I live\n...\nI Am\n...\nYeah they\nI ...\nI mean I'm not sure the\n... ... ... ...\n... me will will will with ... ... Mm Mm Mm\nMm\nMm not understand the main ... in this\nRight now\nI'm a ... ...\n\nYou know against what range\nWhat can\nIn a in\nI'll be I'll Try\nOut again\nNa\nNa na\nNa\nAnd\n\n\n\nAnd\n[laughter]\n[laughter]\n[noise]\n\nYou know\nMom and\nBack the land braver than\n\n\nShe said [noise]\nRow in me the\nThey were\nThen the\n\n[laughter] [laughter] [noise]\n[noise] [noise] [noise] [noise] [noise] [noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\nBall\n\n\n... ...\n... ...\n\nFrom ... in my hands\nAnd said I'm grateful for real cool night an acquired\nThen of course\nI'm a lawyer in cereal boxes that ... those diagnosed after all the years and then we don't know ...\nThey can create ... ... ...\n\n... ... you\nKnow you have a hard wired with that person for brutality crack the other condition like your\nOwn more power to keep them in the\n...\nWord from a bat alive that can actually but and I'm Sorry that you\nCouldn't give away ...\nIn the ocean\nResiding drowned\nDe\n... dragging on every\nThey um [noise]\nLong way and then", "year": "2018", "show_name": "Mixed Bag with George Graham", "city": "Williamsport", "day": "06"}