{"month": "10", "state": "PA", "station": "WVYA", "content": "\n\nMusic from saxophonist match habits based in\nChicago and Oregon native and his new album is called forward motion and he was joined by Josh lab on keyboards Kurdish whites on base and Bob partly a on the drums and we heard a piece called the small retail\nMusic from Brett or math to shove it's M. A. T. T. S. H. E. V. I. T. V. his website is matchup it's dot com and independent\nRelease from Chicago based sex is wrapping up our new jazz releases segment for this evening or more new jazz recordings Tuesday joined us for that we've got requests on tap tomorrow and stay tuned it's mixed bag coming up next year on WB I hey\nThis was W. V. I. eighty nine point nine F. M. W. V. I. H. D. once granted Wilkes Barre his will and we're in Williamsport it WTY eight eighty nine point seven have him in Mansfield a W T I O eighty eight point three of them were like well I'm pop academically PA you Ninety One point five of them\nStreaming live at W. V. I. A. dot org we have a translator and Clark so much at Ninety point three of them you're arts any information station listener supported public radio W. V. I. S.\nHuman beings I made up of just four letters a G G G the same four letter that every speech on the planet has billions of letters of code if you had every page filled with ease g's and T's you'd have eight hundred dictionaries worst of genetic code\nAnd that code decide who we are [noise] guy Raj that story next time on the head radio hour from NPR [noise] Saturday afternoon on W. V. ...\n\nProgramming on WB I is made possible by our members and by Lindy corporation of pitched in Marcellus natural gas is clean abundant and domestic Lindy is proud to be part of the solution to our growing energy needs\nSupport for WBAI comes from sky packet connecting businesses directly to the Internet with Pennsylvania's public broadband network sky packet brings a tear one Internet private network connections and managed network services to Pennsylvania's businesses in rural communities skyrocket dot net\n[noise]\nGood evening and welcome to mixed bag is George Gray and we've got to an eclectic Celtic set during the first half hour of the program then at eight thirty it's the weekly venerable music federal go back to some old jam band music from decades ago and then tonight at doing mixed Agnew released the two rather\nIntrospective albums by singer songwriter piano one of whom is pretty well known a which will explain and also we'll conclude beyond which we reviewed last night by\nMadeleine Peru the album called and some and that'll be on our up around nine thirty or so on tonight's mixed bag but start with a Celtic set and we begin with the group we've had on her own music series the a group called house of Hamel\nOf featuring Rose Bowl dino when Brian do Ken and she of the group burning Bridget Cleary and he from the group or a enter the haggis they got\nHave a patron Rose Bowl Dina when Brian Cannon sheet of the group burning rigid Cleary and eat from the group uh enter the heck I guess they got together musically and marriage solely and are working together they did a like a great life over a musical isn't trauma their brand new release called march through storms\nAnd it's a set of instrumental called the late ... music from the band called how to handle\n\nWhy he ... money blind but lately the one the ...\nNear the ability to learn to live right John this is really\nI ... didn't really know\nAre to leave the men they would have the the\n...\n... ... lead up to the eye by young door\nWould you know the the ... I Love your trouble um when\nI hear your little ... the\nPay the ... on\nUpon me a really when\nI turned on the tae Bo ...\nUp\n...\nYour ... to ... Laura\nFlew ...\nBe ... or ...\nWhen this knock out by a\nA good job at a time when the money around\nDon't like me they kept me leave me alone\nI Am Dianne me\nFor a little over a new revenue they\nRoommate London rather me bowl\nI Am now they are the\nAnother you know nah no my day I mean in my brave\nDoll and in my may just be the way a job ... not by eight ... I'm going to be doing chores\nBlue or red or a or a\n\nDoll linked to higher paying you know being a\nMy head I read in\n... to ...\nLay down in my day\nLady do it by saying that the the way the jungle on\nWell\n[noise]\nWe're written do reading\nMagazines J go on\nWas married to an hour you know\nRaising the band and they\nBoth have to be related I\nThey they play that spring\nAnd the boat it all went from\n\nEnd and\nAnd\n\n[noise]\nAnd do\nWe got one more tune for those ...\n[laughter] can we\nAnd\nYou can you\nCan can\nCan you can\nEat eat\n[noise]\nShould be\n\n\n[noise]\n\nSantana at the Woodstock Festival Nineteen sixty nine and soul sacrifice wrapping up instead of jam bands from back in the day to pieces from first from Nineteen Seventy one in June of Nineteen Seventy one at the Fillmore east to west\nFillmore East concert given by the Allman brothers band and we heard in memory I'll be ... read from the deluxe CD set version of either peach which didn't appear on the original a pie and I'm just now from Woodstock\nFrom August Nineteen sixty nine\nSoul sacrifice with Santana some old jam band music on tonight's mixed bag here on WB I that's her weekly venerable music said we'll have more old\nMusic next Thursday I go to a brand new music coming up in a moment so stay with us here on WB I a program of musical discovery mixed bag tomorrow night by the way will be open for your request for recent\nMaterial so uh it was called for tomorrow night if you think of something maybe some of the twenty first century jam band or something like that so that's tomorrow night we got brand new releases coming up a couple of piano singer songwriters [noise]\nThis is W. V. I. eighty nine point nine a pound W. V. I. H. D. one granted we'll ... in Williamsport WTY eight eighty nine point seven have him in Mansfield WTO eighty eight points ... and at lake while I'm pop back\nW. P. A. new Ninety One point five FM streaming live a W. V. I. A. dot org we're in Allentown an added on point three any Bethlehem at one of five point seven member supported public radio W. V. I. S. [noise]\nBaritone saxophonist Leo Parker brought our and be sunk the enough idioms I'm Sasha Feinstein joined me for jazz standards for the W vi age studio in Williamsport Saturday Night at nine or ... [laughter]\nHere's a weather forecast for northeastern Pennsylvania mostly cloudy tonight with a chance of showers and a slight chance of hundreds storms during the evening than partly cloudy after midnight tonight in the upper forties getting cooler lows the chance of rain for this evening it's forty percent\nFor friday mostly sunny with hides in the upper sixties on friday night partly cloudy in the evening than becoming mostly cloudy with those around fifty four Saturday mostly cloudy with high in the mid sixties Saturday nights mostly cloudy ...\nBeing the evening than becoming mostly cloudy with those around fifty\nFour Saturday mostly cloudy with high in the mid sixties Saturday nights mostly cloudy lows in the fifties Sunday mostly sunny with high in the mid seventies Sunday night partly cloudy those around fifty and Monday Columbus Day\nPartly sunny skies with high in the upper seventies at the Wilkes Barre Scranton airport sixty nine degrees sixty seven in Mount Poconos Seventy three in Allentown in sixty Seventy Williamsport this is a mixed bag this\nGeorge Graham and we've got a brand new recordings to share for you and uh tonight as mentioned to piano singer songwriters one of whom is probably\nA well known these days as a musical director for the Steven Kobe or late night show John but these two heads to ban steak human this is mostly solo album for him of course he grew up in New Orleans\nAnd is steeped in that tradition you also real um classical conservatory musicians very versatile guy and the job of features some additional people who appear occasionally but it's mainly\nJohn ... students piano and some vocals the album is called Hollywood Africans and we're going to hear first of all the great ... so instrumental peace ... followed by the St James infirmary blues traditional tune than a than a regional peace but it's a kind of a mixture of\nClassical and I'm really stride piano called not turn number one in the minor and then a piece called green he'll zone so here's John ... and the album called Hollywood Africans and we'll start with the ... ...\n\n\n\n\nIn in\n\n\nI went down\nTo St James van V.\nWell you know so my baby and\nStretched out long long why the only yeah\nSo called um so they don't\nA little goal lead on boom\nA\n... way of the movie she may be\n...\nShe can surge which is why and\n...\nWhich is now the gambling going was fine when the Bush I'm drenched in piano land man like me no\n\nMm\n\n\n\nOr he did an album is last album a was a called the ambassador door which we featured on her weekly album review and um [noise] it's been turned into a symphonic quirky tours\nWith a with doing that um some songs about the Ambassador Hotel in in Los Angeles this new album also has a theme behind it it's called book of travelers\nAnd uh it came about when he embarked on a a a long winding train ride around the country a total of eight thousand nine hundred and eighty miles\nThat he started on the day after the two thousand sixteen presidential election and or\nThe ... says that he left behind his cell phone and any other Internet connected devices and he spent the next two weeks talking with dozens of people strangers on the train a we're kind of woven into a cycle songs on this album and uh it's really interesting is he's a great songwriter who writes he's wonderful\nAh harmonic textures uh even though this is just a solo piano vocal or there's some really interesting and emotional ah states that\nTextures or even though this is just a solo piano vocal oh there's some really interesting and emotional\nStates that the music goes through we're going here for peace is first of all November ... by ... trains that a piece called eighty nine eight even ... miles is a real road trip that he took and then what if I told you here Gabriel ... called book travelers and we'll start with the Peace Corps November\n\nMiddle East which are saying and then\nSelling obscene is washed away\n\nLook how\nState issues\nAnd as I drink from [noise]\nBetween the Palestinians ... do the window units [noise] sixty eight I she talked to said on the TV plenty to some extent [noise]\n\nMe and I can move a broken one man they smack [noise]\n[noise]\n[noise] [noise]\n[noise] the three\n[noise] sweet to me [noise] I Am a three story [noise]\nIn how long how sick to me it would be willing to call them going on [noise] what's down due to the middle [noise]\n\nHow's come back we'll see you know to see some Thompson foot three [noise]\nMy cell coupon to to go to show the glass the Rodney\nKing the issues that come to know right\nIn the middle ...\nSon ... joy no gain some screaming\n[noise]\n[noise]\n[noise] then\nI ... to ... to the problem no man\nPeople in a major\n... do you think\n[noise] um\n... willing to like you to swing\n[noise]\nComedy Graham Tom nice to talk of the department of then too yeah [noise] we look in the ... brand names [noise]\n[noise] [noise]\n[noise]\n... [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe family [noise]\nCeiling saying said Bonnie dream\nThey can smile and clean or just go home and do you do man played with my dreams nine major last night in St Louis Missouri\n\n[noise]\n\n\nThe plan was to be able to do to go now who is standing there tattoos\nWhen Carney says the full blast my cell phone\nPhone suitcase or get spoiled glue bill is an ad that reminded me to you\nAgain to to to gain some much scene and so the joke by the I Would approve usually the punchline shattered now come\nYou know\nDrinking was keen there [noise]\nAnd ... and [noise]\nSo ready to jump in and we\nClose\nChildren to a new\n[noise]\nMayor being held\nYou may or\nMe man\nWhen will come\nNow I never watch for time\nWatching me and I\n... if they care I'll be on\nGo to a new\nMaybe you\nMay be\nWay or the\nYou\n\nNow I never watch the time\nWatching [noise]\nKnow the one\nNamed\nHis five day\n\nKnow the ... [noise]\n\n\n[noise]\n[noise]\n\n[noise] ... did you see things going wrong\nAnd hit a well known that\nIf she did\nCry over oh let's go home now but I Need to really not known to [noise]\nFish I've seen\nMe you\nAnd all that stuff really does\nAmount of it so we might as well and\nWe might be close and\n...\nFrom the little people kind of plans and\nControl your kids\n[noise]\n\nTo change your tensions\nHim now look the guy the night\nAnd I'm not a fool I knew\nGuidance and on and love and bring well people starving so we'd like to join\n... name came to my mind It's Wednesday\nAnd the two candidates ...\nTo me to\n[noise]\n[noise]\n\n[noise]\nYeah we ...\nOf them might as well\nMy son's day\nWhile\nWe might as well day\nBefore you can make\nThey saw your kids made good\n[noise] um [noise]\n[noise] ...\nAnd uh uh a\nSeal make it clear she almost fifty ... ... ... ... ... I don't know you have to tell it does your news or ... ... ...\nSome ... some of the ... I don't know it was really the measure delays\nJulius I'm like yeah yeah she'll go under the law you can't do no ...\nReally needs your leisure they virtually go do model some\n... I\nDon't know [noise] ... I don't know the\nMaterial a mellow they didn't used to look them belong there may chilies series on the on the\nCreek don't know [noise] just to ... for them to generally don't necessarily was [noise] ... [noise] they said don't you know\n\n... don't do it\nThen there was [noise]\n... Zhang please don't know [noise]\nSerial shed good buffet do the math silly but to do a lot more done yet their mom\n... no ... I don't know [noise]\n... [noise]\n... femi [noise] you'd have to\nDo so being she kind of I don't know to the shelter to share that go on the job will fall\nDon't leave me she'll shed ... ...\n... I don't know [noise]\n... ... ... ... that down the road [noise] yeah I Know she did she says she sees\nShe'll ... she'll ... they could really two new demo non [noise]", "show_name": "Mixed Bag with George Graham", "year": "2018", "city": "Williamsport", "day": "05"}