{"month": "10", "state": "SC", "station": "WVOC", "content": "What kind of on the ... same debate here in the bombing was in the ...\nMeaning\nDon't miss your chance to win W. B. O. C. and all states seamless gutters one hundred thousand dollar call home makeover think of the possibilities one hundred grand to spend on your home how ever you to\nEnter for a chance to win now at W. V. O. C. dot com using keyword home and let the remodeling begin that's W. V. O. C. dot com keyword home\nW. V. O. C. and all states seamless gutters one hundred thousand dollar phone home makeover\nPowered by lifetime cabinets and counter tops\nSell it to burn brighter solutions Carolina pool tables plus and all states seamless gutter\nDo you live in a haunted house deepest fears of summer when you're in your living room carpets still frightened of what the parents may have done to the gym floor smell like ... died in the bedroom\nOut here that that might have been too much hey this is Jonathan wash the good news is the war and the Harvard is knocking on your door with three rivers Halloween guaranteed lowest price on carbon fine or anything [noise] boring trust is more than one job and I love\nQuality I Am but boy lifts your spirits where the holiday\nDot com bubble every one this is ray and Mary and an athlete glass you're like oh my aunt ... that's what I mean\nThat you can be confident it's a high end car dealers trust us to get the job done right\nYou can see that athletes\nLaughing ... for all your out of hand and then this last me how I got a new three ... wine Kevin ... theory theory\nAnd don't forget you home windows patio doors tabletop shower doors Mears storefront aid you can see through it we can do that [noise] [noise]\nThis is ... joy for food Paul F F ... nine three to six to three hundred more vivid I've when addicts or we separate fact so Folsom say\nHandled improve this is real\nMe for America now tonight at nine here all news radio five sixty W. B. O. C. [noise]\nHey fifty two down back over to sports is Christopher Thompson\nGary was another crowning moment for another Carolina alone the patch\nAny signs of Dr ... lab shattered failed\nSteve Pearce setting the tone last night but that to run Homer off LA ace Clayton cursed shot in the first inning\nThere's additives solo shot in the age he was named Ceres MVP as the red Sox won the world series being the Dodgers five to one when the fall classic in five games and fears Tacoma big individual trophy for his success\nBaseball game you know\nAnd he gave me a great thing that happened and I are very blessed to be here and\nThe veteran who's played for every team in the a a least got picked up by Boston in June he and another former game ... an ounce Jackie Bradley junior two huge pieces of the postseason puzzle for Boston Radley was named the envy of the A. L. C. S. football they didn't get their first lead until late Saturday nights but they made it stick just not quit\nJust never quite and believing in one another and are just plain old game [noise] and um I think it's one of the most complete games that we play\nThis year that's Jake Bentley the game ... quarterback\nAs Carolina came back to beat Tennessee Saturday twenty seven to ... for the game ... foreign three on the season I think it will miss this Saturday I found out of state resident who was a leader in the racehorse industry passed away Aiken Scott Campbell\nFounded dogwoods stable home of among others twenty Thirteen Belmont Stakes winter palace malice Nineteen Ninety Preakness winter summer squabble and Ninety six Breeders' Cup junior Phillies winter storm song\nHigh school football on a Sunday yeah rescheduled games ... airport the Brooklyn Casey yesterday thirty eight twenty seven the eagles ... champions of region five for a candidate was everywhere yesterday\nTo fix it without going\nPanthers radio with the goal is game Newton accounted for three touchdowns couple in the air one on the ground the Panthers or in the ninth straight home when\nThey beat the ravens thirty six to Twenty one the rams continue to stay on beating on this season as LA oh when a ... victory over the Packers yesterday also the chief remained the top team in the AFC they improved just have a new one being the Broncos\nThirty two twenty three the eagles started the day with a twenty four Eighteen whatever the jaguars in London joy ... is the first four spots in the final round of the NASCAR playoffs he wins Martinsville yesterday with a bumping run pass on Martin ... junior and that sports are on WB you'll see in her ...\nSentiment just called the ... federal credit union traffic tip line says the right length black Seventy seven south down before the bridge on the contrary to have a wreck there to plan is three for three ten fifty five will be back to sat in a bar with traffic updates for your drive home on five sixty W. B. O. C.\nSeventy two today fifty four now the airport fifty three uptown at five sixty WB oh so\nThis is a laser Kaufman Clinton and it is my favorite time of the year it's time for football and that means time\nTo tell gay come see us at the meeting place it Kaufman's and we guarantee the he will have the most popular tailgate at the stadium she's from great steaks ribs chicken hamburger patties hotdogs and are delicious chili and don't forget our own Kaufman's onions sausage\nCan't you just tasted Kaufman's Nathan ... the French is meeting the midlands [noise]\n\nWorry that isn't about any more than their football parties will create red company near that cleaning will handle any and all of them then you come here I read that the two forty twenty and get free rent in a highly clean friendly when Nineteen again to thinks he's forty twenty or online at zero rats Columbia\nSome red sell it back were there for the right way to clean\nDoes your home office workspace need a new look into the sea a weapon the dot com today to start your search preview thousands of new quick ship desks chairs workstations biochemist bookcases in more at your leisure ... find something you like to visit Colombia office\nFurniture is twelve thousand square foot she'll room at three of one race don't boulevard to see the city and and feel actual samples before you buy or browser use election abused office furniture for high quality affordable options layout design services and installation are available star search today at C. O. F. F. C. dot dom Colombia office furniture we furnished solutions\nHi this is Gary Davis recall space better because you know that up to sixty percent of the indoor air you breathe comes from that crawl space\nOh it's a health issue and it's a money issue to ignored foundation and structural issues will only get worse to become a major expenses robbing you of the equity of your home healthy\nHome starts from the ground up call ... now for your free ... point written crawl space inspections coal eight six six eighty eight crow or log on to crawl space ... cops you tell them I sent you you'll get ten percent off ... eight six six eighty eight crawl\nHigh is Gary David from ... Woodley and South Carolina homes and land realty I told you for years have I ever decided to sell my home I'd be calling lands well my wife and I decided it was time that of course we call that you've heard Glenn Beck talk about Lance now I've heard so many great success stories and talk to so many people\nWho've got their homes sold quickly for top dollar that we weren't concerned\nBut we weren't ready for what happened in our homes sold contracts fullest price in twenty four hours full list price\nLamps Woodley and his team itself into homes and land real this is what they do for everybody they do it day in day out they've been doing it for years local realtors who do the ... they know how to price you're home get ready for sale and by the way so covered those sell your home at a price and the deadline you agree to if that doesn't happen Lance will buy it for cash\nNumber to call a oh three four o seven thirty eight eighty three eighty two three four o seven three eight eight three the website ... dot com that is Lance will come and do what we did start packing\nTraffic morning\nRadio I see you see a fifty\nDollar out of here but not to get ... you know I mentioned that article that the was it a Yale Professor Rosen the wall Street Journal last week yeah and and Glenn Beck has touched on it too in the last couple of days why Americans for why the left hates Trump and it talked about\nA couple of the things that we all\nIt makes us uncomfortable Trump is\nThe average American in exaggerated more blunt simple willing to fight miss stressful intellectuals but he also grew up rich so he's got no filter he has he that's the problem that we all have with them I think is he has absolutely no filter he doesn't hold back\nAnd he tends to bully on line but at the end of the day\nWho do you want to be your president ... bottom line right they're\nBroadcasting from the studios W ... or ... radio station\nAnywhere you go on the\nCourt appearance today\nThe death penalty maybe later on Dave Anthony Fox News that's Robert Bowers future the accused gunman in Saturday's synagogue shooting spree\nThat was a vigil last night in Pittsburgh for the eleven people murdered six others were wounded it was\n\nThat's one of the nation of Israel exist if people don't understand\nThat is why no one ever wants them no one ever stands for them they're always the last in line and so\nThe world just cited let them have this scrap\nOf land they say was theirs because of the Bible let 'em have it it's uninhabitable it's it's just nothing but a desert there's no oil there's nothing there just give it to them\nAnd the Jews happily took it restored to their homeland\nAs the only nation on earth to be wiped off the face of the map and then to be restored to two thousand years later exactly as foretold\n\nIsraeli exists because no one seems to want them Israeli exists because they have a right to live\n\nSo let me go back to Russia and our musical friend\nIn Nineteen eighty nine forty years after the battle of Stalingrad the Hebrew immigrant aid society was helping Jews get out of the Soviet Union and go to Israel and to the United states and they provided lawyers money to find homes food even language classes to help them assimilate in their new country\nFor the first time ever\nGregory and the rest of the Jews that he had known that had survived both Hitler and Stalin could concentrate on something more than just surviving\n\nThey had a right to pursue their happiness they could practice their face they could be proud\nOf who they were they could finally live\n\nThe group that saved him the Hebrew immigrant aid society is the oldest refugee assistance organization in the world let me say that again it's the oldest refugee assistance organization in the world\nBut it was established in the Eighteen hundreds and they're responsible for assisting thousands and thousands of Jews and a few years ago they open up their services not just to Jews but people of all faiths\nAll faiths that are persecuted and need to be rescued\n\nTheir currency a CEO was asked recently why they decided to do it\n\nIs the answer couldn't be more perfect we no longer help refugees because they're Jewish we help refugees because we are Jewish\n\nReason why I'm telling you the story is this is the organization that I'm mad man went into Philadelphia\nTo try to stop\nThis is the organization that was attacked on Saturday morning at the tree of life synagogue\n\nStory never seems to end the eleven people were killed in the deadliest attack on Jews in our country's history\n\nStories like Gregory filled the synagogue that Saturday morning\n\nThe horrors that collectively endured unimaginable to most people and yet here we are again the group of people who now have to concentrate just on one thing survive\nAnti Semitism is evil anti Semitism is a disease\nAnti Semitism is as old as the world\nFrom the moment\nGod said I Will make you my people there has been anti Semitism and eight is on the rise as it always is in times of nationalism and socialism every time the Jew is the canary in the coal mine they are always the first\nAnd if the world doesn't pay attention at that point it's Washington blood\n\nIf the world decides they need to come for the Jews I proudly declare myself a Jew\n\nThe world makes promises all the time and they don't ever intend on keeping them\nBut I Do\nWe said never forget\nI've told you you are in the audience that will in the\nIn ... the republic save the republic and it's not going to be through violence the world is going to become more and more violent\n\nWe must be a unique and peculiar people because the vast majority of Americans to know this is not who we are\n\nThis is not who we want to be\nAnd we will stand shoulder to shoulder with our Jewish brothers and sisters\n\nWe will stand shoulder to shoulder with her Christian Brothers and sisters in the middle east\nWe will stand shoulder to shoulder with a Muslim that is being rounded up by the Chinese\n\nThe cycle of hate\nHas begun again and it's not Donald Trump and it's not Iraq Obama\n\nIt's a cycle that has been running since the beginning of time\nAnd the world always acts the same way because it always comes in a time of chaos it always comes in a time of fear\nIt always comes in a we cycle when the forget the individual it's what's best for all of society it's why our\nFounders came here in the first place it's why our founders defended the Jews\n\nWe're a different country we're of different people we're\n\nNo better than the rest of the world we just see things differently\n\nAnd if we don't shame on us\nOur pilgrims came here thinking that they were completing the journey from the red sea\n\nOur first gray seal of the United states was the pillar of fire and pharaohs horses and the party of the red sea\n\nI don't want to just survive I don't want to\nDo something to earn a living I Want to live\n\nFDR said this generation has a rendezvous with destiny I echo those words\n\nOur generation must be the generation that breaks the cycle there is no one\nElse in the world who will do it who will stand against this onslaught who will stand against the hatred in nationalism and the and the the collective ism\nThe extermination of people that just aren't good enough\nWe are headed that way we are headed that way once you cannot talk to your neighbors once the other side has nothing to offer you have to eliminate them because they're the devil there that\nThe w._b. oh the new center of\nWhat's being called the deadliest anti Semitic acts in the history of the United states is throwing up some painful memories in South Carolina prayers\nIs said for the victims of Saturday's deadly shooting at a Pittsburgh synagogue yesterday as a Charleston church that was the scene of that mass shooting three years ago\nThe accused shooter goes in front of a judge this afternoon facing twenty nine charges and the murders of eleven people fall and heroes laid to rest in Florence county funeral services held yesterday at the floor and civic center for deputy Farah Turner who died last week\nShe was shot nearly three weeks ago and that ambush that also killed Florence police officer ... and the Boston Red Sox World Series champions after five one win over the Dodgers in game five in LA former USC game Koch Steve Pearce he's World Series MVP\nBe here right now in the dream come true\nHis teammate also former game ... center field or a Jackie Bradley junior will also get a ring Jake or what news radio five six feet W. V. O. C.\nIt's one of the most successful bridal events in the mid ... when you went okay bridal expo Sunday January sixth of the Columbia metropolitan convention center\nPuts your business in front of hundreds of new clients and just one afternoon showcase your services network with other wedding boroughs and most importantly book new business the window for seven W went okay bridal expose Sunday January six it's presented by American floral southern white catering and Colombia bridal associates\nSo reserve your space today at bright city shows dot com that's bright city shows dot com\nImagine for a moment [noise]\nIntense storm is pounding your house will your roof leak will decide below away what about your basement Willard flood\nIf your house was properly built and maintained\nYou'll be fine\nWhat about your four O. one K. or your investments\nYour retirement income just stock market has had a great\nRun in the past few years but it's it's current turmoil making you feel uneasy [noise] are you confident your portfolio was built to whether a\nFinancial storm right now maybe an ideal time for you to get a second opinion on your retirement strategy preservation specialists gone\nZero three four five for nine zero four or five ... we'll let you know if your portfolio ... some weather appropriate age zero three four five for nine zero four or five investment advisory services are for two kilos capital link\nBetween I have a twenty four hour from her for that one of my family I can only\nSeven cents [noise]\nGlenn Beck and\nWe welcome to the program Mr a path gray a hello pat how are you ...\nThat was a good how's your weekend a it was a it was not great and why why not\nIt was a you know a bad football games uh experiences everywhere I went\nAh what do you what you experience everywhere you know you're not having a hard time talking out and speaking\nTrue you know that would be easiest thing in the world right now sure sure it is sure it is\nThis uh this weekend a I had a really I really had a difficult time uh I mean I just\nDid you guys watch the news all this week you know as little as possible I write a little bit because of the shooting 'cause I get the updates but yeah yeah so only to get the updates and stuff I I don't know who's watching cable news anymore yeah\nI I never watch cable news never mind the highlights I get the clips but I don't I don't actually sit there and watch Fox\nNews can't or oh the N n my heaven forbid and MSNBC or CNN jet why don't you\nDon't want those I don't know who's doing that and they do I really don't know who's your\nFans watch Fox you know 'cause uh it's a safe haven mostly unless you're watching Shepard Smith\nA but it's always been that way but I don't know I'm just\nCNN I don't know who does cause that's it's on ...\nAnd so people who hate Trump ... yeah I guess the only reason I ever turn any of that stuff on it sort of the show you know because we're supposed to be aware of it right and do you do that occasionally but I certainly out\nIf I was not in this business I don't know why I Would bother with any of that oh I wouldn't I Would listen to them talk about early do down a synagogue thing is he's oh literally it how many ... comedy questions that is until they can get to a question about why Trump's Trump's fault like that Joe Lieberman on this morning\nAnd Lieberman is like you know sort of very slowly but surely\nBut he's like you know did he he didn't go there to help with the first question was ah you know but what about the what's going on you know give us your opinion and he's like you know look I live in a country as a Jew where I was basically anti Semitism free my entire life I ran for president and senator\nI I was I was a winning senator and a state with two percent Jewish population and uh I never felt some anti Semitism my entire life\nHe's he's like you know we have to make sure that we don't we don't have that blah blah blah\nThis is a terrible tragedy then they're like well\nWhat what what part of of that you think is is the the climate of today ... and and and Lieberman to his credit was like look first of all we need to make very clear that this shooter\nA outwardly hated Donald Trump\nYeah with a lot like Donald Trump he was not a fan of Donald Trump or as long as you don't sign him to be a ... do more broadly we do have this problem with with with discourse and I think that's true I mean I I think that's obviously true that the overall our discourse is pretty terrible at the moment\nBut it has nothing to do with this and all these cable news networks are ... that were telling you that it does mhm they're obsessed with telling your wife well\nWe don't want to blame it on a dull Trump I'm just saying it's Donald Trump's fault\nRight [laughter] that's really is really that's what they're doing never said that about Bernie Sanders Bernie than ever that guy was working for Bernie Sanders' campaign and he went out and he shot all of the geo ... and another guy and tried to tried to bring to kill thirty Republican seat\nThat's really tend to the Republicans was working for Bernie Sanders yeah never said that was Bernie Sanders fault no we never said that and neither did I say and either do today yes of course not they didn't even talk about it because they they had a very balanced view of that one\nRe understood that individuals were responsible for their own actions that time is right understood that then they just don't understand it now because now which is not benefit them in and they always complain about this course isn't that a great example of terrible discourse yes\nWe can sit on both of these things right when if a Republican and now the pipe bomb think thing thankfully didn't get anybody hurt 'em but you know we did see that ah with with the Bernie Sanders situation\nBut both situations we said the individual is responsible the discourse is it is an interesting aside because overall it's not healthy for a country but it's got nothing to do with these individuals shootings and I'm going to do with it and you do not eat ... discourse does not commit murder doesn't happen\nSo the reason why Rob ... and this morning is because uh you know or he sees doing more on trivia and uh and porridge trivia is that is always the laugh and so we wanted to find out how it went on friday a pet uh\nYeah it's it you know it's a chance to get away from the discourse for a little higher like an hour a week as and just be mean to yeah and just be mean to\nVery long time and for someone in your position to actually said out loud and don't you dare apologize for that\nSo I'm not going to apologize to you know you know me you know me well enough to know that when I'm never going to end on that one\nAnd in fact repeat it ah it consistently just repeat it and it was fabulous and again it was you know I wanted to call for so many times and that just made me just pick up the phone and say hallelujah\nThank you thank you so are you coming to the show in Cleveland or what is it Saturday no it's on Sunday becoming\nNo because we're going to be out of town not going to be out of town really 'cause I already free tickets but a serious way though and now all of a sudden you're in it can change that I get your change your plans I've got free tickets for if you want if you'd like them\nSyria I Am serious goes by ... that that would I change my plans okay All right All right good thanks Suzie we'll see you or what is the Sunday\nUh Cleveland I think it Sunday yes it's connect dot com slash tour by the way for the tickets and the details on we're going to be ... it's going to be fun there's a lot of election stuff to talk about ... ah ah stuff\nMay have been gift from the gods as far as serial goes the the ... turned completely insane so it makes the comedy fairly easy\nAs it does\nAnd a Pittsburgh we've got something special for you there were going to have laughs and and comedy\nBut uh also uh I Am taking all of the proceeds from the I'm from the event\nAnd um we're giving them to\nI'm not sure if we're going to give them to the synagogue or to or to\nThe uh the refugee um oh yeah a group I'm not sure we're going to give 'em to yet but we're we're uh we're\nWe're standing with uh Israel um and uh so the proceeds to your tickets or will be going um to a a local Jewish um\nCenter perhaps the the synagogue launcher an ounce fans from an anti Semite like why would you do that when you hate Jews so much um I notice you went back and forth at a little issue with a reporter from GQ this weekend oh did I ah Julia something or other said\nThat she was a she's a little upset about this and basically blamed anyone who's ever ... uh criticized I think it was George Soros stream into\nA and I remember [laughter] and you came back after this is you know completely ridiculous like it's nothing to do with that like we you know and then she posted here's an example of that supporting\nThe Jewish people and posted a clip of one of your criticism of one Jewish person George Soros or as as an example of how much you hate the Jews now I did respond because I found an example of you are supporting the Jewish people as well when you want the defender of Israel aboard\nA that was shot by somebody national award one of the highest um ... most prestigious awards for someone defending the Jewish people cry but beyond that uh it was just it was just presented\nBy the the prime minister of Israel though\nOh well that's it [laughter] okay that's not a big one that out of bed it's not a big one so it's just amazing\nYou know 'cause this is not just a criticism of you and it's not just this one dopey reporter it's all over the place and this idea that if you criticized George Soros\nThat you are an anti Semite is completely insane if you are a ... a conservative and the people\nIn this audience I wouldn't bleep all would fall into this category many of them will criticized George Soros but they criticize him because he's a liberal has progressive policies he supports a policy that we disagree with so we're criticizing him around him to be dangerous all around the world around the world he is a very shady history\nOr around the world that but anti Semite patriarch source to ... in some ways there are things in common there however they don't like him because he's a Jew but the way they don't like Shapiro\nBecause you're in front of a hero importing the policies you know like I don't understand racism I mean you can get to know people and hate them for a valid reason [laughter] you know like Karl Marx I don't like Karl Marx\nHe was Jewish I don't like him not because he was a Jew no but because he came up with the idea of communism\nI'm not a fan no not a fan of fat and the ... like you're in these liberals have never criticized Ben Shapiro before is that because they're anti Semite which because they don't like what Ben Shapiro's said they will love what ... they would love Ben Shapiro if he was a liberal and\nThey don't like him because he's a conservative is this distinction difficult for people can you really not understand I mean we all know cannot do it and I it's not all understand that they're just trying to use this to make it look like conservatives they're anti Semite\nWe you're telling me the way they uh you know Sheldon Adelson right here's a guy who is one of the biggest finding the Republican Party have you ever seen a word of criticism for liberals about him of course you have does that make them anti Semitic\nOr what it does not it does not you can criticize just like when they criticize Clarence Thomas are they racist\nNo they don't like Clarence Thomas is legal opinion because they don't support what they believe it's not about it it is trying to make these into cartoon arguments ... is such a a ... ...\nAgain this is another example of horrible discourse yes they complain about how bad Donald Trump has made the discourse you're calling everyone who's criticizing the main liberal and progressive funder in America\nYou're calling everyone who does that an anti Semite how that possibly in the realm of positive discourse it's completely a disingenuous and they know it is they know it's not true and they go on television and they say anyway in this time in the middle of a tragedy they say it anyway 'cause they don't care\nThat is that that is exactly what they said they claimed to be again and they do it every day wow I didn't hear a solution there to [noise]\nGo to a pattern I don't know I got out of ... and ah we're we're going to talk about one when we come back\nColombia's most dependable trafficking mornings and afternoons news radio five sixty W we use the [laughter]\nSo let me talk to you a little bit about um [noise] buying or selling a home\nIf you are if you're buying a home right now or you're thinking about it do it now get the low interest rate right now if you have to refinance your loan\nDo it right now do it now I'm\nA home equity is at an all time high homeowners are starting to cash in and pay off high interest or that\nThere is a there is a way for you to do this with people who are are working for you they're not working for the banks so if you want to consolidate you want to re fi or you're looking to buy a new home\nGo to the people who work for you and that is American financing\nYou could be looking at twelve thousand dollars in annual savings right now and you can close and his fastest\nTen days American financing eight hundred nine zero six twenty four forty four American financing Don now\nI've been there I Know what it feels like and that's when I decided to do something about it after lifting my home with some agents that just could not get the job done I decided to start a company that would find the best agents people you could trust people who had your same values honesty hardworking carrying\nWe started real estate agents I trust dot com it came from personal frustration to end mine and now your frustration religions I trust dot com our goal is to connect you with an agent\nWho will help you sell your home as quickly as possible and for the best price when you want a sold sign your front yard\nFinding the right real estate agent is the key and it's working houses that had been sitting on the market for months are now selling people are finally able to take that big burden off their shoulders another open house some more balloons it doesn't work get moving now\nGo to real estate agents I trust dot com where our individually selected agents will work to earn your business and sell your home real estate agents I trust dot com\nWe created I heart radio\n[noise] [laughter]\nThe first school night and you decided to fire up the gas last for your entertaining and think of firewood look great for me not to struggle and costs trying to get the gas launch lifted after sitting all year they just won't bite ... plumbing to service clean hands check\nTo make sure that the next time you start your gas logs you won't be disappointed mess plumbing dot com [laughter]\nBefore you get caught up in I think your ears into some clarity Mark LeVine one use ...\nExperience they'll send them is life like color brilliant sound clarity uninterrupted streaming I'm Adele XP has Thirteen with an H ... into court I seven processor a laptop for people who watch things on her laptop all eight hundred Vidal to learn more\nAnd you'll find sixty jumbled you\nWon't be\nBeaten down I'm Dave Anthony Fox News words are unwelcome in Pittsburgh rabbi Jeffrey Maier vigil last night\nWell I mean that's not the something The Simpsons signed on for yeah sorry twice\nThe label raised and this is a great lesson for everyone who tries to please say Megan Kelly I think it's the same type of thing right you can't you can't no\nMatter what you say they're never going to be pleased the people who come after you for these in these nonsensical PC issues\nWill never be pleased no matter what you give them no matter what apologies say no matter how sincere it is no matter ... they're not asking you to remove up who they're not asking you to change they're asking for something that you can't possibly give them any earlier you realize that the better\n[noise]\nLet me change the subject to enough is enough when America will enough be enough\nNew polls Americans fed up crave unity admitted violence now this one should terrify you\nBecause fifty seven percent now say they want a third party they want unity that number is even higher\nBut I'm not sure people actually mean this\nI'm not sure what unity even means and then they say that we no longer really um agree on the core values of our country which I think is actually true we don't agree on core values\nBut what are those core values\nAnybody know\nAre the values that brought up what are the things that were actually arguing about now\nWay things are going in the United states twenty five percent are satisfied fifty eight percent dissatisfied the state of politics nine percent satisfied Seventy seven percent dissatisfied\nThirteen percent are like a ...\nPercentage that say Americans are United in agreement about the most important values Fifteen Percent\nFifteen Percent of us they were United on the most important values my question is\nWhat are those values sincerely what are we fighting for our we are we fighting for lower taxes\nHere's what the the here's up those surveys the shows where we divide on our quote the most important values\nPolitics in this country it's politics of value um moral ethics in our country\nIs that a value\nRace relations gap between rich and poor the state of the news media the way things are going in the U.S the environment the way things are going in your state\nRights for algae beat the status of religion homeland security\nWith an exception of a couple I those aren't values those are issues that is a political campaign and perhaps that's what we're missing\nSee I I firmly believe and I I I wrote this in the book addicted outrage we have a few things we have to decide we have to decide\nOne so western world worth saving his freedom as our founders saw it is it worth saving yes or no\nAnd I don't want you to just to you know jump Bob and yeah absolutely why why why is it worth saving who can articulate this why is it worth saving how has it changed the world in specifics\nWho can make that case among us who's making that case to their kids at dinner at night in specifics\n\nIs America a good place or a bad place we have to decide because half of the country says it's a great place half of the country says and I don't even know if these numbers are accurate and half I doubt they are have but let's just say half the country says it's a bad place half the country says it's a good place\nWhich are we sincerely which are week we have to choose don't wait because it's a binary choice isn't it were good or bad right it's a binary choice you have to choose one\nNo no you don't it's not a binary choice the answers were both\nWe're both\nWe've been both bad and good we've had really good intentions and the pathway to hail is paved in good intentions and we have great intentions now on both sides we have great intentions\nWhat are we gonna do with those intentions because you rarely live up to them have you heard anyone actually make\nThe case for America and not just in red white and blue flag waving terms but why is America important\nWhy is the constitution worth fighting for because if we don't know let's just get on with it man let's just move on I I'm I\nWe cannot sit here and argue about our greatest issues of our time we don't have our basic living rooms I Want to make sure I have this right our our basic essential values in line\nLike climate change\n\nYou can say one of our values is how do we treat each other and how do we treat the earth\nOkay that's a value that's not climate change\nClimate change comes off of that value in principle\n\nClimate change is okay is there a problem is there a problem well I'm Sorry but the science is not settled\n\nThe climate is constantly changing it always has to why we we had the ice age ... where were the SUVs for the ice age\nIt always changes now can we do things that can affect the climate I don't know some people say we can some people say we can't\nBe evidence is spotty at best and you can't trust the evidence that is there because we have too much evidence of collusion and ... in the scientific field\nYou gave me clean cut studies okay\n\nBut that's not even what we're arguing about were arguing about what to do about it see they keep making a about you know whether it's happening or not I'm willing to give you the benefit of the doubt I'm willing to say okay it's happening All right it's happening what do you want to do about it\n\nWell the solutions are insane the solutions don't work\nNow that is a political discussion that is a political discussion you know where our values come in on that particular discussion when someone says the sciences settled to shut up that's a violation of our values\nWell our values used to be we our enemy of no one friend all now that gets a little\nDicey gets really dicey didn't get dicey apparently when the Japanese invaded China\nYeah that's because they only care about Europe no actually no\nWe couldn't fight on all of the friends\nWe had to choose we didn't even want to go save Europe American didn't even want to go into war\nWell could you oh my gosh how could you ditch your oh wait a minute\nWe're supposed to go save the white patriarchy where we're ... wait a minute were to blame for all of that because we didn't go in and save the white hierarchy I thought you just said that was bad and should be destroyed\nIs America bad or good let's have that discussion on\nAmerica now with me ... tonight at nine or news radio five sixty WTO seeing\nThis only\nHandle the truth\nSo wholesome saying this is real\nWVU see there'll be love at first bite\nFrom that WVU the center of the blue and leadership from around the country and itself Carolina Raleigh denouncing the deadly mass shooting of the tree of life synagogue and\nFoods for over the weekend it took eleven lives ranging in age from fifty four to Ninety seven\n... shooter faces a judge it one thirty this afternoon with twenty nine charges on the table\nSecurity increase to houses of worship across South Carolina yesterday as large crowds gather to mourn those killed including at the Charleston church that was the scene of a mass shooting three years ago the fall hero laid to rest in Florence county funeral services held yesterday\nThe Florence civic center for deputy Farah Turner who died last week\nShe was shot nearly three weeks ago now and that ambush that also killed Florence police officer parents care what\nThe Boston Red Sox when their fourth world series since two thousand for taking game five over the Dodgers five to one former USC game Cox the fears Homer twice more last night he's World Series MVP Jake or when news radio five sixty W. V. O. C.\nHello this is Keith remind was shaping furniture shortly after Jennifer and I got married I was introduced to one of her family's annual traditions Thanksgiving a grandpa Nixon's house in the north Carolina mountains tell him about a gym\nWell every year on the cousins aunts and uncles would gather there and we laid Vides four wheelers the mountains play enjoy enjoy each other's company the guys live vested turkey I'll Dana fire pit outside\nAnd as we got around the table to gather a highlight of the week in was healing back that's playing out on that huge to start the meal\nThose are great memories what will your traditions look like this year maybe this is the year you finally get that dining table that everyone can sit around whether your family as big or small we've got great news three Saturday November third are dining furniture is on sale\nShape in front of kids dying town and it's going on now cake I twenty six to exit Ninety One in shape and and not quite that big red chairs council\nThe thing that Glenn Beck kind of an\nAddress before we when we get off the air today\nThere's so much to talk about um we've got to talk about Twitter and what they're doing now because it brings it brings the point that I was just making home about what our values and what are the problems that we're trying to solve their different\nPeople are now saying that you know the problem is is that Americans don't agree on basic values and principles anymore\nWell I agree with that but nobody even is talking about those when's the last time you heard anyone really talking about values or principles in the mainstream media\nTell me last time you heard that talked about on Fox or on CNN or MSNBC\nTell me defending basic principles what are those principles well American principles\nWe used to find self evident that all men are created equal so you want to talk about the uh the the shooting\nIn I'm In uh\nPittsburgh great\nThat guy has violated American principles all men are created equal endowed by their creator with certain unalienable rights one of those rights is religious\nTheir right to to pursue God the way they pursue God\n\nNow how about the principal violated or by the bomber\nCrazy guy crazy guy wow\nAll men are created equal in and out by their creator with certain inalienable rights among these\nFreedom of speech freedom of expression\nFreedom of assembly freedom to petition your government well I don't like what those Democrats are saying I don't like what the media is saying but they have a right to say it\nSo do you target them for death not if you want to talk about principles\nEverything else is about politics now we could talk about his mental health and that would be something else that would be a very valid target the topic\nWe gotta talk about mental mental health in America Americans are feeling more and more alone more and more isolated communication is going through the roof\nBut none of those are principles\nDo we take care of one another\nWell that's the golden rule isn't it that's the golden rule\nSee we we just assume that\nAnd we were awake for a while and I don't I'm not sure if we are as wake as we think we are now\nWe woke up and we we really um we really learned\nA I think under Barack Obama but now many of us have gone back to sleep because okay our aside is in charge and so they don't take care of it no no they won't that is the problem no they won't\nWe are the answer they are not the answer we are the answer\nAnd you're not going to learn this through osmosis\nFound an incredible thing happened to me my my son finally got into American history and I couldn't wait designing it okay he's got a full and there's going to be the easiest thing ever American history living in my house go into my speech is listening to me\nYou know helping me pack things up for a speech is you know all of these rare documents going with me and being in the museum going through the museum even even giving a tours in the museum\nI saw this going to be easy nope constitution nope\nDeclaration of independence nope he's heard it a million times nope\n\nI'm starting a class at my house tonight [laughter] all of my kids yeah even the thirty year old they're all coming to my house every Monday Night the little teeny kids the grandkids are going to bed the minute those kids are in bed class starts\nSo going to be attached dad yep you're damn right there's going to be a test and it's a pass or fail oh good if you get one wrong you fail\nAnd you got to take it all over again with me\nThere is time to prepare for hurricane earthquake blizzard social unrest the practical place to start is just by storing up some food in your home now I use my patriots apply for food storage I have for a very long time if you don't have an emergency food supply\nTo really\nPeople listen to me for any given time this this this is the time that we've talked about this is the beginning of it is is it\nBut I've talked to you about the coming our way we're here now so if you've ever believed in any of that now is the time to prepare a two week food\nKit that comes in a rugged tote seat and grabbing go this week it's only Seventy five dollars when you go to prepare with Glenn dot com or call one eight hundred two hundred Seventy one sixty three\nIt includes breakfast lunch dinner up to twenty five years in storage you can order now prepare yourself in your family and then let it go\nEight hundred two hundred and Seventy one sixty three or prepare with Glenn dot com [noise]\nNews radio five sixty ... [noise]\nI needed new blind I knew I could save a ton of money if I put them in myself but I was nervous about measuring right and then installing them that's why I went to lines dot com I turn their heads on the radio or they're the number one online retailer custom window coverings\nBut I still had to install them so I called my design consulting Carla she talked me through it all from picking the right blinds to installing ... class online design consultation was free samples were free shipping was free my home looks perfect\nThis holiday season impress everyone would brand new made to order custom blinds from blinds dot com check out there before and after pictures read reviews and get the latest trends and colors and patterns save up to forty five percent plus take an additional five percent off say why would promote code back\nYour order delivery is guaranteed by Thanksgiving or it's free that's up to forty five percent plus take an additional five percent off site wide blinds dot com with criminal code back exclusions rules and restrictions apply\nIt's one of the most successful bridal events in the middle and the one of the force that until you went okay bridal expos Sunday January sixth of the Columbia metropolitan convention center puts your business in front of hundreds of new clients and just one afternoon\nShowcase your services network with other wedding boroughs and most importantly book new business the window for seven W went okay bridal expo Sunday January six it's presented by American floral southern white catering and Colombia bridal associates to reserve your space today at bright city shows dot com that's bright city shows dot com\nDoes your home office workspace need a new look and visit the uh weapons the dot com today just aren't you search for youth thousands of new quick ship desks chairs workstations biochemist bookcases in more at your leisure SCORF ... find something you like it was at Columbia office furniture is twelve thousand square foot children met three all one race don't boulevard to\nThe city and and feel actual samples before you buy or browser selection of used office furniture for high quality affordable options layout design services and installation are available star search today at C. O. F. F. C. dot com Colombia office furniture we furnished solutions\nIt's slowly inches up word soon it reaches the top stops for just a second then it propels you down faster and faster we have been experiencing a great to climb in the stock market over the past few years when is it going to reach the ... when will it had downhill what might happen\nTo your investment when it does you won't know unless you have a qualified financial advisor show you what could happen\nTo your portfolio during and after a market correction now is the time to prepare before the market goes to the top and ten does what markets do Russia's downhill call the preservation specialist at eight zero three four five four Ninety forty five\nFind out what you can do now before a market correction let ... and the team at preservation specialists provides you with the information you need to make an informed decision\nEight zero three four five four Ninety forty five that's eight zero three four five four Ninety forty five\nGrand back has been ... and it's not a client investment advisor service is off the coast capital make the\nMonday are going to try to make it a little easier for you and try to make sense of the world for you are in our uh last hour take some give you some action steps and some\nSome meaning behind the news also we go back and I'm a look at ah the hurricane in Florida 'cause they're far from done uh in Florida that's also coming up\nA and don't forget we are going on tour this week and can't wait to see what's going to be a an awful lot of fun as to when I where I'm working on the show on friday it\nLet's just say I mean they could go one of two ways that could that that might spiral out of control and it just might spiral out of control or we go on a Thursday to Richmond, Virginia then on friday were up in Hershey, Pennsylvania\nA than a Saturday we're in Pittsburgh and there's some special things were going to be doing in Pittsburgh buy your ticket if you're anywhere in the area come to Pittsburgh\nUh I'm doing all of the proceeds uh to uh uh to the Jewish community in\nPittsburgh I just don't have time to get to the theater by my ticket gone there's just and I'm Sorry I'd like to do that in advance that I Know you you should go to Glenn Beck dot\nCom slash to her and so we buy tickets so [noise]\nSo I can go and anybody can do is at a specialty that's anybody can do that Glenn Beck dot com slash tour and then Sunday were in Cleveland, Ohio I sorry that is on a Sunday I don't usually do anything on a Sunday\nBut it was the only time that we could uh that we could do it and put it in the schedule so Cleveland, Ohio on a Sunday\nBring your kids bring your friends\nBring a sense of humor\nAnd possibly a new book because there's also going to be some things that I think [noise]\nAh we're gonna we're gonna go over and uh and uh and learn together\nIt begins this week\nColombia's home for Rush Limbaugh news radio five sixty W ...\nAnd I are both spent most of our lives having used cars a because we couldn't afford nice cars in fact my dad never bought a new car he always had a a used car I'm the first new car I bought him when I made it a which was kind of a cool thing\nSo I kinda grew up but I Know students to with that a check engine light oh yeah and even before the check engine light a you know we I Would watch the uh the heat and you know break off the side of\nThe road and steam pouring out and it was always a nightmare when you have a used car because you don't know the next time you go in you might have to replace something really expensive you don't have to worry about that now if your car is out of warranty with car shield they'll provide twenty four\nSeven seven roadside assistance rental cars while you're as in the shopping fixed it's all free\nThey pay for you horror repairs go now to car she'll dot com car shield dot com\nCars you know that feeling when you just know you're experiencing a whole new level of excellence I have felt it a few times a first luxury car even my first iPhone\nYou're experiencing a game changer that is exactly the way I felt and you will feel the first time you said in an ex chair I knew immediately the generic charity suck and we spend so much time in those stupid chairs get a great chair\nAn ex chair most of us spend more time in our office chair then in bad that's why the ex Jerry's so important ex chair now on sale for a hundred dollars off go to act\nShare back dot com right now that's the letter acts chair back dot com or call one eight for for for X chair ex chair comes with a\nThirty day no questions asked guarantee just go to ... dot com use the promos go back that's B. E. C. K. and get a free foot rest as well just for using the ... code back aid for for for X chair or ex chair back dot com\nIs here to talk a new\nGums goblins vampires in which is you know or be quite spooky and creepy this time of year must put on your profits will scare you even more\nThan men for the red carpet cleaning the ads will deliver you insanely thing with no skin tone comes zero that's happening here that cleaning it takes to forty twenty and get three friends\nIn a hallway clean from one Ninety identity to forty foreign lands Iraq coming in that town red spell it backwards there where it's the right way to clean [noise]\nBut there's one interesting way of looking at this we talk a lot about a districts that have changed\nFrom Obama to Trump people who voted for Obama and then change to Trump\nAnd there's the other side of that people who voted for Romney and changed Clinton and there's an interesting ... a breakdown ... there were a let's see if the Thirteen districts that voted for Mitt Romney in two thousand twelve and then voted for Hillary Clinton in two thousand and sixteen\nSo two thousand twelve on average squirting FiveThirtyEight had about an eight point advantage for Romney\nAnd two thousand sixteen it was a five point advantage for Democrats so what what are we closer to I think it's interesting to see where we are when it comes to the polling as of right now\nAre we have about a to point advantage for Democrats in those states so if you look at it kind of ... to summarize those are kind of lost three points are well well the three point Democrats have lost three points from two thousand six to ... less passionate into two thousand sixteen but a big big move from two thousand twelve\nDone it so they're kind of in the middle but leaning towards the Democratic way they voted in two thousand correct team now there were Twenty one districts that voted for Barack Obama\nAnd then voted for Donald Trump Twenty one\nOr so in two thousand twelve with Iraq Obama they had about a six point advantage for Democrats ... ... in two thousand sixteen that swung from all the way back to seven points Republican for Donald Trump so it's a huge swing there\nIs it you would think of these real swing district so far polling showing that leaning to the Democratic side by five and a half points but big the big change though and that was that's almost equal to where they were voting roam around ... so if you look at that the people who were\nVoted for a bomb and then switch to Trump are kind of back to the position where they were voting for Obama when Romney\nOr the people who voted for Romney then went to Clinton\nThey're in between those two positions but leaning towards Clinton\nThat's where these a district show up there is also five states where this is a where this occurred\nFive state of Florida Michigan Ohio Pennsylvania Wisconsin where they voted for old bronco Obama then change to Trump in the Obama election that had a five point advantage for Obama in those states in the Trump election there is about to point advantage for Trump\nRight now those states are showing eight twelve point advantage for Democrats now now that part of that is it's a little bit different than what you would say in the house where they're broken up into little areas and there's so many candidates and their up all the time\nWe're this is some of these races are just there's popular Democrats already Pennsylvania's like an example of that where they have been just a big lead or not because I don't think that's necessarily solely because of some ... tell me what all\nThis means from last week or the Democrats making is is the momentum start just starting to swing back towards the Democrat\nI Would say doesn't tell you much about the Senate but it's I think it does tell you something about the house which is [noise] there was that I Hope that there'll be some movement in the house towards Republicans these numbers aren't showing that I mean it right now wait ... seems like the Democrats will take the house uh and the Republicans look pretty solid in the Senate right now when will we see\nAny movement at all of due to the shooting in the bombing\nWell the polling wouldn't even start probably if you weren't real polling reaction that at least till today we'd have three I mean you're probably not till later this week Thursday or friday the early okay I Will look for this\nElection by numbers\nOn the Glenn Beck program [noise]\nThis weekend as you know a gunman opened fire at the tree of life synagogue in Pittsburgh he shot and killed eleven people during Sabbath services injured six others for where police officers the guy was insane\nHated Donald Trump that doesn't make him a Democrat\nDoesn't mean that he was you know following I don't know Cory Booker whoever it just means there's just not political\nAnd should it be I mean we keep jumping to politics first I Can't imagine what these families are going through\n\nPennsylvania has taught us before with the Amish how to deal with killers\n\n[noise] if you've been listening to me um for a long time you know what I Believe is coming and have said is coming for a while and I'm always wrong with timing\nBut I don't think there's any way to deny that what I've\nWorn was coming is here now we're seeing the beginnings of it now\n\nAnd it's only going to get worse and it's going to get harder it's going to get harder for you to stand up\nIf they've taken gab down yet I think the\n... the service provider for them has taken them down um I don't know if they're back up and it's not cabs fault gap as it is kind of a shorter competitor I guess I Would say that they found up are\nBecoming a safe haven for anti Semite so I guess and and and you know\nI don't want that nobody wants that but we either believe in freedom or we don't and yes I don't I don't like the poison that they put out\n\nI also don't like the silencing of voices this America man this is American principles you can't\nSilence voices\nSky was deeply disturbed really bad guy\n\nYou know you watch TV and you see the victims the faces growling across the TV screens\n\nAnd you might think that things are getting worse\n\nAnd I guess historically speaking this is the worst anti Semitic shooting we've ever had in the history of our country eleven people\n\n[noise] on the positive side that's nothing compared to some countries\n\nI saw some reporters say you know the problem is a this is Donald Trump I Hope you I Hope you're happy that you have your uh your synagogue or I'm Sorry your ah your embassy in Jerusalem\nReally really that's where you're going\nReally this was caused by moving the embassy to Jerusalem oh my\nGosh [noise] wow\n\nYeah Jews were killed in Israel like terrorists last year a hundred and twenty two hundred and twenty two was that Donald Trump's fault too was that just the evil juice full how many of France\n\nFrance they are moving out at a record number because they know they've seen this movie before\n\nSo tired of the west to being to blame for everything that there's nobody worse than us I'm so tired I was tired in two thousand eight when the president at the time was saying you know\nWe're not going to allow people to round up Muslims in the middle and I\nWe've never done that we've never done that stop it\nYou know who he is China\nOne million Muslims are now in a concentration camp in China rounded up why because they're Muslim that's it\nWhere is everybody on that one\nIs that because there's no white man evolved is that what it is where is everybody on that one\n\nMarriage so bad look at all the hatred and the racism and slavery\n\nSlavery still going on in Africa slavery is going on in the middle east\n\nSlavery is happening in China happening in Brazil it's happening in in Haiti it's happening in Mexico\nWhere are you on that one\nSo tired of playing this game\nWhen it comes to the Jewish people\n\nI obviously don't speak for everybody but I I Do speak for my audience on this one\nYou're not alone there were millions of Christians who love you who respect you who are grateful grateful for the preservation of the Torah\nKnow how many have you done over the years none probably too many to count at no none but oh yeah right Twitter is the problem will seem like it is because you don't have the facts\nAnd all you're doing is you are being a blowhard without any facts\nI'm not anti Semitic ... how how how center of Israel award protected by the prime minister of Israel he of George Soros was paying for a anti uh Glenn Beck protesters while I was doing a defensive Israel a program in Israel mhm\nI mean I'm not anti Semitic\nI'm I point out the facts of what George Soros has used his money\nA really really\nGlen and now you're saying that he's paid for the caravan no I didn't say that he paid the pay some of the money\nFor the last caravan but I don't have anything on this caravan but let's just look at the facts\nColombia's most dependable traffic mornings in an afternoon news radio ... double the ...\nHave a government in love with someone and rock completely random were together and I get everything I only give you free thing not news weather and traffic\nDoctor Jay with Columbia's morning news week they usually do not news radio wind sixty W. B. O. C. [noise]\nFrom the w._b. OCD center\nWould be called the deadliest anti Semitic acts in the history of the United states is throwing up some painful memories in South Carolina\nPrayers is said for the victims of Saturday's deadly shooting at a Pittsburgh synagogue yesterday\nThe Charleston church that was the scene of that mass shooting three years ago the accused shooter goes in front of a judge this afternoon facing twenty nine charges and the murders of eleven people fall and heroes laid to rest in Florence county funeral services held yesterday at the foreign civic center for deputy ferret Turner who died last week\nShe was shot nearly three weeks ago that ambush that also killed Florida police officer parents care away and the Boston Red Sox World Series champions after five one win over the Dodgers in game five in LA former USC game Koch Steve here's he's World Series MVP\nFilling my life and I understand what you are you going to\nWishing that you could be ... or something like this\n... news radio five six feet W. V. O. C.\nHey it's John Kelly no rational thought there is something rotten in Colombia and it smells ... we'll get to the bottom of it\nNext again Kelly what the heck is going on at the heck we can't even ask for information we can't get any information out of these people it's very bizarre the state newspaper had a\nUnder a freedom of information request had the sign in sheet because they couldn't get the names of the people who were interviewing to be the head of the heck by the way as a side note the heck has not had\nA director since last year over Fifteen months have passed since we've had a director of the hacking agency that hasn't been known for being the best in the state and we kind of really need them the department of health if you're going to our mental controls to do a better job so they uh\nHad a big interviews everybody came in on September twenty seventh of state ... said we need to see at least the sheet than of who showed up near the sun and she decided to get into the building\nAnd it was really used\nBut all the names of the people on it were blacked out so we just know what times people show top point of the world the way they released the names of the people who signed in bed day Kelly and they said the sign in sheet you request contains the names of citizens who visited the heck for a variety of\nReasons some of which may be personal in nature will just read that goes dangerous in the rest of them and they weren't going to do that they're going to reject everybody's names I listen I don't make me defend the hack well from my perspective there is no defense but maybe I'm overlooking so but what are you saying you can get back to his own ...\nDoes your home office workspace need a new look to visit the uh weapons the dot com today to start you search for youth thousands of new quick ship desks chairs workstations biochemist bookcases in more at your leisure ...\nFind something you like to visit Colombia office furniture is twelve thousand square foot you'll room at three oh one gravestone boulevard two seats fit in and feel actual samples before you buy or browser you selection of used office furniture for high quality affordable options layout design services and installation all available started your research today at C. O. F. F. C. dot com Colombia office furniture we furnished solutions so\n\nGlad that probably and so whether you're here thank you Alison in Kentucky thanks for holding you're on the Glenn Beck program [noise]\nGood morning when it's so difficult to hear you struggling this morning I maybe I can get even some of the long time listeners some advice\nOkay I'm not really well [laughter]\nI like I've been a subscriber to this network TV we hearing voices when you're struggling a bit more than ... than usual okay\nMy my advice is may get tangible because there's so many of us that tune in every day and and listening to this broadcast but then we don't make a tangible\nAnd even you were saying that you haven't been doing it shows you haven't been out of the road for a while I think it's going to be so good for you because you need to connect with people yes I agree my friend and I generally and I had a a friend of mine that says Vietnam veterans in his seventies and we went all the way we live in Ashland, Kentucky\nWe got up at two AM Joe six hours to Illinois for it that the Trump rally this weekend on Saturday I Do and and then stood for eleven hours straight because we we were told the first two thousand people in line to get into the hangar and\nWe knew we were going to get that way and and as it got to carry out looking at Georgetown can't wait to sit down and you get to the hangar there weren't that states so\nWe're going to be standing another six hours\nOn concrete so when I was saying is this president is a lawyer [laughter] I'm Sorry I just play that just playing the per second go ahead tell us or I could say\nIt as much as they want you know what we were standing in line making fun of the Carbondale a solidarity network which was a socialist group that was coming to protest they had to have their eleven AM pancake\nBreakfast before they came to protest and you know we ... we were joking well do you think there were a vegan and Clinton free options to go along with that and the right but there were overturned a thousand people there for the rally and less than Seventy five people showed up to protest\nThere was not a piece of how would you say this about your ... function is when you've had the restoring functions there was no garbage we would never know when I was ten thousand people there you know one was complaining yeah\nI I I kind of had to warm up to Trump myself and I tend to get to go to one of these things because I was afraid if I said one negative thing I was going to be completely shouted down now people were so open about talking and\nSomeone had to go to the bathroom and into their child stayed with us I mean you're in a group of ten thousand people you trust strangers to watch your child while while you may run and do an errand a comeback real quick it was it was such a positive environment and you know it's like a president that's happened to show it was\nAnd I'm so glad he's actually going to be in Huntington on friday which has five miles away from where I live I'm so glad I went to Illinois because I remember standing in line and seeing the the headline break about the shooting mhm and wait we also went through the doubt whether the president was going to show up or not\nAnd this is after we got in the hangar Lakeland standing there for two hours but we never gave up hope and we were we we all know we had jokes of you know conservatives the one thing liberals can do better than us is chant we can't can't it's like winning classes or something\nI Know we saw it and I'm really glad we start [laughter]\nBut you know it's it was such a positive environment and our legs were or just killing us by the time that they got there and ... George not drove back that night it was at twenty eight our road trip that we took for this experience\nAnd as exhausted as we were in as much as we were a gang George looks at me and says he doing one in Missouri later this week as and they how\nFar is that well that was that what it was just six hours Missouri and it's going to be eight but we were going to\nGo and so we found out that this one was going to happen right across the river on friday so fine get tangible and that's the best I can say is go and meet these other people tend to Seventy five\n... ... were very quiet people but we do cut to this rally and there there was just an energy that was there that you realized we can be there's hope for society\nYeah granted I got up and went to Walmart the next morning and people are cutting you off to get to the best parking spot and you're like well yup I'm help\nAlison hang on to the second I Want to get you to copy of my book I I signed it I'll send it up to you thank you so much for holding him thanks for I'm I'm sharing that it is that that is but maybe if I might struggling today\nDo feel like I'm struggling today 'cause I don't feel like I'm struggling to damn I'm a little frustrated at the new nation I Would say at the end of April I'm frustrated that we concentrate on all the wrong things and I think that's kind of what she's saying here um see these aren't the things we should be concentrating on you know the the the president\nI'm being an anti Semite chief his daughter is Jewish\nBut I you know how many Klan members are cool with that I I don't think any", "year": "2018", "show_name": "The Glenn Beck Program", "city": "Columbia", "day": "29"}