{"month": "10", "state": "SC", "station": "WVOC", "content": "Forty twenty and get free rent in a highly clean friendly my Nineteen again he thinks he's forty twenty nine miners zero red Columbia that some red cell it backwards and forwards it the right way to clean\nHigh winds rain hell we get it All right here in the midlands if your roof is damaged during a storm or the roof of someone you know or love is eight five five go by you know the number to call the local pros at may him roofing and you have a peace of mind knowing they'll work hand in hand with your insurance company to make sure there are no problems with that claim everything is done by the book\nWhether it's a hurricane or just a good old fashioned storm eight five five go may and put the local pros at ...\n\nShould not get catch or you could try it takes to win a grand and your and my news radio five sixty ... see\nI Do you want to back down to the game ... great as former ... quarterback Jeff brands joins us in just going into the by week last week what he'd you were a team leader what would your message had been to the ...\nWell I say concentration and execution a pretty large we just got a quick shooting ourselves in the foot self inflicted wounds of really cost this year uh scandals are pretty good um we've got to be athletic ability and the talent to\nBe winners as as we've seen on a few of our games where we played well we want them to you know we've just got to play better as a team and more concentration\nKept there's been some grumbling about the play of quarterback Jake Bentley I I ... and you certainly realized that comes with the position but what did you think of his performance first half the second half against ...\nWell it was night and day came out again a little bit a little bit hot and high uh he gets a little amped up from time to be getting games\nBuddy settled down and play to a super game the last three quarters I thought oh he just didn't get any help you gotta catch ... and that's a that's a very very frustrating but he hung in there and kept throwing it we're supposed to be thrown in or we just kept dropping\nGame got great Jeff grants with is just looking ahead to this Tennessee game now because points will be at a premium in a series of it's been so close recently uh what do you think the one or two things you mentioned concentration but what are one or two things the game cuts could have worked on last week they couldn't that might make a difference in this tendency game\nWorld securing the football and creating turnovers I think that's a that's been a problem this year as opposed to last year I mean we we are turnover more marginal is great last year this year it's hurting us [noise] um [noise]\nAnd we just got to play better as a team and we had a project quarterback and take care of the football\nAnd fans obviously are set to make a difference in this game as well with it being a night game\nThat should be a great for our homecoming nighttime at Williams Rice's electric and hopefully that'll give us a a good boost to we really need it going into the next several games\n... yeah I think there's the added pressure there that you look ahead on the schedule with just six laugh all five right now plus probably the addict game and you look at the the games needed the winds needed to get to a bowl when you think yeah the these are must win games\nThey really are especially the next to uh we should be able to\nWin these next two games but we'll get we've got to when you're in the SEC if you don't say well you don't win games as a you know we play well we should take care of the next two and then from there on out you know let things take care of themselves but uh I think these next two games are extremely important\nAlways great to talk to you happy homecoming game kept great Jeff grants joining us on the station with the best game caught coverage news radio five sixty W. B. O.\nC. R. I. final spin around town it's been a busy morning tumble weighed\nTwo wrecks with injuries one at least part and minerals springs the other federal and Stevenson I'm ... and the pope Davis tire traffic sanity home I'm actually in tires that cost the all south federal credit union traffic to plan has three for three ten fifty five will be back this afternoon at four with traffic up dates for the drive home on five sixty W. B. O. C.\nToday is going to be rainy and raw will seek temperatures only topping out in the mid fifties with on and off rain pretty much all day long tonight some clearing lows will do to the mid forties for channel twenty five ABC Columbia chief meteorologist John Farley I drink until you\nIt's fifty airport uptown forty nine and five sixty WBFO sing it took two\nWere common among the ... there was in the band that Bob ...\nGot a brand\nMeaning\nDon't miss your chance to win W. V. O. C. and all states seamless gutters one hundred thousand dollar flow home makeover think of the possibilities one hundred grand to spend on your home how ever you'd you\nEnter for a chance to win now at W. V. O. C. dot com using the word home and let the remodeling began that's W. V. O. C. dot com key word home W. V. O. C. and all states seamless gutters one hundred thousand dollar fall home makeover\nPowered by lifetime cabinets and counter tops sell it to burn brighter solutions Carolina pool tables plus and all states seamless gutter\nReady to ride the\nBoys being boys have to go to the area when you go to my car because it's probably a big boy car service corps has a message like always\nOn site big boy carts dot net\nReady to get outside and enjoy some beautiful fall whether we nobody profiling golfing beach resort and experience the natural beauty emotion green and the stunning ocean\nViews and ocean point general way from it all with ours stays Lagos Anchorage for only one hundred twenty five dollars per person per day now for detail and book your reservations at age seven seven seven one one seven\nFor nine or visit our website at ... dot com free offer in December thirty first [noise]\nHi this is Wayne feels a CEO of all the gospel\nMission with another edition of reality living three sixty five\nAnd the game of baseball manager communication to his players through science the players in the manager must be on the same page as to what the various signs me to not tipped them off to the opposing team\nHas recorded in the Bible when king has a ... I was honored and visited by the leaders of the potential enemy nation he showed them everything that was in his store houses\nHe allowed is feeling of importance in his pride related to his accomplishments to cloud his judgment affected people in any venue possess a keen sense of what information to convey to others as well as when and with whom to share that information\nSo that they do not too far off the science [noise]\nConnect with us and learn more and all the gossip the ...\nExperienced else in the technology on the Dell XP has Thirteen the laptop for people who never say no to one more episode [noise]\nHi there I'm calling you about my dinner reservation it that in the liver\nWith life like color really and sound clarity ten uninterrupted streaming they'll send them a technology on the delta XP has Thirteen within ten into court I said in processor makes whatever you love to watch council bringing balance\nSome kind of light of the news in the face every hour throughout the day always find\nNews radio five sixty ... they'll say daddy fifty dollars\nCampus right down the road from us was being petition to be politically correct a couple of weeks ago campus reform reports the savannah college bought and design which has a building named after Clarence Thomas petition\nThey wanted that building remain after Anita Hill that petition got about two thousand signature that are Twenty years too late you exactly\nMeanwhile a petition goes out saying keep the building named after Clarence Thomas the old position got two thousand this one got Twenty one thousand to name\nWhere oh hey are you go be careful what you asked for I have a great weekend we'll see a mother more by\nBy broadcasting from the studios W. V. O. C. I. orange radio station\nIn any way you go [noise]\nThis is a Fox News alerts an eleventh packages turned up this one in Florida I'm Dave Anthony and it was also\nSilently retracting are false but also the media has been under attack by the White House for very long time\nIt's not an issue with just the current administration and stop making it one President Obama was historically a nightmare for the free press and you refuse to say anything\nAbout it the crazy thing is today\nThe craziest thing is is that the media gleefully gave Obama a pass even though he was weapon I think the FBI and the D. O. J. against the press\nDonald Trump has gone so far as just calling them fake news and they got their feelings hurt forget\nAbout the oh I don't know threatening to throw us all in jail this president is calling us fake news yeah well he kind of has a point just if you even look at how President Obama treated the press compared\nTo you know President Obama was putting new people in jail he was what\n... the government against you and you failed to stand up and say anything\nOh\nIs the media was gearing up for its outrage over being called fake the New York times was publishing an article\nOn the very same day these pipe bomb packages were delivered now I Want you to remember this is what you know just just put this in your pipe and smoke it for a little bit\nThere being called fake news they're being called liars they're saying\nNo no no no we're not we don't publish fake news we don't have anything against the president is not a vendetta and while\nThis is happening the New York times is printing ... an article titled five novelists imagine Trump's next chapter\nFive novel lists imagine Trump's next chapter the main image at the top of this story shows the White House on fire and thinking into the ground as President Trump waves good\nAge novelists had one assignment\nRight out what you think happens after the Mueller investigation is completed okay [laughter] so let's come up let's go to fiction writers and come up with what they think is going to happen with Mueller's investigation and what's gonna happen immediately after\nAndy you mock me you mock me\nEvery single one that's going to come into the prize they found five fiction writers are going to do it\nBut every single one wrote a short story depicting a scenario where the president was found guilty every single one isn't that amazing they couldn't find one fiction writer\nTo write something where Trump was not guilty it's crazy one story had Trump's signing the twenty Fifth Amendment\nA and another even had him being assassinated by a Russian agent with the help of Secret Service\nYeah\nWe can write about the president being assassinated advocating violence I don't know what ... what are you are you kidding me know that it was about the Russians that wasn't about a coup yes yes okay Secret Service was involved but that's not about a cool\nThis is the New York times\nYou know the ones who are leading the way saying oh my gosh the talk of violence is so horrible [laughter] oh my gosh and we don't print fake news you're supposed to be investigators you're supposed to be neutral\nI thought that was the idea let's be neutral\nNow I understand that everybody has an opinion but five for writers and no one can come up with anything other than the guy is guilty and maybe he's going to be killed by the secret service\nThis is unbelievable how is it\nThe two hundred journalists can sign a letter claiming that everything is the president's fault when the flagship of the American media he was writing this bull crap while the pipe bombs are coming in\n\nThis this time space exhibit a for why journalism is currently dead in America it is dead in America\nAll of you dancing on the grave of Megan Kelly really what was her what was her big thin she asked a question that oh my gosh lock her in a tower\nOh my gosh she's got to be chased out of the public so you can ask a question don't you dare ask a question\nThis is frightening America fact\nFinding is gone the media has already made up their mind they know the answer and if you disagree they will chase you out of the public square\nThey have no inclination to actually at even attempt to find the truth even attempt to understand\nYes there's a little righteous indignation and me it's not an anger is it is righteous indignation because I have called these people I have talked to these people\nI have gone to them over and over again we've had in hand and said\nListen you need to understand how half the country feels just have a conversation\nYou're making a huge error and yes I made all these errors oh my gosh I'm the worst person in the world I'm with you just listen to me please you have to hear what half the country is saying\nThey won't do it they're not interested they don't care and now they're quite literally making it up what's the difference between a novelist and the New York times journalist I don't know\nMedia\n[noise] this is a radical concept and I know you like radicals you love radical\nYou you feel there's nothing wrong with being radical mob yeah those are those are just people that feel passionately so I Know you love radicals\nBut here's a radical idea if you don't want to be called fake you might want to just\nStart with literally stopping publishing fiction\n[laughter]\nTry to help her twenty second line backer program [noise]\nSelf awareness seems to be dead at this point in the media in particular Glen or maybe this one what is the one thing that if you're conservative Trump makes the ACA criticisms of the media they say\nHey it's fake news hey these guys are relying hey they're the enemy of the people and they say that the same as violence\nLike you're you're you're you're creating ... coming after ... ... I Can't go there yet I Can't I Can't I got to take a break I Can't go there yet a cat I Know where you're going and\nBoy does it need to be said I Can't do it yet and I can\nDo you need you to the news I just said it could crank that we are we are now he thinks that's it again I'd been telling you for years to get to your alcohol if we can reignite that it's going to be a good ratings\nMost time can I tell you something the blackouts I Need the blackout right now I Need them so desperate and All right it would be so grades I forgot about everything that they said that was so stupid yesterday [laughter] I don't even recall it at all I Love that idea\nI Need to take a break first let me tell you about car shield\nCar shield is uh is is going to save you from a lot of trouble they're going to save you from taking your car in and you've got something wrong with it or even an oil change and then it comes out and they're like her got some bad news for you\nKnow we found some extra stuff and it's going to cost and you're like what\nLook\nThese are surprises that nobody wants and everybody gets but if you have car shield you don't have to worry about it if your car breaks down after the warranty expires you can be out of pocket for thousands of dollars just to get it fixed but if you have car shield\nChances are you're not gonna have to come out of pocket for anything that if you if you want to take your car into your favorite mechanic or the dealership usually people go to the dealership [noise]\nUh I mean what lately to put it this way why do you avoid the dealership after your warranty expires you avoid it because you can maybe get it done cheaper a by your favorite mechanic and maybe he's not use in you know the same parts or whatever you'd have a fixed by the dealership when you're warranty expires if you have car she has no problem\nBecause they pay for it they pay them not view so you don't have to go and write a check and be out of pocket they do it car shield save yourself thousands of dollars in car repairs the future because it's going to happen happens to all of us\nIs celebrating what he calls a strong victory over democratic challenger James Smith incumbent took the my first last night in Greenville\nI Want to reduce taxes I Want to reduce regulations on to keep people say no to educate the children since I've been in office I went out twenty three thousand new jobs over a billion dollars and you invest and things are getting better ... more people working now than we've ever had before\nHowever three political scientists from Winthrop University the College of Charleston in firming university\nBut Smith a slight edge\nHenry right now in South Carolina is on the bottom sale about every list that we want to be on the top of and in South Carolina world football team and your head cut you'd be fire\nAnd it was the final debate between the two perhaps the last chance for Smith to seize momentum in a race polls show him losing by double digits Jake or what news radio five sixty W. V. O. C.\nDo the the you know you're not at home don't wait get secure three sixty scurry products offers a full line of liberty safes tired of paying for that safe deposit box secure your prized possessions in liberty safe\nAccess your heirlooms injury anytime at your leisure three sixty security products located in ... called eight to eight nine for three four that's eight to eight nine for three four or visit liberty safes of South Carolina dot com over a hundred and stock come visit us in our most local service you can trust that liberty safes of South Carolina dot com\nAnd fast enough [noise] don't waste register online and only for the council [noise]\nThan [noise]\nThan the Glenn Beck and call and Bill O'Reilly Georgia's that about half an hour for no pads gray from pat gray at least heard every day or just prior to this program on the blaze radio and television network\nA and you can sign up for his podcast a really great podcasts lots of laughs and lots of insight pat gray unleash wherever you get your podcasts pat\nShould we talk a little bit about Megan Kelly\nYes in the hands horrific crime she committed I'm surprised ... still walking around in this society sincerely has she been imprisoned yet I don't think so and she needs to be she dangerous well she has\nYou know she is violated something that NBC feels passionately about to do well he started to they\nDidn't feel that passionately about it when Jimmy Fallon dressed up in blackface as Chris Rock wait what he dressed up and imitated Chris Rock and yeah but I'm from what network though I'm a little over there\nThat was on NBC always Indian being NBC that end up saying that we're not even anywhere really worked for ... dress up and blackmail no no it it might be okay for Halloween if you are\nNot making fun of someone right so she wasn't making fun\nOf well he was he was kind of making fun of Christian values imitating ...\nA ... you know it's even more ... than that though and it's it's ... it's despicable that we have to play this game and it it's okay for all of them are the Jimmy Kimmel thing with a ... and Carl Malone do we have that audio yet Sarah my gosh I Am not one has agreed oh we have a rabbit\nListen to this is Jimmy Kimmel in blackface\nSome time in my home alone look up and sky and say what the hell's going on welfare reform on other planets\nPhone hold on while home loan rate on TV about white people getting ... singing all on a hell of a damn thing\nDown home alone ever seen a flying saucer hisself folk festival real spoke at a homeless I say I mean ...\n... hanging out that's just give me ... it's unbelievable unbelievable we talked about you imagine even even talking that way no without blackface just talking that way it would be our last day\nBe gone you know I talked to a of a couple of different examples of blackface are being used in comedy early recently like in those Sunday in Philadelphia was one of the examples we brought up but it's an insult was sending in Philadelphia they did it and they did it as for a minute they're making a point right like that only be more on ... characters on this show would think that that's an appropriate\nThing mhm this gimme came of it is just saying hey I'm black and I'm Carl Malone it just him mocking a black person yeah a mind the way he ... and the only thing is to speak the only thing that's funny about that is the way he speaks yeah yeah that's it mhm\nI mean play that again tell me the joke in here other than the way he's\nSpeaking what was it the Ebonics\nIsn't that what they call and then the person that's the only other I think he's doing right now listen to this [noise]\nI mean the joke to some time and I call open sky and say what the hell's going on out there will fall into another planet\nPhone home like in the\nHome loan rate on TV about why people getting out to buy our way of thinking all on a hell of a family thing stock down\nI mean they're not a single jokes no he ... as Karl Malone always did no not always but often did referring to himself in third person and it's a random topic of the only other part of that they said yeah and he's a black face right now so unbelievable for getting\nCut again at the end the Jimmy Fallon one more because Jimmy Fallon is not a political enemies and Kimmel has put himself in as a political commentator so it's really agree just for him\nBut Fallon who is I think there is no ill intent by Jimmy Fallon doing that bit he's friends with Chris Rock writing but the issue here is on the freaking NBC yeah\nYou can spirit is a wire legally for mentioning it but you're like Jimmy you're going to give Jimmy found the top but place in your network so what she said\nWas weight but if you are if you are\nHolding somebody up if you're if you're making fun of them okay but if you're holding somebody up like this woman who you know with Diana Ross she liked Diana Ross you unlike Diana Ross for the night and she's not making money and she's not making fun of Diana Ross\nWell isn't that what Fallon did actually didn't ask the question he says ... ...\n... ... ... you brought up a great point yesterday glad I thought about this as we're getting close to we're getting close to Halloween\n... ... the biggest deal in the world was made of finally African Americans have a superhero Black Panther finally\nIf you experienced pain on a daily basis I Know exactly how you feel it can be debilitating it can control your life the aches are easy to understand when it really hurts to do the basic chores emotionally the effects of pain can be just as dramatic I have spoken to so many people in this audience that started to take relief factor\nThat change emotionally is as dramatic as the physical relief maybe even more as you might know Tony and I started taking really factor several months ago after\nAbout ten days subtle changes started to become significant and I've been able to stop taking all prescription pain medications all pain medications entirely and stop the terrible\nSide effects of those awful drugs many on my team here the blaze are faithful takers of the one hundred per cent drug free relief factor and we have had great success in taking our lives back try and get a three week quick start package for only Nineteen Ninety five take it as directed that's less than a dollar per day and if it works on you like it has with\nMe you're going to get your life back relief factored dot com\nIt took some\nTime in the ... they are in the bombing was bombed by ...\nMeaning\nDon't miss your chance to win W. V. O. C. and all states seamless gutters one hundred thousand dollar flown home makeover think of the possibilities one hundred grand to spend on your home how ever you chew\nAnd therefore chance to win now at W. V. O. C. dot com using keyword home and let the remodeling began that's W. V. O. C. dot com key word home\n... and all states seamless gutters one hundred thousand dollar phone home make over\nPower by lifetime cabinets encounter times\nFell into from writers illusions Carolina pool tables plus and all states seamless gutter\nHighest Gary David ... Woodley and South Carolina homes and land realty I've told you for years have I ever decided to sell my home I'd be calling Lance well my wife and I decided it was time and of course we call that you've heard Glenn Beck talk about Lance now I've heard so many great success stories and talked to so many people who've got their homes sold quickly for top dollar that we weren't concerned\nBut we weren't ready for what happened in our homes sold contracts fullest price in twenty four hours full list price\nLance Woodley and his team itself into homes and land reality this is what they do for everybody they do a day in day out they've been doing it for years local realtors who know the market they knew how to price you're home get ready for sale and by the way so covered they'll sell your home at a price and a deadline you agree to if that doesn't happen Lance will buy it for cash\nNumber to call eight oh three four o seven thirty eight eighty three eight oh three four o seven three eight eight three the website ... dot com that Lance Willie ... and do what we did start packing on film [noise]\nI was surprised to find out just the other day uh that uh Glenn Beck dot com has just won the uh best radio website award and they were the words twenty Eighteen and uh we're thrilled and uh and and grateful\nUm we have a a an unbelievable team a\nThat um [noise] you haven't seen anything yet uh come\nCome December first I think you're going to\nYou're going to see uh the best of this team and we're really really excited to show you and I just wanted to congratulate or Alexander and everybody else on the team for winning the best radio website for twenty Eighteen ...\nAnd December we're going to go full democratic socialist so you'll get the news stories July Hubbard criminal ...\nAnd you don't even have to subscribe we just come and take your money right so it works really well for us yeah a really great you know I mean well yeah but it doesn't matter doesn't matter I don't care about you why don't you care about the children you don't make it on without breaking the few act man\nHey man you're the eggs audience yeah ... yeah [laughter] we have to get some ...\nSome more of this a New York times that I Am very interested to hear what a Bill O'Reilly might think about the uh the media's actions this week I I I feel like he may have some thoughts on it I don't know yeah he's\nReally kind of silent about things like this usually yeah he he's that you do get the sense that\nAre above all bill really cares about the media at like above it he loves it you know obviously talks about the country and he talked about the issues and everything else\nBut like you eat the passion comes out because you know he's been on the wrong side of it here for a while and uh the passion comes out when the media is mentioned and there was a lot to talk about this week so we're going to mention the media ... [laughter] to poke him with a big wall our next our Bill O'Reilly semi Mm\nColombia's most dependable traffic mornings and afternoons my news radio five fifty ...\nSo I the last uh last weekend I was at a um a tech and a economic conference and [noise]\nThings are moving so fast we haven't even talked about the five gee network student ratified G network no not too much going to change absolutely everything absolutely everything\nAnd block chain and bitcoin are the future and you're going to see these things start to compile on themselves here in the next twelve to Eighteen months these companies are spending a lot of money setting it up are you kidding me in the ton\nSo anyway I I I Need to understand crypto currency and block chain I think everybody should have a hundred dollars in it but you know if you decide not to but you do have to understand the world that we're\nHeaded towards takes a smart crypto course now smart crypto course dot com we've had taken tore put this together for us smart crypto course dot com or game seven seven P. B.\nIf you've ever experienced heart racing shortness of breath or dizziness it's possible you could add a trio fair relation one of the leading cause as extra mind out before it's too late with cardio among the FDA cleared personal EKG divide that just Ninety nine dollars to order visit Amazon dot com and tightened cardio ...\nFamous on dot com can't type\nCardio ... cardio mobile fits\nIn your pocket and so you can take any ... any time anywhere right when you\nFeel exempt cardio mobile delivers a medical grade Katie right to your smartphone and just thirty seconds you'll know if your heart rate than his normal for if a trio fair relation is detected border cardio mobile today for Ninety nine dollars [noise] visit Amazon dot com anti party of milk\nTake unlimited ... morning noon or night that you can always know how your heart is doing\nCardio mobile click piece of pie in your pocket for only Ninety nine dollars for your time today visit Amazon dot com and type ... mobile for learn more cardio mobile dot com\nIs good talk everyone knows\nHigh scary David if you like me you probably think that there is a very expensive well the big box places yeah\nNot so that was all states the most got ours they can put gutters on most houses for less than twelve hundred dollars\nMatter of fact you mentioned you're talking about him you'll get forty percent off on guns and gun or protection right now\nAll states the most ... with a lifetime guarantee and get our protection their maintenance free oh say seamless gutters local yelled at half the price of the big pitch companies protect your home by cutting all states the most governors eight three three five gutter online all states the most gutter dot com\n[noise] before you get caught up in I think your ears into some clarity Marta ... one news radio five sixty doubling you\n\n\nBut it's up to it doesn't suspicious packages now I'm Dave Anthony to more intercepted this morning one sent to a democratic senator the other and acts Obama intel official turn Trump critic Fox's Rachel Sutherland does more life from Washington\nRight and he is not a it was started by what's his fat face loud mouth guy what's his name is do no no no uh Alex Jones sixty five percent\n[noise] whatever it is a you know and I and I talked to Bush about this on TV and extensively and he basically said factor that's my strategy I'm not changing it okay so that's number one\nSo Donald Trump could have done that easy but he chose to fight back trumped it and he said I'm not going to let these people marginalized me 'cause it'll never end\nAnd the American people uh see me as a fighter they see me as a person who strikes back one attack so while I'm going to do that\nSo then you have to say okay well who started the fracas who started this and you can make a case that Trump's bombastic a tax on his rivals in the uh in the primary process um started it you can make a case for that\nHow how did he he was just telling people names yeah he's a symptom the American people have never been this way we've never been this way no no no is it to them on your feeling be ... and ... to death\nBy being called racist and homophobia and everything else came\nLater when it when it was apparent that Trump was a player and could win see what people don't understand is that in the beginning the press didn't think that Donald Trump could do anything if you don't have a chance he was he was like\nEntertainment All right let's bring out the dancing bear that out of the press saw him but then when he started to win the whole strategy changed and I keep saying that this comes from the corporate level and it does\nOkay so then it was destroy him destroy ... that that would be orders that came down from the editors of the New York times not in those words but it was very clear what they wanted to do Washington Post CNN MSNBC\nElemental Facebook I mean they're on their ... their on video saying that\nYes okay so there's no doubt that people listening to us know that\nSo that it's All right if that's the destruction that has been ordered how does Trump counter what does he do he doesn't have surrogates I mean there are no surrogates who can do it for him he has to do it\nSo he does it\nIn a very blunt\nAnd sometimes disturbing way for a president but my column said what is his choice\nWhat if he doesn't do it they are going to marginalize and destroy him he'll be the laughing stock and yeah you know liberal precincts he is already but he doesn't care about that\nBut he has a growing I Believe growing number of people supporting him\nAnd the reason he has it been is because it gives them no quarter\nYes he fights back but now they're turning it around saying well your\nYour fight back cabinet Kavanaugh fought back oh he's out of control oh that's not a if that fight back shows he doesn't have the temperament oh come on you're you're being destroyed by these people you're not allowed to show emotion\nIt's the same thing so now with the bomb thing out Trump did it where where CNN and we're not responsible for any of it all in all ... us now I'm hoping that the vast majority of the American people\nUnderstand what's happening I think they do because CNN's ratings are so terrible no matter what they do no matter how they ratcheted up\nStill very very few people watch them so I'm hoping they get it\nWell they're not going to um so so bill uh how much trouble or are they in I mean\nThe New York times literally paragraph thirty five in the New York times talks about how this doesn't look like these bombs were made by somebody who wanted to actually kill anybody\nThis was just a statement of some sort of what happened to us from the job of course they're cartoon bombs they are the only thing it it doesn't ... this\nIs a the gang that couldn't shoot straight or gay or straight this is ... by mayor yes was a\nPress we're going to do this to get it into the press because we know the media will go hysterical\nCorrect and it could be somebody who was on the right and didn't want to kill anybody but wanted to make a statement and they are crazy\nCould be somebody on the left who wanted to do the same thing could be somebody who is just a really unbelievably worst bomb maker known to man which I highly doubt\nIt could very well be somebody who thought you know what we're going to send these to the press we're gonna send these ... all of the all of the enemies of the right or we'll obviously sway an election\nObviously crowd contrived to get media attention to influence them in terms I'm putting my money on putting\nA button [laughter]\nHow do you do and how does the uh media respond when it turns out that ah it's it's either a prank with you know political motive or it was politically motivated or by the left\nWell that would be an amazing story wouldn't it or why I'm hoping the FBI can you know flushes out pretty quickly\n... how would the press handle what I think that they would um look you have to understand it every morning out or the or Washington DC think tanks progression think tanks bass and stuff\nTo Anderson Cooper and and Rachel Maddow and these people they get stuff so that they'll they'll sit down and go okay now how are we going to spin this um maybe the person sending it was insane or you know that kinda thing they'll never say\nWell gee maybe\nUm our side is so craves now that we have to criticize our side you're never going to see that ever [noise] back with Bill O'Reilly and the rest of the news of the week in just a second [noise]\nNo [noise]\nDoes this change the election what's going on [noise]\nI Will tell you if the [noise]\nHouse in the Senate or lost uh we're in for an amazing wild ride a especially economically I think we are already in for a wild ride and one of the reasons I'm becoming more and more concerned\nAbout the trade war um but imagine imagine if the house in the Senate or just the house are controlled or what is the president going to be able to do uh on the economy what does the president going to be able to do without a Congress or when it comes to just the skirmish on the border\nYou imagine if you imagine what that is going to be like\nGold line has just put a report together a on what you can expect if there is a democratic victory you can get this report for free just by calling them I don't know if you've been paying attention to the stock market's um but you know instead of this ah this this bombing things from somebody who is clearly\nEither incompetent unstable or just wants attention but we should be paying attention to what's happening in the stock market what's happening with the economy read this report I've read it I've already shared it you need to get it to its free all you have to do is call gold line right now and ask them for their election report\nA doorway called them now eight six six gold line one eight six six gold line or gold mine dot com\nRuss Limbaugh weekdays new to three news radio five sixty W ... [noise]\nEvery day it seems like we turn on the news and you have absolutely no idea what's going to go on its war in Syria another mass\nShooting a terrorist attack another indictment and the Mueller investigation a mudslide earthquake an inexplicable drop in the stock market it's crazy that's why you need to prepare up because you're paranoid or pessimistic because\nEveryday sunrise can bring a beautiful day or a terrible nightmare the difference between people who are going to lead and survive and the people who are going to get lost or whether or not they're prepared since ... eleven we'd been partnered with the folks at my patriots supply their the people I trust for my family's\nPreparedness needs and from their line of emergency food storage that last up to twenty five years revolutionary electric pure water\nFiltration systems or dozens of other products their preparedness specialist can help you make the right choice for your family\nOn mistaken belief mark Colombian week nice if they use radio five sixty W. V. O. C. [noise]\nFrom the w._b. OCD center of the boy was the last ... gubernatorial debate before the upcoming midterm election is history Henry McMaster is celebrating\nWhat he calls a strong victory over democratic challenger James Smith incumbent took the my first last night in Greenville\nI Want to reduce taxes I Want to reduce regulations on to keep people say no to educate the two\nHowever three political scientists from Winthrop University the College of Charleston in firming university give us Smith a slight edge\nHenry right now South Carolina is at the bottom Seth about every list that we want to be on the top of and in South Carolina where football team and you were ahead touch you fire\nThe heck is offering free flu shots they in Greenville Lexington in North Charleston anyone six months or older\nAnd police departments across the state getting ready to take unused prescription medications that tomorrow's annual national prescription drug take back they tended to locations online at DEA take back dot com Jake or what news radio five sixty W. V. O. C.\nHi it scary David went in and I decided to upgrade our counter tops we look for a company with a great selection great prices\nAnd one of the prides itself on insulation in customer service we found all that more with lifetime Kevin's the countertops I can tell you this if you can't find exactly what you're looking for a while you're there and that's rare they'll find it for you\nThey cut and install you're kind of tops it'll form it out to a third party contractor they do it all ... to run and Colombia and cheap and run in shape and granted marble courts courtside they've got it all seem on Facebook had lifetime cabins and counter tops or call seven seven to twenty to twenty took\nWhat kind of on the ... bombing with the bomb bomb bomb bomb\nA brand\nMean if\nDon't miss your chance to win W. V. O. C. and all states seamless gutters one hundred thousand dollar flown home makeover think of the possibilities one hundred grand to spend on your home how ever you to enter for a chance to win now\nAt W. V. O. C. dot com using the word home and let the remodeling begin that's W. V. O. C. dot com key word home\nW. V. O. C. and all states seamless gutters one hundred thousand dollar fall home makeover power by AAA heating and air freedom plumbing mayhem roping crawl space medic and all state seamless gutter\nShowed us the regime in the studio with last really from South Carolina homes and land realty you know as I Do tell people you also the average age of forty seven and one in South Carolina\nHow do you do that you do Jonathan is because real estate is what I Do and I've been doing it for over twenty five years I'm a student of real estate in specifically real estate in the middle and South Carolina I'm constantly researching ways to be more efficient to sell your house fast\nAnd for more money this is an exciting time to be selling your house but rather than just having a real estate agent with a sign you need a team that can sell your home fast than for top\nDollar last we're always hearing about persons who list the homeless people in his soul than twenty four hours our friend Gary David his home soldier less\nThan a day for more than the list price Jonathan we have a marketing system that just brings hundreds of buyers through our system and one of those buyers is going to be right for your\nCall when do they do it three four o seven three a day three or ... dot com and start packing would you buy a pool table and\nInternet big mistake chances are it'll be low quality Wharf and become an level the place to buy a quality table that's going to last to Carolina pool tables plus forget the mess Caroline of pool tables plus seven nine five three zero five\nImagine for a moment\nIntense storm is pounding your house will your roof leak will decide below away what about your basement Willard flood\nIf your house was properly built and maintained\nYou'll be fine what about your four O. one K. or your investments your retirement income the stock market has had a great\nRun the past few years but it's it's current turmoil making you feel uneasy are you confident your portfolio was built to whether a financial storm right now maybe an ideal time for you to get a second opinion on your retirement strategy\nPreservation specialists column\nZero three four five for nine zero four or five ... we'll let you know if your portfolio ... some weatherproof eight eight zero three four five for nine zero four or five investment advisory services offered through kilos capital link\n[noise]\nYou're listening to climb down come for Bill O'Reilly Phil let me lay out a scenario here and you tell me where it's where\nI'm off base I don't think this caravan helps the Democrats in the ... mid term elections and it's why\nThe press is saying oh there's no there's no evidence that they're going to come all the way to the border and they're dismissing it and that's just a crazy conspiracies the thing that I get all the Trump supporters all wound up\nThere all dismissing this now um I I Can't believe that the they're going to make it by the mid term election I think this is the to the to arrive\nAfter the mid term election a and a possible new Democratic House which will throw us into chaos hey you think there's any the reality in there be what do you see coming in and how things are going to shake out\nI said on Bill O'Reilly dot com right now is who's who's at the Mexican government will break up a a lot of the ah the caravan before\nThey start getting on to vehicles because they're not going to walk to Macau in Texas or do you wanna um San Diego sector they're not going to do it so they're at a they're approaching a or a railway term in is now in Mexico\nSome of them will get on trains heading north Austrians have to stop and Mexico City and that's why I Believe the Mexican government and start to intervene um some of them will make it I'm\n... now and they're not going to walk so you don't think it'll be a mass\nNodded break 'em up that's what you know look the state department palm pay I was down there and now I mean he's screaming at them now that you know if you let these people en masse go to the border we're gonna take economic reprisals on Mexico and that's what they'll do and they know it so they'll break it up\nBut some people will reach and some people would get they're mostly in vehicles I'm not sure where the smugglers command the cartels come in a a a\nBlouse in front of the at us already has vehicles down there um\nYou can do trains they can do a whole bunch of thought but when it gets to that point the um border authorities will put up barriers new barriers and there'll be man by us troops and there'll be no way for the migrants to get to any U.S officials to apply for asylum\nChose already said he's going to do that he has to do it on the left is hoping for some kind of violent confrontation that is what they would like to see 'em but I agree with you that this is not helping the Democratic party I'm In the vote\nTen days from now how bad it's hurting them it depends what section of the country or rent\n[noise] do you ah um do you see the the\nPossibility that real radicals\nWould like to set up a a Palestinian uh Israel situation at our border and they would be handled exactly the same way by the media as they handle the Palestinians and Israel they\nThey show the big bad state beating up on the on the little guy do you I mean I I said two years ago this is what our border is eventually going to look like they're going to set up a\nA Palestinian state in kind of situation and we're going to be Israel I mean they've already done this you know on the small stage bring it you know bring it to Broadway bring it to the American border and that's the way they'll play it\nMay be but there's all the ... the Mexican government does not want that or they don't they ... they don't want that got problems on the border um you know war is one of the worst places in the world Tijuana right behind\nThey don't want all this because it drains their infrastructure I mean this is an environmental disaster from Mexico\nThese people only facilities that they are the water they need food\nMexican people are poor there's not the infrastructure to support their so yeah\nSo how do they would love shanty towns there with ...\nMothers and babies and look at the United states they're rich and look at these people and let them in short but the Mexican government I'm telling you is under tremendous pressure by the Trump Administration not to allow any of this to happen\nSo so um how do you move seven to fourteen thousand people and just find enough water how is this not a humanitarian crisis\nNews radio five sixty W ... [noise]\nIt might be hard to find good craftsmanship these days but it is out there if you want thoughtful attention to detail do was simply safe home security simply safe system keeps them more than two million Americans safe every day and you'll set it up within minutes\nSimply saves sensors are practically invisible so they don't wreck the look of your home and you never have to sign a contract right now you can get ten percent off your simply safe system at simply safe ... dot com that's simply safe back dot com I'm Jay\nForeigner CEO of Quicken Loans America's premier home purchase lender\nWe've created a new way to protect you from unpredictable interest rates are exclusive rate shield approval first we lock your interest rate for up to Ninety Days then if rates go up your rate stays locked but you've rates go down your rate drops either way you win call us today at eight hundred quicken or go to rocket mortgage dot com\nRacial approval only about on certain three year fixed rate loan scholar crossing permission and conditions people housing let her license and all the states and I'm less number three thirty additional conditions or exclusion may apply\nHigh scary David if you like me you probably\nHigh I'm doctored right white from the heart\nOf dentistry Halloween is generally regarded as one of our most popular national holidays unfortunately more than two hundred and fifty thousand men and women will be unable to take part\nIn that photo of ration that's because they're serving our country many abroad in hostile locations like Afghanistan yard of dentistry well hosts our annual candy buyback program which encourages kids to bring us or extra candy and pay them for\nThat extra candy will be shipped to our servicemen and women stationed around the world and many of my staff including myself are former military I\nRemember how much it meant to us to be appreciated by the civilians we served will be collecting candy November fifth for seven and will pay a dollar per pound up to five bucks a kid we also have cards for the kids to sign for the troops just another way the art of dentistry gets back to the community\nTime in the ... they're bearing bombing was from the bomb\n...\nDon't miss your chance to win W. V. O. C. and all states seamless gutters one hundred thousand dollar flow home makeover think of the possibilities one hundred grand to spend on your home how ever you'd you\nEnter for chance to win now at W. V. O. C. dot com using the word home and let the remodeling began that's W. V. O. C. dot com key word home W. V. O. C. and all states seamless gutters one hundred thousand dollar phone home makeover\nPowered by lifetime cabinets and counter tops sell it to burn brighter solutions Carolina pool tables plus and all states seamless gutter\n\n[noise] I think I've just received one of the\nMost incredible emails I've ever received over the shared a next hour from the print in Zimbabwe [laughter]\nYeah he was ... yeah it's yeah it doesn't say if I send them some money he's gonna is it just a little bit and he can give us a lot of good in this I Want to talk to ... I was a little skeptical when you've got to do I'll get a rush to get it done to pay you write about gay no that's not it but\nUh amazing story I'll share with you coming up in just a second\nI'm also if you want to know not what you should be outraged about but what the left is outraged about it's actually kind of funny and we're starting our outrage of the week give away are we likely to set up a sign up for our newsletter we're going to send you a the the biggest outrageous from the left of the week the crazy things that are really putting them off\nOr is this really it's it's it's kind of enjoyable it really is a Glenn Beck dot com slash outrage are you a river friends you have chances to win a copy of the book uh addicted outrage believe those are signed copies of the best down so\nBut just joined us Glenn Beck dot com slash outrage sign up for the outrage is of the week not the ones you're supposed to be mad at\n[noise] but the crazy left one [laughter] okay [noise] also\nWe're on tour beginning next week um and we're very very excited um and uh I think we're going to Richmond on Wednesday\nAnd uh so we can't wait to see you in Richmond, Virginia I think it's actually Thursday they after Halloween\nAnd it's the weekend before the a weekend before the uh the election so we have a view of things to say about the election just of you know I think yes yes yes uh Richmond Hershey, Pennsylvania Pittsburgh and Cleveland coming up next week\nYeah so you don't you don't want to miss that you can grab your tickets Glenn Beck dot com\nIt's been a long time soon to Cleveland and it has been packed middle longtime slip in any of these places yeah they don't want us all the males will let us out of state yeah\nYeah but that can be really fun in the crowds rose great there and our excited to uh to see everybody on a tour it's been a while and uh that's going to be you know what I'm really excited anxious to ah the two ah experience is uh all of the people that are going to when I Walk out go\nWow he went to hell Disney wow he's let him I feel\nLike that's about half the tickets are hurting people don't you do like the ... the what happened it's really I mean he was going to make it and he's not going to make it the whole thing I mean I think he might drop dead halfway through now at a bit because you're doing the show sitting which you can usually get through you well but they said no no\nNo I mean I'd buy said but I I I Am going to bring one of those things you know that they have in the grocery stores in at Disneyland the wheelchair that card yeah there's drive around so I'm not going to be pacing back and forth on stage out one of the guard also yeah Mm\nColombia's home for Rush Limbaugh news radio five sixty W ...\nCyber criminals could attack your laptop your tablets smartphones\nAnd they do it without warning without even knowing they can steal your identity you're not going to realize that until it's too late that's why lifelike\nIdentity theft protection now includes the power of Norton Security to help protect your identity and devices lifelike uses proprietary technology to help detect a range of threats\nTo your identity like personal information on sale on the dark Web and Norton Security protects against the online threats like ransomware malware and if there's a problem they work to fix\nIt no nobody can prevent all identity theft or cyber crime or monitor all transactions at all businesses but new life luck with Norton Security provides more detection and more protection against cyber threats to go to a life luck dot com or cold one eight hundred lifelong can use the promo go back for an additional ten percent off your\nFirst year plus a twenty five dollar Amazon gift card with annual enrollment that's life left dot com and promote go back\nTen percent off and a twenty five dollar Amazon gift card terms apply\nFor birthday an anniversary bouquets our special but sometimes the most meaningful surprise\nComes from receiving roses just because right now one eight hundred flowers is giving you an exclusive twenty four for twenty four offered twenty four multi colored roses for twenty four dollars it's only a dollar per rose daughter twenty four multi colored roses for twenty four dollars go to one eight hundred flowers dot com\nClick on the radio icon and ended up ... back that's one eight hundred flowers dot com promo go back hurry offerings friday\nPollen guarantee we spend most of our time indoors film I read in the outdoors when you're inside too with over six hundred scientists to choose from plus ... we have a solution to make your indoor air cleaner fresher and\nWell better are filtered they're manufactured right here in America and free within twenty four hours and you can sign up for a subscription say you never have to think about air filters ever again [noise]\nHi I'm doctor Dr white from the heart of\nDentistry Halloween is generally regarded as one of our most popular national holidays unfortunately more than two hundred and fifty thousand men and women being unable to take part in that sold ration that's because they're serving our country many abroad is hostile locations like Afghanistan\nThe Arctic dentistry well hosts our annual candy buyback program\nWhich encourages kids to bring us or extra candy and pay them for\nThat extra candy will be shipped to our servicemen and women stationed around the world many of my staff including myself are former military I remember how much it meant to uh\nTo be appreciated by the civilians we served will be collecting candy November fifth for seven and will pay a dollar per pound up to five or six yeah we also have cards for the kids just signed for the true just another way of yard of dentistry give back to the community\nComing up traffic and weather report mornings use radio five six [noise]\nYou you see [noise]\nThis is a Fox News alert to more suspicious packages have turned up in the mail this morning I'm Dave Anthony one was intercepted in Florida address the Democratic senator Cory Booker\nThe other was sent the former director of national intelligence turned a Trump critic James Clapper found that a post office in New York City consistent with the packaging we've seen this week NYPD counterterrorism chief John Miller says officers X. rated inside\nI remember a story are being told by an instructor in the military being told of convoy that was ambushed after having a Humvee take a hit from an IUD\nHe was treated um he was a treated or in the wounded man and needed to carry one of the soldiers off to another Humvee to be met in fact out\nOne of the soldiers had his arm severed just below the elbow and it was in shock\nHe handed the soldiers his own arm after applying a tourniquet and told the soldier he needed to follow him as he got another soldier out that was unable to walk the man and looked at his own sever an army and his hand and repeatedly told the medic\nThat that helped him that his arm was fine and this was in his arm sometimes we just don't know how to deal with things\nFor two solid weeks I lied to myself and my daughter was fine and this didn't happen didn't happen to her it didn't happen to us and I broke down in tears finally able to process what had fallen my now seven year old daughter\nMy wife forgave me for spending those two weeks it wasn't until months after\nThat we would figure out who had done this terrible thing all I wanted to do after she told me about this was find this uh this guy and cut off the offending appendages\n\nAs it turned out it was a twelve year old boy he was in my Sunday school class for ten months\n\nI had been teaching this boy in Sunday school\n\nOh how I hated\nWanted to hate this young man I wanted to ruined his life before it even began\n\nI wanted to let you know\nThat in the height of my hatred I downloaded your book addicted to outrage on audible\n\nWho's the last couple of chapters and I heard you speak\nThat I I realized that my outrage was justified but it was also toxic and it would become a force to be used to destroy me I needed to forgive this boy\nBecause we are required to forgive all men\nI forgave him in my heart\nAnd as I did I felt the burden of my outrage and my anger lifted\n\nYes the pain of what happens still lingers and the reality of the situation is still very real but my outlook in my spirit or no longer held hostage by my hate\n\nI just wanted to thank you for writing this book it literally helped me pick myself out of darkness so deep that I felt there was no way out\n\nI wanted to let you know that your work has helped save at least\nOne guy Christian\n\n\nChristian is a um\n[noise] as a man who has gone through a similar situation recently with one of my children\n\nAnd I thank God we caught it before anything happened\nI understand I understand\n\nWe knew the address of the man who um did this to my son\n\nAnd I think if it would have happened and I wasn't home my wife may have killed him\n\n\nI think about it all the time to think about my children all the time\nAnd\n\n\nYour email has reminded me\n\nThat it's not just me or I haven't talked to my wife about it\n\nFor the last few months and I know how much it still bothers me\n\nHow we're responsible I have been to not realize she is probably dealing with it as well\n\nThere are things that we don't want to think about\nThat are truly frightening and I think\nWhen we look at our country when we look and we really realize\n\nWhat we really stand to lose\nIt's not our job spend our money it's the unsinkable\nIt's something that doesn't happen to us that happens to other countries but it doesn't happen to us\n\nAnd it's so scares us that we avoided and we talk about other things\n\nBut that's just as dangerous as the outrage and justice talks toxic\n\n\nIf you send somebody if you said to everybody you met in the next two weeks you know you look like you could use some cheering up\n\nI think you'd be right about eighty or Ninety percent of the time\n\nAcross all income levels across all colors and boundaries\n\nWe're all struggling with something and we all have something big to forgive man we don't want to\n\nBut the reality is we need each other my kids hated\nThe fact that I talked about in ... when they were growing up that endurance was one of the virtues that you had to have or you're not going to make it you have to endure endure life is endurance\nLife is about the long run not the short run\nEndure it to the end they hated that that you're always so pessimistic no I'm not I'm telling you\nThat there's a lot in life that you were going to have to endure that you're going to hate life is not what do you think it is when you're a kid it's just not it's harder than that but it's so worth it\n\nBut we need to be like a cross country team\n\nIf we're going to survive this we don't sheer the person who came across first we cheer the person who came across the finish line the last as well\n\nBecause we're all different runners we all have different things going on and it is truly about beating your last time\nDoing just slightly better than you did last time being slightly better than you were yesterday\nAnd if we can help each other and cheer each other on with that will make it\n\nGets harder and harder every day\n\nSo for us in the real\nWVU sci fi connection Frank did he take that time\nFrom the WVU seasons are under Gore would have said was a football team its head coach would be fired as the Democratic\nUnder James Smith said last night in his opening remarks in his debate with Republican incumbent Henry McMaster\nHe'd been made his pitch\nMy name is James Smith and I'm running for governor of South Carolina because I Believe in South Carolina where all our children have access to a high quality education\nWhether prepare for the jobs of today and tomorrow and what we all have affordable high quality health care and we're South Carolina is at the top of every list to live work raise a family and build a business\nGovernor Henry McMaster says if that ain't broke\nSince I've been in office um announce twenty three thousand new jobs over a billion dollars in New investment and things are getting better way of more people working now than we've ever had before\nLast night marked the final debate between the fair perhaps the final chance for Smith to seize momentum and raise polls show him losing by double digits Jake or when news radio five six feet WVU seat hey\nIt's John isn't running shelling that I saw my heart swells with conservative South Carolina pride\nAnd yet this could kill us all next\nJonathan our friends at the nerve dot org you've done some investigative reporting here and they found that we are in some big trouble at the D O G because we were expecting a hundred and fourteen million dollars available\nTo start working on our crumbling bridges\nTo South Carolina department of transportation has identified four hundred and sixty five of the seven hundred and fifty structurally deficient bridges\nNeed to be replaced not repaired replaced four hundred and sixty five of them and we were budgeting a hundred and forty million dollars annually and yet we're coming up way short as a matter of fact this year we're bringing in about Twenty one million\nThis is the best protests since the Boston Harbor Tea Party south Carolinians or saving the receipts and turning it into the income tax and getting their refund as promised to end the legislature and now they've done it so much so\nThat the state isn't generating the money that they were going to be able to get away with Robin out of our pocket good news is we're showing where one of the most conservative fiscally conservative states in this country yeah hey bad news is if you go into the bank with all that money don't drive over a bridge but it's not what you think about it on Twitter at rash thought the\nMove fitness concept is based on success whether it's weight loss overall fitness sports training or muscle growth success start said move get your free fourteen day membership and M. U. V. S. C. dot com joined them movement count them\n[noise]\n\n\nThat kind of looks like we may have the guy who was sending the package bombs we know now he lives in\nFlorida has a criminal history has ties to New York they have wrapped his a white van up so you can't see anything because he looks like a crazy man it's one of those\nYou know it's one of those vans where there's stickers over every bit of it um we're not sure it looks like he was a Donald Trump or a big\nBig big big big big big big big big big big big\nCrazy big fan of Donald Trump emphasis on crazy [laughter] ah you know but we we don't know for sure because it looks like that's what those stickers are but we don't have a clearer picture of it yet\nYeah I'm get get going Internet going on and see how long we have to wait until this is two thousand Eighteen I Want it immediately I Want to know that they want a guy in an hour ago I Want this guy in jail right now I Want to know and speaking of that by the way I mean isn't the bigger problem here don't we just\nStopped selling vans\nBy ... white fan stopped selling white van and arrest all people who own white vans that if you're driving around in the white van right now we'll give you a good no\nNo no we not Europe to no good if you're driving a white van right now we know you're up to no good\nWhat is your mail but\nWhat what what was it was there ... or is it about which one was where were you know at home sleeping last night can you verify that we have witnesses do you have do you have a discount the fact that makes it look like an ice cream truck she can learn a little\nKids in there that we do and I said I bet you're doing okay\nWhat else would you do with the white van and twenty Eighteen well in the business uses and well they wouldn't be this show no they'd bring up all sorts of things it it I mean if they have their own show they can make that point I suppose\nWasn't a guy wasn't the guy in Virginia so if you disagree with is get your own show uh the guy in Virginia didn't he have a van\nTo I thought he is living in his van or something wasn't even\nYeah it's I think you're right yes he was because he went to um he he would be that the YMCA the local YMCA so when the shooting happened they knew where he was and they knew who he was because he was very he he was lifted in another state and drove there should basically camped out there and prepare for the shooting right\nHe was he was a Bernie Sanders guy a big big big big big big big big crazy big Bernie Sanders guy and he was living in his man\nI mean it's going to be interesting to see I think there's several distinctions to several additional levels to this let's say we find out that this is exactly what is it is the person it is his van these are pro Trump stickers whatever I mean we don't know any of those things for sure yet uh but if we find that it will be an interesting distinction to see if he is the ... he's either a very incompetent\nLunatic who tried to blow up people and failed hang on for ... hold on I'm well more than ... ... or ... he's a a lunatic who ah was just try to scare people and did not intend to kill people that will be an ... a distinction that will be interesting in the investigation did you see it as an idea you know I'm going to guess incompetent\nI can get sick of it too because of a man like that you know if you're thinking I'm going to put his sticker on my found my bag because I Want people to know and maybe it'll change their heart maybe it'll change their mind\nYeah that bans and not that bad that that that man is like a ...\nStay away from this guy ... let me ask you this guy yeah in in American history where the for\nBeing global history in global has has there ever been an individual who has been won over by a massive collection of bumper stickers on a car has anyone ever changed in opinion are considered a new one because someone not from one bumper sticker 'cause I think that's even possible\nBut maybe even a couple of maybe not to write three you're pushing it\nUs three hundred bumper stickers covering all of your windows you are not convincing anyone to your viewpoint I think you know people because of it oh no if you have an ACOA\nYou're you're you're going to be kicked out yeah you're going to they're going to tell you to move because you're a spoof to death all of the neighbors even the name you could\nBe living in the most anti ... you could be living in a neighborhood with the holy family and the pope and all of the pro life activist from all the time\nRight and you could drive one of those crazy anti abortion bans into your driveway and those people are going to say you know we have standards\nYeah you're nuts I just really hope if Jesus comes back he's not in the van\n[laughter] you know I'm a white van with you about your bumper stickers people are not going to buy it they're just like I don't believe this guy there is no way back like that and again you're not supposed to know what's coming right maybe that's how that's how he does he comes back maybe that's how the anti Christ comes with that I Would yeah [laughter] well no no no because I wouldn't be flick enough he would have you know he'd", "show_name": "The Glenn Beck Program", "year": "2018", "city": "Columbia", "day": "26"}