{"month": "10", "state": "MA", "station": "WRKO", "content": "Uh you're breaking up um would you check her phone maybe we can come back to her later Bob in Orlando, Florida go ahead Bob\nHey hey they're like get what you like to check out the pulse nightclub\nNo wouldn't want to go there\nProbably a hotbed at least forty nine people died\nThere now that was horrible whoa\nYeah as it was and building still standing I'm just wondering what easy Petersburg okay\nWhat do you think of scenes like that that have a massive tragedies\nI well I I visited a a dark out\nAnd uh it's not like it's advertised when I was living in ... you know it's not like a big sign that said turn turn left in five kilometers to get to ... you know you have to know\nWhere you're going and I even asked a local and I speak German and and he wouldn't tell me I did stumbled upon it finally but even before I got there I knew that it would I just had this incredible feeling of tragic sadness I mean it was and then the\nWill Gettysburg has a lot for example what's up Gettysburg has a lot\nYeah I've never been to Gettysburg I've always wanted to go and I've heard a lot of stories about I'm sure I Would make some very strong connection there but I definitely felt that it ...\nVery ... it was a very hard experience I'm Glad I went but it was very tough to to be there\nJulie is in San Diego Hi Julie go ahead\nYes hello Hi there Hi joy ... and ... ... I Am so happy that top few will now [laughter] yes ... I I wanted to come on and of course it's hard to get on when you first\nStarted after our about when you first started I get Ken Martin lunch that that was so long ago okay so here's what I wanted to tell you first of all I Am from St Louis Missouri ahah I ... I was born and raised there um and I moved here when I was about fourteen\nAnd I'm I'm also a Gemini and I'm a few years younger than you do it\nSo I'm I'm a deal in second grade\nEasy Los your yeah exactly\nAnd here's late when I can tell you I remember the same length before I said this is the perfect time to call you said once before you were interested in people who have seen spirit ... and I have been seen them I I did and I I totally agree with you George how you feel about the lead to court\nI I actually I Would start with that analysis in about sixth grade but when ours around twelve I started seeing the earth and the first one I saw and and I do have a question trade barriers\nAnd that real quick the first one I saw I Will never forget because it was completely unexpected\nAnd it within the doorway when I was getting ready for school it\nWas a cat it was actually half of a cat that frankly I have a cat dragged itself across the doorway\nWhat was the other half\n... uh well here's what I don't know but it was ... its legs were going way far out in front of it like dragging itself across\nAnd it was clear as day and I've seen many after that I actually contacted one who am I had a name for a real weird name I\nWasn't going to say it on the air but I Will quote quote down and I actually named the cats after ... graders but I saw these every day and I even which show my friend and\nWinds at the YMCA and St Louis I wanted to tell you that George\nI don't know if you remember the YMCA\nBoy I when I went in that way back then there was a\nStairway that was a dark and I shut the dealer and had all these kids sit on the stairs and I asked this that's near it to show it south ... was it was like this big fell that appeared right the lights are on a movie screen\nOr did you have that and yeah so I Know many I I once I had a girl I took her in ... it's always better when it's dark I took her in the closet and\nI spent the night at our house and I asked them they can and that spirit start shapes ... and I remember it was in India and then it was a I I remember the Indian ...\n... you know it's kept shape ship is still following you Julia\nNo no no I I'm I'm really really I'm concerned about keeping myself\nAnd that's a good thing you asked that question\nWhich really have a minute for selection\nI very concerned about keeping myself in a positive\nI well you know I I\nCrave won't date with may go every day and and I think I've been told and very say it had been holding the medium but when I was about Nineteen I cut my a friend that I didn't want to deal with any real negative and at the\nTime that you can like yeah\nAnd I'm just wondering you're hooked on it\nShould she be afraid of negative energy is a minute left ...\nYes she uh she should be very cautious and uh when you when you get into the spiritual mowed the connection I always say something like I'm opening up by I use the star trek thing I'm opening up a all hailing frequencies to all good and kind spirits\nAnd with my spirit guides also helped me they are also called gatekeepers to protect to protect me from any negative energy so you have to say that right upfront that ... to it it pretty much bumps them out right away or we do have power over them and unless we invite them in so you have to be very careful to right up front\nPut you know have have your bouncers get get rid of him [laughter] what are you doing on Halloween Bruce\nAh on Halloween we are just handing out candy and I met him Norwegian ... it's like a meat do it's kind of our tradition and we have fun with the kids here we've got a lot of scary decorations\nEnjoy and I do know wherever Washington is I bet you do\nOh yeah yeah I used to live in ... my first house was in North Everett\nOn we've got a stage show coming up march twenty served at the historic ever theater so we're going to have some fun Bruce thank you let us know when the new book is done sometime next year which is right around the corner as a matter of fact today and below auntie Tom Dan eyes or\nLisa lion leaped Sloan who shot law to shore Stephanie Smith Chris borrows timber at all and George nap I'm George ... somewhere out there on coast to coast day um we'll see you on her next edition until then be said for [noise]\nHey our ... look we're very fortunate to be living in the home of the free because of the brave\nAs we have in the past W archaea will be hosting our annual da de radios on on November ninth thanking are brave soldiers for what they do and what they've done as a proud sponsor of the radio on our friends at my pillow or expressing their gratitude by offering you the opportunity to buy one pill a well getting a second one free\nA portion of the proceeds will be going to the da de ... on what you've slip peacefully because of our heroes in the military in my pillow wants to help you sleep well too so order now\nBy calling eight hundred nine seven two twenty three sixteen or go to my pillow dot com use the code W. R. K. O. and don't forget that code W. R. K. oh\nBy the way don't forget my pillow as a sixty eight money back guarantee and a ten year warranty so call right now eight hundred nine seven two twenty three sixteen or go to my pillow dot com don't forget that code W. R. K. O. and happy Veterans Day everybody\nWhen your assets are protected and your financial goals or a team\nThen you truly can sleep well at night\nTo achieve this peace of mind you deserve visit me stuff that income for life planning dot com I personally been helping people and businesses with their financial security needs for forty five years\nMy clients assets are protected with my swan sleep well at night portfolio concepts many years of practical planning\nExperience and continuous education of what they allow me to tailor a variety of financial strategies to address your objectives get ready to write this number down I'm staff founder of the income from life planning dot com\nEight seven seven seven to zero Ninety five hundred that's eight seven seven seven to zero nine five zero zero for a visit me income for life planning\nAnd remember there was never any fee\nOr obligation voice in Boston\nYou walk in one hundred and twenty seven to ... like eighty to Boston and I are radio station [noise]\nFrom ABC News\nHis fingerprints luminaries finding so it's not it's not a positive identification CBS\nNews says Mr say I get a list of more than one hundred others in his van when he was captured the list included mostly politicians and media figures investigator said Mr ... was his home and bomb lab authority said none of the devices headed triggering mechanism and Mr say ox as he never intended to harm anyone\nIt's ten minutes now after the hour on this morning Americas first news [noise]\nNothing small about your ... your passion your hours your reputation all huge\nTheir partnership even bigger [noise]\nWhich is not that good technology advisors you'll get the tax and bank and one on one partnership to help your business ground because with a reliable down these ... and ... you can focus on what matters now getting business down\nA seventh heaven by down to speak with an advisor today at age seven seven I doubt [noise]\nTwenty four seven three sixty five you haven't had an everyday thing you don't want something like Medicare part D to slow you down\nAt Walgreens will take care of your Medicare part D prescriptions\nSaving you time and money snake to switch to Walgreens today and get more bang earning a hundred pounds or more points up to five dollars on each Medicare part D prescription\nWalgreens ignore prefer pharmacy flunking tested since Ninety One prescription state of the fact that there was an when he thought he prefers versus another farmer stance on my plans points ... here in New York and there are going to other medications apply\nWhen the state ranks among the top ten in the country for ...\nYou knew and expanded facilities that's pure gross\nWhen it's tops for four straight years that's sure Michigan law known as a world leader in the automotive industry Michigan is also a leader in advanced manufacturing cybersecurity agribusiness an aerospace\nInfects CNBC rates Michigan as the most improve state for business to learn more visit Michigan business dot org\nUnofficial message from Medicare open enrollment ends soon so now's the time to be open mind smoking everything like prescription drug plans and Medicare Advantage plans have insurers why because climb straight soak in your house but I found lower cost aren't extra benefits and save money open to something better\nBut it would matter just got a call one eight hundred Medicare today open and honest and to some percentage [noise]\nPaid for by the U.S department of health and Human Services\nSo here's the story that may sound familiar I used to post to several job boards only to be overwhelmed with tons of the wrong resumes and because there were so many resumes that must have to separate the great candidates from those who are at the ... I mean it's not easy to\nFind the right person for my wineries my sports medicine for our global PR agencies\nThat old process was definitely not smart then I went to the recruiter\nThey figured out hiring\nRecruiter did the work for me\nMatching technology scam thousands of resume to identify people with the right skills education experience from our job\nAnd accurately invited them to apply\nSo I got qualified candidates fast smart\nShe weighs ... recruiters rated number one by employers in the U.S Tracy recruiter now for free it's a recruiter dot com slash free at ... dot com slash free once again the recruiter dot com slash free ... recruiter the smartest\nWay to hire based on trust pilot rating of hiring sites that were once I was reviews\nIf you're thinking if I can say it right here ...\nYears\nWithout the knowledge that you are listening to America's first this morning with the name of the topics\nThat have consumed Washington the confirmation of Supreme Court justice Brett Kavanaugh and the probe into Russian interference in the last presidential election are barely a blip\nIn political advertising this year President Trump and House Democratic leader Nancy Pelosi meanwhile are featured in tens of thousands of ads Wall Street journal national political reporter Julie bike which has been looking at the data Julie what have you found\nThat bottom line is that both President Trump and minority leader Nancy Pelosi are turning up in quite a bit of time in terms of advertising on specific to President Trump we found that he it's only topped by two other issues in mid term the advertising and that's health care\nAnd taxes [laughter] um so he\nSays number three in most common to the mid term advertising right and then\nIn terms of those themes he is portrayed sometimes positively and sometimes negatively\nThat's right and there's actually there's\nA surprising amount of positive Trump ads out there when he found that even I'm In a Democratic Senate and he's turning\nUp in a positive supportive way that scene in places like Indiana West Virginia where the Democratic senator is trying to hold onto his seat and said that Trump won quite a bit\nAnd twenty sixteen types of advertising like Indiana Senator Joe Donnelly thing when he first Hoosier time with him and another ad in\nWest Virginia has a candidate you know kind of saying I work with President Trump when he does what's right for West Virginia to theirs and supportive Jones in that type of advertising\nOne thing that really interested me about that stayed away from found that although you think that President Trump with is lower than typical favorability ratings and how much she dominate the news would be just blowing things out of the water in terms of\nNegative advertising President Obama actually far and away surpass him as a meal in in advertising back in twenty fourteen times during his\nPresidency and that you're fifty percent of all Republican ads were anti Obama into for parents purposes a Trump opposition type ads make up to ... percent of democratic ad\nAbout that and then I'm speaking of Democrats for Nancy Pelosi practically all the ads have a negative reference to her\nReally difficult to find anything positive\nAbout Nancy Pelosi in advertising and that\nCarries from not just a\nRepublican advertising but even democratic advertising you tie that a little bit here and there during the Democratic primary races and\nWe found that you know about nine percent eight nine percent of all ads out there have a sort of an anti below the message so that really shows that Republicans have found her to be at the fact is that and get his tales person for the Democratic party\nYou know we're speaking with Wall Street journal national political reporter Julie bike do it's about her story entitled Trump and polo seat dominate ads aimed at rallying and rebelling voters I'm about ... Supreme Court justice Brett Kavanaugh where does that come in anywhere\nSo you know interestingly the biggest news stories of the past couple of months here that confirmation controversial confirmation of Supreme Court justice Brett Kavanaugh and then the ongoing Russia probe I'm\nRobert Mueller taking a look at the the way that Russia may have interfered in the presidential race [noise] of course that has wrapped up a President Trump and many of them to see it in terms of question about it but those two sort of hot headlines are barely making any\nWeight at all in advertising this year that teeny tiny fraction of a percent\nOf all the political ads have anything to do with Russia and then on the Supreme Court despite hearing in quite a bit from both sides that that's what's going to be such a galvanizing event for voters in both of the party's platform two percent of all the advertising is mentioning anything at all about the Supreme Court\nNext Julie Wall Street journal national political reporter Julie bike away\nMore some program as you buy life's dream you have a\nBalance on your credit card and a higher interest rate than you would like why not turn those balances you do one monthly payment at a lower fixed interest rate and start saving money light stream offers credit card consolidation loans from six point one four percent a PR with auto pay\nWhite stream believes that people with good credit deserve a great interest rate and no fees plus there were a division of sun trust bank\nOne of the nation's largest financial institutions\nSo you can have complete peace of mind the process is very smooth and the service they provide is excellent plus our listeners conceived even more with an additional interest rate discount on top of light streams already low rates\nThe only way to get this discount used to go to light stream dot com slash deal that's light stream L. I. G. H. T. S. T. R. E. A. M. light streamed dot com slash deal\nSubject credit approval rate includes a zero point five zero percent auto pay discount terms and conditions apply\nAnd offers are subject to change without notice visit light stream dot com slash deal for more information again the light stream dot com slash deal it's twenty minutes after the hour on this morning Jennifer\n... is here with more of America's first President Trump and first lady millennia will visit Pittsburgh today after the weekend sing I synagogue massacre\nThat left eleven people dead that trip announcement came as Robert Bowers who was accused of killing eight men and three women inside the tree of life synagogue in the Pittsburgh area appeared in federal court yesterday us attorney Scott Brady\nHey everybody is going to be back on Tuesday and of\nCourse we're going to have more details about the big parade cannot wait\nAs him now that slated for Wednesday but will tell you more about the best view is five to ... times and of course we'll be keeping an eye on what's going on in the world of politics Fisher you join a beginning six am Kevin BBC weekday morning snakes they've had a little boys dom Boston\nU R K O ... O W arcane you'll be the Radio's on his friday November ninth\nPresented polo safety leaders and safety technology joined W. R. J. on our part to help veterans in partnership with disabled American veterans together we can stand up\nOn on the brave men and women who served tune in some ways you can donate sponsored by my pillow approachable or the da da da da da da to twenty three sixty on my pillow dot com code W. R. K. L.\nI'm John boots cohost Kelly financial senior save money strategies heard every\nSaturday morning from nine to noon right here W. R. K. you if you're planning for retirement and the bouncing stock market is making nervous while you're not alone rising interest rates uncertainty politics and Twenty one trillion dollar national debt would make anyone would commonsense nervous and that's why I'm inviting you to one of Kelly financial\nInformative dinner event where you'll meet the entire family a financial expert who will be in your corner to safeguard the nest egg for what you've worked so very hard on Thursday November\nFirst at the new ... and bring treats and on Saturday November twenty four at the Boston area in Burlington or the annual Thanksgiving and Christmas branch where you'll get to meet and talk with Red Sox great ... and ... so called eight eighty eight hundred one eight eight one\nMake your reservation today Kelly financial services brain surgery in Burlington eight eighty eight hundred one eight [noise]\nLast time in Boston the deplorable ... with our car was a sellout this year it's going to be even\nBigger I folks our car here if you love President Trump you don't want to miss our new ... Saturday November\nWith special guest Ryan Joe me from Fox News get your tickets now\nAt ... dot com Brian and I will tell you what really happened during the twenty sixth the presidential campaign and what's really happening now tickets include a copy of Brian's walk Andrew Jackson in America with New Orleans a copy of my book what really happened get your tickets\nNow and how we car show dot com sponsored by my pillow mix three sixty ... buyer element I'm perfect smiles this is the only Boston show and spaces limited so don't you miss or get your tickets today\nAnd bribe Jovi than I Will see you Saturday November dump it ... the ...\nDon't forget to catch that how we car show every weekday from three to seven on the voice of Boston W. R. kale how much I think about ... percent it\nBy liberty mutual insurance\nLiberty mutual customize your auto insurance so you only pay for what you need so why aren't more things in life customize\nWhy isn't a burger cheaper when you ask for no one\nSo shouldn't you to duck the price of the onion right otherwise I'm paying for the onions but I'm not receiving any\nGo to liberty mutual dot com for a customized group and you could save\nEnergy and very\nRigid underwritten by liberty mutual insurance company in equal housing ... this is a court ordered notice current and former Ford Lincoln and mercury owners or less the skin receive payments and other benefits from a legal settlement related to allegedly defective to comment airbags and their vehicles\nTo see if your vehicle is included and to file a claim to auto airbags settlement dot com or cold one eight eight eight seven three five five five nine six that's auto airbag settlement dot com or one eight eight eight seven three five five five nine six\nW Archie oh boy so Boston\nEvery day [noise]\nExclusive\nStories and unique perspective you are listening to American\nBorn in which the\nWeather will come into Tuesday October thirtieth sorting deal Jennifer ... some of our sob stories and headlines\nFifty two hundred troops being sent to the southern border to help with the migrant caravan the president visits a grieving Pittsburgh today\nPackage bombs suspected more than a hundred names are targets Apple's rumored to be rolling out its ... today patriots over the bills in Monday Night football meanwhile the NFL trade deadline is this afternoon and the cafeteria workers who writes encouraging messages to students that story in about twenty minutes\nComing to you today from the studios\nBill Murray business technology advisors\nNo there's nothing small about your business they provide one on one partnership and reliable bill PCs with intel core processors to get business during\nThe growing backlash against plastic waste has a new target paper coffee cups\nPaper cups for years were hailed as some more environmentally friendly option than plastics boom but paper cups or attracting new scrutiny because they contain a tightly bonded plastic whining that needs to be separated before the paper can be recycled it's a story by Wall Street journal reporter ... ... what's trending\nTake about April ... keep up on it and I actually burned conflict reining in ... ... ... you can comment\nMainly to keep working like a couple of ... your coffee or you're in it um and what we have\nA lot of people got putting up ... or ... just going to get every ... and American without attendant and we had heard what ended up happening at north ... actually went in to land because regular paper ... and\nThey're not actually have the technology to declining from ... until the ... budget out\nWow All right so in an ideal world are you supposed to be recycling your ... your paper cardboard what we think of a coffee cup into a plastic recycling bin\n... or send an idea of a cop that contain declining actually they could be recycled actually and so that's why the big problem if we hadn't had a little bit structure either in the U.S or in your ... to have that connection or coffee cup\nUm and they can collect the ethical or not going to be out there and then changed I called the big problem they seem to what you really want to do if you buy coffee at your local Starbucks um they do keep it and then bring it home from work you know drop it off\nBecause they actually do ahead and do you collect he's got to take ... many many other places um change station or a you're probably eight intensity that I really not special rooms or a coffee cup and actually we actually\nI have one yet the general just showed up a couple of weeks ago um and it leads to actually cook because\nI bought that how problematic or coffee cups by the way\nI mean and they're going to go to the floor\nOf the country will drive ... at all like to share that kind of it was just you know they're pushing for instance I shouldn't have done to the idea that this caller and then they end up voting and ... and converting it into kept playing life but I think\nThey may be less about the actual indictment intact compared to other products and more about the fact that coffee become such a widespread caught out\nThat I can do about it and much higher than it was before um but relativity markets in the country that I Do\nBut we're also drink more coffee than ever right that is on the rise\nExactly and they conduct their product\nAnd growing and I'm sure that would have been growing exponentially I'm\nExactly what you should have the number of coffee shop has gone up so much that the number takeaway coffee cups with have their credit and then twenty five years ago most people probably know some coffee at home drinking it at home and then going to work and now we have to compete on culture where people are drinking coffee and bottled water at all times\nMany times during the day and then you're talking about killing somebody or taking care of\n... we're speaking with Wall Street journal reporter ... she covers consumer goods in retail and we're talking about her piece titled the new target in the fight against plastic paper cops are so ... who else is taking steps here to try to address this\nFrom regulators to come to environmental group\nBut we don't give up their journey and kind of catch on a new ... ... from the European Parliament actually jak I can come\nOut and said okay we're going to approve a corridor to come down on a decrease in one of the things they mentioned that shouldn't be pick up that has passed a climbing and then\nThey get to that number could option outdoor um or maybe challenge for Africa will come on and then ...\nYou know we're getting dumber static charging the equivalent of having some\nPeople who are now taking coffee cup and even now had it on top of your coffee ... dot com and they're doing they're trying to ship intimate either in and get your coffee or just bring it on the top\n... Wall Street journal reporter sub or a child reads from London twenty minutes now in front of the hour on this morning Americas first news", "show_name": "This Morning With Gordon Deal", "year": "2018", "city": "Boston", "day": "30"}