[{"month": "10", "state": "NY", "station": "WAMC", "content": "This was Northeast Public radio WAMC FM\nHD Ninety point three Albany W are you an HD nine points reruns in Utica W. A. M. cage de nine point nine Kingston W. O. S. R. H. D. Ninety One set of Middletown till UCLA HD Ninety One nine Plattsburgh WC an HD Ninety three three kinda G Harry W. A. N. C. H. D. one oh three night talk on the road got W. A. M. U. H. D. one\nOh five one great Barrington W W E S H da da na na na ... W. A. N. D. H. D. Ninety point one Stanford W ANR eighty eight five rooster WAMC am fourteen hundred Albany\nDog rare continue to be with the victim's family and with the community and rest assured we have a team of prosecutors working hard to ensure the job done\nThe men accused of killing a eleven people into Pittsburgh synagogue appears in federal court days Monday October twenty ninth and this is all things considered\nI'm Mary Louise Kelly and I'm Ari Shapiro has this hour tracking the rise in anti Semitism in the U.S and overseas\nWe'll speak with a scholar of the Holocaust on lessons learned from history silence in the face of bigotry is acquiescence also Brazil's new president is a far right retired army captain known for divisive rhetoric and on the caravan of migrants from Central America we look at what Hondurans think\nAbout President Trump's threat to cut aid to the country cutting that age is likely to continue or increase in security continue or increase all of the kinds of things are driving people leave in the first place first this new\n\nLive from NPR News in Washington I'm Laurie London the suspect in Saturday's deadly shooting at the tree of life synagogue in Pittsburgh reined in federal court today NPR's Quil Lawrence reports Robert Bowers entered the courtroom in a wheelchair\nThe alleged mass murderer was handcuffed and still recovering from surgery for gunshot wounds which police say he stayed in a shootout with officers as he left the synagogue\nUs magistrate judge Robert Mitchell said the alleged shooter would be represented by a public defender Bowers told the judge Yes sir or when asked if he understood the charges against him they include eleven counts of murder with a firearm and federal hate crimes charges which could carry the death penalty\nFunerals are expected to begin Tuesday for the worshippers killed at the tree of life synagogue on Saturday they ranged in age from fifty four to Ninety seven years old for people including two police are still recovering from their wounds in the hospital Quil Lawrence NPR News Pittsburgh\nPresident Donald Trump and first lady millennia will travel to the Pennsylvania community tomorrow that has been shaken by that murderous rampage press secretary Sarah Huckabee Sanders says the trumps are hurting right along with the entire nation\nThe president is the grandfather uh several Jewish grandchildren and his daughter is a Jewish American and son in law's a descendent of Holocaust survivors tomorrow the president and first lady will travel to Pennsylvania to express the support of the American people in Greece Pittsburgh community\nEleven worshippers were killed and the massacre the suspect Robert Bowers is being held without bail after making his first court appearance in federal court today authorities say he expressed hatred towards Jews during the rampage and then later in comments to police an American citizen held by the U.S military\nExpressed hatred towards Jews during the rampage and then later in comments to police and American citizen held by the U.S military in Iraq for more than a year has been released as NPR's Ryan Lucas reports the man was being held at an enemy combatant\nThe U. S. citizen whose name has not been made public was released on Sunday that's according to Jonathan hey fits a lawyer with the American civil liberties union who was representing him\nHey if it says his client was let go and an unnamed third country as part of a settlement agreement much of which remains confidential the man was picked up in Syria and the fall of twenty Seventeen as they suspected member of the Islamic state the U.S military held him in a rock for more than a year but did not charge him\nMan challenged his detention in us courts his release brings it into the long run it legal battle which raised questions about the government's power to lock up a citizen without charge Ryan Lucas NPR News Washington\nStocks that race in early game today falling a report that the U.S all announced tariffs on all remaining imports from China by early December if the two countries can't resolve their trade just spent\nHalf the closing down the down down two hundred and forty four points this is NPR\nSupport for NPR comments from NPR stations other contributors include visit St Petersburg Clearwater along Florida's Gulf Coast offering artistic drugs including St Pete's Dali museum pitcher who collection and the museum of fine arts more at visit saint Pete Clearwater dot com\n[noise] throwing off nature seasonal calm [noise] I'm Randy Simon and this is there a place to look at our changing environments [noise] ecosystems throughout the Arctic are regulated by seasonal changes\nLeading to a finely tuned balance between the greening of vegetation and the reproduction of animals rapidly warming climate and the disappearing sea ice or up ending that balance\nResearchers in Greenland have been studying the calving of caribou for two decades\nAreas that used to have herds in the hundreds of animals back then now have dramatically smaller numbers as it got warmer and warmer and the growth season started earlier the plant growth triggered by temperature started earlier but the terrible breathing triggered by the length of day didn't\nAs a result plants pastor nutritional peak by the time the herds arrived to eat them\nThis has led to a declining population\nIn southwestern Greenland the growing season now starts on average nearly three weeks earlier than a decade ago some plans of advance their first spring growth by twenty six days or more which is half of the Arctic brief growing season\nThe landscape itself is changing as shrubs like gray willows normally dwarf or growing much larger than changing the very look of the tundra traditional landscape\nBeer springtime clock is advancing around the globe as the planet warms up the results in butterflies emerging earlier pollen season starting ahead of schedule and the intricate choreography of birds and be going out of sync but nowhere is the clock speeding up faster than in the Arctic\nThe onset of spring has moved up four days for every ten degrees of latitude north of the equator\nAnd the rate of change appears to be accelerating [noise] with climate change Dr ecosystems past the point of no return\nNobody knows [noise] for more information on this topic at other environmental news visit us that hurts wise radio dot org or find us on Facebook [noise] earth wise is a production of WAMC Northeast Public radio [noise]\nSupport for WAMC comes from New York oncology hematology offered in clinical trials for various stages of breast cancer New York oncology hematology dot com\nFrom NPR News this is all things considered I'm Mary Louise Kelly and I'm Ari\nNew York oncology hematology dot com\nFrom NPR News this is all things considered I'm Mary Louise Kelly and I'm Ari Shapiro the man accused of killing eleven worshipers and wounding six others in a synagogue Saturday appeared in federal court today\nRobert Bowers has been charged with twenty nine federal crimes and could face the death penalty NPR's Brian Mann was in the courtroom in Pittsburgh and joins us now Hi Brian\nIRA a describe what the scene was like an extra day\n[noise] incredibly tight security about ours was wheeled in in a wheelchair really surrounded by federal marshals he was injured of course in a gunfight with police Saturday before he surrendered so we came in to the court wearing a blue sweatshirt he's kind of a beefy guy he had handcuffs on and just sort of a blank expression\nAnd I know the judge read a summary of those twenty nine charges against him then what happened after that\nIt was over pretty quick a vow or the answered yes or a couple of times of the judge's questions he was then assigned a public defender and he'll be back in court on Thursday the federal prosecutor who's handling this case the U.S attorneys got Brady spoke after today's session and said he's confident they have a strong case against\nPowers at that time we will have the opportunity to present evidence demonstrating that Robert powers murdered eleven people for exercising their religious beliefs\nAnd rest assured we have a team of prosecutors working hard to ensure that justice is done\nOkay that's Scott braided a federal prosecutor at the quarter parents today and Brian I Know you've also been looking into who Bowers is that you were at his neighborhood talking with people who knew him what have you learned\nYeah it's kind of a mix of industrial shops plumbers and electricians and then these low rent apartments and I talked to a lot of people who live right next door or also who ran gun stores nearby\nAnd actually all of them say they have no memory of every meeting Bowers are seeing him forty six years old this guy is and left very little trail that we can find except for these anti Semitic hate filled ramps on line\nI Will say though that the police say his motives aren't mysterious and the criminal complaint filed against them they say he told officers point blank a these are his words that Jews are committing genocide to my people and uh he told them that a Jewish people need to die\nThe attorney general also talked about this attack today Jeff Sessions was at a meeting of the federalist society which is a conservative legal group what did he say this meeting in Boston\nSessions described this as a murderous rampage and he says it's an attack on American values\nThis will not just that an attack on the Jewish faith it wasn't an attack on all people of faith it wasn't an attack on America's values are protecting those a face it cannot and will not be tolerated as a direct threat [noise]\nThe weather forecast fueling ring showers into this evening the partly cloudy overnight overnight blows in the forties to me were fifty degrees\nTomorrow it makes them suddenly clouds highest in the upper forties and into the mid fifties mix of some of the clouds again on Wednesday still a chance of scattered showers late in the day on Wednesday eyes will be near sixty degrees\nCloudy on Thursdays from showers rained more likely on friday\nSupport for WAMC comes from Sienna college lab and bill hosting an open house on Saturday in November the temp sharing information I knew degrees and data science communications nursing at a new NBA option for undergrads Sienna dot edu slash open house\nMVP healthcare committed to making health insurance supportive convenient and personal information available MVP healthcare dot com twenty minutes after four o'clock\n\nSupport for NPR comes from the station and from love me in makers of go to a meeting a collaboration meeting platform allowing people to connect around the globe to get work done learn more is go to meeting dot com\nFrom Harvard Business school executive education for executives at any career stage to prepare for new challenges through one of its comprehensive leadership programs learn more at H. B. S. dot any slash executive\nAnd from the John D and capturing the MacArthur Foundation at max found dot org\nFrom NPR News this is all things considered I'm Ari Shapiro and I'm Mary Louise Kelly to Brazil now which yesterday elected a new president who it's from the far right messages of congratulations from World leaders are pouring into ... including one for President Trump\nThere are concerns about what folks in our own we may do once he assumes office NPR's Philip Reeves reports from Rio de Janeiro\n[noise] and his supporters celebrated stunning victory giant ... appears before the cameras I understand was a normal\n... led by his Angeles pasta and then for a promise it's intended to lay the ... of his opponents in Brazil and his critics abroad buffet USA\nLed by an evangelist pasta and then for a promise it's intended to lay the fears of his opponents in Brazil\nAnd his critics abroad profit you say where did you have to go to the\nHuman eye witness both so now to tell the audience my government will defend the constitution and democracy and liberty to NATO a retired army captain and congressman will take over as Brazil's president on the first of January his admiration for his nations pops military dictatorship has led\nTo concerns over whether democracy is safe in his hands also now to support his celebrating outside his speech side house in Rio have no such worries cloudy and Miranda is a lawyer oh I'm\nI'm not afraid of out that\nWay that that sometimes they have the right for the U.S but I don't think that they said they tape her\nBut enda hubs Bolsa NATO will end the massive corruption fits in broiled many Brazilian politicians his record from the ocean is racist and homophobic remarks doesn't bother her she thinks that taken out of context\nAnd that there is a different meaning so I don't know I'm not afraid of all that\nOther Brazilians are worrying on many fronts will both so now those plans to loosen the environmental laws threaten the Amazon rain forest all their civil rights secure this is a senior Rios launches for low income mostly Afro Brazilian neighborhood scrolls across the hillside\nIt's a battleground in the wall between security forces and criminal organizations in the narcotics trade residents caught in the middle sometimes injured or killed both NATO wants to get the police even more leeway to use lethal force to the alarm of Luis Fernando ... who was born here\nI think they will be terrible terrible so it's not good for people that live here\nOpinions among political analysts are divided about what the future holds\nFor doing the country that has a much stronger than many people in a specially for fried okra\nDjango Jetta gown political on this consultant doesn't think both of them out as a threat to democracy he says Brazil's judiciary has proved how strong it is by convicting some of the country's most powerful people in a massive anti corruption investigation\nBoth NATO has strong support in Brazil's new Congress ... still negotiate to get plans approved he also has close ties to the military his cabinet is expected to include several retired generals chatter gowns also not worried about that\nI have ... no doubt that or is it an armed forces bowling shoes on ... ... ... ... ... ... even if it's great it is also not a\nPolitical scientist ... cent auto also doesn't think Brazil's at risk of a dictatorship but he is concerned about the rights of Brazilians\nEvery country where ... or face it then it opens your of democracy safety problems regarding minority right hate crime violence against social activists\nThat don't seem to be one area of consensus among those puzzling about what President Bush to NATO will be like if he's to unite to Brazil he must knock off the divisive political rhetoric ... again\nThese marriage is Kent in our in the future of the country to believe that they have a green light to act and then a question for violent manner against minority\nReeves NPR News Rio de Janeiro now to the city of San Pedro Sula Honduras that's where the caravan of thousands of migrants heading to the U.S border began most of the migrants say they're fleeing violence and poverty and as NPR's Carrie Kahn reports many people still in Honduras are closely following the care of\nPorter began most of the migrants say they're fleeing violence and poverty and as NPR's Carrie Kahn reports many people still in Honduras are closely following the caravan strict\nRadio and TV news are glued to the migrants journey next in line to get on the ... because you've got to those legal supporting them not to reporting\nEvery stop and start as the thousands continue their march north to the U.S border it's a massive exodus says is male Marino a Jesuit priest in the north western town of progress so he says the flight of thousands out of Honduras shouldn't be a shock to any one\nLives and the ... to go to the moon we're nowhere near the presumed to\nThis caravan phenomena is like a pressure cooker that exploded says Moreno who's better known as Padre mellow on his nightly radio program\nOn medical leave within\nLittle and my father I mellowed says people are frustrated because those are the ones who presumes\nThat frustration as been accumulating for years people have no opportunities no jobs but they have plenty of crime and violence he says\nThe woman [noise] the more you could use them when you're looking\nAt some point the pot had to boil over we're at that moment right now he says Miriam Calderon was waiting outside the radio station has a son currently with\nThe caravan in southern Mexico\nShe breaks down while talking about why her Eighteen year old son Anderson last as long as they're not part of it yeah look I Am a little mother she says back in June gang members took a liking to his girlfriend and threatened to kill him\nHe wanted to flee then but I wouldn't let him go she says Emily my my my son was I was in a new but when he couldn't find any steady work and word of the caravan spread\nHe insisted on leaving she says and he wanted to help us out with sending money home\nMoney sent from Hondurans abroad accounts for as much as a fifth of the economic output for the country Latin America's poorest after Haiti\nPresident Trump said he will stop the caravan from entering the U.S and sent five thousand troops to the southern border\nHe's also threatened to end all foreign aid to the region some in Honduras thing cutting off us aid wouldn't be such a bad idea then you'll Pacheco is an evangelical pastor who lives and works in one of the most violent neighborhoods in the northern industrial city San Pedro Sula\nSony have gotten a lot of them are going to them when you want but I don't know if Iran wants to\nHe says the problem is citizens just don't know how much the U.S gives to Honduras where exactly the money goes and he adds it rarely trickles down directly to them corruption especially within ... national police force is notorious\nIt is not very transparent but it's not clear to me a good word handy significant amounts of cash to go with hookers\nJeff Faile is with Walla Washington DC based think tank focusing on Latin America according to its analysis last year Honduras received nearly two hundred million dollars in aid from the U.S about a third of those funds now go to security justice and violence prevention\nCutting that he is likely to continue or increase in security continue or increase all the kinds of things to driving people leave in the first place so it just doesn't make any sense\nIf it were up to ... mellow of radio progress so he says the U.S should pull all of it said\nWhy don't you know ... ... ... the little Missouri River with\nWithout the money we Hondurans who rely too much on the U.S anyway would be forced to solve our own problems Carrie Kahn NPR News San Pedro Sula Honduras\n[noise] and [noise] and [noise]\n[noise] Mm [noise] [noise] [noise] [noise]\n[noise]\nThis is NPR News\nThe dark reality that I don't know it ... in America that hasn't had to kind of a waking nightmare at something like that would be possible\nWhat else are you still hoping to learn about him and his motives\nI mean we would certainly like to know more about how did he\nBecome as hateful as he did and how long has that been going on and what role did intimate playing [noise]\nDid the current sort of political anger and conflict playing uh so I Know that investigators are going to be going through his computer files are going to be going through his home they're going to be talking to folks who know him who might have worked with in family members friends\nThat kind of thing that really took away to the New York times who's been reporting on the background of Robert Bauer of the accused synagogue shooter thank you very much thank you for that\nBut Julie ... of the New York times who's been reporting on the background of Robert Bauer of the accused synagogue shooter thank you very much\nThank you President Trump will travel to Pittsburgh tomorrow at today's White House briefing press secretary Sarah Sanders condemned anti Semitism and said the hatred stop\nCritics of the president said his campaign rhetoric is raising tensions and widening divisions even as the country is still reeling from the Pittsburgh attack and from the arrest of a Trump supporter believed to have sent pipe bomb to Democrats and critics of the president\nAnd here's I used to rock go is at the White House and she joins us now to talk through all those hey there hello so the White House and of course aware of criticism of the president's words how are they responding\nNot surprisingly White House press secretary Sarah Sanders is defending the president she says he is working to unite the country and that he is showing leadership uh here's some more of what she had to say at the briefing today\nI think the president has a had a number of moments of bringing the country together once again I'll remind you that the very first thing the president did would condemned the attack on the very first thing the media did was blamed the president\nAnd she's really going on the offensive here she's saying that Ninety percent of the news coverage of the president is negative or even though the country's doing well and that the media beers responsibility for the divisions in the country\nAnd she's she's basically arguing that the president is going to defend himself he's going to highlight these differences between him and his opponents are and and against the media\nUh and she's a doubling the White House really doubling down on his rhetoric even after a these improvised explosives were sent to CNN last week out what a Sanders is saying is that the president can't be held responsible for the actions of another person who doesn't know personally\nI the thing is are you sure whether you like the president's language or whether you have the president's language he has been consistent with who he is so is there something different about the way it's resonating this time\nIt really seems to be about the timing you you have these kind of back to back\nEvents happening right before a critical election Trump is not known for being able to play the role of the console or in chief or certainly not the night or in chief\nUh that's not a natural fit for him I'm and basically what he has done is a when something's happened he says something directly after the ... the tragedy uh that is expected um but after his call for unity on Saturday after the synagogue shooting he held a campaign\nEvent where he went back and making personal attacks the called out Elizabeth Warren using this belittling nickname for her\nJob [noise] I guess she doesn't have any ideas what she does and I have none\nAnd since that rally on Twitter he's once again denouncing the price of the enemy of the people and calling out the Democrat running for governor in Florida Andrew Gillum calling him with the without evidence\nIn many ways like you said this is what his support is likely expect from him but what his critics will argue is that going out to people so personally and and not just saying they're bad on taxes or something like that is that it's inflammatory and that there are consequences to that\nWell you mentioned the mid term what might the consequences beyond the midterm what difference might the president's rhetoric Mac\n... it's very hard to tell A People's view the Trump are it seems to be pretty hard and at this point so\nYou really don't know whether this is going to change any votes or the risk of course is that maybe some lukewarm vote supporters of Trump could be turned off by the negativity or that his opponents could get really fired up but we'll just have to see what happens next week\nThat's NPR White House reporter Ayesha Rascoe reporting from the White House thanks Asia thank you\n\nHouse reporter Ayesha Rascoe reporting from the White House thinks Asia thank you\n...\nYou're listening to all things considered from NPR News\nFor years ago Virginia seventh congressional district was the site of a major political upset\nA little known economics professor Dave Brat defeated Republican House majority leader Eric Cantor and the GOP primary now Brad is on the defensive in a district that includes suburbs crucial to Republicans but trending towards Democrats NPR's Jessica Taylor reports from outside Richmond, Virginia\nDemocratic activists who vote random laughs when she thinks about President Trump comparing her to a mob\nIt really is kind of whole area Seventy five years old and so the last thing I could be the mob but Brennan's\nGather with the liberal women at Chesterfield county passing out literature for Democrat Abigail Spanberger at a community festival the retired grandmother whispered into politics by Trump's victory and joined the L WC the brand upset their group reached out to ... last year but they were rebuffed\nRather than talking to him about it he just started to call us\nCrazy people and uh we're up in his frail when we're chasing him\nStretches of diversifying suburb of Richmond that could determine the race wants to bashing of conservatism it's one for Democrat Ralph Northam in last year's governor's race earlier that morning spanberger was marching in the rain Glen Ellyn days parade she's in ... another suburban county that is rapidly change [noise]\nSpanberger\nThat she felt that shift sent the twenty sixteen election\nI think it's actually just a shift of people wanting to end up for what is\nAppropriate what is it will discourse really a functioning government and in our particular district we do have an incumbent who\nThe party member and more of an obstructionist in terms of uh his engagement as a representative\nDavid south all at one time brat volunteer and former member of the Chesterfield Republican committee agrees that was formed\nWon't be pulled against south holds as Brad has been ineffective as a member of the conservative House Freedom caucus he says there's a lot of other people in the suburban county who feel like he does about brat\nThe Republican incumbent is expected to do well in the seven vast rural areas but court ordered redistricting in twenty sixteen made the district more suburban\nThis community was staunch Republican for\nMe I think Louis on the subject was Democrat was seventies sixties seventies\nYou know this change will all around here is going to change\nAs spanberger is back at the parade she's shaking hands along the route that many people already know who she is from the millions of dollars both parties are spending on ads\nCould be without knowing that\nThat's where it's melted he tells me afterwards he sold him for Brett he likes it stances on social issues and fiscal policy\nEverything that stands for what I what I Believe\n... campaign did not participate in this story but an added method sounds consistent with the Tea Party roots opposition to the Affordable CARE Act and pushing lower taxes\nAnd we cut taxes we got government out of the way of your small businesses now thousand\nAffordable Care act and pushing lower taxes\nAnd we got we got government and the way of your small businesses now thousands of Virginians are back to work and we put more money\nBut not everybody seemed completely receptive to that message John ... is an undecided voter but says he's leaning toward spanberger\nSound okay but ah [noise] kind of feel like it's going away or a cancer did kind of maybe losing touch a little bit\nVirginia is one of the earliest states to close on election night and day ... could be a clue to which way things are going next Tuesday\nJackie Taylor NPR News\nThis is all things considered from NPR News\n\nAnd I'm All right\nThat's David Wilcox directs\nHurricane and join us for an evening with American Folk singer songwriter David Wilcox with special guests lonesome bell and the lonesome unity on Saturday November Seventeen sneeze at eight PM apple into WAMC is performing arts studio next\nUh for tickets and information\nVisit the Linda dot org\nSupport for WAMC comes from Rick ... certified financial planner accredited investment ... sharing the Berkshires securities through commonwealth financial network\nMember of the NRA civic ... financial dot com harbor a bind windows doors in hardware family owned since Nineteen fifty five ... drink classic and contemporary products designed and installation windows and doors by Marvin and integrity bronze hardware by Rocky Mountain made in America harbor dot com\nW. A. M. U. H. D. one oh five one great Barrington W. W. E. S. H. D. eighty point nine mount Kisco W. N. D. H. D. in any point one Stanford W and our eighty eight point by Brewster WAMC am\nFourteen hundred Albany support for WAMC comes from Dr Lucy ... from New York a plastic surgeon dedicated to studying cosmetic surgery cool sculpting treatment laser ... since Nineteen Ninety six C. A. P. E. K. plastic surgery dumped\nThe turning stoned resort operating combinations dining spa treatments golf courses and variety of live entertainment turning stone dot com you're listening to all things considered a WAMC Northeast Public radio it's five o'clock\n[noise]\nThis was just an anti Semitic acts but it was also\nAn act against refugees and against immigrant immigration advocates say the Pittsburgh synagogues shooting was about more than hatred if you need is Monday October twenty ninth and this is all things considered from NPR News\nI'm Ari Shapiro and I'm Mary Louise Kelly this hour the latest from Pittsburgh and it's a man accused of Saturday's attack appears in court also will meet the Republican congressmen and Florida trying to distance himself from President Trump and his Democratic leaning district I don't remember ever apologizing for anything\nI've said whatever I've set is what I Believe so why would I watch it back and in time for Halloween a history of the unsettling pair of notes called the devils internal here\nWe have a real world [noise] [noise]\nNow these headlines\nLive from NPR News in Washington I'm jak sphere\nThe man accused of shooting eleven people at a synagogue in Pittsburgh over the weekend and wounding half a dozen others made his first court appearance today even the federal prosecutors are vowing to seek the death penalty in the case\nForty six year old Robert Bowers appeared in a wheelchair and accepted the court appointed defender Scott ... the U.S attorney for the western district of Pittsburgh and describes what's next in the case\nOur investigation of these hate crimes continues under the law we must present this case to a federal grand jury within thirty days of today for\nOur thoughts and prayers continue to be with the victim's family is and with the community and rest assured we have a team of prosecutors working hard to ensure that justice is done\nPresident Donald Trump travels to Pittsburgh tomorrow to share his support however some leaders of Jewish groups there in an open letter said Trump is not welcome until he denounces white nationalism Pittsburgh Police say the synagogue shooting suspect expressed hatred towards Jews\nGroups there in an open letter said Trump is not welcome until he denounces white nationalism\nPittsburgh Police say the synagogue shooting suspect expressed hatred towards Jews during the deadly rampage and in later remarks to police that NPR's Eric Westervelt reports from human rights groups now calling on politicians this election season to rethink their hyper partisan rhetoric\nThe Anti Defamation league says twenty Seventeen saw an historic sixty percent rise in anti Semitic incidents of reaching a deal report shows that online anti Semitism continues to grow during this year's midterm election season since the group's George saline\nWhen anti Semitic rhetoric or dog whistling is really allowed in our public square without condemnation it really gives the green light to anti Semite big ... and Islam of foods to keep spouting it an acting on it the reality is that words have consequences\nThe ACL and other groups are now calling on politicians to redouble our efforts to tone down hyper partisan an ad hominem attacks they say is only inflaming national fear and division Eric Westervelt NPR News\nFormer President Jimmy Carter is speaking out about the hotly contested governor's race in his home state from member station WBUR a bee in Atlanta Johnny Kauffman has more in a letter the former president urges gubernatorial candidate Brian Kemp to pass responsibility for these midterms to a neutral authority\nCarter says popular confidence in Georgia's elections is threatened because of the history of racial discrimination in the state and questions about the security of Georgia's electronic voting machines Democrats in civil rights groups have accused secretary of state Brian Kemp of suppressing the vote for political gain\nKemp campaign called Carter's letter a publicity stunt and says his opponent in the Georgia governor's race Democrat Stacey Abrams is using the former president to do her quote dirty work\nFor NPR News I'm Johnny Kauffman in Atlanta\nStocks after posting a triple digit run up at least for blue trips gave it all back in some heading toward the clothes all three of the major stock market indices turning talent retreating without dropped two hundred and forty five points to the NASDAQ was down a hundred and sixteen points this is NPR\nSupport for NPR comes from Fidel investments taking a personalized approach to helping clients grow preserve and manage their wealth learn more at fidelity dot com slash wealth finality brokered services allows the and Americans for the arts and Americans for the arts dot org\nThis is WAMC regional News I'm Brian ... New York US Senator Charles Schumer says Americans most fight the rise of anti Semitism the Democrat in the Senate minority leader commented on Saturday is deadly shooting at a Pittsburgh synagogue during a stop in Albany today\nAnti Semitism is on the rise [noise] um I Believe we have to do everything we can to combat it in every way whether it comes from the extremes or it comes from anywhere else um [noise]\nThe response of Americans should the first to condemn this to urge the government to do everything it can to stop it and for us to come together\nLeaders of the public university system in Massachusetts are pledging to continue their policy of allowing transgender students faculty staff members and gas to use restrooms in locker rooms consistent with their gender identity identity even at the voters of Massachusetts repeal it twenty sixteen transgender rights law\nYou know as president Marty Meehan and the chancellor of the five UMass campuses that set it in a statement today that they plan to keep the university systems existing policy regardless of the outcome of the election a no vote unquestioned three would repeal the law\nThat Vermont Air National guard says twenty and thirty five jets are coming to the Burlington international airport next year despite opposition from look\nThe law Deborah monitor National Guards who's twenty and thirty five jets are coming to the Burlington international airport next year despite opposition from local leaders and some residents the jets will begin arriving in September of next year they will replace a fleet of older F. sixteens\nBut what the forecast a few showers this evening drying up late tonight partly cloudy in the thirties I mix it suddenly clouds tomorrow low fifties or make soups on the grounds when they used to think showers upper fifty [noise]\nWest in Vermont cloudy forty four Williamstown, Massachusetts at forty seven beacon New York fifty four Albany fifty one\nSupport for WAMC comes from all walks of antiques there were token springs and colon in New York jewelry diamond buyer purchasing silver coin collections Asian antiques fine art and the states or gloss dot com more WAMC news at five thirty [noise]\nFrom NPR News this is all things considered I'm Mary Louise Kelly and I'm Ari Shapiro Pittsburgh is in mourning after the attack Saturday on the tree of life synagogue eleven worshipers were killed six other people including police officers were injured\nToday the victims bodies were released to family and the suspect made his first appearance in federal court in a wheelchair and have cops to give us a sense of what the city of Pittsburgh is going through today we're joined now by Margaret J cross of member station W E s a Hi there\nHi what have you heard from people you talk to you today\nI spoke with Richard Becker are just now and he said there's no way he couldn't come out and show his support we're not Jewish\nOur community may feel very thoroughly about supporting [noise]\nPart of that community where it organic cool\nWe don't lose any part of the\nBody of which were apart\nYou say you spoke to him just now you're you're at a vigil I understand it's about to start\n[noise] yeah it's one of the few that's been organized last couple of days I'm at Carnegie Mellon university it sits on the border of squirrel hill which is where the attack took place in Oakland and officials say the organized vigil to help the community mourn\nAnd one of the people that was killed in Saturday's attack was Joyce Feinberg she worked down the street at the University of Pittsburgh for a long time and her husband taught here at the end you for a long time\nPresident Trump is planning to visit tomorrow with the first lady um what if people you've been talking to set about that what are they want to hear from him\nWell one person I spoke with his nearest Patel she's a senior at Carnegie Mellon she heard about the president plans and she's into mind about it\nI mean he is our leaders that we do have to respect that that also sometimes you feel that if they really coming here for the right for\nThat is similar to what my colleagues and I've been hearing from a number of people in the past few days that President Trump is our president and that he is the griever and cheese but also that rhetoric has been so give is is that they're not quite sure what they would hear and what they would hope to hear [noise]\nTake a step back I Know you've been covering the story pretty much nonstop for the last two days how does the city feel to you right now where are people in Pittsburgh in the grieving process\nI think that's just the gun and they said he feels like it's being more gentle to itself I Would say we're a small city in squirrel hill and the Jewish community form a central part of it so people that we've talked to feel horrified and hearts sick\nVarious coined one Ninety nine well frozen Nineteen thirty Albany New York accredited new ms ... just buying and selling we're coins paper money tokens and precious metals stayed in vintage jewelry now on display Ferris coin dot com\nSunni Newport's three D printing a new policy views as art and engineering as an approach to challenges in medicine industry and design new points dot edu slashed reading\nThe weather forecast a partial clearing tonight when I when when the thirties a mix of some in clubs tomorrow low fifties on Tuesday Wednesday a mix of San ... showers possible upper fifties cloudy Thursday showers near sixty rain likely friday twenty minutes after five o'clock [noise]\n\nSupport for NPR comes from this station and from indeed used by over three million businesses for hiring where employers can post jobs and youth screener questions to build their shortlist of preferred candidates learn more and indeed dot com slash higher\nFrom lugging in makers of go to meeting the collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more is go to meeting dot com\nStreaming support for WAMC come from Berkeley Center for weight loss surgery with a focus on life skills and support for a long term success with we've ... in gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nAnd I'm Mary Louise Kelly the defense department in sending fifty two hundred active duty troops to the U.S Mexico border\nAs well as an order from President Trump last week when he said the group of migrants from Central America moving toward that border poses a national security threat here's air force general tyrants ... see who's in charge of northern command\nWe know border security as national security and the U.S military will advance DVDs capability to harden the border\nNPR's Tom Bowman is at the Pentagon and he joins me now Hey Tom hey Mary Louise says something like two thousand National Guard troops deployed to the border right is it fifty two hundred active duty on top of those exist in two thousand\n[noise] uh just goes beyond the two thousand and those guard troops are providing support duty such as transportation aerial surveillance that kind of thing\nAnd the guard is not taking part in any law enforcement activities and these additional five thousand or so active duty army troops will also be in a support role get no law enforcement activity no interacting with migrants we're told\nBut this new group of soldiers will provide more support to border patrol of first still do do what's called hardening border entry points in California Arizona and Texas creating more car bear a barrier is more razor wire fencing a crossing points\nAnd they'll also transport border agencies to more remote locations by cargo aircraft and helicopter there's also a surge by the way of hundreds of additional border agents so\nThese soldiers were also built camps provide housing medical assistance camp kitchens for these additional border agents as well\nAnd I presume this is all legal there's a law called pasta come attaches which prohibits military forces from acting as law enforcement inside the borders of the U.S this is this is all legit\nIt well ... that's what the officials say they made clear these troops will not take part in any law enforcement duties ah there were only in a support role again and the plus he's come a time this law dates for the post civil war era in the Eighteen seventies and that was a reaction\nTo federal troops being used and former Confederate States in that law prohibits military from engaging in any law enforcement activities so officials say they're well aware of the restrictions on these troops\n[noise] um you mentioned that these troops are not going to have contact with migrants will they be armed\nWell some of them will be armed do they say those who would normally carry arms will continue to carry arms they didn't specify exactly who but clearly military police would be carrying arms uh as far as which others would be carrying arms or of any others uh we just don't know at this point they didn't specify\nOkay precedent for this time for sending five thousand active duty trips to the U.S Mexico border [noise] uh I don't recall\nThe president for sending active duty troops have been some sit in the past and again in a support role\nIn this case uh you know it's pretty large number it's called operation faithful patriot these troops who is doing everything again from constructing camps flying border patrol agents Soviet engineers planners military police pilots medical personnel cooks\nEven lawyers in public affairs staff and uh again general are shown as he was asked well wait a minute why is this being done you're talking about the same number of troops now in Iraq and right and maybe not as many as in Syria and\nWhy is this being done you're talking about the ... the same number of troops now in Iraq right maybe not as many as in Syria and he basically brushed that all aside and again he should of border security is national security [noise]\nAll right That's NPR's Tom Bowman getting up to speed on the latest developments Pentagon thank you Tom\nYou're welcome in their quest to win back the house of representatives Democrats are focused on twenty five house seats currently held by Republicans in districts that Hillary Clinton won in two thousand sixteen\nFlorida Republican Carlos Curbelo is in one of those districts and fused betting that his independent reputation will attract Democrats and Republicans alike NPR's Kelsey Snell reports\nCarlos Curbelo isn't shy about confrontation here is this summer bashing everybody fellow Republicans who backed President Trump's hard line on immigration and Democrats who wouldn't cut a deal with Trump to protect people who were brought to the country illegally as children\nThey prefer the politics the petty politics of immigration inside of the solutions for immigration\nThat took her belly was spent most of the past two years he publicly opposed Trump and Republican leaders on major issues like immigration climate change in trade but he also largely voted to back the president's agenda when it comes to health care and tax is\nNow he's running for reelection in a district that Hillary Clinton won by sixteen points and he's running a campaign focused heavily on his reputation for bucking his party\nDon't remote remember ever apologizing for anything\nI've said whatever I've said is what I Believe so why would I watch it by\nThat same approach helped him winning twenty sixteen but Democrats like Maria Alina Lopez who helps run the party chapter in Miami Dade see that independent\nImages and so he also taught that he's a moderate but when you see his voting record that it's completely not the case and unfortunately most voters do not do that at the stats and they just hear him and they say wow you know he sounds good this year his opponent\nDemocrat Demi Moore car so Powell is trying to change that you know they need information we need to provide information and access and make voting in the cardinals Powell is an energetic for educator mom\nAnd an immigrant from Ecuador she's running on protecting immigrants health care and the environment all things that occur Bello says he also wants to protect their locked in a battle to convince voters who's telling the truth\nI should be I had basic things lines if it's a straight democratic district but it's not it's complicated\nConvincing voters who's right is a unique challenge in a diverse district that stretches from the suburbs of Miami south through farm fields and onto the tourist hub of Key West about Seventy percent of the population is Hispanic roughly half are Cuban descent\nCurb below the son of Cuban exile gets a warm welcome from a lot of voters here he slips seamlessly between Spanish and English when he's talking to constituents and the pairs boundary pushing politics with personal attention\nTake a recent event worker Bello and Senator Marco Rubio we're pushing back on Trump's new trade agreement with Mexico and Canada\nAll hardly mentioning Trump finance we walked her how strong a trade relationships with our allies bought we believe that this should be fair\nThey focus on the new bills help eerie of fruit and vegetable growers who were largely left out of the new trade agreement people like Republican tomato grower turned carpenter said that personal connection is important\nI mean it's hard not to like the guy like that I mean when it comes to listen and tries to\nDo something about the problem that affects the state and his area and\nAnd um that's all you can I ask\nRelationships like that or the benefit of incumbency most challengers have to convince voters that they'll follow through on their promises but McCarthy how will also\nSupport for streaming on WAMC comes from the Davis financial group providing fee based financial planning and wealth management services to individuals families and business owners and the pioneer valley and beyond Davis financial G. R. P. dot com [noise]\nIf we get our people to come out and vote I\nIt's going to be a close trade for me my focus my campaign spoken to making sure they know who I Am I message but also getting them out to to voting type the last few days of the campaign\nWill come down to who's message voters beliefs and it might ... case that Trump himself is coming to Florida this week but not to campaign for her bell that may be just about any Kelsey Snell NPR News Miami [noise]\n\nThis is NPR News\n... is vice president of residential supports with achiever and she joins me now via Skype to remember the Rosenthal brothers a crucial welcome and um and my condolences on your last I'm so sorry\nThank you very much we appreciate that\nDescribe she so and David for me what were they like\nDavid and see a so we're larger than life they were two of them most kind and generous people they were selling climbed into the fabric of their community\nThey loved to rock all through squirrel hell they would stop and talk to everyone and anyone\nAnd I read that she had an official rule he was a greeter at the synagogue\nYes stay still was not only a greeter at the synagogue but I Would refer to him as the ambassador to squirrel hell he was always hello how are you David Was a very reserved person\nBut as soon as you said hello today that he just opened up they were so close to their family David would call his mother every single day when he got home from work\nThey got up with a positive attitude\nHow's your family how were you do and what your day look like for today blessings for you today and they threw parties for everything in fact one time they had their bathrooms remodeled in their home and they wanted to throw a party for remodeling the bathroom [laughter]\nTrying to imagine that one\nAnd and and then\nThere was um a next door neighbor where they had their house remodeled and they were going to put it on the market and they went to the open house because they wanted to be a part of that you know\nWhat kind of work to do do you describe them coming home from work\nDavid Was working for goodwill and cleaning and these are words about to start a job two days a week and a family owned business\nHas it taken a toll on your staff who worked with him and helped him for for all these years\nYes to run them at such an early\nAge excuse me and they are such a vital part of their family our family so it is extremely difficult now\nI'm so sorry part of what also must be difficult is letting all your other ... other people who rely on achiever no how are you talking them through this\n[noise] myself and another staff member went out yesterday to me with housemates and people who knew them to offer them and\nExplanation as best we can about the events of Saturday and to offer any support we are also going to offer people kind of a service where people can come and share their memories and their feelings\nThrough your planning some kind of gathering within your organization to honor and remember them absolutely and it sounds like these are two brothers who like to party who would have appreciated that gesture and been right there in the mix\nThink that is exactly correct I think that on Saturdays you could have counted than to be where they were\nI think that is exactly correct I think that our Saturday ship credit counted down ... where\nThey were that's why I concur farm the best way that we can remember that in order for that ... their life wow ... ... square heroin or ... that were well respected going or carrots or their family\nOf ... will fall Cass Tech are\n... that could Africa\n[noise] That's Chris show with achieve out talking about David in Cecil Rosenthal the brothers were killed Saturday and say attended surface it at the tree of life synagogue in Pittsburgh pushups thank you ...\n[noise]\n[noise]\nUm\n[noise]\nYou're listening to all things considered from NPR News\nBy most accounts Federal Reserve policymakers have been very successful in recent years the evidence low inflation and extremely low unemployment\nBut the fed success has also undermine one of the basic theories that has relied on to understand the economy and how inflation and unemployment are related it's called the Phillips curve NPR's John Ydstie explains\nFor many years the Phillips curve accurately predicted that when the unemployment rate was low inflation heat it up but these days jobs are very plentiful yet inflation remains very low that's got some people writing the obituary for the Philips gr\nIf you put it in a murder mystery framework who killed the Philips curve it was the fed the kill themselves\nSome Federal Reserve Schumer from James Bullard president of the St Louis Federal Reserve bank who we spoke to about a week ago and what was the murder weapon well Bullard says it was the feds long persistent focus on keeping inflation low and stable\nThe fed has been much more mindful about targeting inflation in the last Twenty years\nAnd because of that we have lower inflation more stable inflation and so there isn't much of a relationship anymore between labor market performance and inflation\nSo Bullard says the Philips curve isn't working\nBut rumors of its death maybe exaggerated it's certainly still invoked during the debates within the fed about whether to raise interest rates some policymakers argue that with unemployment so low right now the fed should be raising interest rates are much more rapidly to head off inflation\nFederal Reserve chairman Jerome Powell is taking a gradual approach here he is earlier this month in an interview on the PBS NewsHour\nSetting for pale the fellas\nI wouldn't say that it might be resting [noise]\nA little more central bank humor this time and a pair of reference to a classic Monty Python sketch a man walks into a pet shop with what appears to be a dead parity in a cage\nTo complain about such off it out to do for the phone from the city was thrilled with this was really [noise]\nWhen I was looking at what\nThis will throw [noise] [laughter]\nWhen I when I was\nThe Phillips curve could just be resting but with the help of his sleeping pill in the form of slow wage growth says former fed economist and on\nThe traditional way in which low rates of unemployment lead to inflation is by increasing wages\nAnd wage growth in the U.S has been sluggish which is part of the reason inflation is staying low\nWhether the Philips curve is dead or just resting its long slumber has been useful for the fed says on who's now a professor at Hamilton College\nThe U.S economy has extended period of stable inflation and falling unemployment has allowed the fed to raise interest rates gradually and to pause after every rate hike to see how the economy response owing thinks fed officials are fine with that situation\nIf you ask the fed do you want low and stable inflation or do you want really rapid inflation because that would come from your belief about how the economy works I have to believe that most of the people at the fed would say gives me relevance table inflation\nEven if it means the Philips curve is dead John Ydstie NPR News Washington [noise]\n\n... [noise]\nYou're listening to all things considered from NPR News\nThis is a WAMC business update I'm Jim ...\nWall Street continued it slide today the Dow lost two hundred forty five to twenty four thousand four hundred forty to the U.S and the five hundred dropped Seventeen to two thousand six hundred forty one and the NASDAQ shed one hundred sixteen to seven thousand fifty\nUs consumer spending rose in September by a solid inflation adjusted to zero point three percent led by increased spending on health care and motor vehicles\nThe Commerce Department also says the Federal Reserve's preferred measure of inflation return to the central bank to two percent annual target after having been slightly elevated in prior months\nIn addition personal incomes rose zero point two percent in September the smallest gain since June to thousands Seventeen\nThe NHL is following the NBA's lead by partnering with MGM resorts international and providing the company with data for use in sports betting the Las Vegas based casino giant is the hockey league's first officials sports betting partner", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Albany", "day": "29", "locations": [["Middletown", 39.51506, -84.39828], ["Albany", 42.65258, -73.75623], ["Pittsburgh", 40.44062, -79.99589], ["U.S", 39.828306, -98.5795], ["Brazil", -10.0, -55.0], ["Washington", 38.89511, -77.03637], ["Pittsburgh", 40.44062, -79.99589], ["Us", 45.99696, -118.49854], ["Pittsburgh Pennsylvania Pennsylvania", 40.44062, -79.99589], ["Greece", 39.0, 22.0], ["Pittsburgh", 40.44062, -79.99589], ["U.S", 39.828306, -98.5795], ["U.S", 39.828306, -98.5795], ["Iraq", 33.0, 44.0], ["The U. S.", -14.60485, -57.65625], ["Syria", 35.0, 38.0], ["U.S", 39.828306, -98.5795], ["Washington", 38.89511, -77.03637], ["U.S", 39.828306, -98.5795], ["China", 35.0, 105.0], ["Florida", 28.75054, -82.5001], ["Greenland", 72.0, -40.0], ["New York New York New York", 40.71427, -74.00597], ["Pittsburgh", 40.44062, -79.99589], ["U.S", 39.828306, -98.5795], ["Boston", 42.35843, -71.05977], ["America", 39.828306, -98.5795], ["Sienna", 14.6331, 121.0055], ["Brazil", -10.0, -55.0], ["Rio de Janeiro", -22.90642, -43.18223], ["Brazil", -10.0, -55.0], ["Brazil", -10.0, -55.0], ["Brazil", -10.0, -55.0], ["Rio", -22.90642, -43.18223], ["U.S", 39.828306, -98.5795], ["Brazil", -10.0, -55.0], ["Brazil", -10.0, -55.0], ["Brazil", -10.0, -55.0], ["Brazil", -10.0, -55.0], ["San Pedro Sula Honduras", 15.50417, -88.025], ["U.S", 39.828306, -98.5795], ["Honduras", 15.0, -86.5], ["Honduras", 15.0, -86.5], ["U.S", 39.828306, -98.5795], ["Honduras", 15.0, -86.5], ["Padre", 21.19517, -76.60358], ["Mexico", 23.0, -102.0], ["Haiti", 19.07582, -72.29616], ["U.S", 39.828306, -98.5795], ["Honduras", 15.0, -86.5], ["Iran", 32.0, 53.0], ["U.S", 39.828306, -98.5795], ["Honduras", 15.0, -86.5], ["Honduras", 15.0, -86.5], ["U.S", 39.828306, -98.5795], ["U.S", 39.828306, -98.5795], ["U.S", 39.828306, -98.5795], ["America", 39.828306, -98.5795], ["New York New York", 40.71427, -74.00597], ["Pittsburgh", 40.44062, -79.99589], ["Pittsburgh", 40.44062, -79.99589], ["Florida", 28.75054, -82.5001], ["Virginia", 38.34982, -81.63262], ["Richmond Virginia", 37.55376, -77.46026], ["Brennan", -76.08333, -146.51667], ["Chesterfield county", 53.25, -1.41667], ["Richmond", 37.55376, -77.46026], ["Chesterfield", 53.25, -1.41667], ["Virginia", 38.34982, -81.63262], ["Berkshires", 42.16676, -73.14955], ["America", 39.828306, -98.5795], ["Albany New York", 42.65258, -73.75623], ["Pittsburgh", 40.44062, -79.99589], ["Pittsburgh", 40.44062, -79.99589], ["Florida", 28.75054, -82.5001], ["Washington", 38.89511, -77.03637], ["Pittsburgh", 40.44062, -79.99589], ["U.S", 39.828306, -98.5795], ["Pittsburgh", 40.44062, -79.99589], ["Pittsburgh", 40.44062, -79.99589], ["Atlanta Georgia Georgia Georgia", 33.749, -84.38798], ["Atlanta", 33.749, -84.38798], ["New York", 40.71427, -74.00597], ["US", 45.99696, -118.49854], ["Pittsburgh", 40.44062, -79.99589], ["Albany", 42.65258, -73.75623], ["Massachusetts", 42.36565, -71.10832], ["Massachusetts", 42.36565, -71.10832], ["Vermont", 44.00034, -72.74983], ["Williamstown Massachusetts", 42.71202, -73.20372], ["New York", 40.71427, -74.00597], ["Albany New York", 42.65258, -73.75623], ["Pittsburgh", 40.44062, -79.99589], ["Pittsburgh", 40.44062, -79.99589], ["Oakland", 37.80437, -122.2708], ["Pittsburgh", 40.44062, -79.99589], ["Albany New York", 42.65258, -73.75623], ["U.S", 39.828306, -98.5795], ["Mexico", 23.0, -102.0], ["U.S", 39.828306, -98.5795], ["California", 34.68743, -116.78467], ["Arizona", 34.5003, -111.50098], ["Texas", 31.25044, -99.25061], ["U.S", 39.828306, -98.5795], ["U.S", 39.828306, -98.5795], ["Mexico", 23.0, -102.0], ["Iraq", 33.0, 44.0], ["Syria", 35.0, 38.0], ["Iraq", 33.0, 44.0], ["Syria", 35.0, 38.0], ["Florida", 28.75054, -82.5001], ["Miami Dade", 25.77427, -80.19366], ["Ecuador", -1.25, -78.25], ["Miami", 25.77427, -80.19366], ["Mexico", 23.0, -102.0], ["Canada", 60.10867, -113.64258], ["Florida", 28.75054, -82.5001], ["Pittsburgh", 40.44062, -79.99589], ["U.S", 39.828306, -98.5795], ["U.S", 39.828306, -98.5795], ["Washington", 38.89511, -77.03637], ["U.S", 39.828306, -98.5795], ["Us", 45.99696, -118.49854], ["Las Vegas", 36.17497, -115.13722]], "not_found": ["Utica W. A. M.", "Kingston W. O. S. R. H. D. Ninety One"], "ep_coords": ["Albany, NY", 42.65258, -73.75623], "in_country": ["Middletown", "Albany", "Pittsburgh", "U.S", "Washington", "Pittsburgh", "Us", "Pittsburgh Pennsylvania Pennsylvania", "Pittsburgh", "U.S", "U.S", "U.S", "Washington", "U.S", "Florida", "New York New York New York", "Pittsburgh", "U.S", "Boston", "America", "U.S", "U.S", "U.S", "U.S", "U.S", "U.S", "U.S", "U.S", "America", "New York New York", "Pittsburgh", "Pittsburgh", "Florida", "Virginia", "Richmond Virginia", "Richmond", "Virginia", "Berkshires", "America", "Albany New York", "Pittsburgh", "Pittsburgh", "Florida", "Washington", "Pittsburgh", "U.S", "Pittsburgh", "Pittsburgh", "Atlanta Georgia Georgia Georgia", "Atlanta", "New York", "US", "Pittsburgh", "Albany", "Massachusetts", "Massachusetts", "Vermont", "Williamstown Massachusetts", "New York", "Albany New York", "Pittsburgh", "Pittsburgh", "Oakland", "Pittsburgh", "Albany New York", "U.S", "U.S", "California", "Arizona", "Texas", "U.S", "U.S", "Florida", "Miami Dade", "Miami", "Florida", "Pittsburgh", "U.S", "U.S", "Washington", "U.S", "Us", "Las Vegas"], "out_country": ["Brazil", "Greece", "Iraq", "The U. S.", "Syria", "China", "Greenland", "Sienna", "Brazil", "Rio de Janeiro", "Brazil", "Brazil", "Brazil", "Rio", "Brazil", "Brazil", "Brazil", "Brazil", "San Pedro Sula Honduras", "Honduras", "Honduras", "Honduras", "Padre", "Mexico", "Haiti", "Honduras", "Iran", "Honduras", "Honduras", "Brennan", "Chesterfield county", "Chesterfield", "Mexico", "Mexico", "Iraq", "Syria", "Iraq", "Syria", "Ecuador", "Mexico", "Canada"], "in_state": ["Albany", "New York New York New York", "New York New York", "Albany New York", "New York", "Albany", "New York", "Albany New York", "Albany New York"], "out_state": ["Middletown", "Pittsburgh", "U.S", "Brazil", "Washington", "Pittsburgh", "Us", "Pittsburgh Pennsylvania Pennsylvania", "Greece", "Pittsburgh", "U.S", "U.S", "Iraq", "The U. S.", "Syria", "U.S", "Washington", "U.S", "China", "Florida", "Greenland", "Pittsburgh", "U.S", "Boston", "America", "Sienna", "Brazil", "Rio de Janeiro", "Brazil", "Brazil", "Brazil", "Rio", "U.S", "Brazil", "Brazil", "Brazil", "Brazil", "San Pedro Sula Honduras", "U.S", "Honduras", "Honduras", "U.S", "Honduras", "Padre", "Mexico", "Haiti", "U.S", "Honduras", "Iran", "U.S", "Honduras", "Honduras", "U.S", "U.S", "U.S", "America", "Pittsburgh", "Pittsburgh", "Florida", "Virginia", "Richmond Virginia", "Brennan", "Chesterfield county", "Richmond", "Chesterfield", "Virginia", "Berkshires", "America", "Pittsburgh", "Pittsburgh", "Florida", "Washington", "Pittsburgh", "U.S", "Pittsburgh", "Pittsburgh", "Atlanta Georgia Georgia Georgia", "Atlanta", "US", "Pittsburgh", "Massachusetts", "Massachusetts", "Vermont", "Williamstown Massachusetts", "Pittsburgh", "Pittsburgh", "Oakland", "Pittsburgh", "U.S", "Mexico", "U.S", "California", "Arizona", "Texas", "U.S", "U.S", "Mexico", "Iraq", "Syria", "Iraq", "Syria", "Florida", "Miami Dade", "Ecuador", "Miami", "Mexico", "Canada", "Florida", "Pittsburgh", "U.S", "U.S", "Washington", "U.S", "Us", "Las Vegas"]}, {"month": "10", "state": "NY", "station": "WAMC", "content": "But treating this shooting and prosecuting it as a federal hate crime does send a message of the seriousness of the crime and that the federal government treats it as such a you'll recall of course the case of Dylann Roof of who was convicted in the killing of nine black parishioners at a church in Charleston South Carolina\nThe federal government in that case brought hate crime charges against him even though he was already facing state charges and ultimately a federal jury convicted him and he uh he was sentenced to death\nAnd just briefly as you can to the degree that you know what happens next\nWell the FBI is just getting to work on this there's a large crime scene that will have to go through a half to collect evidence there uh there's lab work to be done and then of course there's digging into the or the alleged shooter's social media history there already accounts reportedly linked to him that appear to show a fair amount of anti Semitic sentiments\nA and the alleged shooter in this case was of course alive in custody so possibly uh looking to question him\nThat if NPR justice reporter Ryan Lucas Ryan thank you so much for talking to thank you\nOnce again we are broadcasting today from W H y y in Philadelphia that is where we were when we got the terrible news of the shooting at a synagogue in Pittsburgh this morning\nAnd that in a week when two people were killed in Kentucky apparently because of their race and pipe bombs were sent to a prominent figures apparently because of their political views but even before those awful event we were hearing people across Pennsylvania tell us they are frustrated with the tone of this country's public discourse the lack of civility\nThey told us they hope for more unity\nAnd then the message that might have special residents in Gettysburg the site of an epic civil war battle in Eighteen sixty three wonder if this country's bloody is one more than fifty thousand Americans were injured or killed over the course of three days\nBut now in two thousand Eighteen a group of residents there have been meeting up in a historic church to practice what others preach bringing people of different political views together\nIt's called politics fact and civility Democrat car Thompson a former college professor founded the group and twenty Seventeen Darcy my also a Democrat joined a group through her friendship with Tom sent and Republican Chad collie it's also a member and he told me why he got involved\nTwenty sixteen in previous years before that was very politically involved I was vice chairman of the Republican Party here locally\nDuring the twenty sixth in campaign or saw a lot of instability a lot of anger a lot of resentment and saw that coming to boiling point in many ways and uh it encouraged me to stop and think about what was going on in the nation\nStreaming support for WAMC come from Berkeley Center for weight loss surgery with a focus on life skills and support for a long term success would weave district to me in gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nLike this was something that was in you like I Need that you had I it's interesting that there are a number of\nNational political figures who've been calling for something like this language on cases in Ohio or I Know maybe Joe Biden you could you know the same argument on average I'm Tom Ridge venue former governor of Pennsylvania from ... security\nBut you it sounds like that with something that was kind of in you and it was and thankfully car and came up with a structure for that ... what about you is this something that was kind of a hunger within you and now no like really\nI um I have always done a pretty staunch Democrat\nI that's where I live pretty much come down on on the left on most things call myself a progressive I never really thought about how important it was to bridge the divide until I got involved I think that realizing\nThat that there is valid points to be made on both sides and that there is a balance that we can find is has just been a real eye opening experience for me\nWhat did you envision when you started this group like what were you hoping to accomplish\nI was hoping that we could come to understand each other more\nAnd I I'm very convinced as doors who just said that there are valid points on all sides like Darcy I I'm a very blue blue voter\nBut I think that the red voters have valid points that it will enrich all of us if we can listen to to each other it's sort of like the story of the blind man and the the elephant\nWhich um I don't know if you're familiar with the looked up ... book expert political judgment\nIn which he actually test the theory that the more you investigate various points of view\nThe more likely you are to be correct in predicting what will happen in the future for example\nSo Darcy not that you were saying I don't want to talk to those people many ... but um [laughter] what you're doing is I'm hungry for this experience it's others were what made you finally decided to come well we're really was", "year": "2018", "show_name": "All Things Considered (NPR)", "city": "Albany", "day": "27", "locations": [["Charleston South Carolina", 32.77657, -79.93092], ["Philadelphia", 39.95233, -75.16379], ["Pittsburgh", 40.44062, -79.99589], ["Kentucky", 38.20042, -84.87762], ["Pennsylvania", 39.95233, -75.16379], ["Gettysburg", 36.53333, -11.61667], ["Ohio", 40.25034, -83.00018], ["Pennsylvania", 39.95233, -75.16379]], "not_found": [], "ep_coords": ["Albany, NY", 42.65258, -73.75623], "in_country": ["Charleston South Carolina", "Philadelphia", "Pittsburgh", "Kentucky", "Pennsylvania", "Ohio", "Pennsylvania"], "out_country": ["Gettysburg"], "in_state": [], "out_state": ["Charleston South Carolina", "Philadelphia", "Pittsburgh", "Kentucky", "Pennsylvania", "Gettysburg", "Ohio", "Pennsylvania"]}, {"month": "10", "state": "NY", "station": "WAMC", "content": "Streaming support for WAMC comes from my dog harness dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com\nOffering fooling part-time master's degrees with teachers certification now accepting applications teaching what matters barred dot edu slash M. eighties lashing wine time and space limited movie theater in Hudson screening Lizzie hill country the Anna the met opera Simpson and\nDes Lila and the national theaters Frankenstein time and space the doors and clerks in university taking reservations for clerks in capital region campus open house for a masters in professional programs in business engineering health care and education Wednesday November ... defy convention clerks and dot edu\nThanks for engineers Zach mulloy things to be in the tickets and just teaching in the newsroom this has been at WAMC northeast reports I'm Jim Lewis in for Brian shields states you know for all things considered [noise]\nThis is Northeast Public radio WAMC F.\nM. H. D. Ninety point three Albany W are you an HD Ninety points ... W am cage the Ninety point nine Kingston W. O. R. H. D. Ninety One seven Middletown WGLA HD Ninety One nine Plattsburgh WC a an HD Ninety three three candidates Harry W. A. N. C. H. D. one oh three nine tie kind of rogue WAMC wage do you want o five\nOne great Barrington W W E S H da da na ... kids go WINZ AHD Ninety point one Stanford W ANR eighty five Brewster and WAMC am fourteen hundred Albany\nLive from NPR News in Washington I'm Lakshmi sang the White House is in wait and see ... before it crashed a response to the killing of un space journalist your mouth ... inside the Saudi consulate in Turkey weeks ago President Trump says he's waiting to hear back soon from us investigators working abroad\nVote on the ground for how we have people over Saudi Arabia now we have to stop it before it started to see what we have a lot smaller there'll be coming back either denied or tomorrow morning but we have the Saudi Arabia\nNPR's Scott Horsley reports on recent remarks from presidential advisor Jared Kushner who\nHas a close relationship with the Saudi crown prince implicated in ...\nPresident Trump told the Washington Post there's been quote deception and lives in the Saudis explanation for ... death\nBut the administration has not yet decided what if any action to take in response Jared Kushner the president's son in law here to defend the Saudis during the CNN forum saying they'd been strong us allies in the fight against terrorism and Iran\nOnce we have all the facts then will make an assessment but I think that our ministry ... made a lot of games in our fight against terrorism we have to deal with a long term ideology of extremism and Saudi Arabia's a critical partner that\n... has its eyes open as it sifts through competing accounts of ... death Scott Horsley NPR News the White House\nThousands of Central American migrants including parents children and the elderly are still attempting to put more distance between them and the violence and poverty they're leaving behind James Frederick reports on a un found caravan stopped intellectual or Mexico\nPeople are trying to get food and water are there are local people who are coming to donate food and water there's a couple ambulances here to tend to people ah who have stroke um or other kinds of illnesses\nStreaming support for WAMC comes from my dog hurt US DOT com and no ... no ... Doug harness invented to make it easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to tag walk your dog with love thousands of reviews at my dog hunt S. dot com play a\nBig endless exodus from Central America\nLeading tech group has unveiled a framework it says well protect consumer data NPR's Dina Temple Raston\nReports the information technology industry council represents a ... to ... valley companies and the group is working for months on federal privacy legislation\nSome of what they'd like to see in the law isn't it surprise the company said for example that any legislation chicken ... like you know how company kept collecting and using their personal data\nBut what wasn't expected to suggestions that companies would be open to continue to affirmatively opting in to allow them to collect ... that that they change\nNow consumers have to affirmatively opt out which means a lot of people don't bother to do so Dina Temple Raston NPR again this is NPR\nSupport for NPR comes from Fidel itty investments taking a personalized approach to helping clients row preserve and manage their wealth learn more at ... dot com slash wealth but that would be brokered services at the end Americans for the arts and Americans for the arts dot org [noise]\nDiesel is dirtier than we thought I'm Randy Simon ... look at our changing environment [noise] three years ago Volkswagen was found to legally cheated federal admissions test us using devious programming of emissions control\nDevices subterfuge enabled eleven million passenger cars to meet us emissions standards in the laboratory despite the fact that they actually produce up to forty times higher emissions than the legal limit in real world driving\nA recent study by MIT has revealed at Volkswagen is not the only automaker producing diesel cars that produce far more missions on the road than in laboratory tests the study published in the journal atmosphere environment found that in Europe the cars from ten major auto manufacturers sold between two thousand and two thousand Fifteen\nGenerate up to sixteen times more missions on the road than in regulatory tests those levels exceed European limits but technically don't violate any you laws\nThe researchers predict that these excess of missions will have a significant health impact\nCausing approximately twenty seven hundred premature deaths per year across Europe the ten manufacturers excess admissions may not be the result of unlawful violations as was the case with Volkswagen instead permissive testing procedures that the ... level and defective emissions control strategies may be to blame\nThere are far more diesel cars in Europe than in the U.S partly because the emu urged the use of diesel for environmental reasons citing the lower carbon dioxide emissions of diesel versus gasoline cars however diesel cars produced significant emissions of nitrogen oxides\nWhich react with ammonia in the atmosphere informed fine particles that large deep in the lungs and cause respiratory disease asthma and other pulmonary and cardiac conditions diesel is dirtier than we thought [noise] earth wise is a production of WAMC Northeast Public radio\nSupport comes from Fulton County tourism in the southern Adirondacks park forty four legs forty four choices camping fishing hiking in more fall events throughout October counter at forty four legs dot com\nNPR News this is all things considered ... Chang and I'm Audie Cornish Turkish president\nStreaming support for WAMC comes from my dog ... dot com no joke no poll dog heart is invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog Curtis decker\nBused Saudi Arabia of killing the journalist the Saudis acknowledged it only Friday after denying it for weeks they say the country's rulers knew nothing about the operation acclaimed viewed with skepticism outside the kingdom\nNow to understand the aims of the Turkish government we're joined by Amanda slow she's a senior foreign policy fellow at Brookings she just got back from Istanbul welcome to the program\nThank you so as a point of contacts there has been a rift between these two countries right that predates this murder yeah absolutely\nSome of the tension goes back to the Arab Spring of twenty ten when Turkish president then prime minister air to want it seemed that like minded governments led by some of these Islamist parties\nWould come to power this fell apart for him in twenty Thirteen in Egypt when the Muslim Brotherhood elected leader Morsi who was an ally of turkey was overthrown in a coup by cc who was seen as a fellow by turkey and backed by the Saudis\nSo essentially a turkey has uh some enemies in the region now right including Saudi Arabia so uh what are they trying to gain in exerting basically pressure on the Saudi Government\nI think there are certainly has always been a challenge in a a struggle for a balance of power there in the region I think what we're seeing with air to one right now it's particularly directed against Mohammed bin saw him on a known as as NBS\nCitizens are on prince right now\nAbsolutely absolutely of who can film on designated as the air and twenty Seventeen are aired on I think never has really trusted him I think he thought that the west was buying into his reformist image while he was engaging and crackdowns\nUh he's thirty three which means he's likely to be in power for a number of decades and I think everyone always saw him as being particularly ah unfavorable to Turkish regional interests and so I think what we're likely to see from air to one in his speech tomorrow is continued efforts to try and impose maximum damage on NBS\nMeaning he wants them replaced a new era gold\nIdeally I think you would like NBS removed or at least weekend in terms of removing his de facto powers on on the foreign policy side\nSo is this speech directed really at President Trump the U.S is that the the nation that could bring this pressure to bear\nHiking biking museums shops in restaurants explore north Adams dot com\nHawthorne valley Waldorf school getting New Yorker early childhood through grade twelve within a nine hundred acre ... dynamic farm setting a vibrant place to learn and grow tours available reserve online uh hawthorn valley school dot org\nYou'll learn a partnership presenting costume and customs Middle Eastern threads that'll lawn effect Frederick churches costume collection more information all wanna dot org\nAnd Massachusetts General hospital Mass General research back care approach drives them to develop treatments for complex conditions to help their patients get back to their lives revolutionizing care Mass General\nStay tuned for WAMC regional news coming up at four thirty\n[noise]\nSupport for NPR comes from this station and from indeed used by over three million businesses for hiring where employers can post jobs and youth screener questions to build their shortlist of preferred candidates learn more and indeed dot com slash higher\nFrom log me in makers of go to meeting the collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learned more it go to meeting dot com\nAnd from listen like you who donate to this NPR station from NPR\nNews and all things considered I'm Audie Cornish and I know that Chang\nThe U.S military command in Afghanistan has acknowledged that an American general was wounded during a deadly insider attack last week in the southern city of Kandahar initially the command describe him only as quote un American service member NPR's Tom Bowman has more details\nThursday brigadier general Jeffrey smiley was at a meeting at the Kandahar governor's compound with senior American and Afghan officials just before the meeting broke up an Afghan guards suddenly turned his weapon on those present\nThe guard shark Kandahar as police chief general Abdul ... several times killing him that he sprayed the room with bullets smiley was hit twice in his limbs sort of Pentagon source as being treated at a military hospital in Afghanistan committed a grant Neely\nStreaming support for WAMC come from birch are Center for weight loss surgery with a focus on life skills and support for a long term success with we've got struck me in gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nWhen appropriate news or general smiley was wounded which first reported by the Washington Post\nThe American ... did not release the generals name because of what it called privacy concerns the general was in charge of training advise him the Afghan security forces in Kandahar\nThe attack also killed ... intelligence chief of dull moment in wounded governors Zalmay we saw initial reports from Afghan officials said the governor was killed\nIn American contractor and a coalition contractor will also wounded\nThe top American commander in Afghanistan General Scott Miller was unharmed who was leading the meeting when the gunfire erupted\nOfficials say the Afghan guard who opened fire was killed and it only been hard within the past two months to work for the governor and investigation is ongoing as officials provided more information on the Kandahar insider attack there was still another attack on coalition forces\nIn the western out here in Studio ... one soldier was killed and three others wounded officials said they were not American but would not say which country they were from\nThere have now been for insider attacks this year compared to one last year that killed three American Soldiers and they come as a Taliban has gained more ground in Afghanistan\nStill both Afghan and American officials were impressed with a large turnout on Saturday for parliamentary elections despite increased held in attacks voting in Kandahar was postponed until this weekend Tom Bowman NPR News Washington\n\nOpioid deaths are thought to be rare on college campuses but since the opioid epidemic young adults are now among those at high risk for overdose sometimes schools aren't taking chances NPR's Tovia Smith reports on the new effort to keep students safe\nOne of the first things colleges are doing is teaching students to recognize an opioid overdose and\nWhat to do things and you know\nOhio University is using this video dramatization you just show how can that drug known generically as a lock sound can reverse in overdose Noreen were Ohio\nUniversity is one of many schools that make nor can available through health services and campus police several other schools are starting to distribute the drive\nMore broadly [noise]\nAs you can see right at the main entrance we have ... the cabinet at Bridgewater\nState University south of Boston campus police detective sergeant Robert McAvoy points out one at sixty December later boxes on campus that are now also stocked with little bottles of ... nose spray all clearly labeled and read it opioid overdose kits and all free for the taking\nWe felt that it was on the university to provide these because it's a life saving drugs and we're in the middle of an epidemic that affects everybody\nShortly after a student died of an overdose in two thousand sixteen police putting our canon every norm in parking lot and trained more than a thousand people to administer it\nAll you do you feel this facts humid hold it like this for the tip into the\nPatients Nasir all about three quarters of an inch down into the nasal passage and they've just given once ray\n... and then you're done that in junior Isaiah ... one of the resident advisors who've been trained\nYeah man I'm ready and I think personally I feel like it's my moral obligation to help someone who was overdose could actually save another person's life\nI think it's good to make ...\nStreaming support for WAMC comes from my dog ... dot com no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com\nDuring his college years he says he overdosed twice and kept failing classes but he says that was before schools were set up to recognize or support students with drug addictions\nThey didn't want to acknowledge the problem like everything's fine at our school but I mean it was probably blatantly obvious honestly it was it was pretty bad\nNow one and a half years sober he's back in a new school and works in a campus recovery center the likes of which barely existed even a few years ago his school is also just started giving free nor can to students but only if they ask for it he worries many users or their friends would be too afraid to do that\nBut he says he also sees the downside to just leaving it out for people to take anonymously\nThe content that is you have no way of offering them further help the only way that we can help them as if we know who it is\nAs colleges struggled to workout best practices some say parents can't afford to just stand by in weight\nUnfortunately our colleges haven't really caught up and I think parents need to take it into their own hands\nJillian Bauer reached teaches at Temple University where two students died of overdoses last year she says when kids head off to college parents should send them with nor can as well as fentanyl testing strips\nJust like they would send them on with condom to encourage them to the first acts um they can create like a fee for drug use can for them to you\nShe dismisses concerns that it may actually encourage more drug use\nLike I don't think that if you're in our student was planning on studying for their exam that having had an old tactic strips and their drawer it's gonna be calling their name to go out and buy drugs and tried um\nBut others question such broad based strategies especially for schools with scarce resources even with school discounts nor can runs about Seventy five dollars for two doses emergency kits contain to just in case at Bridgewater State University none of the kids put out last year had been taken yet\nAnd then the two years since the University of Texas at Austin launched a similar initiatives several kids placed off campus have been successfully used that program director Lucas hill says all those on campus remain untouched\nThis is at least one data point that shows that may not be cost effective and so we'll see maybe on campus is not the ...\nHills now considering placing kits instead at convenience stores in bars but he cautions no locks on alone is not the answer colleges also need to beef up treatment in recovery programs preventing overdose death he says is not the same thing as curing addiction Tovia Smith NPR News [noise]\n\n[noise] who you are listening to all things considered they too throughout the evening and listen tomorrow morning on your public\nRadio data and we don't just want you to listen there are plenty of ways to contribute ideas or just continue the conversation we know a lot of you out there are wrestling with the opioid crisis for instance\nYou can reach out to us on Facebook or Twitter or pages are under NPR ATC and you can even bounce ideas off me I'm On Twitter at NPR Audi\nAnd I'm On Twitter at ... Chang or you can reach me\nStreaming support for WAMC come from ... Center for weight loss surgery with a focus on life skills and support for a long term success with we've ... in gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\n\nDavid in the meantime the u._s. does have other arms control agreements with Russia or those imperil\nI think this does mark a major shift in us arms control policies since Nineteen seventies the thrust has been to limit nuclear weapons and under Trump the momentum all seems to be toward ending these treaties and letting the stalled nuclear arms race get going again\nAfter all this administration has pushed for developing new nuclear weapons and they've been approved by the new defense budget\nNPR's David Welna that David thank you for your reporting You're welcome Audi\nResidents of the Florida Panhandle are still reeling from the destruction caused by hurricane Michael\nAs a snapshot of where they stand now twelve days after the storm about Seventy thousand customers remain without power some water and sewer systems are not working and cell phone service it's spotty a complete breakdown of communique\nStreaming support for WAMC comes from my dog harness dot com and no ... no ... dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog ... dot com\nOut sixty miles inland his property looks as if a tornado came through trees are down everywhere including one that fell through the roof of his house he says he wasn't prepared for the strength of hurricane Michael\nWho's been there forty five years and now we've had hair case what will never had enough and thus far inland like this\nAnd he says he's certainly never been cut off from the outside world like this is\nNo communication there and the cell phone might come on an hour and golf and bill for six hours or more you never knew when it was coming and going\nFamily could not get in touch after the storm to know that he survived that's been a major problem throughout the region where hundreds of people have been reported missing because the phones aren't working it's also hampered search and rescue operations because first responders couldn't talk to one another\nHurricane rescue specialist Adam she says it's an Achilles' heel\nReally thought about how connected I wasn't quite often so do you want to you know college out here for us the spot so and if it's a hindrance\nIn ... county where Michael made landfall a third of cell service remained out as of yesterday according to the Federal Communications commission the county's emergency services chief Mark Bowden says that's unacceptable\nOur community has been traumatized the inability to communicate because of arise and not for whatever reason not being able to implement their continuity of operations equipment effectively\n... says it's slowing all aspects of the recovery\nYou know the insurance adjuster that people need the tree versus the people need the contractor that people need absolutely communications is the core\nBone says the county also had issues with what officials thought were redundant communication systems everything went down satellite fiber and cellular the wind blew outlined detached utility poles and uprooted trees ripped apart underground fiber lines\nEven the public safety radio system was compromised for a time ... says they had no way to get word out about basic things like where to get food and water\nHere's all these resources flooding in but there's you can't even find out where to go get them you know it's it's word of mouth you know Pony Express\nThe Panama City public radio station W. K. GCE became a lifeline broadcasting from the emergency operations Center for eyes and vice president David Small told the station the company needed to do more to get service restored but it's dealing with unprecedented damage\nObviously I don't need to explain the tragic nature of what has occurred we're in a situation where many of these cells such rely on fiber optic infrastructure and that fiber optic infrastructure has been severely damaged and in many cases the simply destroyed or gone\nPrize is offering three months of free services to customers in nine Florida counties\nFlorida's chief financial officer Jimmy patrolling us is asking the FCC to make new rules to prevent prolong telecommunication outages and a disaster\nHe says no community should have to enjoy the kind of catastrophic failure that panhandle residents encountered Debbie Elliott NPR News Panama City Florida [noise]\nStreaming support for WAMC come from Tom ... woods to warmth in homes and businesses throughout the northeast today's self stoking automated would heat would boilers dot com [noise]\nYou're listening to all things considered from NPR News for forty years doctors have been prescribing powerful anti psychotic drugs to patients suffering from the Larry him how all is a common one but\nA sweeping new study finds those drugs are completely ineffective in treating ... study was published online today in the New England Journal of medicine NPR's Richard Harris reports\nEvery intensive care unit nursing counters delirious patients like Brian uh forty seven year old man who had been admitted to the ICU at\nVanderbilt University medical center with a failing liver when Dr swing through on a recent morning on their daily round nurse Lindsey Smith recaps Brian's rough night\nHe is completely disoriented this morning can even tell me his name um ability why's he can move all this extra money he tried to get out of bed several times this morning um we ended up having to restrain them put them in for not getting every hand\nIn his confused delirious state he doesn't realize that the ivy lines are actually providing him much needed medicine\nHe has to first of all I mean um\nThose are switching positions to keep pulling them out\nBecause the doctor with helium teams head into the room he's concerned about bringing this man's delivery him under control if it ... it can greatly increased the risk it will suffer long term problems thinking and remembering\nDr Daley how're you doing I'm are what's the main thing bothering you today Brian can't seem to make sense of the question really persist full of that many fingers hold it up with your hand Brian\nCan't follow that simple command either he says these are signs of leery of many doctors would give him a powerful anti psychotic such as how ball or a related drug called ... praise or don't the assumption for decades is that these drugs could treat leery him\nAnd some surveys up to Seventy percent of patients get these anti psychotic in the hands of very good doctors that extremely good medical centers and so that means translation worldwide that millions of people are getting these drugs to treat their delivering\nBut that medical practice was based on tradition not solid science so Dr ... and his colleagues ran a formal clinical trial involving more than five hundred patients\nTo see if the drugs actually worked patients with delivering were split into three groups one group got the most powerful anti psychotic a second group got what's called an atypical anti psychotic so I praise or do a third group got placebo he says the drugs made absolutely no difference\nNeither group had any detectable reduction delivery him coma they said in the eyes to use the same amount of time they said on the mechanical ventilator the same amount of time\nThey didn't get out of the hospital any sooner one way or the other and there's really not not a shred of evidence in this entire investigation that this aggressive approach to treating delivery him with at a psychotic switches commonplace unusual care did anything for the patient\nYes the drugs can calm patients down but they don't treat leery of huge doctor Julie bar at Stanford University it's helped craft guidelines for appropriate drug use in the intensive care unit\nReally need to think differently about managing ... paste\nStreaming support for WAMC come from birch are Center for weight loss surgery with a focus on life skills and support for a long term success with we've got struck me in gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register approach\nTo treating delivery him by getting patients off drugs and off breathing machines as soon as possible and getting them up and about as soon as they are able Richard Harris NPR News [noise]\n\nThis is all things considered from NPR News\nComing up on this week's books show Walter Mosley's latest novel is the result nearly Twenty years of incubation is a convention dividing novel of ideas about the sexual and intellectual coming of age of an unusual man who goes by the name woman ... new book is John woman [noise]\nWalter Mosley or just in this week's books show Tuesday afternoons at three Thursday evenings of eight thirty be a podcast and anytime at WAMC\nDied or support for WAMC comes from Rockefeller College at you Albany offering a master's degree in international affairs while studying from anywhere with synchronized distance learning Albany dot edu slash Rockefeller\nMassachusetts General hospital Mass General research back here approach\nDrives them to develop treatments for complex conditions to help their patients get back to their lives revolutionizing care Mass General\nThe Albany whiskey riot festival Sunday October twenty eight that the Desmond Albany\nFeaturing over Ninety whiskey types available for sampling ticket information at whiskey riot festival dot com\nM. H. D. Ninety point three Albany W ... point three runs in Utica W am cage de Ninety point nine Kingston W. O. S. R. H. D. Ninety One point seven Middletown WC EL HD Ninety One point nine Plattsburgh WC a an HD Ninety three point three Kennedy Harry WAMC age do you want a three point nine tech Honda rogue WAMC ... five\nPoint one great Barrington W. W. E. S. H. D. idiot point nine mount Kisco WAMC HD Ninety point when Stanford W ANR eighty eight point\nBy Brewster and WAMC am fourteen hundred Albany\nSupport comes from Laurie Donovan designs Lennox creators of handmade jewelry for over forty years offering contemporary and estate jewelry color gemstones plus ... purpose thing and repairs of fine jewelry Laurie Donovan dot com\nAnd soon each connect to the County Community college announcing their full open house Saturday November third nine AM to one PM\nSunni S. C. C. C. dot edu slash open house it's five o'clock [noise]\nThe only bomb the joke and maybe only bombs or the or the baby's diaper you're on the caravan\nThousands of migrants traveling in a group or the U.S border deny President Trump's claim that terrorists are with them in his day October twenty second and that's in all things considered\nI'm Audie Cornish and I know if it's changed the president had threatened to close the southern border and cut aid to Central America does he have the power to do that also shrinking airplanes ... expert says it's not just uncomfortable it can be unsafe\nWithout proper regulation on the phrase it's going to get worse and worse until there are real disaster\nAnd sweet and people can have a microchip implanted in their bodies to access to the gym or the movies\nIs helping I was relatively safe but if it's used everywhere because didn't bumped up all they got out of the privacy that we have NOW News\nLive from NPR News in Washington I'm ... the Turkish investigation into the killing of journalists ... showed gee is focusing on a consular car founded in ... parking garage NPR's Peter Kenyon reports police are awaiting Saudi permission to search that vehicle\nPolice found the diplomatic vehicle in a parking garage and the sultan does he district ... Turkish state TV is reporting that the car was parked there on October tenth eight days after Saudi journalist ... disappeared after entering the Saudi coastal it\nIt's not clear whether the cars connected to the show ... disappearance authorities you're waiting for Saturday permission to search the diplomatic vehicle\nTurkey's president reject type air to one is due to address the nation Tuesday on the latest findings of the investigation into ... death after two weeks of denials Saudi Arabia has acknowledged he was killed that cleans it was an accident Peter Kenyon NPR News ...\nPresident Trump meanwhile said today he is not satisfied with what he's heard from the Saudis so far with midterm elections just weeks away some potential democratic candidates are already on the twenty twenty\nStreaming support for WAMC comes from my dog harness dot com and no joke no poll Doug harness invented to make walks easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com\nOkay that if they don't vote Democrat will lose you get in the last midterm election in twenty fourteen roughly two thirds of Americans did not vote\nAt working people said all the lower income people said all people of color said all young people said oh not this time but it's exactly\nRight [noise] and this guy in crowd for supporting him and he's twenty sixteen presidential dead and to get his ideas and health\nCare and the economy are more relevant than ever standard is one as many possible democratic presidential hopeful stumping for midterm candidates along with former vice president Joe Biden and senator Cory Booker Asma Khalid NPR onions\nMembers of the migrants caravan walking along a highway patrol in Mexico and the message on Twitter today President Trump said that migrants from Guatemala Honduras and El Salvador cannot illegally come into the U.S will be the southern border\nHe says those countries governments have been unable to stop the caravan and he says he's alerted the U.S border patrol\nDrop is calling the situation in emergencies says the U.S will begin cutting off her substantially reducing aid to the three Central American countries\nThe Paris based organization for economic cooperation and development is out with a warning the world's consumption of raw materials as likely to rise sharply in the years ahead putting increased pressure on the environment\nYou always see Deuce has increased processing of natural resources such as what oil and gas as well as metal and building materials will worsen air water and soil pollution\nStocks close mixed today the Dow Jones industrial average down a hundred and twenty six points then as that goes up my team this is NPR\nSupport for NPR comes from the alliance for lifetime income a nonprofit compose the financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for a lifetime income dot org\nSupport comes from mark lost an antiques Saratoga Springs in ... New York jewelry and diamond buyer purchasing silver coin collection\nAsian antiques find are in the states mark Lawson dot com that is WAMC regional News I'm Jim ... experience in the region continued to be a sticking point between the top two candidates running a New York's nineteenth congressional district during a debate at WAMC today\nRepublican Congressman John fast so criticized Democrat Antonio Delgado who grew up in nearby Schenectady but recently moved into the Hudson Valley\nIn fact it's really kind of arrogant when you think about it to move into a district you've never lived in registered to vote and the very next day sign up to run for Congress\nDelgado defended his career choices and mentioned that his wife is from Woodstock which is part of the nineteenth district\nWe left uh yes after a we best from high school and pursue some opportunities and I think that was right on the time congressman ... uh came into the picture from Long Island uh\nCollege spectrum news pull released today shows forty four percent of voters support fast so well forty three percent back Delgado the poll shows that six percent or with a third party candidate and seven percent are undecided\nThe Green Party Steve Greenfield an independent dying Neal also participated in today's debate\nWhich you can watch and listen to at WAMC dot org a man charged with murder in last week's fatal Pittsfield\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including ... robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nGuilty one counts of murder in central birch are district court Monday morning\nAuthorities say stepped in turned himself in Monday after police issued a warrant for his arrest last week except in a pitch builder is being held at the books are count the house of correction without fail to other suspects twenty two year old Anthony boon in twenty eight year old Bruce Romano have also pleaded not guilty\nYou are listening to WAMC\nIt's all things considered from NPR News I'm Audie Cornish and I know that Chang President Trump has threatened to cut off aid to Central American countries that have failed to stop migrants weaving for the U.S will have more on that shortly first we go to the southern Mexican town of ... with thousands of these migrants are resting before\nContinuing their march towards the United states\nIn ... the central plaza had become a way station [noise]\nMigrants bottles from a water hydrant to wash themselves after their long journey in Ninety degrees\nElsewhere on local woman rifle through bags looking for some children choose to\nDonate to migrants family reporter James Frederick is ... hovering just migrant caravan ... to start or all of them my friends actually there what are their plan\nTo the migrants arrived here yesterday last night\nUh most of them ended up sleeping here in the plaza or they were here this morning a group of them just left to continue going north I've also talked to people here in the plaza who are just too tired from yesterday ... they want more than twenty miles in Ninety degrees yesterday and we're just too tired to do the same thing again\nSo the ... here we also have worried that there are more people coming north for expected to arrive in temperature today\nWith such a large group how are all these people getting food or medical care or even shelter\nWell sheltered there just really isn't for for most of these people most of them are just slept on the streets are slept in Central Park last night\nAs far as food water medical care that is mostly being done just by local people trying to help them a there are some local NGOs coming to hand things out but they're relying on people to come and donate things to them really\nNow I understand there are activists there are who are working with this caravan and some of them actually held a press conference today where they were responding to some of President Trump's claims right including the charge accusations that there are terrorists among the group ... can you tell us more about what they had to say on that\nSpecific charge that there are terrorists here the people speaking said you know who the terrorists need these women these children they said the the only bombs here and they said this jokingly the only bombs or the or the baby's diaper here on this caravan\nEating out a movie or a migrant activists from ... from that I spoke and he addressed the issue specifically that this was a political movement that the Democrats had organized but he said really there are two things to blame for this migrant care of him\nFerris coined dot com Albany cardio thoracic surgeon welcoming Dr ... Polanski providing patient centered heart surgery for over forty years in the capital region practicing cardiac surgery at St Peter's hospital\nA C. T. S. U. R. G. dot com\nVermont's coffee company organic coffee and the brown paper bag now roasted with renewable energy for much coffee company coffee roasted for friends\nAnd Sunni to connect to the County Community college announcing their fall open house Saturday November third nine AM to one PM Sunni S. C. C. C. dot edu slashed open house\nAnd the forecast mostly cloudy tonight with a few rain and snow showers Lowe's and the upper thirties mostly cloudy with scattered showers tomorrow hides in the low fifties\nIt's five twenty WAMC regional news coming up at five thirty [noise]\n\nSupport for NPR comes from the station and from farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs coverage options and more information can be found at farmers dot com\nFrom Trader Joe's offering new products in every store and new episodes of the original podcast theories inside Trader Joe's at apple pie cats or where podcasts are available more at Trader Joe's dot com\nAnd from the listeners to support this NPR station\nFrom NPR\nNews this is all things considered I'm Audie Cornish\nStreaming support for WAMC comes from my dog ... dot com no joke no poll dog hornets invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog Curtis dot com\nPromises to make routine tasks easier and quicker but how far would you go to adopt that technology would you say in plant the microchip underneath your skin lots of people in Sweden are doing just that\nIn fact there's so much demand for the microchips that the country's main supplier says it cannot keep up with the request Maddy Savage reports from Stockholm [noise] Eric\nFor it because I'm knocking the door to a sixteenth century townhouse with just a swipe at his hand [noise]\nThe ... year old Web developer and design at least have agreed to friends and we can any organized achieving policy inviting a bio hacking company to inject tiny microchip into the skin it just above his housemates some\nThey work exactly the same as your key parts of the things you scan to get into your garage or into your office or should completely ... interview source or anything when you're captured youngest a reader\nThe trips since back in ... tells the reader which chips places and then if it's a door for example we can decide whether or not to let you in [noise]\nGrowing numbers of Swedish offices watching hub in him and just started adopting to tighten often have\nGet can also be used to ... imagine could contact the tail social media profiles all eat tickets for than\nWhat I get the cheap monthly because I was curious and I went to to make my life a little bit easier than Silvio ... one of their eggs housemates this morning when I leave the only thing that I made my bank card\nThat the one thing that I basically carry around that for every other strengths that ship basically all the problems what was it like getting into it a little bit scary but not thankful that I was surprised maybe for the front of him it's a perfect to find more than four thousand\nSwedes have had the chips in that one company is donating them all kids it was started by former professional ...\nMy name is he on us to them on the seal and founder of by her from the national for the last five years it's escalated quickly last two years I've been doing this fulltime\nPrivacy is a big issue that a lot of people will be thinking about when they had this one happens to people's data\nIs not much different than today everything is possible but the recent ... will never be bigger because of some microchip is harder for someone to get to since you put any what happens is a software update if needed\nAll that happens in the back and he's got a lifetime of about ten years not like today's phones there won't be a need to get a new one every year\nSweden largest trading company region don't allow it can be just eat chips instead of to get on the top they continue to make payments to ensure the restaurant that I'm On the way to meet them limited and bushy scientists based in Sweden campaigning but no one make it to keep a closer eye on the trans [noise]\nWas helping Irish rose research would it be every ...\nEvery time you want to do something you want a conference call it could be very very easy for what goes on pressure\nLead all any adult to when it comes to technology and the economy is already one at the cash and is on the planet\nMicrochips or a nice trend right now but it might not be too long before they go mainstream and not something that worries and if it's in\nSome form the body when more health related mesh and start reading\nStreaming support for WAMC comes from my dog harness dot com no joke no poll dog hornets invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com\nWet is a high level of trust the government institutions banks and corporations to end the unease I might eat South Beach instill\nKind of support for all tech considered comes from the three I O T providing a software platform that enables organizations to deploy artificial intelligence predictive analytics and diabetes solutions at industrial scale learn more at the three ... dot a and from ultimate software\nProvider of cloud based HR payroll and talent management solutions for the modern workplace learned more in alternate software dot com ultimate software people first\n\nThose are the opening notes of shares hit song believe believe it or not the dance anthem is just turned ... years old [noise]\n\nI can just say the words share believe and then the vibrations of the song that already existed on the wind will reverberate in your head and you would need to be sure that\nThat NPR Music Stephen Thompson he says believe it did so many things it kicked off a share renaissance one many it's the mentored her role as a pop icon ended popularized a controversial fixture of pop music today auto tune here Steve and\nThere's a long history of artist you using a different vocal modifications but does it always been a disguise you used it in ways that you would hope the audience wouldn't notice just to make of a vocal a little cleaner and clearer and more on pitch\nThis song brings the auto tune front and center here those modifications\n\nIt could easily have just been a gimmick instead auto tune became a very prominent tool in a lot of pop R B and hip hop production [noise]\nTo me auto tune sounds sort of like digital stretching are flexing your shearing a singer kind of slide up and down the register\nIn a in a way that doesn't sound natural but auto tune can amplify an expression of passion is in or emotion in a singer\nI think of a song like hide and seek by the singer image and heat or who became really really well known for for using\nThis effect a venue here hide and seek and the way they are using auto tune to manipulate her voice\nYou really feel the emotions that that song is expressing and I don't know too many people who is your that song and say what ought to\nBe\nLot to say so what you've seen in the years since his auto tune being used in kind of exciting an innovative ways and it can be misused in\nThat can reach the the motion and love out of a out of a performance like the black eyed peas had a lot of these like a very uh were driven party hardy\nStreaming support for WAMC comes from my dog harness dot com and no ... no poll dog harness invented to make walks easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog harness dot com\nThat sort of amazing that all of this auditing stuff really began in the pop music landscape with this one dance pop song from almost exactly Twenty years ago\nWhen that song originally came out all the people involved with that song actually tried to hide from the public the method they used to create that song because they didn't necessarily want\nPeople to imitate that we'd like this is our gimmick and now it's just it's just so funny to see all the different permutations of what seemed at the time like this total throwaway saw [noise]\n\nThis is NPR News\n[noise] [noise]\nStreaming support for WAMC comes from my dog harness dot com a no joke no poll dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog harness dot com\nBoom this past weekend more than half of Nevada voters typically cashed out early party voting total can be a key indicator of how elections day will turn out Scott Detrow NPR News [noise]\nAnd you portray going on to Christie's auction block Thursday maybe reminiscent of a Rembrandt but it's actually the work of artificial intelligence it's called the portrait of Edmund Bellamy the work was created using an algorithm and it might fetch around ten thousand dollars\nComputer's making art is nothing new but a computer creating a portrait that's being auctioned by such a prestigious art house now that is new art appraiser Aaron Murray Wallace has been following the bugs around the upcoming sale\nAnd she joins us now to talk about how the art world is taking all this in welcome thank you a pleasure to be here outside\nHow controversial is this in the art world for a painting to be painted by a non human and then auction off like fine art\nWell I think every couple of generations you have something that happens that begins to redefine what we consider art you can go back to the early twentieth century and you can look at the urine or by Marcel Just shop where he literally took a men's urine and hang it on a wall right\nAnd it's completely shattered what people thought of as art we're redefining what aren't actually is\nFor the twenty first century so I don't think that it is I'm a once in a lifetime moment I think these things happen again and again we're redefining what we consider art with in our historical context\nThat is so fascinating but it does raise the question of how do you\nPrice a painting that is not the product of a human because usually I'm no art expert but usually the way I understand that things like technique and the uniqueness of a piece of work those are the factors that drive the price an art so how do you price art where those things don't really apply well\nThey still apply but let's add to that let's add to that the market ability of a painting let's add to it hype that's created around a painting or anywhere 'cause I really\nI tend to think that the whole thing is orchestrated from go they knew exactly where they wanted to price it in comparison with where they wanted to sell it via Christi is\nAll are within the same wheel house in terms of number\nAnd does that work at St ration deplete the integrity of the artistic process the rollout\nMy opinion is no because I don't think it is up to any person to define what art is or what art is valued at I feel that art is valued at what people are willing to pay for it\nSo the artist in this case is it the code words he wrote the algorithm is it the algorithm or is it the machine\nOh the artists have to be a little bit of all of those original artists ownership I Do believe is split between the programming the ... the collective and maybe even a little bit of a ... for helping to create the frenzy around it and\nGiven that there has been some deliberate frenzied built around this if this painting were created by human do you think it would have the same attractiveness would it garnered that same price\nNo I don't think so I really don't think so I think\nStreaming support for WAMC comes from my dog harness dot com no joke no poll Doug harness invented to make walks easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog harness dot com\nIs the absolute first time this has ever happened because it's as a candidate print it is absolutely possible that the collective could decide to release it in a smaller limited in numbered edition after that sale I don't believe that those will be valued as high as ... particular wind because this is the first\nAaron Marie ... is the c._e._o. of rare era appraisals just outside of Washington DC thank you very much I think it's a pleasure alpha\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise] you're listening to all things\nConsidered from NPR News\n\nThe warehouse retailer Cosco is going to raise live chickens it's part of a farm to table operation in this case it's a coup toured history\nCosco will compete with the small number of companies who now control most poultry production in the U.S grant girl out of any new has this report\nIf you're a fan of ... this is where your food comes from or soon it will I'm On the south side of ... and this is where a new chicken processing plant is going up right now it's a lot of steel beams and concrete walls\nAnd construction [noise] is expected to be up and running this time next year and what is that capacity there'll be processing two million chickens per week\nAll of our Barnes in Nebraska and I have a collectively will supply about forty percent of ... I mean\nThat's just ... a spokeswoman for Lincoln premium poultry companies started by Costco to build and manage the Fremont poultry complex that includes the processing plant a hatchery feed mill and contracts with more than a hundred new chicken farms in that area to raise the bird\nAnd that will roughly cover the western half of the United states Alaska and Hawaii\nCosco was building this system to control its supply and costs they sell a whopping sixty million rotisserie chickens each year but there's a problem poultry producers are raising enough chickens suitable for the rotisserie will Sawyer who tracks the economics of the meat industry for ... says they're racing bigger chickens\nTo the vast majority or process and the chicken breasts or lack hoarders size or their further process in a stressful enough is that where the industry has gone over fifty years now\nSo Costco was creating its own supply of smaller chickens doing it in Nebraska will help keep the price fixed it for Ninety nine because there's plenty of cheap corn around for feed\nSays well other chains like Wal Mart are supplying some of their own milk they've never gone fully vertical into meat production like this from the top down costs will control both supply and demand and that concern some farmers John Henson heads the Nebraska farmers union\nCards go comes in and while they have a good corporate citizen reputation it still is at the end of the day a poultry contract\nWas offering Fifteen your contracts to raise chickens but it's up to the farmers to finance their new ...\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including may go robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nAll use building if you don't have birds but the farm economy is struggling here and some grain farmers think turning to chickens is worth the risk [noise]\nMarshals each instance young to ask a farmer who was at a recent open house celebrating the first chicken bars he says raising chickens just might work for him\nThe only thing I thought about was hogs because there's more companies\nThere's really no other poultry company route to sell to if Cosco sales plummet still farmers here are signing up to raise chickens for Cosco hoping that its members will always be hungry for more\nFor NPR News I'm Greg gr law [noise]\n\nThat story comes to us from Harvest Public media a reporting collaboration focusing on agriculture and rural issues [noise]\n\n\n\n\n\nThis is all things considered\nFrom NPR News I'm Ian Pickett's would this WAMC business news\nBanks let abroad slide in us stocks today on Wall street giving the U.S in the five hundred its fourth street lost it dropped eleven points to two thousand seven fifty five the Dow last one hundred twenty six points to twenty five thousand and three Seventeen and the ... Nineteen points to seven thousand four sixty eight\nThe average price of a gallon of gas and Massachusetts has dropped four cents in the past week to its lowest level in three months Tripoli northeast says it's weekly survey found self serve regular selling for an average of two dollars eighty cents per gallon a nickel lower than the national average but thirty one cents higher than it was in Massachusetts a year ago\nThe executive director of a federal control board that oversees Puerto Rico's finances says the island is likely to receive twenty billion dollars more than initially estimated in federal hurricane relief ... says that should help the islands struggling economy to rebound though she says the games will be short lived unless there are tax and labor reforms", "year": "2018", "show_name": "All Things Considered (NPR)", "city": "Albany", "day": "22", "locations": [["Des Lila", 50.6378, 3.0544], ["Albany", 42.65258, -73.75623], ["Washington", 38.89511, -77.03637], ["Turkey", 39.0, 35.0], ["Saudi Arabia", 25.0, 45.0], ["Saudi Arabia", 25.0, 45.0], ["Iran", 32.0, 53.0], ["Saudi Arabia's", 29.04234, 35.59259], ["Mexico", 23.0, -102.0], ["US", 45.99696, -118.49854], ["us", 45.99696, -118.49854], ["U.S", 39.828306, -98.5795], ["Fulton County", 33.73119, -84.38324], ["Saudi Arabia", 25.0, 45.0], ["Istanbul", 41.01384, 28.94966], ["Egypt", 27.0, 30.0], ["turkey", 39.0, 35.0], ["turkey", 39.0, 35.0], ["turkey", 39.0, 35.0], ["Saudi Arabia", 25.0, 45.0], ["U.S", 39.828306, -98.5795], ["Hawthorne", -77.48333, 160.35], ["U.S", 39.828306, -98.5795], ["Afghanistan", 33.0, 66.0], ["Kandahar", 31.61332, 65.71013], ["Kandahar", 31.61332, 65.71013], ["Kandahar", 31.61332, 65.71013], ["Afghanistan", 33.0, 66.0], ["Kandahar", 31.61332, 65.71013], ["Afghanistan", 33.0, 66.0], ["Kandahar", 31.61332, 65.71013], ["Afghanistan", 33.0, 66.0], ["Kandahar", 31.61332, 65.71013], ["Washington", 38.89511, -77.03637], ["Boston", 42.35843, -71.05977], ["Austin", 30.26715, -97.74306], ["Russia", 60.0, 100.0], ["Panama City", 8.9936, -79.51973], ["Florida", 28.75054, -82.5001], ["Florida", 28.75054, -82.5001], ["Jimmy", 6.51007, -9.23831], ["Panama City", 8.9936, -79.51973], ["Florida", 28.75054, -82.5001], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Massachusetts", 42.36565, -71.10832], ["Albany", 42.65258, -73.75623], ["Utica", 5.16977, -74.50134], ["Albany", 42.65258, -73.75623], ["U.S", 39.828306, -98.5795], ["Washington", 38.89511, -77.03637], ["Turkey", 39.0, 35.0], ["Saudi Arabia", 25.0, 45.0], ["Mexico", 23.0, -102.0], ["Guatemala Honduras", 14.85646, -92.06622], ["El Salvador", 13.83333, -88.91667], ["U.S", 39.828306, -98.5795], ["U.S", 39.828306, -98.5795], ["U.S", 39.828306, -98.5795], ["Paris", 48.85341, 2.3488], ["New York", 40.71427, -74.00597], ["New York's", 40.77205, -73.93014], ["Woodstock", 34.10149, -84.51938], ["Long Island", 23.21667, -75.11167], ["U.S", 39.828306, -98.5795], ["the United states", 39.828306, -98.5795], ["Albany", 42.65258, -73.75623], ["Vermont", 44.00034, -72.74983], ["Sweden", 62.0, 15.0], ["Stockholm", 59.33258, 18.0649], ["Sweden", 62.0, 15.0], ["Sweden", 62.0, 15.0], ["South Beach", 26.71534, -80.05337], ["Nevada", 39.25021, -116.75119], ["Washington DC", 38.89511, -77.03637], ["U.S", 39.828306, -98.5795], ["Nebraska", 41.50028, -99.75067], ["Fremont", 43.04053, -108.63042], ["the United states", 39.828306, -98.5795], ["Alaska", 64.00028, -150.00028], ["Hawaii", 20.78785, -156.38612], ["Nebraska", 41.50028, -99.75067], ["Nebraska", 41.50028, -99.75067], ["Harvest", 13.46951, 144.78523], ["U.S", 39.828306, -98.5795], ["Massachusetts", 42.36565, -71.10832], ["Tripoli", 32.88743, 13.18733], ["Massachusetts", 42.36565, -71.10832], ["Puerto Rico's", 18.45325, -66.09247]], "not_found": ["u._s", "Middletown WC"], "ep_coords": ["Albany, NY", 42.65258, -73.75623], "in_country": ["Albany", "Washington", "US", "us", "U.S", "Fulton County", "U.S", "U.S", "Washington", "Boston", "Austin", "Florida", "Florida", "Florida", "Albany", "Albany", "Massachusetts", "Albany", "Albany", "U.S", "Washington", "U.S", "U.S", "U.S", "New York", "New York's", "Woodstock", "U.S", "the United states", "Albany", "Vermont", "South Beach", "Nevada", "Washington DC", "U.S", "Nebraska", "Fremont", "the United states", "Alaska", "Hawaii", "Nebraska", "Nebraska", "U.S", "Massachusetts", "Massachusetts"], "out_country": ["Des Lila", "Turkey", "Saudi Arabia", "Saudi Arabia", "Iran", "Saudi Arabia's", "Mexico", "Saudi Arabia", "Istanbul", "Egypt", "turkey", "turkey", "turkey", "Saudi Arabia", "Hawthorne", "Afghanistan", "Kandahar", "Kandahar", "Kandahar", "Afghanistan", "Kandahar", "Afghanistan", "Kandahar", "Afghanistan", "Kandahar", "Russia", "Panama City", "Jimmy", "Panama City", "Utica", "Turkey", "Saudi Arabia", "Mexico", "Guatemala Honduras", "El Salvador", "Paris", "Long Island", "Sweden", "Stockholm", "Sweden", "Sweden", "Harvest", "Tripoli", "Puerto Rico's"], "in_state": ["Albany", "Albany", "Albany", "Albany", "Albany", "New York", "New York's", "Albany"], "out_state": ["Des Lila", "Washington", "Turkey", "Saudi Arabia", "Saudi Arabia", "Iran", "Saudi Arabia's", "Mexico", "US", "us", "U.S", "Fulton County", "Saudi Arabia", "Istanbul", "Egypt", "turkey", "turkey", "turkey", "Saudi Arabia", "U.S", "Hawthorne", "U.S", "Afghanistan", "Kandahar", "Kandahar", "Kandahar", "Afghanistan", "Kandahar", "Afghanistan", "Kandahar", "Afghanistan", "Kandahar", "Washington", "Boston", "Austin", "Russia", "Panama City", "Florida", "Florida", "Jimmy", "Panama City", "Florida", "Massachusetts", "Utica", "U.S", "Washington", "Turkey", "Saudi Arabia", "Mexico", "Guatemala Honduras", "El Salvador", "U.S", "U.S", "U.S", "Paris", "Woodstock", "Long Island", "U.S", "the United states", "Vermont", "Sweden", "Stockholm", "Sweden", "Sweden", "South Beach", "Nevada", "Washington DC", "U.S", "Nebraska", "Fremont", "the United states", "Alaska", "Hawaii", "Nebraska", "Nebraska", "Harvest", "U.S", "Massachusetts", "Tripoli", "Massachusetts", "Puerto Rico's"]}, {"month": "10", "state": "NY", "station": "WAMC", "content": "Streaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including may go robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero [noise]\nBush was Northeast Public radio WAMC up ... points we all money W argue image to the point three runs from Utica there'll be William ... W on what sorry the Ninety One southern Middletown W ... knowing Plattsburgh W ... Ninety three three Kevin Harry ...\nWAMC wage do you want to find one great Barrington W W E S H the idiot my mom keeps go it'll be ... Sanford WN are idiots by\nBrewster WAMC yang I'm fourteen hundred Albany\nUnacceptable nope no one is going to defend\nActivity of that they admit\nUproar over their parents killing of a Saudi journalist Mike Pompeo says the U.S will reserve judgment until investigations are done for Wednesday October seventeenth is all things considered and\nI'm Mary Louise Kelly and I'm Ari Shapiro has this hour the latest from Istanbul which I'm all for show was lasting also our colleague Tom Bowman reports from school and the Syrian city of Raqqa\nThe children had been so traumatized they couldn't even recognize numbers letters so we had to work through that before we could actually start educating them\nAnd the rocks really old rocks ought to be the oldest evidence of life on earth turns out and maybe they're not fossils after all that kind of look like ... bars they're stretched out bridges that extend deeply into the rock after the news\n\nLife from NPR News in Washington I'm Lakshmi Singh President Trump is warning against rushing to judgment in case surrounding Jamal ... g's disappearance could show gee was last seen weeks ago walking into a Saturday consulate in Istanbul but never walking out\nThe Washington Post columnist you with us resident was critical of Saudi crown prince Mohammed bin Salman Turkish authorities think he was tortured and killed by Saudi hit men which the kingdom to night NPR's Mara Liasson reports it for now President Trump seems to be giving the Saudi royal family the benefit of the doubt\nThe president said he'll be brief soon by secretary of state Mike Pompeo who's on his way back from meetings in Saudi Arabia and turkey President Trump has compared the Saudi royal family to Brett Kavanaugh suggesting that they've both been considered guilty until proven innocent today he was asked whether those statements gave the Saudis cover\nAbout giving cover all would that being said Saudi Arabia is in a very important ally of ours in the middle east\nThe president also said he thinks audio tapes of what could be ... torture and dismembered meant at the hands of Saudi Government officials probably exists and that he's asked the Turkish government to share those tapes with us investigators Mara Liasson NPR News the White House\nThe death toll from a mass shooting at a vocational college in Crimea is now up to Nineteen and Russian investigators on the scene scene Eighteen year old student was the gunman they say the assailant open fire at the college encourage before he took his own life more than forty people were wounded officials say they are no longer characterizing the attack as an act of terrorism\nIt has been another difficult day for residents in those states batter by hurricane acclaimed at least twenty nine lives and left dozens of people and accounted for Michael made landfall with one hundred and fifty five mile per hour winds on Florida's panhandle last week residents in parts of the panhandle are still waiting for power\nFall with one hundred fifty five mile per hour winds on Florida's panhandle last week residents in parts of the panhandle are still waiting for power and cell phone service to return NPR's Hansi Lo Wang reports some rural communities are just starting to receive help\nFEMA has been sending teams have search and rescue specialist like Adam sheets that Virginia task force wind in Jackson County sheets them multiple trailers damage from the storm on the same property way brick house still stands\nAnd this is all family thrown at home right there's a poem that okay they know where to get assistance from medically they have some medical issues\nHundreds of families are still sheltering in school buildings around the region on along NPR News Jackson County Florida\nAnd as it figuring out a way to rebuild from the storm were not difficult enough survivor's all they have to guard against the losers the Panama City needs herrell close to bay county sheriff's office saying officers have been arresting roughly ten people every night on suspicion\nOf stealing from homes and businesses that are still without electricity some areas of the county or putting looters on no hits with spray painted sign that read losers will be shot\nBefore the clothes the Dow is down Ninety One points at twenty five thousand seven hundred\nSex this is NPR\nSupport for NPR comes from NPR stations other contributors include farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life ups and downs coverage options and more information can be found at farmers dot com and the ... foundation\n[noise] rapid response to climate change more important than ever [noise] I'm Randy Simon and this was her flies will look at our changing environment [noise] inter governmental panel on climate change has issued a new report\nEmphasizing the importance of taking rapid action to limit global warming to one point five degrees Celsius and examining the consequences of allowing temperatures to rise to two degrees instead the\nReport is the work of Ninety One authors and review editors from forty countries insights over six thousand scientific references\nThe key message of the report that we already seeing the consequences of a one degree rise in global temperatures in the form of more extreme weather rising sea levels and diminishing Arctic Sea ice among other things the report highlights what the impacts of not limiting the temperature increases the one point five degrees Celsius would be\nWith the two degree rise global sea levels would rise an extra four inches which was a very costly consequences\nWith a two degree rise in Arctic Ocean free of any sea ice in summer would occur every five to ten years instead of once a century while coral reefs are already likely to decline by Seventy to Ninety percent based on at one point five degree rise\nVirtually all of them would be lost with the two degree rise\nLiving in global warming would give people in ecosystems more room to adapt and remained below relevant risk thresholds\nBut the most sobering news is that at this point limiting global warming tool at one point five degree rise would require rapid and far reaching transitions\nInland energy industry buildings transport and cities\nWe need to reduce to admissions by forty five percent or twenty thirty\nAnd far more of a twenty fifty accomplishing this as possible within the laws of chemistry in physics [noise] but it is very uncertain whether we have the collective will to do it [noise] earth wise is a production of WAMC Northeast Public radio [noise]\nSupport for WAMC comes from Mannix marketing lens falls New York specializing in search engine optimization an Internet marketing since Nineteen Ninety six Mannix marketing dot com\n\nThis is all things considered from NPR News I'm Mary Louise Kelly and I'm Ari Shapiro the U.S turkey and stuff\n\nThis is all things considered from NPR News I'm Mary Louise Kelly and I'm Ari Shapiro the U.S turkey and Saudi Arabia or each maneuvering as more information comes out about the disappearance of Saudi journalist here's what happened today Turkey's foreign minister said he wants more cooperation from Saudi Arabia\nUs secretary of state Mike Pompeo met with Turkey's president and said the Saudis are committed to a full transparent investigation Pompeo was in Saudi Arabia yesterday\nAlmost daily leaks from the Turkish government strongly indicate the Jamal ... G was murdered NPR's Peter Kenyon joins us now from Istanbul Hi Peter hey Ari tells what's been happening today with palm pilots visit to turkey just today after he was in Saudi Arabia\nRight well this was billed as a fact finding mission and the church seemed pleased that Washington is showing not just an involvement here but support for Turkey's investigation\nUh there was a delay in searching the consul general's residence that Saudi consul general's residence er and that's what caused the foreign minister to say we need some more cooperation here but that surge then did begin today\nA Pompeo told reporters that the administration is not going to get ahead of the investigations and drop inclusions but he denied the U.S would downplay or gloss over the killing of a journalist if that's what happened here's what he said\nI'm not I'm not going to speculate that obviously if someone country gauges an activity the boys\nNo no one is going to defend\nBut ... at the same time make clear that the Turks should be mindful of the many important partnerships that bind to us in Saudi Arabia and Donald Trump is said much the same thing\nThat there have been some new details coming out today about what happened in that consulate and we should warn listeners that some of these details are graphic tell us what this investigation has revealed\nTurkish and Saudi investigators did enter the consul general's residence today with Saudi permission continuing their search of Saudi diplomatic buildings and property or the constantly building was search Monday and apparently evidence was found pointing to a killing their at least according to the Associated Press\nTurkish authorities have also said they intend to search Saturday diplomatic vehicles but to get to your point approve government newspaper has published very graphic details of the torture and killing allegedly of Mr ... including him having his fingers cut off before he was killed\nAnd forensics expert putting on music to drown out the sound of the ... of the body\nOr no it's not clear how long are the Turkish investigation or the Saudi internal investigation for that matter will go on a secretary of state Pompeo today said we should give them a handful of days to get this over with sooner is better than later he said\nVeras coin and jewelry one Ninety nine wolf wrote Albany New York since Nineteen thirty feet during his state and vintage jewelry diamond engagement rings no wedding bands used diamonds with certificates color gemstones first coined dot com\nThe weather forecast a cloudy cold Wendy nice and I had some scattered lane and some snow shower as possible in the mountains rain showers elsewhere in the valleys where freeze warning is up for much of the region upper twenties and low thirties tonight sunny breezy tomorrow mid\nForties and others sunny breezy day on friday milder in the fifties cloudy on Saturday some scattered showers in the fifties\nThe common bond as open at its toll free it's eight hundred six nine five nine one seven zero WAMC listener comments line eight hundred six nine five\nNine one seven zero twenty minutes after four o'clock [noise]\n\n\nSupport for NPR comes from the states and from Hitchcock's insurance providing customized insurance for small and medium businesses so they can do more and be more ... CEO X. dot com or from an agent Hitchcock's insurance encourage courage\nFrom the three I O T powering enterprise digital transformation with artificial intelligence predictive analytics ... learned more it see three I O T dot a guy and from Americans for the arts\nFrom NPR News this is all things considered I'm Ari Shapiro and I'm Mary Louise Kelly now to Syria for a look at a U.S back to school for children traumatized by war and by ISIS the program is in danger it might not survive the Trump administration's cuts in aid for Syria\nAnd it could come down to donations from other countries or private individuals to keep it going NPR's Tom Bowman visited the school and spoke with the children while he was traveling with the U.S military in the Syrian city of rock\nAnd\nSkinny boys says he's twelve years younger people who are crayon drawing he created this summer when he arrived at this childcare center is mostly colored and black there's attack an aircraft accrued figure\nSupport for streaming WAMC comes from the Davis financial group providing fee based financial planning and wealth management services to individuals families and business owners and the pioneer valley and beyond Davis financial G. R. P. dot com\nMy sister and me were killed just like\nTo listen this is a red tongue a flame rising from the roof of his home\nIn may when the houses that there's no question that like this\nThere does have known for decades a primary where young children communicate and comprehend trauma is by drawing pictures\nIf that is true these drawings in the wall or one collective scream there were a childish scrolls of beheadings corpses planes dropping bombs one small boy gestures to the picture he made his eyes or pinched by burns\nThe school and ... and others like it is designed to ease the kids back into something like a normal life\nEverything some art music just for\nThe new holders the state department official who helped oversee the childcare centers in northeast Syria an area controlled by U.S forces in his Kurdish and Arab allies\nWe found is that the children had been traumatized they couldn't even recognize number than letter that we had to work through that before we could actually start educating them against\nThe school's outer walls are paid to with colorful toy bears in balloons it's it's just a block or two from piles of rubble and skeletons of buildings\nDestroyed by ISIS booby traps in American airstrikes there are about five hundred kids here with space for hundreds more we're not it didn't find any of the Syrians for security reasons [noise]\nWith Syrian teacher instructors small classroom just set a boys and girls who never went to school during the years of war she says the children were afraid to be inside any building or even on the roads\nThey just didn't feel safe because of the bombings and destruction they witnessed and\nThat ... the apple first they were still carrying memory and if the war and they have lots of people close to them [noise] some have lost their fathers some had lost their parents\nShe points to two girls in the back of the room one steers blankly at the floor thumbing the pages in her book the other covers her face with their hands peering through a Web of fingers at the visitors in the room\nAnd get a lot having ... they had an obvious case at social isolation\nIn the beginning she says they didn't talk to anyone at all\nHands Angela happened and I think Lee they've recovered they've adapted to any place and adapted to then your friends\nOne boy in the class lost both his legs and sits in a wheelchair another is Thirteen and lost his left hand I get anything he into other children were playing with a bomb when it exploded that killed both his friends\nDeanie holder says the schools like this in the area hoping these kids are part of a program that costs about Thirteen million dollars in us funds\nPut the money will run out and just four months\nAre working very hard for the international community to explain to him that many different ways that they can be involved in the education sector\nPresident Trump's ... two hundred million dollars and they what impact that they have in\nEurope um basically part of the education money was tied up in the money that was so instead of having a full year coming up um I Will basically in funding at the end of January\nSays there's hope from other countries who are kicking in aid money the United Arab Emirates gay fifty million dollars but prefers the money is spent on projects like water and electricity Saudi Arabia is providing a hundred million dollars but it's uncertain whether it can be used for the schools\nPrivate donations of visual say can also help fill the gap for one and a half million dollars\nA million dollars but it's uncertain whether it can be used for the schools private donations officials say can also help fill the gap for one and a half million dollars holder so she can renovate one hundred schools for about five million dollars the care centers could continue for another year [noise]\nWhatever the fate of the schools there were signs of hope girls in red and white uniforms perform a dance routine on stage and avoid lost his hand and miners lotion chose a picture he just drew in his notebooks bouquet of\nFlowers and that boy who's black crayons pictured an ISIS fighter and the burning home the family left to flee to Lebanon next to that one of the new and more vibrant drawing of his home had\nMen and hey\nI still had the idea that this isn't me the current rebuild our house and now we have a happy\nHe draws the host and bold and bright colors or yellow orange blue and red Tom Bowman NPR News Rocco Syria [noise]\nA couple of years ago scientists announced that they had found the oldest evidence of life in rocks that are three point seven billion years old a separate group of researchers found that hard to believe they think that the rocks might just be old rocks NPR's Nell Greenfieldboyce reports\nWhen and how life emerged on our planet is a mystery but some fossils are incredibly old\nThe most widely agreed upon evidence for the earliest fossil life on earth is found out in Western Australia\nJoel Horowitz is a geo chemist at Stony Brook University in New York he says the rocks in Australia date back about three and a half billion years they contain cone shaped structures created by masses of microbes growing up from the floor\nWe're actually seeing sort of a total community that has basically been turned into a bunch of minerals\nBack in twenty sixteen researchers revealed they'd found similar minerals structures in Greenland\nThat was a real shocker because the rocks in Greenland we're even more ancient two hundred million years older and they'd been more cooked and tortured by geologic processes that should have destroyed any signs of life\nYou know my thought was boy someone should follow up on that [laughter]\nHer with than some colleagues did follow up and now in the journal nature they say there is no way these things are fossils a deeper look into the rock shows that the structures are really shaped like the cones that microbes would make\nInstead what they look like our for lack of a better word they kind of look like ... bars they're stretched out ridges that extend deeply into the rock\nThe scientists also studied the rocks chemical composition Abigail all would an astrobiologist at NASA's Jet propulsion lab she says they use the proto type of an instrument that NASA is planning to send to Mars to look for signs of ancient life\nShe says the chemistry of the Greenland rocks did not support the idea that microbes had left their mark\nIt playing and it's all good on income they have to stay in the\n... main such a law or not\nShe says if life could have gained a foothold so soon after the earth formed that would have suggested that life can arise and take hold quickly anywhere it's given half a chance\nNow the researchers who made the original claim about the Greenland rocks are vigorously disputing this new analysis they still maintain that they have found the world's oldest fossils so far relatively few scientists have studied these rocks that mean\nThey still maintain that they have found the world's oldest fossils so far relatively few scientists have studied these rocks that means it's a pretty sure bet that this won't be the last word Nell Greenfieldboyce NPR News [noise]\nAnd you're listening to NPR News I felt\nA hundred and Fifteen billion in a while and fierce rats are hurting often reporting from Brussels thank you sir oh You're welcome Mary Louise\nSo what would a hard Brexit means for the British and European economies had for the U.S\nGeorge Parker has written about this she was a political editor at the Financial Times joining us from Brussels where you're following those negotiations welcome back to the program polar if there were to be no deal at all what immediate changes would take effect on march twenty ninth when the u._k. leaves the well that could\nBe quite severe depends of ... kind of the deal we actually ended up with if it was a totally chaotic an acrimonious no deal where everybody ended up throwing places each other in person left to you in very but don't you and indeed than you could see some\nDale where everybody ended up throwing fights with each other in person left to you in very bad Dutch and indeed then you could see some very serious impacts of the border so you would have a immediately you'd have checks on old goods coming in and out of the u._k. which doesn't happen at the moment that will quickly to she's accused of the ports coming into person\nAnd very quickly the companies in person which rely on seamless flow of goods across the borders in Europe they would run out of ... trees were closed down\nOn the bank of England is focused this could be actually a very tail second damaging EPA say for the British economy which could last for months there's all sorts of contingency planning going on in the u._k. in case this happens talk of stockpiling of medicines there's the fresh food wrote could run out very quickly\nThere are ways you could try to mitigate the effects of that by having some sort of informal agreements but nevertheless if there's no deal a tool\nIt will be quite bad and the pursuit company will take a very big his\nSecret saying that in the worst case scenario there is a lack of food on the shelves the lack of medicine and pharmacies\nYeah I mean there's been some talk of stockpiling some certain types of medicines\nOnce you've ... the place where there are ... you can have she's running for miles and miles and miles twenty thirty mile keys things just wouldn't be coming through so so there are concerns that they will be shortages sent me in more distant ... from the port so pretty serious sets us in our heads of being considered by ministers\nWhen you look at the longer term economic impact what's the best than people have of what the effect would be\nWell the treasury UK treasury has made an estimate of what would happen in the medium to miss Britain was to leave without a deal and that would basically once the initial shock it cost you would end up with just a lot more bureaucracy and red type at the borders and that without to business costs\nYou will make it ... percent or less attractive place to invest because if you have less access to the European market the potential for terrorists as well so the Treasury's estimated that within about Fifteen Years UK economy would be about eight percent smaller than otherwise would it be in the case which is a pretty big\nHit as akin to sort of an aircraft crunchy losing height you wouldn't necessarily know to immediately but I have a time person will be a poor taste and otherwise it would be\nSo if those are the potential consequences for the u._k. what about for the rest of Europe if you have leaves with how to deal\nWith the rest of your this has always been something that the euro skeptics in person of clung to the idea that Europe wouldn't allow such a scenario to play out because person as a major destination for European exports so they were the ... effect on all manner of European produces whether it's um and they won produces in France cop she says in Germany\nOr you name it they ... they will be effective because UK off to breaks it will become the biggest single export destination for all the all the European Union countries\nBut the point is an asymmetric shock well it's true that the other European countries would suffer as a result of new deal the biggest loses will be the u._k.\nThe Brexit vote was more than two years ago and here we are less than six months from the deadline and does the idea of going crashing out without a deal now seem almost inevitable or this is sort of thing where you're only going to get a deal when you're pushing right up against it\nI think it's more a lot to be honest I I mean we all quite the Y. yes I think the wire will be really just before Christmas this year so there's another couple of months ago the differences between the two sides and not really as big as they are often presented a by the politicians\nThere was another potential problem which is that if the reason why the British prime minister doesn't deal in Brussels she then has to ... to have very divided policy back in London and I think she negotiating a deal inside the British Government could actually be the positive and negotiating a deal with our European partners so\nAnything could happen but I think my ... and still despite all the negative noises\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including ... robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\n...\n[noise] [noise]\nYou're listening to all things considered from NPR News\nWhen most people make a mistake they say\nI'm Sorry but what should accompany do when it makes a mistake a recent study looked at the economics of apologies Stacey Vanek Smith host of the podcast the indicator from Planet Money spoke with Benjamin whoa he's an economics professor at Vassar about why saying sorry is not as easy as it might seem\nYou did this like really really interesting study at the way to study apologies\nSo the study was partnered with Hoover can we look we focus on the Ninety five percent of lightness all the most extreme ... most late ride it was about five percent chance that you never come back to her again\nAnd the question is how can we repair this relationship how can repair said the trust between ... and its rider we tested different kinds of apologies\nAnd we found the right kind of apology could basically increase revenues by one to two percent\nBut the wrong kind of apology could decrease the revenues that went to two percent which we tested apologies and involved sort of commitments to do better or or not what we saw was that a commitment to do better in the future it's it doesn't seem to matter much right away but we track these writers for three months after the apology and we found that basically two or three months later these commitments have you been in the future\nActually backfired against the company\nI'm In part because you might commit to the future and then the ... you better because then maybe it's maybe for some of them had another bad experience and that as a result those those people punished you but more than than the control group that got no apology at all\nDid they ever have a good effect I'm not in our data so [laughter]\nI think they think they they temporarily had a good effect right but I think there's this idea that once you've apologized we're going to hold you to hire a higher standard and sort of by the end of the three months three months of observation it seemed like they either had no effect ... or or a negative effect\nIt is interesting that we expect remorse from a company like it's like minimizing human interaction yet still seems like we still want the same level of trust and accountability\nI think part of it is that our brains sort of works on script singer sticks and so you know when we enter in a relationship with a company we sort of like the same sort of scripts and risks triggering her brain and so because we expect remorse in real life we sort of expect it from a company\nSo what were the what would the apologies that really worked for ... like what was that magic\nThe magic was money [laughter]\nYeah um show me the money basically yeah yeah yeah um\nThat we tested apologies with or without a coupon and we we which and we found basically the most effective apology the ones who sort of increased revenues was a just a five dollar coupon\nWithin just money or with their certain language that people responded well to\nSo we were we were hoping to figure out the the best language but we found that there is no difference between the different languages money it seemed to be just money and in fact the message that she might may have backfired a bit with the message was sort of committed to be more in the future\nDo you think that's like carries over into personal relationships thing that I'm so sorry that I like whatever was late meeting for ten bucks [laughter]\nYou know here's a box of chocolates right or here's your letters and flowers oh eight flowers and candy take\nOn a whole new significance um did it hasn't changed the way like you apologize\n[laughter] people don't always wanted to ask you this question they do I'm curious I think the main way changes I because all my friends and my family know that I study apologies\nI think people thought oh it's wind up asking me this question how do I care is I think the main way changes that because all my friends and my family and do that I study apologies than they would always ... I might be skeptical whenever I Apologize so after like go an extra mile to sort of sound like Ernest insincere remorseful because people are always was like oh you're just doing that because of their paper\n[noise] no apologies for telling you that was professor Benjamin help speaking their Planet Money's Stacey Vanek Smith [noise]\nSupport from Planet Money comes from the alliance for lifetime income a nonprofit composed of financial services organizations working to educate Americans not options for securing protected lifetime income in retirement\nAlliance a lifetime income dot org [noise]\nYou're listening to all things considered from NPR News\nIs one of the most gratifying things in the world when you can not only have people support this radio station but support great causes as well we come together as a community everybody comes together and you make something happen\nAnd you know a job where you had to do it fast so that we could go back to doing what everybody loves the most and that's listening to you and the other folks on the round table in the morning we were able to do it in to gays and a couple of hours unbelievable\nAll of us collectively say thank you support for WAMC comes\nFrom Chester common table main street trust or Massachusetts\nLocally sourced comfort food beers whining cocktail why music every Friday Chester common table dot com [noise] the authors and kill music center at Skidmore College welcomes Carnegie Hall chamber music group ensemble connect tonight at seven o'clock with works by Brahms but getting Gabriel ... Smith\nSkidmore dot edu slash ... for\nThose who concrete specializing in hand crafted an environmentally sound concrete counter tops sings furniture or serve in the north east since two thousand one some countries are commonplace\nPoints reruns in Utica WAMC ... nine Kingston W O a storage de Ninety One seven Middletown WGLA Judy Ninety One nine Plattsburgh WC again ichi Ninety three three kinda G Harry W. A. N. C. H. D. one of those ... WAMC ... one of the five one grade Barrington W. W. E. S. H. D. eighty eight nine mount Kisco W. A.\nN. D. H. D. and not even one Stanford W a an art idiot five Brewster WAMC um fourteen hundred Albany\nSupport for WAMC comes from lake ... Ninety four old ... year old lanes ... Massachusetts peaches plums apples pumpkins apple cider homemade cider donuts pies pastries\nAnd parochial glum use well like if you weren't you adopt a community advocates for sustainable energy presuming that renewable energy and sustainable living there Saturday October twenty tend to forward don't steward school more information stop NY pipeline dot org [noise]\nRecently new details are emerging about how Jamal 'cause she'll be likely met his end of the Saudi consulate in Istanbul, Turkey will get\nThe latest on the investigation and look at what the international community could do to hold the Saudis accountable\nToday is Wednesday October seventeenth and this is all things considered from NPR News\nI'm Ari Shapiro and I'm Mary Louise Kelly this hour we'll visit Florida where people's recovering from hurricane Michael are asking\nWhether stronger building codes could have prevented some of the worst\nDamage has like somebody's trying to get in and the inside door was shaking I knew the rough I'd gone and I thought just hang in there and I have faith everything was going to be okay\nAnd in Boston Harvard students are divided over an admissions policy that's on trial this week\nGoing to be focused on ... like race ... create a third of division in Santa Fe city for the sake of ... a\nLess what does legal type in Canada I mean for the U.S border first listeners\n\nLive from NPR News in Washington I'm ...\nAfter turkey claims it has evidence that missing Saudi journalist ... was killed inside the Saudi counts within its didn't bowl U.S officials say they want a thorough investigation into what happened something us secretary of state Mike Pompeo made clear reporters during the refueling stop in Brussels today\nI'm convinced the Saudis understand that America is taking this seriously\nHopeful that the Saudis sacred to seriously they indicated to me yesterday that they would [noise]\nTime will certainly tell we'll get to see the investigation and we'll see the results\nPresident Trump meanwhile says he's asking turkey to provide audio or video to the U.S if it exists Trump says he's not sent the FBI since the journalist walk contributing comes to the Washington Post is not a U.S citizen president again called for Saudi Arabia and an important ally noting the country is a customer of US military exports\nDropped administrators and says America's greenhouse gas pollution fell by two points seven\nA customer of US military exports\nDropped diminished rations says America's greenhouse gas pollution felt like to point seven percent last year but as NPR's Scott Horsley explains the U.S still expected to fall well short of the climate goals that were set under former President Obama\nCoal fired power plants continue to lose ground in the U. S. to cheap natural gas and renewable energy the EPA says that help to reduce greenhouse gases from the electricity sector by four and a half percent last year but\nWhile smokestacks are getting cleaner tail pipes have not improved so much Kate Larson of the research firm ... group says it is right at the U.S is not likely to meet the pollution control targets needed to fight climate change\nShe like I ... and they had that ... ... and ... and the my jak cheating the larger heavier get off\nThe drop it in this race has announced plans to roll back Obama era fuel economy standards and withdraw the U.S from the Paris climate agreement Scott Horsley NPR News Washington\nA bomb blast killed an Afghan parliamentary candidate just days before elections are being held in that country Reuters reports the Taliban is claiming responsibility NPR's DSD reports from his Lama by the boneless\nConcealed in his ... in the campaign office of up to ... he was a candidate in uh southern Afghan province come on it's the seventh parliamentary can tend to to be killed in the militants tack\nAnother two have been abducted the Taliban and ISIS targeted candidates and rallies ahead Saturday's election most recently though with the bumped off at a political gathering it kills twenty two people\nI've gone security forces and the international community are under pressure to ensure that these elections are relatively peaceful there were seen as a driver on next year's presidential race ... date NPR News Islamabad\nUs home building slumped in September assigned rising mortgage rates are starting to weigh on the market the Commerce Department says housing starts fell to a seasonally adjusted annual rate of one point two million down from one point to seven million in August modest losses on Wall street today the Dow was down Ninety One points this is NPR\nSupport for NPR comments from NPR stations other contributors include progressive insurance comparing car insurance rates from multiple insurers so shoppers can evaluate options in one place now that progressive comparisons available at progressive dot com or one eight hundred progressive\nThis is WAMC regional News I'm Brian ... a new report finds that when it comes to the federal government New York gives more than it receives state comptroller Thomas dumb Applebee's those taxes paid by residents and businesses last year\nTotal about twenty four billion dollars more than the federal funds a lot of back to New York it's the third straight year that's happened in New York is one of eleven states with such an imbalance only New Jersey Connecticut and Massachusetts receive a smaller fraction of what they contribute to Washington\nA capital region Boy Scouts organization has sold or former camp once in line to be purchased by a Saratoga county town WAMC Lucas Willard reports\nA one million dollar deal to sell camp boy haven to the town of Milton fell apart earlier this year twin rivers council selected Milton as a potential buyer with hopes that the three hundred acre Cub Scout camp would be preserved as a passive recreation park\nThis week twin rivers announced it had closed on the property with John month or senior a conservation oriented philanthropist based in middle grove\nMonitor also served as board chair for Saratoga plan which works on preservation in the county when rivers counseled did not disclose details of the sale Lucas Willard WAMC news\nMassachusetts Republican governor Charlie Baker and his Democratic challenger Jay Gonzalez will face off in their second debate tonight we our lungs\nNews Massachusetts Republican governor Charlie Baker and his Democratic challenger Jay Gonzalez will face off in their second debate tonight the hour long session in Boston will air live at seven O W GBH television at W. GBH them\nAlong with public TV station WG B. Y. in Springfield the weather forecast a cold night tonight cloudy Wendy some scattered rain showers a few snow showers\nPossible over the mountains upper twenties so low thirties sunny tomorrow in the mid forties sunny breezy milder friday they do offer fifties right now beginning to end it's cloudy and forty five\nAdams, Massachusetts forty three rummy or cloudy forty seven Albany cloudy it's forty eight degrees WAMC news five thirty I'm Brian shields WAMC [noise]\n\nFrom NPR News this is all things considered I'm Ari Shapiro and I'm Mary Louise Kelly how much of the blame for what ever happened to Jamal 'cause she'll ... should land at the feet of Saudi crown prince Mohammed bin Salman\nIs is a key question in the disappearance it appears to likely murder of the dissident Saudi journalist Turkish officials have identified Fifteen men who they say were present at the Saudi consulate in ... the day that cause she'll she disappeared\nThe New York times has now linked several of those men to bin ... security detail and to been online and self Maliki brown is one of the journalists on that times story he joins me now and I should warn listeners some of the details that we may be about to discuss maybe ... brown welcome\nThank you Mary Louise lay out first how you made these links you were coming through publicly available records also coming through photographs doing what just trying to match face to face\nUm yeah we were doing the matching names I'm trying to find social media profiles a finding email addresses and phone numbers that were related to these people through a phone databases\nThat allow us to see how their phone numbers are are saved in um in various different ups\nUm and then you know link using those email addresses and phone records phone records are finding social profiles that are registered using a those numbers and addresses are looking at the biographical details that are um those people shared\nUm and then we also you know we had information that several of them in a word in the royal guard on so we reached traits um I'm up in Solomon's movements over the past year or two um and yeah I just can't like lots of archival reports\nLots of archival reports and lots of archival photos you published several of those photos of one of the Fifteen men who appears to be a frequent traveler companion at the crown prince who is a\nFuss right ... I mean he's a he worked in London in two thousand and seven I'm as an intelligence officer for the bus for their um we understand from ... ah information published by the Washington Post as well that\nHe um he went on to when I'm training as an intelligence officer or a security officer\nAnd he's in his own there after he's been photographed or the printed side on visits this year to the U.S to Houston to Boston to the U.N General assembly I mean that was just three weeks ago\nFulton County tourism in the southern Adirondacks fart forty four legs forty four choices Dial M for murder through October twenty first October calendar at forty four legs dot com\nThe chasing comedies engineering consulting serving municipalities education and healthcare developers and industries of the greater Hudson Valley in North country for Seventy years chasing comedies dot com\nThe weather forecast a cold night tonight freeze warnings along the Hudson Valley cloudy and Wendy's scattered rain showers and snow showers across the mountains is temperatures drop into the twenties and lower thirties lots of sunshine tomorrow breathing in the mid forties another sunny day friday\nBreezy a bit milder into the fifties Saturday cloudy some scattered showers in the fifties comic line is always open its toll free it's eight hundred six nine five nine one seven zero WAMC listener comic line eight hundred six nine five nine one seven zero twenty minutes after five o'clock\n\nSupport for NPR comes from the station and from fidelity investments taking a personalized approach to helping clients grow preserve and manage their wealth learn more infidelity dot com slash wealth fidelity brokerage services sellouts see\nFrom logged me in makers of go to meeting a collaboration meeting platform that comes equipped with features to help people stay focused to get work done learn more it go to meeting dot com\nAnd from that sustaining members of this NPR's\nStay focused to get work done learned more it go to meeting dot com and from that sustaining members of this NPR station\nFrom NPR News this is all things considered I'm Ari Shapiro and I'm Mary Louise Kelly and as of today marijuana is\nLegal throughout Canada which raises a question what happens when Canadians want to enter the U.S given that marijuana is illegal in the U.S under federal law yesterday customs and border patrol official Todd oh and held a conference call with reporters who had a whole lot of questions such as this one\nIs it possible to be not let into the states by saying yes I did smoke a joint has smoked in the past\nYes admission of illegal drug use our arms around you found in the midst of all in the United states so yes that's possible\nReporters posed many scenarios and Owens answers were largely the same\nThat border agents have wide discretion and decisions will be made on a case by case basis we reached out to Lynn Saunders he's an immigration attorney in Washington state and he has clients who've been denied entry into the U.S because of past cannabis use when founders welcome to the program thank you for having me on who you\nListen to that whole conference call yesterday what struck you\nWell what struck me was even though it was the day before legalization of cannabis in Canada CBP still has not given a straight answer on whether they will admit to the United states Canadians who admit to purchasing and using cannabis legally in Canada as of today\nTo be crystal clear on what the situation is and maybe that's part of the challenges are talk crystal clear at the situation is here but there's going to be huge discretion given to individual border agents to decide how they want to proceed\nBottom line if somebody has smoked pot legally in Canada that's going to be an issue for them when they're if they're asked about it and trying to come into the U.S\nAbsolutely because even though it's legal in Canada and legal in Washington state where my office says the officer has the discretion to determine that the individual could be a drug user or an abuser and denied the matrix based upon that\nJust to parse this out there would be an issue about whether they have used marijuana even if they were using it in a place that was ... there would be questions potentially being asked if they have ever used marijuana and that can be grounds for burning somebody from coming into the U.S\nAbsolutely and a great example is prime minister Trudeau he has admitted very publicly or in the past so he has used cannabis prior to legalization so he could be denied entry into the United states when he's no longer prime minister because right now he has a diplomatic passport\nAnd be deemed in admissible even though it's legal as of today in Canada\nAnd again just to try to drill down on this we're talking about a situation where it's legal in Canada it's legal under where you are in Washington state under state law but because federal us federal law prevails at the border that's where we have the sticking point\nExactly and it's kind of a hypocritical situation by the federal government where they've taken a hands off approach to states legalizing marijuana like Washington state but they use the full force of the U.S government and immigration laws to keep out undesirable\nYou know people who have used cannabis whether it's legal or not in Canada\nI suppose from the sea BP's point of view they don't make federal law they're tasked with enforcing federal law at the border and marijuana is illegal under federal law taking that what do you think that they should be saying what role should be put in place that would make the situation of less chaotic going forward\nWhile I think the federal government has to have some commonsense so they need to have a consistent approach with the enforcement of federal laws either outlawed in every state and be consistent with what you're doing\nHave a consistent approach with the enforcement of federal laws either outlawed in every state and be consistent with what you're doing at the border or\nDo what you're doing at the border with what you've done in many states which should take a hands off approach unless it comes to your attention and you have let's say you know a huge amount of contraband on your vehicle around you who cares if a Canadian admit that they use marijuana legally in Canada who cares\n... he's an immigration attorney in between Washington talking about the legalization of marijuana today in Canada and problems that might cause at the U.S Canada border Mr ... thanks for your time thank you very much\nThe state of Florida has some of the nation's toughest building codes at least most of the state\nThe rules are less stringent in the panhandle that's where Mexico beach is and that's where hurricane Michael made landfall with one hundred fifty five mile an hour wins a week ago entire blocks were flattened NPR's Greg Allen reports many are now calling for revised stricter building codes on Florida's panhandle\nIn Mexico beach Lance Irwin is one of the lucky ones his house is still standing he rode out the storm in his home several blocks from the beach\nThat arrived or shake somebody's trying to get in and they tried door was shaking I knew there were had gone at that point because everything was shaking I thought\nJust hang in there and I said everything was going to be OK Irwin last\nDoors windows part of his roof but his home is largely intact the same can't be said for many other residents Mexico beaches Mayer says Seventy five percent of the town is gone\nThe storm surge washed houses on the beach off their foundations to the other side of the coastal road\nHigh winds lifted off roofs and knocked down walls quite a few gates is the former head of FEMA and a long time urgency management official in Florida he points to one reason for the extreme destruction in Mexico beach and other communities in the panhandle in many cases gets old construction that predates the building code\nAnd this is a part of Florida that's what I call the ... floor on a bunch of high rises out a lot of construction this is all generational of Florida families than any of them or just said that Trump folks that fish the area's\nAfter Hurricane Andrew in Nineteen Ninety to Florida took a hard look at his building codes in South Florida Miami Dade in Broward County is adopted strict standards requiring storm shutters and reinforced concrete block construction for all buildings structures must be able to withstand winds up to one hundred and Seventy five miles per hour\nSeveral years later Florida revised it's state wide building code John ... a structural engineer in Miami says officials decided not to require South Florida is one hundred and Seventy five miles per hour winds speed standard throughout the state\nUnfortunately because it is based on probability of storms in the past and all of that is sort of a goes down as you go further north in Florida\nHistorically there have been fewer intense hurricanes in the panhandle but elsewhere in the state and some north Florida communities new construction you'd only withstand wind speeds one hundred and thirty miles per hour or less far below the one hundred and fifty five mile per hour winds scene in hurricane Michael\nIn the aftermath of the storm as local state and federal officials assess the damage a consensus is emerging that building codes along Florida's panhandle need to be stricter\nDavid provide is a professor of civil engineering at the University of Florida he's part of a team that's been the weekend on the panhandle gathering data on Michael's impact\nWhat we were damage to pretty much all types of construction all types of materials and all types of what was not damaged houses that were well engineered\nFormer FEMA ahead Craig Fugate has long believed wind speeds standards along Florida's panhandle were too low he says when policymakers develop them they left out information about a powerful hurricanes that hit the area in the nineteenth\nLeave the wind speed standards along Florida's panhandle were too low he says when policymakers develop them they left out information about a powerful hurricanes that hit the area in the nineteenth century before accurate record keeping\nIt yeah that store back in and out particularly yet Michael back in is going to force a much higher global warming or the coast well inland based on those two storms\nFlorida's building commission is now in the process of revising the state code and as a wedding recommendations from the University of Florida team led by David provide provide says understanding how to build resilience structures is just the first step\nWe know what can be done it has been proven over such as it is way the community is willing to adopt it or not\nRealtors home builders the insurance industry and many others will have a voice as Florida considers how to prepare the panhandle for the next storm like hurricane Michael ... NPR News Mm Mm\nThis is NPR News but I felt shot\nCruising is an acquired taste people respect him as a conservative fighter they don't necessarily like him they gave Rourke a luck\nBut Democrats have to recognize that competitiveness is a decade or two decades out it's not two years if not for years is longer than that because demographic change is very slow\nBetter work will appear in an hour long CNN town hall event tomorrow evening and my cow I'm On the Texas border Ted Cruz declined to participate so ... through the voters' questions himself Wade Goodwyn NPR News\nHarvard is defending its admissions policy in uh Boston courtroom this week the question is whether the school discriminates against Asian American applicants the case could go to the Supreme Court with broad implications for affirmative action and schools\nYesterday we spoke with an Asian American student who believes Harvard should consider factors including race ... has the opposite view she is also the daughter of Asian immigrants and she's a junior at Harvard welcome to all things considered\nGreat thanks for having me\nWhy do you believe Harvard's admissions policy needs to change\nI think race nearly treats and illusion of diversity and I'd love to see admissions policies change not to have racing it\nNow Harvard says when they do consider race it's one of many factors that they consider it's complicated role in student's life experiences would you like to see race just totally omitted from a list of factors that Harvard is considering one at assesses the students qualifications\nYeah I think so because when it comes down to it rains just sort of something that is becoming not just merely factor but oftentimes the factory that decision is based on\nI think Harvard is saying that they don't do that but what ... missions has been showing in the past few days and has really brought to light is that oftentimes is the single race factor that comes down to ensure catching\nStudents don't there's missions as a group that brought this lawsuit we should say\nYes yep and I think it's scary to see this repeating in history because back in the Nineteen twenties Harvard sort of did this with Jewish applicants as well and sort of use of personal rating to artificially keeping them very slow around although there is going higher and everything else similar to what's happening with Asian American trait now\nSome supporters of Harvard in this case have alleged that the group that brought this suit is using Asian Americans almost at the front trying to drive a wedge among minority groups\nAnd that at the end of the day this lawsuit if it goes to the Supreme Court and a successful is really likely to help white people more than any other racial group what do you think of that argument\nI don't think that that should all clearly affirmative action has failed in at school right now it's instead discriminated against Asian Americans under the guise of diversity and I think this is a critical time to reevaluate how formative action policies are impacting different communities\nI'd like you to respond to something that Harvard senior Sally Chen said to us on the program yesterday she plans to testify for Harvard at the trial here was part of our conversation\nMerit means nothing without context the kinds of barriers that people face and the kinds of the way that they overcome and work despite these very I think is really important to how we're thinking about the ways in which people can succeed and can lead merit means nothing without context what do you think of that idea\nSo I think that a lot of admissions process there should be based on just married but I come from the inner city public high school background and I do recognize that marriage does need to be put in context\nShould be based on just married but I come from an inner city public high school background and I do recognize that marriage does need to be put in context sometimes what recharged as an opportunity people have available to them it's really important\nBut I think that when we look at it we shouldn't just be looking at net in the context of race but again like I said married in the context as economic status or something that\nSpeaks more to someone's opportunities and resources is really important and\nIt sounds like you both agree that there are things about a person's application that cannot be quantified in grades and test scores you just disagree about whether that list of things includes race or not\nYeah I Would agree with that I Would say that\nAll of that sort of have the same goal of diversity on a college campus whatever sort of benefits that are but we just don't believe that we have to resort to ... admissions 'em and instead focus on something like poverty\nBecause when we focus on something like race I think it creates a sort of division and sort of diversity for the sake of diversity and I think chief justice John Roberts said it best when he said the only way to stop discrimination on the basis of race it's a start discriminating on the basis of race\nWell tell me about ... thank you so much for talking with us today Thanks for having me\nShe's a junior at Harvard and you are listening to all things considered from NPR News next month's thirty six states\nWill elect a governor nine of those races where Republicans are in office are so competitive some analysts say they're a toss up even though a Republican in office now the winner could come from either party\nOne example Iowa where the Republican governor can't seem to ... past her democratic challenger here's Clay Masters of Iowa Public radio [noise]\nThere was barbecue and live music harvest seemed fundraiser Iowa's Republican governor Kim Reynolds this weekend and more for the kids there were balloon animals and face painting White House press secretary Sarah Sanders was the keynote speaker\nFor taking to the podium she signed autographs to\nOut the\nDinners the daughter of former Arkansas governor Mike Huckabee surprised they need to keep the the top officer in Republican control\nTrust me I've seen one little girl Democrat running the state looks like remember I'm from Arkansas and I lived under the Clinton for a long time\nThis is the first time Reynolds has run for the office she ... she was lieutenant governor and took over for former Governor Terry Branstad when he became US ambassador to China last year Reynolds tells the budget surplus of one hundred and twenty seven million dollars and a state unemployment rate of two and a half percent as a couple of reasons voters should keep her as governor that\nResonates with Carol ... Burlington who was at the fundraiser registered Democrats thinks Republican policies are working\nWith rent and we would have stayed within two if he hadn't gone to China were staying with him we think he was caring for this\nAs we know stepped out of the shadows of her predecessor she's walked into the light of president Donald Trump last week she appeared on stage with the president in front of a packed arena in Council Bluffs Iowa and praised him\n\n\n[noise]\nDemocrats here are hoping governor Reynolds close alignment with the president works in their favor immediate effects of Trump's tariffs have not been good for farmers and while Iowa when big for President Trump twenty sixteen two years later with less than stellar approval ratings in the state Democrats see an opportunity there Kennedy is ...\nWhen big for President Trump and twenty sixteen two years later with less than stellar approval ratings in the state Democrats see an opportunity there Kennedy is Fred Hubble the former board member of Iowa's Planned Parenthood has some name recognition in the state he's a wealthy retired businessman it is getting help from Democrats all over the country\nTo things over here for just right\nNumber one friend who is going to be there you go\nThat's Washington's governor Jay Inslee he's the chair of the Democratic Governors Association and is talking with volunteers getting ready to knock doors in the small Iowa college town of ... [noise]\nA Donald Trump is just a blip in history and we're going to rescue this country are you started right\nAnd polls show the rate is close between Hubble and Reynolds Hubble has spent millions of his own dollars on his campaign which has primarily focused on what he sees as Reynolds mismanagement of Medicaid and the state budget\nWe shouldn't be taking money out of education the health care out of public safety odd about judicial system and then come up with a budget surplus that was a lot bigger than they thought it was and they can't explain why\nArtist in democratic volunteer Tara Shukla Jones says she's voting for Hubble even though he wasn't her first pick in the primary\nToning stretching is not really in that you [noise] it doesn't always make you feel like if you don't do that for a long time there from science so no I think that standard\nChoice for governor with early voting underway some Iowans have already cast their decision in a contest that quickly become one of the country's most competitive governors races for NPR News I'm Clay masters in Des Moines [noise]\nYou're listening to all things considered from NPR News\nThis is a WAMC business update I'm Jim ... is\nOn Wall street the Dow last Ninety One to twenty five thousand seven hundred six the S. and P. five hundred dropped less than a point to two thousand eight hundred nine and the NASDAQ shed too to seven thousand six hundred forty to\nWarren Buffett one of the world's wealthiest business leaders joined the c._e._o. of St Peter's health partners the largest healthcare system in New York's capital region for a discussion about the economy and health care today\nDr James Reed also chairs the medical liability mutual insurance company which buffets Berkshire Hathaway recently acquired\nBuffett discuss why his company obtained the largest underwriter of medical professional liability insurance in New York\nThe idea of having a partnership\nWith somebody that has a list of resources and we'll pay for something as appropriate but also defend the physician or even if it of course that's economically as the settler because some lawyers once I got to move on", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Albany", "day": "17", "locations": [["Utica", 5.16977, -74.50134], ["Albany", 42.65258, -73.75623], ["U.S", 39.828306, -98.5795], ["Istanbul", 41.01384, 28.94966], ["Raqqa", 35.95283, 39.00788], ["Washington", 38.89511, -77.03637], ["Istanbul", 41.01384, 28.94966], ["Saudi Arabia", 25.0, 45.0], ["turkey", 39.0, 35.0], ["Saudi Arabia", 25.0, 45.0], ["Florida", 28.75054, -82.5001], ["Florida", 28.75054, -82.5001], ["Virginia", 38.34982, -81.63262], ["Jackson County", 32.29876, -90.18481], ["Florida", 28.75054, -82.5001], ["Panama City", 8.9936, -79.51973], ["bay county", 43.59447, -83.88886], ["New York", 40.71427, -74.00597], ["U.S", 39.828306, -98.5795], ["turkey", 39.0, 35.0], ["U.S", 39.828306, -98.5795], ["turkey", 39.0, 35.0], ["Saudi Arabia", 25.0, 45.0], ["Turkey", 39.0, 35.0], ["Saudi Arabia", 25.0, 45.0], ["Us", 45.99696, -118.49854], ["Turkey", 39.0, 35.0], ["Saudi Arabia", 25.0, 45.0], ["Istanbul", 41.01384, 28.94966], ["turkey", 39.0, 35.0], ["Saudi Arabia", 25.0, 45.0], ["Washington", 38.89511, -77.03637], ["Turkey", 39.0, 35.0], ["U.S", 39.828306, -98.5795], ["Saudi Arabia", 25.0, 45.0], ["Albany New York", 42.65258, -73.75623], ["Syria", 35.0, 38.0], ["U.S", 39.828306, -98.5795], ["Syria", 35.0, 38.0], ["U.S", 39.828306, -98.5795], ["Syria", 35.0, 38.0], ["U.S", 39.828306, -98.5795], ["the United Arab Emirates", 25.22231, 55.17181], ["Saudi Arabia", 25.0, 45.0], ["Lebanon", 33.83333, 35.83333], ["New York", 40.71427, -74.00597], ["Australia", -25.0, 135.0], ["Greenland", 72.0, -40.0], ["Greenland", 72.0, -40.0], ["Brussels", 50.85045, 4.34878], ["U.S", 39.828306, -98.5795], ["Brussels", 50.85045, 4.34878], ["UK", 3.51342, -132.1875], ["Britain", 41.66121, -72.77954], ["UK", 3.51342, -132.1875], ["France", 46.0, 2.0], ["Germany", 51.5, 10.5], ["UK", 3.51342, -132.1875], ["Brussels", 50.85045, 4.34878], ["London", 51.50853, -0.12574], ["Hoover", 33.40539, -86.81138], ["Massachusetts", 42.36565, -71.10832], ["Utica", 5.16977, -74.50134], ["Albany", 42.65258, -73.75623], ["Massachusetts", 42.36565, -71.10832], ["Istanbul", 41.01384, 28.94966], ["Turkey", 39.0, 35.0], ["Florida", 28.75054, -82.5001], ["Santa Fe", -31.64881, -60.70868], ["Canada", 60.10867, -113.64258], ["U.S", 39.828306, -98.5795], ["Washington", 38.89511, -77.03637], ["turkey", 39.0, 35.0], ["U.S", 39.828306, -98.5795], ["Brussels", 50.85045, 4.34878], ["America", 39.828306, -98.5795], ["turkey", 39.0, 35.0], ["U.S", 39.828306, -98.5795], ["U.S", 39.828306, -98.5795], ["Saudi Arabia", 25.0, 45.0], ["US", 45.99696, -118.49854], ["America", 39.828306, -98.5795], ["US", 45.99696, -118.49854], ["America", 39.828306, -98.5795], ["U.S", 39.828306, -98.5795], ["the U. S.", -14.60485, -57.65625], ["U.S", 39.828306, -98.5795], ["Obama", 17.04483, -61.86117], ["U.S", 39.828306, -98.5795], ["Paris", 48.85341, 2.3488], ["Washington", 38.89511, -77.03637], ["Us", 45.99696, -118.49854], ["New York New York New York", 40.71427, -74.00597], ["Massachusetts", 42.36565, -71.10832], ["Washington", 38.89511, -77.03637], ["Saratoga county", 43.08313, -73.78457], ["Massachusetts", 42.36565, -71.10832], ["Massachusetts", 42.36565, -71.10832], ["Boston", 42.35843, -71.05977], ["Springfield", 39.80172, -89.64371], ["Adams", 39.83665, -105.0372], ["Massachusetts", 42.36565, -71.10832], ["Albany", 42.65258, -73.75623], ["Jamal", 29.6498, 70.52857], ["New York", 40.71427, -74.00597], ["London", 51.50853, -0.12574], ["U.S", 39.828306, -98.5795], ["Houston", 29.76328, -95.36327], ["Boston", 42.35843, -71.05977], ["Fulton County", 33.73119, -84.38324], ["marijuana", 32.39988, -107.11626], ["Canada", 60.10867, -113.64258], ["U.S", 39.828306, -98.5795], ["marijuana", 32.39988, -107.11626], ["U.S", 39.828306, -98.5795], ["the United states", 39.828306, -98.5795], ["Washington", 38.89511, -77.03637], ["U.S", 39.828306, -98.5795], ["Canada", 60.10867, -113.64258], ["Canada", 60.10867, -113.64258], ["U.S", 39.828306, -98.5795], ["Canada", 60.10867, -113.64258], ["Washington", 38.89511, -77.03637], ["marijuana", 32.39988, -107.11626], ["marijuana", 32.39988, -107.11626], ["U.S", 39.828306, -98.5795], ["the United states", 39.828306, -98.5795], ["Canada", 60.10867, -113.64258], ["Canada", 60.10867, -113.64258], ["Washington", 38.89511, -77.03637], ["marijuana", 32.39988, -107.11626], ["Washington", 38.89511, -77.03637], ["U.S", 39.828306, -98.5795], ["Canada", 60.10867, -113.64258], ["marijuana", 32.39988, -107.11626], ["marijuana", 32.39988, -107.11626], ["Canada", 60.10867, -113.64258], ["Washington", 38.89511, -77.03637], ["marijuana", 32.39988, -107.11626], ["Canada", 60.10867, -113.64258], ["U.S", 39.828306, -98.5795], ["Canada", 60.10867, -113.64258], ["Florida", 28.75054, -82.5001], ["Mexico beach", 18.00202, -87.91274], ["Florida", 28.75054, -82.5001], ["Mexico", 23.0, -102.0], ["Mexico", 23.0, -102.0], ["Florida", 28.75054, -82.5001], ["Mexico", 23.0, -102.0], ["Florida", 28.75054, -82.5001], ["Florida", 28.75054, -82.5001], ["Florida", 28.75054, -82.5001], ["Broward County Florida", 26.23786, -80.12477], ["Miami Florida Florida Florida Florida Florida Florida Florida", 25.8576, -80.27811], ["Cruising", -33.87436, 151.23377], ["Texas", 31.25044, -99.25061], ["Boston", 42.35843, -71.05977], ["Iowa", 42.00027, -93.50049], ["Iowa", 42.00027, -93.50049], ["barbecue", 18.36599, -77.55179], ["Iowa", 42.00027, -93.50049], ["Arkansas", 34.75037, -92.50044], ["Arkansas", 34.75037, -92.50044], ["US", 45.99696, -118.49854], ["China", 35.0, 105.0], ["China", 35.0, 105.0], ["Iowa", 42.00027, -93.50049], ["Iowa", 42.00027, -93.50049], ["Washington", 38.89511, -77.03637], ["Iowa", 42.00027, -93.50049], ["Des Moines", 41.60054, -93.60911], ["New York's New York", 40.77205, -73.93014]], "not_found": ["Brexit", "Canada CBP", "Nineteen Ninety"], "ep_coords": ["Albany, NY", 42.65258, -73.75623], "in_country": ["Albany", "U.S", "Washington", "Florida", "Florida", "Virginia", "Jackson County", "Florida", "bay county", "New York", "U.S", "U.S", "Us", "Washington", "U.S", "Albany New York", "U.S", "U.S", "U.S", "New York", "U.S", "Britain", "Hoover", "Massachusetts", "Albany", "Massachusetts", "Florida", "U.S", "Washington", "U.S", "America", "U.S", "U.S", "US", "America", "US", "America", "U.S", "U.S", "U.S", "Washington", "Us", "New York New York New York", "Massachusetts", "Washington", "Saratoga county", "Massachusetts", "Massachusetts", "Boston", "Springfield", "Adams", "Massachusetts", "Albany", "New York", "U.S", "Houston", "Boston", "Fulton County", "marijuana", "U.S", "marijuana", "U.S", "the United states", "Washington", "U.S", "U.S", "Washington", "marijuana", "marijuana", "U.S", "the United states", "Washington", "marijuana", "Washington", "U.S", "marijuana", "marijuana", "Washington", "marijuana", "U.S", "Florida", "Florida", "Florida", "Florida", "Florida", "Florida", "Broward County Florida", "Miami Florida Florida Florida Florida Florida Florida Florida", "Texas", "Boston", "Iowa", "Iowa", "Iowa", "Arkansas", "Arkansas", "US", "Iowa", "Iowa", "Washington", "Iowa", "Des Moines", "New York's New York"], "out_country": ["Utica", "Istanbul", "Raqqa", "Istanbul", "Saudi Arabia", "turkey", "Saudi Arabia", "Panama City", "turkey", "turkey", "Saudi Arabia", "Turkey", "Saudi Arabia", "Turkey", "Saudi Arabia", "Istanbul", "turkey", "Saudi Arabia", "Turkey", "Saudi Arabia", "Syria", "Syria", "Syria", "the United Arab Emirates", "Saudi Arabia", "Lebanon", "Australia", "Greenland", "Greenland", "Brussels", "Brussels", "UK", "UK", "France", "Germany", "UK", "Brussels", "London", "Utica", "Istanbul", "Turkey", "Santa Fe", "Canada", "turkey", "Brussels", "turkey", "Saudi Arabia", "the U. S.", "Obama", "Paris", "Jamal", "London", "Canada", "Canada", "Canada", "Canada", "Canada", "Canada", "Canada", "Canada", "Canada", "Canada", "Mexico beach", "Mexico", "Mexico", "Mexico", "Cruising", "barbecue", "China", "China"], "in_state": ["Albany", "New York", "Albany New York", "New York", "Albany", "New York New York New York", "Saratoga county", "Albany", "New York", "New York's New York"], "out_state": ["Utica", "U.S", "Istanbul", "Raqqa", "Washington", "Istanbul", "Saudi Arabia", "turkey", "Saudi Arabia", "Florida", "Florida", "Virginia", "Jackson County", "Florida", "Panama City", "bay county", "U.S", "turkey", "U.S", "turkey", "Saudi Arabia", "Turkey", "Saudi Arabia", "Us", "Turkey", "Saudi Arabia", "Istanbul", "turkey", "Saudi Arabia", "Washington", "Turkey", "U.S", "Saudi Arabia", "Syria", "U.S", "Syria", "U.S", "Syria", "U.S", "the United Arab Emirates", "Saudi Arabia", "Lebanon", "Australia", "Greenland", "Greenland", "Brussels", "U.S", "Brussels", "UK", "Britain", "UK", "France", "Germany", "UK", "Brussels", "London", "Hoover", "Massachusetts", "Utica", "Massachusetts", "Istanbul", "Turkey", "Florida", "Santa Fe", "Canada", "U.S", "Washington", "turkey", "U.S", "Brussels", "America", "turkey", "U.S", "U.S", "Saudi Arabia", "US", "America", "US", "America", "U.S", "the U. S.", "U.S", "Obama", "U.S", "Paris", "Washington", "Us", "Massachusetts", "Washington", "Massachusetts", "Massachusetts", "Boston", "Springfield", "Adams", "Massachusetts", "Jamal", "London", "U.S", "Houston", "Boston", "Fulton County", "marijuana", "Canada", "U.S", "marijuana", "U.S", "the United states", "Washington", "U.S", "Canada", "Canada", "U.S", "Canada", "Washington", "marijuana", "marijuana", "U.S", "the United states", "Canada", "Canada", "Washington", "marijuana", "Washington", "U.S", "Canada", "marijuana", "marijuana", "Canada", "Washington", "marijuana", "Canada", "U.S", "Canada", "Florida", "Mexico beach", "Florida", "Mexico", "Mexico", "Florida", "Mexico", "Florida", "Florida", "Florida", "Broward County Florida", "Miami Florida Florida Florida Florida Florida Florida Florida", "Cruising", "Texas", "Boston", "Iowa", "Iowa", "barbecue", "Iowa", "Arkansas", "Arkansas", "US", "China", "China", "Iowa", "Iowa", "Washington", "Iowa", "Des Moines"]}, {"month": "10", "state": "NY", "station": "WAMC", "content": "Up\nSupport for the academic robot comes from university at Albany now offering graduate programs in electrical and computer engineering Albany dot edu slash graduate for information Woodstock art exchange and blown glass and sculpture\nCurated find exhibits from artist makers throw up New York state and beyond route twenty eight ... Facebook or Woodstock art exchange dot com\nDr ... regime and stop us from plaza Albany New York ... serving the community since Nineteen eighty nine five one eight forty\nNine for nine for\nThey do now for all things considered support comes from the ... public library district coordinating me twenty eight teams are going to be a big read offering films discussions art\nAnd virtual visit with author Celeste feel K. L. I. B. dot org Bard College master of arts and teaching program offering full important time master's degrees with teacher certification now accepting applications teaching what matters\nBar dot edu slash image to slash and why\nDr Lucy ... from New York a plastic surgeon dedicated to studying cosmetic surgery procedures including head to toe skim type thing was to make sure that transfers facial rejuvenation since Nineteen Ninety six eight seven eight six Seventy [noise]\n\nThis is Northeast Public radio WAMC F.\nM. H. D. Ninety point three Albany W are you any ... W am cage the nine point nine Kingston W. O. R. H. D. Ninety One seven Middletown double UCLA HD Ninety One nine Plattsburgh WC a an HD Ninety three three Kennedy Harry W. A. N. C. H. D. one oh three nine tie kinda Rogan WAMC wage do you want to buy\nOne great Barrington W W E S H da da da da and Z HD Ninety point one Stanford W ANR eighty five Brewster and WAMC am fourteen hundred Albany\nLive from NPR News in Washington I'm Lakshmi sang pressure is building on the Trump Administration to respond more forcefully to the disappearance and suspected murder of Washington Post columnist or ... a U.S resident\nHe was last seen alive walking into a Saturday consulate in Istanbul weeks ago secretary of state Mike Pompeo says the Saudis need time to explain Here's NPR's Mara Liasson\n... met with the president at the White House and told him about his meetings with Turkish and Saudi officials ... said the U.S takes this very seriously and expects the Saudis investigation of themselves to be completed in quote a timely fashion\nBut ... also stressed that Saudi Arabia was an important ally and suggested that there might be no consequences it all\nWe ought to give them a few more days to complete that so that we do have a complete understanding of the facts surrounding that which one we can make decisions about how for the United states should respond\nTo show jeeze family is calling for an independent investigation and there is mounting evidence that the men involved in the show genes alleged murder and dismembered meant we're close to the Saudi crown prince Mara Liasson NPR News the White House\nTreasury secretary Steven Mnuchin is the latest high profile gas to bow out of Saudi Arabia is upcoming investment conference that much more unsettling for an already shaky us market or major indices are down one point two percent to over two percent but economist Mark Zandi says there are other factors in this\nConfluence of things things without bothering investors will at past couple of weeks the higher interest rates prospects but the Federal Reserve will continue to push retire overvalued stocks the people are nervous that the stock market has come too far too fast and of course there's a trade war ah that's escalating with China and that's not good news\nThat smart Sandy of Moody's Analytics President Trump is threatening to\nOf course there's a trade war ah that's escalating with China and that's not good news\nThat smart Sandy of Moody's Analytics\nPresident Trump is threatening to direct the military to close the southern us border with Mexico as tens of thousands of Central American migrants have been attempting to cross to Mexico and then the U.S and its tweet today Trump urged Mexico to do something large number of incoming Hondurans Salvadorans Guatemalans\nFlorida officials are adjusting election rules because of hurricane Michael NPR's Debbie Elliott has details\nWith entire towns devastated and still without power less than three weeks from the mid term election Florida is relaxing rules to allow for extended early voting and easier vote by mail option\nRepublican governor Rick Scott who is running for US Senate approved the changes with an executive order and allows locally elected supervisors of elections to add more early voting locations\nAnd keep early voting open until election day arrives on November six normally early voting clouded the weekend before the election they order out that directs local officials to make sure that emergency responders and people\nWho evacuated had a way to cast a ballot the panhandle typically vote heavily Republican that steady Elliott this is NPR\nSupport for NPR comes from Fidel itty investments taking a personalized approach to helping clients grow preserve and manage their wealth learn more at fidelity dot com slash wealth finality brokered services El Al ... and Americans for the arts at Americans for the arts dot org [noise]\nAirports and rising seas I'm Randy Simon the desert was looking at are changing environment [noise] there are many low lying coastal airports around the world is airports are increasingly vulnerable to the rising sea levels and the more extreme weather brought about by climate change\nAccording to two recent analyses twenty five percent of the world one hundred\nBusiest airports are less than thirty two feet above sea level\nTwelve movies including airports in New York San Francisco Roman Shanghai or less than sixteen feet above sea level\nLow lying regions near water of always been viewed as ideal sites runways since there are fewer obstacles and neighbors but the coasts doesn't provide much in terms of natural protections from flooding or high wins most airports were not designed with the effects of climate change your mind\nTravelers that comes on the international airport in Japan recently experienced firsthand what can happen at low lying coastal airports\nFollowing a powerful typhoon that tore through the region thousands of stranded passengers looked out to sea only the ocean where they should have seen the runway another recent example as Hurricane Sandy in two thousand twelve which inundated all three airports that serve New York city\nThe aviation industry is also grappling with other effects of climate change hotter thinner air makes it more difficult for planes to take off and climate change can also increased turbulence\nThe airline industry is not just a victim air travel currently accounts were proximity three percent of global greenhouse gas emissions and as one of the fastest growing sources of emissions\nAccording to the international civil aviation organization\nEmissions from international air travel are expected to triple play twenty fifty\nThe future of shaping up to be a bumpy ride [noise] for more information on this topic on the other environmental news visit us at birth wise radio dot org or find us on Facebook earth wise is a production of WAMC Northeast Public radio [noise]\nSupport for WAMC comes from Curtis lumber featuring Anderson windows Thurmond through doors Owens Corning shingles ... Cabot stains and more Twenty one locations in New York in northern Vermont Curtis number dot com\nFrom NPR News this is all things considered and I'm Mary Louise Kelly\nTo New York in northern Vermont Curtis number dot com\nFrom NPR News this is all things considered and I'm Mary Louise Kelly\nSaudi dissident journalist ... ... is still missing so grossly news reports increasingly point to the probability that he was tortured\nAnd murdered in the Saudi consulate in Istanbul two weeks ago the Trump Administration is giving Saudi Arabia a few more days to investigate saying they're not ready to punish the Saudis until the facts are clear\nHere's NPR's Michele Kelemen\nJust back from Saudi Arabia and turkey secretary of state Mike Pompeo went to the White House today to brief President Trump saying the Saudis are promising they will be thorough in their investigation\nI told President Trump this morning that we ought to give them a few more days to complete back so that we do have a complete understanding of the facts surrounding back which one we can make decisions about how the United states should respond to a surrounding this is Doug\n... says it's important to remember that Saudi Arabia is a strategic partner for the U.S and he's not Wayne and publicly on the news reports detailing the torture and murder of ... at the Saudi consulate in Istanbul\n... there are lots of stories out there about what has happened we just going to allow the process to move forward\nA lot of facts to unfold\nAs they unfold as we make a determination for ourselves about what happened there based on the fact that it was on to the United states will determine what have you\nHave to administer Asian did take one step today canceling plans for treasury secretary Steven Mnuchin did go to an investment conference in Saudi Arabia that decision was long overdue that Senator Patrick Leahy a Democrat from Vermont\nOr the salaries are plenty of time to tell us what happened after all it happened in their building their consulate\nLay he was among a bipartisan group of senators calling on the administration to impose human rights sanctions on anyone involved in ... disappearance\nWe should walk or such we should do not abuse the salaries of water to listen to pass a book that war crimes in Yemen\nCars vows to civilian casualties it appears as though the bin Laden constantly at the highest levels about Mr ... said enough is enough\nThe chairman of the Senate Foreign Relations Committee Republican Bob Corker told the Washington Post that the Trump Administration clamp down on sharing intelligence about the ... probably the intel is not painting a pretty picture as it relates to Saudi Arabia Corker is quoted as saying\nLow in the ... thirty sunny breezy tomorrow milder rubber fifties\nA cloudy day on Saturdays and scattered showers a possibility as to the upper fifties Sunday a mix of some clouds windy and colder in the forties and thirties across the north support for WAMC comes from the pioneer bally Chinese emerging niche emerging charter school in integrated educational program enrolling kindergarten\nSix and I prayed P. B. C. I. C. S. dot org\nWAMC comment on is open its toll free it's eight hundred six nine ... nine one seven zero the WAMC listener comet line is eight hundred six nine five nine one seven zero [noise] this is all things considered on WAMC twenty minutes after four [noise]\n\nSupport for NPR comes from the station and from logged me in makers of go to meetings that collaboration meeting platform that comes equipped with the troops to help people stay focused to get work done learn more at go to meeting dot com\nFrom indeed used by over three million businesses for hiring where employers can post jobs and you'd screener questions to build their short list of preferred candidates learn more and indeed dot com slash higher and from listener it's like you who donate to this NPR station\nIt's all things considered from NPR News I'm Mary Louise Kelly\nThree top officials in the southern Afghan province of Kandahar were killed today one of the most brazen Taliban attacks in memory the top American commander general Scott Miller was meeting with them at the time he was unharmed three others including two Americans were willing to NPR's Tom Bowman has more\nThe attack of the governor's compound took place just two days before provincial elections on Saturday and analysts predicted it could mean more games by Taliban forces who've been on the move throughout the country\nI think it does continue to show that the security situation in Afghanistan is very very fragile right now\nSo Jones is a defense analyst who's made numerous trips to Afghanistan\nI suspect some people may be deterred from voting now\nFragile right now\nSo Jones is a defense analyst who's made numerous trips to Afghanistan\nI ... some people may be deterred from voting now because of the secure environment\nOkay under her official told the Associated Press the dead included the provinces governors Zalmay way so his security chief of the ... Hassan call as well as the police chief general Abdul rustic general Miller took command of us and NATO troops just six weeks ago the Taliban said he was the target\nMiller spokesman tweeted that Afghan officials were the targets\nIn the wounded including an American soldier a contractor along with the coalition contractor were caught in the crossfire you should all were listed in stable condition tolo news local media group reported that ... was on his way to his helicopter after the meeting when at least one of the governor's bodyguard open fire\nOfficials say the attacker or attackers were killed\nThe attack comes a day after the Taliban killed a political candidate in the case in Helmand Province the latest in dozens of targeted attacks a number of polling stations around the country will not open because of security problems\nKandahar has been relatively calm for years mostly due to the efforts of police chief general rustic a brutal enforcer who had a network of informants he survived numerous Taliban assassination attempts and it's also been accused of many human rights abuses including torture and summary executions\nNPR sat down with rustic three years ago when there was talk he would be sidelined for the alleged abuses\nWhen it has to be thought Americans would stop providing him with ammunition fuel and equipment he brushed all that aside\nThe only thing going through a above started limit what we are doing in this country is for law enforcement\nUS military officials have tried for years to get ... who's tough ways but were quick to point out that he was necessary to keep the Taliban away from the American base Kandahar Airfield\nAnd today general Miller the U.S commander called ... a great friend the good he did for Afghanistan and the Afghan people Miller said\nCannot be undone Tom Bowman NPR News Washington\nAttorney general Jeff Sessions has made getting tough on illegal immigration a top priority edits Justice Department another top priority for sessions defending religious liberty what happens when those two are pitted against each other NPR justice reporter Ryan Lucas traveled to Arizona to find out\nThe old mining town of ... set among the jacket mountains in Oregon pike cacti of Arizona Sonoran Desert and it's at a ramshackle wouldn't corrugated tin building on the outskirts of town that this story begin [noise]\nWe're at a private residence called the buying ... humanitarian aid groups working in a way that they are of course\nThat's Catherine gassed me a volunteer with a group no more deaths they provide humanitarian aid to migrants such as leaving food and water in the desert to try to save lives of those crossing illegally and the borderlands\nIt was here at the bar in January that border patrol agents arrested Scott Warren and activists and no more deaths volunteer Warren was taken into custody along with two migrants who received aid and shelter at the barn\nFederal prosecutors to charge Warren with harboring conspiracy to transport in harbor the migrants no more deaths have used that as an effort by the government to crack down on groups providing aid to those tracking the desert\nWhat we see on ... now that they're going after the activists\nThat includes she says Scott worn worst case takes a twist when it moves from the desert into a federal courtroom because it's there that his lawyers have staked out a defense based in part on the religious freedom Restoration Act also known as RFRA in simple terms to warn is saying is that his faith compelled seem to offer assistance to people in need including immigrants\nAlso known as RFRA in simple terms award is saying is that his faith compelled him to offer assistance to people in need including immigrants Columbia Law school kept them Frankie is one of a handful of law professors who submitted a friend of the court brief in warns case to help explain to statute here's how she puts it\nProvides an exemption from a law that would apply to everyone else and limited circumstances if he application at that law would result in a kind of discrimination against once religious practice\nCongress passed in Nineteen Ninety three the idea was to protect the exercise of religious beliefs particularly of religious minorities by providing narrow exceptions in neutral laws for example allowing a religious group to using otherwise illegal drugs such as ... that is central to their observance says\nIn recent years Christian evangelical groups increasingly have used a lot to advance their causes as attorney general Jeff Sessions has taken up the banner of religious liberty last year he issued a memo with guidance on federal protections for it and then a July speech he 'bout to aggressively protect religious liberty\nSessions created a task force to help the Justice Department do so one of its job just to make sure the cases the OJ attorneys bringing defend and the arguments they make in court aren't aligned with federal protections for religious freedom\nThat includes making sure our employees know their duty to accommodate the full of fame\nAs the people in this room know you have to practice what you preach\nBut some say the Justice Department is failing to do just that instead they say it is selectively supporting religious liberty again Frankie\nThere is a public face of this government which is very protective of religious liberty and then the real work that they're doing is army protecting religious liberty rights of those who are religious conservatives not a religious progress\nThe American civil liberties union says the administration's view of religious liberty is selective in a different even hostile to face in religious people with which disagrees many conservatives on the other hand have a lot of the administration support for religious liberty\nUnder ... Warren has to show three things to make his case that his beliefs are religious in nature that they are sincerely held and that they are substantially burden by a law that applies to everyone if he can show those three things than the burden of proof shifts to the government\nProsecutors have to show that the government has a powerful reason to apply the law in war and specific case they also have to show that the government is using the least restrictive way possible to accomplish that\nThe government says for its part it has done just that so what are warns religious beliefs I visited his parents marking Pam at their home outside Phoenix to find out\nFor a mark yeah\nMark and Scott testified about their beliefs at a hearing earlier this year they described the life force that connects everything in the world\nIt's more than ... ... isn't nature grand you know more convincing religions are about dedicating your life to some something larger than yourself and that sort of saying well this didn't teach your life to the largest thing there is that the universe itself\nAt the court hearing prosecutors probed marking Scott and their beliefs to the war and it felt like the government was giving their view short shrift as I talked with mark Pam spoke up from a couch and the other side of the living room\nThe prosecution can't distracting tricky you got to I mean my building you can ... just ... religious you know a church in building right away I thought they were getting mocking\nThe U.S attorney's office for the district of Arizona declined to comment on warrants case which is winding its way through the judicial system a district court judge denied his motion to dismiss two of the counts based on river grounds but the judge left the door open to warrant to try and get a trial\nRyan Lucas NPR News ... Arizona\nIt's NPR news Oslo Arizona [noise]\nThis is NPR News\nIn the industrial heartland a Trump and another problem for Republicans as the Trump kept telling his supporters there's a red wave and the borders believed him and got a little complacent and we know that anger is the best motivator\nAnd we don't know who's going to be angry or white working class voters especially men that's the Trump base or college educated white women who are very angry but both sides are worried about history Republicans no the party and the White House usually lose his big when the president is under fifty percent\nDemocrats know that the groups of voters Republicans depend on tend to turn out more reliably in midterms they're worried about motivating low propensity voters like Hispanics and young people\nOh All right NPR national political correspondent Mara Liasson thanks Mara thank you [laughter] now for all the focus on how the Democratic party is shifting\nStreaming support for WAMC come from birch are Center for weight loss surgery with a focus on life skills and support for a long term success with we've got struck me in gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nTake Utah's fourth congressional district it is deep red and according to a recent poll Republican congresswoman Mia Love and Democrat Ben McAdams or in a dead heat NPR's Scott Detrow reports\nIn this year's deep partisan splits almost jarring to hear democratic Ben McAdams answer this question about President Trump how do you view of the Trump Administration is doing right now [noise]\nYou know I think mixed reviews the mayor of Salt Lake county Utah criticizes Trump pressure on immigration policy health care and other fronts but he's a lot more measured and cautious about it and most Democrats running for Congress this year\nNear where many in the party are talking about impeachment and single payer health care he likes to talk about burdensome regulations\nI Will work with the Trump Administration when I think it's good for this country and when it's good for you time I'll be there you know I think we do need an infrastructure package to invest in in local roads and bridges and I'm going to be a part of that\nThat's all no accident the county official and former state senator note that well other Democrats debate the tactics of exciting the party base versus appealing to Republican voters to switch sides he's got no choice Republicans have a Thirteen point advantage in this district\nThe votes I Need to win this election I've gotten twice before to see to reassure those people that are that you know I'm not going to change I'm going to be the same person or as a member of Congress that I've been as mayor\nHe also got to convince them to dump Mia Love a two term congresswoman\nWho got immediate national attention by being the first ever black woman elected to Congress as a Republican love is conservative but running in a tight race she repeatedly fringe herself as a pragmatist going into Washington I Know exactly what I'm working with I build\n... relate instead on both sides of the aisle love is aggressive about defending the Republican tax overhaul and the ultimately failed push to repeal the Affordable CARE Act is also quick to point out that in several high profile moments she's criticized Trump\nMost notably on immigration where she helped force a floor vote on a fix for the deferred action for childhood arrivals program\nAnd when she publicly scolded him for using a slur to describe predominantly black countries during the White House meeting on immigration as a matter of fact I'm the only one in this delegation that it stood up to the president when he has done something wrong\nAnd it worked with him when he has done something right Republicans occasionally chiding Trump's statements than backing him on policy has been a major theme of the past two years\nThat's something McAdams keeps pointing out seeing that voters should look at loves votes in action not her occasional statements\nDon't get credit for what I Try to do or what I say I want to do I'm judge based on what I accomplished and we need to hold the same standard to our representatives in Congress\nAs the race has tightened love has done what many other Republicans are doing framing a boat for McAdams as a vote for Nancy Pelosi that's despite the fact McAdams says he would not vote for ... to be speaker\nNow my opponent maybe not even the he's not going to vote for Nancy Pelosi but if you watch what's going on there if she if this turns over and they win the house Nancy Pelosi will be speaker of the house\nMcAdams insists he'd keep his independence and Washington\nWhen I see is if the Democrats do take back the houses because a lot of people like me who in their elections and these are people from party does not come first but solutions comes first\nAs Democrats last election after election in recent years the main casualties were moderates like the Adams that many of the candidates in swing districts the party is trying to flip this year don't fit in with Democrats national leftward shift\nAdams that many of the candidates in swing districts the party is trying to flip this year don't fit in with Democratic National leftward shift they are calling for single payer health care or impeachment so if election night goes well for the party the next big question is how the return of more moderate shifts party dynamics\nEspecially if they're the ones responsible for Democrats winning back power guy Detrow NPR News Salt Lake city [noise]\nYou're listening to all things considered from NPR News\nIf you live in California there is a chance to participate in today in the great shake out\nThis is an annual earthquake preparedness event it it's meant to encourage people to run safety drilled an update emergency supplies as well as plans with your family and schools and employers\nBut while residents may be ready to drop cover and hold on the parents concerned they may not be prepared for what comes after nearly Ninety percent of Californians do not have earthquake insurance NPR's Eric Westervelt reports\nThe six point seven magnitude north ridge quake in Nineteen Ninety four violently rattled north central Los Angeles homes businesses and parts of freeways cracker collapsed TV coverage captured some of the chaos\nThat far far right there where that guy standing right they were my roommate standing\nIn all at least fifty seven people were killed the quick cost some forty billion in today's dollars for property loss is half of that to homes but twenty four years is a long time maybe near the epicenter in Northridge close to her an apartment complex pancakes crushing sixteen people\nThere's little sense of urgency about the next Templar sixty four year old homeowner Nikolay she didn't want her last name used lives just down the street from where the apartment collapsed she doesn't HAVE QUICK coverage for her large one storey home\nDeductible so high on a house like this probably two hundred and fifty thousand [noise] so I'd rather save that money\nAnd I just don't think it's an ad that insurance for the money that you're going to spend on it\nToday the state's quake insurance market is still living with the fallout from North ridge and the perception that quake insurance isn't over priced luxury at best\nMany companies simply stopped writing policies after getting stung with nearly twenty billion in Northridge payouts and for the companies that remain consumer prices soared for limited coverage faced with expensive barebones policies and high deductibles many homeowners simply walked away\nEvery time there's a natural disaster we have to learn again a cold reality that the federal government isn't in the business of rebuilding homes\nThat Glenn Pomeroy the c._e._o. of the California earthquake authority but publicly manage not for profit was set up by the state legislature after insurance companies bailed in the wake of north ridge\nBuyback stopping risk the authority has helped dramatically lower rates by more than fifty percent also potentially increasing coverage and flexibility you can now decide what deductible you want from Oslo was five percent up to twenty five percent\nBut the agency is still having a hard time getting enough Californians to take a second look at coverage overall Pomeroy says if you take into account homeowners who've paid off their mortgages and don't have to get insurance at all [noise] barely ten percent of homes are\nCovered for a quick the fact that that run Ninety percent of the homes and California are in that unprepared state is is a great concern Seventy five percent of the nation's earthquake risk is right here in California scientists say that we're gonna get hit again it's a certainty\nOf the authorities Ninety percent problems for messaging woes of its own making there were those quick insurance ads would be in Congress soothing music or the ones with the tagline California rock featuring forests since Sunday beaches that sense\nUse it or the ones with the tagline California rock featuring for us and sunny beaches\nSense like the parents or the possibility of an earthquake pretty quick insurance for the California earthquake authority\nAbout one fifth of the nation's mortgage debt is held in California so the nation's economy big banks as well as the federal mortgage giants Fannie Mae and Freddie Mac could face enormous hits\nExperts caution insurance is only one part of protection but they agree to help mitigate potentially devastating losses after years of not really trying to scare people into action the nonprofit earthquake authority has pivoted with a new message the risk is real will you be ready\nWestervelt NPR News\n[noise] and says all things considered from NPR News is one of the most\nGratifying things in the world when you can not only have people support this radio station but support great causes as well we come together as a community everybody comes together and you make something happen\nAnd you know what Joe he had to do it fast so that we could go back to doing what everybody loves the most and that is listening to you and the other folks on the round table in the morning we were able to do it\nIn two days in a couple of hours unbelievable all of us collectively say thank you\nSupport for WAMC comes from a teacup McClellan buyers of gold diamonds and jewelry since Eighteen Ninety five Jamal adjusting appraisers evaluating and buying and great Barrington and New York appointment suggested MC to Jules dot com New York state sheep and we'll festival that the duchess county fairgrounds run back\nShe will and fiber artist crap vendors cooking demos October twenty twenty first that just spare dot com\nThe humidity loan fond of the capital region presenting it's thirty third anniversary celebration of sustainable community development Wednesday October twenty fourth [noise] first Presbyterian Church my community loan funded dot org\nIs Northeast Public radio WAMC FM HD Ninety point three Albany W. R. U. N. H. D. Ninety point three runs in Utica WAMC cage de Ninety point nine Kingston WLS storage de Ninety One point seven Middletown W. E. E. L. HD Ninety One point nine Plattsburgh WC A. N. H. D. Ninety three point three Kennedy Harry WAMC age do you want a three point nine to ...\nWAMC ... five point one great Barrington W. W. E. S. H. D. idiot point nine mount Kisco WAMC HD Ninety point one Stanford W ANR eighty eight point by Brewster and WAMC am fourteen hundred Albany\nSupport for WAMC comes from all honk mountain house the national historic landmark resort family owned since ... Eighteen sixty nine nestled in the Hudson Valley mo honk mountain house offers fine dining both by in breathtaking views on dot com [noise]\nWilliams College sixty two central presenting micro dramas a series of short players directed in performed by William students through October twenty seven thirty PM sixty two center Doug Williams dot edu it's five o'clock\nThat policy is to punish her family's from seeking protection this round two of the administration's hand might have ration policy\nThreats to revive a controversial policy as a caravan of migrants heads toward the U.S today Thursday October Eighteenth and this is all things considered and\nI'm Mary Louise Kelly President Trump also wants to use the military to close the border with Mexico what the administration can and cannot do to stop the migrants traveling north also the reality for people in Florida's emergency shelters a week after hurricane Michael\n... pairs of clothes and three work uniforms because I didn't anticipate being here this\nLong and with tears filing for bankruptcy what's in store for America shopping malls\nIn many cases they've already lost the Sears they're losing a Macy's they've lost the regional department store long ago first news\nLive from NPR News in Washington I'm jak spear President Trump isn't sounding very hopeful about journalist ... ... Turkish authorities would maintain control Jew was killed inside the Saudi conflict in its tumble amid reports there is audio or video evidence of what happened\nSecretary of state my palm pale met with Trump with the White House today leaving for a campaign event in Montana the president was asked about whether he too believes the Washington Post columnist was killed\nIt certainly looks that way from a very sad certainly\nSaudis have denied involvement but during a meeting with the secretary of state promised a complete thorough investigation into what happened at the consulate\nJust days before a parliamentary elections in Afghanistan the Taliban are claiming responsibility for an attack in southern Kandahar that killed three Afghan officials it took place during a meeting with the top American commander general Scott Miller he was on harmed\nBut three others including two Americans were wounded Here's NPR's Tom Bowman those killed included the provincial governor and the police chief who was the most brazen Taliban\nArmed with three others including two Americans were wounded Here's NPR's Tom Bowman\nThose killed included the provincial governor and the police chief who was the most brazen Taliban attack in memory the Taliban claim to target was general Miller the Miller spokesman said the targets were Afghan officials\nAt least one of the governors guards opened fire according to local media reports\nThe wounded including an American soldier in contractor along with a coalition contractor their injuries were not life threatening Kandahar has been mostly stable in recent years mostly due to the police chief general ... a brutal enforcer who survived many Taliban assassination attempts\nBut has been accused of human rights abuses Tom Bowman NPR News Washington\nJustice Department officials would open an investigation into allegations of child sex abuse inside the Roman Catholic Church in Pennsylvania\nProsecutors serving subpoenas on dioceses across the state seeking sensitive files and testimony investigation comes on the heels of a state grand jury report detailing hundreds of allegations of child sex abuse by priests\nWall Street showed that in the span of three days it can go from the biggest single day for the markets in six months to being back down in the dumps after the record run up earlier in the week major U.S stock market indices all ending the day down one percent or more the stock split on concerns about earnings and mounting tensions with Saudi Arabia\nKind of his Mark Zandi says the whitening us trade battle with China's also weighing on investors these are the\nTwo largest economies on the planet and not a good thing that we're bickering and raising tariffs on each other and making life difficult for each other that's just not good for business in the long run\nTwo countries of slap hundreds of billions of dollars in trade tariffs on one another's goods industrial and basic materials have been taking big losses amid worries the dispute will increase the cost and hurt sales\nChecking the numbers on Wall street today the Dow was down three hundred and twenty seven points to twenty five thousand three Seventy nine the NASDAQ dropped a hundred and fifty seven points the standard and Poor's five hundred last forty points today\nYou're listening to NPR support\nFor NPR comes from NPR stations other contributors include exact science is offering color guard for average risk adults over fifty a non invasive colon cancer screening tests that can be used at home by prescription only information at ... dot com\nVersus WAMC regional News I'm Brian shields the Republican candidate for governor of New York mark Mulligan arrow is calling for only or colleges and universities that receives state funding\nTo immediately make public they're admissions policies Mullen our owes call follows the law suit brought against Harvard University by applicants who claim the ivy league school in Massachusetts is biased against Asian Americans more narrow says if the New York schools did not release their information voluntarily there should be affirmed government response\nThe Massachusetts health connector has launched a three week state wide tour promoting the start of open enrollment November first ... hill reports\nUsing social media campaign in in person outreach by health exchange staffers the goal is to remind everyone that suggests it still has an individual mandate according to health connector spokesman Jason left for\nThe federal penalties are going away but the state mandate remains in place it always has since you've got to fix a Supreme Massachusetts resident you don't have health insurance you can be physically attacked\nThe health connector will offer fifty seven insurance plans from nine carriers premiums have gone up an average of five percent last year there were double digit rate increases after federal subsidy payments were caught Massachusetts had the highest insured rate in the country with Ninety seven percent of its residents covered fulltime he'll WAMC news\nThe name of a former University of Vermont president may be removed from the library because of his supportive research into huge and\nSeen is the name of a former University of Vermont president may be removed from the library because of who supported research into eugenics a panel of the ... board of trustees advise the school to remove the main Bailey for former president Diabaly from the belly how libraries you being able to fool board expected to vote next week\nThe forecast partly cloudy tonight in the low thirties sunny breezy tomorrow up or fifties cloudy Saturday some scattered showers up her fifties thirty six at Dover, Vermont Beckett Massachusetts thirty nine ... forty Albany forty five support for WAMC comes from MVP healthcare committed to making health insurance supportive\nConvenient and personal information available MVP healthcare dot com\nWAMC news five thirty I'm Brian shields WAMC knows\n\nIt's all things considered from NPR News I'm Mary Louise Kelly to Mexico and the imminent arrival of thousands of Central American migrants traveling in a so called caravan from Honduras their ultimate destination the United states\nPresident Trump is tweeting his plans to cut aid to any country that helps the migrants he's also threatened to send the U.S military to shut down the southwest border if that's a caravan isn't stopped and the White House is considering reviving the family separation policy to discourage families from coming north\nFor its part in Mexico has ramped up security along its southern border at says only migrants with valid paperwork will be allowed to enter Mexico reporter James Frederick\nIs that that to Qunu ... border crossing between Guatemala and Mexico and he joins me now hey James I'm Mary Louise to describe exactly where you are what you can see I Am on the bridge that connects Mexico Guatemala\nIt's above the river to devise these two countries are above me is a sign that says the end of any of those Mexico the entrance from Mexico but you can tell Mexican security forces are preparing because there are dozens of police in riot gear waiting here for the eminent arrival of this caravan\nAbout five minutes down the bridge from where I'm walking is the central square where three to four hundred members of this migrant caravan are waiting for the rest to arrive who\nAre these migrants where are they coming from why are they coming\nSo most of the migrants that I spoke to her from Honduras but also summer from El Salvador in Guatemala let's listen to Judy uh thirty four year old I spoke to in that central square as she was cradling her exhausted five year old son on her lap\nOnto it as a family thing or something like that\nSo what she said is that there's no safety no job no medicine and hospitals she also went on to say that hunter it feels like freedom of assembly an expression\nAre being oppressed by the government of President Juan Orlando Edmund that she said it's just unlivable and Honduras for her right now some site violence is the main factor some sites poverty but\nThe people that I met are just absolutely desperate\nHas she or anybody else actually tried to cross onto the Mexican side of the border you know they are pretty\nDead set on crossing as a group and being a big visible force that tries to cross so they see strength and visibility and numbers\nExtinguisher is in the Hudson Valley Gordon fire dot com love Bella associates dedicated to the pursuit of partnership or forty years serving in the development of buildings infrastructure environmental and energy projects Bella Howard by partnership\nLabelle a PC dot com Massachusetts General hospital mass generals research back care approach it drives them to develop treatments for complex conditions\nTo help their patients get back to their lives revolutionizing care Mass General [noise] the weather forecast a cold night tonight partly cloudy low thirties tomorrow's sunny breezy milder upper fifties cloudy Saturday scattered showers possible in the fifties\nSunday a mix of some and clouds windy and cold or in the forties and thirties across the north\nTwenty minutes after five o'clock [noise]\n\n\nSupport for NPR comes from the station and from farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs coverage options and more information can be found at farmers dot com\nFrom gobble Neal kicked company that delivered semi ... meals to be finished at home in Fifteen minutes with one hand ... chefs do the prep work like chopping marinating this week's menu is at ... dot com slash NPR and from Americans for the arts\nStreaming support for WAMC come from Berkeley Center for weight loss surgery with a focus on life skills and support for a long term success with we've got struck me in gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nJust prompted much ringing of hands over the bleak future of the American mall\nThat well some malls are emptying out others are bustling according to the international council of shopping centers over the last five years more malls have opened and closed mark Cohen as a former CEO of Sears Canada he now teaches at Columbia Business school\nHe told me some malls will actually benefit from all those Sears stores shutting down\nThere are triple lays or super regionals as they referred to who are booming who are\nReceiving the news of Sears demise or near demise with glee because if Sears is still doing business in in their facility they're happy to take the space back these are malls with four five six acres in some cases that are fully tentative and there are only a limitation is available\nParking so they're losing one anchor star but they've got others can what would they do at the share space\nWell they're likely to break it up and turn it into other specialty retail or add to their experiential opportunity in the form of added food offerings things of that sort okay and then there are\nB and C malls and these are smaller these tend to be older in many cases they've already lost his ears and the prognosis for these bees and sees is grim\nWhy can't they do the same thing in the ... why can't they re imagined the space and at a food court or something\nThey can do it on paper but they can't manage it financially because the malls volume has declined to the extent that there is no financial viability left\nWhen you talk about the triple a malls that are striving or those congregated in a certain part of the country is there a certain type store type layout that is working for them to pay me a little bit more of a picture of what those look like\nThey're dispersed throughout the United states they straddle urban population center and heavily populated affluent suburban community\nSo they're typically the biggest shiny is penny in the marketplace in virtually every major population centers throughout the United states there is one and in some cases two of these AAA sensors that are doing fine they're fully tended to they've got lots of footsteps\nThey're still sought out has destinations by customers\nIt sounds as though you're describing a landscape in which some malls are disappearing some malls are thriving but all of them are being re imagined in what way is where we'll an anchor store be as important as it was a generation ago people rethinking outdoor versus indoor spaces what trends are you seeing\nAll the Akron store was typically a department store and the department stores genre is for the most part on its way out but now several things have happened first of all the apparel an accessory trends have declined\nUh customers are spending an enormous amount of disposable income on tech and on experiential opportunities rather than on amassing wardrobe sort of a close\nAnd the whole idea that an over large box will act as the draw for a mall\nIs probably outmoded as well in many of the triple a malls or so to speak the anchor tenant as someone like the apple store my which doesn't occupy a traditional hackerspace but draws an enormous amount of traffic into the center\nDoes someone like the apple store right which doesn't occupy a traditional acres space but draws an enormous amount of traffic into the center [noise]\nDo you go shopping malls regularly no why when I was a gainfully employed in the business I did that two and three times a week everywhere in the United states and Canada\nBut frankly I'm there that are less and less attractive the offer less and less appeal and I've gravitated like millions and millions of other folks to the Internet which is a much more convenient obviously and much more likely to be successful\nThat's mark Cohen at Columbia Business school he was former C. E. O. Sears Canada the call and thanks very much but to make you\nMore than a week has passed since hurricane Michael tore a path of destruction through coastal and inland communities tens of thousands of people are still without power curfews are still in effect in lots of places and many of the people who call Florida's panhandle home\nCan't get home several hundred of them are living in schools serving as emergency shelters and that is where NPR's Hansi Lo Wang has been spending some time here's his report\nRows and rows of cuts top with blankets and pillows are spread out in the Newseum and dean Bozeman school\nAre people that day so we want to be very different\n... the American Red Cross leads me on a tour of the shelter in northern county it's one of ... around Florida's panhandle or than two hundred people from a few months old to almost Ninety years older hungry in this shelter bottled water diapers and canned food are piled by the entrance next to trailers equipped with showers\nAdding say thanks I live in a trailer [noise]\nSo I kind of get the ... actually it's a wash the clothes\nMany here didn't have much to where when they fled their homes including Heather ... inner Thirteen year old daughter Alexis\nThey brought two pairs of clothes and three work uniforms because\nI didn't anticipate not being able to work and being here this long\nTo wait for hurricane either\nOr they're in a Lexus lived in Mexico beach that's where a hurricane Michael hit hardest they don't know when they'll be allowed to see what's left to their house\nFEMA stuff all day and\nHaving to wait in line for a good amount of hours for that\nPeople whose houses are unlivable can apply for vouchers from female to pay for a temporary stays in hotel rooms and condos before applicants find out if they qualify inspector has to go out and see the damage to their homes\nThey may take a while before FEMA can reach every house down to ... need to not just a new roof over her head but also a reliable source of electricity for her oxygen machine\nPeople have been helping me running a bump\nIn Maine outlets like ... to me it is quite ...\nHayes is staying at another shelter at breakfast point academy in Panama City beach she's using her oxygen machine center second open heart surgery a few months ago\nThis is my fourth shelter\nFirst ... blaming connect to my they didn't have backup electricity and they had a pack and that and that's that if I had\nFailed\nKennedy ... heavy here\nFor ... Massie the journey to the shelter at those in high school started with a helicopter his family were rescued after the roof caved in at the house where they had gathered for the storm\nAfter they were checked out at a hospital they were bussed over to the shelter\nWhere my family for my mom and my ... my\nHow many altogether a lie\nThat she's Eighteen and the oldest of his siblings and cousins I Know my role is\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including ... robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nWhen they can be in there\nYou know you know yourself so you can't really tell them anything but that you're working on it and that to try to get your house and all you know all that stuff\nYou just tell them in you know they're working on it and\nThat the grandfather is planning to pick them up soon from the shelter so they can stay with him in Orlando and as he says he isn't sure when or if they will be back\nOnto the lung NPR News the County Florida [noise]\nAnd that story was produced by NPR's each town [noise]\nThis is NPR News\nWas she felt she could no longer do it at home and that a lot of people who wanted to express themselves in Saudi Arabia were muzzled are in prison and so he was willing to take some risks to do what they couldn't do\nAnd uh if we can do it in their own language as well as an English all the better he\nWrites in this last column about ah the regime in Saudi Arabia clamping down on on the Internet or do you have any way of tracking how widely read his columns have been either in English or Arabic in his home country and Saudi Arabia\nSo we have certainly seen when we translate our editorial orange a ball fuses or other piece into Arabic when you get a big spike in readership from the region [noise] one of the most heartbreaking things about this is that\nHe was a patron he supported a lot of the reforms of the crown prince of Saudi Arabia says he's four but he believed that the best way to accomplish them was to allow people to debate them and uh to express opinions and I'm In the long run that's the way his country was going to succeed\nAnd I think we're trying to contribute in that same vein\nFred Hi it he's the editorial page editor of the Washington Post and a colleague of Jamal ... thank you thank you [noise]\n\nFor years there's been a debate about what to do with the aging headquarters of the FBI which happens to sit across the street from President Trump's Washington hotel a newly released batch of emails indicates the president influenced a federal decision to keep the FBI on the same site\nTrump's involvement in the fate of the property is being investigated by Democrats on the house oversight committee who are concerned about possible presidential conflicts of interest NPR's Peter Overby reports\nThis all has to do with the FBI and it's old dilapidated headquarters in D.C the building sits across Pennsylvania Avenue from President Trump's hotel\nThe general services administration the federal government real estate manager plan to move the FBI to bigger facilities in Washington suburbs Dorothy row buying uh GST official explained the financial angle to a house hearing in twenty Thirteen\nWe believe the Pennsylvania avenues site has considered her potential for higher and better use than as a headquarters of the federal agency we hope to unlock that hidden value and apply it to the creation of a new facility\nIn fact Donald Trump before he was president showed an interest in developing the old FBI site but by twenty sixteen he was about to cut the ribbon at the current hotel he bragged about it on the campaign trail series in Fairfield, Connecticut\nWith very very complex\nSuper luxury hotels good old boy a lot of people it's almost finished as more\nAnd last winter Trump stopped the FBI's move it happened in the White House meeting with officials from the FBI and gee I say the new plan is to rebuild the old headquarters although it means moving thousands of workers elsewhere this spring TSA administrator Emily Murphy told a house committee Trump had nothing to do with the decision to rebuild\nThe the destruction that we got came from the FBI and with the FBI detracted you get to watch for climate to be but the\nReleased today suggest something else ... essay official referred to the project as quote a demolition new construction perjure presidents instructions another referred to it as quote what ... directed everyone to do\nJury ... a democratic congressman from just across the Potomac in Virginia he said that redevelopment could land a competitor across the street\nJerry ... a democratic congressman from just across the Potomac in Virginia he said that redevelopment could land a competitor across the street from Trump's hotel\nA number of us thought the president had to have something to do with this personally\nWhite House press secretary Sarah Sanders told the New York times that quote the president wanted to save the government money and also the FBI leadership did not want to move its headquarters Kathleen Clark is a law professor at Washington University of St Louis her specialty is governmental ethics\nThis is a problem because Trump's intervention may well have been motivated by his personal financial concerns with his own hotel\nBut he points out the president is exempt from federal ethics laws including the ban on conflict of interest\nAdjust a spokeswoman said the emails were taken out of context and referred to funding issues not the location congressmen Elijah Cummings is the ranking Democrat on the house oversight committee if Democrats take the house next month Cummings was in line to become chairman\nIn a phone call this afternoon coming said he'll wait for official responses from the White House and gee I say he said the White House often stone walls instead it's quite possible the oversight committee won't take up the issue again till January Peter Overby NPR News Washington [noise]\nYou're listening to all things considered from NPR News\nHistorically white Americans have distanced themselves from many non white ancestry they might have\nNow many are claiming some because they're proud on some because they're trying to tap into benefits designed for minorities so what exactly make someone a minority at Karen Grigsby Bates from our Code Switch team tells us it's complicated\nPresident Trump has been mocking Massachusetts Senator Elizabeth Warren says search and that she has Native American ancestry since twenty sixteen\nOh God that's so as far as Massachusetts is represented by Pocahontas right out\nThe came from Fox and CNN and there were lots more in a video released this week Warren collapse back\nI'm not I'm wrote in and try and only trying to determine tribal citizenship I understand and respect\nMy family history is my family history\nSo she had her DNA sequence which we deals Native American ancestry one says she took the test to prove their families tale of having native ancestors had some basis in truth\nBut not everybody test for personal validation\nHouse majority leader Kevin McCarthy was in the news recently because Los Angeles times investigation revealed that since two thousand his brother in law William wages was awarded more than seven million dollars and no big government and other federal contracts that were designed to go to disadvantage minorities\nHe declined to test but from family lower wages claims to be one age Cherokee\nUp in Washington insurance broker Ralph Taylor has a suit pending in the Ninth Circuit because the state denied among minority business certification for a program designed to help minorities get transportation industry contracts\nTaylor according to the Seattle Times began describing himself that multi racial after taking a consumer ancestry test\nThe test indicated Taylor had four percent sub Saharan African ancestry and six percent indigenous American he says that's enough for him to qualify as minority so what is the minority then\nThe question really you're asking is that the DNA test tell him what his identity as retell and yet what our identities are\nColumbia University sociologist Alondra Nelson is the author of the social life of DNA in a recent op ed in the New York times Nelson said DNA markers can't tell us who we truly are because we're comparing apples and oranges\nThe social life of DNA in a recent op ed in the New York times notes and said DNA markers can't tell us who we truly are because we're comparing apples and oranges genetic data is technical identity is social\nAnd social science we think about the identity as being how human groups or individuals are defined by themselves and how others perceive them\nNote and said home DNA tests are fine is something to indulge your curiosity but consumers shouldn't take the results or definitive the companies didn't design them for that\nYou know the sort of gold standard genetic science is not exactly what they're after entirely right and they're also um profit making entity\nAnd she hopes the courts will be able to tell the difference so programs designed to level the playing field for people who have historically been shut out of these opportunities can continue to do that\nI Would hope that uh the court is able to take seriously and the fact that these sorts of programs were meant to start at the counterpoint to discrimination\nBecause the lived experience of minorities camping learn by swapping cheek for speeding into a cheap Karen Grigsby Bates NPR News [noise]\nThis is all things considered from NPR News\nThis is a WAMC business update I'm Jim ...\nOn Wall street the last three hundred twenty seven to twenty five thousand three hundred Seventy nine the S. and P. five hundred it dropped forty two two thousand seven hundred sixty eight and the NASDAQ shed one hundred fifty seven to seven thousand four hundred eighty five\nLong term mortgage rates have dip slightly this week taking a pause after weeks of steady increases stoked by rising interest rates\nFreddie Mac says the rate on the thirty year fixed rate mortgages declined to an average of four point eight five percent\nFrom a four point nine percent last week last week the average was the highest level for the benchmark rate since spring two thousand eleven or a year ago it stood at three point eight eight percent\nGerman automaker Volkswagen says it is offering more incentive to trade in older diesel models in an effort to improve air quality", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Albany", "day": "18", "locations": [["Albany", 42.65258, -73.75623], ["Albany New York", 42.65258, -73.75623], ["Albany New York New York", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Washington", 38.89511, -77.03637], ["U.S", 39.828306, -98.5795], ["Istanbul", 41.01384, 28.94966], ["U.S", 39.828306, -98.5795], ["Saudi Arabia", 25.0, 45.0], ["the United states", 39.828306, -98.5795], ["Saudi Arabia", 25.0, 45.0], ["China", 35.0, 105.0], ["China", 35.0, 105.0], ["Mexico", 23.0, -102.0], ["Mexico", 23.0, -102.0], ["U.S", 39.828306, -98.5795], ["Mexico", 23.0, -102.0], ["Florida", 28.75054, -82.5001], ["Florida", 28.75054, -82.5001], ["New York", 40.71427, -74.00597], ["San Francisco", 37.77493, -122.41942], ["Japan", 35.68536, 139.75309], ["New York New York", 40.71427, -74.00597], ["Vermont", 44.00034, -72.74983], ["New York", 40.71427, -74.00597], ["Vermont", 44.00034, -72.74983], ["Istanbul", 41.01384, 28.94966], ["Saudi Arabia", 25.0, 45.0], ["Saudi Arabia", 25.0, 45.0], ["turkey", 39.0, 35.0], ["the United states", 39.828306, -98.5795], ["Saudi Arabia", 25.0, 45.0], ["U.S", 39.828306, -98.5795], ["Istanbul", 41.01384, 28.94966], ["the United states", 39.828306, -98.5795], ["Saudi Arabia", 25.0, 45.0], ["Vermont", 44.00034, -72.74983], ["Yemen", 15.5, 47.5], ["Kandahar", 31.61332, 65.71013], ["Afghanistan", 33.0, 66.0], ["Afghanistan", 33.0, 66.0], ["Afghanistan", 33.0, 66.0], ["Helmand Province", 31.0, 64.0], ["Kandahar", 31.61332, 65.71013], ["US", 45.99696, -118.49854], ["U.S", 39.828306, -98.5795], ["Afghanistan", 33.0, 66.0], ["Washington", 38.89511, -77.03637], ["Arizona", 34.5003, -111.50098], ["Oregon", 44.00013, -120.50139], ["Arizona", 34.5003, -111.50098], ["Phoenix", 33.44838, -112.07404], ["U.S", 39.828306, -98.5795], ["Arizona", 34.5003, -111.50098], ["Arizona", 34.5003, -111.50098], ["Utah", 40.23384, -111.65853], ["Salt Lake county Utah", 40.76078, -111.89105], ["Washington", 38.89511, -77.03637], ["Washington", 38.89511, -77.03637], ["Salt Lake city", 40.76078, -111.89105], ["California", 34.68743, -116.78467], ["north ridge", 72.5, 5.0], ["Los Angeles", 34.05223, -118.24368], ["Northridge", 34.22834, -118.53675], ["North ridge", 72.5, 5.0], ["Northridge California", 34.22834, -118.53675], ["Oslo", 59.91273, 10.74609], ["California", 34.68743, -116.78467], ["California", 34.68743, -116.78467], ["California", 34.68743, -116.78467], ["California", 34.68743, -116.78467], ["California", 34.68743, -116.78467], ["California", 34.68743, -116.78467], ["New York New York", 40.71427, -74.00597], ["Albany", 42.65258, -73.75623], ["Utica", 5.16977, -74.50134], ["Albany", 42.65258, -73.75623], ["U.S", 39.828306, -98.5795], ["Mexico", 23.0, -102.0], ["Florida", 28.75054, -82.5001], ["America", 39.828306, -98.5795], ["Washington", 38.89511, -77.03637], ["Montana", 47.00025, -109.75102], ["Afghanistan", 33.0, 66.0], ["Kandahar", 31.61332, 65.71013], ["Kandahar", 31.61332, 65.71013], ["Washington", 38.89511, -77.03637], ["Pennsylvania", 39.95233, -75.16379], ["U.S", 39.828306, -98.5795], ["Saudi Arabia", 25.0, 45.0], ["China", 35.0, 105.0], ["New York", 40.71427, -74.00597], ["Massachusetts", 42.36565, -71.10832], ["New York", 40.71427, -74.00597], ["Massachusetts", 42.36565, -71.10832], ["Massachusetts", 42.36565, -71.10832], ["Dover", 39.15817, -75.52437], ["Albany", 42.65258, -73.75623], ["Mexico", 23.0, -102.0], ["Honduras", 15.0, -86.5], ["the United states", 39.828306, -98.5795], ["U.S", 39.828306, -98.5795], ["Mexico", 23.0, -102.0], ["Mexico", 23.0, -102.0], ["Qunu", -31.78319, 28.61591], ["Guatemala", 15.5, -90.25], ["Mexico", 23.0, -102.0], ["Mexico Guatemala", 15.83106, -88.77719], ["Mexico", 23.0, -102.0], ["Mexico", 23.0, -102.0], ["Honduras", 15.0, -86.5], ["El Salvador", 13.83333, -88.91667], ["Guatemala", 15.5, -90.25], ["Honduras", 15.0, -86.5], ["Labelle", -77.32778, 161.26111], ["Massachusetts", 42.36565, -71.10832], ["the United states", 39.828306, -98.5795], ["the United states", 39.828306, -98.5795], ["the United states", 39.828306, -98.5795], ["Canada", 60.10867, -113.64258], ["Canada", 60.10867, -113.64258], ["Florida", 28.75054, -82.5001], ["northern county", 55.66667, 21.33333], ["Florida", 28.75054, -82.5001], ["Mexico", 23.0, -102.0], ["Maine", 45.50032, -69.24977], ["Panama City", 8.9936, -79.51973], ["Orlando Florida", 28.53834, -81.37924], ["Saudi Arabia", 25.0, 45.0], ["Saudi Arabia", 25.0, 45.0], ["Saudi Arabia", 25.0, 45.0], ["Saudi Arabia", 25.0, 45.0], ["Jamal", 29.6498, 70.52857], ["Washington", 38.89511, -77.03637], ["Washington", 38.89511, -77.03637], ["Pennsylvania", 39.95233, -75.16379], ["Fairfield Connecticut", 41.05343, -73.53873], ["Potomac", 38.87067, -77.02553], ["Virginia", 38.34982, -81.63262], ["Potomac", 38.87067, -77.02553], ["Virginia", 38.34982, -81.63262], ["New York", 40.71427, -74.00597], ["Washington", 38.89511, -77.03637], ["Massachusetts", 42.36565, -71.10832], ["Massachusetts", 42.36565, -71.10832], ["Washington", 38.89511, -77.03637], ["New York New York", 40.71427, -74.00597]], "not_found": ["Saudi Arabia Corker"], "ep_coords": ["Albany, NY", 42.65258, -73.75623], "in_country": ["Albany", "Albany New York", "Albany New York New York", "Albany", "Washington", "U.S", "U.S", "the United states", "U.S", "Florida", "Florida", "New York", "San Francisco", "New York New York", "Vermont", "New York", "Vermont", "the United states", "U.S", "the United states", "Vermont", "US", "U.S", "Washington", "Arizona", "Oregon", "Arizona", "Phoenix", "U.S", "Arizona", "Arizona", "Utah", "Salt Lake county Utah", "Washington", "Washington", "Salt Lake city", "California", "Los Angeles", "Northridge", "Northridge California", "California", "California", "California", "California", "California", "California", "New York New York", "Albany", "Albany", "U.S", "Florida", "America", "Washington", "Montana", "Washington", "Pennsylvania", "U.S", "New York", "Massachusetts", "New York", "Massachusetts", "Massachusetts", "Dover", "Albany", "the United states", "U.S", "Massachusetts", "the United states", "the United states", "the United states", "Florida", "Florida", "Maine", "Orlando Florida", "Washington", "Washington", "Pennsylvania", "Fairfield Connecticut", "Potomac", "Virginia", "Potomac", "Virginia", "New York", "Washington", "Massachusetts", "Massachusetts", "Washington", "New York New York"], "out_country": ["Istanbul", "Saudi Arabia", "Saudi Arabia", "China", "China", "Mexico", "Mexico", "Mexico", "Japan", "Istanbul", "Saudi Arabia", "Saudi Arabia", "turkey", "Saudi Arabia", "Istanbul", "Saudi Arabia", "Yemen", "Kandahar", "Afghanistan", "Afghanistan", "Afghanistan", "Helmand Province", "Kandahar", "Afghanistan", "north ridge", "North ridge", "Oslo", "Utica", "Mexico", "Afghanistan", "Kandahar", "Kandahar", "Saudi Arabia", "China", "Mexico", "Honduras", "Mexico", "Mexico", "Qunu", "Guatemala", "Mexico", "Mexico Guatemala", "Mexico", "Mexico", "Honduras", "El Salvador", "Guatemala", "Honduras", "Labelle", "Canada", "Canada", "northern county", "Mexico", "Panama City", "Saudi Arabia", "Saudi Arabia", "Saudi Arabia", "Saudi Arabia", "Jamal"], "in_state": ["Albany", "Albany New York", "Albany New York New York", "Albany", "New York", "New York New York", "New York", "New York New York", "Albany", "Albany", "New York", "New York", "Albany", "New York", "New York New York"], "out_state": ["Washington", "U.S", "Istanbul", "U.S", "Saudi Arabia", "the United states", "Saudi Arabia", "China", "China", "Mexico", "Mexico", "U.S", "Mexico", "Florida", "Florida", "San Francisco", "Japan", "Vermont", "Vermont", "Istanbul", "Saudi Arabia", "Saudi Arabia", "turkey", "the United states", "Saudi Arabia", "U.S", "Istanbul", "the United states", "Saudi Arabia", "Vermont", "Yemen", "Kandahar", "Afghanistan", "Afghanistan", "Afghanistan", "Helmand Province", "Kandahar", "US", "U.S", "Afghanistan", "Washington", "Arizona", "Oregon", "Arizona", "Phoenix", "U.S", "Arizona", "Arizona", "Utah", "Salt Lake county Utah", "Washington", "Washington", "Salt Lake city", "California", "north ridge", "Los Angeles", "Northridge", "North ridge", "Northridge California", "Oslo", "California", "California", "California", "California", "California", "California", "Utica", "U.S", "Mexico", "Florida", "America", "Washington", "Montana", "Afghanistan", "Kandahar", "Kandahar", "Washington", "Pennsylvania", "U.S", "Saudi Arabia", "China", "Massachusetts", "Massachusetts", "Massachusetts", "Dover", "Mexico", "Honduras", "the United states", "U.S", "Mexico", "Mexico", "Qunu", "Guatemala", "Mexico", "Mexico Guatemala", "Mexico", "Mexico", "Honduras", "El Salvador", "Guatemala", "Honduras", "Labelle", "Massachusetts", "the United states", "the United states", "the United states", "Canada", "Canada", "Florida", "northern county", "Florida", "Mexico", "Maine", "Panama City", "Orlando Florida", "Saudi Arabia", "Saudi Arabia", "Saudi Arabia", "Saudi Arabia", "Jamal", "Washington", "Washington", "Pennsylvania", "Fairfield Connecticut", "Potomac", "Virginia", "Potomac", "Virginia", "Washington", "Massachusetts", "Massachusetts", "Washington"]}]