{"month": "10", "state": "MA", "station": "WZAI", "content": "Being the boogie wonder band for symphony at the disco a night at studio fifty four nights fever dancing queen ... and thirty three more October Thirteen fourteen tickets at Cape symphony dot org [noise]\nYou're listening to WBAI your local news and information source for the Cape the coast and the island's Ninety point one double you ca I N WBAI HD wind Woods Hole Martha's Vineyard\nNinety One point one W. N. A. N. Nantucket Ninety four point three WBAI Brewster and W. GBH HD three eighty nine\nPoint seven Boston on line at Cape and islands died\nThis week says you look back over the years how\nMake a gesture and I'd like that I think we could call this the original sin cat\nWe reassembled the original panel to revisit our very first episode pilots spelled P. I. L. O. T.\nI'm Sorry I Can't give you points for that but certainly [laughter] we've discovered that an twenty plus years some things have changed at all [noise]\nWe weren't even dryer\nIt's a retrospective says you coming right up\n\nLive from NPR News in Washington I'm Janine hurt President Trump is campaigning for Republican candidates in Topeka, Kansas tonight where he praised the Senate vote today that made Brett Kavanaugh Supreme Court justice at Trump told a cheering crowd they need to remember the bitter bipartisan fight at the mid term elections\nHave you allow the wrong people to get into office\nThings could change they could change that could change fast\nProtesters gathered at the Supreme Court and the U.S Capitol building in Washington DC today as the Senate confirmed Kevin ... fifty to forty eight mostly along party lines NPR's Brian Naylor reports\nVote ended weeks of sharp partisan battles over\nAccused by several women are sexually assaulting them charges he angrily denied in the debate before the vote senators sounded like they were describing two different men Senate majority leader Mitch McConnell called him a dedicated public servant\nJudge Brett Kavanaugh is among the very best our nation has to offer you will make the ... on the contrary proud\nSenate minority leader Chuck Schumer on the other hand said Kavanaugh's confirmation was a low moment for the Senate and the country\nIs that it is about to elevate a nominee who doesn't belong on the nation's highest bench\nTerminal was sworn in a few hours later Brian Naylor NPR News\nWashington ranch officials tell NPR that China is detaining the head of the international police organization Interpol on suspicion of financial fraud and other charges men hung away as for has reportedly been missing since late last month NPR's Eleanor Beardsley reports\nThe south China Morning post reported friday that sixty four year old ... home way was picked up by Chinese authorities when he arrived in Hong Kong in September\nAnd actually ... send them matter concerns French and Chinese authorities but in a later statement Interpol secretary general you're going to stop\nSaid he wants an official response from Chinese authorities to address concerns ever Maine's wellbeing before being elected to Interpol in two thousand sixteen ... hung way was vice minister of public security in China Eleanor Beardsley NPR News Paris\nSecretary of state Mike Pompeo is heading to North Korea tonight hoping to set up a second summit between President Trump and Kim Jong on today he met with Japan's prime minister ... reassuring him the Tokyo concerns won't be forgotten\nOr you know our view which will be North Korea\nJapan worries Washington will cut a deal with the young young limiting its into cannot continental ballistic missile program but leave it was shorter range missiles\nThat could hit Tokyo I'll pay also plans to visit South Korea and China on this trip you're listening to NPR News\nIn Twenty years since the brutal murder of Matthew Shepard in Laramie, Wyoming he was beaten and left for dead for being openly gay as Cooper make him of Wyoming Public media reports on legacy of shepherds death is the white collection of artistic responses\nTo play the Laramie project was the first major work inspired by the murder was constructed from interviews with locals just after the event\nOf art songs poems and theatrical interpretations shepherd story ... Johnson is composer up the Cold War considering Matthew Shepard he explains why artist become part shepherd legacy it helps us grief together\nSo that alone is is one in a significant aspect of a way that performance in performance art music can hold a story and give us deep possibility for processing\nJumped in his touring his production around the country for NPR News I'm Cooper him a gym in Laramie\nArtwork created by the artist Banksy self destruct at moments after it was auctioned off at one point four million dollars a record price for the artist the stuff was apparently orchestrated by the elusive street artist himself\nThe spray painted canvas girl with a balloon was auctioned off at Sotheby's and London last night but just moments after it was sold alarm sounded and then the painting ran through a shredder that was embedded in the frame coming out the bottom end strips\nSo at the beach says it was unaware of the stunt unless that it was going to happen and it's not clear if the artist was never revealed his full name was there I'm Janine hurts NPR News\nSupport for NPR comes from the financial services firm of Raymond James offering personalized wealth management advice\nAnd banking and capital markets expertise along with the legacy of putting clients financial well being first learn more at Raymond James dot com\nWelcome to says you a game of bluff and bluster words and whimsy [noise]\nNow joined our panelists and your host this week ... [noise]\nMartha's Vineyard Hebrew center in vineyard haven Massachusetts Welcome to says you a simple game with words played by two teams the first of which sits stereo left\nThe first thing you ever heard her say on says you in season one episode one round one was a missed Carolyn Faye Fox [noise] in season one episode one round one he can be heard saying first of all your questions wrong [laughter]\nBut one round one she can't be heard saying anything because her husband keeps interrupting her\nHands [noise]\nToday by how 'bout already yeah Mitch regrets there during ...\nTo the right team to in season one episode one round one he can be heard amusing but there's an enormous number of holding here Mr Tony ... and\nShe's in one episode one round one is the first time we ever hear her say no more sports questions misprint enact bar and in season one episode one round one he's heard making the on refusal offer Francine I took the last one I think this is yours Mr Barry no longer [noise]\n... we had stayed in character I must say that he is going to lead our team\nVery will be the captain and all of that really is true guys are game is played in five rounds correct answers are worth ten points or any French and the roads deemed appropriate we always advise new listeners to grab a pen and paper that we've always done it\nBefore we begin it's worth noting as soon as you landmark today this is the first time in over four years that all six of our original panelists have sat together it's nice to have you back in the hope\n[noise]\nMake a gesture and I'd like that I think they could call this um original sin tax [laughter]\nLine up we had all the way back in season one episode one\nThe very first episode of says you ever was taped almost twenty two years ago at the Charles hotel in Cambridge, Massachusetts ... brave panelists five classic grounds\nSo let's begin today just as we began back then with a round of common threads and for his assistants our thanks to W. R. V. O. listener and prolific contributor Dan ... of mentally is New York ...\nThink [laughter]\nThat fresh\nWho knuckle ham a gym and tomato oh of course sandwich [noise] that's right on\n... sandwich ham sandwich tomatoes and ... with the score thirty to twenty nine are nice team just barely in the lead we'd go on to round to the contribution of WC a listener ... foster of ... Massachusetts it's the first of the says you bluffing rounds played with a little musical help from our friends ...\nYour team will receive a card one of those cards gives the actual definition of a real but unfamiliar word the poor souls who received the other two cards will have a few seconds to make up a definition on the spot good enough to fool berries team ten points are up for grabs to bury if he can spot the truth teller or do you Arnie if he kept\nA few moments musical enhanced to come up with a definition for the word to\nMosques bunker M. O. S. S. B. U. N. K. E. R. mosques bunker so Ian John [noise]\nUndo season begins for all of us here at says you and this November as the bystander migrating and the bears are hibernating saddle up for Bozeman in Philly yes to live shows tickets from Montana\nWill be released this week you get yours before the snow begins to fall check online for tickets an old the grisly details as always had says you dot net that's essay why yes Y. O. U. dot net [noise]\nSays you pause it for a few interest digital announcements\n\nIn the shadow of a contentious confirmation process the Supreme Court start its new term I look at some of the contested cases coming out and\nBrazilians head to the polls to pick their next president the front runner a highly controversial right wing ideologue who has divided Latin America's biggest democracy Sunday on weekend edition and PM tomorrow morning at eight on WC a a\n\nAnother rendition of his conversations with the elderly on the Cape and islands by artist David Greenberger\nIf I could meet anybody I think I'd like to me ... I Would love to talk with him about time time intrigues me are we living in the now or it's time moving or we were me\nI Can't figure it out\nI think it's one of the mysteries of the world besides why are we [noise] I Would like Nancy Drew a lot of my question\nThat's why I'd like to talk to him because I have a feeling that he found the answers to a few of those\nThose western to bother me didn't bother him he was one thing after all the way I Know the answer to the question I have because you like\nMyself I'm All right\nYou're listening to the Cape and islands NPR stations [noise]\nDo you blame it on base John's even on guitar Samara Oregon keyboards and rubbing salt on percussion in drums thank you so much guys for giving us a few moments\nWith the word must bunker MOSSAD B. U. N. K. E. R. let's go first to Carolyn most bunker\nIt is maintenance man slang for a stalled elevator filled with cubicle workers end an awkward silence\n[laughter] it's Archie brother\nGot to go fix\nIt gets pretty right than there\nAre right it's a stalled elevator or Arnie\nIt's like it's like if you're given a lemons make lemonade it's it's a it's a a fish in North America that I really couldn't sell because it really stinks to high heaven so it's been used for many years to make fertilizer and sometimes more oil's [noise]\nOil's effects it had more oil more oil you know make a boy when I got it\nThink the fish I sticky fish\nOr ... well that's the part leftover from the early days of the linking you know cave exploration meaning a shoe caked with algae from exploring in the dark and damp Mm algae cake [laughter]\n[laughter]\nWell there you have a very it's either a shoe caked with algae a stinky fish or a stalled\nElevator which one is it they all smell\nYou've been off and the [laughter] installed elevators do you have any idea how Tony and\nInclined to this stinking fish we are indeed\nYou're inclined to think that a mosque bunker is a fish that smells and could be used for fertilizer\nYep it's it's also more that is the only one which seems to have\nKind of relationship to the real world if you know what I mean it's all the others are shaped so specifically attuned to a problem that I don't think\nYou'd find the ... I mean imagine going along let's back the yelling that when we're not by the end the algae coverage you again I just think certain ... certain objects never get words because they're just not as significant enough\nYou know they don't get to make it as a book just about big book she goes you're\nUp All right yeah we will go with armies definition that mosque bunker is a fish that smells bad but makes good fertilizer Arnie ...\nThey think that most bunkers a stinky fish would have thought that I'm just reporting what does your guard say\nIt says a North American fish [laughter] not very tasty kind of shed like mostly use for oil and fertilize there's an interesting footnote\nIt says his origin is Dutch most likely this was the fish the Native Americans taught the pilgrims to plant with their crops not too far from here\nThat are score now is thirty nine to thirty with berries team surging into the lead and please help me thank our hardworking scorekeeper today that's Terry's oh bell William [noise]\nLet's continue our around by round reconstruction of the very first episode of says you with a reprise of its third round which was a round up says who\n... ten points simply named the author of each of the following lesser known lines and you're not you should be able to work out the authorship from the style and substance\n[noise] Carolyn who wrote this your wig fits very well the last ... looking at her with an expression of admiration it's the shape of your head as does it well well right that sounds a British it shape it here\nA sense of Washington yes is this Alice in wonderland who wrote it as the question was Harold Harold [noise] you know\n[noise]\nThat is from through the looking glass and actually it's from a chapter was deleted nobody wanted to read about a wasp in a way to get it [laughter]\nTony who said this your vote your dumb vote your ignorant vote your wasted vote put in an administration in Washington DC that has seen fit to pass every kind of legislation imaginable saving you until last then filibustering on top of that\nCould be Sinclair Lewis [noise] uh no it's not Sinclair Lewis good guess is is is it from Mr Smith goes to Washington no is this a novel it's not a novel into speech oh\nIt was set in Nineteen sixty\nFourth that how are you oh oh well then it would be a ... a Goldwater\nPerhaps would you like a hint of yes in that\nSame speech he also said we want freedom now but we're not going to get it saying we shall overcome we've got to fight all the way over there I'm pre\nWas it was it a LBJ ... no it was LBJ was more of the target of this but I'll give you another one 'cause I hadn't\nActually it's a big thing yeah\nSure sure and I liked that line up\nBut I'm not sure if you should you know it is either\nA term of abuse for an uneducated or unsophisticated peasant a short beak to South American bird or the offspring of a woman and then they'll pack Ernie it's definitely one of those three up to you to choose you know this is ... this is now one of those situations\nWhere as we've been doing the show for years and years and years and then Tony gives a definition and we all go what the ...\nOut by the editor to give ... through right now [laughter] I mean\nTo be a lot of talk a lot of my pocket it could be you know a\nAn aunt merging with a muscle or I don't know [laughter]\nI Know you get your America\nA lion and a lamb sort of Becker ally and [laughter]\nOh I'm so I agree with you I I really think all of us are likely to be huh animal\nOf mixed heritage Peron ...\nWe're going to go back ...\nTony they say that worry so is the offspring of a male and female alpaca\nShortly the chest [laughter]\nWhat does your card say he says the offspring\nOr a male or female out back\nIs that Tony is that in fact ... where it is a catch ... and it's the only catch a word I nothing clean to know\nEach week our listeners write in hoping to be here nearly last but not gotten rounds from our earlier shows\nComedy with the spotlight brown\nAnd for us the chance to spend a little time\nRich creator writer\nFor seven points pleased to find the following theatrical idioms and additional three points if by some miracle you can find the derivation Carolyn ... ... ... he\nAsked a stripper yes well it comes from the U.S I think it's the Greek for the shedding of skin by a snake well tend bar [noise]\nA for an additional point you know who came up with it do I know it was just the runway yeah she was the instigator but who actually coined the word ...\nH A that's exactly right this age I'm making\nYour Tony break a leg\nThey wish a that is bestowed upon every person before performance meaning hope you have a great show ... exactly um break a leg\nI think comes from a performance of mud bath every weird thing in the theater seems to come from some bad performance of Macbeth or things went wrong including whistling not whistling before a performance\nAnd uh I think um probably um it was a way of certainly a way of warding off a danger by you know I\nKnow that's the superstition it's ... it's like anything to do with the curtains no originally thought to have come from the concept of being so successful\nThat one would come up for a curtain call and take such a low bending bow that the leg would literally break Ernie that's our any locally\nOkay she was a sharp shooter and the buffalo bill days and the Disney hit you target hit your mark yeah\nNo that's not it anyhow ... well it's a free ticket and uh resembling a which is punched resembling that the resembling any oak leaf marksman ship trick of throwing a card in the air and having a ... call shot through it\nTop banana well\nThe top banana is the star of the show is it not\nUse the head of the second and he was laughing at it was the the funniest ... the main line comedian\nYesterday in a vaudeville that's seven points and how we get and the derivation\nAh this is in dispute so you'll get points for almost any [laughter] who is in dispute ... yeah well\nThe scholars uh [laughter] the dollars in this very well just to study this route scholars uh [laughter]\nThe vaudeville players bananas because they were inexpensive backstage and a guy that was the funniest was able to take the first one uh give her a point\nFor sure I say I have never heard that but it's worth a look for that he was doled out the highest price that's another point for that 'cause that may represent corporate funding\n[noise]\nAny other guests ah before I had a great appeal\n[laughter] so full to influence yes [noise]\nIt's origin is disputed but some sources say comes from the old slip on the banana peel routine which always got the biggest last Paula Markey\nMarkey is is the is the light it sign outside the prison it that that is and they didn't see players and then\nThere was a more germs [laughter]\nThe marquee refers to the to the star and cats are the kids on the block Markey mark [laughter]\nWell there's going to be some points in the marquee means Maria where a well now you're on the right time around the right All right it was considered noble tap your name in life [laughter] yeah [laughter] oh give them I'm not yeah them there tend to insist they marched\nYes actually it's a large tent or canopy in front of a theater with advertising lights indoor billing but it was originally a large field ten used by an officer of high rank or noble stature such as any more questions\nFinally burying deus ex mocking the God from a machine is the deserts back now that means a sort of unexpected and somewhat mechanical resolution to the problems facing the characters in the play and it comes from\nThat's what they would do is they would actually lower ed God like figures from a crane like device onto the stage that's exactly right\nNow back to the game at hand let's close our celebration of the says you origin story by revisiting the same game that close to our very first episode\nWhat's the difference contributions come from John sorrow Seattle and hall of famer bill Spencer of copies bill Maryland Carolyn ... what's the difference between unexplainable an inexplicable\nAn unexplainable means that there is no explanation for it inexplicable means gosh that's amazing and complicated and\nComplicated you are split company exactly backwards backward the other way around I don't know [laughter]\nWe're not right [laughter] they both implied difficult to explain but unexplainable implies that the difficulty lies in the explaining not necessarily in the understanding inexplicable implies not likely ever to admit of any explanation\nFor example the thought processes of politicians are generally unexplainable those of the voters in ...\nTony yes what's the difference between rules and regulations\nRules are the basic uh you could call it back bone uh the structure of an organization regulations are the individual a specific uh strictures on some specific kind of activity that\nIs what I thought as well and it turns out to have nothing whatsoever to\nDo with the rules are can be stated interest general for regulations require numbers [laughter]\nThink like Roberts rules of orders and versus regulations about how you have to uh put in a fire extinguisher stuff okay I'll think about it\nAlong the way they're so think auto or a rule can be a an agreement about how something will proceed or how as something will be done\nA British rules of order something that this is what we all play by a regulation is a set of requirements to\nImpose on people that are doing some activity or for instance in ... installing sprinklers to suppress fires\nYou have to you have to obey these regulations and meet these standards ... measurements maybe regulations one of those measurements one is an agreement the other is an imposition by the government thank you [noise]\n\nBoth are set of instructions but only regulations are legally binding regulations are authorized by legislatures set by governments and enforceable by law rules are just rules that's right ten points for that Ernie and what's the difference between what ever and what so ever", "year": "2018", "show_name": "Says You", "city": "Brewster", "day": "07"}