{"month": "10", "state": "GA", "station": "WSB", "content": "Mexico beach looks like a war zone houses off their foundations metal would trees litter the roads bulldozers bulldozers cording off the debris some people returning home to see if they can salvage any of their belongings\nPresident Trump heads to Kentucky tonight for a mock make America great again campaign rally no one hits the mega millions jackpot last night so the money six hundred and fifty four million rolls over to Tuesday night the Powerball tonight three hundred and fourteen million basketball\nThe hawks lose to the heat won Thirteen to one Nineteen WIP news time nine thirty one trafficking whether next\nMonday morning news going you need to know about the planets city council pick it up ... large power suffice building for credit worthiness triple C ... ridge every six months or something like five and have said\nHey although Halloween as a holiday photos scares and surprises choosing where you buy your next vehicle shouldn't be\nThat's why I gladly river all my friends and family to a gym Alice Chevrolet why because they always go above and beyond to exceed my expectations kind of like those houses that get a full sized candy bars Halloween and the savings well they're hard to beat especially this time of year\nRight now Jim Ellis Chevrolet you could say twelve thousand dollars often is our pee on all twenty Eighteen Chevrolet tacos in suburban ... eight one to seven\nIt's in Mississippi is fifty three thousand nine Seventy one after rebate to the gym ... discount you're paying just forty one thousand nine Seventy one just added ... states the tickets for me by your next vehicle doesn't have to be a fight for the experience especially when you could shop by and trade your way a Jim alber Chevrolet\nMore details visit Jim Ellis Chevy dot com or stop buying Peachtree industrial just inside the perimeter\nTell them Scott slate sent you to find new roads ...\nDo you have valuable jewelry at home you simply never wear well your trust ... Solomon brothers wants to buy that jewelry they make offers year round and October ... to the twenty first there'll be hosting a team of luxury estate jewelry buyers from New York\nThey'll about your weight your pieces I make you an offer on the spot bring your goal diamonds watches and designers shine jewelry they'll offer you cash to learn more set up an appointment visits Solomon brothers dot com\n[noise] this is Richard bishop owner frugal kitchens are slogan as life happens here and we mean\nOctober is an emotional reminder for those who have been affected by breast cancer my wife Vicky is battling this awful disease and I pray every day for here where something pink into any of the ... and we will take two hundred fifty dollars off your kitchen then donate two hundred fifty dollars to breast cancer research plus you get free granite countertops Google frugal kitchens and thank you for your support [noise]\nSomebody asked me this time nine thirty four now live coverage of traffic and whether deal Nelson live in the ws be twenty four hour traffic center a\nCrash gone from the left leaning on the Internet and twenty five west down just passed that sixty Riverdale road that is just passed the construction zone where two left lanes are blocked by road work\nOn that in early ... from Jonesboro overpass Seventy five you know forgot to left lanes block to find each found out early from fifty my ... I twenty four lanes blocked by construction this is a travel advisory Seventy five north bound\nFrom ... to cameras these highly forty one of the expressly this alternate I write laying off a cliff Seventy five South Africa exit two Ninety how we twenty\nDown to old Alex ... that flew she there 'til now since the ...\nI had a ... with us most accurate and dependable weather\nForecast with lots of sunshine today will keep mild temperatures around after are cool says this morning we'll tap out near Seventy two this afternoon overnight and into tomorrow morning a few caused down to fifty six partly cloudy and dry Sunday a little warmer with a high of Seventy seven on Monday partly cloudy low sixty three high eighty one\nI right now fifty nine degrees at nine thirty five I'm Robin ... on the line is exclusive twenty four hour news weather and traffic station news any five five and seven fifty ws speed depend on it now David Baker and the home fix a child\nYou're listening to the ... news Ninety five five and am seven fifty W. S. B. yes it is the October thirteenth edition of the home ... show yes\nNo bulldogs are playing I'll ask you this afternoon and a big FCC match up and yes you can hear all the action right here\nPre game show and eleven thirty tailgate show at twelve thirty play by play action at three thirty right here on your home with their dogs news Ninety five five and am seven fifty W s be listening to your guys got Howard Eric desire and Neil ... Williamson with all the\nGeorgia bulldog action right here on your home with the dogs W. S. B. this is an encore edition\nOf the home fix it so lots of information lots of entertainment coming your way that's why the show got selected if you hear any mention of a give away or anything along those lines this is a recorded show so just kinda let that go let that float by ignored those as we move along this morning\nWe are here till eleven thirty this morning due to Georgia football and as we go back to the programming I got caught doing something that you should never do in broadcasting\nSorry the piece of hard candy during the break and I thought it'd be done in time but now I'm salivating you are wrong I was the first time I've been wrong today\nLike to thank John ... from march thing real estate for being in earlier today helping he'll actually be coming up in the next hour or so stay tuned right here you go look on your face you're going to say something Chris rich\nNow I was just wondering who that was in here because I couldn't\nHear through the through the there's a Boeing ... Chris riches here now with a cooler a heating and cooling taking your calls at for all for eight seven to zero seven fifty Danny I'm going to be with you in less than thirty seconds here's something instead of twice that I Would not due to an Eighteen year old unit\nI don't care who's telling me I Would not do this I Would not spend more than three hundred dollars to fix anything on that unit and I would be hesitant to spend three hundred dollars\nAbsolutely I Do have an earmark in mind if it's over generally they say the publication say Thirteen Years is about the average lifespan yeah unit if I'm looking at a system over over ten years old and you're going to have to spend three to five hundred dollars on it\nI'm giving you those options but I'm also steering you towards putting that money into a new system yeah and that's the money well spent\nYeah you're just wasting your money absolutely the maintenance thing to you're wasting money if you're spending that kind of do on anything and especially if they're coming out repair repair repair you repair three times and you're spending fifty bucks a tie you know and that's not worth it\nYeah it's not worth your obsolete out till customers if it's Eighteen years old that's about two hundred and eighty in dog years so [laughter] time to go\nAn old dog to sleep you would know about all dogs ... an indicator your own home fix that show welcome\nDanny I think Danny aiming ... oh well it could be any but there's a D in front of it\nWell I um any from solar\nThat would be you then we'll just go on any DNA from that cater okay from now on the show any you just say you're Danny in our movie rights as topping the list\nKate taking no product can I ask that question sure you can ask if you want to\nThank you I'm not a problem with their ... you know it's been over Seventy percent\nAnd no matter what I ... it's not removing the humidity at ... see people come out everything was normal\nI don't know what is the problem I don't know\nWell there could be a few things I mean it looking at an air conditioner is a giant the humidifier as it runs it ... it could be a number of things if the system is oversized\nWhich a lot of people think bigger is better on air conditioners is not if it's oversized it does it will cool quickly and not run long enough to do humidifier properly so you want to make sure the system sized properly to begin with\nAnd also if you have a house that's got a lot of leaks ah elites infiltration from air from outside a lot of people on the thermostats will run the fan and the ... position\nThinking that they're circulating air constantly and filtering well when your system shuts off and it's not on Andy humidifier but that fans running you're drawing air in from outside what you just re introducing humidity to the house and make sure you're running it in the auto position\nOther than that it'd be something that we really looked at her okay not go\nGo or does your house it over across his\nChest yes it does okay\nOkay you have issues with the cross base at very humid in your house sucking call\nBasis completely dry in it as it is ... years old and it's the same size as they ended up for twelve years I did not on the hand around the world and the ultimate\nDon't let Mother Nature beat up on your home visiting rhino shield G. A. dot com\nOr call six seven eight to zero five forty five hundred call today to receive your twenty five percent off and how about for our listeners thirty percent off for you Eric anything what he wasn't supposed to know you're telling me [laughter]\nSounds fine go\nHouse to\nWindow shopping oh I don't mean to find kind of window shopping on talking about that have to replace those awful drafting rotten things in my house window shopping Hi this is tainted some explanations and I got a tip for you we make window shopping something that you want to do\nNot have to do how well for starters we offer lots of window options in final would clad and PVC and just wait until you see all the styles shapes colors features of these babies the activation steam will show you windows that suits your home your plants and your budget all backed by the best\nWarranties in the business and our own workman ship warranty Plex would explanations you'll get your new windows installed on time\nOn budget and without all that stress that you usually hear about in construction ready to window shop at Fenway schedule your free click to day at ... dot com that's easy access to the A. T. I. O. N. S. dot com\nArm Tom shame hey guys wrote in Chanute was shamed company\nThat you just got back from Bangkok gemstone capital of the world yeah and it was another great trip\nOur customers have been asking for pink green and blue sapphires I found those plus a lot more colors you're always saying that you need sunlight to judge each stones color I Know you won't buy sapphires on a cloudy day I Can't I Need to see their true colors besides our strict color standards\nIt's critical the shame companies south fires are perfect three to maximize their brilliance in fact I oversee the cutting no beach stone that's another reason why our ... fires are pretty are because we select and import our sapphires directly from the source\nWe offer you the best value our fashionable jewelry with my dad's beautiful stop fires makes the perfect gift for any occasion now you have a friend in the jewelry business shame company and shame co dot com\nPeople ... days let's face it we all have the same twenty four hours in ... in order to maximize our term\nThat we use social media tax and emails instead of mailing letters or use mobile banking ... instead of driving to the bank or even ordering things ... going shopping you ... your life to be efficient what about your home\nHey this is Rick and Renee from attic innovations we know all about making your home more energy efficient and saving money on your energy bills\nHow poorly insulated addict allows air to leak out of your home causing icy unit to run more off\nAt ... one hundred percent lifetime guarantee on all of our etiquette innovation products\nA lifetime guarantee and some of our customers experience energy bills savings about ... thirty percent\nDon't let your addict has your home to be inefficient call us at etiquette innovations today seven seven three eight three Fifteen fifty or visit addict innovations da da dum\nAnd it ... Ga dot com\nThe scotch late last wanting news or W. S. B. R. twenty four hour news sitters you're all weekend with a four times an hour to fend on it and we're here Monday morning for thirty for mine but breaking news is rather good weather every six minutes he was Ninety five five in age seven ... years they bigger and more home fix that advice [noise] welcome back\nTo the home fix that show you're listening to news Ninety five five and seven fifty W. S. B. as we get closer to the big game with LSU a tribe before ten o'clock that's what we have right now\nDon't forget the pregame show coming your way of loving thirty\nTailgate at twelve thirty kick off at three thirty here all the action right here\nOn your home with the dogs news Ninety five five and a him seven fifty W. S. B. the weather's brought you by Stanley roofing free free roof analysis is going to Ruth Ruth dot com you can sign up for an appointment right there it's free no obligation no charge your house could probably use one if not\nWhat the heck it's free you know little piece of mind\nThe weather is it going to rain is it going to be warmer I don't know or to bring you up to date and about ten minutes right here on your news weather and traffic station news Ninety five vitamin a and seven fifty WSBIU and don't forget about the what's bugging you feature\nSponsored by break up pest management go to my website to help fix a page dot com\nGo to the experts column click on pest control and right during the middle of the page on break up pest management it will say what's bugging you put in your name putting your email address and then fill out the Blake of what's bugging you and it goes to bugs and critters\nIf we read your\nUh injury you not really that treats a question Matt break the answer is all the questions and if we read yours on the air\nYou'll win Seventy five dollars off any service that brighter performs\nThat's what's bugging you feature presented by Brenda pest management using doing encore edition of the home fix that show right here on news Ninety five five and seven fifty W. S. B. excuse me coming up after the break we're going to talk to John McCarron which he's with march Spain or real\nEstate round take real estate calls and questions is a great hour and a half coming up you're listening to W. S. B. [noise]\nWs beef traffic came as another way to warn you about red alert problems during your commute to know what you asked me triple pain traffic alerts on your own\nPlenty and where you're trying to go you can put your cell aside and it'll where'd you go in there somewhere in the area that you're going to have the traffic is useful\nBut they weren't automatic ... touched dial to the U.S wheat products that are on another double USB advantage\nYou all depend on WSBIU traffic came during your daily commute give yourself one more line of defense against major traffic problems in the u._s. be triple pain traffic alerts on your phone\nI Want to get a ton of time coming down\nOn the side or automatic when us be audio alert and another W. F. or your marriage when you asked me triple again trafficking alerts\nSometimes you know you're right but it's always good to get some validation Erich von ... here to say congratulations to my friends at simply roofing\nFamily roofing has just been named residential roofing contractor of the year\nThat's right the roofing company that I trust and recommend as one the biggest national award for the entire roofing industry that means they're the number one roofer in America for customer satisfaction and quality work been ship that's why I recommend didn't believe roofing\nSimply roofing sets the standard for roofing excellence locally owned and operated nobody replaces or repairs more Atlanta area roots that's why they're Atlanta's most trusted and recommended roofer\nWhen it comes to your roof and keeping water out of your home don't settle insist on the very best schedule your simply roof free roof analysis today at a roof roof dot com\n[noise] Erick Erickson like air air I\nI drive home now she's in the have tell the truth I also\nPolitics shall not only agree with him but he is going to listen to you\nNever know what are you going to see what you always know where he fan by till seven on me nutty fought by hand am seven fifty W. S.\n[noise] Erick Erickson pong don't you\nKnow like is honesty brutal\nIt just makes sense for parents a lot of people that are out there I respect\nFor the latest and current events and true\nAs fast knowledge of managing campaigns and he brings say understanding to other news current events get ...\nAnd a lot of the evening news the information you need to\nYou do mandate nice by bill ... W s\nMe twenty Eighteen mid term elections Republicans and Democrats battle it out for control of Washington and the state of Georgia follow it every step of the way we do pre and the southeast largest news team amused by by hand\nAm seven fifty don't you ask me that when you ask me about ... er Cox media group station\n[noise] twenty four hour news weather man from\nFive and a um seven fifty\nMe want to\nKnow his morning it's ten o'clock I'm Robin ... live in the WSBIU twenty four hour news center with our top story this our college football week seven the dog face LSU in Baton Rouge soldier fans of build New Orleans last\nEight hours and are now ready to head north to wipe all for the dog has a chance to prove the number two ranking is for real with some doubts ripping it over the last month's\nForce questions that our deepest ... there'll be answered this week\nAs ... as you can imagine a pound for pound a talent for talent with two top ten wins already bought adult last last week but it'd be agree they're going to have a chip on a show them after the retiring God when you do have a seven point favorite ... sorts of Lebanon thirty kickoff return from Baton Rouge Jay likeable to us by phone right\nIs the only time a that's a great time to sell and so there are people move for a variety of reasons empty nesters you know young professionals millennials are job transfers often drive um a lot of activity so the fourth quarter and the Atlanta market is usually about twenty six to twenty eight percent of our annual sales volume\nThat's that's pretty good that's right if you split up into a hundred that's a quarter that's it doesn't get any easier now as the easiest mad like and do all day absolutely yet for all for eight seven zero seven fifty is number I have questions but more importantly you have questions so let's get your questions on the phone you ready\nSandy isn't Atlanta Sandy first called the day on a Saturday hang on one second before you say anything Sandy I got to ask this and John is Sandy a man\nOr woman [noise] I'd say a woman All right Sandy what do you get on a Quaker hey hey\nHey there he's eyes on from one that's right [laughter]\nSo I have an elderly\nFamily member is half half cramped completely ... anti was wondering is there any kind of a president that exists they can sell the house now that still live in it for six to twelve let's try to sort through all that stuff and get rid of the house\n[noise] um I Would say it would be tough to call it a program but certainly there may be could be an opportunity with certain investors who would be interested in maybe the property\nI'm and would do some form of her rent back where um you know the family can rent the home back from them for a period of time um so you can work through the antiques and you know making sure all the family heirlooms are handled appropriately\nUm but that's you know a situation where it would be you know more of you and your realtor working together to identify investors that could potentially be interested in the property is a rental property and negotiating that\nSo unfortunately I don't know of any particular company that would do um that type of a program but it's certainly possible it would just take a certain type of buyer\n[noise] ... it's called a wreck back\nWell that's sort of an industry term but yeah so basically the the new home purchaser um purchases the home and then rent it back to the um\nUh you know previous owner and so it would be negotiated like any other release um you know and there would be tenet writes landlord writes all that\nUm so it's usually something I mean we've done it before certainly um anything over thirty days I'm usually becomes a lease versus more of a temporary occupancy is less than thirty days sometimes it can be negotiated where the seller stays for thirty days or less\nUm but maintains home insurance and maintains the utilities um and it does not create a landlord tenant relationship and so that has certain advantages to the new homeowner because if say for example the\nAh previous owner does not leave at the end of that thirty days they don't have to go through an addiction process so anything beyond thirty days you're going to look at more of a really a leaf situation so it's absolutely possible but you know when you put your home on the open market it's hard to control who has interest in who doesn't\nAnd so it could be where you're getting offers that or a compelling offers but maybe that homeowner isn't willing to do the rent back\nUm there are some programs out there and some companies that can help with the um you know sorting through all of the uh antiques in in you know personal property and help you move through that process a little more quickly so that may be a better option and in that way when home goes on the market your opening it up to the white is a possibility of buyers\nAs Sandy allowed to Wade through any offer she may get to look for somebody who's doing that or does she have to take them in order and if I make an offer and saying he's house she's obliged to sell that house to me if I give her what she wants so\nWhen you're working with a realtor are often times were using um a sort of a George association of realtors a contract\nAnd the only thing that could really come up is if the full price offer came in with no contingencies and agreeing to everything that the seller wants in this transaction then a commission could be a vote even if the home doesn't sell\nBut the condition would be that this red back I'm as part of the agreement I'm so there was no obligation to sell just because you have your home on the market um you can reject over full price offers if for some reason there's something in it\nI'm clearly the only thing you would have to be thinking about are a fair housing laws and things like that you can't reject the offer because of\nThose fair housing things like race you know I'm a religion et cetera\nUm but yeah there is no obligation to sell your home simply because you have it on the market are the only risk would be is if a perfect offer came we wouldn't know contingencies\nTheoretically real estate agent could demand a commission or I can speak for our company we would never do it just because of the bad publicity and press and you know ultimately our goal is to help the client with what they want and not just to earn a commission\nWhich thank you Sandy lock and key by yep extending\nFor all for eight seven to zero seven fifty is the number I had a question right to set the head and it just went right away ah let's go on to the phones John in Hampton John you're on the home fix that show the morning\nYes sir my question is I've got a house it was built in the late eighties and and the last year bath is showing its age ... and the two\nI'm Scott like fiberglass shower and stuff from wanting to put the house on the market or this next spring and I'm just wondering July shovel a lot of money and remodeling this old master bathroom or or do I just left to the buyer choose what they want to do\nSo generally I Would recommend letting the buyer to choose what they want to do um is the rest of the home or in like for example if you upgrade of the kitchen um since you've owned a home or is it also sort of in that original condition\nWell it it\nIt's got the original cabinets and counter tops but there are excellent shape or re did the the floors so I think I can leave them like they are\nSo what we would also want to look at it as the condition of the ... the neighborhood or the homes nearby um if if it's common for homes in your neighborhood to be a an original condition than I Would not recommend putting a lot of money into a master bathroom upgrade\nUm you know generally what can happen is you're going to have certain taste that maybe the buyers don't have taste on so if the home is all in great condition but just maybe some of the um aesthetics are a little dated um just by nature of the fact that the homeless built in the eighties\nUm my advice would probably be to not make those upgrades and save the money it may mean you take a little bit less in terms of the sales price but generally when you upgrade a home kitchens and bathrooms I'm In particular so close to when you sell you're not going to get a dollar for dollar return on those upgrades\nUm if it wasn't really bad condition and you just you know you then you would want to look at it but if it's in good condition just data ... um I Would not mess around\nAnd with the uh full bathroom renovation\nWhile not in a neighborhood are shut on about eleven hackers mhm and out in this really pretty rural area yeah oh yeah it makes you know it doesn't in fact in that case I Would I then I Would\nAlmost say say to not do the renovation I think that you know somebody looking for a Lebanon acre property down in Hampton\nUm you know they're sort of a unique buyer and I don't know that a a full bathroom renovation would be as compelling as probably the land itself and and you know giving them the opportunity once they purchased the home and come up and do the upgrade they want to do makes more sense\nSo combined with the hassle and the fact that generally that close to a sale the dollar for dollar return won't be there on your investment I Would advise not doing that bathroom renovation in working with a real estate agent to come up with an ineffective pricing strategy for the home in its current condition\nYou're listening to the whole fix it showing unconditional the home fix that show and you're listening to news Ninety five five and am seven fifty W. S. [noise]\n\nAnd I do go really carrier WSBIU twenty four hour traffic center we've got heavy delays on I Seventy five north down where am I doing far to the north one twenty loop we've got at least four right lanes block\nWas um roadwork there they also have the rams through the south loop also close also the north bound ran to the north lupus also closed for this\nOne of us do grow or the get road conductor as your alternatives to get around that ... was power also see some delays from the river broached ... or ... Seventy five for road work as well as somebody via cellphone or Doug connect herself now from Brooklyn or diving you also see some delays with us from tailgate traveling\nFor the other game that's going on at noon on Fort Allman ws\nBe [noise]\nI'm satisfaction ... with us most accurate and dependable\nWeather forecast with lots of sunshine today will keep milder temperatures around after our school started this morning we'll tap out near Seventy two this afternoon overnight and into tomorrow morning a few clouds down to fifty six partly cloudy and dry Sunday a little warmer with a high of Seventy seven on Monday partly cloudy low sixty three high eighty one\nSure might be a fish will plumber about a lot of homes\nOn you as the Herman Cain is daily pure Cain perspective I Am going to ... filtered unscripted shows fewer Cain I don't have to be politically correct every day lemon ... pie six I'm not tall\nFollowed by the U.S be expanded news at noon but\nAm going to stay the fat Herman Cain's daily fear came perspective every weekday at eleven to say on it Leno's news weather and traffic station is ... ... am seven fifty I guess the\nCompanies in business Twenty years aren't doing it right superior approach terriers does everything exterior is right and have\nBeen for Twenty years Twenty years equals trust quality value and seamless customer experience Hi this is David Baker congratulations to my friend Irwin whites and his team on Twenty years is appearing your craftsmanship\nTrump calls Brunson a great Christian who endured a tough experience the president by the way\nWill be attending a monogamy make America great again rally tonight in Kentucky\nAt least Seventeen people killed in the aftermath of hurricane Michael\nOr that in Mexico beach just in ruins the clean up and the search for people still missing continues at this hour no one hits the mega millions jackpot last night so Tuesday night he rose to six hundred and fifty four million you have plenty of time to get it on that\nThe Powerball tonight three hundred and fourteen million basketball the hawks lose to the heat won Thirteen to one Nineteen W seniors time ten thirty one traffic and whether next\nFight for your vote this November could determine whether Washington underscores for undermines the agenda follow the mid term elections every step of\nWay without power inexperienced new study by five AM's them an fifty you asked me if you have\n... votes foundation walls cracked and your record drywall windows and doors sticking are sagging or an level hors ... you have a serious foundation problem this is Dave Eggers hosted the Olympics that show it my whole thing's foundations expert Tom ... owner avant garde foundation solution we specialize in all forms\nOf foundation repair including foundation settlement fixing cracked and mowed walls sagging on level floors putting you back on solid ground\nThis is the integrity of your home votes don't put it off a small crack and turned into a big expensive problems mean trust my guys will guard donations illusions they ended up patented improvements system cutting edge technology that strike here Z and lifetime nationally ... Gita permanently\nFix your foundation schedule your free foundation evaluation is seven seven oh one nine nine one one one more awful guard dot net when it\nComes to your foundations we've got you covered\n\nThere comes a time and every homes lifetime to replace your windows beneath for Marvin fiber glass windows by north Georgia replacement windows have limited lifetime Morsi backed\nBy a company in business for over a hundred years still for life they last a lifetime these are not plastic cheap looking windows infinity per Marvin fiber glass windows complement the architecture of your home for a year round beauty huge savings this month limited time offer at energy windows dot com\nJob placement when\nIt appears we've saved some listeners a lot of pain aggravation and money\nAnd so we're about to get her Dale card well here earlier this year I started warning you about a relatively new gimmick in Georgia companies wanting you to leave your home heating and air conditioning unit their pitch claims everything's free and you'll never have to buy another system and for a small monthly fee they'll take care of everything here's what they don't say\nYour payments may go on for ever and be prepared to pay huge residual buyouts if you want out of your lease see my full report it truck they'll dot com slash no lease\n[noise] in a perfect world it would be no break like fat\nAnd only one sound good drown out your radio [noise]\n[laughter] [laughter] we\n[noise]\nLenient on ten thirty four and a lot team coverage of traffic and whether Lloyd illness I live in the ws be twenty four hour traffic center\nEvery noise when I was somebody bothered large oh gun you know we've got more roadwork out there as well as long as somebody farther north down we're seeing ah just north of ... mountain state park ...\nWe've got a road where they are causing the lawyers to a main street or a car's bill southbound you're going to Jim up ... seats are getting over through ah through just north of a lake all a tuna in addition to that we also have some new trouble is on the interleukin ... responded to the river\nOr the regime cam shows we've got a crash working merits and the left lane on for a woman WSBIU\n... they're all just reading it without us most accurate and\nDependable weather forecast with lots of sunshine today will keep mild temperatures around after our school start this morning we'll top out near Seventy two this afternoon overnight and into tomorrow morning a few clouds down to fifty six partly cloudy and dry Sunday little warmer with high up Seventy seven on Monday partly cloudy low sixty three eighty one time right now sixty one degrees\nAt ten thirty five I'm Robin ... on the line is exclusive twenty four hour news weather and traffic station news Ninety five five and am seven fifty W. S. B. depend on it now David Baker and the home fix that show\nNews Ninety five five and a and seven fifty W s be home with the dogs big game coming up this afternoon I Hope you can join us for that\nPre game at eleven thirty tailgate twelve thirty kicked off at three thirty here your guy Scott Howard Eric desire and Neil ... Williamson right here on the radio he probably hates that but\nOh well we'll deal with that later\nThis is a ... this is an encore edition excuse me of the home fix it show recorded earlier but with a lot of good information a lot of good entertainment value right here on the radio so if you hear references to a giveaways and things like that they've already been given away just save it save your finger don't now the button don't wait on hold\nA we have already taken care of it\nJohn ... from march Dane realty doo doo realtor still drive the big SUV cars in the big Lincoln's and Cadillac when they show people around here you just meet people at houses now\nThere's a little more of that which you know I don't know is a is a great thing I think getting in the car together and spend that time and really get to know your clients probably the best approach but the smart realtors driving Prius these days are they ah they should be right I mean he had a time we spend on the road a gas isn't getting any less expensive Ascher if\nThey go Catherine Alicia might stay where you are going to go back to the phones Catherine gets the first punch a button gathering here on the home fix it Joe\n... [laughter]\nOh it's nothing we are just people here answering your questions what can we do to help you\nWell I'm a retiree and I live in a thirty five year old home that needs a lot of work and I'm going to have a ... of actually lead to house and so I'm trying to figure out whether it's you try to find a flipper you sell it as is I don't have the resources to do a lot of\nRenovations so and it now even how you approach it or do you tell talked to a real estate agent about the best way to sell the house that needs for pears\n[noise] yeah I Would start with the real estate agent and having them do a walk through 'em and you know some of the things you can do that are a little less expensive are painting the home putting a fresh coat of paint on it makes a huge difference cleaning the windows\nUm if there is some wear and tear on the carpet may be considering a considered replacing the carpet those types of upgrades um you know are less expensive than sort of a full renovation but make a big difference um but you know similar to John in Hampton I really wouldn't encourage a huge total renovation it sounds like maybe the resources aren't really there to do that anyway\nUm so just getting the home and really clean condition fresh coat of paint clean windows\nAnd uh you know at a minimum maybe a steam clean on the carpet and make a huge difference um and the good real estate agent could even recommend potentially a staging company who could come in and help work with the what you have and just positioning the furniture and the decorations and a way to make the most appealing\nUm you know in terms of sold as is a I don't necessarily recommend to clients to use that language sometimes for a buyer they they um think that well maybe there's something hidden or maybe their issues with the home\nBut allowing the buyer to do the inspection and working with a strong real estate agent with good negotiation skills who can help you navigate that inspection process and look out for your best interests um but that would be my recommendation just you know paint carpet some of the simple things easier things that are a little less expensive that make a big impact in terms of the home showing\nThis is a real estate agent I Want to ask this question for Catherine doesn't real estate agent know of people who are flipping houses and would be interested in buying a house like that they kind of like a\nYou know you go to a an art dealer and he knows that this guy likes then goes he's liable to buy it and go because he knows he can sell it to another guy do does a real estate yeah I Know of people who are doing that and he was like got an eye out to to say\nYou know this house is a little under marketing navy and they want to get rid of it and so I Know that these people are going to want it I can help me the pipeline and they're\nYeah absolutely so you know it marks being real estate we have a product that could work um you know it's a we work with some um\nAh institutional investors we have our own internal team as well and we can make cash offers on homes enclosed on them quickly I'm In a conditional issues aren't necessarily as big of a factor for a U.S than maybe for a retail buyer you know that by who's looking to live in the home personally\nUm and you know the the there is a slight discount the market value but it's not an extreme discount usually somewhere between um you know a Ninety cents on the dollar but for some folks in situations like Catherine [noise]\nIt's it's the right decision for them um and how we work it as we come out we present both options we look at the market value and we look at the uh guaranteed offer value um so certainly good real estate agents that have been in the business a while should have a network of investors they can work with but um we could certainly uh help as well\nGathering that's great alright thank you\nThank you for the call for all for eight seven zero seven fifty is the number how do we get a hold of them are staying realty we met on march Spain dot com yep marks on his way\nMark Spain dot com um our local number is seven seven zero eight eight six nine thousand or or eight five five to nine nine sold and we have a team of 'em are folks on the phones I'm from eight thirty to nine thirty pm seven days a week\nUm so we can answer any questions you have 'em but most importantly when you left your home with us when buyers call in inquiring about your home those calls get answered live in we respond right away", "year": "2018", "show_name": "The Herman Cain Show", "city": "Atlanta", "day": "13"}