{"month": "10", "state": "NH", "station": "WEVN", "content": "Eighty nine point one W. E. V. S. national I. eighty eight point three\nW. E. V. H. Hanover Ninety One point three\nW. E. D. in Keene Ninety point seven WDC Gore on the one in seven point one\nW E v J Jackson Ninety nine point five\nW. E. V. S. called brook Ninety point three\nAnd W. E. D. cute little ten Ninety One point nine an on line at an H. P. R. dot org\nCan happen between now in the mid term election on November six so let's check in on the big races quickly at this rate everything could change by tomorrow\nFrom W. A. M. U. and NPR this is one egg [noise]\nNeither Joshua Johnson visiting New Hampshire public radio today on on a the mid term\nNext month's election for the answer a lot of big questions how much power does the Democratic blue wave really have are these midterms a referendum on President Trump for Republicans will line with him benefits or suffer most governors right now a Republican what will the margin be after the election and how much more diverse will Congress become\nPlenty to talk about and we love to hear from you too so email us one a double A. M. U. dot board comments on our Facebook\nPage or tweet us at one egg [noise]\n\nLive from NPR News in Washington I'm core of a Coleman the U.S commander in Afghanistan has escaped on heard from a shooting incident that wounded to Americans and killed a prominent Afghan police chief Jennifer glass reports from Kabul\nThe shooting occurred as the commander of us and NATO Forces Journal Scott Miller was finishing a meeting with senior Afghan officials in Kandahar southern Afghanistan about security and upcoming parliamentary elections NATO says Miller was not injured the Taliban have claimed responsibility for the attack\nThat killed powerful provincial police chief Abdul Raziq he was seen as crucial to the security of Kandahar the birthplace of the Taliban with a group continued to have a presence\nResnick was also criticized for alleged torture and running illegal prisons but his death could leave a security vacuum in Kandahar further undermine long delayed parliamentary elections on Saturday for NPR News I'm Jennifer glass in Kabul\nThere's word now from Afghanistan that the provincial intelligence chief was also killed in that shooting and the provincial governor has been wounded\nTurkish and Saudi Arabian investigators have finished searching Saudi properties in Istanbul where Saudi journalist ... went missing\nTurkey says it has evidence the Saudi Government killed him Saudi officials vehemently denying this the Washington Post has chosen to publish ... most recent column is editor Karen ... told NPR's MORNING EDITION the paper felt the column was timely\nWe just decided that now is the week at the time to do it I I think also has the story is moving to a more\nGeo political story a story about us Saudi relations um golf relations I think we just decided that it was good to bring the story back um to mount a huge amount was ... and his ideas\nWashington Post editor carrying a T a power is returning to more communities in the Florida Panhandle devastated by hurricane Michael NPR its housing long reports a few school districts are set to reopen for classes next week\nSchool districts are preparing for students to return early next week in homes county in Franklin County which sits along Florida's northern coast\nThe classes are still cancelled in most parts of Florida's panhandle ravaged by hurricane Michael it's not clear windows schools will reopen for students some school buildings are sheltering hundreds of families across the region as the cleanup continues after the storm\nState officials are now sending up at Base Camp in Tallahassee to provide long term housing for the utility workers and first responders working around the panhandle where more than a week after the hurricane many do not have electricity or cell phone service and you along NPR News Panama City Florida\nThe death toll from hurricane Michael is now up to twenty nine people many people in the Florida Panhandle are still unaccounted for on Wall street the Dow Jones industrial average is down one hundred fifty five points the NASDAQ is down sixty two points you're\nListening to NPR\nIt's tuna for I'm Rick gambling with an H. P. R. news Governor Chris Sununu was during the final stretch of his reelection effort with two hundred thousand dollars more and then his Democratic challenger moly Kelly what does ...\nSupport for an HBO ... comes from you our members and from Dartmouth Hitchcock imagine nationally ranks healthcare in your community was convenient location throughout northern New England world class providers are closer than you think is at Dartmouth Hitchcock dot org to learn more\nStarting with Hitchcock is here\nFundraising totals commerce Amy I'm from college poll shows the new new leading Kelly by ten points through with his overall support below fifty percent\nIn a statement on his fundraising soon in his campaign said quote we're right where we need to be but in the states and the donors to governor so it last night he warned the fundraising news isn't good and urged donors to take immediate action to make sure Kelly didn't raise him for an age PR News I'm Josh Rogers\nSenator Kirsten Gillibrand will be in New Hampshire today to campaign for democratic gubernatorial candidates Kelly Sheila brand is in New York Democrat she's been campaigning to help elect female candidates across the country she joined Kelly at a candy store conquered the tour expected to talk with employees about paid family medical leave\nA forecast what advisories up this morning for the state will see clouds and a few snow showers in the north country mostly sunny south of the White Mountains windy and cold across the state highs and the thirties to mid forties\nTonight clear and very cold temperatures in the twenties you spots career on freezing mostly sunny on friday eyes in the forties and fifties to be back closer to sixty for the weekend [noise]\nSupport for an age PR comes from you our listeners Anton the toes to bookshops resenting Howard Mansfield discussing the habit of turning the world upside down\nOr believe from property and the cost that belief this Saturday at eleven in king\nAnd GPS associates opening businesses and homeowners lower their energy usage who diagnostic testing and advice on efficiency ... GPS associates dot com [noise]\nSupport for NPR comes from NPR station other contributors include this Cox insurance providing customize insurance for small and medium businesses so they can do more and be more\nTo learn more at age I asked the O. X. dot com or from an agent Hitchcock's insurance encourage courage is tennis is listening to an age [noise]\n[noise]\nThis is one a I'm Joshua Johnson visiting New Hampshire public radio in Concord and this is a part of the show where we try to put our conversation for the hour into some context to boil down what will be discussing into one big thing\nBut frankly today what's the point\nWe're just under three weeks away from the midterms and it feels some times like this election is about everything all the time all at once whether the nation supports repudiate President Trump whether the me too movement has affected our politics the future of health care immigration policy our economy national security diversity is Brett Kavanaugh\nIt's an election about everything that makes us in America right now and in states like New Hampshire those national debates blend with local concerns to make for some pretty interesting politics so\nToday's show is about everything sorry to dumped so much in your lap but such is life\nWill deal with pieces of those big issues this hour but maybe you can help us focus what's on your mind right now with the midterms email is one a at W. A. M. U. dot org comments on our Facebook page where you can watch our video stream courtesy of an H. P. R. or tweet us at one egg\nJoining us from our home base in Washington is one of summer and national politics reporter with the Associated Press one a welcome back to the program thanks for having me also with us NPR lead political editor Domenico Montanaro Dominican welcome hey there Katie Sanders is the ...\nChecking website politifact she joins us from the Poynter Institute a professional school for journalists in St Petersburg Florida Katie welcome to want to\nThank you for having me and here with me a New Hampshire public radio in Concord is Casey McDermott who covers politics and policy Casey thanks for taking time for thanks for having me let's start with New Hampshire's congressional races the state has two districts but both of those races are pretty interesting right now give us a sense of who's running\nShort so uh those congressional districts kind of split the state and half on one side we have the first district which covers kind of eastern part of the state\nAnd not race we have a contest between Chris Pappas the Democrat and Eddie Edwards the Republican I'm both of them fairly young and I think fairly mild mannered you know people have described them as two of the really you know nice guys in their respective political parties very non controversial\nUh they disagree but often respectfully\nOn a number of issues I'm On the other side of the state we had incumbent democratic congresswoman any ... that says her third term in the house\nAnd I this election is largely being framed as kind of a referendum on whether or not she's been affected in that role she's being challenged by a first term\nRepublican state legislator Steve Negron on either retired air force officer and he also talks a lot about his family's heritage of immigrating here from Mexico in the context of his kind of immigration policy\nYour immigration came up during a debate that New Hampshire public radio hosted between congresswoman Custer and speed reading the grown here as part of their back and forth about immigration specifically about the Trump administration's family separation policy listen\nThings considered we stay on the news from four to six here on an age\nToday high temperatures lower forties it'll be partly cloudy tonight with overnight lows mid to upper twenties sunny tomorrow with high temperatures Mitt to offer fifties [noise]\nThis is an HP our\nSupport for NPR comes from this station and from progressive insurance offering its home quote explore so shoppers can evaluate options in one place when buying home insurance custom quotes in rates are available online learn more it progressive dot com\nAnd from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefellers work in food health power jobs and resilience cities at rock sound dot org\nThis is one a I'm Joshua Johnson we're discussing the upcoming upcoming midterm elections with NPR's Domenico Montanaro the eighties wanna sellers\nAnd Katie Sanders of politifact we'd love to hear from you if there's a particular race or an election that's coming up where you live in the midterms that you're watching very closely we'd love to know what's on your mind about that race or if you just have some questions about what's going on with the midterms overall\nNationally right now now is a good time to share those comments on our Facebook page where you can also watch video stream of today's program\nTweet us at one a or email one a at W. A. M. U. dot org\nThe minute I Wonder if we could pick up with that last question I asked\nCasey Kendra tweeted what I Would like to see is all of the Democrats and Republicans voted out of Congress they are so polarized we need to start over\nHow much do you get a sense that the pure polarization of today's politics is just changing the way voters approached this year's midterms I mean you know Nancy Pelosi's named still comes up quite a bit on the campaign trail she's a of an obvious kind of a hot button for many Republican voters but\nIt is that working in terms of making people show up or is it just turning people off\nYou know a lot of people might be in our frustrated with politics in the country but we're seeing the opposite effect of not keeping people home a or a voting for some third party coalition in fact it's people strapping on the T shirts\nAnd going as hard as they can I Do in their political corners I mean the fact is midterms are usually about activist they're usually about the\nHardest core a people within the party but in fact we're seeing the potential for a surge this year in turnout I spoke to Michael McDonald who's a professor at the University of Florida who's really\nOne of the preeminent turnout experts in the country maintains a turnout database he expects there to be a turnout of about forty five fifty percent of eligible voters this year that doesn't sound like a lot but it would be the highest level for mid term since the mid Nineteen sixties\nAnd that is really spurred on by all of this high interest for seeing high turnout in primaries and in special elections\nAnd you know frankly you've seen Democrats really fired up to vote against this president and we've seen that according to a Pew sixty percent of people say the president is a factor in their vote and that's higher than it's ever been\nA wonder wanna summers what your take is on that in terms of the potential playbook for Democrats first of all let's just said a little context is focused on the house for example how many seats with the Democrats need to flip\nHouse shirts that Democrats would need twenty three seats in order to take control of the house of representatives and right now most public pull in when we look across the landscape suggests that they're doing they're making good efforts and things are looking good for them right now one thing that I've noticed as I've been talking to\nFolks you work on the Democratic side of the aisle who are professional political folks is they're spending a lot of money to make sure that their voter turnout and are particularly looking at the types of voters infrequent voters\nSaw election year but are more likely to stay home and I'm an off year or mid term here and there's a reason for that\nTypically when we look at the electorate that shows up for mid term elections it's typically older whiter and more Republicans ... Democrats spending a lot of money and a lot of time on the ground trying to turn out younger voters those millennials voters of color Latinos African Americans and Asians who are more likely to vote for Democrats are also more likely to stay home and ...\nIs there are certain benchmark wanna for what Democrats would consider for lack of a better word a blowout slide you use the goal just to get a fifty percent plus one or is there a larger like a stretch gold at the Democratic party is aiming for\nWhat I'm hearing from most people including Ben ray Lujan a congressman who chairs the demographic democratic congressional campaign committee is\nThey don't think this is going to be a blowout year and they feel confident and their chances of taking back the house of turning the house ... but I don't think most people most members of Congress were involved in this would say that there's going to be a huge blue waves crashing over a pick up some ten seats or something like that\nThey're focused on delivering that twenty three at turning be the house bill and the message I keep hearing from them as they want to do that as a a balance of power right now Republicans control every branch of government and they want to restore balance of power to this administration\nYou know this idea of a blue way was the focus of an email from Marty who wrote I'm all about the blue wave but I'm afraid that between voter disenfranchisement lingering gerrymandering and possible foreign interference we're about to be punk again\nDominican let me ask you about some of the polling water some of the main trends in national polls right now in terms of how the Democrats and Republicans might do\nWell when we look at our NPR PBS NewsHour Marist pulling Democrats have had an advantage on what's known as the congressional ballot who would you prefer to be a two run Congress ... the Democrat and your district or the Republican the ... in your district\nYou know we've had an advantage for Democrats anywhere from seven to twelve points over from the summer until now or other polling other public bowling shown it to be double digits that's about the range that Democrats\nFeel like they would be able to take the at least those twenty three seats in the house\nUh and I look at some other factors to just look at the landscape and the playing field and when I gained out or how many seats would be up for grabs this year I found that there are ... seats that were a competitive to potentially competitive\nDespite all the talk of cabinet or you know that confirmation battle in ... Republicans and it certainly did\nOnly six of those seats are democratic held seats Seventy four seats are of the potentially competitive to competitive landscape are held by Republicans no matter what you look at that and you know if the Democrats win half of those that's the house\n[noise] glad to hear from some of you with regards to your concerns about the midterms including about the nature of polling in general are doing the God love you to respond to this comment from a listener who left in ... in our inbox\nI'm Alan from Ashville North Carolina and I'm frustrated with the elections with not having enough\nHoles in down ballot races even even U.S House but state house and stuff because if it's a close election I Want to vote Democrat\nAt least at the federal and state level but if it's a Julian that I Want to vote a third party greener libertarian\nOr write my own at certain you know the raiders coach or not if it's if it's true it if my vote might be the deciding vote and I need a whole I Need some polls July to divide and it it actually changes my boat all change my vote\nEllen thanks for your comment Domingo\nThat cracks me up or if he wants to run for office he should run for office if he wants to a vote third\nShould do so I get a pragmatic approach though and I think a lot of you know establishment Democrats would argue that they wish there were a lot more voters like him who voted in Wisconsin Michigan and Pennsylvania for the Democrat instead of voting for the third party candidate now when it comes to polls look\nThere is a huge problem in this country when it comes to a polling generally and then when you go and drill down into the state level or district level or state house level my goodness\nThe response rate that people are getting from polling is lower and lower and lower every year in other words you make a phone call does somebody wish to participate in that that just continues to decrease\nIt takes a lot of money to conduct a good pole and to get a sizable enough sample that the results are representative and it's really tough and I would just say go based on the issues and vote your conscience\nYeah quite a lot of you express real concern with the very nature of polling Peter wrote on our Facebook page please discuss the obsession the media NPR included has with a horse race method of election coverage is an irresponsible journalism to report on polls one such reporting could affect turnout or elections are not sporting events\nAnd Michael wrote on our Facebook page unit which still trust polls remember how that turned out in twenty sixteen\n[noise] yeah I mean I you know look I mean this is a this is a tried and true a criticism\nUm ... you know we can get into the science of polling and whatnot and I would disagree that were obsessed quote unquote with polling we do use it to pepper our coverage and to give us a sense of\nWhat the snap shots are within districts in fact I'm far more interested in trends in polls rather than poll to pull horse race I think that's a not a good way to look at the polling ah I think that uh again overall trends and you know issues and questions\nOf giving you a sense of a kind of a temperature read of people is way more useful\nLeaving against an each PR as an inspired way to support an organization enrich your life and that of others in your community to learn more about including an HP are in your state plans to go to an H. P. R. dot gets plans dot org\nPartly sunny windy for today and we'll have high temperatures in the lower forties [noise] this is an HP our\nSupport for NPR comes from this station and from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial wellbeing first learn more at Raymond James dot com\nAnd from the science Sims foundation since Nineteen eighty five supporting advances in science education and the arts towards a better more just society more information is available at size Sims foundation dot org\nBack now to our conversation with one of summers of the Associated Press Katie centers of politifact and NPR's Dominican months and are all still time to get in some of your questions and thoughts about the mid term elections email us one a ass W. A. M. U. dot org\nTweet us at one eighty or comments on our Facebook page where you can also watch or video stream of our lovely environments here at New Hampshire public radio also you can go check out some more of their excellent coverage at an H. P. R. dot org including of some of the things that make New Hampshire unique\nThere's a story about a giant pumpkin boat race engulfed tone I didn't know pumpkins where that boy it but I Will after the show I'm gonna check it out and H. P. R. dot org let's get to some of your comments about the midterms Laurie emailed I Am a lifelong Democrat and I can tell you what frustrates me and has for years\nThe complete inability of the Dems to get a message and stick to it I've gone to my local Democratic Party website and the front page does not see what they are for does not told me what they care about one summers you've been following the Democrats in the run up\nTo the midterms how common is Laurie complaint and how well are Democrats doing an answering it\nWell I think the largest pointing to is actually really comment and I think Democrats are trying to figure out how it affects that number of the conversations I had I recently wrote an article that looks at how Democrats are trying to\nMake sure they have record mid term turnout and they said that when they're talking to voters are sending out mailers are going and knocking people's doors in these battleground states and districts are trying to make sure\nThat they're telling their vote or is that they have a message that they are running on rather than just having these conversations that are about just running against President Trump's base that um I was talking to some groups that did some field testing recently among Latino voters and they said ... and when they get this field testing\nThey were saying people were turned out they said if they got to try a mailer from their local democratic candidate had President Trump's face on it they be super turned off right they'd throw that away they wouldn't even engage or see who the candidate was so I think they're really trying to tweak that match and you talk about what they can do for them what's at stake but that's\nThat's why you hear are Democrats nationally talking about how this is the most important election of our lifetimes why you hear about healthcare message I think as Dominican noted being such a huge share of the advertising that you're seeing from pro democratic groups it's because they do realize that they need a message for their voters to coalesce around otherwise they're not going to turn out\nTo him in the car I Wonder if we can follow up on that theme was one more voice mail from a listener on the east coast here's what judge John left in our inbox\nShould John Ruth sure to New York so often um is\nThe Republicans for Democrats or Republicans the Democrats the Republicans for instead of doing that they should be focusing on specific policies namely the Democrats that stand for searching for\nThe Republicans to stand for such and such it helped educate listeners because you don't gain anything by just growing Democrats Republicans Democrats Republicans\nJohn thanks very much for calling and sharing your thoughts with us no medical for me I don't know how you hear this but for me as a journalist I feel uncomfortable saying the Democrats who stand for ... I feel more comfortable saying the Democrats who say they stand for ... or the Democrats who have done ... to me journalistically\nThat's more reliable but I Do take John's\nPoint that it just feels a little bit too broad\nBrush yeah I mean we have to always be aware of trying to get into some of the issues and where are the party stand on these things and what they've been pushing I think that that's been part of\nThe pushback and why you've seen so much interest from Democrats obviously in this election because they've seen so much of what President Obama did a regulations that were put in place that have been rolled back for example a by the environmental protection agency a and a whole host of other things including an immigration policy\nThat Democrats are firmly against\nAnd it's also what you saw a as a rise of the Tea Party in twenty ten where they didn't trust a lot of their government officials including a lot of Republicans and how they essentially took over the Republican Party with that message of uh taxed enough already and being really in opposition to\nA President Obama's health care act so the parties stand for a very very different things and we're seeing that play out and going to come to a head and in this in this midterm\nKatie I Wonder if you can respond to a listener who left a note on our website the one eight dot org the listener writes was the upcoming midterm elections and Michelle Obama's advised to go high when opponents go low what is the effectiveness of negative campaigns are the negative campaign ads coming from a particular party or ...\nI think everyone's guilty and I don't think any party has a\nHas Israeli going going high all the time right and I think that's because it's effective and that really sticks with people as much as people like to say that they dislike negative advertising and I think actually do\nIt is a memorable and it certainly a bill that impression that people are going to remember and that's why we see so much of it and that's why we have jobs here fact checkers [laughter] there's plenty to do\nYou you will never be unemployed not ever\nTheir medical research on some of the diversity of the candidates this time around quite a few record numbers of women running a record numbers of el ... of out L G two candidates running some of whom spoke to Ari Shapiro on all things considered earlier give us a sense of what that means for\nThe midterms and whether many of these candidates are considered to send a strong chance of winning\nWell look you're correct that there are a lot of people um who are\nA ... of diverse backgrounds I mean women are the biggest bloc of this that are really driving the midterms you think a lot of Native American candidates or you know just a New Hampshire there Chris Pappas who is\nA an openly gay man or he would be the first gay representative from the state of New Hampshire if he wins in a new in the first congressional district there in New Hampshire the Democrat now but when again we look at the power of the midterms women they has been fired up since the day President Trump\nWas elected moment talking about when and where I Am a democratic women there have been two hundred and thirty five women who have been nominated\nFor ah for Congress for their party's nomination a hundred and eighty three of those\nDemocratic women just if you were to take the number of democratic women who are running ... that would be bigger than the record previously of all women combined do or nominees and that was a hundred and sixty seven\nSo I'm Sorry you just just to clarify the numbers are basically saying three out of four women in this in this go round a democratic women who've been nominated\nAbsolutely that's absolutely right and the the wave of democratic women the year of the woman quote unquote round to ah after Nineteen Ninety two after the Clarence Thomas Anita Hill areas have been driven by democratic women and we've seen them be very fired up in poll after poll\nAnd you know they're going to lead the march to the polls for Democrats and if they win the house it's going to be largely because of women\nWanted there are some races where you know women are making a very historic a historic showing I mean the Arizona Senate races going on right now between here and send them the Democrat and more with Sally the Republican you know Arizona is going to have a female senator in that seat\nBut I Wonder how much you see this as a bipartisan trend we heard the numbers from Dominican oh but do we get the sense\nThat both parties both major parties are trying to be part of this trend trying to embrace this trend\nSure so I think that the energy and when we talk about female candidates is certainly more on the side of Democrats than Republicans and I think that's frustrated\nAnd number of Republican women I spoke to chew women who founded the group Republican women for progress recently and they told me that they were really concerned that their party doesn't have an apparatus to cultivate young promising Republican conservative went in\nFrom the local those local level seats all the lab so nothing that really reflects say what you see on the left on the Democratic side from emily's list a group that cultivate and backs\nA pro abortion rights when in female candidates so there there's some concern certainly among Republicans and my colleagues that he actually asked Senate majority leader Mitch McConnell about that the question came\nAnd this back and forth about the Senate Judiciary committee and the lack of Republican women on that panel during the hearings around Dr ... Ford and ... now justice Brett Kavanaugh and he's on them early and why there were no women there Mitch McConnell said you know that's something he doesn't like it something he wants to see more up but I still haven't heard Republicans\nForthrightly at least to me answer if this is such a problem if you want to see more women in the Senate on your side if you want to see more women moving up in the house and we should note that there is a woman and Republican leadership and Cathy McMorris Rodgers but where does lemon come from because\nAs we know running for office is very expensive it's very tough it's very tactical if you don't have helping you don't have an apparatus those people are never going to show up\nW. E. V. H. head of the Ninety One point three W event keen Ninety point seven WABC ... one of seven point one W. E. D. J. Jackson Ninety nine point five W. E. B. S.\nCoal Brooke Ninety point three and that he ... he little ten Ninety One point nine and online at an H. P. R. dot org\nWhen it comes to today's job market the harvest is plenty but truly the laborers are few why can't companies find workers\nAnd how can you find work\nFrom W. A. M. U. and NPR this is one egg [noise]\nPay their I'm Joshua Johnson visiting New Hampshire public radio today on one a the labor shortage unemployment is way down and job openings are way up\nA tough situation for many employers these are hard times in the Granite State New Hampshire like many states is hunting for workers to fill all kinds of jobs but it has some big challenges including a lack of young adults in the labor pool\nWe'll explore how workers in workplaces are trying to match up and we'd love to hear from you whether you're hiring or job hunting email won a a W. A. M. U. dot org comments on our Facebook page or tweet us at one end [noise]\n\nLive from NPR News in Washington encore of a coal miner in Afghanistan the police chief of Kandahar Province has been killed by his own body guards\nThe provincial intelligence she was also killed in the local governor was wounded the attack and canned car came as they attended a meeting with senior U.S military officials the BBC's signature ... has more\nGeneral of the ... was chief of police in Kandahar Province and a puff and opponents of the dollar bond\nAccording to local media reports he was killed in a shooting targeting a meeting at the governor's house in Kandahar city\nAnd a number of other senior Afghan officials I said to be an injured the come onto the NATO forces in Afghanistan is believed to have been at the meeting unharmed that thought about his plans responsibility to the attack comes amid escalating buttons ahead of today's elections\nThe BBC's ... the first of some three thousand Honduran migrants traveling north to pass through Guatemala and reached the Mexican border angering President Trump re emerging report a lot of ... and U.S authorities are trying to discourage them from traveling farther\nThe leader of the migrants march former Honduran lawmaker ... this was arrested in what the ... as President Trump threatened to cut off us aid to any Central American country that didn't stop the march\nStill hundreds of migrants have made their way to the Mexican border the U.S ambassador to what the other side of yoga issued a statement in Spanish urging the migrants to return\nFrom their idol says does the needles ...\nThat the U.S border has never been so protect those who tried to enter\nHe added he understood people sleep due to lack of opportunities and that the U.S is investing millions of dollars to change that for NPR News I'm ... and\nPresident Trump heads back to Montana today for another campaign rally it's his third visit to the states in July as Montana Public Radio's Eric Whitney reports Trump is supporting the Republican who was hoping to take a Senate seat away from Democrats\nThe president will appear in Missoula a famously liberal enclave in a state President Trump won by twenty points\nA counter rallies being held seven miles away while Republicans are popular in Montana democratic Senator Jon tester won't be easy to beat is raised more than four times as much money as his Republican opponent Matt Rosendale Rosendale TV ads feature clips of the president's earlier Montana campaign stops\nJon Tester is a vote for Chuck Schumer Nancy\nPelosi [laughter] walk Rosendale\nThe nonpartisan cook Political Report recently shifted its forecasts of Montana's Senate race from leans democratic to toss up for NPR News I'm Eric Whitney in Missoula\nOn Wall street the Dow was down Ninety points the NASDAQ is down more than fifty five you're listening to NPR\nIt's eleven uh for a record gambling within H. P. R. news most superior court judge is hearing arguments today in the case involving a secret list to police officers with credibility issues as an HBO has taught book reports the group of newspapers along with the ACLU New Hampshire are calling for each release\nThe state has kept the so called ... list since two thousand and four it contains the names of more than one hundred and Seventy police officers some no longer employed who've been red flags because of disciplinary issues\nThe ... office says it maintains the list so that it can notify defense attorneys when the officers are involved in criminal cases the ACLU along with the union leader Concord Monitor in Nashua Telegraph newspapers are suing the AG arguing that the least should be public under the state's right to know law\nIn response filed earlier Wednesday the ... office is the case should be dismissed because state law clearly prohibits the release of police personnel files for H. P. R. News I'm Todd book in\nManchester Police departments in order to develop a better policy and granting police pay days off Joyce Craig quoted an internal auditor the practice of so called chief days the summer there was a pay days off for police that don't count towards vacation time the audit found that four hundred sixty six such days have been awarded since two thousand nine but it did not reveal the amount of money it costs the city\nThis week Manchester alderman ordered the police to work with the city to develop a new policy now the chief days are awarded\nForecast wind advisory still up today clouds and a few snow showers in the north country some snow on the pumpkins they're mostly sunny south in the mountains today windy and cold across the state eyes from the thirties to mid forties it's not clear in cold blood overnight temperatures in the twenties friday looks mostly sunny eyes and the forties and fifties\nSupport for H. P. R. comes from you our listeners\nThat from Franklin Pierce universities master's programs advancing careers through leadership communications and analytical skills I'm On program information at Franklin Pierce dot edu and Dana Farber Cancer Institute bringing dinner fiber expertise closer to you [noise] dinner fiber dot org slash locations [noise]\nSupport for NPR comes from NPR station other contributors includes aggressive insurers within named your price to offering a range of coverage and price options to choose from now ... progressive more progressive dot com or one eight hundred progressive and the corporation for public broadcasting [noise]\nAt eleven oh six this is an age feel [noise]\nSupport for an HP our live stream comes from you our listeners and from radiation energy a local employee owned company helping thousands of granite staters go solar\nRevision energy is currently growing their team of electricians and plumbers learn more at revision energy dot com slash careers\nPretty high right now it's the fifth month in a row that there have been more available jobs than jobless people now high unemployment is obviously bad but super low unemployment presents its own problem\nHow to recruit people into jobs that need filling what's it like being an employer right now are you able to hire the help you need\nMaybe you're looking for work do you feel like you have a lot of choices if the job market is so competitive why aren't we seeing wages grow faster\nWe'd love to hear from you email us one at a at W. A. M. U. dot org\nComments on our Facebook page where you can also watch a video stream or tweet us at one eh\nLet's begin with a view from here in New Hampshire joining us in Studio at New Hampshire public radio is Dan kill you a welder who's been living and working here in the Granite State for more than Twenty years he's the owner of ... construction services Dan welcome to want to say\nAlso with this is ... the president of applied economic research and economic and real estate consultancy based here in New Hampshire Russ thanks for being here great to be here thank you then when we start with you you're a welder you run your own business give us a sense of what you deal with on a regular basis just trying to find enough people to get your workload done\nBut it's hard I'm One of the biggest reasons as hard as there's just no qualified welders out there anymore a lot of aged out in in in ... the education system really hasn't put enough\nA time into his own vacation trades anymore\nGive me a sense of what you got to do so you've got a job and you don't have quite enough people what kind of hoops you have to jump through to try to find people are you like making phone calls all day or knocking on doors are like what's your day look like\nUsually the first thing they do is I go to my existing employees and said do you have anybody that you know of that may be looking for work um and sometimes that works out and sometimes it doesn't so then you know you have to\nYou know put the word out there that you're hiring and you're hiring basically and practice and you're going to be teaching on the job [noise] really slows down the progress that that you can make and uh\nYou know it's it's it's a challenge for for any employer no matter what trade there and to um you know they started in ground up every time I\nWas there a point Dan which he began to kind of feel the impact of the labor market like what point did it start to notice simply be different for you in terms of just filling the positions you you needed\nI'm Mary Louise Kelly when the administration's views on religious liberty conflict with other priorities this afternoon on all things considered from NPR News [noise]\nThat's this afternoon from four to six here on an HBO are\nPartly sunny windy forward today with high temperatures in the lower forties middle be partly cloudy tonight overnight low temperatures\nAnd whoever twenties [noise] this is an HP our\nSupport for NPR comes from the station and from ... am committed to changing lives through math by building math achievement problem solving and critical thinking skills for thousands of students every day and nine hundred franchise locations matinees him dot com slash NPR\nFrom love me in makers of go to meeting a collaboration meeting platform that comes equipped with features to help people stay focused to get work done and learn more it goes to meeting dot com\nAnd from the listeners his support this NPR station\nThis is one a I'm Joshua Johnson we're discussing the job market and the difficulties in getting America's job openings filled with regional economist Russ T. Bo of applied economic research here in New Hampshire we'd love to hear from you to share what you know about finding a job in today's economy comments on our Facebook page where you can watch video stream courtesy of New Hampshire public radio\nTweet us at one a or email one at a at W. A. M. U. dot org before we keep going and introduce our next guests I just want to kind of add a yes any men to what the deal you just said\nThere is no shame and getting a career that doesn't require a college degree none and we did a show last year called how to earn six figures without a four year degree about how to get into some of the skilled trades\nThat requires some training or an apprenticeship but that don't require a four year bachelor's degree one of our guests are Nicholas when Louis Wyman who was the c._e._o. of the Institute for workplace skills and innovation wrote a book called the job you\nAnd he put a question and answer on our website about what an apprenticeship is how it is an apprenticeship work\nOnce you do you consider taking one where do you go to find one you'll find all this information on our site a program called how to earn six figures without a four year degree on line at the one at a dot for that's the word ... the number one the letter a dot org\nBefore we bring in our next two guests Russ one more thing about the job market here you mentioned\nThat New Hampshire has an aging population affordable housing as a challenge New Hampshire is one of many states has been hit hard by the ...\nShow up in in the job market is adjust and aging job market or or does it manifest in other ways then that\nWell I think the main thing that it that we see right now is sort of the lagging wage growth in the state than it is kind of a deterrent to bringing more people into the labor force attracting more people to the state our wage growth has been around two two and a half percent a year\nIt's sort of lagging this prosperous economy that we hear so much about I think one of the quips that I recall a woman said yeah we have a great job market in New Hampshire I should know I have three jobs and I need three jobs go yet by\nSo I think that that's a that's sort of the main stumbling block right now we're beginning to see a little bit of labor force growth as I said we've added sixty five thousand jobs in this state since the down turn kind of reverse course and started becoming an improvement but we've only added Seventeen thousand workers\nSo that they're in lies to crunch glad to get to some more of your comments about what you're experiencing where you live with work especially in skilled trades\nSean emailed I work in the steel mill and union and management have been complaining about the lack of quality candidates were even taking mc Donald's employees if they will come in a big issue is drug testing half our potential potential candidates don't come in for an interview after hearing that we randomly drug test\nJulian tweeted zillion jobs are no consequences if they don't pay a living wage all the jobs I see what ... my education and pay a third of what his manageable\nLet's try to zoom out a little bit more and talk about what's happening not only here in New Hampshire but also nationwide joining us from our home base in Washington is Ryan none policy director of the Hamilton Project and a fellow in economic studies at the Brookings Institution Ryan welcome to want to thank you for having me on\nAlso here with this is Christine car the executive director for the New Hampshire career and technical educators association Christine welcome thank you Brian can you give us the big national snapshot of what's happening across the country right now in terms of the labor market we knew what the national picture is\nWe've talked about New Hampshire are most states doing OK really struggling what does it look like on a more granular level\nSure well I I think that it's important to start from a long term perspective to understand where we are now a and I think it can be summarized with the idea that the labor market is not always linking workers with economic opportunity I start by saying that productivity growth overall has been unusually low since the mid to thousands\nWage growth has also been quite weak\nOr and then there's also tremendous variation and wage levels across the country it's not always easy for workers to access jobs in those high wage places are at the Hamilton Project we've released a paper recently that describes how over the last forty years\nGeographic mobility has plummeted in those geographic imbalances because wage differences I just mentioned have tended to persist over time and the struggling areas in this country are not generally catching up with the prosperous places\nWe asked members of our one eight tax club for their input one person wrote it wrote us at age Seventy one I was shocked to be hired I Am a retired attorney working as a state employee Ryan do we officially qualify now as being in a a labor shortage capital L capital as labor shortage\nI actually have a different perspective on this or that and as an example I like the kind of illustrates my thinking about labor shortages or if you go into a store and you offered to pay less than the posted price for something and the store refuses to do that or we don't say there's a shortage\nAnd I think the same logic applies to the labor market fit in recent years we just aren't seeing broad signs of extreme labor scarcity in the national data that scarcity should produce rapidly rising wages has employers compete for workers and we just haven't observe that overall ... wage growth after we adjust for inflation\nAnd brought industry groups out pacing other industries by big margins are for example ... wage growth in construction and manufacturing is not so different than for the overall economy\nAnd a and also say that wages are growing at roughly similar rates across regions throwing a bit faster in New England in the Pacific states but\nAh but not tremendous gaps and and then I'll just end by saying that that's all to say that they were not seeing this at the broad national level but there could certainly be particular occupations in particular places that are characterized by labor scarcity and that have seen some pretty rapid wage growth I just don't think that's probably true of us labor market\nWe heard from quite a lot of you about just the nature of wages as an impediment to filling these jobs Ronald posted on our Facebook page\nAs someone who works for many years in construction mostly trim carpentry I can see wages in the field aren't enough to attract and keep people willing to do the work Michelle emailed it's wages not supply\nAnd Christine car I Wonder if you might respond to this tweet from Fran who wrote New Hampshire eliminated the state minimum wage a few years ago so even though all surrounding states have raised there's we're at the national minimum wage thousands travel to Massachusetts daily where the pay is much better\nChristine in terms of what you're dealing with trying to get jobs matched up with workers how much does the state's minimum wage factor into structurally\nHer [noise] well I and I don't have any empirical data on why so many uh employees are working in national traveling there that I Know when I Lived there that it played over half a million or caters everyday into the city and out and many of those they coming from New Hampshire\nSo you know wages is one aspect of it but there for sure is an actual shortage of people\nAnd my feeling is we've got to really just focus on how they can get the people that we have and to the jobs that are out there\nWhen he sees the Roosevelt shortage Christine was there a point at which you begin to notice more viscerally that the job market and the labor pool were significantly mismatched\nThat you know I I feel like you know my point of view is sort of a wider industry perspective in in the sense that I work in technology for the last ten years and\nComing to New Hampshire and looking at each of these high end um occupation such as automotive construction manufacturing there just seems to be shortages across every single single sector whether it's factoring or in high tech\nLet's get through a few more of your comments particularly about the nature of what we've described as an aging workforce Christian in Wisconsin emailed\nTo all the companies out there whining that they can't hire enough people stop discriminating against older workers and older is in quotes we're not old and we have so much experience plus we don't always want a huge salary\nJan in Manchester New Hampshire emailed I Know several educated and qualified older women who lost their jobs here in Manchester they've been out of work for at least six months\nI've overheard conversations at my local local supermarket from older employees losing hours to sixteen year olds ages them is a big problem ... how do you see this to the impact of of older workers\nThe parts that were overwhelmed next time you're now\nThat in the day's news here and now coming up at noon here on N. H. P. R. [noise]\nPartly sunny windy across New Hampshire today high temperatures lower forty use it will be partly cloudy tonight overnight lows mid to early twenties a sunny day tomorrow with high temperatures mid to upper\nFifty [noise] this is an H. P. R. [noise]\nSupport for NPR comes from this station and from capital one committed to reimagining banking offering savings and checking accounts that can be open from anywhere capital one what's in your wallet capital one NA\nFrom see three I O T powering enterprise digital transformation with artificial intelligence predictive analytics Sendai O T solutions learn more it see three I O T dot AI\nAnd from the William T grant foundation at WTC grant foundation dot org\n\nBack now to our conversation with Russ T. Bo and Ryan ... let me get to a few more of your comments before we bring in our next guest particularly with regards to training skilled workers\nChris writes as a current plant manager of a manufacturing facility and for manufacturing HR director slash production manager for over Fifteen Years in both metal and plastics I Am calling BS\nManufacturing in the U. S. has completely abdicated any responsibility for training new employees since the eighties\nThey want experienced people at relatively low wages right off the street if you want lower wages to remain competitive you must develop an inhouse training program that brings lower wage entry level employees up to speed over time\nWe also heard from some of you in some pockets where employers are increasing wages here's one listener who left a voice mail in our inbox\nThis is bill I live in North Carolina and I work in the logistics in and supply chain industry\nWe've had a a pretty good expansion of our business over the last six months and we are really struggling with two items one is employed turns\nHigher wages and new facilities are new employers and secondly trying to hire the right people are as a result of that we've had to probably increase our incoming salaries the hourly salary is probably anywhere between ten and Fifteen or twenty percent from what we did last year so we're struggling with both turnover and securing the right employees so\nHaving unemployment down as low as two to two and a half percent has definitely impacting logistics and warehousing\nSo easy to see how Bill thanks very much for sharing your story with us\nAnother one of our listeners tweeted I hold a four year degree strangely enough in journalism but transitioned into a trade jobs shortly following college because the pay was three times what a starting job in my field would be I Know makes six figures yearly and work in the rural community I grew up in\nI Will withhold my thoughts on your ... your journalism degree good for you glad you found something that works for you but\nThis listener has an interesting point because to stem their brain drain some cities and counties and states are offering to pay workers to move there there's a city in Nebraska that'll match signing bonuses for newcomers to the tune of five thousand dollars Vermont passed a law to pay people ten thousand dollars to move to Vermont and work remotely\nAn accounting northeast of Detroit is offering to take a chunk out of your student debt that plan was the idea of Randy ... the president and CEO of the community foundation of St Clair county and he joins us now to discuss it Randy welcome to winning\nThanks Joshua so this is called the come home award tell us what the come home award is how does that work\nYeah the ... award program that we lost in ... and early twenties sixteen is really turning traditional scholarship business models on their head um there are too many flaws and traditional scholarship to talk about and going down but at its core what we're doing is changing the scholarship business model\nAnd instead of investing heavily in a Seventeen or Eighteen year old who may or may not complete college or maybe not be right for college we flip it around and we said we will pay you significantly upon completion of some kind of degree but only if you return to our region to live and work and it's really a home home reward paying off of that\nSo this is for people who are who are from saint Clair counting to come back home to St Clair counting\nYeah we have a very strong preference for those with family ties I mean to to help protect our investments we want people to know what it's like to live in a small town America or we want to keep them here and so we feel that they have some family connection here there's probably a better bet they'll stay\nTell me about St Clair county paint me a picture of what's it like\nSo small town America or its waterfront community along the shores of Lake Huron in the St Clair river\nUm our largest port Huron as a population of about thirty thousand people\nWe do not have a four year University in our region we did I have a fortune five hundred company in our region a thirty percent of our workforce leaves are counting heads down in metro Detroit to to be employed but they love the small town life or the family friendly environment amenities a small town America\nI was just going to ask you about Detroit you're about an hour outside of Detroit is that right\n[noise] yeah and you were talking about something earlier Josh I Want to mention you know Detroit has become a talent magnet which is great for Detroit um but the health of American out that Michigan I think is better judged\nOn the economic health of regions like pork here at er Marquette or Muskegon, Michigan right it gives you a better barometer of what is our our true how\nHow did the recession do to do in St Clair county where people get their pretty hard\nYeah I Would say it hit here earlier than than hit the country and much more severely um the ironic part that we tell people and that's really one of the things that led to this come a program\nOur stakeholders whether it was the length of the government business\nAny other sector we realize that we had to get together and play a piece in economic growth and prosperity we all had something to bring to the table but more importantly we we reached a point where we stopped waiting for someone from Washington or someone from Lansing to come in and save us with a plan\nIt had to be an organic planned that drove our prosperity\nWe're speaking to Randy Myers the president and CEO of the community foundation of St Clair accounting in St Clair accounting Michigan also still speaking to us T. Bo the president of applied economic research and Ryan non policy director of the Hamilton Project and a fellow in economic studies\nAt the Brookings Institution still time to get in some more of your questions and thoughts\nAbout the labor shortage won a at W. A. M. U. dot org tweet us ... when a or comments on our Facebook page where you can watch our video streams so Randy told me how the come home award work suppose I'm from saint Clair county and I moved to Chicago\nFor work and now I'm considering coming back and how does that work\nYeah Chicago's a great example Chicago Austin's south um as long as you do not have primary residence here so let let's say your parents still live in this region may be completed college six years ago\nAnd you're still living in Chicago but you met someone you met a partly the medicine they've got other you're you're weighing the option of staying in Chicago which is a great place to live or you want to come back home settled down started family spend more time doing what you want to do as long as you don't already live back in our region\nOr you're eligible for Fifteen thousand dollar award if you're selected\nWe give the recipients a hundred and twenty days to establish a permanent residency or they have to find a job that they don't already have won several already have jobs lined up and then we stretch those payments out over two or three years as a carrot to keep you here\nAnd it's really a simple back scholarship we pay the loan holder directly which in every case for us has been the federal government\nSo I Do so you you pay it out a little bit overtime so by over time by the time the two years or up Sinclair county voted this program to come home award will have put in\nFifteen thousand dollars towards one's Dan I'm guessing it's like would that be three thousand seven hundred fifty dollars like every six months or so and it adds up to Fifteen thousand overtime\nThat's exactly it Josh when the goal you know I'm is to really give young people as a young they can be in their twenties or thirties or forties I'm the chance to go two or three years without making debt\nNationally I Know you see data that says the average college student has thirty thousand dollars in debt I don't know where they're getting that data Josh because out of the fifty plus applications we've received our average at an eighty thousand dollars\n... that that's a crippling amount of debt preventing people from living the American dream\nI can relate to that I'd finally paid off my private student loans I had to settle them it was\nOh God it was it was the most awful form of financial slavery I can possibly imagine and yeah definitely like that's a whole other our where I Will I Will tell you with my tearful story of dealing with Sally Mae before I I Know ... wants to jumping but before he does Randy I just want to\nAsk you about some of the perception issues that we discussed with regards to New Hampshire\nThere's this there ... there is evidence that young people are moving to bigger cities in in large numbers you've talked a lot about this feels kind of small town America New Hampshire specifically conquered for sure definitely feels like small town America\nDo you think there's this misperception about smaller communities that young people are getting I haven't seen the TV show\nThat kind of glorified young people in a small town since dawson's creek I mean you don't see it much anymore do do you think\nAbout living and working in smaller parts of the country that we're all just kind of dazzled by the big city", "show_name": "1A Plus", "year": "2018", "city": "Keene", "day": "18"}