{"month": "10", "state": "NH", "station": "WEVN", "content": "They made the choice to support an HP are pleased to join them because we need listeners just like you to help step up and support us and sustain us in the months to come especially as we head toward these important mid term elections you want to be out there getting the news you need police support is now an H. P. R. dot org and thank you very much for your support\nSupport for the exchange on New Hampshire public radio comes from you our listeners and from Herbert Toyota ...\nFeaturing the two thousand team free is no of course the soda safety sense an advanced suite of safety technologies learned more ... Toyota dot com [noise] unfortunately bath\nAnd homeowners ... beautiful bathrooms industry knowledge and curator products Portsmouth Beth go because\n\nThese are the stations have New Hampshire public radio W ... conquered eighty nine point one W. E. V. S. Nashua eighty eight point three\nW E v age Hanover Ninety One point three to ... keen Ninety point seven\nWABC Durham one o seven point one W E v J Jackson Ninety nine point five\n... of cobra Ninety point three and W. E. B. Q. Littleton Ninety One point nine that on line at an H. P. R. dot org\nLine from NPR News in Washington on corporate Coleman President Trump used his Twitter feed this morning to push back against a skating New York times story NPR's Scott Horsley says the times report Trump and his family used dubious schemes to evade taxes on hundreds of millions of dollars in inherited wealth\nThe New York times fourteen thousand word story was the product of more than a year of investigation it shows that despite his claim to be a self made billionaire President Trump was the beneficiary of a vast inherited fortune much of which was shielded from taxes through a variety of questionable schemes\nNew York taxing authorities say they're reviewing the articles findings\nIn his tweet the president does not dispute any of the facts and the article describes it as quote a very old boring and often told hippies Trump complained to the vast majority of the newspapers coverage of his administration has been negative echoing a charge leveled by the White House press secretary Scott Horsley NPR News Washington\nPeople who get health insurance through their work or are seeing their share of the cost of coverage increase that's according to a new study NPR's Alison Kodjak reports the average price for a family plan is close to twenty thousand dollars a year\nThe report from the Kaiser Family foundation showed that the price of employer provided health insurance Rosen average five percent this year\nEmployees' contribution to those premiums fell slightly in twenty Eighteen but over the last five years employees share has risen by about a thousand dollars and top of that more workers have to cover Becker deductibles\nPeople who work for small companies usually pay more for their coverage than those who work for bigger firms about a third of those who work for small business cover more than half their insurance premiums premiums also increase faster than inflation and workers earnings\nSo altogether that means that health insurance costs are taking up an ever larger share of people's take home pay\nAlison Kodjak NPR News\nThe federal emergency management agency is going to test a presidential alert system at two Eighteen pm eastern time today NPR's Brian Naylor has more\nFEMA and the FCC are conducting the test they estimate some two hundred twenty five million devices will be receiving an alert along with an audible tone there'll be a text message dating presidential alert\nFEMA officials say the system is only to be used in time of a national crisis if the country's under attack or an imminent natural disaster and it can't be used by the president for other purposes\nNPR's Brian Naylor disaster officials in Indonesia have increased the death toll to more than fourteen hundred people from last week's powerful earthquake and tsunami rescuers are still at work on some of the ways the island trying to free any survivors\nOn Wall street the Dow was up one hundred twenty six points that twenty six thousand nine hundred the NASDAQ except thirty seven and eight thousand thirty six\nYou're listening to NPR News from Washington\nFor NPR comes from I drive maker of remote PC providing real time access to PCs max and servers from anywhere for use when telecommuting or for remote managements\nCom slash NPR and the ... e Casey foundation\nSupport for any age PR comes from you our listeners stem from falling monkey performance that are presenting a night of laughter with political satire group the capitals step Saturday October thirtieth ticket set flying monkey on H. dot com\nAnd from Dartmouth Hitchcock opioid collaborative series our families are children October fifth in Concord New Hampshire Morehead and go ... dot org slash opioid forum\nSteno form this is an H. P. R.\nI'm Andrew for really here with an H ... noise and you tuned to NPR because an HBO or provide you with a high quality source of news\nAh from season journalists from across the region around the globe bringing reporting the second to none\nAnd then whether to season hosts like Joshua Johnson and our very own lark annoy ah who know how to guide you through the intricacies nuances of of uh important issues in conversations every morning today we're asking you to contribute in any amount to help pay for the news you trust\nAnd the programs you love give through your checking account or credit card at an H. P. R. dot org\nAnd if you need a little boost to go to the phone or to the Web and give now well when you make your gift you'll be entered you into Southwest Airlines\nOne thousand dollar gift cards were giving one away at noon so that's coming up boy I'm and want it six PM so and that calling your friend or family member saying you know you always kind of want to go to Santa Fe guess what are going um I'm just picking Santa Fe out of the air but southwest goes to a lot of places\nAnd so you could win one of those one thousand dollars Southwest Airlines gift cards but of course you got to get your name in the running how do you do that you give on line through your checking account or your credit card\nAnd H. P. R. dot org or you call one eight eight eight eight zero five six or seven seven\nIt's quick and easy to do at an H. P. R. dot org it takes just a few clicks and you'll be done uh before we get back to Joshua Johnson and one day and they're going to be digging into the minimum wage and have an hour long conversation about that you're not going to want to miss it\nGo to an H. P. R. dot org to become a sustain or or increase your sustaining membership and thanks very much for your support\n[noise]\nThis is one a ... in Washington filling in for Joshua Johnson here's the scene outside of an Amazon warehouse in California will take you there now jubilant yesterday after a major announcement [noise]\nThat\nWould be hard to Amazon in your vice president of operations informing the staff there that the online retail giant\n... had a major change in policy minimum wage earners at Amazon now we'll see their pay jumped to Fifteen dollars an hour starting in November and this is a move that will increase wages up three hundred and fifty thousand people that's forty percent\nOf Amazon's workforce Amazon is a leader in the business world one of the biggest companies in the world a trillion dollar market capitalization\nAnd it ... its motives will be something for us to discuss but can we expect other big corporations to follow suit\nGiven the size of Amazon's footprint in today's economy is Fifteen dollars an hour actually really enough to get by\nJoined me from Sacramento, California is Sean high tower a minimum wage worker and fight for Fifteen advocate\nUh Shaun welcome to one a thank you thank you for having now is Sean you don't work at Amazon but your grass roots movement fight for Fifteen or started in twenty twelve I think can take quite a good deal of the credit for Amazon's decision here or what was your\nUm I was very excited when I stand on the news yesterday morning um it's it's a milestone and I hope it sets a fire for under some of the big wigs to set an example that we need Fifteen dollars here also as fast food workers\nNow I Want to talk about Fifteen dollars and I want to talk about real life uh Shaun I'm you mentioned that you're a fast food workers your senior manager\nAt Burger King right yes crime and what is your hourly wage currently I make eleven fifty an hour in benefits\nUm right now we do not have any benefits\nSo no health care no retirement pension eleven fifty an hour you're a single parent with two teenage daughters can you give me a sense of how far eleven fifty an hour goes for you for fueling up your car for taking care of your kids\nUm eleven fifty an hour goes nowhere you know I'm living check to check um it's it's a struggle you know I'm living paycheck to paycheck robbing Peter to pay Paul trying to figure out I'm gonna um do do things and how to make the money stretch eleven fifty goes nowhere in today's society\n... ... what is the end of the month look like you know when you have a the electric bill the water bill or one of the kids' needs new sneakers I'm sure and um it might be nice to to maybe go to a movie or what is the end of the month typically look like for you\nUm the month is a very hard you know food gets low around the end of the mind of funds are low and on and on them penny pinching I'm waiting on the next jak\nThat to become a contributor joined Tim bombing and the many many other people who have given during an age peers twenty Eighteen fault fund drive we're asking you to contribute in any amount to pay for the news you trust\nAnd the programs in love get through your checking account or your credit card at an H. P. R. dot org and as you guessed I'm ... and I'm I'm here with ...\nFloor and today there's a special good reasons but especially good reason to become a member of an HP are we are giving away to one thousand dollar Southwest Airlines gift cards one at noon\nOr just less than two hours away we're giving away the first one so you need to get a you need to get on this you need to make your called the make the call go to an H. P. R. dot org ah and get your get your ah get your name in the running to win because\nAh as these Chris autumn days turned into cold winter nights a consider taking a trip to a ...\nJamaica that sounds good are new to all places by the way south west will ... south west travels and you could put those gift cards towards such trips uh think of the places you can go with those gift cards but you can't win it if you're not in the drawing and you're given the drawing when you become a standing member and H. P. R. dot org\nAnd that's the catch they're not going to pull your name out to win it if your name is not in its own do make a pledge now it doesn't matter whatever amount you decide to give now at an H. P. R. dot org so many listeners have already done their part until their contributions all much together with your help I pay for the programming that you love\nTaylor in the county I made a pledge earlier in the dried he says is an outside sales rep I listen to NPR all day\nI Love the non biased educational conversations listen to this Andrew Taylor says my only regret is not donating sooner\nSo you're not okay Taylor this is a judgment free zones and your name Taylor than the running to win those Southwest Airlines gift card so joined him joined him and we heard from earlier one eight hundred eight nine to six or seven seven it's\nAmnesty day here at an age PR if you've been listening to for a long time but I haven't made the jump to become a member\nYou can do it today no strings attached we will not judge but but but the important thing is to pay for the listening that you do\nUm because this only happens and H. P. R. only happens because thousands of listeners like you just like you took that incredibly important step from being a passive listener to becoming an active member it's easy to do at an H. P. R. dot org and thank you very much for your support\nYou can call to when I talk to a real live person there'll be happy to hear from you won eight eight eight eight zero five six four seven seven or an H. P. R. dot org\nSupport for NPR comes from the station and from bona with the bone a certified craftsmen program a network of hardwood flooring contractors committed to expertise and customer service contract to locate her and more information or at bona dot com\nAnd from ... committed to changing lives through math by building math achievement problem solving and critical thinking skills for thousands of students every day in nine hundred franchise locations matinees him dot com slash NPR [noise]\nIs one a montage will again for Joshua Johnson and we're talking about the minimum wage with Paul San Michael Saltsman and Sarah Anderson and we'd love to hear from you to share with you know do you earn the minimum wage right now how much of a difference would Fifteen dollars an hour make in your life\nComment on our Facebook page you can tweet us ... when a you can always email us ... won a at W. A. M. U. dot org we've been hearing from so many of you Elizabeth tweets why is the minimum wage a specific amount instead of a percentage tied to cost of living or some other figure measured in it\nUs from Cape Cod I have a small landscaping in gardening business with depending on the time of year\nSix to ten employees all skilled gardeners I pay at least Eighteen dollars an hour and I support a higher minimum wage we're going to be talking about minimum wage and a living wage let's have Paul San I set the table for it's a little bit Paul the federal minimum wage\nIs just seven twenty five less than half of what Amazon is paying and what you can make in California starting in twenty twenty two hasn't been raised by Congress since two thousand and nine and its last ten percent of its purchasing power or even since two thousand nine how many states huge to the seven twenty five federal minimum\n... there are about Twenty one states where the uh minimum wage is just seven twenty five um and then there's another group of about eight states where it's boom wages is a little higher but still owe a nine dollars are lower\nUm but but ah the other ... you know there's the other Twenty one states have um a you know stopped waiting for Congress to act and have have raise the minimum wage including a whole cluster of them that are raising it significantly to the twelve to Fifteen dollar an hour range [noise]\nOne of the the the key things on the minimum wage to understand is you know it's a it's been because of of the role of money in politics and you know the congressional Republican leaderships refusal to um to to to allow any action on it um it's really become irrelevant to the federal level it's so low it's not doing its job to rate of raising pay\nAnd this is a real issue right now you know and it's a ... receiving increasing attention you know we're in a booming economy jobs are growing but there's almost no wage growth jobs are barely keeping up with rise the rising cost of living the one place where we're seeing wage growth for workers at the bottom are in those states that are raising the minimum wage and that\nThat actually speaks to the point the important point that Mr ... and the caller raised about\nHey you know if some companies are raising payment do we need a minimum wage but the the data shows that while there are some leaders to really raise the floor insert improve improve improve pay in our economy we need we need fair standards and the minimum wage has to be a lot higher and\nThe um you know things have gotten so out of whack that today close to one and three Americans\nAre earns less than Fifteen dollars an hour that some you know forty million workers the median age is thirty is thirty five\nYou know these are overwhelmingly adults who spend their careers in these jobs and it's you know it's it's not it's fast food but not just fast food it's jobs you know the jobs to make her economy run about you know one wanted for health care workers one in five educators you know\nHuge swaths of our economy of our workforce are stuck in these jobs paying less than Fifteen dollars an hour\nAnd ... I I think it says a lot when you say that the minimum wages as lay down by Congress has almost irrelevant to the real economy because seven dollars and twenty five cents [noise]\nJust doesn't go anywhere or in most states in most localities are and yet to have Congress\nAdvocating laws that are essentially irrelevant to how people really live a is a remarkable and and notable state of affairs necessary Europe proponent of a living wage and I and I read that tweet from one of our listeners who said why have a minimum wage why not index it essentially tour real life\nNow what is the difference between a minimum wage and and what's become known as a living wage\nRight well MIT has a living wage calculator where you can go on there and type thing where you live and it'll be allowed in number that's based on looking at the cost of local transportation ... and other basic needs\nI looked up on the city I live and the district of Columbia they said at the living wage there I was Seventeen dollars an hour but that's for a full time work and I want to point out that a huge ... additional problem in addition to that\nThe increase in security if work how many people are working part time at Walmart it's half\nOf their employees are part time workers\nAnd then there's the temporary workers and the subcontracted workers you know Amazon Fifteen dollars an hour is not going to apply to their a contractor sets the increased ... precarious ness of work that that's also a big problem it despite are low unemployment we still have so many people working every day for poverty wages\nI'm Paul even though Fifteen dollars an hour is twice the current federal minimum as you mentioned we're it from a lot of listeners who say in this economic climate or even Fifteen doesn't go very far let's hear from some of them\nAre in all I had a lot more and I tried to make a better for workers but whenever I catch up on a dark turn a hell of a minimum wage and that's never know\nAnd as a college graduate with a bachelor's degree and student loans I already make Fifteen dollars an hour at a fulltime job and have to supplement with at least one part time job at all times\nI think there needs to be some consideration on regional differences because I can assure you that Fifteen dollars an hour in South Carolina goes much further than Fifteen dollars an hour in California\nI work another job effect my full time job and uh so I Am kind of waiting by unfortunately a lot of credit card debt and the result and actually like Eighteen dollars an hour twenty four a fulltime job what I Believe it closer to my by\nPaul we hear from a lot of listeners there who are living on minimum wage and for many many more this has been a big issue in Congress a workers who work for big companies can't afford health care don't have insurance wind up relying on state or federal public assistance\nTo make up the difference and that suggests that all of us in some way are subsidizing low wages\nDuring these fund dries entering community events if you haven't given it's been a little while and help keep an age ... local news strong like getting now it's super easy and convenient to gave when you become a sustain or you can set it up on line at an H. P. R. dot org or you can call one eight eight eight\nEight zero five six four sat on Saturday and you\nDon't have to be a New Hampshire resident to make a gift to enjoy an HBO or to make a gift to the station\nLike to give a shout out to John from Worcester Vermont Linda from Youngstown, Ohio oh out from Eliot Maine I'm at an age PR knows no borders\nUm and neither do our listeners or wherever you listen to however you listen whether it's through the the radio or whether it's through the ap whether it's online\nOr some other device you enjoy the programs that you you're each and every day it's time now to support that those programs five ten Fifteen dollars a month whatever suits your budget make the your sustaining member gift now at an H. P. R. dot org and of\nCourse fund drives always had fun thank you gifts and it just the trip to Australia New Zealand oh my goodness um when you contribute ten dollars a month we'd love to send you are new heart phones T shirt at the thank you gift check it out on line when you make your gift at an age PR dot org or call one eight eight eight\nEight zero five six four seven seven\nTen forty one good morning support for an age PR comes from you our listeners and from Massachusetts General hospital using research to develop treatments for complex conditions all the healthier patients get back to their lives Mass General revolutionizing care\nFrom the food stores van over Lebanon and wide river junction receiving daily or weekly deliveries from over three hundred local and regional producers and farms\nAnd from University of New Hampshire in Manchester hosting open house on October twentieth\nTo explore campus in degree programs and details at Manchester ... dot edu slash open house for today mostly cloudy with a chance of some showers high temperatures in the sixties [noise] this is an HP our\nSupport for NPR comes from the station and from Boehner with a bona certified craftsmen program a network of hardwood flooring contractor is committed to expertise and customer service\nContractor locate are and more information or bona dot com\nAnd from the Brown University school of professional studies with executive master's degrees for mid career professionals in the fields of business cyber security healthcare and science and technology leadership brown dot edu slash NPR\nLooking back to one a Todd's will lick with you today I'm Sorry I ... I I Want to talk about a fight going on in Washington DC where we happen to be in a one eight studios are WHM you enter the world [laughter]\nUnfortunately increasingly so but there has been a very important wage fight going on on the local level not in Washington is a world knows it\nBut D.C as locals know it uh there was a ballot initiative where voters in DC voted to raise the minimum wage for tipped workers a bar backs bartenders waiters and waitresses people who work in restaurants primarily\nAnd there was a big fight a lot of pushback it looks like grass roots resistance and then we found out that a lot of the money for the pushback was indeed coming from organizing interests for restaurant owners of the American restaurant association local chapters and others um voters voted to say\nRestaurants bars and now the city council here in the district of Columbia has decided that voters were wrong and they are in the process of voting\nThis very day to overturn the will of local D.C voters on this issue or what does this fight here in D.C say about the state of wages especially for ... workers people who might get paid by their employer I don't know five bucks an hour because they make up the rest in in ones and hopefully five ...\nThe way I see it this week the living wage movement took three or four steps forward with the Amazon announcement on Fifteen\nAnd they took one big step back with the DC Council voted to repeal um the the will of the voters to eliminate and in a gradual way this sub minimum wage for tipped workers I'm sad\nReally than minimum wage for tipped workers is two dollars and Thirteen cents it's been stuck there for a couple of decades here in DC it's three dollars and eighty nine cents\nTechnically if you don't make enough tips to bring that a wage up to the the um the local minimum your employer is supposed to make up the difference\nThat pretty much never happens I used to work in the restaurant industry and I've talked to a lot of restaurant workers that pretty much never happens and so\nWe have a workforce of restaurant servers primarily women many women of color or at at jobs where people face rampant sexual harassment they're vulnerable because they're having to do whatever customers say to get those tips because without the tips\nThey're back down to really a A N E L a wage that doesn't amount to anything so\nPeople in the district um voted to get rid of this two tier system\nUm the industry launched an incredible campaign against it they put posters up everywhere in the city saying save our tips to try to make people think that this had something to do with banning tips\nIt did not it was clearly be beyond a local issue this was a national showdown between the restaurant industry and people who are trying to get a fair wage for this vulnerable sector of the workforce\nMichael Saltsman what did you see at play here I think we're familiar with workers versus management in a fight like this uh the DC Council voting to overturn the will of the voters is is remarkable but what about the economics of it\nWell actually so I I think in this case you had a situation where the interests of workers and management were actually very clearly aligned I mean there was a sixteen hour hearing\nBefore the council voted on this this bill to repeal the initiative initiative Seventy seven I'm I was at the hearing I testified at two thirty in the morning it wait until three twenty in the morning and the number of employees who showed up to say this is going to be harmful to us you need to repeal this far out numbered those where they're supportive\nAnd I just want to take a step back to I mean it was mentioned earlier that a living wage in in DC is is is Seventeen dollars an hour I mean tipped employees in DC\nUh according to the bureau of Labor Statistics earn with their tips about Eighteen Nineteen dollars an hour or so you have people who are already doing quite well and what happened a few years ago as a business and labor in DC came together\nAnd said okay we're we want to go to a Fifteen dollar minimum wage and regardless of what you think on the merits of that we're also going to raise the tips may win among wage in that case up to about five dollars an hour and and they did that because they heard from tipped employee as you said\nWe want to keep the tip credit we want our tips to count as income\nThere was one group the New York based group called rock that didn't like that and so they they came in and they had a lot of money that come in to try and put this issue\nOn the ballot and what happened was yes the restaurant industry um was opposed this ballot measure but you had a massive grassroots outpouring from employees hundreds of who showed up for instance to an event with council chairman Phil Mendelson to say\nWe don't want this and I think it's part of a bigger movement of him\nSupport for HP eyes live stream comes from you our listeners and from castle in the clouds Milton burl experienced\nThe beauty of autumn in New Hampshire from high up on the castle on ... states what a trails or taking colorful views while dining on the terrorists open deli through October twenty first castle in the clouds dot org workers who\nWho came forward um because the the testimony they gave it you know one forty five in the morning or the people who got up a at Franklin hall and said you know what this is going to be harmful to me this is going to be harmful to my industry\nDon't try and save me I'm not asking for it I mean I think that the the the notion I think that these people are just doing that um because they're sort of put up to it or somehow that they're not real employees\nUm I I think it's kind of insulting to what they're trying to do and Phil Mendelson the chairman Phil Mendelson mature the DC Council made an interesting point um when he got to talk about this which is that he said\nI have heard from countless employees who tell me this is not good for them I have heard from almost nobody who wants who wants to keep it and he said people can come to me privately they can email me this is not an issue of their owners being intimidated\nHe said that the grassroots on this in support of it was silent he called them the silent grass roots and I think that's that's indicative of where the passion was on this issue\nLet's pull back from the district the district of Columbia the local D.C back out to the nation at large and so many of you want to listeners\nHad been reaching out to us Nina posts on Facebook arm and a precarious position if my wages go up I won't be eligible for Medicaid so it's a wash or worst for me we talked about free riders and how many workers who get minimum wages wind up on public assistance\nAnd Randy in Tulsa emails advocates are correct Amazon Wal Mart McDonalds and the other giants can afford Fifteen dollars for a minimum wage but the local donut shop the mom and pop floors those businesses will be hurt it's just another blow against main street\nNo sir I Want to talk to you about income inequality and we're a minimum wage fits into this we hear so much\nAbout the growing wealth gap and massive income inequality in this country we talked about the shrinking of the middle class but at the low end of the pay scale can increases in minimum wage actually provide any real equity or is it just a a a drop in the bucket in a world where the top one percent on fifty percent\nIt's meaningful but in some ways it as a drop in the bucket you know a couple of years ago two of my colleagues calculated that three men that three wealthiest men in America including Amazon CEO Jeff Bass though it's Warren Buffett and Bill Gates\nUm that sort of knew was conversation is what you turn to an HP are four and we're happy to deliver to deliver you do it every day but we need your help to keep it rolling so please go to an H. P. R. dot org and become a sustained are now and thank you for your support\nIt's eleven o'clock this morning support for an HP aren't comes from you our listeners and from Dana Farber Cancer Institute of bringing Dana Farber expertise closer to you Dana Farber dot org slash locations\nAnd from the valley in middle and building supplies providing ten styles of sheds a nine styles of garages all available for installation at a home site information that law valleys dot com [noise] mostly cloudy across New Hampshire for today will have high temperatures in the sixties [noise]\nUsually the stations have do improve public radio W ... conquered eighty nine point one\n... eighty eight point three W. E. H. Hanover Ninety One point three\nW E n keen Ninety point seven W E v the forum when I was seven point one W E v J Jackson Ninety nine point five W E the F called brook Ninety point three\nAnd W. E. B. Q. Littleton Ninety One point nine an on line at N. H. P. R. dot org\nLine from NPR News in Washington I'm core of the Coleman President Trump is being criticized for mocking the woman who was alleged Supreme Court nominee Brett Kavanaugh sexually assaulted her when they were in high school\nMaine Republican Senator Susan Collins who is not decided whether to support Kavanaugh's nomination said Trump was quote just plain wrong when he made fun of Christine Blasey Ford at a political rally in Mississippi last night the crowd laughed and clapped\nNPR's Kelsey Snell says GOP leaders are seeking Collins support\nRepublican leaders are still trying to convince undecided Republicans and even some Democrats to vote for Kavanaugh and this kind of conversation is kind of the exact opposite of what they're trying to deal\nThe president has made clear that he takes this personally that he and he had a personal connection with allegations that he says what he believes to be false allegations of sexual misconduct and that is playing a role in the way that he's responding to all of this\nNPR's Kelsey Snell in Indonesia time is running out for earthquake and tsunami victims still buried under rebel Indonesian disaster officials have increased the death toll to more than fourteen hundred people Michael Sullivan reports on the rescue efforts\nSpokesman for the national disaster mitigation agency set in Jakarta that rescue workers have reached all four of the worst affected areas but he declined to give an estimate on casualties three of the areas had been largely cut off since Friday by roads damaged by the earthquake landslides and down bridges\nOfficials say heavy equipment to clear the rubble are still in short supply and increasingly desperate survive\nAnd medical supplies many still sleeping outside five days after the quake most of the dead reported so far were found in the city of ... where nearly a dozen military flights carrying relief supplies landed Wednesday morning for NPR News I'm Michael Sullivan in the non Vietnam\nTests done by the state of North Carolina show no environmental hazards in the Neuse River this after Hurricane Florence breached coal ash ponds operated buying Duke Energy Jason to ruin of member station WWNO UNC says that contradicts claims made by an environmental group the department\nOf environmental quality says their tests on the Neuse River showed new elevated levels of dangerous metals in the water while those results came as a relief to Duke Energy they are in direct conflict with tests taken by the water keeper alliance the environmental advocacy group says the tests were done too late\nBy the time regulators took samples ash had been diluted but the secretary Michael Reagan is pushing back he says the state test Smith the highest standards tests on the Cape Fear River are still pending for NPR News I'm Jason to brew in in Raleigh\nOn Wall street the Dow Jones industrial is are up one hundred thirty six points at twenty six thousand nine hundred ten announced that he's up more than fourteen [noise] this is NPR\nSupport for NPR comes from indeed used by over three million businesses for hiring more employers can post jobs and use screener questions to build their short list a preferred candidates learn more and indeed dot com slash higher and the corporation for public broadcasting\nSport for an HP aren't comes from you our listeners him from valor Sandy pasta farm offerings seasonal flavors of gourmet ravioli fresh pasta and farms dead sauces available have farmers' markets in stores state wide information that give me spaghetti dot com\nAnd I'm from the office of Catherine Jay mono focusing on family law would dedication to protecting your rights and privacy helping good people through tough times more had more than ... dot com it's eleven over for Mrs H. P. R.\nI'm Andrew per really here with Laura ... during an HP ours fall membership drive and you listen to an HBO or because you know how important accurate information is out your you listen to an HBO or to find out what's happening around the world what's happening in D. C.\nN. H. P. R. as your source for the news you need an HBO relies on you to help pay the bills that's why we're asking you to chip in your fair share at an H. P. R. dot org\nAnd here's a reason to give right now when you make your gifted and H. P. R. dot org will put your name and the running to win one of two Southwest Airlines a thousand dollar gift cards that's a lot of travel on Southwest Airlines\nAnd we'll be giving away one of these little packages at noon so less than an hour to get your name in imagined calling a friend telling a family member hey you know that chip you wanted to take we're going I've got the airfare covered that would be great get your name in the running and H. P. R. dot\nOrg if you've already made a gift so far this drive you are automatically entered into this drawing a lot of just like Lisa from Hampton who called in to support an HP are because as she said she feels at an age PR is news I can trust and the coverage is on a broad variety of issues not just the negatives in central sensationalize stories\nThat traditional news outlets covered but on the issues that matter both large and small well thank you Lisa and we'd like to thank you when you make your gift to an HBO or call now one eight eight eight eight zero five six four seven seven yes\nLisa thank you you are part of the team now here in each beyond me really appreciate that many listeners become first time give her it's just not contributing five or ten bucks a month so consider that go on line and H. P. R. dot org call one eight eight eight eight zero five six or seven\nThis is one a montage will like sitting in for Joshua Johnson in Washington for generations men and women were fed the old saying sugar and spice and everything nice that's what little girls are made of really\nTelling\nWomen across America are angry and they're taking that anger to the streets and going further\nWe know record numbers of women this year are running for state and federal office and there's a lot to be mad about wage gap sexual harassment and violence\nCondescension mockery and I'm like men women know there are risks to publicly expressing your anger or dissatisfaction with the status quo today we see you we hear you and we want to hear from you here's some of what you've already shared with us\nMy name is Cindy laying my name is Hi this is Kelly from Louisville, Kentucky I Am in my mid ... and my entire life I've been told to act like a lady\nWhen I was growing up I was always hot day you know not not really a temper my mother taught me\nNever to be angry only be night didn't or sitting in the back not making a lot of noise\nIt taught me not to really ill at night and then it kind of leave my anger and analyze it they had an adult I still struggle with expressing my anger and I cry\nI just think that there's a huge disparity between\nMen and women feeling\nWe want to hear from you as we spend this hour looking at women's rage and anger in politics at work and in the culture and we're lucky to have some fantastic gifts to help us discuss women's rage an anger in America today three prominent writers\nOut with new books on this very topic\nHere with me in Studio is Rebecca Traister writer at large for New York magazine\nAnd the cut she's out with a brand new book good and mad the revolutionary power of women's anger she's also author of the twenty sixteen book all the single ladies unmarried women and the rise of an independent nation Rebecca Traister it's great to have you know it's wonderful to be here thank you for being here and from an NPR studio in New York is ...\nShe's director of the women's media center speech project she's author of the new book rage become sort of the power of women's anger hello Shariah Hi Todd and joining from Piscataway New Jersey is Brittany Cooper Brittany Cooper is associate professor of women's and gender studies and Africana studies at Rutgers University she is out with a new book\nEloquent rage a black feminist discovers her superpower Brittany Cooper great to have you wouldn't want to\nThank Todd I'm women's anger and rage has become the focus of the last several weeks in this country with Christine Blasey Ford's testimony in the Senate and the Judiciary Committee judge Brett Kavanaugh's response\nEight is zero five six or seven seven I'm Laura ... along with ... and hopefully you with your contributions to ... help keep the news you trust and the programs you love\nOn the air it's an age parents' fault fund drive I'm sure you know that by now if you haven't yet gotten around to giving please do so now that will just take about two or three minutes and H. P. R. dot\nOrg it'll just take two or three minutes but it's important that you do it now as in like right now because\nIn forty minutes we're going to be giving away the first of our Southwest Airlines gift cards were giving a thousand dollars away a thousand dollars worth of southwest gift gift cards away or at noon to day which means that you're running out of time to get in on that drawing will be giving away another another ... another thousand dollars later today but this first one\nIs happening at noon and you want your name to be in that particular hat\nA so called now one eight eight eight\nEight zero five six four seven seven as you do you can imagine the places\nThat gift card might take you a goes up all over the continental United States as well as parts of the Caribbean or perhaps a a a Caribbean winter get away is in your guy Mars I'm ready are real or you can do it of course at an age ... or well and it really will take\nJust two or three minutes of your time and remember as you make that pledge nothing here on NPR will be here if it weren't for the financial support of listeners like you and I find that pretty profound Andrew actually\nNothing we do here at NPR would exist if it weren't for you are contributing listeners so thank you for that if you haven't yet joined the team here at NPR please do so now you already rely on each PR\nFor the news and information that you trust\nNow become part of the team and just pay for a little bit of that because if they know today and ensure a healthy future for an H. P. R. go on line and H. P. R. dot org\nIs a team effort to uh to get this train down the line um and you can join the team by becoming a sustaining member um by a sustaining member a makes a monthly contribution so basically you're giving each month throughout the year which is by the way the same way you listen you listen all year long\nSo you should consider giving us the way you listen I'm and you get a you provide us with your credit card or bank account or checking account information and that a contribution is automatically deducted every month if you're already as a savior consider\nWe're getting by five or ten bucks a month or whatever works best for you or you can sign up for it online\nOr over the phone but uh check out N. H. P. R. dot org will and check out the thank you gifts while you're there we've got T shirts we got mugs yes we have a trip to Australia New Zealand we've got it all make a pledge and H. P. R. dot org or call one eight eight eight eight zero five six or seven thousand\nSupport for NPR comes from this station and from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial well being first learn more Raymond James dot\nCom and from bona with a bona certified\nCraftsmen program a network of hardwood flooring contractors committed to expertise and customer service\nContract or low cater and more information or at bona dot com [noise]\nThis is one eight I'm Todd's will like sitting in for Joshua Johnson we're talking about women's anger and taking it seriously with ... director of the women's media center speech project and author of the new book rage for concerts Brittany Cooper associate professor at Rutgers University and author of the new work eloquent rage\nAnd in the studio Rebecca Traister writer of writer in New York magazine in the cut and author of good and bad we want to hear from you to do you think right now is a moment in us history for women expressing themselves in the form of rage and anger you can comment on our Facebook page you can tweet us ... when a\nYou can always email us one a at W. A. M. U. dot org and we had been hearing from so many of you want to listeners primarily women\nBut not exclusively Petra emailed to say I am so tired of people equating my anger with the insanity\nFriends laugh at my posted insinuate that I've lost it and you know what I have I have lost my inability to be quiet in the face of gross injustice and Joan emailed us I'm sixty five and I was in college with the first feminist resurgence\nIs the world the usa ready for women's anger that's like asking African Americans when will the world be ready for their anger the answer never power doesn't seed without a fight don't even ask the question the question itself is demanding\nAnd peg in Traverse City emailed this on a conservative woman that is angry that someone can be assumed guilty based on unproven allegations I'm angry at the assumption that all American women are anti Kavanaugh pro choice liberal and progressive I'm a proud American woman who's also conservative pro life pro Cavanaugh\nI Am an American woman to\nNow Rebecca Traister you started to paint a picture of the history of women who've gotten angry and made their mark their anger is not always shown in the same form as somebody\nYelling in the face of a senator like Jeff Flake on live TV but anger nonetheless and Brittany Cooper you've written a book about finding your power in rage uh tell me a little bit about that theme and how this story fits into the moment\n[noise] a shore so part of what happens is that women are told as many of your listeners say that to be angry it's to be irrational\nUm and I had a student when I was a graduate instructor in front of me um and said to me that she loved to listen to me lecture because my lectures were filled with what she called the most eloquent rage ever\nAnd it was a wakeup call for me as someone who had run away from the angry black woman stereotype my whole life because I didn't want to be discredited as a black woman moving through predominantly white institutions\nAnd so my student who was a young black woman saw me a kind of authenticity and she helped me to realize that my anger wasn't keeping me from doing my job or showing up offering quality lectures are material or material but then it was absolutely\nAnd so in that moment I made a connection that I've been encouraging other women to make which is ... knowledge that we have the right to our rage and so reject ideas that said that when we're angry about legitimate injustices\nThat this in some way make the irrational or makes our plane illegitimate and when we then begin to own that anger doesn't mean that we would come destructive or harmful it means that we happened to the energy and power and we start to use that energy and power to build the kind of world we want to see\nA and more women need to give themselves permission to do that I've given myself permission to do that I'm at in this moment I Am on the front lines of saying women outrage have the potential if we own it and if we don't apologize or\nTo change that very scary a trajectory of this historical moment we have a lot to be afraid about or we have a lot to be angry about opposite that anger is the catalyst for being able to do something about the things we see\nNow what's move from the Senate committee hearing room in the hallways around the Senate um and even the books that are esteemed authors have written onto the tennis court and the U.S open for another moment that American shared within the last couple of weeks\nSerena Williams in her match against Naomi Osaka at the U.S open here's a cut I'll bring it back there to refresh my memory of anger on the court Serena Williams infamous exchange with umpire Carlos Ramos\n[noise]\nSuresh from Shawnee you shared this moment along with the rest of America is Rena is a champion and one of the most famous black women in America somebody who got angry and somebody found who found that anger of weaponized against her\nAh yes I I think that what we saw in their response was everything that Brittany in Tribeca and I have been talking about it\nWas interesting because there are so many egregious examples of men behaving in the same way but not facing the same policing or penalties mean she\nShe was a defined that was levied against her is the highest ever for verbal abuse in the history of the U. S. open I Believe and so in that moment there were two very distinct response as if the responses of the people that really just wanted to see her in isolation acting um\nIt and this exchange with this man but then there were people who really looked at that exchange within the much broader context of\nThe power dynamics in the moment and the history in the context and the legacy of discrimination within the sport that she has faced\nAnd so I think that one thing that has been unexplored in the bigger conversation about that is the central and pivotal role of title nine in understanding women as leaders or as people who have the right to defend themselves or engage in public conflict\nUm what she was really doing was I'm asserting her right to defend herself and to have dignity in the moment not be accused the way that she was accused and with sports I think it's important to note that we now have not one but two generations of women\nSo a generation of role models\nIn about twenty minutes a but we also have a a a um a bevy of other ah thank you gifts to on offer you can check them out of an H. P. R. dot org including a T shirt and mugs combo we've got to a newly designed a heart phones T shirt and mugs\nUh graphics that we've we've put on those objects you can check them out\nAnd H. P. R. dot org and we'll send you the ... and the T shirt for just Fifteen dollars a month as assisting\nOr yes I get your name and now because again will be giving away one of those one thousand dollar Southwest Airlines gift cards at noon coming up in twenty minutes and then\nAnd do there is the granddaddy of give away it was a grand baby I have been doing fundraising for a long time and let me tell you this one is a doozy of a giveaway I Love is the winner of this drawing I'm Will get tickets for two and eight nights I'm eight nights\nAccommodation in New Zealand or Australia yeah ooh lo J. job would not be fabulous so um get your name and now you can yes an\nH. P. R. dot org or call one eight eight eight eight zero five six or seven seven\nSupport for NPR comes from the station and from the main office of tourism offering traveled there is an opportunity to explore and discover their very own main thing to be inspired be original and be yourself had visited Maine dot com\nAnd from Newman's Own foundation working to nourish the common good by donating all profits from Newman's Own food products to charitable organizations that seek to make the world a better place more information is available at Newman's Own foundation dot org\n[noise] on talks were like sitting in for Joshua Johnson we're talking about the power and women's anger\nI'm Talking with Rebecca Traister for New York magazine and the cut author of good in mad Bernie Cooper associate professor at Rutgers University and author of the new book eloquent rage and also ... director of the women's media center speech project and author of the new book rage becomes her\nNow I read an email from Karen at the end of the last segment the said she was hurt disappointed and angry wounded about the treatment of Hillary Clinton into twenty sixteen campaign and I want to go there because Hillary Clinton is one prominent famous\nWoman well known for navigating the shoulders of how women are supposed to express themselves in public now Hillary Clinton has a history of being very careful and very deliberate mindful of appearing angry or emotional she's been at it for thirty five years in America\nAnd in fact it was news in the two thousand and eight campaign I remember this when she shed a tear in New Hampshire one tier and it was at the top of\nCNN for like a new cycle and a half\nSo now a lot of people are saying that the twenty sixteen presidential campaign I'm Hillary Clinton in fact was was tone police listen\nI regret deeply how angry [noise]\nThe tone of the campaign became [noise]\nNot\nYour fault says one audience member when when Hillary Clinton very deliberately in that you know Hillary fashion\nSays I regret how nasty the campaign became a ... to this moment has clearly struck a chord Rebecca Traister who's laughing here in the studio with me but how does that strike you know she was off she was she was very very careful in her choice of words there to even as she was commenting\nOn it I mean I think it was um it was ridiculous that this woman was called an authentic while being held to the standard\nOf care full control in her voice and her facial parents and her body\nAnd her mode of expression I mean the two candidates um that were her primary opponents but Donald Trump and Bernie Sanders could act in unhinged ways they could show up looking unkempt they could pound ...\nYou know they could turn red in the face and as men they could leverage this enormous tide of populist anger and that was a gender card nobody wrote about that as a gender card right there were all of these conversations about\nI'm Hillary Clinton as there often are with women because we associate gender with women and pretend men don't have a gender\nUm and and so they could do that and she couldn't leverage that political power and we saw that over and over and over again throughout the campaign\nRecord ... is so right about this and I'm In fact the thing that the irony of what we were told about Hillary Clinton both Bernie Sanders and Donald Trump or congratulated by the political pressed for their particular skill and channeling the anger of their supporters this was their gift they were able to give voice to this frustration\nAnd we were repeatedly told that some of the authenticity of Hillary was that she couldn't convey anger and passion\nAnd yet every time she spoke too close to a microphone somebody said you're yelling your shrill um she really got directives at one point Joe Scarborough she was giving an ... a a speech the night she won a primary and Joe Scarborough sad smile is if it was like some catch cholera on the street smile more\nUm she was told that regularly\nAnd I think that that's again an example of of not having that tool to wield she also has done remarkable writing and talking herself\nIn instances where I've interviewed her and she's written about\nCampaign about the process of not using that anger she writes particularly about that second debate where Donald Trump came up behind her and kind of loomed behind her and how menacing and aggressive his body language was and how during\nThe debate a presidential debate she was doing internal calculations thinking can I turn around and confront this guy she said she thought about turning around and saying get away from me but then she was thinking no no no\nThat's gonna redound negatively to me that's gonna make me look bad it's gonna hurt me strategically and the debate and so she didn't and one of the things that that little story tells us about\nHow much energy women expand\nModulating considering strategizing thinking tactically about how to use their voice how to suppress their voice how to channel their anger how to swallow their anger what to do in order to be rhetorically effective\nAnd and I think that that's something that that all three of us are writing about and thinking about is the amount of time and energy women spend doing this kind of maneuvering around the rules around are angry expression is\nNow I Want to talk a little I Want to talk a little bit in the last ... section of the show that we have about where some of this anger goes because this is a moment in America and let's be realistic moments have a way of fading they just do and and so I'm interested in where this goes when\nMaybe the cameras and all of the writers who aren't Rebecca Traister and Britain Cooper are not as interested anymore you know in in a couple of years I think that might happen and I want to know where this goes now we've been hearing from so many one listeners I Want to play you another mash up of some of the women's voices who've been reaching out to us about how they're feeling\nMy name's Aaron I'm calling from Lancaster, Pennsylvania this is Sarah from Cincinnati\nWhen I met my anger bubble over and I get really angry out loud it it really doesn't do much good I find that if I express a strong opinion or even just a bit of discomfort with something I'm perceived as being angry are overreacting women yelling even in this day and age that very acceptable\nMen don't seem to have that same problem and I'm\nStarting to feel like maybe it's not just a personal issue I'm dealing with what's going to be nice and and uh and keep our mouth shut however I Am so angry and so angry right now maybe women all over the place you're dealing with it\nI'm turning my anger into action given help but feel like I'm not alone but still pretty discouraging I think that but when that happens you have to take that anger hold on to it\nAnd that's how we're going to take back this country\nWe're hearing from listeners women who it feels like there's a theme or transferring\nSome of their personal rage I'm sure a lot of it's in in personal life not just political life or cultural life but into action taking action industries taking action maybe at the ballot box we got\nThis tweet from Tracy in Jacksonville I'm One of the thousands of women using their frustration to run for office I'm running for the Florida House district Fifteen I Am focused on my determination to be a voice for all and the focus on issues important to Jacksonville\nFamilies Tracey as one candidate who says that this moment of anger is very important for her motivation a Brittany Cooper I Want to talk about where\nThis goes in terms of maybe the midterms that might be the most\nImmediate effect I'm a none of us knows exactly how that vote is going to turn out but it seems like any\nPollster or political analyst worth anything is looking down and what they call the cross tabs and noticing a that women are mad women are going to vote and women are going to form a tidal wave in twenty Eighteen one way or the other\nAbsolutely and that is as it should be um I'm particularly heartened by the Stacey Abrams campaign down in Georgia we have the opportunity to have the first black woman governor\nSupport for an HP our live stream comes from you our listeners and from revision energy a local employee owned company helping thousands of granted staters go solar", "year": "2018", "show_name": "1A Plus", "city": "Keene", "day": "03"}