{"month": "10", "state": "NH", "station": "WEVN", "content": "Dot org you truly can't support us at any level I think that's one of the cool things we would ever worked for your budget we don't put a price tag on on this radio station on on this programming a news it's up to you to show us how much you support ah this this an HBO but what's most important is that you do it and you can do it by calling us at eight eight eight\nEight oh five six four seven seven or eight and H. P. R. dot org\nWhen\nA is next at ten here on an HP are where support comes from you our listeners and from you in ages MBA programs fulltime online and part time in Durham and Manchester information session October seventeenth details an application at NBA dot U.\nAre these credit union offering a wide range of banking products including checking and savings accounts loan and credit card information on how to join in any field guide or [noise]\nThese are the stations of New Hampshire public radio W ... conquered eighty nine point one ... Nashua idiot point three W E VH head over Ninety One point three\nW. E. V. in Keene Ninety point seven you'll be ABC Gore um when I was seven point one\nWu VJ Jackson Ninety nine point five W. E. V. S. cobra Ninety point three and W. E. the cue Littleton Ninety One point nine and on line and H. P. R. dot org\nLive from NPR News in Washington encore of a Coleman the FBI is finished it supplemental background check on Supreme Court nominee Brett Kavanaugh as NPR's Ryan Lucas reports senators are now reviewing the material\nThe White House says it has received the FBI's report on Kavanaugh and has transmitted it to the Senate\nMembers of the Senate will be able to review the material to day and they secure room at the Capitol Senate majority leader Mitch McConnell has scheduled a procedural vote on Kavanaugh's nomination for friday if that passes a final vote on confirmation would likely happen over the weekend both of those votes need a simple majority of fifty one senators to pass\nThe FBI was looking at sexual misconduct allegations against Kevin all the exact scope of the investigation remains unclear but it appears to have been limited the White House dictates the parameters of the investigation the president has said his guidance to the FBI was based off of what Senate Republicans wanted Ryan Lucas NPR News Washington\nNPR has learned that the FBI interviewed nine people as part of its supplemental inquiry of Kavanaugh lawyers for professor Christine Blasey Ford who accused cabinet of sexual assault in high school and said the FBI did not interview her\nThe Justice Department says it's charging seven Russian military intelligence officials with cyber attacks on anti doping organizations and other agencies this follows similar accusations earlier today from the Netherlands and Great Britain and here's Lucy and Kim has more on\nThe Russian foreign ministry reacted angrily tort British Government announcement on Thursday the u._k. is national cybersecurity center said that Russian military intelligence was behind indiscriminate and reckless cyber attacks against governments businesses\nAnd even the world anti Doping Agency which it investigated Russian athletes that accusation was followed by an allegation by the Dutch Defence ministry\nThat Russian military intelligence also targeted the organization for the prevention of chemical weapons which has been looking into the poisoning a former Russian spy Sergei Skripal the Russian government has consistently denied any involvement in cyber attacks or the attempt an scruples life\nYesterday president bloody murder prudent described him as a traitor and scum bag Lucian Kim NPR News Moscow\nNATO officials say the U.S service member has been killed in Afghanistan the name of the service member has not been released NATO says it's investigating\nJapan's as it will revise its plan to hunt endangered steak whales in the northern Pacific ocean Japan is facing sanctions John ... reports from Tokyo that's because Japan commercially sells the whale meat in violation of international law\nAn international conservation groups as bringing the whale meat home from Hans constitutes international trade which is illegal for endangered species Japan killed as many as a hundred and thirty four of these whales every year on to the pretext of scientific research is programs have been criticized for producing a little in the way of results\nJohn ... reporting on Wall street the Dow is down one hundred thirty points to ... down Seventy three that's off almost one percent you're listening to NPR\nFor NPR comments from NPR stations other contributors includes the three I O T providing a software platform that enables organizations to deploy artist\nAnd I O T solutions and industrial scale learn more at sea three I O T dot AI\nSupport or an HP aren't comes from you our listeners and from from her piper ... Kramer PC providing experience legal guidance in collaboration with the businesses and individuals throughout New Hampshire learn more primary dot com and from on bluebird self storage and New Hampshire owned and operated business\nOffering through climate controlled pick up for a new customers and personalized service details of bluebirds storage dot com it's ten oh for this is an age PR\nEvery single day you choose to listen to an age PR for high quality news and information that's why you're here and we welcome you today we're asking you to contribute any amount to help pay for the listening that you've already done over the past year and that you will do in the year ahead\nThis is indeed an HP arts fall member Dr this is where every listener contribution\nCounts and it really doesn't matter how much get set up on your checking account or your credit card debt and H. P. R. dot org ... along with them\nHey Laura how some of the largest comes right off of a ... hosting her show and she cares so much about this radio station she's so passionate about what we do\nThat she's here asking you to step up and support as well and when you contribute during this fund drive if you make a contribution before the end of\nThe day tomorrow you'll be entered in our once in a lifetime a trip for two to Australia drawing full airfare eight days and nights in the country of your choice that can be yours when you become a member of an HBO or at any level but to do so we need to hear from you need to hear from you can give online at an age PR dot\nOrg and we've heard from so many people during this drive it's been great and we love it when you leave us our comments and I'm Dan Stephanie in Dover left to comment that we hear from a lot of people she says being informed conveniently on my commute to work so thank you Stephanie we certainly hear that from a lot of folks me pre she ate it\nCounts dentist one she says I leave and each PR on for my pets when I'm gone don't know if they're entertained but they haven't complains she says by the way also that she loves all the programs including some of the weekend programs\nThe weekends coming up so get your pledge in now get it done get out of the way it'll put a smile on your face when you do online at an H. P. R. dot org [noise]\n\nThis is one egg on Todd's will like in Washington sitting in for Joshua Johnson well the report is in the FBI has submitted the results of its limited investigation into Supreme Court nominee Brett Kavanaugh\nThe report came in late last night we're told hours after that Senate majority leader Mitch McConnell filed a motion for friday's vote on Brett Kavanaugh's Kavanaugh's nomination on the Senate floor the final vote on whether it confirmed him\nIs expected to happen Saturday joining me to discuss the report and its potential fallout is NPR Justice Department reporter Ryan Lucas Ryan welcome thank you so we have this report or will the Senate has the report now or do we the people had any idea what is actually contained within the four corners\nWell we don't have any sort of specific snow and this is certainly something that is confidential and not a something that is generally released to the public and there are no plans at this point according to the Judiciary Committee chairman Chuck Grassley for any of this to be made public\nA despite clearly a fair amount of interest among Democrats to make this public and certainly I think among the Trump a chunk of the American public to to learn what's in there of what we do know is that publicly at least\nSix people have confirmed that they spoke to the FBI many of them are people who are friends of judge Kavanaugh's during high school that would be mark judge PJ Smith Tim ... and Chris Garrett\nA as well as one friend of of Ford's that's ... ...\nAnd then there's a second woman who made allegations of sexual misconduct against cabin on that's Deborah Ramirez and we know that she also spoke to the FBI now a NPR has learned um that uh nine people according to a to a an official nine people spoke with the the FBI in total\nUm but again a lot of this is\nOne that you know we don't know what all the FBI was told in this uh and likely we're not going to get a full picture but what we do have so far as what a chairman Grassley has said in that is that there's nothing in there that the committee and the public at this point didn't already know so where\nIs the report right now physically I mean how our senators looking at it because it's extremely sensitive every reporter in Washington wants to get a look at it in in every political operative does too\nWill uh the process for this is governed by a memorandum of understanding that uh dates back round a decade uh but what generally happens is when the White House gets his background in information on a judicial nominees nominee that will send it over to a Senate Judiciary committee has generally held in the Judiciary Committee safe\nToday it's being held in a secure location in the capital and which senators can come down and look at it there are the space is basically working in shifts right now we're Democrats will get now are um to take a look at it and then Republicans and there are small handful of a staffers who have clearance to see this as as well but basically\nWhen you contribute you will be automatically entered to win a our grand prize in this year's fall on drive the once in a lifetime for for two to Australia or New Zealand it's your choice where you want to go\nAnd tomorrow at seven so you've just you've the hours are really taking by um uh the winner will choose either on New Zealand or Australia thinking about what you could do in one of these countries on the other side of the globe in Australia obviously you've got the great Barrier Reef\nA Sydney with its famous opera house in harbor I'm thinking about the natural a landscape and New Zealand the fjords in the mountains and the sub tropical forests\nAre both either place would be a fantastic way a way to spend eight days and nights fully covered airfare out of Boston that can be yours but you must give now you must become a you must support\nAnd if you are before the end of the day tomorrow to get and you can do that at an age PR dot org\nAmerica feels pretty divided these days no kidding hey there I'm Joshua Johnson the host of one day\nAnd I'm Terry Gross the host of fresh air I'm guessing you listen to NPR to hear reports in interviews about divisive issues handled and thoughtful reflective ways and hear interviews with the creators of today's most interesting moving books in\nThis nation needs these conversations the hard stuff and the stuff was hard but no one can bring it to you alone it takes you and me and Terry and listeners all over the country\nTo join all the people who already give what they can support public radio and make a donation\nWhen you do you'll become part of something bigger a group of people who believe in the power of listening and engaging and trying to understand each other\nIs essential right now here's how to help [noise]\nGo to an H. P. R. dot org make a quick contribution there you decide the amount and H. P. R. dot org or call one eight eight eight\nEight zero five or six or seven seven and Josh what is so right here in each PR we do tackled the hard stuff that fun stuff on the exchange we just had our astronomy round up today so that was a lot of fun help pay for these conversations that we know you value give now it N. H. P. R. dot org\n... for a lot of folks they tune into an HP are for the great local reporting whether it shows like lowers the exchange or the news coming out of our our newsroom here full of a reporter is based in and around New Hampshire but for for a lot of folks to any skirt is your pipeline to all the news and program from NPR\nOh we spent here and he's for we spend about five hundred and twenty five thousand dollars a year to bring you that news from NPR's it's a big price tag but it's worth it obviously but we need your support 'em to keep that going listener contributions are the single largest source or you can support that kind of listening\nWhen you become a member now you can do it at an H. P. R. dot org and thank you so much\nSupport for NPR comes from the station and from bona with the bone a certified craftsmen program a network of hardwood flooring contractors committed to expertise and customer service contract to locate her and more information or at bona dot com\nAnd from ... committed to changing lives through math by building math achievement problem solving and critical thinking skills for thousands of students every day in nine hundred franchise locations matinees him dot com slash NPR\nThis is one eye on Todd's will like infer Joshua Johnson what do you think of when you think about Brazil do you think of the host of the twenty sixteen summer Olympics\nWill turn to the world's most American started in Rio de Janeiro Brazil for the opening ceremony or ... or ...\nOr if not the Olympics do you think of the host of the twenty fourteen feet for World Cup [noise]\nNeymar has got a goal or maybe\nSupport for any PR it's live stream comes from you our members and from the law firm of or in Reno sustain excellent since Nineteen forty six offering sound judgment and a practical approach to New England legal challenges\nFind out how or in Reno can help you online at or gash Reno dot com\nEmerging markets in the world to Brazil was once heralded as Latin America's crown jewel\nBut then it was hit with a one two punch of a massive corruption scandal and stunning economic collapse now unemployment in Brazil is at Thirteen percent the country has\nSixty thousand homicides per year on average and its current president boasts of an approval rating of just three percent all of that is backdrop to Brazil upcoming presidential elections far right populist ... he's facing off against the leftist his rival\nFernando had died on Sunday\nAnd the lead up to the election has already been packed with drama including balls and arrows near fatal stabbing last month\nAnd we're here to talk about what the election means for Brazil in how what happens in Brazil will reverberate across both America's Monica to bowl is he or she is senior fellow at the Peterson Institute for international economics\nShe's also director of Latin American studies at Johns Hopkins university and she she's here with me in the studio Monica thanks for being here thank you for having me up Bryan winter is editor in chief of America's quarterly and the vice president for policy at the American society and the counsel of the Americas\nHe joined us over Skype from Sao paulo in Brazil Brian thanks for being here\n... happy to be with you good to talk to you and ... is director of the Brazil Institute at the Woodrow Wilson International Center he's also with us here in Studio Paolo thanks to you for being here pleasure to be a well Brian you're the one in Sao paolo so let me give you honors here to start\nA let's start with the nitty gritty who is ... and our most Americans might not be familiar with him\nAnd ... a retired army captain who has been in Congress for nearly three decades\nNow I'm ... despite having sat in Congress\nFor so much time he he shows open loading for uh for the legislative body I mean he has said over the years numerous times that the Congress is dysfunctional and it should be closed um he's also advocated torture of his political or of leftists in\nAnd other political opponents 'em and you know that message for a long time was was regarded as marginalized here I mean he was not a popular figure but in the last couple of years because of this historic economic crisis that you mentioned Todd\nThose messages um are resonating a lot more with people when they did in the past and now here we are with this presidential election coming up on Sunday and he has a ten point lead and old over his nearest rival it looks like there will be a runoff vote which would be on October twenty eighth\nAnd that was that was a close call right now between him and and the guy who's likely to face with this Fernando who died\nBut it's it's just so strange for me to be here because I Lived in Brazil for five years and if it was not that long ago I was here from twenty ten to twenty Fifteen and this seemed like just such a strong democracy it seemed like a place that had come so far since the period of last military rule\nFrom Nineteen sixty four in Nineteen eighty five but being here this week and talking to people I mean I there's a lot of people who are ready to vote for both in our all even if it does mean a return to you know the more authoritarian ways of the past year\nSome people suggest that both wrote a brine we're going to work on your sky blind a little bit of will\nTo uh Monica what about Fernando had died in in contrast is not as\nFiery as ... of course both in our has been described by some as Trump being or maybe more akin to do ... in the Philippines likes to waive guns around and say that drug dealers should be shot or threatened to summer summarily execute them what about his opponent front for of Fernando ... what do we know about him\nSo what we know about him um is that he's not a an organic member of the Workers Party the P. T.\nUm he's someone who sort of an outsider when you look at the composition of the bt far left so he's not he's a moderate um but the leadership of the Workers Party of the PTA currently is very radicalized so it's very different\nFrom the time when former president Lula was in government for example from twenty three\nI'm twenty can wind up party really did take this sort of center left stamped so the party at south now is very much hard left\nUm the candidate though isn't\nThat being said the the real big problem in Brazil at the moment is that\nThere is a lot a lot of anti P. T. anti worker party sentiment so\nA lot of the vote that had been migrating too far right extremist both an arrow um is this anti PT vote so these elections are very strange because they had become elections about\nNot who necessarily voters actually went to see as president but about who voters do not see a friend\nAnd we're going to talk about corruption we're going to talk about graft we are going to talk about a failing economy because all of those things play and I think to\nThe idea that voters know who they don't want they don't want the people who were taking billions of dollars in bribes which has been a major problem we're gonna talk all about that Apollo let me turn to you what about turnout in this election Brazil has\nPlease take five dollars a month or ten dollars a month out of my checking account or my credit card\nAnd then you're done you don't have to think about it any more one thing we should mentioned Dan ah when you are standard you get special access to our pledge free stream so you can listen to the program we just had an exchange on astronomy\nWithout losing any information during the pledge break that's pretty cool to get it set up on line it's really quick and easy and H. P. R. dot org or have somebody walk you through it at one eight eight eight eight zero five six or seven\nSeven so many reasons to support an age gr here's a here's another one when you become a sustaining a member when you give a at a regular monthly amount of Fifteen dollars a month we would love to thank you with the new and he's pure T shirt and mug combo to Central's in life\nUm these are brand new this season they'll look sharp as you head out this fall and into the winter there'll be our way of saying thank you to you and you can tell the world\nAre with your mugs and T shirt combo that you support and age PR on the Fifteen dollar a month to sustain her level I'm an affordable way to support and HBO or you can sign up and do it at our website and H. P. R. dot org and thank you so much for your support\nSupport for NPR comes from this station and from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial well being first learned more at Raymond James dot\nCom and from bona\nWith a bona certified craftsmen program a network of hardwood flooring contractors committed to expertise and customer service\nContractor locate her and more information or at bona\nCom [noise]\nLooking back and won a pods will lick we're talking about the political climate in Brazil heading up to this weekend's presidential election what's happening in Brazil might seem familiar to Americans in the wake of the twenty sixteen us presidential elections\nMy guests are Monica ... senior fellow at the Peterson Institute for international economics Brian winter is the editor in chief of America's quarterly and the vice president for policy at the American society and the council the ... of the Americas\nAnd Paolo ... is director of the Brazil Institute at the Woodrow Wilson International Center and you had been sending us your message is one of the listeners drew emails I was in northwest Brazil last month\nStaying with a gay black friend he is all in for ... people are so fed up after the carwash scandal they will go for anything that isn't part of the Workers Party\nNow Monica before the break you were telling us about car wash the actual car wash in the broad offensive corruption scandal or is it over ... have have all of the [noise] I don't want to mix metaphors but have all the will have all the cars been overturned and opened up and cleaned out in a car wash\nWell it is winding down um so the bulk of it has already has already occurred but let me go back in time just a little bit because it is important to put into context you'd think\nThe most important um findings have love I had to or of car wash worrying twenty Fifteen and twenty sixteen and at that time I'm president Dilma Rousseff of the Workers Party was Brazil's leader she had been reached\nAt that time um she was impeached in twenty six team\nAnd part of the reason for her impeachment there are many moving parts here but one of the moving parts with the fact that acey had lost control of hook up her coalition and her her coalition had\nUm a number of other political parties that war implicated in the car wash\nFindings in the car wash probing the plea bargains 'em and everything else that started to come out publicly in terms of this particular investigation\nShe wasn't she didn't she never did anything to actually stop the investigation which was really a positive thing um but that was one of the things that actually lead to her downfall because\nThe the impeachment that she suffered\nWas really very much politically motivated by the need that some of these political parties in her coalition had to try to at least slow love our job to if not stop it all together and this is a very important element when we look at the degree of polarization that currently exists in Brazil\nBecause if people who still defend the workers' party instill defend the P. T.\nThey go back to the impeachment of earth that as one major argument for why you know things that the Workers Party has been let's say unfairly treated in the way that the that that things have gone down\n[noise] Matt writes to us or on email I had a Brazilian friend years back who called his home country the greatest country that never was meaning to Brazil has had such riches in terms of natural resources\nBut it is not had the government or the leadership to make it a competitor with the United states uh Paolo Matt makes a good point Brazil was celebrated as the rising star not only of Latin America of emerging economies around the world compared to India and China we mentioned it at the top\nAre now horrible recession horrible corruption what happened in Brazil where was to Brazil that that hosted the Olympics in was and was on the way up\nWell I think Brazil believe too much in the magic that it's a country predestined to be great\nAnd forgot to do the necessary things you do in order to build that country or one of the major betrayal is precisely the workers bar too far to the was led\nBy a man born in poverty a that to build this very successful ... own initially ethics in politics\nThere is this sense after Brazil or ... or basically riding a wonderful wave in international economics\nBig producer of commodities had the wonderful moment Barbara too was reduced and that is what led to this impression that Brazil was unstoppable well a than reality hit\nA ruler made a very bad choice and his successor a and a a lot of a shot to came\nAnd the magic word disappeared or what we have to do as a consequence and this is what I think what this really positive and all of this\nWe cannot blame others for our problems this crisis was produced in Brazil by residents are and another thing that the sport that surely positive\nIs the fact that the states in Brazil is basically broke and we have run off the money ah all that dream now has to be has ended and the nightmare has to be going from the from the ... reality ... basis where the government has run all the money we have\nNecessary to do this are very dos and unpopular and none of the candidates have explain exactly what the how they plan to go from the Jews\nNow Bryan winter you're with us from Brazil or I read an article Bryan that you recently wrote where you were asked by a friend I think to sum up Brazil in two sentences and I'm going to paraphrase a little bit your answer ultimately your conclusion\nWhich too many BS privileges for the elite not enough good leaders what exactly did you mean by that tourists conclusion\nWell if you look around right now at the field of candidates there's there's one thing that all Brazilians agree on which is that they find the candidates running for president to be an inspiring um the vast majority of people here as we've said during the program I\nFeel like they're voting against somebody rather than voting for somebody and the consequences of that\nIs is just I mean it's it's stunning for somebody who lived here during that era when things were going really well which you've mentioned tied the degree of cynicism the degree of disbelief\nThat people have in our system of government is just amazing and you know it's part of a global trend I mean we've seen this happen in places like turkey in Hungary and elsewhere around the world\nBut this democratic recession as some people have called it really is especially strong here and that makes sense because Brazil is taking a bigger beating um in terms of its economy and in terms of the reputation of its politicians because of this\nCorruption scandal than virtually any other western democracy in recent years there was a poll by the\nPew Research center and twenty Seventeen that found that just eight percent of Brazilians say representative democracy is a very good form of government that was the lowest I'm thirty eight countries that ... that you surveyed\n... and it just shows you the climate here right now and the reason why many people fear that both denaro if elected would basically have carte blanche to take a you know hard right turn it could involve the curtail moment of\nCivil civil liberties and and and other things I I and my time I'm this week um I've had meetings with people from civil society and the press and others who you know these are serious people not prone to panic or anything like that who are talking openly about the possibility of exile\nAnd you know Dan and I and I've been saying it only takes two minutes three minutes to make that pledge if you want to spend a little more time in that process no problem we don't mean to rush you go to an H. P. R. dot org take as much time if you'd like to get all the options to put all the cool thank you gift check out the trip we want to rush you but\nIf you are busy it does take just two minutes and H. P. R. dot org and thanks\nIt's eleven o'clock morning support for an age PR comes from you our listeners\nAnd from Daniels restaurant a panic are offering ... daily for business or pleasure overlooking the control of river information and menus and Daniels I've had I've heard dot com and I'm from the Huntington at national has her bourbon silverstone living life plan community situated onto the five rolling tree lined acres in Nashua\nInformation at the Huntington now ... or [noise]\nThese are the stations in New Hampshire Public radio W. E. V. O. conquered point one\nW. E. V. S. Nashua any point three\nTo ... age or Ninety One point three W ... keen Ninety point seven WABC Gore I'm One of those seven point one\nW E v J Jackson Ninety nine point five W. E. V. S. cobra Ninety point three ... W E v cue Littleton Ninety One point nine and on line at an H. P. R. dot org\nLive from NPR News in Washington encore of a cold and the FBI has wrapped up its supplemental background check of Supreme Court nominee Brett Kavanaugh but questions have been raised about the scope of the investigation NPR's Ayesha Rascoe has more details about the probe\nA White House official confirmed that the FBI interview nine people during its latest review the White House asked the FBI to reopen the background investigation after Kavanaugh faced accusations of sexual misconduct from decades ago Kevin I strongly denied all allegations against him\nSome of the people interviewed by the FBI includes having a high school friends and one of Kavanaugh's accuser Deborah Vermeer as\nChristine Blasey Ford the first woman to publicly accused Kevin not sexual assault was not interviewed Kavanaugh also did not face additional questioning from the FBI Democrats have argued that Ford Ann Cavanaugh should have been included Ayesha Rascoe NPR News\nThe Justice Department is charged seven Russian intelligence officials with computer hacking\nThey're accused of trying to destabilize the world anti doping organizations and officials who exposed Russian state sponsored doping a Russian athletes\nThe west charges come after Dutch officials alleged earlier that Russian agents try to sabotage an international chemical weapons watchdog agency ... over a guard has more\nThat's intelligence forces stopped the cyber attack on the organization for the prohibition of chemical weapons as soon as it were discovered back in April according to the country's defense minister who release the information today for Russians on diplomatic passport\nAt the time and the attempt in cyber attack the OTC W had been investigating a nerve agent in the poisoning of a former Russian spy in England official saying the same Russian intelligence unit is also suspected of trying to steal information about the investigation into two thousand fourteen Malaysia Airlines crash over Ukraine\nFor NPR News I'm a little regard in Denmark\nOfficials in Indonesia plan to reopen an airport in the city that was worst hit by last week's earthquake and tsunami NPR's Lauren Frayer reports from Jakarta the facility will now start accepting civilian flights\nThe air traffic control tower at the ... airport toppled in last week's earthquake baggage carousel there strewn with debris computers are down boarding passes a written by hand\nSurvivors have been camping out waiting to escape getting airport up and running is critical for evacuee ease and also for incoming supplies food clean water if you will and mosquito nets\nNPR's Lauren Frayer reporting from Jakarta, Indonesia and officials say more than fourteen hundred people have died\nOn Wall street the Dow Jones industrial average is down nearly two hundred points at twenty six thousand six hundred thirty to the NASDAQ is down Ninety five points Seventy nine hundred and thirty more than one percent the U.S and the five hundred is down Eighteen points this is NPR\nSupport for NPR comes from NPR's versions other contributors include T Rowe price offering a strategic investing approach that examines investment opportunities firsthand institutions advisors employers and individuals choose T Rowe price T Rowe price invest with confidence\nSupporter and H. B. R. comes from you our listeners and from New Hampshire businesses were social responsibility hosting the sustainability slam Thursday November first at la belle winery and evening of sustainability story telling an H. B. S. R. dot org\nAnd from clean you'll downside management in Norwich, Vermont tailoring investment portfolios reflect each finds individual goals and social values\nInformation at clean yield and dot com ... for this is on H. B. R.\nYou listen to and they fear to get up to date on what's happening in our world I'd like to thank you consider an HBO or dependable source of local national international news\nAnd I'm here to remind you that listeners are are more dependable source of funding we're allowing you to keep us going just like you rely on us to keep you up to date\nA today during our phone driver asking you to contribute in any amount we leave that up to you to help pay for the news you trust the programs you love a vegetarian do every day you can give through your checking account or your credit card\nAt our website is all lined up there for you are at an H. P. R. dot org\n... and here with me is lurk annoy\nWell and when you contribute we will enter you into\nWhat I'm calling Dana granddaddy ever give away I mean we've had giveaways and giveaways but this is a biggie this has lived for two\nTo Australia or New Zealand eight days eight nights airfare from Boston allows that I could not choose I'd like to go to both places you get to make the choice if you're the winner but you do need to get your name and make a contribution to an HBO I don't need to be a lot go on line and H. P. R. dot org\nAnd H. P. R. dot org or call get your name and that way one eight eight eight\nEight zero five six four seven seven\nYou'll be supporting all that great local and national and international news here on an age PR think about all the um the the kind of cutting edge of programming a news you here locally here from an HBO or investment in long form audio storytelling and investigative reporting through podcasts and series\nUm the local news at the top of the hour you rely on you can support all that in more when you become a member when you help sustain an inch gr financially can do it at our website and H. B. R. dot org\n\nThis is one egg on Todd's will like in Washington red states blue wave phrases we hear all the time now in America but on election night in Nineteen eighty four news anchors had to explain the viewers why they were coloring certain states on the map red and certain ones blue\nStates are states that we have for justice having those ... are regular soil is shows with\nExplained in detail there by the network news now fast forward to election night sixteen years later a far more dramatic event the two thousand presidential race was the closest the country had ever seen\nAdvise them by CNN right now is moving earlier that for a Florida [noise] back to the\nPhones to call us\nNow that's the night that red and blue clashed into their current meetings then I went to Florida was blue than it was too close to call and it was read then unknown\n... started to hang and then Bush Gore you might remember that it's also the night according to my guest Steve ... when our increasingly divisive politics came to a head\nAnd established America's polarized identity as the red and blue and in fact that is the name of his new book the red in the blue the Nineteen nineties and the birth of political tribalism\nSteve ... is the author he's MSNBC and NBC News national political correspondent\nAnd he's in the studio with me Steve it's a pleasure to have you it's great to be here things have me I'm Steve we're going to talk a lot about fascinating political history we're also going to talk about where we are now in our politics or our electoral politics the house the Senate the Kavanaugh hearings which have captivated American undercurrents of the politics there\nBut let's go back to two thousand because we just took it did yeah into those\nMemories of hanging chads and Bush Gore and the recount in Florida and the Supreme Court deciding the results of an election\nUm that's where your book begins and also where it ends why was that such a pivotal moment for political ideology America yeah no I mean I think it's the two thousand election to me which is you as close to a perfect I think as we're ever going to see in a presidential election\nUm it was the perfect combination of the nineties all of the\nPolitical wars of the Nineteen nineties Bill Clinton Newt Gingrich Hillary care Ross Perot pitchforks Pat Buchanan impeachment all of these these major battles these major forces\nThat shape politics created this division that when you looked at that map on election night two thousand and you saw the entire south was now painted red red for Republicans the entire northeast\nMinus New Hampshire barely a was painted blue for Democrats the Pacific coast you could see these these stark geographic boundaries and they were more than geographic they were they were cultural boundaries they were demographic boundaries\nBeing informed makes a difference and so does your support\nHere's how to make sure this report it's\nAll you have to do is go to our website and H. P. R. dot org and H. P. R. dot org or call one eight eight eight eight zero five six or seven seven your contribution certainly does matter no matter how large or small\nEverything you hear on an age PR firm our news programs to our talk shows to our podcast is made possible in large measure by contributing listeners people who give people who pay a little bit for the lifting that they do act now during our fault fund drive make a gift of your checking account or your credit card at an age PR dot org\nI'm ... and with me as Dan dark\nAnd when you contribute a you'll be entered when this fantastic a ... a drawing for a fantastic triple a lawyer and I've been talking about it\nA little bit for last hours you may have heard if you're just turning tuning in let me tell you I'm this is recalling or once in a lifetime trip for two to either Australia and New Zealand and if you're the winner you choose\nSo you get 'em for for a round trip airfare out of Boston and a combination for eight nights in either country um you can set your own itinerary you can take advantage of the wild landscaping either country or so for more urban\nUh outposts and maybe Sydney or per se\nUm you can indulge in all the ... wonderful things both countries have to offer landscape and wine and food and those ... accent I'm the best way to get the only way actually to get in the running for that drawing is to give to support an HP are\nAre right now at any level and you'll be in the drawing no matter how well do you support us you can do it on line at an age P. R. dot org\nDamage just heard that little bit about how some people think they don't vote in mid terms and and why midterms matter or some people think they don't matter and PR civics one oh one team I just want to give a shout out to them it's a refresher course our podcast\nOn how the basics of how our democracy works the stuff you maybe learned in civics wanna want a long time ago but kind of forgot that is fine because it was one on one is here for you and they've got a new series just out of five part series on the midterms and why they matter the new one is is just out and you can listen to it on line\nGet your podcasts and remembering your contributions help pay for information like that as well that kind of keep you up to date so given Alan and H. P. I. dot\nOrg we'd love to hear from you know at our website or you can give us a call at that's easier for you eight eight eight eight oh five six four seven seven a or a website lord said an H. P. R. dot org it'll just take a minute your support will go a long way and thank you\nSupport for NPR comes from the station and from Boehner with a bonus certified craftsmen program a network of hardwood flooring contractor is committed to expertise and customer service contractor located are and more information are bona dot com\nAnd from the Brown University school of professional studies with executive master's degrees for mid career professionals in the fields of business cyber security health care and science and technology leadership brown dot edu slash NPR\nThis is one eight on Todd's will like I'm Talking to MSNBC and NBC News national correspondent Steve ... about his new book the red and the blue the Nineteen nineties and the birth of political tribalism\nWell here is one well remembered moment from the nineties I take you back to president almost president at this point Bill Clinton\nYou answer that question is our number ... ... when I was in England are experimenting with wounds and didn't like it and didn't inhale and they're trying to do\n[laughter] Bill Clinton in the run up to the presidential elections in Nineteen Ninety two or the deceased late Christopher Hitchens went to Oxford with Bill Clinton said the idea that Bill Clinton didn't inhale at Oxford was probably true because he knew first hand that Bill Clinton chose to take his marijuana in edible foreign\n... Hitchens used to say he was no friend of Bill Clinton by the way we should stipulate that\nA Bill Clinton's answer was lampooned at the time it's still remember now\nTwenty six years later what political moments do you remember from the Nineteen nineties we want to hear from you what did they tell us about our politics today you can comment on our Facebook page you can tweet us ... when a you can email us one a\nAt W. A. M. U. dot org we heard from Susan who sent us an email I Believe that our political risk started well before the Nineteen nineties the Vietnam Conflict was one of the most visited issues\nSince the civil war and we still have never recovered\nAnd not witty tweets us on Twitter I was in high school when Gingrich and company produced their contract with America I remember peers who had been pleasant with each other suddenly became antagonistic suddenly politics became a team sport that experience is one of the reasons why I today and nonpartisan\nUp Steve you're nodding and I think that type of reaction to sorting\nMight sound familiar to you I Want to go back to the history and just a moment but before we do I want to get to a moment in tribalism in politics where we are right now I Want to talk about Lindsey Graham Lindsey Graham back during impeachment was a member of the house he was an impeachment manager\nHe helped impeach Bill Clinton and then went before the Senate to make the case as a prosecutor\nThat Bill Clinton should be removed from office because of the Monica Lewinsky\nExperience I'm now Lindsey Graham is also made himself highly visible these last several weeks during the Brett Kavanaugh hearings he angrily defended Kavanaugh he said the other day in the hearings I think everybody saw it I'm a single white male people want me to shut up and I won't shut up and he was red faced and he was furious on behalf of\nBrett Kavanaugh and presumably white men everywhere but contrast that with the Lindsey Graham of twenty sixteen and twenty Seventeen and even twenty twelve\nHears Lindsey Graham at a roast dinner and twenty Seventeen poking fun at Paul Ryan speaker of the house but making a point you're forty six years you've been the\nSupport for HP eyes live stream comes from you our listeners and from castle in the clouds Milton burl experienced\nThe beauty of odd I'm In New Hampshire from high up on the castle on ... states what a trial or taking costs of used while dining on the terrorists open deli through October twenty first cats on the clouds dot org\nThe same Lindsey Graham used to warn about the future of the Republican Party he would quipped to me at any reporter who would listen we can't make angry white guys fast enough to survive as a Republican Party in the future meaning Republicans at your broaden their appeal to women to minorities to Hispanics flash\nForward to the Lindsey Graham of this week I'm a white male and I'm not gonna take it anymore stunning what does this transformation Lindsey Graham ... and\nIn the Trump era CD you about where we were in in in where we are yeah I mean I think it tells me that the divide is deepening and you know did tells me that the\nThe lines that were kind of drawn to you that you saw in the two thousand election and I say that we've lived with a sense\nThey're only going deeper in the moment you talked about there in ... after twenty twelve election\nThere was as you remember the certainly the the Republican sort of establishment nationally look to the Mitt Romney's last a brac Obama included what you know what Lindsey Graham did it demographically the way the country had been divided up for the last Fifteen or Twenty years was not going to work for them long term\nThey came up with that autopsy report they were going to change on immigration all this stuff\nDonald Trump comes along and violates every tenet of this of this autopsy and wins\nAnd I think it it's not just that he won the general election or less a huge part of it but the fact that he was able\nTo sweep through the Republican Party is like the primaries like he didn't twenty sixteen\nTold Republicans like Lindsey Graham and of course easy to forget but Lindsey Graham did run for president in twenty sixteen one of the sixteen or Seventeen Republicans who did and failed miserably and I think that's what I think that lesson there of going head to head against Trump of dismissing him completely at the beginning of that race Graham called him a kooky called him a bunch of things\nUm in twenty sixteen and then watching how\nWithin the Republican world how Trump resonated with voters it told them boy there's something about our own voters our own party our own tribe\nThat we didn't quite understand maybe we didn't want to understand granted more than ... more than just name calling in a primary he told Republicans we are finished if we nominate Donald Trump that he is the death knell of this party\nSo what is Lindsey Graham thinking now is he thinking I have to win a Republican primary in twenty twenty in South Carolina where Donald Trump is popular so I'd better get on the Trump train and that's all there is to it the last\nThe last gasp of the Republican Party and I'm going to be a senator for one more term or is he is he converted what's he think yeah I mean look there's then there's all sorts of theories about this and I don't know but I'll give you a couple of them that that that that jump out at me what is what you're saying yeah he's got to worry about a Republican primary every Republican one of the lessons\nOf Donald Trump's rise and his enduring popularity with Republican voters one of the lessons\nTo Republican officeholders as you are taking a major major risk\nIf you are seen as separating yourself from this president your neck primary especially if you're a Lindsey Graham and you already have a history of sort of being\nA being antagonistic towards the right here and they're so grim has to worry about that there's also the theory that hey part of this is Lindsey Graham trying to play the influence game if you if you're you know friendly to Trump in public if you sing his praises or if you change your tone on Trump the way he as if you're a golf with him\nMaybe if you're Lindsey Graham and you have some issues particularly on foreign policy and national security this is a way to influence them but I think one of the other lessons to is it is again\nAnd if you give a two edged PR become what we call sustain or you set up a monthly plan at the Fifteen dollar a month level or you can ask for any spurs knew a T shirt and mug combo are calling on our heart phones it's got this new design firm are very talented graphic designer producer Sarah ... a baby blue heart\nA wrapped up in a pair of headphones\nOr because they are because you love listening or that we've got on the T shirt and on a mug a very eye catching and a great new addition to if you've been collecting are a fundraiser mugs for years this one I think it's fair to say this was probably one of the best that kind of want it you're actually my walk I started with us on here\nI'm ... years when you become a standing member at Fifteen dollars a month\nGo on line to an H. P. R. dot org\nCheck out the McGuire there it's a beauty is such a big to sell an H. P. R. dot Oregon stand said make your pledge or call them take just two minutes of your time one eight eight eight eight zero five six or seven seven\nWe'd love to hear from you or whether it's online or over the phone or make your pledge of support and thank you very much and H. P. R. dot org\nNPR comes from the station and from Rhodes Scholar and not for profit offering learning adventurous for adults and natural settings across the country learn more at R. O. A. B. scholar dot org slash retrieves\nFrom ultimate software dedicated to putting people first with cloud based solutions for HR payroll and talent management learn more it ultimate software dot com ultimate software people first and from the listeners who support this NPR station\n[noise] it's one a talk with you today we've been ...\nToday I have a quick update for you the top Republican on the Senate Judiciary committee says the FBI has turned up nothing\nTo corroborate allegations that Supreme Court nominee Brett Kavanaugh was involved in sexual assault in high school and another instance of sexual misconduct in college there is nothing in it that we didn't already know said Senator Chuck Grassley adding\nThere's also no contemporaneous evidence\nThis investigation found no hint of misconduct\nAnd the same is true of the six prior FBI background investigations conducted during judge Kavanaugh's twenty five years of public service that was Chuck Grassley chairman of the Judiciary Committee I was quoting their ranking member on the Senate Judiciary committee Democrat Dianne Feinstein of California disagrees she says it looks to be the product of an incomplete investigation\nThat was limited perhaps by the White House Dianne Feinstein ranking member expect much more on this throughout the day on your NPR station\nI Want to turn back to Steve ... in just a moment but before we do a quick appeal for some help with the program in the works for next week here on one day we spend a lot of time yesterday to talking with women about how society views angry women and there's a broad range of opinion but most of the women were hearing from our progressive and liberals\nIf you're a conservative woman tell us how you're seeing this moment what have you got to say\nHow do you want to be heard in the fight over Brett Kavanaugh and in the fight over me to the discussions over me to in this country do you think your views are being represented or respected leaves the voicemail eight five five to three six one a one a if you're a female Republican or at least someone who describe themselves as\nBroadly conservative what do you want the country to hear about you tell us your story eight five five to three six one a one a that's eight five five to three six one two one two will make sure to get your stories on the air part of the national conversation in the days ahead here on one a while we're talking for the most part\nAbout what politicians said and did in the Nineteen Ninety so how do they define their ideologies for the American people it's not just Washington it's polarized we've been asking listeners for memorable moments from politics in the nineties and and here's one\nAnd the president is right\nIn many ways we are a shining city on it\nBut the truth is that not everyone is sharing in this city's splendor and glory there is this fair Mr President\nAnd the faces that you don't see in the places that you don't visit and you're a shining city\nAnd believe you're hearing from Mario Cuomo their former governor of New York maybe at the peak of his political career the shining city on the hill well here's what I was going for another moment or the moment that listeners sent us from ... to the early nineties I take you back towards any overhaul [noise]\nSoon to be president President Bill Clinton June Nineteen Ninety to ... or send you also remember him for ... before that year presidential\nCandidates didn't really appear on nighttime talk shows at all so that was something new talk about how politicians grappled with media coverage during those years a Steve that was a moment not just because the president appeared on our city hall but he seemed to offer an alternative\nTo gosh even Pat Buchanan speech there is a religious war in this country very stark\nVery serious and in a lot of Americans agreed with him here was Bill Clinton in sunglasses just having a whole lot of fun the guy you want at the party it was also the moment that was June Nineteen Ninety two when Bill Clinton did the Arsenio Hall show Bill Clinton was actually running now\nThe presidential race at that point first laser Ross Perot [laughter] that was laced with Bush the incoming president in third place buried\nI was about twenty five percent was Bill Clinton and so they were his team he remembered the bill Clinton who emerged from the Democratic primaries in Ninety two had was thought to be an electable he'd gone through the scandal about Jennifer Flowers he'd gone through the scandal about avoiding the Vietnam draft he'd gone through the I didn't inhale moment that sort of hard in this image of\nSlick willy the guy who's going to you know lawyer Li ... scheme is way out of\nOut of everything and so they were trying his campaign was to change his image and he had this you know obviously winning personality and they wanted to showcase it and they wanted to get around\nInterviews with you know traditional news interviews where every question was going to be about gender flowers and the draft and all that so he was a way you go on a syndicated nighttime talk show like Arsenio Hall which was very hard at that moment you're showcase a different side of your personality\nAnd it was Ninety two it wasn't just are sending in Ninety two was the year\n... media had been expanding in so many ways in that media expansion really met up with politics presidential politics I mentioned Perot\nWho was running in first place at that point the entire Perot phenomenon began in February Ninety two on the CNN show Larry King Larry King and and Larry King would sometimes have politicians on and sometimes aging celebrities and they'd spend an hour and they take calls\nAnd Ross Perot was on and February Ninety two and he said you know if the if there are volunteers out there who will put me on the ballot in all fifty states I'll run for president as an independent\nIn just from that\nA movement sprung up organically across the country to do in Texas about two months later volunteers submitted two hundred and fifty four thousand signatures to get Ross Perot on the ballot and he was running in first place by June and he was doing talk shows\nClinton was doing talk shows there was a Clinton Jerry Brown primary debate on the Phil Donahue show the syndicated daytime talk show\n'em in in George W. Bush this was a generational aspect to\nSixty eight year old George W. Bush the president running for reelection his spokesman said after Bill Clinton did the Arsenio Hall's show that night well we won't be doing anything like that\nIn our city hall went on his show the next night and just tore into Bush that went went after it was beneath the presidency yeah it was beneath the presidency to go on a nighttime talk show where people goof around and make a you know goof adolescent jokes that's not\nThat's not for a president and Bill Clinton said Oh yes Oh yes it is said and by the end of the campaign that Bush wasn't do in our city oh by the end of the campaign but he was doing\nYou know morning shows on TV in ... he was starting to sort of get the message\nUm\nNow managed media in a very very different way now going on a late night talk show is par for the course because people want you to display your personality Brock Obama had a winning personality an affable nice guy and used it\nTo great political effect everywhere from Jimmy Fallon to Stephen cold there there isn't a show that Iraq Obama didn't go on successfully um Donald Trump in his campaign did the same as well because he's extremely comfortable on live television even if\nSomehow less likeable than than maybe Barack Obama was but but the mores of how you reach the public have changed just radically they changed completely since the moment when George W. Bush said we're not going to lower the presidency by going on or sending home and I think too you can you can draw a line between we were talking about Gingrich earlier\nIn the rise of Gingrich net moment with a meal what that moment came from was Gingrich looking for a way around what at the time where the dominant sort of media platforms and they were just the broadcast networks and Gingrich\nThird term congressman from Georgia said I'm not going to be able to get my message out across ABC CBS NBC because they don't pay attention to me he CSPAN give CSPAN was five years old and the early Nineteen eighties and he used the late night speeches and CSPAN to seek out find and develop a relationship with a new audience draw a line for\nCareer his rise in the house around that fast forward to Donald Trump or to Donald Trump do\nIt television obviously a part of it but really in the campaign social media Twitter Donald Trump identified through Twitter away to go around", "show_name": "1A Plus", "year": "2018", "city": "Keene", "day": "04"}