{"month": "10", "state": "FL", "station": "WJCT", "content": "Absolutely utopia it was founded by Charles land is in the Eighteen sixties\nAs a utopian community but utopia in the terms that he and people in Victorian times could imagine which still contained a lot of\nClass gender and racial bias so it was utopia except that the workers were doing all the work come to the British people were\nHaving this lovely lecture series and the life of the mind so and so many of the characters are real people they are\nCharles land is the petty dictator of this town but most interesting to me of all is a woman named Mary Treat who was a lady scientist as they called them in those days a naturalist who\nCorresponded with Darwin and who ah worked with him through a correspondence on various experiments and she was really\nA strong advocate of Darwinian world view\n[noise] so in that area you pick the sort of scientists like Mary Treat and an other characters and the journalists of that era against the demagogues in the form of the man who founded the town Charles lettuce right and then in this modern era the main character is also a journalist\nAnd the family has fallen on hard times are dealing with failing health care in poverty and unemployment\nAnd they're also debating the twenty sixteen election and they're feeling panic to the certainties of life are being swept away but differently\n[noise] yeah they also are experiencing this disorientation this was a family of people who really mostly followed all the rules the adults anyway have followed all the rules\nWilla the protagonist feels like she did everything right she got her college degree she worked hard she's been a journalist for most of her career\nAnd in her mid fifties her magazine's folded\nShe was a great editor but there were no jobs for people like her likewise her husband is an academic and their family has followed\nHis quest for ten years from city to town finally he got tenure and then his college folded so all of the problems this family has our problems that are um [laughter]\nYou know sort of come from the the real life that we see [noise] yeah I was gonna say sort of my standard you know meeting with friends you know afternoon with friends of the things we talk about our all of these things people are losing\nEvery kind of shelter even people who have not felt that they were particularly vulnerable a decade ago are finding that the rules have changed and that all of these various kinds of shelter\nThat we've all counted on our crumbling so now you\nCompare these two eras quite pointedly with two of the of the leaders of of that and this time the president Donald Trump ... although you don't name him and I don't know who you're talking about [laughter] and and Charles lend us was sort of demagogue of of the town\nMhm [noise] it's really not about leaders so much as people's willingness to be led\nI'm interested as a novelist and you know the human psyche that's our our paint box we look at behavior and look at the different things people do in response to crisis\nYou got married treat saying I suppose it is in our nature when men fear the loss of what they know they will follow any tyrant who promises to restore the old order\nYeah I did write that [laughter]\nThis is a very political novel in as much as it grapples with the big themes of the moment climate change science journalism what is the role of art in this time\nI think the role of art in any time is to look past the door frame and the and the window frame into what's just outside\nI ain't our daily experience to try to\nBroaden people's vision a little bit in any way that the novelist um feels capable of doing that and to create empathy for the theoretical stranger and I'm I wanted to look past blue states red states put\n\nBack because you live in Appalachia right and so\nYou have a particularly unique perspective on this I Do I live in a very rural place south western Virginia I also work in a profession that means most of my colleagues are in urban places mostly in New York so I moved between\nRed state and blue state between rural and urban between these two cultures that are so divided that they've really stopped talking to each other they only talk about each other\nAnd I'm the bat you know this neither minimal number bird I have to fly between these cultures and see what I could rent or for the reader in terms of interest in in terms of sympathy\nI feel there's a bigger question looming over the book in comparing these two time separated by a hundred and fifty years in which many of the same issues are being debated\nHe's just saying that there really is no progress and we always end up in the same place well I don't think it's saying that exactly I Do think it's saying people are people um ... there are things about us that will always\nBe true one of them is that when we feel there's a scarcity we get real grabbing some [laughter] we want to get hours I think it's deeply embedded in our nature in our DNA to be suspicious of the other of strangers are people who seem different from us\nThese are all inclinations that's not to say it's how we should be or even that it's how we always are but I also want to remind you that I write literature so I really work in the um\nDomain of sentences and images and character and personality so\nAbove everything I Want this to be really fun to read\nIt's a great read thank you Barbara Kingsolver his new book is an sheltered thank you so very much You're welcome [noise]\n\nYou're listening to weekend edition from NPR News I'm Luke Garcia Navarro thanks so much for listening happy Sunday\nSupport for NPR comes from the station and from PBS with the eugenics crusade American Experience explores the history of the early twentieth century campaign to breathe better American race eugenics crusade Tuesday at nine eastern on PBS\nAnd from the University of Florida we're solving for next is powered by its land grant heritage from renewable energy to global health us students and researchers are working to solve challenges at next dot U. F. L. dot edu\nSample the incredible musical performances from first 'cause connect with studio fi sessions\nFeaturing the theory as hot as local bands theatrical performers and big name national acts coming through town [noise]\nWeather on your phone or at home these are the checkout studio five session on the Web at W. J. C. T.\nW. J. C. G. jaguars season parking is still available\nThe heart of the coolest tailgating downtown includes pay ... an indoor bathroom at contact ...\nThree five eight six three one\nOr log on to WDC dot org slash for\nReserve doors face today [noise]\nThis is one for you to join tonight sixty minutes of those great only ... on the army\n\nSays eighty nine nine W. J. C. GSM Jacksonville providing news information music from Florida's palm coast to Georgia's golden aisles what's on your computer or mobile device the W. J. C. C. dot [noise]\n[noise]\nRobyn VR WB easy Chicago who says wait wait don't tell me\nThe NPR News\nI'm Bill Curtis but I'd better say the thing of course was Columbus Day one for Columbus emerged from his whole shadow is six more weeks of all we're celebrating the change of the season by listening back to some of our favorite segments for the past year\nGet away with astronaut Scott Kelly actress any follow go one possible future presidents awful don't get\nPitches his new theme restaurants\nInternational Space station me David I should allow so of\nCourse there are about our way of coming up right after this hours they\nNo one could not look at that [noise]\nScott have you ever run into one of these crazy people it says the earth is flat and nobody seen it and say excuse me I have\nYeah you know I had a ... and some of my advantage they actually have blather protestors\nOut what the hell are coming out I Love\nScience fact that you know science explains why the earth is round that those kind of people just don't believe in that and that's either you believe what what you want but at the earth was truly flat wouldn't be edge be like a really cool place to visit like the best [laughter]\nThat's a really big oil to\nBuild a house there I'd look over my bedroom will be hanging over the edge\nThings you've done I have no doubt that would be the case cats kept pushing things off the air\n\nI Know because you say that\nSaying that everybody ask you about is the toilet up there and I and I was going to stay away from it but then in your book I found out something amazing\nWhich is this weird barter system you have with the Russians and would you would give them I guess extra energy or from what was that you generated from the solar bottles and they would give you their urine [noise] you know it's part of it [noise]\nIt was changed me turn it into the water and then we drink it oh I guess if you take their your and your change and in the water you drink at a turn back into your at all just seem so pointless when you think about it [noise]\nUm ... and I know what you're thinking that guy ... H. P. or a whole year right I wasn't saying I drank enrolling everyone's fate\nI I was going to cause you could you tell who was it was no\nBut it does taste better than the water and Florida\n[noise]\nCommander Scott Kelly we're honor to talk to you but we've invited you here to play a game today we're calling\nInternational Space station meet international house of pancakes [laughter]\nBefore the I. S. S. was launched another institution showed us what we get will me cooperate across nations namely five different kinds of artificially flavored syrup were asking me questions about the pancake chain to right and you win a prize one of our listeners a short stack of voices and their voice mail I ready to fly\nI Am ready All right\nBill who is commander Kelly playing for\nThe next ... of Indianapolis, Indiana\nAre here is your first question I hop seemingly so harmless has been involved in lawsuits such as which of ease a I hop the P. S. F. they sued the French NGO pancakes cells frontier for diluting their brand [noise]\nBe I hop versus apple they sued the computing giant saying the name I've had some too much like I hop or see I hop versus ... they sued to the international house of prayer for using their acronym while preparing people for the rapture [noise]\nI Would say hey\nYou are saying hey they sued the French ... a non governmental organization pancakes sends frontier [laughter]\nWhich presumably would bring pancakes to needy people in war zones [noise]\nNot my area of expertise are I mean it was ... let me let me so she job I think\n[noise] the\nThe international house of prayer it's confusing because both I ops are considered symbols of the end times alright\nI also got in trouble for a marketing tactic and twenty Fifteen you probably missed it you were in space what was it a a TV ad with actress Kendall Jenner preventing a riot by giving a Rudy ... breakfast through a policeman [laughter]\nMe a tweet which said their pancakes are quote flat but they've got a nice personality\nOr see an attempted viral campaign where they covered sidewalks and pancakes are up and told people to quote slow down and come on in the eye out\nI'll go with the you're an engineer and you figured it out that's right\nYeah [noise] people\nNot so funny not so funny so they took a damn alright last question when the first I hop open in New York City's East Village a few years ago [noise] neighbors rose up and protest why they felt a quote Swedish pancakes weren't offensive cultural appropriation\nBe they didn't like a sign up front that said New Jersey taste without New Jersey ... [laughter]\nThe stake of bacon twenty four seven\nThat's interesting you know no kidding I like bacon or going to go with the bank and smell [noise] that's right\n[noise]\nKind of man drank his own he well\nHe was also man if you read his book who was stuck up there smelling things a lot of space I'm Bill how committed Scott Kelly doing\nAre certainly impressively Scott you were studying up there weren't you you got 'em All right congratulations\n[noise]\nThe pinnacle of flight you everything you could fly you flown from the space shuttle to now the international space station\nWhat's next for you can apply\nThe international house of pancakes\nGr ands that year in space a lifetime of discovery Scott Kelly thank you so much for joining US Army\n\n\nLeave it in times have changed it's important to celebrate things that stay the same like dumb politicians Roxanne\nCongressman Mel Brooks of Alabama's a proud member of the house science space and Technology Committee this week he argued that instead of global warming sea levels might be rising because of what oh wow all those iceberg falling into the water making and you're actually close not icebergs rock rock\nRock on the committee for the committee for the Republican\nCongressman pointed out when you put stuff in containers of water the water level goes up as soon as best up why wouldn't be true in the ocean tell me that\nGrow technically right [laughter]\nBut but the it makes sense like how the volcanic eruptions in Hawaii right now could have been caused because the earth said some bad Chile you know [noise]\nThe climate scientist who was testifying at that moment was not persuaded by the congressman's argument saying quote I'm pretty sure that on human time scales those are miniscule effects wall sinking quote what a moron [noise]\nBoth bones [noise]\nWhen we come back often goldie makes terrorists some exciting and we we live a bluff game that struck close to home for many listeners will be back in a minute with more wait don't tell me from NPR\nIn the Gaza Strip and lean drinking water grow scarcer digging time\nYou'd been demi disease burning and guns and\nPeople will stop moving to the fences and they wouldn't be moving with ... with rockets then we moved in with him he's not [noise] desperately calling out the clean water might be on the water crisis next time on living on her from the ... on Sunday afternoon at four on eighty nine nine couple huge ACT\nI'm Stephen ... on the next ... economics radio one of the men who helped rebuild New York city after nine eleven now helping build the city of tomorrow\nOur mission is really to use technology to redefine urban life and the twenty first century how will the city look different here's one big thing you don't allow traditional vehicles into the district\nIs next time for economics radio Sunday at one PM on eighty nine nine W. J. C. T.\nOh\nIt's a weapon a medicine and murder mystery plot and sometimes actually see\nIt sounds like people sitting down to a dinner party\nPoison dinner party\nTurkey a little more ...\nButter roll the little bar and\nPick your poison next time on to the rest of my knowledge from the\nSunday at three PM on eighty nine nine W. J. C. T.\nSupport for an NPR comes from NPR member stations and from progressive insurance offered in a way to buy a home insurance with their home quote explorer to\nCustom quotes in rates are available online learn more progressive dot com or one eight hundred progressive now that's progressive lumber liquidators offering flooring installation nationwide with new styles of hardwood and would look waterproof flooring\nMore lumber liquidators dot com or one eight hundred to ...\nYou ... for oh three six AM to utilize your current family owned makers of ... Kentucky strict bourbon whiskey utilize your Craig ... Kentucky forty seven percent alcohol by volume he loves your Craig promotes\nResponsible drinking\n[noise]\nKnow I Know a a a\nEconomics is difficult and sometimes abstruse and even the little doll but can you explain to us [noise]\nOr the terrorists are good idea [laughter] I'll tell you why they're terrible idea\nBut to do that I Will give you a small story about my trainer who lived\nIn a house with my uncle Bob in Lubbock, Texas\nThere was a disagreement in the family what it was that my aunt arena cooked but it ended up stuff down the sink or where it clog the drink okay and my uncle Bob went to the store and got a product which has since been banned which was called the Bob and the bomb was a combination of a plunger and a firearm\nOkay [noise] hard for a gym in every job\nYou fired it in and it was born with like an explosive device we project to project ... and you put the pressure on an airplane you blow it out yeah [noise] and it's that on the outside use only one charge\nOK okay by my uncle Bob is not the type to use only one oil is available so he fired the entire thing\nMost interested in economics I [laughter]\nThe ... of the drain the lasagna ... whatever it was\nAnd they looked into what in Chicago we will call it converted it was a house at a wall down the middle there were two identical apartments and the drains not just go straight down they connected in a little why\nRight so every time the bomb to drain it did it go down the drain and the shortages\nThat person comes over ... Bob was there some got a terrible blow up and get that can happen and they go he said I'd like to show you my apartment\n[laughter] by answering this look on your blown out there that is exactly what's wrong [noise]\n\nYou blow it out of this deal drain ride on the auto industry Boeing and [noise]\nThe ceiling and that's what's wrong\nWith it ends up destroying thousands more manufacturing jobs\nThan you're saving in the one where you ... that is so great and I have this deep conviction that if only you had been there to\nExplain it [laughter]\nThere still was that was ... that was great now do bitcoin\nOften goes me it was a pleasure to see you back here again we've asked you though this time to play a game we're calling survey from the left clear from the right since you study actual economics we're going to ask you about home economics [noise]\nTragically there is no Nobel Prize there should be two questions regular price one of our listeners in a homemade handled in ... for yourself\n[noise] bill who was often go we'll be playing for Michael Roy of San Diego California\nOkay here's your first question according to the Nineteen fifty for home ... textbook experiences in home making\nWhat must you always do in preparing the meal hey wash your eggs before using them being made sure your husband deserve the kinds of meat closest to the law in\nThe rain is the accompanying vegetables in the shape of a smile [noise]\nWas washer eh yeah there's always been retracted\nHuge controversy about refrigerated ... whether you should refrigerator eggs yeah and you're supposed to refrigerate eggs in the United states because they've been washed and there's some protective something around an egg in nature that you really are not on [noise]\nI'm going to get the eggs you're right [noise]\nYou ever seen or an egg comes from so you'd walk\nAll right next question home ec classes at Cornell University were pretty different before Nineteen sixty nine before that the college regularly did what a give actual babies to the students to use this group\nPractice children [noise] the they taught everyone that serving family style from one big platter was communist [noise] see they they they made students spend five minutes in a two hundred and Seventy five degree rooms so they could quote feel what a pot roast felt\n[laughter] under in\nSeventh grade when all three of those sounds crazy [noise] isn't the Cornell hospital not in Ithaca New York so maybe it couldn't be [noise]\nDidn't President Obama ever shout at you for God's sake God and just say something [noise]\nFeed into the living room and I guess the baby you're right it was [noise]\nIf you mess it up it's a rental alright [noise] last question a\nHome economics classes we discovered a acts were somewhat widespread and they have produced some notable alumni or including which of ease a Martha Stewart who received Bernard colleges first ever grade double a in a special home economics major be Michael Jordan\nWell known around these parts who took home economics in high school in case you didn't make enough money to go out to eat when he grew up see Ozzie Osborne who created a recipe in math class for back allocation of\nI and I have to go with his ... so you're gonna go Michael Jordan yeah yes it was Michael Jordan\n[noise]\nCurrently he said do an interview ones that he took home back to learn to cook\nHe worried his ears were so big he'd never find a wife\nOh\nAustin will be doing what he did great and I'm always impressed with somebody gets three out of three\nWell known [noise] of course a former senior economic adviser to President Obama is now the University of Chicago oh single they think is so much for coming\nReactor behind Carmelo soprano makes it an offer we can't refuse even though that wasn't the movie she was in\nAn Ohio governor and former presidential candidate John Case it gets too polite to say I told you so we'll be back with more wait don't tell me from NPR\nAn NPR investigation finds that across the U.S female inmates are disciplined more often than male inmates\nYou'll get a ticket for having like a piece of candy for like you have a library book that's overdue and you're on your way to the library\nI'm sure ... join us for the first in a series of investigative reports on discipline and went into prison next time on all things considered from NPR News Sunday evening at six on eighty nine nine W. J. C. T. [noise]\nAn appointment with public radio for a family doctor\nShortage faster on your health [noise] it'll be a jam packed over and over the\nIncluding those Russell before Lehman ease the genie back where it was a great time soon juggle faster on your\nB. R. S.\nSundays it's five eighty nine nine W. J. C. T. [noise]\nBrand headache doesn't think elections are good for democracy is fundamentally flawed and I'm not sure if they could be fixed his idea replace politicians with randomly selected citizens work when people do these people make trust to balance decisions\nHacking the law next time on the radio hour from NPR Sunday at eleven AM on eighty nine nine W. J. C. T.\nSupport for NPR comes from NPR member stations and from Vincent St Petersburg Clearwater along Florida's Gulf Coast offering artistic draws including St Pete's Dali museum to truly collection\nOf the museum of fine arts more visit saint Pete Clearwater dot com\nCIA CIA is committed to helping those who are driven by purpose reach their definition of success\nInvesting advice banking retirement learn more AT T I Am a Dutch Oregon and the main office of tourism offering travelers an opportunity to explore and discover their very own main thing to be inspired be original and be yourself\nAt visit ... come\nFrom NPR WB easy Chicago there says wait wait don't tell me the NPR News quiz on bill Kurdish and heritage or hosted the chase bank auditorium in Chicago they say you", "show_name": "Wait Wait... Don't Tell Me! (Rebroadcast)", "year": "2018", "city": "Jacksonville", "day": "14"}