{"month": "10", "state": "FL", "station": "WJCT", "content": "And we have the Dalmatian one running for us and uh\nStopped turn and look as jet navigates all by itself making a small delivery from the ... cafe to room on the fifth floor\nBut first jet remotely calls for an elevator for a quick trip up this\nKaren able director of hotel operations for the ... joined said\nThat right now it's telling it getting out to let us know it's ready to lead the elevator and it's very\nPolite it says excuse me please those words ... on his friends screen we reached the room and it alerts the gas by an automated phone calls and then it makes its delivery\nAnd there it is and it says hello please remove your items [noise]\nAnd it says yeah and it's shaking back and forth thanks [noise]\nAnd then it says by embedding home [noise]\nJet the delivery robot is just one example of how\nAutomation is gaining traction in Las Vegas But Kevin Abel says don't worry a little jet doesn't portend the employment apocalypse just yet\nDo you envision this is more than sort of like an ... it's something that people like but you see it becoming something other than that\nIt's been really fun for the gas and fun for the employees on but it really isn't anything more than that it's a convenience but it\nIt's still needs to be handled by employees it's still needs an employee interaction on so it isn't going to be anything that can replace them but it is a fun interaction for our guest\nCliff Atkinson is senior vice president for hospitality at MGM resorts and the ... is part of the family of hotels while we were in Las Vegas he was in Japan for work so we got 'em on the phone\nFor us and we'd like to be innovative and we like to try new fun things\nBeyond the fun Atkinson says automation is helping transform the industry as guests demand more of a customized experience they're looking for options take for instance checking in the front desk is already changing\nI did is we eliminate front desk altogether that you're able to check in over your phone but the people that were at the front desk are still there are there to customize your journey there to greet you at the car and they're there to score you to your room to make sure you have everything you need you can't replace that and that engagement\nFor Atkinson technology is an opportunity to retrain employees goodbye front desk agent hello lobby ambassador but automation will apparently hit Las Vegas most in the spaces that we don't see that is according to the twenty Seventeen study by the aptly named Institute for spatial economic analysis\nAdministrative back offices restaurant kitchens jobs often done by people with low education levels jobs done mostly by women and people of color will be affected first we know we cannot stop the knowledge of the things I like to see it\nJoke on the way your client is secretary treasurer for the color union which represents about fifty seven thousand hospitality workers in Las Vegas the majority of them women and Hispanic\nThis year she helped negotiate a new contract between the union and many of the big casinos in Las Vegas included what they called ground breaking language\nFor workers whose jobs are going to be affected by new technology they'll get a chance to retrain\nNow they work at a so they have the opportunity to get the training to lead and then something new and the second time the work that they will say you know uh I don't want this this is not for me but I have a choice\nWhat you're saying is that for those who move on and decide not to accept the training they'll get severance pay and benefits for six months a key provision within this five year contract\nThe union gets a heads up of a hundred and eighty days before a new technology is implemented this is already happening in some hotels workers who chopped salad are being replaced by machines in some places right now we feel like I Would put it that this fire\nBut in this for years we'll have to put it better for the next way it is what's going to happen the struggle between men and machine is this\nOld as the dawn of the mechanized age remember\nMen used to race on horses against the steam train chess players of match their wits against computers\nAutomation has already changed the way we work for\nGenerations now but I still contend that are real bartender makes a better margarita\nInstead a test that theory I had to my final stop in Las\nTwenty three year old Martin of Maryland is selecting a drink a computer\nDrink ordered a big robotic arm a cocktail shaker for hand gets to work\nBottles hanging from the ceiling dispense exact amount to do then shake [noise]\nThe robot arm pours the concoction into a plastic ... [noise]\nDrinking from a robot all the time instead of a human [noise]\nProbably going to be a lot\nNot going to be as good as far as\nJust to let you\nBut Victor Reza ... general manager of the ... the robot says his bartending robot will mean more jobs not\nWe're not going more on what what we're hiring more\nIf there were popping up everywhere and hiring people and it's only been\nNature Morgan Chase\nBy robots kind of like it and\nYou talk some more about robots in the future of bartending and then it's time for my taste tests I order their signature drink\nAs I did nothing tops a margarita made by human bartender for now [noise]\n\n\nIs this weekend edition from NPR News I'm Luke ... thanks for listening\nSupport for NPR comes from the station and from the alliance for lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more I'd alliance for lifetime income dot org [noise]\nFrom the Jacob ... foundation supporting the health and wellbeing of underserved populations at ... dot org\nAnd from the John s and James Alan nice foundation helping NPR advanced journalistic excellence in the digital age\nKeep up with your favorite local teams with scores highlights an expert in elusive to do first goes can explore weekly segment with veteran sportscaster cold pepper\nFirst coast connect to sports wrap up Monday's in nine forty five on eighty nine nine W. J. C. G. F. bad [noise]\n\nHi I'm mayor Lenny Curry knowing your evacuation zone is critical for your safety any weather emergency\nVisiting public library to get your two thousand Eighteen hurricane preparedness guy\nStay informed with real time updates had jacks ready dot com or download the jak ready ab to also identify your specific zone and important information\nKeeps your radio one eighty nine nine the designated emergency broadcaster for northeast Florida\nOh hi I'm dean of them are joined me for taste tests tantalize your musical fences but the newest elections in urban pop culture have takes every Sunday night is that right here on eighty nine\nJustices eighty nine nine W. J. C. DSM Jacksonville providing news information and music ... Florida's palm coast to Georgia's gold and I'll listen on your computer or mobile device that W. J. C. C. dot norm [noise]\n[noise]\n\nRobbing the R. N. W. B. E. Z. Chicago is wait wait don't tell me\nThe NPR News's Glenn [noise]\nI'm Bill ... editor saying all this week the FBI beginning important\nNo holds barred inquiry that we're leaving no stone unturned away there done that was quick will ask about an FBI pro that caters to do they have short attention span is unbreakable Kimmy Schmidt star alec ever tried to survive being\nLocked in our bunker and don't Curtis warn the people of Orlando prior door I visited there next month\nWarm the neighbors were loud obnoxious drunks with prolific ... well I\nHave been coming on our goal is coming up right after\n\nAnd they also published videos on line for people who are more visually oriented and they published a shorter article would just highlights for people to short attention span and for the president himself it was just a a dollar sign next to a friendly face [laughter]\nHe's a self made man he always said that he they borrowed a million dollars from his father at one point and it made it back with interest paid back with interest where none of that turned out to be true none of it instead\nIt's like he was on some survival show where they challenge once you're dropped in the middle of New York city with a nice place to live in a million\nAnd yet he survive I mean [noise]\nAll right you're next quotes is from a letter that was written back in the early Nineteen eighty\nOne of the neighbors that were allowed obnoxious drunks with prolific ...\nThat was somebody being very honest back when he was in high school he may or may not be\nThat is honest now who is it that would be Brett Kavanaugh\nIts investigative report about Brett Kavanaugh's dissent or does this week and they did it without interviewing either judge Kavanaugh or Dr Ford but they did say they check ... [laughter]\nSeriously they wouldn't even know they put all this effort into the report because it started with the words Webster's defines us all [noise]\nThe ... like you know who knows who did what but from these strictly it weighs a job interview point of view on those hearings yeah you know I\nWorked at the top and\nWould do you know have you ever waitress before I had never going to have you have you\nAbout [noise] about the fact that these FBI hardly get reviewed anybody with all these people were saying please interview me see what happened of course last week a judge Kavanaugh at his hearing said he liked to beer and sometimes maybe had too many years back in high school but otherwise sober as a judge which he is not so whereas his friend mark judge who was totally blood out\nAll these stories started coming up the New York times found a letter Brett sent back in the day organizing this beach week you heard from that and he also got into a bar fight it yeah Yale after a you'll be forty concert\n[noise] so what are the details\nHe thought he thought like he I that bar with the lead singer and it seems like you're the lead singer of you've already or you're a man we just started like no I'm not like you are and he decided to throw his beer or his glass of ice in the guy's face you know the last one\nDied yeah [noise]\nI was back I had to come forward and be like I Want everybody to stop thinking that I Am the leaf\nLaughing at the other quarter not not not important\nIt's absolutely I mean there's no way that story of him throwing a beer or the guy in a bar can be true new way is Brett Kavanaugh gonna waste of beer\nSo they started licking the guys [laughter] I felt sorry sorry beer ... never do that again to beer [noise]\nVery uh speaking of drinks marry your last quote is a company's description of a brand new product and they just released this week the pumpkin\nSpice freedom I Am so to will in the student Lee become your favorites fold treat\nIt sounds delicious however this new pumpkin spice product is a watch or is it a phone not a phone although you're it's that could be I'll give you this pumpkin spice brought it to me by these sock any company that shoot it is a show yeah [laughter]\nWe talk and he released a pumpkin spice freedom I also do running shoe and a smart it running shoe is the only thing who said would be improved by pumpkins by [noise]\nJoined such products is pumpkin spice coffee pumpkin spice deodorant cookies drywall [noise]\nBucks originated this nightmare is referring to their signature pumpkin spiced latte is P. S. L. but you also when you speak pumpkin as a second language [laughter]\nI didn't know how that company's name was pronounced ... yeah I Would not you know I thought it was to Coney Coney yeah that's right I've been saying for years off how I feel like you know money or\nIs it in your at your in your ashtray like most of your actors about Salk growing up my act is about how do you say and I can't eat opening a [noise]\nWhat about ADD idea yes he does [noise] I think it might be a better runner real hot and very doing our quiz couldn't have done any better three ... three from Mary\n[noise]\nRight now pedal is time for you to answer some questions about this week's news Paula this week we learned about a new party trend hitting the scene in Los Angeles\nOh yeah I'm sure you know used to be good I don't know a magician to show up or maybe your car Daschle and now the must have guessed is what\nWhat how much have gas at a Hollywood Party or an insurance person\n[noise] that would be exciting yeah you know I'll give you a hand and they go to the parties and they're not really into it though they just say it's mad [noise]\nBring a shape close a go yes\nWe do that again would you do your vote again\nI already did my turkey for you I Know I Want you to go by and you don't have a whole like Fisher Price [noise]\nKind of a Jewish go one [noise] no no this is a goat mad no no this is a Jewish man [noise]\nCab and Howard [laughter]\nAlthough I think that they were going to Reuters in LA is party was tiny goats a company called party goes LA charges Ninety nine dollars an hour to have to quote Nigerian dwarf goats dress up in rural velvet suits showing up in your party\nLike just like you pay to watch people like abuse coats and said oh look at the go to go through here let's go to ... party you always had goats\nAnd that they are they are they hit you know he rents are [noise]\n\n\n[noise]\nComing out there ain't no party like a muscle is in her party go once you're buying wait wait to play we'll be back in them and it was more wait wait don't tell me from NPR\nNews I'm Stephen ... on the next freakonomics radio our hidden side of sports series continues with a look at how elite athletes are different to you and me I did a bunch of push ups and sit ups that night and so I was growing up and what if your goal is getting your kid into an elite university the answer I think\nIs you want your kid to be a Spencer next time I'm freakonomics radio\nSunday at one PM on eighty nine nine W. J. C. T.\nThe Proud Boys think feminism went too far and it's bad for men and women\nThe feminist mentality bodes very well for guys who just want to screw women and then dumped them when they become thirty five I think if women have their head screwed on properly they realize that it's your so called sexist who have their best interest in mind\nThe new male chauvinist next time onto the best of our knowledge from ... our ... Sunday at three PM on eighty nine nine W. J. C. T.\n\nSecretary John Kerry has a new book and in these times get out and vote\nNobody has a right to sit there and say well I don't have a stake in the snow we all have a stake in our democracy doesn't work by itself the only way to make it work just to put people back in office I Want to move the country in the right direction Speaker John Boehner every day is extra next time I'm living on her rump Yara\nSunday afternoon at four on eighty nine nine ... C. T.\n\nSupport for an NPR comes from NPR stations and Trader Joe's offering new products with every store a new episodes of the original ... series inside Trader Joe's but apple pie store where ... tests are available for a Trader Joe's dot com\nLumber liquidators offering flooring installation nationwide with new styles have hardwood and wouldn't look waterproof flooring\nMore lumber liquidators dot com or one eight hundred to two seven four oh three six and visit St Petersburg Clearwater along Florida's Gulf Coast offer a guard to stick draws including St Pete's Dali museum the truly collection\nAnd the museum of fine arts more at visit saint Pete\nClearwater dot com\nFrom NPR's it'd be easy Chicago the sous wait wait don't tell me the MPR news quiz I'm Bill Curtis were playing this week with Roxanne Roberts petered gross and Paula Poundstone and here again as your host the chase bank auditorium in downtown Chicago Peter say\nDon't care that she had no interest in becoming my friend and and I did realize that nature is you know ultimately indifferent to us\nHard lesson you learned early on\nBut Ellie may be this girl was just indifferent to you [laughter]\nYou know I think it was me\nWhat I think I think not only was it last name [laughter]\n\nLauren that now that you're famous those girls like yeah we were friends [laughter] what's\nInteresting about you is this true we were trying to pieces together were you in fact the debutante back in St Louis\nI and mortified that you were trying to take anything to get this is I'm living in nightmare right now yes I wasn't going to be done\nYou should know that if you don't want people to ask you embarrassing questions about your past you should probably not write a memoir\nToil loving that anytime and\nWBFO explained plays exactly for those who do people talk to squirrels\nDebbie conscious ideas bigger and I'm as I said I'm from St Louis and mid west I think it's bigger in the south and it's it's actually a good way to make this downtown it's where young women are introduced\nAnd aren't there special balls they wear dresses\nAnd wearing white dresses and white gloves young I'm only Eighteen when it happened or Nineteen don't yet know the whole thing is it's a spectacle maybe some people in the audience or debutante ... no no I don't\nThink [noise] ah\nSo you play you play Kenny on Kimmy Schmidt the brick what can be Smith show created by Tina Fey on Netflix and it seems as if that role was written for you is that is that correct\nI think that it was or I Know that it was which is a huge compliment I mean because yeah I think it was like on there I'm sure there were many people that they weren't you know considering running the show for and then I think this idea was their favorite idea though that\nWhen it when the ... can be made as a character who had a terrible\nUpbringing she was held in a bunker for many many years and then the show was all about how she deals with real life as she emerges it into an adult and she is absolutely a I guess unbreakable she never gets upset she never gets frustrated she's always incredibly cheerful no matter what happens to her and then that you is is that the kind of person you are well some\nSay that the Debbie ... was my bunker\nLike the um there's a little bit of me in that character but I found so corny but I had I have drawn strength from Comey is she is fear she she refuses to let out they circumstances dictate her own actions and I really think\nI have like a fraction of that may be on a good day so I I really do think she's um she's been through this unimaginable ordeal and he's still chooses to think about then people which I think it's remarkable\nYou're sounding credibly chipper yeah I mean your characters kind of chipper so what's the difference [laughter]\nYou sound votes mad and says ... [laughter] I think\nThat um I have a right now because I'm nervous and excited but uh yeah I I Would say they're probably a bit more heightened\nThe I I Do on a remembrance because we we had him on the show last week that the big reveal spoiler at the end of the first season that the evil man who kept you in prison was is played by Jon Hamm yes all areas and we found out she was actually your high school drama teacher\nI Know is that crazy if he was but he Louis um he's ten years older than I Am and he and he on ... and he graduated college and he came back to\nOur high school ... school to teach for a year and he taught me the improv theater class which is it's not\nAs you call him Mr ham on him Mr\n[laughter]\nEvery time I was there and it doesn't get the names flip\nA cliche but people are actors such as yourself who have been very successful playing truthful lovely people want to play darker characters a villain murderers that something you'd like to do\nI can be fun I mean it can be so careful doing that because I feel like it if people start to know you a certain way then it can be jarring to see you you know maybe that's what acting as\nYoung [laughter] yeah\nWell I only go up or we've invited you here to play a game but we're calling\nUnbreakable Kimmy Schmidt made the unbreakable Jimmy Smith\nAnswer do questions about the distinct Dr Jimmy Smith okay and you win a prize\nOne of our listeners the voice of their choice from anyone on the show Billy was only ...\n... and the Los Angeles California All right LA\nHere's your first question Jimmy Smith was in the bus goes infamous failed musical cop show cop rock but that's not his only musical role he also appeared in what hey if you can read his mind the Gordon Lightfoot musical\nThe Exorcist the musical\nForeseen mother goose a rap in in a rhyming special\nOn the yes\nQuestion about the unbreakable Jimmy Smith for a lot of young people Jimmy Smith is most well known for playing senator bail Oregon up and the recent spate of Star Wars movies how did he get the part a George Lucas has original choice showed up for the interview hung over\nBeef Smith just showed up in the setting costume and talk this way on or see the casting director owed him some money\nI'm very good at this game I think I demonstrated that don't and go with my gut and say hey\nYou're right again [noise]\nOf the Raleigh shut up a guy came down all hung over George Lucas didn't like Jimmy Smith got the part I Love that story okay alright your last bit of trivia about the unbreakable Jimmy Smith college football is Jimmy Smith is he a five day to be six three or see twelve feet tall [laughter]\nI think he's I think he's I mean he's six foot three\nHow did we kept for doing our show ... LA got 'em All right [laughter]\n\nPerson has written a genuinely delightful book called my squirrels days Eli ... thank you so much for joining us on wait wait don't tell me thank you so much for having [noise]\n\nJust a minute you're limerick a driver's going to get a five star rating Colin triple a way to join us on the air and we'll be back in them and it was more of wait wait don't tell me from NPR\nNext time on the world doing a few stretches 'cause it's a hog karma remembered boating hog this tourist is warming up to climb ... you might know it as Australia's airs rock\nThe landmark is sacred to aboriginal people and there were about to ban climbers from Iraq out of respect or do get that but I respect the rock is older than them to what ... means in Australia it's on the world weekday afternoon to three on eighty nine nine W. J. C. T.\n[noise]\nMember was Public Radio's pretty brutal\nNormal faster on your [noise]\nIt'll be a gym pack over and he'll be living\nThis recipe for the chicken mangoes Falla we're all is a great German so new on ... on your own\nAre\nSundays it's five eighty nine nine W.\nJ. C.\nHuman beings are made up of just four letter G G G ... the same for letters that every species McClellan has billions of letters of code if you had every page filled with ... g's and T's you'd have you'd hundred dictionaries versus the genetic code\nAnd that code decide who we are guy rise that story next time on the Ted radio hour from NPR Sunday at eleven AM on eighty nine nine W. J. C. T.\nSupport for NPR comes from NPR stations and PBS with those circus American Experience explores\nThe rise and fall of the big top edited influence on entertainment than the U.S the circus uh tonight event promoters October eight to nine eastern on PBS capital one committed to re imagining banking offerings savings and checking account that can be open for money where\nCapital one what's in your wallet capital one and they and the main office of tourism offer travelers an opportunity to explore and discover their very own main thing to me inspired the original and be yourself at ... dot com\nFrom and the R and nobody would be easy Chicago this is wait wait don't tell me the NPR News ... a bill Curtis were playing this week with Paula Poundstone rocks and Roberts and Peter Roche", "show_name": "Wait Wait... Don't Tell Me! (Rebroadcast)", "year": "2018", "city": "Jacksonville", "day": "07"}