{"month": "10", "state": "FL", "station": "WJCT", "content": "Now either Morgan is ready to move into her own spotlight her debut album borrowed heart tells your story and what it's like a lender words inexperience as somebody else she joins us now from Nashville thanks so much for being with us thank you so much for having me what made you say to yourself well I think I'm ready to sing the song\n[laughter] it was always a dream in the back of my mind I've always been able to sing and that it was just a matter of having something come along that told me it was time and I started writing was pretty soon ... to step into creating\nTo music just felt really connected to who I Am as an artist and so that was kind of a catalyst for this whole project what thing came along the ... they were actually a song that came along called leave that fire\nSome math dad in\nIndiana that you get me a check in when\nHeard this song it just felt like my first thought usually when I write is which artist might like this which which artist might that this song and trying to find a match for it and\nWhen we wrote we were if I Would say this is I think this one's mine\n\nNext story is that I found my personal experience and and I just had so much on a ship in it that it felt like the right thing to do would be to putting on their ... and the the one that\nPut out in the world and [noise] it's kind of felt like okay this is my stuff that I'm ready to share\n\nUm kindergarten included what's the first showing you wrote for yourself\n[laughter] it's called walk away because you know I think it has recorded on him embrace\nMy mom my mom used to play these really cool like sixties and seventies soundtrack whenever I was growing up and so it kind of had the ... that but it's\nWell good luck that at that do they just don't ever see it on his little well go away to the moon I just and then they get better I think it's\nThink goes on that's really nice [laughter] old ... ... I was about five or ... oh my gosh that's terrific that thanks for what you learn\nAbout yourself do you think when you write a song for yourself as opposed to given show\nI think there is a bit of\nThe year end zone ability that comes into play\nSeen still\nAnd also the strength that I've never felt\nBefore and\nIt's something really good to go into place it's really ... like emotion and telling my own story and and not sugar coating it like really China how it happened [noise]\nSome of the biggest names in country music or women [noise]\nBut is a lot of the country music role to Nashville still a boy's club\nI definitely an experience that um [noise]\nI feel like there's a lack of opportunity still in Nashville for women and that keeps changing that's part of the reason I mean there are two is just a day on my own show\nMy fellow like girls that are coming up after me\nThat you can do it on your own and uh but that's been my biggest I guess fight is just for opportunity it's not like a town and it's not black and willingness to work it's just being taught as an opportunity comes up and sometimes that's just being called to write with a male artist or for production events\nHeard about this um [noise]\nRuling the tour bus sometimes keeps women off\n... ... like if it's a male artists [noise]\nNo girl rule on the bus which I can respect to being a woman because they don't want their marital vows to be question right\nRight of course and\nGone into my publisher and said is there any way we can figure this out like\nMaybe I could write my own time actually can and I'll just follow the tour and all and that's not part of it\nAnd then of course a lot of creative work occurs on on tour bus you to\nBe and there's just because time's limited for artists to be when they're out on the road they have these three and four hour patches of time in between so I'm I'm hoping more of that can happen\nAnd even though I'm a girl scout there and still be able to work in that environment\n[noise] [noise]\nYes because it suggests that in many of the hit songs your Britain over the years for others\nTheir Berlin you're hurt or you're borrowing [noise]\nThe hurt with which they give voice\nUntil maybe it's a mutual borrowing [noise] um but yeah after writing for a bunch of people you know you sit in a room and you're\nListening and so many stories as I say you're digging into your own you can relate to where they're coming from or or where some ideas go in and say you are taken into your life experiences\nAnd you're offering that up and so part of your job is to like loan your pieces of your heart out every day in in the world of songwriting um she can be real Enron the owner of oil and and\nTake some stuff that you think the ... you can meet the other person I'm\nWhich which feels most authentic and the most genuine to the song and so um when I heard the title it was not only\nWhat the actual song mean but this other just bigger meaning after all these years of fighting for other people like wow this is a perfect title for this this project right now especially\n\nThe one oh\nHeather Morgan her new album\nThanks so much for being with us thank you for having me\n\nIt home and now\nThis weekend edition from NPR News I'm Scott Simon\nSupport for NPR comes from this station and from T. I. A. G. I. A. is committed to helping those who are driven by purpose reach their definition of success investing advice banking retirement learn more it T. I. A. dot org\nAnd from western hotels and resorts west and is committed to the wellbeing of travelers with offerings like heavenly beds as super food directs menu and gear lending for when workout years left behind at home west and let's rise learn more at western dot com\nAbove the museum of scientists just to be present an audio visual experience\nJoined us on October sixth and seventh for world renowned trio Russian special guest Jamie ... that they perform in the fry including planetarium custom animation and graphic\nCreative ... Williams junior and just have\nMore information checker found a curious dog or\nCurious music curious mind [noise]\nSample the incredible musical performances from first 'cause connect with studio fi sessions\nFeaturing the theory as hot as local bands theatrical performers and big name national acts coming through town [noise]\nWeather on your phone or at home be sure to check out a studio five session on the Web at W. J. C. T.\nHi I'm Tim driskell hosted the CPA on radio we bring you inside tips tricks and habits from the city's leading artists influences pacemakers an entrepreneur Saturday that eleven PM right here on eighty nine nine W. J. C. T.\n\nSays eighty nine nine W. J. C. D. FM Jacksonville providing news information music for Florida's palm coast to George is gold and I'll listen on your computer or mobile device the W. J. C. C. [noise]\n[noise]\n\nRobyn VR and that would be easy Chicago's as soon as wait wait don't tell me\nThe MPR news when\nI'm ... and I did or said this week the FBI began and important\nNo holds barred inquiry that we're leaving no stone unturned away their dog that was quick will ask about an FBI proved that caters to today short attention span is unbreakable Kimmy Schmidt star alec ever\nTry to survive being locked in our bunker and don't Curtis warn the people of Orlando prior door I visit there next month\nWarm the neighbors were loud obnoxious drunks with ... ... well I\nThink coming on our goal is coming up right after\nStories fourteen thousand words and and so if you bought the physical papers like four full spreads in the middle of the paper it's incredible fires the centerfold New York [laughter]\n\nAnd they also published videos on line for people who are more visually oriented and they published a shorter article was just highlights from people to short attention span and for the president himself it was just a a dollar sign next door frowning face [laughter]\n\nHe's a self made man he always said that he ... he bought a million dollars from his father at one point in his head back with interest paid it back with interest where none of that turned out to be true none of it instead it's like he was some survival show where they challenge\nOnce you're dropped in the middle of New York city with a nice place to live in the millions and millions\nAnd yet he survive I used to take\nOff your next quotes is from a letter that was written back in the early Nineteen eighty\nOne of the neighbors that were allowed obnoxious drunks with prolific ...\nThat was somebody being very honest back when he was in high school he may or may not be just as honest now\nWho is it that would be Brett Kavanaugh\nIts investigative report about Brett Kavanaugh at the center does this week and they did it without interviewing either judge Kavanaugh or Dr Ford but they did say they check ... [noise] seriously they wouldn't even know they put all this effort into the report because it started with the words Webster's defines as\n[noise]\nThe ... like you know who knows who did what but from these strictly it weighs a job interview point of view on those hearings yeah you know I\nWorked at the top and\nWould do you know have you ever waitress before I had never going to have you have you with\nAbout [noise] about the fact that these FBI hardly interviewed anybody was all these people were saying please interview me see what happened of course last week\nA judge Kavanaugh at his hearing said he liked fear and sometimes maybe had too many years back in high school but otherwise\nSober as a judge which he is not sober as this friend mark judge who was totally blood out all these stories started coming up the New York times found a letter Brett sent back in the day organizing this beach week you heard from that and he also got into a bar fight ... after a you'd be forty concert\n[noise] so what are the details\nHe thought he may not like he I that bar was the lead singer and it's like you're the lead singer of you've already hr managers ... he's like no I'm not I guess you are and he decided to throw his beer or his glass of ice in the guy's face you know\nThe last one died yeah [laughter]\nI walked back I had to come forward and be like I Want everybody to stop thinking that I Am the\nLeaves are having a quarter or not it's not important\nIt's absolutely I mean there's no way that story of him throwing a beer or the guy in a bar can be true new way is Brett Kavanaugh going to waste a beer\nFridge when they started looking guys [laughter] sorry sorry beer she'll start on never do that again to beer [noise]\nVery uh speaking of drinks marry your last quote is a company's description of a brand new product and they just released this week\nThe pumpkin spice freedom I Am so to will and list is lea become your favorites fold treat\nIt sounds delicious however this new pumpkin spice product is a watch or is it a phone not a phone although you're just there could be I'll get a hit and miss pumpkin spiced products made by these sock any company a shoe in show yeah [laughter]\nWe talk and he released a pumpkin spice freedom I also do running shoe and a smart it running shoe is the only thing who said would be improved by pumpkins by [noise]\nJoin such products is pumpkin spice coffee pumpkin spiced deodorant cookies drywall [noise]\nWho originated this nightmare is referring to their signature pumpkin spiced latte is P. S. L. but you also is when you speak pumpkin as a second language [laughter]\nI didn't know how that company's name was pronounced ... yeah I I thought it was to Coney Coney yeah that's right I've been saying for years\nOff how I feel like you know money or is it in your at your in your ashtray like most of your ... your basic owning my act is about how do you say and I can't eat like opening a [noise]\nWhat about ADD idea yes he does [noise] I think it might be a shoo supposed to walk around or feel how to marry doing our quiz couldn't have done any better three ... three primary\n[noise]\nRight now pedal is time for you to answer some questions about this week's news Paula this week we learned about a new party trend hitting the scene in Los Angeles\nOh yeah I'm sure you know [noise] used to be good I don't know a magician to show up or maybe your car Daschle and now the must have gas is what\nHow much have gas at a Hollywood Party or an insurance person [noise]\nThat would be exciting yeah you know I'll give you a hint they go to the party is is that aren't really into it though they just say it's mad [noise]\nBring a cheap clothes go yes we do that again would you do your vote again\nI already did my turkey for you I Know I Want you to go to Andrew I don't have a whole like Fisher Price [noise]\nKind of a Jewish go one [noise] no no this is a goat mad [noise] no no this is a Jewish go man [noise]\nAnd Howard [laughter] I don't\nThe odd thing to do with voting to Reuters in LA is party was tiny goats a company called party goes LA charges Ninety nine dollars an hour to have to quote Nigerian dwarf goats dress up and purple velvet suits showing up in your party\nJust like you pay to watch people like abuse go looking to go to go through your let's go to leaders house for a party he always has goats\nAnd that they are they are they hit ... no no he writes them [noise]\n\n\n[noise]\nComing out there ain't no party like a muscle listener party go well if you're buying wait wait to play we'll be back in I'm In it was more wait wait don't tell me from NPR\nBrett Kavanaugh Supreme Court confirmation fight has exposed a divided Senate nation in conflict\nIt's like we have turned against each other brother against rather just are going to the streets\nWill track how the Senate votes line up and\nWe'll talk to radio calling hosts from around the country to find out what their listeners are telling them about the court drama that next time on all things considered from NPR News Saturday at ... pm on eighty nine nine W. J. C. T.\n[noise] what's the name big U G G what they would not that\nBig a deal with the Y. veteran prisoner expert in the law and this is my ... right yeah mine wall room\nA lifer takes on a prosecutor on the next reveal Saturday at three PM on eighty nine nine W. J. T. T.\nHuman beings are made up of just four letter G G ... the same for letters that every species McClellan has billions of letters of code if you had every page filled with ... g's and T's you'd have you'd hundred dictionaries worth of genetic code\nAnd that code decides who we are guy rise that story next time on the Ted radio hour from NPR Sunday at eleven AM on eighty nine nine W. J. C. T.\nSupport for an NPR comes from NPR stations and Trader Joe's offering new products with every store a new episodes of the original ... series in the side Trader Joe's\nApple pie store where ... tests are available for a Trader Joe's dot com\nLumber liquidators offering flooring installation nationwide with new style shovel hard would and wouldn't look waterproof flooring more lumber liquidators dot com or one eight hundred to two seven four oh three six\nAnd visit St Petersburg Clearwater along Florida's Gulf Coast offer a guard to stick draws including St Pete's Dali museum but truly collection and the museum of fine arts more at visit St ...\nClearwater dot com\nFrom NPR nobody be easy Chicago the sous wait wait don't tell me the MPR news quiz I'm Bill Curtis were playing this week with Roxanne Roberts petered gross and Paula Poundstone and here again is your host the ... bank auditorium in downtown Chicago Peter [laughter]\nI really\nDon't care that she had no interest in becoming my friend and and I did realize that nature is you know ultimately indifferent to us\nHard lessons learned early on but maybe this girl was just in different to you [laughter]\nYou know what do you think it was me I don't\nWhat I think I think now what is it to last name\n[laughter] [noise]\nLaurie now that you're famous those girls like yeah we were friends [laughter] what's interesting about\nYou is this true we were trying to pieces together were you in fact the W. tones back in St Louis\nI and mortified that you were trying to get anything to get this is I'm living in nightmare right now yes\nI wasn't that these are you\nYou should know that if you don't want people to ask you embarrassing questions about your past you should probably not write a memoir\nSoil loving that anytime and\nThe deputy explained plays exactly for those who do people talk to squirrels\nWu Tang to side is bigger and I'm as I said I'm from St Louis the mid west I think it's bigger in the south and it's it's actually a good way to make this downtown it's where young women are introduced\nAnd aren't there special balls they wear dresses\nAnd wear dresses and white gloves young I'm only Eighteen when it happened or Nineteen don't yet know the whole thing is it's a spectacle me some people in the audience or debutante ... no no I don't think\n[noise] ah\nSo you play you play Kenny on Kimmy Schmidt the unbreakable Kimmy Schmidt show created by Tina Fey on Netflix and it seems as if that role was written for you is that is that correct\nI think that it was or I Know that it was which is a huge compliment I mean because yeah I think it was like on there I'm sure there\nWere many um people that they weren't you know considering writing that show for and then I think this idea was their favorite I get so bad\nWhen it when the ... can be Schmidt is a character who had a terrible\nUpbringing she was held in a bunker for many many years and then the show was all about how she deals with real life is she emerges it into an adult and she is absolutely a I guess unbreakable she never gets upset you never gets frustrated she's always incredibly cheerful no matter what happens to her and then that you are that's the kind of person you are\nWell some say that the Debbie ... was my bunker\nThere is like the on and there's a little bit of me in that character but I was on so corny but I had I have drawn strength from Comey is she is fear she would she refuses to let out they circumstances dictate her own actions and I really think\nI have like a fraction of that may be on a good day so I I really do think she's um she's been through this unimaginable or guilt and he's still chooses to think about them people which I think it's remarkable\nYou sound incredibly chipper yes I mean your characters kind of chipper so what's the difference [laughter]\nYou sound votes mad and says ... [laughter] I\nThink that um I have a right now because I I ... and excited but uh yeah I I Would say they're probably a bit more heightened\nThe I I Do on a remembrance because we we had him on the show last week that the big reveal spoiler the under the first season the the evil man who kept you in prison was as played by Jon Hamm yes all areas and we found that he was actually your high school drama teacher\nI Know is that crazy he was the heat Louis um he's ten years older than I Am and he and he on ... and he graduated from college and he\nCame back to our high school ... school to teach for a year and he taught me the improv theater class which is it's not\nAs you call him Mr ham on him Mr\n[laughter]\nEvery time I was there and it does get the names flip\nA cliche but people are actors such as yourself who have been very successful playing truthful lovely people want to play darker characters a villain murderers that something you'd like to do\nI could be fun I mean it can be so careful doing that because I feel like the ... if people start to know you a certain way then it can be jarring to see you you know maybe that's what acting as young [laughter]\n\nYeah well I only go up or we've invited you here to play a game we're calling\nUnbreakable Kimmy Schmidt made the unbreakable Jimmy Smith\nAnswer do questions about the distinct Dr Jimmy Smith okay then you went abroad as\nOne of our listeners the voice of their choice from anyone on the show building was Eli ... course\nPatrick ... and the Los Angeles California All right LA\nHere's your first question Jimmy Smith was the boss goes infamous failed musical cop show cop rock but that's not his only musical role he also appeared in what hey if you can read his mind the Gordon Lightfoot musical\nThe Exorcist the musical\nForesee mother goose a rap in in a rhyming special\nOn the yes\nQuestion about the unbreakable Jimmy Smith for a lot of young people Jimmy Smith is most well known for playing senator bail Oregon and the recent spate of Star Wars movies how did he get the part a George Lucas has original choice showed up for the interview hung over\nBeef Mitch just showed up in the setting costume and talk this way on or see the casting director award him some money\nI'm very good at this game I think I've demonstrated that don't lend goes my gut and say hey you're right again\nThe Raleigh shut up a guy came down all hung over George Lucas didn't like Jimmy Smith got the part I Love that story\nOkay All right your last bit of trivia about the unbreakable Jimmy Smith called small is Jimmy Smith is he a five day to be six three or sees twelve feet tall [laughter]\nI think he's I think he's I mean he's six foot three\nLA got 'em All right\n[laughter] [noise]\nPerson has written a genuinely delightful book called my squirrel days only ... thank you so much for joining us on wait wait don't tell me thank you so much for having\n\nJust a minute you're limerick a driver's going to get a five star rating Colin triple a way to joined us on the air and we'll be back at them and it was more of wait wait don't tell me from NPR\nThis is Ira Glass of this American Life end up coming to Jacksonville even talk that costs seven things I've learned basically just an excuse to tell a bunch of stories like Clint videos talk about how we make a radio show to talk about stuff we have not been on the air and never will put in the air\nAnd just play stuff that you might get will be fun to play for a crowd Saturday November ten ... theater budget by community first credit union\n... dot com\nOr the theater and on\nThis American Life our producers chase was following Senator Jeff flake during the days before the recent cabinet hearing the day of the hearing and after she had said that you have not heard elsewhere one point she was backstage at the center to remember there was straight out of\nGood fellows but one of the actual cast members from good solid strongly encourage tentative plan to vote a certain way on the nomination\nAnyway that this week Saturday at one PM on eighty nine nine W. J. C. T.\nNext time on ask me other we've got comedian Tom Arnold star of the new show the hunt for the Trump take plus singer songwriter Jill so we'll put born with their very own Jonathan Gold in any music parity game about artists who go\nOne name so joined me over the euro for NPR's our puzzles where again Andrea via Saturday at eleven AM on eighty nine\nNine W. J. C. T. [noise]\nSupport for NPR comes from NPR stations and PBS with those circus American Experience explores the rise and fall of the big top editor influence on entertainment than the U.S the circus uh tonight it premieres October late that night in eastern on PBS\nCapital one committed to re imagining banking offering the savings and checking account that can be open for money where\nCapital one what's in your wallet capital one and they\nAnd the main office of tourism offer travelers an opportunity to explore and discover their very own main thing to be inspired the original and be yourself a visit ... dot com\nFrom NPR and nobody would be easy Chicago though says wait wait don't tell me the NPR News I'm Bill Curtis were playing this week with Paula Poundstone rocks and Robertson Peter Roche", "show_name": "Wait Wait... Don't Tell Me! (Rebroadcast)", "year": "2018", "city": "Jacksonville", "day": "06"}