{"year": "2018", "show_name": "91.5 KRCC Late Night Music Mix", "month": "10", "content": "\nYo\nGrow up in the friday evening music mix with a grizzly bear and this song listen in weight\nIn this critical election year you can count on Ninety One point five K. R. C. C. to bring you the information you need from NPR to the Ninety One point five K. R. C. C. newsroom we have the best journalists bringing you intelligent insightful reporting to help you understand the issues and the candidates\nBut quality cost money as a nonprofit media organization we look directly to you to help pay the cost of our services become a part of the team contribute at K. R. C. C. dot org today thank you\nThis is southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs K. E. C. C. the ... case CCS ... K W CCF him looking him park streaming at K. R. C. C. dot org\n\nLive from NPR News in Washington I'm ...\nSaudi Arabia state news agency said late friday but missing writer ... ... was killed in the Saudi constant ... supposedly after a fight broke out Eighteen people are under arrest including to advisors to the Saudi crown prince\nAs Peter Kenyon reports from Istanbul it's a sharp turn about for the Saudis or earlier claim the Washington Post columnist left their embassy and that his whereabouts were unknown\nAnd we have seen these investigation move forward poking more and more potential holes in that story and making it look less and less tenable and now a very late at night the Saudis have come up with an official statement admitting yes she did we have these people\nAnd less tenable and now a very late at night the Saudis have come out with an official statement admitting yes he's dead we have these people under arrest and we'll just have to see where it\nGoes from here Peter Kenyon reporting President Trump says he believes the Saudi explanation but some us lawmakers are skeptical us attorney general Jeff Sessions spoken Chicago friday he says he's opposed to federal oversight of the city's police department for member station WBFO easy Shannon Heffernan reports\nUnder the Obama administration the U.S department of justice released a report on Chicago policing it's abuse and bias and recommended federal court oversight Chicago police\nChicago eventually agreed that now under the Trump Administration the Justice Department says that's a bad idea speaking in Chicago sessions says police can't be micromanage\nChicago police are not the from Chicago police or the solution to the from\nThe American civil liberties union of Illinois critique Sessions' remarks and said he creates the incorrect impression that the only answer to crime it's unconstitutional practices by police for NPR News I'm Shannon Heffernan in Chicago\nAlaska Governor Bill Walker of the nation's only independent governor ended his reelection campaign friday from member station ... T O O Andrew kitchen than reports Walker shocked\nThe audience at the convention of the largest Alaska Native organization the Alaska federation of natives effective today\nBy a suspended campaign [noise]\nFor the ... election as governor\nWalker through his support to democratic former U.S Senator Mark baggage Walker expressed concern that the Republican candidate former state senator Mike Dunn lady\nCould reverse the state's Medicaid expansion ... has been leading in polls the decision comes days after walkers lieutenant governor Byron mullah resigned over ... Walker says was a quote inappropriate overture and quote to an unnamed female for NPR News I'm Andrew kitchen minute in Juneau\nAnother ... on Wall street friday the S. and P. five hundred last one point the Dow Jones industrial average was sixty four points higher but as the composite say thirty six points you're listening to NPR News in Washington\nAfter a successful launch friday night the European space agency mission is on its way to mercury as NPR's Joe Palca reports it's supposed to begin or but\nAfter a successful launch friday night the European space agency mission is on its way to mercury as NPR's Joe Palca reports it's supposed to begin orbiting the innermost planet of our solar system in twenty twenty five\nThe mission is called ... Colombo named for the Italian mathematician and an engineer just set the Colombo who went by the nickname Pepe their mission consists of two probes one flies relatively close to mercury the other supplied by the Japanese space agency it's further out it will measure Mercury's magnetic field\nIn order to get into the right orientation to go into orbit around mercury that'd be Colombo will need gravity assist from planet along the way it will get one from earth to from Venus and six from mercury itself\nIs successful ... Colombo will only be the third space mission to study mercury up close Joe Palca NPR News\nThe what's ... messaging service says it has sent a cease and desist letters to stop companies from sending bolt messages related to Brazil's election\nThe move comes after a report that businessmen work bankrolling a campaign to spread fake news and supportive leading far right presidential candidate ... the company also reveal a noted band hundreds of thousands of account since August when the election campaign officially got underway and Brazil\nThe mega millions numbers that could win an estimated ... billion dollar jackpot have been announced they are Fifteen twenty three fifty three sixty five Seventy ... seven officials say if there isn't a winter\nThe prize for Tuesday nights drawing would be one point six billion dollars I'm Jim ... NPR News in Washington\nSupport for NPR comes from NPR stations or their contributors include the Charles Stuart my foundation for more than Ninety years supporting efforts to promote adjust equitable and sustainable society more at ... dot org and the corporation for public broadcasting\nAnd this is southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs K. E. C. C. law hunter Casey see us start filling K W C. C. F. them woodland park\n\n\nEvery\n\n\nAnd\nNa\n... her\nThen [noise]\n\n\nThat's new music by the Toronto ban dilly dally their second album just came out it's called heaven and they're playing next friday at the gothic theater with fiddler they're opening for fiddler next friday\nAnd we have police saw off the union ... United crushers album and they're currently touring Europe\nA group called pits the Cato five Japanese duo with their album the sound of music released in America on ... door records\nAnd monsoon starting up are set ever so lonely a global world music dance it back in Nineteen eighty two and coming up we have the black lips\nNewest shouting ties we take a closer look here's the kingdom faces scrutiny over the alleged murder of ... Buss credited Trump pitch the campaign trail and us merged narration\nFor higher the N. word definitely works in this case they were former soldiers hired to do military operations combat targeted killings and for the military of a foreign power Saturday on weekend edition from NPR News [noise] Saturday morning in Ninety One point five to your cc\nMm\nI'm ... and you're listening to Ninety One point ... or ...\nChris here are the live local shows for tomorrow the tae home street corner thieves that jak wins red moon round or play kin folks seal eggs and honor counsel at the triple nickel tavern\nDouble your ... drowning pool dirty kings endless line and fall from silence all at sunshine studios the who do plays the perks downtown\nThe riders ... roadhouse distant thunder at Denny's bullet breed at back east up and monument\nAnd the big national concert is the u._k. subs Agent Orange got her mouth and the nobody's at the black sheep and for something a little bit different the hunted\nSir is the u._k. subs Agent Orange got her mouth and the nobody's at the black sheep and for something a little bit different the heart of Bruce fast at the Norris pot roast center the pikes peak derby day games do the city auditorium\nThe cool size best and many makers spare at library Twenty one see and the peaks and tasty Halloween burlesque show at the zodiac\nHere are the black lips off their album two hundred million dollars and and they're doing the bluebird theater in two weeks oh\nMy God you\nNa na na\n\n\n\n[noise]\n\n\n\n\n\nNah\n\n... he\nHe\nHe\nIs\nShe\nShe\nYeah and then\nAnd then and then when I\nWas on\nAnd\nSomething\n\nA\nAnd I know and and it was\nAnd a\nA man and a day\n\nAnd age\n[noise]\nI was born in ... Illinois I'm not\nTeacher and we all my children and order as much as to [noise]\n\n[noise]\n[noise] [noise] [noise]\n\n\n\n\n\n\n\nGoing back to Nineteen Seventy one and the third or fourth album by the MC five entitle high time\nAnd the name of that song is poison it is amazing how many modern bands that we play in fact we won't mention their names but they sound just like that MC five socks\nAnyways MC fifty featuring Wayne Kramer are performing tomorrow at the gothic theater up in Denver and before that a real bond called the Bobby tease\nRock and roll show is the name of the stock and we know who are they ripped off button that sucks and that came up there all the best of living and rock and roll the Bobby genes from San Francisco and we also had asked a dad a new ban\nWith their debut album and the song Mr major they're playing the last like lounge November seventh\nAnd teenage fan club will be celebrating their thirtieth anniversary coming to America in the springtime for like their first American Tour in a quarter century\nAnd the black lips who'll be at the bluebird theater in two weeks and we're going to have new music\nBy ... up and cloud nothing's and metric coming up next\nUnderstanding U.S Mexico border landers subject matter for a lecture November seventh when we were just choose him more formation on this end of the public service announcements on the community calendar link the or the seat origin and everybody\nThat this ... this is crystal ... routine for Ninety One point five ... or see the music ...\nThis is where the cost of this is Chris hello this is Michael French will spread between the Ninety One point five K. R. T. the music therapy and made Ninety seven Ninety two we\nWere really happy to have some excellent new music to play for you by the cloud nothing's too who are in Denver a November eleventh\nAnd metric who will be here in the spring and here is the new double CD by ... it's called doce your dreams and it's one of the best records of the year we're going to hear a song called came do wrong with just both goals by J Mak get\n\n\nThat is a new band from Melbourne, Australia called death wish\nAnd their recent release on sub pop records is entitled lithium dry a death wish and before death wish was white lung and the song hungry up there spectacular album paradise\nAnd metric who have really\nNailed their new album the art of doubt the song was dark Saturday and they are coming here in the springtime and we also had cloud nothing's with possibly their best album yet\nIt just came out it's called last building burning they're playing the bluebird theater on November eleventh\nAnd the terrific double CD by ...\nEntitled dose your dreams and the song we heard was came down wrong with Jennifer Castle and Jay mask us on the vocals hope you enjoyed that said\nThis is southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs K. E. C. C. law hunter Casey cs dark bill and K W cc FM\nWoodland park I wet records shopping today looking for Halloween records and I found\nThis particular compilation called punk rock Halloween loud fast and scary it features the u._k. sub sue are playing tomorrow over at the black sheep and check out\nThe incredible lyrics on this song I walked with his um be\n[noise]\n\n\n\n\n\nDa da da da da da\nDa da da da na na na na hey hey man in\nThe same time [noise] and ...\nAnd [noise] and\nIt's a town wide open and the ... and ...\nSays I'm a law that set off the map [laughter] no I'm I'm a man alive now I'm\nLa la\nI'm Down in the city and in a while I was like a dollar airliner is I'm\nThat are saying that a lot on the line with him and all that and then and then you know [laughter] [noise]\n\n\n[laughter] ... [laughter]\nWhy [laughter] while I'm [laughter]\n[laughter] wow [laughter] wow [laughter] wow [laughter] um [laughter] so\nI sat at all [laughter] um [laughter] I Am a\n... ... ... well\n...\nThe yard\nFree trip around\nHave\nRole\n\n\n\n\n[noise]\n[noise] [noise]\nNice to have a [noise]\n\nBig written\nBy my mom and dad they ever now armed\n[laughter] no\nMatter how bad\n\nI\n[noise]\n\n[laughter]\n... na na na\nNa na\nNa\nNa well\n\n\n\nAnd there you have strong out off their album suburban wasteland teenage blues the name of the dog right now apple and they're at the gothic theater on Monday\nEnding up an entire set of bands coming in the next seven days a lot of action going on here before strung out we heard the jammed and the black ... competing gig is against each other on Thursday\nFiddler who are going to be at the gothic theater next friday with dilly dally during the title track to the new wave the the\nOr who are going to be at the gothic theater next friday with dilly dally during the title track to the new wave CD and UK Subs got her mouth an Agent Orange starting up are set there tomorrow at the black sheep\nAh UK Subs with I walked with his army starting up that said\nFrom the punk rock Halloween CD a ... a patch or records are going to hear more of that next week got her mouth to go stay an Agent Orange living in darkness we're going to be right back with the men zingers and the Death Valley girls [noise]\nThe midterm elections are coming soon the results could influence the nation for the next decade stakes are high end NPR and all things considered are covering national trend\nWe won't just tell you who wins will tell you why it matters listen to all things considered to hear the bigger picture every afternoon from NPR News [noise]\nAfternoons or three thirty on Ninety One point five your see see\nWe've got a new band called blank side of Phoenix who are going to be preparing their new single at our next set and we're going to kick it off with the men's singers and the Death Valley girls ... ballot girls at the Larimer lounge November seven years loves spell [noise]\n\nIn\n[noise]\n\n\n\n\n\nAnd [noise]\nSo\nAnd\n\nI'm\n\nOh wait a minute wait a minute\nOnly a major you usually have a meeting in a way\n[noise]\n\nAny any any any\nA nation\nAnd there you have ministry millennial ministry\nFor um the early aughts and we heard waiting from the album houses of the Malay and they are going to be at the Fillmore auditorium on November twenty board we also had the Bronx than their their debut album back in two thousand and three\nAnd they're playing the stomach Music Hall on November seventh with the right and blank a new single by this new band out of being excited just want a lab and we started off with the men's zingers who are coming Saturday November ...\nOff the album Chamberlain weight and\nAnd we started off with the men's zingers who are coming Saturday November ...\nOff the album Chamberlain weights and Death Valley girls November seventh at the Larimer lounge thanks a lot for listening on the leave you with DJ Dimitri and the art of shrimp and take care of everyone\n[laughter]\nAnd\n[noise] [noise] [laughter]\n\n\n\nBe\nOn the Internet\nNever been in the past six to pass\nThe\nFor\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEat here oh\n\n\n", "city": "Colorado Springs", "day": "20", "state": "CO", "station": "KRCC"}