{"year": "2018", "show_name": "91.5 KRCC Late Night Music Mix", "city": "Colorado Springs", "content": "... things up with the real near a and that is from a new new or excuse me a new record by them ... to go\nNicotine is after that from a long engagement modine the last day featuring scholars gray on vocals and fading out in the background [noise]\nMatthew Herbert also known as Herbert featuring Danny Sicilian oh the audience from bodily function [noise]\nSupport for Ninety One point five K. R. C. C. comes from our listeners and from local organizations who wants to reach a discerning audience that values quality\nMarketing on Ninety One point five K. R. C. C. underwriters reached the people most likely to shop and their business to\nSupport their nonprofit and buy tickets to their shows [noise] to learn more about corporate support called Jeanette seven one nine four seven or eight year old why\nDoes his southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs K. E. C. C. the hunter K. C. C. S. debt ceiling K W C. C. F. and wasn't um\nPark streaming K. R. C. C. dot org\nLive from NPR News Washington not joy ... hurricane Michael is getting stronger the latest word from the national Hurricane Center in Miami puts Michael's top winds at one hundred twenty five miles per hour store but still a category three hurricane but forecasters expect Michael ...\nThe chaos he the HD Colorado Springs K. E. C. C. K. K. C. the F ... the the S. and living in park streaming can see the dark\nLive from NPR News in Washington on trials Snyder\nHurricane Michael is getting stronger or the latest word from the national Hurricane Center in Miami puts Michael's top winds at one hundred twenty five miles per hour\nStorm is still a category three hurricane but forecasters expect Michael to wrap up to a major category for storm before it makes landfall tomorrow along Florida's Gulf Coast\nGuile gas it of Troy public radio reports on the preparations that people in the past the storm are being advised to make\nThe national weather service in Tallahassee is warning residents in Florida's panhandle and those in southern Alabama and Georgia that hurricane Michael we'll pose an extreme wind threat when it comes to shore although the areas of highest concern are largely along Florida's Gulf Coast\nThe possibility of catastrophic storms and flooding in Alabama punted governor Kay Ivey to issue a state of emergency on Monday\nSome of the storm preparations that officials are recommending include filling up the cars gas tank securing any medications and packing clean clothes and portable chargers for cell phones for NPR News I'm Kyle gas it in Troy, Alabama\nUnited Nations ambassador Nikki Haley is stepping down\nThen and honor and all I Know I said I Am\nLeave gay and burn\nRarely made her announcement that she will step down at the end of the year at the White House Tuesday alongside President Trump many did not see Haley's announcement coming or fellow ambassadors at the un reacting with surprise\nPresident Trump says there are five people on his short list including former White House advisor Dina Powell President Trump toyed with the idea of naming his daughter Ivanka to Haley's suppose but acknowledged that he will be accused of nepotism\nPresident Trump hoping to capitalize on the confirmation of his new Supreme Court nominee to energize Republicans in the upcoming midterm elections he appeared in Iowa earlier tonight\nAnd NPR's Scott Horsley reports Trump is highlighting the fight over justice Brett Kavanaugh in a series of campaign rallies around the country this week\nAs justice Kavanaugh gets down to work on the court promising to be a good team player presidents\nFormer White House advisor Dina Powell President Trump toyed with the idea of naming his daughter evil uncle to Haley's suppose but acknowledge that he will be accused of nepotism\nPresident Trump hoping to capitalize on the confirmation of his new Supreme Court nominee to energize Republicans in the upcoming midterm elections he appeared in Iowa earlier tonight\nAnd NPR's Scott Horsley reports Trump is highlighting the fight over justice Brett Kavanaugh in a series of campaign rallies around the country this week\nAs justice Kavanaugh gets down to work on the court promising to be a good team player President Trump is fanning the partisan flames at a campaign rally in Iowa Trump thanked home state Senator Chuck Grassley and his fellow Republicans for helping to see his second Supreme Court pick\nJustice alongside of justice Gorsuch\n\nThe bitter confirmation battle over Kavanaugh has the potential to drive turnout on both sides Trump is cheering on his supporters this week with additional rallies in Pennsylvania Ohio and Kentucky\nScott Horsley NPR News Washington and you're listening to NPR News\nThe Boston Red Sox are going to the American league championship series bones to beat the New York Yankees tonight winning the division series\nAnd the right to play the Houston Astros for the American league pennant the first African American football player drafted into the NFL has died Georgetown pharaoh was drafted by the Chicago Bears in Nineteen forty nine he died late Monday at the age of Ninety One as NPR's Tom Goldman reports\nGeorge tell a pharaoh was a star running back for Indiana University in the Nineteen forties Chicago took tele pharaoh in the Nineteen forty nine draft\nBut he'd already agreed to play in the rival all America football conference after that he played six years in the NFL in was named the pro bowl three times\nTele Ferris said that the need like most about football was hitting people because it let them vent his frustration about discrimination he told the Indy star than in Nineteen forty seven he went to a segregated movie theater in Bloomington\nAnd took down the colored sign in the balcony\nAnd I took a screwdriver with me and to this side and put it in my pocket and I've hated it\nBeyond football tele pharaoh taught and worked in the administration at several universities Tom Goldman NPR News\nCrews and west Texas still searching for for people who remain missing after flooding their authorities say ...\nTell a Ferris said the thing is like most about football was hitting people because it let them vent his frustration about discrimination he told the Indy star than in Nineteen forty seven he went to a segregated movie theater in Bloomington and took down the colored sign in the balcony\nAnd I took a screwdriver with me and to this guy and put it in my pocket and I've had a ... threat\nBeyond football tell a pharaoh taught and worked in administration at several universities Tom Goldman NPR News\nCrews and west Texas still searching for for people who remain missing after flooding there already say swift water boats are patrolling a thirty five mile stretch of the south down a river which we had rising Sunday night because of more than a foot of rain that fell early Monday the floodwaters over in recreational vehicle park\nAsian share steady after us financial markets into Tuesday trading nearly where they began the Dow closed down fifty six points this is NPR News\nSupport for NPR comes from NPR stations other contributors include the joys foundation committed to advancing racial equity and economic mobility for the next generation and the great lakes region learn more at Joyce ... dot org and the ... foundation\nThis the southern Colorado's NPR station K. R. C. C. care C. C. H. D. Colorado Springs Casey Ceylon decay CCS dark cell and K W C. C. F. M. woodland park\nStreaming at K. R. C. C. dot O. R. G. last few minutes after ten o'clock and It's Tuesday and it's your late night music next Tuesday edition\nYou're hanging with Dr ... music master usually here on Tuesdays very pleased to be with you as seeding\nOn this cold day cold and wet day hopefully your home and under the covers and relaxing and speaking of under the covers we're going to end the even if you can stay with me the midnight\nSomething I like to call bringing out the covers of will play some interesting covers\nOf songs you know the little twist I think you'll like that and actually will bring him playing a couple of covers a throughout the evening as well besides that we're going to focus on a\nAh some new music from Arab state Amy Ray blood orange among many we're going to say happy birthday to Jackson Brown and the thirtieth anniversary of our of you choose rattling Hama\nPlus at the end of the first hour we'll do a little sweet of music of some of the recent rock and Roll Hall of fame nominees I think you'll like that we're going to start things off with the real big birthday from today and that is\nThe legendary John Lennon who was born in this day\nDo you like that and actually will bring him play in a couple of covers a throughout the evening as well besides that we're going to focus on a ah some new music from Arab state Amy Ray blood orange among many we're going to say happy birthday to Jackson Brown and the thirtieth anniversary of our of you choose rattling home\nPlus at the end of the first hour we'll do a little sweet of music of some of the recent rock and Roll Hall of fame nominees I think you'll like that but we're gonna start things off with the real big birthday from today that is\nThe legendary John Wooden who was born this day October ... Nineteen forty and very interesting enough his sunshine linen musician his own right was also born on the same day October night\nIn Nineteen Seventy five so we're going to start things off with the John Lennon song and the one that connects the two\nAnd finish up with an interesting song that John Lennon did with a kind of a collective you did with less clay pool of prime is from a couple of years ago that I liked quite a bit we'll start things off with a happy birthday to John Lennon here on Ninety One point five K. R. C. C.\n[noise] [noise]\nYeah\n\n\nAny day no [noise]\n[noise] no\n\nNot\nSo bad so radical man\n\n\nOh [noise]\n\n[noise]\nFinished at that set of music with a really interesting I'm from a couple of years back called the ... and that was part of a tribute to birthdays to both John and John Lennon father and son they were both born on October night\nJohn Nineteen forty Sean Nineteen Seventy five so happy forty third to Shaun\nThe name of that song is cricket in the genie movement won the delivery him from the album monolith of ... before that John Lennon beautiful tribute to his son when he was um a young boy beautiful boy darling boy from\nHis last album double fantasy from Nineteen eighty and we started things off with a very interesting version of John's classic strawberry fields forever from the love album which was an album put together by longtime producer George Martin with his son Giles taking lots of interesting songs\nIn music from um the Beatles long canon of music for the love circus to lay a\n... event in Las Vegas which I've seen before wonderful stuff and you'll notice on that album there's some interesting samples of other Beatles songs that come in there at some point including in my life the piano solo little bit of sergeant peppers hearts club band penny lane gets in their ... from John I'm from George Harrison\nSt George Martin with his son Giles ticking lots of interesting songs in music from um the Beatles long canon of music for the love circus allay a\nEvent in Las Vegas which I've seen before wonderful stuff and you'll notice on that album there's some interesting samples of other Beatles songs that come in there\nAt some point including in my life the piano solo a little bit of sergeant peppers hearts club band penny lane gets in their ... from John I'm from George Harrison and then hello goodbye towards the end\nGreat stuff they're happy birthday for John Lennon when the\nGreek debt crisis hit many European officials supported letting a Chinese shipping company take over for the whole now some European observers have regrets [noise]\nFind a safe they find the\nSign of gaining a foothold in Europe's economy in the next MORNING EDITION [noise]\nTomorrow morning at five AM on Ninety One point five key or see see\nEverybody that this ... this is Christopher hello this is Michael from spirit in Ninety One point five K. I. C. the music having pm get made Ninety seven Ninety three\nTo touch after ten twenty two here on October ninth\nHope you're having a good evening this is talk to your music mass during your host for this late night music mix is next to the news they were going to hear new music from Arab state it's a\nThey're long awaited second release I've been looking forward to it for a couple of years I'm happy to say that it's here and we're starting to play a lot here in the studio also brand new Bob Moses their second a feature album we're going to start things off with one more birthday that happens today that perhaps gets overshadowed from\nJohn Lennon and Sean his son and that is Jackson Browne another legendary um\nFolk art is American singer songwriter he turned Seventy today October night or not to win I Nineteen forty eight will start things off with my favorite song of all the ones that she's written a firm about Nineteen Seventy four hope you enjoy this on Ninety One point five care cc [noise]\n[noise]\n\nTurned Seventy today October night for dinner tonight Nineteen forty eight will start things off with my favorite song about the ones that she's written a firm about Nineteen Seventy four hope you enjoy this on Ninety One point five care she see\n\n\n...\nIt's not really\nWhat\n\n\nLine man\nA\n\nIn a\nTime\nI'm\nDown in\n... Maine\nIn\n... we\n\n...\nThem to move\nI'm\nBe the one young he [noise]\n\n\nUm\n[noise]\n\n[noise]\n\nStarted the top of that set with the classic from Nineteen Seventy four with a nod for happy seventieth birthday to Jackson Browne was late for the sky or incredible song that is after that brand new Premera blue state the electronic do a lot of\nGreat Britain with lots of lots of guest stars including on this when locals Holly Walker their new album is kingdoms in color in that song slow he\nAfter that we went back to Nineteen Ninety five with our EMs monster and one of the gyms from that album I don't sleep\nI Dream and we finished things off with kind of a dreamy kind of a group and song Bob Moses original two guys also electronic related from Vancouver originally with the song backed down from their second\nSo that brand new from Arab state the electronic duo out of\nGreat Britain with lots of lots of guest stars including on this one vocalist Holly Walker their new album is kingdoms in color and that's the song slow heat\nAfter that we went back to Nineteen Ninety five with our EMs monster and one of the gyms from that album I don't sleep I Dream and we finish things off with kind of a dreamy kind of\nUm group and song Bob Moses ... the two guys also electronic related from Vancouver originally with the song backed down from their second studio album just released a little while ago and that album is called battle lines\nIn the community partnership for child development invites you to meet the tooth fairy and learn about the importance of good early oral health habits that event coming up October\nTwenty in Colorado Springs more information on our community counter link I can see that orange e\nMemberships or the largest source of funding at Ninety One point five K. R. C. C. allowing us to bring you local stories NPR News and music thanks for your generous support\nBefore we had back to the last set of the first hour on the Tuesday late night music mix with Dr T let's take a look at that whether it's been very interesting the last few days coal wet\nI'm really interesting stuff but I guess we do need the moisture but there's a freeze wanting tonight here in Colorado Springs area where it's currently thirty seven degrees and overcast a chance of rain and maybe a little bit of snow and patchy fog\nAnd or the low will be about thirty one to ... tomorrow Wednesday warms up maybe a couple of degrees the forty two but a twenty percent chance of rain and possible snow thirty overnight forty eight on Thursday and it gets a little better on the weekend fifty six on friday and fifty seven on Saturday [noise]\nHow 'bout and some of the lower elevations like law hunter around four thousand thirty eight and overcast they're thirty three overnight again with the phrase warning tomorrow not too bad fifty one partly sunny and by the end of the week you get into the sixties with a little chance of rain\nIn final it's go the other direction both elevation and uh and uh to the west and that's what I'm part the city about the clouds\nWhere it's overcast they might be in the clouds right now too and it's a thirty three degrees twenty two overnight wound up forty percent chance of snow showers and patchy followed that continues through Wednesday\nThey'll they will get up to forty two or thirty percent chance of rain also and Thursday and not too bad on friday fifty three and mostly sunny but the weather is definitely cool and some more ...\nAnd by the end of the week you get into the sixties with a little chance of rain and finally let's go the other direction both elevation and uh and uh to the west and that's one of the Park City about the clouds\nOr it's overcast they might be in the clouds right now too and it's a thirty three degrees twenty two overnight while under forty percent chance of snow showers and pets you fall that continues through Wednesday\nThey'll they will get up to forty two or thirty percent chance of rain also on Thursday not too bad on friday fifty three and mostly sunny but the weather is definitely cool and some moisture hope your home warm and dry\nHere on Ninety One point five care cc is we're listening to the late ... music next Tuesday edition\nAnd uh we're going to start this last set of the first hour with songs from the recent rock and Roll Hall of fame nominees that were announced today I'm going to focus on for artists that I like quite a bit a including a Radiohead yeah it's hard to believe they've been around for twenty five years Roxy Music\nThe cure Todd ... we're going to start things off with a tribute to band I can't believe not in there the British Band from Nineteen sixties and that is those armies\nAnd it seems like since this season of weather seems rather interesting that seems like this will be very appropriate song do you all know it here on Ninety One point five care see see\n[noise]\n[laughter]\n\n\n\n\nHe's [noise]\n\n[laughter]\n\n\nSo\n\nThat\nWe\nUh\n[noise] [noise]\n[noise]\n\nWell\nShe does your dad\nLives should pay the rent a\nMovie in the\nA lot of uh\nThe [noise]\n\n\n\n\nThe knees [noise]\nUm [noise]\nWhat\nWhat's your name is ...\n...\nIn a\nI had a\nDog a\n... [noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n\nOh\n\nDa\n\nFinished up that set of music in the first hour here on the Tuesday late night music mix with four songs from artists who are now nominated for the two thousand Nineteen class for rock and Roll Hall of fame and we can get one more after this next break a to have another start the next but what we heard\nFinished up that set of music in the first hour here on the Tuesday late night music mix with four songs from artists who are now nominated for the two thousand Nineteen class for rock and Roll Hall of fame\nAnd we're going to one more after this next break a to having to start the next set but what we heard there was time of the season from the zombies again it's hard to believe that\nA rod origin and company or not in there that's from their great album odyssey and oracle\nAfter that Todd run grin and I picked the song from one of his kooky your albums do you want to call it that a wizard a true star\nCalled sometimes I don't know what to feel great stuff there from Mr Ron going after that the cure from the Nineteen eighty five out in the head on the door to lead off track the incredible in between days we've faced things off with the eighth and final album from Roxy Music between brain very of course\nBut the title track from Avalon and hunting a music that you hear a vocals is the Haitian a singer\nYani AT T on who's just sounds great on that here on Ninety One point five care she see\nMore and more people are getting their news on mobile devices in through social media in Ninety One point five he ... he doesn't have to be any different me this morning and you can find it on our website getting out of your current went to keep listening to all things considered download the mobile apps need info on a local story impacting your community\nFollowers on Twitter feel like passing along that NPR story Mica unsafe but then you never stop neither do I knew when we find NPR's TV and\nJust cross the eleven o'clock hour here on southern Colorado the NPR station K. R. C. C. care C. C. H. D. Colorado Springs Kate you see the hunter case CCS start feeling K W CCF in woodland park\nAnd we're streaming has always as cares a care C. C. dot O. R. G. and how to go back and just told you a little bit about all the things you can do to stay in tune with Ninety One point five care cc including our website\nAnd I should also say though that website you can also listen to music on demand where you can listen to all over the DJ's um playlists and shows Monday through Sunday that going on from seven P. M. all the way up to midnight including five days a week with your friend and neighbor Vicky who you heard again this evening so check that\nThe hunter case CCS start feeling K W CCF in woodland park and we're streaming as always as cares at care cc dot O. R. G. and how to go back and just told you a little bit about all the things you can do to stay in tune with Ninety One point five care cc including our website\nAnd I should also say though that website you can also listen to music on demand where you can listen to all of the DJ's um platelets and shows Monday through Sunday that going on from seven P. M. all the way up to midnight\nIncluding five days a week with your friend and neighbor Vicky who you heard again this evening so check that out it's music on demand\nYou can look that up under um [noise]\nAs M. O. D. or M. O. D. dot care C. C. dot O. R. G. alright folks were going to head back to this next set of music and we're going to start things off with one more nominee\nFrom this two dozen Nineteen rock and roll a class that is my favorite of the bunch and it's hard to believe that they've been around twenty five years we're also going to hear a brand new from the British Band called the coup so they have a new album out or we're also going to see if we have time to hear new Amy Ray the Indigo Girls heard new solo album which was pretty cool\nAnd thirtieth anniversary to rattling hum the Nineteen eighty eight album that was kind of a live album with some ... also some studio cats from you too\nSo that sounds like a great music I Hope you'll enjoy that but we'll start things off with Radiohead from their classic Nineteen Ninety seven album okay computer and we truly are lucky to have had Radiohead around for twenty five years\n[noise]\n\n\nAnd I'm a long and\n\nCheese and\n\nAnd\nAnd\nAnd\n...\n... ... ... ...\n...\n\n...\n... ...\n...\n...\nThan\n... ... ... ... ... ... ...\n\n\n[noise]\n\nAnd now we can do [noise]\nShe did\nTake a\n\nAnd now we can do\nThe the the ... na\nNa\nDon't you miss the big time\nYou know ... ball\nDon't you miss the big time\nAnimals on or off the ball\nFinished up that sort of music with one more song contribute to John Lennon birthday which would have been Seventy eight today on October night\nFinished that that sort of music with one more song in tribute to John Lennon birthday which would have been his Seventy eighth today on October night\nHe was born in Nineteen forty that's watching the wheels I'd say that's my favorite of all of his solo work and I love that song quite a bit from double fantasy\nAnd it was inspired because I wanted to play a song from YouTube rattling home before that\n'cause it's tomorrow will be the thirtieth anniversary of the release of their six studio album which was part live and part new studio attracts about nine of those and that is one of the more interesting ones called God part to which was kind of a tribute to the original song God by John Lennon of course\nAnd it was kind of the whole album rental homes had this kind of folksy Americana peel appeal to it but this one was different a little darker little more industrial almost kind of a precursor to their next album the classic auction baby\nWhen you think about that was produced by Jimmy I have on and um this was a kind of a reaction to a pretty scathing um biography of John Lennon by Albert ... money makes a reference to that it goes I don't believe in girl Goldman has type like a curse instead Carmen is going to get him if I don't get him first\nBond oh doing his preaching there but in tribute to\nMr linen himself before that brand new Amy Ray her six solo album the ... one half of the Indigo Girls would you put out many many albums\nHard to believe she's put out six it's brand new it's called ... it's a really nice song called\nDad gummed down before that brand new from the cooks they're six album let's go sunshine ends and then the album and they're really nice song no pressure which is the last song on the album and we started things off with a tribute to Radiohead who is ... who have been nominated for twenty Nineteen rock and Roll Hall of fame I Would be shocked if they didn't get in\nAnd that's from okay computer from the kind of re mastered twenty ... twenty year anniversary [noise] uh uh okay not okay from two thousand Seventeen and that is the fantastic song\nLucky when the Greek debt crisis hit many European officials supported letting a Chinese shipping company takeovers record will now some European observers have regrets [noise]\nFind a safe\nRadiohead who is ... who have been nominated for twenty Nineteen rock and Roll Hall of fame I Will be shocked if they didn't get in and that sort of okay computer from the uh kind of re mastered twenty ... twenty year anniversary a a okay not okay from two thousand Seventeen and that is the fantastic song lucky\nWhen the Greek debt crisis hit many European officials supported letting a Chinese shipping company takeovers record will now some European observers have regrets\nIf they find the\nSign of gaining a foothold in Europe the Congress and the next MORNING EDITION [noise]\nTomorrow morning at five AM on Ninety One point five K. or see see\nIn ... and I am ... and you're listening to Ninety One point mine are [noise]\nYes indeed you are listening to Ninety One point five care see see if you just tuned in\nWe getting towards the latter part of the Tuesday late night music mix says your host Dr tea here most Tuesday nights and as I was listening to that last John Lennon song played a few songs have him tonight and also a song from the sun shine they were both born on this day in October night it reminded me a little bit of a quote and if you listen to\nThe evening on all things considered with your host micro so he often does quotes and remind me of a quote that I think I'll share with you from John Lennon from that last album double fantasy minutes from the song but he\nDoesn't tribute to his son beautiful boy which he played in the first hour and that his life is what happens to you while you're busy making other plans isn't that true for sure\nStart this next to the music we're going to hear one of the covers a leading up to our last set of music which is going to be all covers because we're going to be bringing out the covers 'cause it's so Chile out there you get that\nAnd they want to play a song from the Ryan Adams cover album of Taylor Swift Nineteen eighty nine which is one of those things where it's better than the original in my opinion but it did make me appreciate 'til the stress music a little bit Ross going to hear a brand new music from blood orange and the great father son combo of limb and Neal thin you know of course\nFrom crowded house split into the hall those kinds of things\nAs they said and music were to start things off with the\nAforementioned Mr Ryan Adams from his Nineteen eighty nine album from a couple of years back here on any one point five care cc\nOf Taylor Swift Nineteen eighty nine which is one of those things were better than the original in my opinion but it did make the upper should tell the truth is it a little bit Ross going to hear a brand new music from blood orange and the great father son combo a limb and Neal Neal course for the house but he earns at all those kinds of things\nBy studying music where to start things off with your poor mentioned Mr Ryan Adams from his Nineteen eighty nine albums from a couple of years back here on anyone for five years and\nNa na da da\nNeeded to\n[noise] jeeze\nNa na\nWe need you\n\nThe new you know\nNa\n\nNa\nThem in the ... ...\n... you know to be ... ...\n[noise]\nCatchy great stuff there from ... from her debut album isolation which I've been playing quite a bit ever since we got it here at the studio\nHer new out her debut album is called isolation and the song you heard was your teeth in my neck she is a Colombian American singer and songwriter brand new stuff here she started out with a mix tape a few years ago and now she's kind of put it all together and just a great album there and that is and now she is um [noise]\nTwenty four years old so I'm really looking forward to what's happening with her future before that also brand new stuff from blood orange which is Deb Heinz group he's out of England and this is their second folding album is called negro swan and really fantastic song St\nFor that and other new song from the album light sleeper it's Neal and Liam Finn father and son to put together quite an album you've heard the song anger plays a part\nAnd we started that set with a first of what's going to be a few more covers\nOr two in the evening we're going to do that just after this next to a message and whether we heard Bryan Adams doing an incredible version of Taylor Swift Nineteen eighty nine with the song wildest dreams and as a result an album I can truly say that I liked Taylor Swift about twenty five percent more\nThis election year you can count on to put the best journalists on the job from NPR to the Ninety One point five ... newsrooms we bring you insightful reporting to help you understand the issues and the candidate you make it possible donating at K. R. C. C. dot org thank you\nEither this is my ... this is Jonathan\nA message and whether we heard Bryan Adams doing an incredible version of Taylor Swift Nineteen eighty nine with the song wildest dreams and as a result the album I can truly say that I like Taylor Swift about twenty five percent more\nThis election year you can count on to put the best journalists on the job from NPR in Ninety One point five ... newsroom we bring you insightful reporting to help you understand the issue and the candidates you make it possible donating ... the the dot org thank you\nEither this is my ... this is Jonathan from you other than the dominant slowly from the most at Seventy engineered now anyone ...\nWhere we are truly getting close to midnight here on the late night music next Tuesday edition with Dr chi for your head back to that last set of music which will be all covers\nTo get you kind of bringing out those covers helped you warmed up for a cool evening here in the ... region let's take a look at that whether it's thirty seven here in the Carter springs area with a freeze warning overnight lows thirty one forty two tomorrow with little chance of rain and possible snow like maybe it was today\nAnd thirty overnight Thursday forty eight and friday and Saturday the sun does kinda peak out and we get into the mid to high fifties [noise]\nHow 'bout in canyon city where it's currently thirty eight degrees thirty three overnight watch out for the freeze warning there forty six tomorrow partly sunny fifty two on Thursday sixty and mostly sunny on friday not too bad lows in the thirties it's cool evenings for sure you're in October and finally\nLet's go way out to divide where it's over nine thousand of elevation and it is currently thirty three degrees twenty two overnight and it says there could be some snow showers and patchy fog and that will continue through Wednesday\nThough it may pick up to the five to about mid forties and a low of twenty four on Wednesday night forty nine with a little chance again of that snow on Thursday\nNot too bad on friday fifty two in mostly sunny up there in divide okay folks its head back to this last set of music as we're approaching the midnight hour here on Ninety One point five care cc and as the weather starts to get cold we like to bring out the covers\nAnd I think you'll like this set we're going to do here from ... doing their little Jimmy hendrix version we're going to hear a group called sweet back doing if a bill withers tunes feedback you may know them as the backup banned for sure day for many many years but we're gonna start things off with a really cool album attract from an album called just tell me what you want a tribute to Fleetwood Mac\nThis is a song that you know of course and this and one of them\nIn divide okay folks its head back to this last set of music as we're approaching the midnight hour here on Ninety One point five years cc and as the weather starts to get cold we like to bring out the covers\nAnd I think you'll like this that we're going to do here from staying doing their little Jimmy hendrix version we're going to hear a group called sweet back doing if a bill withers tunes we backed you may know them as the backup band for a day for many many years but we're gonna start things off with a really cool album track from an album called just tell me what you want a tribute to Fleetwood Mac\nThis is a song that you know of course and this and one of the the person who saying this original was also one of the nominees for the rock and Roll Hall of fame in that Stevie Nicks and this is the kills Alison moss hearts group who else has done some work as the lead singer object whites side group dead whether\nShe and her take here on a Fleetwood Mac classic to start this last of the music on Ninety One point five care cc [noise]\n[noise]\n[noise] [noise] [noise]\n[noise] and you can say you are free\nHe damn\n\nIt shoots should way you've seen\nA less care for her name to the sad [noise] uh you know I mean that guy how\nMan shoo man\n[noise]\n\n\nYou at all and yeah the\n... yeah\nHe ... ... jobs you know\nAnd you\nKnow I Do too well the ... the\nUn aids remains in London\nIn that you're lonely\n\nOf all\n\n", "month": "10", "day": "10", "state": "CO", "station": "KRCC"}