{"year": "2018", "show_name": "91.5 KRCC Late Night Music Mix", "month": "10", "content": "In Nineteen Seventy one I don't want to do wrong head of that it was the car to be again obscure even by vintage voltage standards a particularly pretty slice of English freak be called I don't deserve a girl like you of Nineteen Seventy I should say foot those numbers around Nineteen sixty seven\nWas the year that one came out before that one year after that\nNineteen sixty eight to be a little bit more exact fair port convention from their self titled debut album covering Joni Mitchell Z\nI don't know where I stand also in that set Pueblo, Colorado is very own trolls Nineteen sixty six is I don't recall and Yvonne element in the role of Mary Magdalene from the original recording of Jesus Christ superstar Nineteen Seventy I don't\nKnow how to love him it's the brand new Allison ... CD going out to to me was the first call or two correctly id Helen Reddy as having hit the top Fifteen back in Nineteen Seventy one with her version of I don't know how to love and its congrats going out to a gym thanks to all who called\nThe time to everybody just a few seconds night of the ten pm hour here at Ninety One five so it's just about time for\nNPR News after that to hold terrific hours of teen owes tunes at ten this is Gigi thanks so much for joining me for this evening's edition of vintage voltage\nWill do it again next Saturday Night from eight to ten pm here on southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs K ISI Ceylon to Casey a stark villain K W CCF and moving bark streaming at K. R. C. C. dot O. R. G.\nSupport for Ninety One point five K. are coming from our listeners and from local organizations who wanted to reach a discerning audience that value quality\nMarketing on Ninety One point five K. R. he see underwriters reached the people most likely to shop in their businesses support their nonprofit and by taking their ... to learn more about corporate important how Jeanette seven one nine four seven\nOr eight year old white [noise]\nLive from NPR News Culver City California I'm Shannon ... cents to clean up from hurricane Michael continues across several states at least fourteen people have died but rescuers have not yet reached some of the hardest hit areas NPR's Quil Lawrence is in Mexico Beach Florida at this time was ...\nSupport their nonprofit and buy tickets to their shows to learn more about corporate support and called genetic seven one nine four seven\nOr eight year old one [noise]\nLive from NPR News I'm Culver City California I'm Shannon been sent to clean up from hurricane Michael continues across several states at least fourteen people have died but rescuers have not yet reached some of the hardest hit areas NPR's Quil Lawrence is in Mexico Beach Florida\nThis town was maybe the hardest hit by hurricane Michael their entire rows which were was three storey houses with palm trees and some of them know look like vacant lot rescue workers can't even tell if there was a house there or not and they're relying on local police records\nThe local police were told by over two hundred people that they intend to stay through the storm\nAnd no direct you rescue workers are looking for some of them and trying to figure out how many actually did stay there for the most part given up hope of finding survivors who need help and they're looking to see how many people might have died in the rubble of this town\n[noise] President Trump welcomed pastor Andrew Brunson to the White House today celebrating has released from detention and turkey as NPR's Tamara Keith reports the evangelical pastor has been held in Turkey for nearly two years\nBrunson and his family sat next to Trump in the oval office marking the end of what had been a harrowing two years Branson an American evangelical Christian pastor with a small church in Turkey was swept up in a crackdown\nBy the government of Turkish president regimen type aired on following a coup attempt in twenty six team he was freed friday\nI Wish I were spoke about this at least once a day we thought we added on two months ago sometimes it doesn't always work out for the [noise] I can only tell you this better than anybody else because of\nA grateful Brunson thank the president members of Congress State Department officials and others for their efforts to secure his release while\nStill in the oval office Brunson prayed for Trump asking that he be given supernatural wisdom camera Keith NPR News\nSaudi Arabia is welcoming Turkey's decision to allow Saudi investigators to be part of the probe into the disappearance of a Saudi journalist NPR's Peter Kenyon reports Jamal 'cause she'll be disappeared after entering the Saudi conflict and its tumble on October second\nSaudi foreign ministry issued a statement on Twitter saying the kingdom come in the puzzle\nDepartment officials and others for their efforts to secure his release while\nStill in the oval office Brunson prayed for Trump asking that he'd be given supernatural wisdom camera Keith NPR News Saudi Arabia\nIs welcoming Turkey's decision to allow Saudi investigators to be part of the probe into the disappearance of a Saudi journalist NPR's Peter Kenyon reports Jamal 'cause she'll be disappeared after entering the Saudi conflict in Istanbul on October second\nThe Saudi foreign minister you issued a statement on Twitter saying the kingdom come in the positive response from our brother country turkey do the idea of forming a joint investigative team to look into the show ... disappearance\nPreviously Turkish authorities absurd anonymously to their preliminary conclusion is that the show he was killed inside the consulate a charge Jody officials to annoy\nYou showed his writings for the Washington Post have been critical of\nA group of nonprofit an advocate\nOn where Abraham Malaysia's ex deputy prime minister and a former rival to the current prime minister has won a seat on parliament he had been jailed for three years for sodomy before Malaysia's keen granted him apart in in may this is NPR News\nGeorgia's voter registration process has been under attack recently for a law that has landed about fifty three thousand hopeful voters on a pending list secretary of state Brian Kemp who is also the Republican nominee for governor is being sued over it\n[noise] the Philippines has won another term on the United Nations Human rights council international groups are criticizing the move is unconscionable and human rights watch has accused the Philippine president Rodrigo do territory of overseeing a killing frenzy and his brutal drug war which it says could amount to crimes against humanity\nThe Philippines one at three or term on friday at the U.N General assembly becoming one of Eighteen member states to join the council through twenty Twenty one and rights groups say as many as twelve thousand suspected drug addicts and dealers have been killed in the Philippines\nAnd that ... threatened and harassed his critics\nThese high and government says all migrants living and ... a town in southern Italy must be transferred to other locations the order comes days after the town's mayor was placed under arrest for his alleged role in organizing marriages of convenience for immigration purposes\nThe mayor's arrests follows months of tougher migration enforcement from Italy is popular\nScrape say as many as twelve thousand suspected drug addicts and dealers have been killed in the Philippines and that ... threatened and harassed his critics [noise]\nThe Italian government says all migrants living in Riyadh Shea a town in southern Italy must be transferred to other locations the order comes days after the town's mayor was placed under arrest for his alleged role in organizing marriages that convenience for immigration purpose is\nThe mayor's rats follows months have tougher migration enforcement permit at least populous government\nThe mayor had made international headlines for welcoming migrants giving them a band in homes and on the job training in an effort to grow the local economy hundreds of migrants have moved to the town which originally had a population as a couple of thousand people I'm Shannon and sent NPR News in Culver City California\nSupport for NPR comes from NPR stations or their contributors include the doors do charitable foundation whos clinical scientists development awards support promising early career physician scientists and their research efforts to improve human health and Americans for the arts\n\nCommitted to Kurt commercial free programming right here in Ninety One point vibe southern Colorado's NPR station wanna set a good evening Gino Mindy in with you two hours of commercial\nFree free for music coming at ya up until midnight before we get rolling I Want to give a special thing U G G another ritual catch Gigi every Saturday nights from seven to age you does vintage voltage new played special style eight o'clock the regular vintage voltage\nShe's not Rachel or because it's anything but regular amazing vintage voltage age followed by Gino June ... June\n[noise]\n[noise]\nAnd\n\nAnd\nShe no she said yeah\n\n[laughter] [noise]\n... Mm\nMm\n\nMaybe ... ...\nNow a\nTo jail and then you try\nBe more on\nA\n[noise]\nNo\n\n[noise] swimming with the crocodile ... a great song the veils gave us swimming with the crocodiles the album total depravity\nA muddy Joanne ... the name of the album we heard in the middle of that set Mr grant leap buffalo mighty Joe moon and the U.S some lady got diver and me started up was spiritual lives uh here comes the road let's go brand new album from ... called\nAnd nothing hurts all your Chino change Ninety One five K. R. C. C. we are southern Colorado's NPR's station\nLater today on this American Life what about the for Seventeen people died at Marjory Stoneman Douglas High school in Parkland, Florida school did this intense training everybody in the school wide revamped new procedures what they were supposed to do in case someone\nAnd me started up with spiritual lives uh here comes the road let's go brand new album from ... called and nothing hurts all your Chino change Ninety One five K. R. C. C. we are southern Colorado's NPR's station\nLater today on this American Life what about the for Seventeen people died at Marjory Stoneman Douglas High school in Parkland, Florida school did this intense training everybody in the school wide revamped new procedures what they were supposed to do in case someone set up at school and started shooting and we wonder did it help\nSeventeen people died and did they said what does it make things worse\nTeachers when they do today [noise]\n[noise] [noise]\n[noise]\n\n\n\n\n\nI made the call right\nYou'll be in\nI mean come\nNews media in\nTo me\nAnd we're\n... ... I mean\nWe're\n[noise]\nNo\nNo\n\n\n\n\n\n\nA problem for me to me\nWas she\nKnow I mean to me\nShe's\nAny news\nIt'd be\nAnd mean\nMe\nBanned the horses she routine to Ninety One point five K. R. C. C.\nFrom the band the horses release why are you okay we just try lying under oath ... Twain and\nA great album there let's see I Want to tell you what she's actually Twain Allman various stardust is called guide dog the Dwayne Allman retrospectively and a boss gets to the tune with Dwayne\nLoan me a die all here Chino choose Ninety One point five K. R. C. C. we are southern Colorado's NPR station\nUnder oak Mr ... and ... Twain Allman a great album there let's see I Want to tell you what this is actually Dwayne Allman various artist is called sky dog the Dwayne Allman retrospective and a boss Skaggs doing the tune with Dwayne\nLoan me a dime all here Chino tunes Ninety One point five K. R. C. C. we are southern Colorado's NPR station\nOn behalf of all of us here in Ninety One point five care cc thank you for your support during our fall membership drive your financial contributions will ensure that Ninety One point five here cc provides accurate and use an analysis music entertainment today tomorrow and the day after we could not do this without thanks\n[noise] and\nThank you for being a part of K. R. C. C. N. K. R. C. C. music right do you live seven nights a week\nFrom ... until midnight one has set at ten forty one in the Rocky Mountain west on your Saturday Night Thirteen October personally forty four degrees here in downtown Colorado Springs the wind starting to blow\nAnd get ready batten down the hatches forty four right now is going to seem like a heat wave for both Sunday and Monday in the pikes peak region overnight low of twenty five degrees tonight here in Colorado Springs looking for a high Colorado Sunday of twenty seven\nAnd an overnight last Sunday night into Monday of Eighteen degrees so we're ready for a hard freeze\nI Would just connect those hoses from the spec it's bringing any flowers are covered them\nAny of those plans to use its time thirty two for a high in the steel city ... thirty to furlough tonight thirty two bride are Maro what's that child your wind and snow snow in the upper elevations\nA bolt teller and shape your county teller county in mom's monument looking for two to five inches the springs Pueblo canyon city Trinidad\nAh possibilities of zero to two inches while the ... mountains giving the majority age plus inches a overnight and in some Monday upper elevations a twenties low twenties tomorrow\nThirty two bride tomorrow what's that show your wind and no snow when the upper elevations\nA boat teller and a cheap ... county teller county in ... monument looking for two to five inches the springs Pueblo canyon city Trinidad a possibilities of zero to two inches\nWhile the singer decreased does and the ... mountains giving the majority each plus inches overnight and in some Monday a probation or twenties low twenties tomorrow low thirties for the plane's loaded mid thirties and hearing the pikes peak region mid twenties about twenty seven degrees\nRight back into the music here Ninety One point five K. R. C. C. this John at Napa love tunnel concrete block\nThing\nGet you\n\n\nWhen you\nGet the\n[noise] [noise]\n[noise]\n[noise]\n\n\n\n... Robert plants in the band joy a release monkeys the name of the nation from a band of joy album from Robert Plant\nAre ... for a monster I'm the real thing that's crushed with ...\nA Janet Napolitano one concrete blonde started that set up a couple from still in the Hollywood we started with Joey the acoustic version and then it'll ... and stitch out all your Gino choose Ninety One point five K. R. C. C.\nThis week on all things considered here the latest news media than an honor to like that can never\nHot what it means what we have a number of people it would very much like to do it it's a great position and some things that are so serious there's no sort of\nInstruction manual that goes with a song that tells you think you'll feel you know with into all things considered to hear the bigger picture every afternoon from NPR News afternoons at three thirty on Ninety One point five or your cc\nAnd you're on board Gino gyms with genome and dean on southern Colorado's NPR station we are K. R. C. C. K. R. C. C. H. D. Colorado Springs\nCasey Sheila hunter case she she starts real K WC she up in woodland park and streaming around the world gay R. C. C. dot O. R. G.\nE.\nD.\nJoe's with Chino men deemed on southern Colorado's NPR station we are A R C C C C H the\nColorado Springs UC Sheila tissue she starts real Wu cc up in the park and streaming realm or gay are cc dot O. R. G.\n\n\nGo to a\n\n\nIn tone\nBeen\nMaintain a\nClose to my man\n\nYeah yeah\n\nHave any\nAnd that\nBut um\nAnd two men and women and men\n\n\n\n\n\n\nThen\n\n\n\nYeah yeah you\n\n\n\n\nProgramming on Ninety One point five K. R. C. C. is supported by the Colorado Springs independent be drink the election issue ... covered your candidate ballot initiatives happening this fall papers available at over eight hundred locations around the area reports in features on line see Cindy dot com\nOh\nGet the bow to vote for man they got to fall back on the top you asked them up in the ... do the\nBanks real thanks threats along capital power politics have sprung up Iraq to talk about the last\nLast big dogs to talk about the gold medal watching all potential\nGet the bow to both men you've got to do that but don't be an aspirin ended up until finally mentioned on the Web depressed do\nBang real thanks river long capital hair follicles you just want to be your dog well the last\nLast big dog talking about the gold medal no\nIdea how they do or\nBall they'll be like that you can't get to the local tax plan the ball to both through\nA damn about the other side of town is not a cure bringing on I put in the nation bump up tonight and you're celebrating the ... the\nThree and you have to pay for it because of the book was picking up\nTo Minnesota built to grab surely surely will depend on\nNot on school won't give you the best known\nYou're also in the PTA like kept shooting guns on the video game\nGrand go down and you're on\nBusiness runs the great while they were beginning\nBanned them to play it lasts\nYou're also in the big like she goes on the Rio\nDown and you're well I'm a\nBusiness runs the great while the beginning\nAnd bans in place to land the breed you better way to go vote but rather than something\nGoing to Americans thirty nine billion\n\n\nMr pap Maguire from his album love songs for astronauts and we are I ate allies you duo which are the people [noise]\nI'd rather have a pet McGuire and I hate the law is you pop the underworld believe it or not brand new release\nCheat time jumping counters and are popping under rural gave yeah I'll see big we started up a ... is about ... from the seesaw released\nClose to my fire all your Chino tunes Ninety One point five K. R. she she we are southern Colorado's NPR station\nCatastrophe on the Florida Panhandle the latest on the clean up and recovery from hurricane Michael\nAnd well the storm scrambled from closely watched political bases in that swing state before the midterms\nAlso a certified genius we talk with a new MacArthur Fellow who's bringing music under served communities all that and the latest news from Washington and around the world on weekend edition from NPR News this morning or Ninety One point five to your cc\nEverybody this is ruby foster this is Krista didn't ...\nIt seemed to Ninety One point five K. or see the music ... seven nights a week\nAnd we thank you for doing so\nFellow who's bringing music under served communities all that and the latest news from Washington and around the world on weekend edition\nSunday Morning six Ninety One point five K. R. C. C.\nHey everybody this is from the faucet this is Chris hello this is Michael project became the\nNinety One point five ... or ... Ninety seven nights a week\nAnd we thank you for doing\nReal disease\n\nLong as I can do a\nThe same\n...\n\n...\n\n\n\n... the\nLawyer died games on\nLawn and somebody said now\nA\n\nLong as they get ... to\nBoss were arrested brand new album here in the case\nPhosphorus the brand new album here in the K are CCS studios Bosphorus since the title of the album see la vie the tomb we heard the title track say love the\nNumber two right ahead of phosphorus in Joe Walsh from his so what seven re mastered album we tracked county fair Ray Davies Jackson Browne started that set off from the a compilation\nAlbums see my friends and water loose sunsets all here Ninety One point five K. R. C. C. we are southern Colorado's NPR station\n\nLater today on this American Life one month before Seventeen people died at Marjory Stoneman Douglas High school in Parkland, Florida school did this intense training everybody in the school wide revamped new procedures what they were supposed to do in case someone set up at school and started shooting and we wondered did it help\nSeventeen people died did they save lives did make things worse\nTeachers when later today [noise]\n\nJust American Life comes to you five o'clock a Sunday evening\nIt'd be running NOW Lebanon forty in the Rocky Mountain west on your Saturday Night Thirteen October I'm your host my genome and dean presently forty degrees here in downtown Colorado Springs the wind is starting batten down the hatches is going to be windy blowing in a cold front\nA snow overnight overnight low here in the springs twenty five but in the foothills\nPueblo up overnight law thirty two degrees the upper elevations in the ... twelve and fourteen bucks tolerance cheap ... county snow there overnight law Eighteen in Trinidad fourteen in Denver a boat Denver envy a pilot\nDowntown Colorado Springs the wind is starting batten down the hatches just going to be windy blowing in a cold front a snow overnight overnight low here in the springs twenty five in the foothills\nPueblo up overnight look thirty two degrees the upper elevations in the ... twelve and fourteen bucks tell her\nCheap ... county snow there overnight law Eighteen in Trinidad fourteen in Denver a boat Denver envy of pikes peak region looking mid twenties for high tomorrow dirty to even freezing for what blow up ... hanging\nIn the lower twenties\nAs eroding two inches a possible in the springs Pueblo canyon city in Trinidad two to five inches possible lot teller county monument ... eight plus inches in the ... mountains you are are wet winters\nOne last set a weekend overnight freefall music mix with Gino\nFather son do well\nRichard and teddy Thompson and the tune persuasion\nNa na\nUm and\nA ...\n... what I mean and I'm ...\n... then again\n...\n\n...\nMe\nAnd\n\n...\n\nThe mayor and\nNo one\nNot a lesbian na na na na\n\n\n[noise]\nIn to\nNo more bread than my\nLady's underwear\nTo bowl or the alarm", "city": "Colorado Springs", "day": "14", "state": "CO", "station": "KRCC"}