{"year": "2018", "show_name": "91.5 KRCC Late Night Music Mix", "city": "Colorado Springs", "content": "Wrapping up the Monday evening music mix I Ninety One point five K. R. C. C. study done at the top ... with the new road so what are the main songwriters seniors to the band\nWrapping up the Monday evening music Nixon Ninety One point five K. R. C. C.\nStarted off at the top of the set with Lou roads or one of the main songwriters and singers for the band lamb I don't know if they're still together I Hope they are they're one of my favorite bands and make beautiful music blue roads is one of the reasons it is beautiful with that voice\nFrom one good thing you heard the more I run\nCigarettes after sex from the self titled release and just a fabulous song that's how you know you're listening to them is when you hear apocalypse\nPort is head going back to tell me and wondering star some Tyco we the receiver and wrapping up the whole show tonight this side of NPR hourly news with something brand new from Gregory Ellen ...\nIt's called evening machines and you heard was\nI just another one\n\nThis is on all things considered here the latest news it has been an honor of a lifetime to serve\nMuch what it means what we have a number of reports would very much like to do is a great position than some things that are so serious was no ... who was it was with us from ... was in office\nHere the bigger picture every afternoon from NPR News ... afternoons at three thirty or Ninety One point five or so you see\nThis as southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs K. E. C. C. hunter case CCS stark bill and K W C. C. F. M. woodland park\nStreaming at K. R. C. C. dot org coming up and just\nA few moments NPR hourly news following that restricts hoop and Monday late night music\nFrom NPR News in Washington I'm nor rom secretary of state Mike Pompeo is on his way to Riyadh Saudi Arabia he's expected to meet with the king to discuss the disappearance of Saudi writer ... who haven't been seen in public since he entered the Saudi consulate in Istanbul, Turkey\nF. M. woodland park ... K. R. C. C. dot org coming up and just a few moments NPR hourly news ... and Monday late night music\nLive from NPR News in Washington I'm nor rom\nSecretary of state Mike Pompeo is on his way to Riyadh Saudi Arabia he's expected to meet with the king to discuss the disappearance of Saudi writer ... who hasn't been seen in public since he entered the Saudi consulate in Istanbul, Turkey nearly two weeks ago\nTurkish authorities say they believe he was killed their cars so good Jay has been living in the U.S and wrote for the Washington Post\nHundreds of people are still in shelters days after hurricane Michael slammed into the Florida Panhandle it came ashore last Wednesday as one of the most powerful storms on record to hit the continental us NPR's Quil Lawrence has more on recovery efforts\nCharge and chainsaws are in high demand as residents clear fallen trees and patch up the holes in the ruse made by hurricane Michael's one hundred fifty five miles per hour winds electric generators are shot after with power companies still tentative\nAbout when the lights might come back on there's no cell phone signal and much of the region moguls have been getting tips from radio stations about where they might find gas food and water distribution and medical care\nTraffic in and out of the worst affected areas has been crawling often sidelined by long convoys of police cars and power cruise as they flew into the pan handle from all over the state Quil Lawrence NPR News Miramar Beach Florida\nPresident Trump visited Florida and Georgia Monday to view the devastation he said the government is doing all it can to help survivors\nI'm not afraid of all it would be awful [noise]\n[laughter]\nAt least Seventeen deaths in four states have been blamed on this storm Microsoft cofounder Paul Allen has died at the age of sixty five from complications of non Hodgkin's lymphoma\nAs NPR's Martin Kaste reports the tech billionaire help define the early ... personal computers and went on to shape the look of his hometown\nIn those early photos of Bill Gates and Paul Allen it's a bearded Allen who looks like the grown up starting in the seventies the two childhood friends parlayed their computer hobby into the world's most important\nAt least Seventeen deaths in four states have been blamed on the storm Microsoft cofounder Paul Allen has died at the age of sixty five from complications of non Hodgkin's lymphoma\nAs NPR's Martin Kaste reports the tech billionaire help define the early look a personal computers and went on to shape the look of his hometown\nIn those early photos of Bill Gates and Paul Allen it's a bearded Allen who looks like the grown up starting in the seventies the two childhood friends parlayed their computer hobby into the world's most important software company providing the dust that ran IBM's another PC clones\nIllness forced Allen to seed control of the company to gates but his Microsoft shares made him a billionaire and then the succeeding decades he became a major influence here in Seattle as owner of the local football team and as a real estate Baron\nAllen spent millions on brain research and causes such as Ebola but also on memorabilia of his youthful enthusiasm Z science fiction and rock and roll\nMartin Kaste NPR News Seattle\nSears once the largest retailer in the world is now in chapter eleven bankruptcy and plans to close stores and eliminate jobs to stay in business at least for now this is NPR\nA trial is underway in Boston this week claiming that Harvard University discriminates against Asian American applicants\nAnd an opening statement Monday lawyers said the school deliberately ranked Asian Americans lower on a personal rating use to measure trade such as courage and likeability a lawyer for Harvard denies any discrimination\nThe archdiocese of Washington has published the names of twenty eight clergyman credibly accused of sexually abusing minors as far back as the Nineteen fifties a lot of wise of member station WBUR AMU reports\nOf the twenty eight religious leaders accused and the new report\nSome have multiple accusations of abuse more than half were convicted for their crimes and many have already died\nThe news comes just days after Pope Francis accepted the resignation of archbishop of Washington cardinal Donald Wuerl who's been accused of covering up sexual abuse scandals during his time as the bishop of Pittsburgh\nThe survivors network of those abused by priests criticized the timing of the release a group called the move a quote hastily assembled PR stunt men to distract from worlds resignation for NPR News I'm a lot of lives in Washington\nMany have already died the news comes just days after Pope Francis accepted the resignation of archbishop of Washington cardinal Donald Wuerl who's been accused of covering up sexual abuse scandals during his time as the bishop of Pittsburgh\nThe survivors network that those abused by priests criticized the timing of the release the group called the move a quote hastily assembled PR stunt meant to distract from worlds Frederick nation for NPR News I'm a lot of lives in Washington\nFederal regulators are proposing prescription drug companies to advertise on television they're required to include prices\nHealth and Human Services secretary Alex ... says patients deserve to know what a given drug could cost when they're being told about its benefits and risks a trade group says including the prices could discourage people from seeking medical care I'm nowhere rom NPR News\nSupport for NPR comes from NPR stations other contributors include home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major remodeled homeowners can read reviews of local pros and book appointments online at home at ... dot com\nRooster coup here with view on this chili Monday evening very excited to be here from ten to midnight tonight I have a great\nSet up a music freeze tonight will hit all styles of music and we'll have a lot of funding I a lot of new music\nAll things are coming to Colorado music was an artist from Colorado and all these news except plus more\nAnd uh some fun to start show will be a little bit more of a folk singer songwriter by this first song um you probably know it it's definitely good stuff from the Beatles um my dog got into a little little fight with a raccoon\nThe other night and uh the baby raccoons decided to go in the doghouse so this is a little song about some crazy rocky raccoon from the Beatles off the white album starting off your night on the German radio and care to see where the rooster coup till midnight Ninety One point five the Beatles\nLittle more into buying monitor them to go to their lives and you know name around him were a moon day as ran around with another guy in ... in a row and he did in line that I Want to get a loan\nSo on the wall noon and ...\nStarting off your night on the German radio care to see whether to restrict coup till midnight Ninety One part by the Beatles\nLittle more into buying monitor allowed to go to the live on a ... a long day as ... we're the no the guy in Rocky Mount a rocky and why that is going to get a law\nSo long they walked ... room and the local field in Iraq he wrote to\nJay and do you\nDo fine unions viable\nGlad we gun\nDu da da da du\n...\nBroken his dream\nBuys really de la ... and\nAnd he was not\nMuch you can still do\nBut they're real one new ...\nNow she can mine\nCall themselves\nWell within the next\n\nAround people\nAnd creating green\nIs that these shows\nYou how\nDid he do stand shy\nAnd monkey go there and the gum [noise]\nFinishing up with the brand new album from Jason is bill itself and the unit that sort of live album called life rhyming and the Congress\nFinishing off with the brand new album from Jason Isabel\nIs bell and the for hunting unit that's there live album called life from Ryman and the Cumberland Gap title that song\nAhead of that you heard from the great lakes swimmers if they come back to Colorado that's out there last channels album and the song pulling on line there'll be at a feely is up in Denver on the twenty fourth of October I heard of that Joan Baez are not from Nineteen Seventy five\nOr looking at the cover is actually what my mom looked like in Nineteen Seventy five\nSo diamonds and rest we got started up there a little bit of a folk tribute to a somewhat say Bob Dylan um you know toured and wrote songs with him and spend a good deal of time with him in the late sixties early seventies still activists today she is still touring as well as she hit\nHer seventies she'll be at the paramount theatre\nIt's up off of a sixteen street mall in Denver a paramount leader on October twenty four hours for Joan Baez you'll probably hear that song and are good selection of other ones and since the dog got into it with some beetle some raccoons front of the Beatles you heard rocky raccoon off the white album to start you out for the Monday Night evening music mix\n... we'll be right back for more tunes\nPresident Trump says he's spoken with Saudi Arabia king sound mind about missing journalists democracy Yogi\n... just for the world is watching the world is ... is very important to get to the bottom of it I think he understands that very well what\nCould the into that mean for us Saudi relations on the next MORNING EDITION from NPR News\nTomorrow morning at five AM on Ninety One point five to your cc\n... skiing and you're listening to Ninety One on ... on ... or ...\nCool stuff they're rooster coup in the house just finished with the first music a ton of excellent stuff to come later in this area will hear the brand new atmosphere that I'm very very very excited about parts of new to cause a but in this that we're going to start with a little bit of a curse\nI'm On Ninety One point five to your cc\nMm Hi I'm Chris DOMA king and you're listening to Ninety One point bon ...\nCool stuff their research group in the house just finished with the first music a ton of excellent stuff to come later in this area will hear the brand new atmosphere that I'm very very very excited about plus the new to cause a but in this that we're going to start with a little bit of a\nCurrent rock some new stuff from good good old war as they come back to Colorado to play in Boulder the coup to have a new album out of England a really really fun band that I've been listening to since a teenager a that's a new album play to play as well plus tomorrow and will finish off a little bit on the uh\nA heavier side of things with Allison changing black my super rainbow who I think has the are\nThe best one of the best band Nathan psychedelic rock nowadays\nSo we'll start off with the good old war this is their most recent piece for march of this year there'll be playing again at the Fox theater in Boulder a week from today I think you know a week from yesterday the twenty first that'll be next Sunday good old war Fox theater Boulder, Colorado this is their most recent ... part of you\n[noise] Mm\nMe and my friend\n[noise] um\n[noise] Mm\n[noise] playing the game like we got no man I'm\nYou know I'm\nReading come in the day\nWhen I'm Me and my friends we got no man I'm\nI haven't seen you\nLive at the U.S has a\nGuy in the bowl with someone and uh but down\nThe street in\nMountain View on to try and scaring\nNine days\nIn the sky attend a bad down\nA lot more than\nGun or do we want and\nThen they ...\nKnow a long\n\n\n\n\n\nProbably one of the greatest names in a psychedelic music nowadays black market\n\nProbably the one of the greatest named in a psychedelic music nowadays black ... super rainbow finishing up their that's their album dandelion gun and son lips\nAre good news coming to town the day before Halloween up at the bluebird off the facts in Denver, Colorado\nIt'll be ten thirty October thirtieth of the bluebird it'll be a fun intimate venue Alison change also come in Colorado but even better news for you to come in right here to Colorado Springs will be playing at the pikes peak center not tomorrow not the next day following day that looks like it'll be Thursday the Eighteenth for you guys\nAre definitely would be a fun place to see Allison change for ... live in local and Colorado Springs\nTom Perriello from a Alison change excuse me not from Allison change 'em but he is also coming to Colorado he'll be playing at the gothic theater tomorrow night\nOr down up ... up in a Englewood, Colorado\nHas a solo projects the night watchman in a one man revolution song titled the road I must travel\nNew music in from English English base the cooks really excited to be playing this one that was a fun song kind of going back to their roots a little bit heavier than some of the other songs on this album is far let's go sunshine the title of the song in ... or the album and Pamela the song\nAnd the good old war also coming to Colorado up in Boulder the Fox theater on the twenty first that's their new gp called part of you and you should know\nDemanded to springs library invites you to celebrate Halloween with Gail and use it in stories over Twenty years at the community congregation church of managed to springs more information on the link\nHere the orange gene either this is my little speech Lewis Titus is Johnson from your water the dominant Wally from the motion\nThat each candidate anyone ... he [noise]\nGot a check at the weather here and then we'll get into some more fantastic music here as mentioned the brand new atmosphere a album to be played tonight for the first time not even added to the library quite yet it will be there by the end of the week for sure with Vicky thank you for doing that thank you for\nBrings more information on the link here\nAre\nEither this is my speech Lewis Hi this is Jonathan from your water but the dominant quality from the most at\nMusic steady PMDD anyone ... he he\n[noise] we've got a check at the weather here and then we'll get into some more fantastic music here as mentioned the brand new atmosphere a album to be played tonight for the first time not even added to the library quite yet it will be there\nBy the end of the week for sure with Vicky thank you for doing that thank you for adding a clean album from atmosphere first twenty seven in Colorado Springs that's are low tonight clear skies\nAre pretty much it fall winter kind of weak ahead a sunny but partly cloudy as well tomorrow fifty three and in Chile forty nine and a mostly cloudy on Wednesday Trinidad area right around thirty one and clear your low of twenty four tomorrow fifty one Wednesday cooler again at forty nine\n... rocky Ford area are still a little bit above freezing at thirty five but love twenty three fifty nine and another called for you on Wednesday but fifty seven degrees\nFor the lower river Arkansas valley ... rocky Ford area\nThe Ninety One point five kill your cc news team the meeting was the third for\nScheduled around the country in the end the ban passed on to sixty two so over the past five years officials said a gym recognized for excellence by the Colorado broadcasters association\nAs mentioned I Am very excited to play one of my favorite hip hop rappers in the game today atmosphere or been doing it for quite a long time this is now a third album we have in this brand new off the record charts a record label it is called me Vita local\nBut some great songs on here from the Minnesota wrapper or we're going to hear me how today a and as I mentioned listen to a song and almost made me cry\nAlmost had to listen to it three or four times in a row over a when I first downloaded the album so here it is the brand new atmosphere album me veto local and me home\n[noise]\nSo here it is the brand new atmosphere album me veto local and me\n\nIt was a dark and stormy night\nLevels of rain in\nThe world wide awake and then the traffic on the highway from Abu by the\nI look at my family about to go about trying to blow the more money in the wire and now we're supposed to cover your body but I chose to hold your hand him wanting sunrise\nYou recognize the warning memorized ban morning\nNew to the moon is bad\nBecause they knew about\nIt where my dad enlisted in the in some way I'm going to be any member and\nInherited ... bills like\nYou know my children to bring her\nI'm at a road\nUse them and they know\nLong we have\nI'm a ... million\nLittle and you know\nMoney right now we're trying to\nFind the money you\nI Wish I and I got away with the nature Kate McGee and you learn how to be the line\nI Wonder though the aliens\nMoney right now we're trying to\nFind the money on the line\nI Wish I and I got away nice to meet you Kate McGee and how they live\nOn the mainland cut they they don't mean maintaining still live at the gratification that ... that would change that don't make them to get them at all you don't want to be the bullet that your regular gardening\nLondon on their own perspective but in the end of the can down to jump in the ...\nThe low out of a pile of Kenny the wind is does the dollar and a lot of soul gained a lot of rural Maine you know when I'm Joe\nAround ... million\nUse them and they know\nLong were you\nI'm at a\nSome of them in all\n\n\n\n\n\n\nThen they're stuck with the brand new album for true laws that's life in the city at the same title song the album that looks like it\n\n\n\nFinished up with the brand new album from ... clause that life in the city of St titled song is album that looks like it's going to be a fun one uh to keep playing in the rotation trick clause\nRight ahead of that Tyco as he comes back to Colorado I he'll play I'm sure from that album called a awake\nIt was just on planes Tyco is playing tonight at some music call that'll be on the nineteenth and twentieth of this month October right ahead of that nightmares on wax car boots so with survival they'll also be playing and serve onto our two sets here in Colorado there'll be a ... a\nLittle bit later later next week uh the twenty six and twenty seventh of October\nAhead of that the ... corporation with radio retaliation featuring sleep wonder\nUh same title song as the album\nThe marine Corp will be at the Fillmore on October twenty six\nAnd started off with the good ones are manager that's brand new song and I have to tell you when when songs make you feel something or make you feel emotional or you know that's that's what they're trying to do that song for me that ... that gets me right and it feels a that is me how often the new album from atmosphere\nMeet a local [noise] five\nThis week on MORNING edition in the wake of a sitter political battle Brett Kavanaugh is a Supreme Court justice\nThe Supreme Court as a team of nine and I will always be a team player on the team of nine\nHow will the new court handle some of the country's most divisive issues listening to MORNING EDITION every weekday from NPR News weekday mornings beginning at five on Ninety One point five\nOr so you see [noise] first appeared now just after eleven o'clock eleven o seven we're going to switch tempo Israeli switching to a regular set a music or Julie in my early this third son and a force or the first eleven kids\nA Bob Marley will be playing at the Aggie theater on October twenty fifth so we'll have a regular set of music here's some fun stuff the new album and also for a little bit now from protege and she's up in ...\nSo this you're listening to MORNING EDITION every weekday from NPR News weekday mornings beginning at five or Ninety One point five to\nYour cc rooster coup here now just after eleven o'clock eleven o seven we're going to switch tempers really switching to a regular said music a Jew in my early this third son and a forest or the first eleven kids\nA Bob Marley will be playing at the Aggie theater on October twenty fifth so we'll have a regular set of music here some fun stuff the new album and also for a little bit now from protege and she's up and coming uh making major moves and the reggae\nAh industry a re reggae music scene also here is fun a couple of classic ones in this tit for as much in the promised in started off with protege\nTheir new album from turn Eighteen\nIt's from July it's still pretty new portrait protege with a matter of time\n[noise]\nNow watch no faith make no mold partying and no drugs the money they make you all the ... the ... you're not getting any by the way they get them started in ... named Sean ... remain with their party staged on\nThe other day that he would not poor old die every thought they were the keyboards told not to restart Yardley ... times from China and the need them drugs only ... he was watching a Monet Tony a bona fide destroying them coming off the lights\nWhat it is the most part Donald\nA number of buying you know ... you know\nAre coming up we'll let you know one of the lone\nStar I got\nMain long\nI gave me my you know I Know on Monday\nI'm so glad you knew\nGave me a no ... name\nLong\nI gave you might know a number on\nI'm so glad you didn't\nGive me right now a number on\nI'm so glad you did and then\nWhen they\nVoted for used over all the time\nDay but you know I'm no money\nI'm so glad you did it\nGave me a number ... ...\n[noise]\nMade it out on Monday\nAnd I think when they turn the\nTV and\nI'm so you're you know I Know in the\nYou know I'm not going to\nGive you my number on Monday\nWednesday Thursday Friday and then\nFrom London\nJersey\nStevie ... been in the long way\n\nTo get\nFinishing up in the background than Julian Marley as mentioned the a third in line at the bottom line early signs in fourth of the children on the eleven\nThe Bob Marley kid he's coming back to Fort Collins or does it play as much music he's only done about three albums as a solo artist but there's a bunch of other producing and helping out with his Marlboros and all that other stuff that they all do it through more early and top gong and all that stuff there\nThat is loving clear that's lying in the morning comes back from Nineteen Ninety six\nLooks really young and the cover cable ten reggae legend in there with burn friend and music sizzler offer for rebels as well volume to be strong and got started out with the new music from protege a matter of time and blood money\n\nThis is the mother and your let's do that are cheesy member supports it\nBut now with his Marlboros and all that other stuff that they all do through Marley and tough gong and all that stuff there and that is loving clear that's lying in the morning comes back from Nineteen Ninety six\nLooks really young and the cover Cape attendant reggae legend in there with burn friend and music sizzler offer for rebels as well volume to be strong and got started out with the new music from protege a matter of time and blood money\n[noise]\nThis is the mother and you're listening to the chaos she's the member supports it from afar southern Colorado another New Mexico\n[noise]\n\nBoth President Trump says he's spoken with Saudi Arabia's king sound mind about missing journalists democracy Yogi\nSay this is for the world is watching the world is all said this is very important to get to the bottom of a sad I think he understands that very well flooded\nThe incident mean for us Saudi relations on the next MORNING EDITION from NPR News\nTomorrow morning at five AM on Ninety One point five K. or cc\nHey everybody this is for the faucet this is Krista hello this is Michael from spirit we seem\nTo Ninety One point five K. R. sci fi music seven pm get need Ninety seven Ninety two we\nWere just about over halfway done with the Monday Night evening music mix and DJ driven radio rooster to peer your host fun two sets to finish this off\nI still to come this next ... will be more along the lines of Indy singer songwriters before we gym out with some all awesome alternative rock in the brand new Greta Van fleet album\nOr but first as mentioned a little bit of Indy a little bit of a do it yourself kind of songs here\nA mile a green is going to be the first person they are going to be also playing up at the bluebirds do there and just two days from now on October Seventeen I had been enjoying this album a lot so here's a new one from this album of adult contemporary and my little green\nStarting you off at eleven twenty five on the Monday Night evening music mix I'm rooster coup enjoy\n[noise]\nDays from now on October Seventeen I had been enjoying this album what so here's a new one from this album of adult contemporary and my little green starting you off at eleven twenty five on the Monday Night evening music mix I'm rich to enjoy\n\nThan\nThey used\nPlace\n\nFound\nHim in a [noise]\n[noise]\n...\n[noise] I was having a second chance [noise]\nUh who who sees them\nTo set up for\nPlace [noise] three years down the gym\nSay he is [noise]\n\n\nTeenage boys [noise] Sunni\nMuslims and as it should be [noise]\nYou\nMiss is that on the\n[noise] three years ago\nPlease [noise]\n\n\n\n[noise] you should go return\nPretty active\n\n\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n... sub so\nStreet in food allergy to the super\nFinishing off that second set of the second hour the ... coup a Monday Night evening music mix of joy ... seconds\nQuite a quite a\nSpectacular name their heads his album called shape she's been in the music industry for quite a lot while as a producer he also did a little bit of music making a this is going to be found out when the continue playing a Little Rock blue psychedelic Eric Clapton on this one Norah Jones\nThe ... truck span there'll be a fun out on the plane but that was on the music and that kind of singer singer songwriter indie sat with some fun stuff in there to William fitzsimmons right before that one with mission bill and distant lovers\nPhosphorus into has been in town\nPlayed a years ago at the uh free wheeling music fest at the Bristol bring it let's say love eat with his tail Avi number to\nJohn Grant in there as well that was a fun to pick me up song we'd love his magic and he's got his mother's hips that's a fun song when we play more of that album as well\nI really cool do little chubby dude on the front cover wearing a bird cage on his head as a John cramped can only be John Grant and right ahead of that my little green with an e on the end of green that's adult contemporary they're coming back to Colorado I Believe to play the ... a bluebird theater\nIs correct or seventeenth too short days from now that's a song please don't and they all want there to hang on adult contemporary\nSouthern Colorado's NPR's mission Ninety One point five to your seat you can be with you wherever you go all you needed your smartphone download the free Ninety One point five years cc mobile out and do go play or the ice\nFront cover wearing a bird cage on his head as a John cramped can only be John Grant and right ahead of that my little green with an e on the end of green that's adult contemporary they're coming back to Colorado I Believe to play the ... of Bloomberg theater\nThat is correct or seventeenth too short days from now that's a song please don't and they all on their touring on adult contemporary\nSouthern Colorado's NPR's mission Ninety One point five to your seat you can be with you wherever you go all you need is your smartphone download the free Ninety One point five years cc mobile out Google Play or the I tuned app store\nMemberships or the largest source of funding it Ninety One point five tier cc allowing us to bring you local stories NPR News music thanks for your generous support [noise] rooster coup here\nAre just now eleven forty three more music to come before we finish up the hour with a quick look at whether twenty six to ... a downtown what we're supposed to be twenty seven but it's a twenty six we've already passed that tomorrow fifty three Wednesday cooler forty nine\nHundred areas I write about twenty seven and twenty three Sheila tomorrow a little bit nicer on the lower plains area fifty nine and Wednesday fifty seven\nA woodland park right now twenty three and clear partly cloudy tomorrow and tomorrow night a high tomorrow being thirty six\nA slight an area twenty nine and clear love twenty three tomorrow fifty five and chillier chillier on Wednesday as well\nAt forty nine degrees last set of the Monday Night evening music makes like I said we're going to get to some rock and roll alternative rock nowadays and ... by a her newest album hunter and we'll start off right there\nMonday Night evening music mix Lucia ... said here before the b._b._c.\n[noise] [noise]\n\nDon't lead the [noise]\nIs there really is even\nThough we the\n\nKnow [noise]\n\n\n\n[noise]\n[noise]\nUs\n\n\n[laughter]\nKnow I was young [noise]\n\n\n\n\n\n\nTo be\nOh my\nGod [noise]", "month": "10", "day": "16", "state": "CO", "station": "KRCC"}