{"year": "2018", "show_name": "91.5 KRCC Late Night Music Mix", "city": "Colorado Springs", "content": "To build he was the first caller correctly id taste not taste but taste as the name of the group for which worry Gallagher was the front man\nIt's congrats to Bill thanks to all who called the time to every one just a few mere ... seconds away from the ... here in Ninety One five [noise] so it's almost\nTime for NPR News after that to haul hours of teen owes terrific Titanic and ever tantalizing tunes at ten this is Gigi thanks so much for joining me for this evening's edition of vintage voltage\nWe're going to do it again next Saturday Night here at Ninety One five from eight to ten PM in the meantime I'm reminding you you've got to tune to southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs ... hunter\nCasey see a stark ville and K W C. C. F. M. woodland park streaming at K. R. C. C.\nO. R. G. again a quick recap of what's on the way NPR News and then let's see if I can do it again here\nTina was terrific tantalizing lead to fool some variation on the theme tunes at ten stay tuned for even more\nSupport for Ninety One point five K. R. comes from our listeners and from local organization winery discerning audience that values quality\nThree marketing on Ninety One point five carry the underwriters reached the people most likely to happen there have\nBeen more than a nonprofit\nAnd my ticket has\nTo learn more about corporate important continent seven one nine four seven or eight year old ...\n\nLive from NPR News in Washington I'm Jim hawk\nAs the world reacts with skepticism to the Saudi explanation of the death of writer ... during an alleged fist fight inside the Saudi consulate in Istanbul President Trump is vowing to hear directly from Saudi Arabia's crown prince Mohammed bin Salman\nAl ... says there's a lot of progress is being made that will have an answer by probably ...\nGermany's foreign minister is the latest to say that it's time to rethink the sale of arms to Saudi Arabia something that President Trump wants to avoid hundreds of thousands of protesters poured into London Saturday demanding\nSomething that President Trump wants to avoid\nHundreds of thousands of protesters poured into London Saturday demanding a final say on the terms under which Britain leaves the European Union as NPR's Frank Langfitt reports from London many Britain's are deeply unhappy with Brexit negotiations which are at a stalemate and running out of time\nWith a merger saying the breakfast was promise which included pledges of extra money for health care is turning into a disaster for the United kingdom the European Union's rejected prime minister Theresa May's plans for leaving the U. S. had many in her own party in the u._k. is now at risk of crashing out of the European Union with no deal for a future relationship\nSome protesters want to stay in the EU others hope there will be a deal but want to see the details before signing off prime minister may however has rejected holding another public vote which breakfast here say would be anti democratic Frank Langfitt NPR News London\nAfghan officials say voting will extend into a second day in parliamentary elections after delays in some districts on Saturday Jennifer glass reports from Kabul on the chaotic start to the long awaited elections\nMany polling stations in Afghanistan like this cobble middle school and that technical logistical problems that delayed voting or prevented it altogether polling centers that couldn't operate today are set to open Sunday the latest complication in a parliamentary election that was supposed to take place three years ago\nIn Kabul there've been a number of the explosions and the Taliban and Islamic state threatened voters to stay away but despite problems that included flawed voter list and long lines many Afghans appear determined to cast their ballots thing they'll wait as long as it takes for NPR News I'm Jennifer glass in Kabul\nThe Milwaukee Brewers ran out of luck and the deciding game seven of the national league championship series Saturday Night\nThe Los Angeles Dodgers pulled away and the sixth inning beating Milwaukee five to one of the Dodgers seal the deal and the ninth inning sending their star pitcher quake in ... the pitch in relief and complete the final three outs\nBoston which earlier one the American league championship series will host the Dodgers in game one of the world series on Tuesday night at Fenway Park game Tuesdays in Boston Wednesday nights and moved to LA for game three on friday\nThis is NPR News\nThe Trump Administration is trying to speed and environmental review of western projects that deliver federally subsidized water to farmers\nThe Trump Administration is trying to speed and environmental review of western projects that deliver a federally subsidized water to farmers NPR's Kirk Siegler reports a new memorandum from the president aims to loosen environmental restrictions in western states\nRepublicans going back to the George W. Bush administration has tried to increase water deliveries to farmers in California's massive Central Valley project or water from snow fed reservoirs gets pumped south to arid farmland but those deliveries are perennially cut back due to attempt to protect endangered fish and throughout\nThe president's order would speed up the current review of this as well as to other projects in Oregon and Washington\nIf environmental restrictions are loose and there will likely be a pro long legal battle and one of the biggest champions of this latest plan is deputy interior secretary David Bernhardt used to lobby for the Fresno based west ones water district one of the largest and most influential water agencies in the west\nKirk Siegler NPR News\nTo tropical storms are ... and the Pacific ocean off Mexico and one is forecast to become a hurricane and the approach the country's west coast in the coming week\nTropical storm willow is the twenty first name storm of the Eastern Pacific hurricane season\nThe national Hurricane Center so that it was likely to remain well off the coast through Wednesday when it could approach Mexico's west central mainland as a hurricane tropical storm Sunday foreign friday off the coast of the southern state of the odd as it could produce three to six inches of rain along Mexico's southern Pacific coast and parts of\nGuatemala I'm Jim ... NPR News in Washington\nSupport for NPR comments from NPR stations other contributors include the Kauffman Foundation working together with communities in education and entrepreneurship to create uncommon solutions and empower people to shape their lives and be more successful more online and Hoffman dot org\n\nOver six decades of commercial free public radio broadcast excellence\nThis is southern Colorado's NPR station we are Ninety One point five K. R. C. C. mancino Mindy in with your Chino tunes at ten a couple of hours until midnight commercial free music coming your way also before we get going hear\nChi chi every Saturday Night if you don't catch him at seven\nSharon catch him in age just a blue plate special from seven to eight vintage voltage style\nSaturday Night if you don't catch him seven sure I catch him in age just the loop which special from seven to eight vintage voltage style than H O clock brings Gigi and the legend great vintage will ditch followed by Chino choose to [noise]\nShe did and\nWill do for her\nYou know I think\nYou know we don't know their babies who [noise]\nMy wife and\nMy girlfriend on the way\nI'm Stan ... never been a\nWhile but mostly\nShe came right\nIs that right\nThat's some of them\nAll were\nPhone call or no\n\n\nNa na na\nNa\n\nA mom\nCan see you in the low\n\n\nPart Jo Bonner mosque y'all them don't explain that hard Jo Bonner mom so the song well well\nThe late great Gary more right in the middle of that stuff from his blues alive you're more delivered Parisian walk ways started that shut off ... cannon and the Chicago way chicken from a short joke and his latest separates\nWays started that shut off ... cannon and the Chicago way chicken from a ... latest step for its\nCold or a day the album is called the Chicago way as a matter of fact to we heard was walk it off from Toronto, Canada all here Gino choose Ninety One point five K. R. C. C. we are southern Colorado's NPR station\nSaudi Arabia's checkbook diplomacy written struggling to strike a Brexit deal with time\nRunning out and the creator hit show transparent on allegations against the star I really wish I would have\nImmediately jumped to supporting that and telling their stories rather than going into production about all that and the ... election day Sunday on weekend edition NPR News\nNinety One point five K. or see see\nWhy there is this is my job at the beach boys died this is John ... from the motion and using\nThem to do now you find any one point five K. R. T.\nAnd thank you for being a part of K. R. C. C. N. K. R. C. C. music brought to unite lead to midnight\n\nUm [noise]\n[noise] ... be complex\nUsed them move in them that does and then coming\nYour mom in the kitchen\nAnd kind of ...\nDegrees and now you pass the buck you find that they\nNot that I'm being watched you know who to trust the ground [noise]\nThe way let's see if\nYou had to do our one she sounded then\nA\n...\nThat should be the right you can\nBy chess is rooted in\nThen the thing to me he is it\nSame boat like\nA\nA\nAlso then they\nWill never split miles a gallon here that made a micro vaguely or even married later today\nSunday afternoons at five right here\nOn K. R. C. C. want to set up a loving thirty nine or ten thirty nine rather in the Rocky Mountain west on your Saturday nights the twentieth of October forty one degrees presently in downtown Colorado Springs gorgeous\nFall nights I Hope you're enjoying it\nHow looking for an overnight low of only a thirty seven degrees is going to be nice sober night tomorrow's supposed to be just gorgeous says well let's see a high of Seventy degrees here in the pikes peak region\nAre presently thirty five and let's see no no that's a forty\nChew in Pueblo currently thirty five in divide looking for a a high tomorrow the upper elevations including divide a tellers I tell her as well as cheap ... counties right in the sixty degree markets can be beautiful both Sunday and Monday\nI tell her as well as cheap ... counties right in the sixty degree markets can be beautiful Bowl Sunday and Monday a freezing furloughs uh thirty two degree marking the upper elevation\nFifties or sixties both Sunday and Monday a highly ... to mid fifties the rest of the week lower elevations Pueblo looking ... Seventy four tomorrow Seventy one Monday\nHigh fifties to love mid sixties all week long right joined the pikes peak region Seventy degrees tomorrow sixty six Monday possible storms coming in mid week\nTuesday through Thursday\nRight back into the tune John board but she no men dean and K. R. C. C. Mm\nIt turns out\nCan't imagine here soon\nOur bone\nDry\nCannot get low drones\nOur\nAnd a\nBride no\nCan come oh\nGo\nTo\nGet\nCreative you\nI'm the\nA mile and a\nAnd your heart\nMe a man called\n\n\n\nAnd on\nAnd [laughter] she [laughter] she [laughter]\n\n\nIn his early ...\n\nAnd [laughter]\nAnd [laughter] and [laughter]\nAnd\nAre a\n\n[noise]\nGarbage right here Gino chooses Ninety One five a garbage in their shoe and push chicken from version two point oh again as I back in the house before Bernick ladies William top Lead Belly up givens ...\nWho's the mothers in that at all here Ninety One point five gay ours to see this is southern Colorado's NPR station we are K. R. C. C. K. R. C. C. H. D. Colorado Springs Casey Sheila hunter\nCase CCS dark Bill Gates W cc up in woodland park and streaming around the world K. R. C. C. dot O. R. G. [noise]\nYes you can have great music seven nights a week from seven to midnight I Ninety One point five chance to see [noise]\n\nAnd thank you for being a part of K. R. C. C. music right do you live seven nights a week from southern Joel midnight genome Mindy and here we're glad you have you here on this Saturday Night with me\nBall or who\nOne day they do\nTo me I'm wrong\nSees\nThey chose ... but they changed\nThe eye and on and\nDo a lot of my life that\nProblem for me to me\nShe's", "month": "10", "day": "21", "state": "CO", "station": "KRCC"}