{"year": "2018", "show_name": "91.5 KRCC Late Night Music Mix", "city": "Colorado Springs", "content": "Oh man about perception you\nHuh how men talk about perfection you just heard it jungle from the brand new one forever and the song pray Colombian ahead of that shades of man from ... Toto el moon do\nIn there as well little feet from feats don't fail me now they never do\nRock and roll Dr washed out ahead of that from uh the latest one washed out that goes back to last year Mr mellow floating by and started things off and said his music the last one for this side of your Tuesday evening Jack White\nFrom boarding house to reach and get in the mine shaft\nPresident Trump's choice to lead the department of Veterans Affairs is the official White House doctor admiral Ronny Jackson\nJackson's confirmation hearing has been delayed over questions about his management skills these are serious allegations are ones that are we will certainly want to get through and the proper the challenge of confirming a new chief on the next MORNING EDITION [noise]\nTomorrow morning at five AM on Ninety One point five years bc [noise]\n\nI'm Lisa to sorrow its eye and cofounder of EPA's central co working and the president of the Komen Foundation I've been a member of cares you see\nFor over ten years I Would encourage anyone who listens to care sixty to also become a number you know if you listen you certainly must find the programming valuable I think that we all we care she see to keep up to date on what's going on in our world on snippets our world\nIs really close to us and sometimes it's our world it's much bigger\nJoined Ninety One point five ... years cc dot org\nAnd once again thank you for everybody coming together to make our phone membership drives so successful\nAnd uh so fun and could feel the love at every turn this is southern Colorado's NPR\nStation K. R. C. C. K. R. C. C. H. D. Colorado Springs Kate ... case CCS start feeling K W cc\nFM live in park ... cc that Oric\nFrom NPR News in Washington ... Stevens and attorney for a woman accusing Supreme Court nominee Brett Kavanaugh look past sexual assault is condemning President Trump for making fun of his client NPR's Dr Snyder is more reaction to Trump's remarks at a rally in Mississippi attorney Michael\nC. K. R. C. C. H. D. Colorado Springs Kate ... case CCS start feeling K W cc FM live in park ... CDC data like\nLive from NPR News in Washington ... Stevens and attorney for a woman accusing Supreme Court nominee Brett Kavanaugh look past sexual assault is condemning President Trump for making fun of his client NPR's trial Snyder is more reaction to Trump's remarks at a rally in Mississippi\nAttorney Michael Brown which is responding to President Trump's speech themselves have in Mississippi and what she was cheered by the crowd when he did his version of the back and forth during Christine Blasey Ford's testimony before the Senate Judiciary committee\nWhat was it and I don't know [noise] when I was\nFollowing Trump's speech problem which took to Twitter saying it was a vicious violent soulless attack on Fort gold for to remarkable profile in courage and President Trump a profile in cowardice\nDrop is planning to appear to more campaign rallies this week is he seeks to boost Republicans November's midterms Troy ... NPR News\nSecretary of state Mike Pompeo is heading back to North Korea I'm too advanced talks on denuclearization NPR's Michele Kelemen reports the pump E.O is also said to visit Japan South Korea and China during his weekend trip\nIt's would be Palmdale his fourth trip to North Korea in less than a year and State Department spokesperson Heather Nauert says he hopes to meet the north Korean leader Kim Jong loon who has exchange letters with President Trump\nI haven't been privy to all the letters and the communications uh that have gone back and forth but obviously these conversations are going in the right direction and we felt confident enough to hop on a plane odd to had there to continue the conversation\nNow where it says the U.S wants to other countries to maintain sanctions and pressure on North Korea in the meantime though China and Russia are calling for an easing of sanctions do support diplomacy Michele ... NPR News the state department\nThen chairman Jerome Powell says he sees no need to abandon the central banks policy of gradually raising interest rates about as a policy reflects current economic conditions\nRemain in extraordinary times on the policy of gradual interest rate normalization reflects our first ... will be notable risks that come with an extraordinary time [noise] so it was to extend the current expansion while maintaining maximum employment\nSo China and Russia are calling for an easing of sanctions do support diplomacy Michele ... NPR News the state department\nThen chairman Jerome Powell says he sees no need to abandon the central banks policy of gradually raising interest rates poses a policy reflects current economic conditions will remain\nIn extraordinary times on the policy of gradual interest rate normalization reflects our first bell Sandoval who will be inevitable risks that come with extraordinary times so it was to extend the current expansion pointing maximum employment\nAnd low and stable inflation houses so distraught trying to strike the right balance by not raising interest rates to quickly to avoid recession or too slowly which could lead to higher inflation it made the comments in Boston during a speech to the annual conference of the national association of business economics\nAmazon says it's hiking salaries for all its employees beginning next month bottom earners will make at least Fifteen dollars an hour\nThe e commerce giant also says it intends to push Congress to increase the federal minimum wage which is seven twenty five an hour or less than the amount that Amazon is offering this is NPR News\nThe New York times is reporting that President Trump received at least four hundred Thirteen million dollars from his father or the decades and not just a one million dollar loan he claimed he obtained got started in business\nThe times reporter religious much of the money passed down to Trump and his siblings was the result of tax evasion and outright fraud Charles Harder and attorney for Trump condemns the report calling it extremely inaccurate [noise]\nJury selection is being done in a college basketball bribery case in New York NPR's Barbara ... reports on the first of three federal trial stemming from an FBI investigation into corrupt recruitment practices\nAnd aspiring sports agent and two former Adidas employees are pleading not guilty to wire fraud and wire fraud conspiracy charges in a corruption case involving some big names in college basketball\nThe defendants allegedly lord high school athletes to play basketball at for universities Miami Kansas Louisville and North Carolina state by paying them or their families all those schools are sponsored by Adidas\nThe indictment also alleges that the sports where company expected players to sign with them up on training professional college players are not supposed to accept payment in any form ... NPR News Washington the Democratic mayor\nWhy of fried conspiracy charges in a corruption case involving some big names in college basketball\nThe defendants allegedly lord high school athletes to play basketball at Fordham University of Miami Kansas ... and my Carolina state by paying them or their families\nAll those schools are sponsored by Adidas the indictment also alleges that the sports where company expected players to sign them upon training professional college players are not statistics that payment in any form ... Washington\nThe Democratic mayor of Kansas City Missouri says he's dropping his bid for reelection to deal with post traumatic stress and depression Jason Kander says after eleven years of trying to outline his problems he's decided to confront them\nThe former army intelligence officer says he's become the process of getting treatment on chase Stevens NPR News in Washington\nSupport for NPR comments from NPR stations other contributors include visit St Petersburg Clearwater along Florida's Gulf Coast offering artistic draws including St Pete's Dali museum that you're who collection and the museum of fine arts more ed visits saint Pete Clearwater dot com\nIt's the southern Colorado's NPR station K. R. C. C. cares D. C. H. D. Colorado Springs Casey see the hunter Casey's start feeling K W CCF in woodland park\nAnd we're streaming as always that cares cc dot O. R. G.\nWells Tuesday night and we are now in the month of October and this is the late night music mix with your host doctor to your music master special thanks to DJ Jason for sitting in for me last week I was able to catch some of his show on our on demand music app and it was some good stuff I Hope you enjoy that as well also special things of course to our friend and neighbor Vicki\nFor oil he's having a great set of music before my show and the reason I wasn't here last week was that I was at the bat concert at red rocks which was very good and we're going to play a couple of songs that he played there on in this first set and tonight we're going to be celebrating quite a few birthdays and\nAlbum anniversaries what should be fine we'll mix in some new music\nAbout we're going to start things off with a a rather somber anniversary on this day is a lot of nice birthdays including staying ah that ah Vicki play the police I'm going to play some different things we're staying towards the end of this hour but today is the one year anniversary of the sudden death of\nLegendary Tom Petty and there's a new album that bin ... and make him look put together\nIn this first step in tonight we're going to be celebrating quite a few birthdays and element of our series which should be fine mix in some new music\nAbout we're going to start things off with uh the weather's somber anniversary on this day is a lot of nice birthdays including sting uh that uh Vicki play the police I'm going to play some different things we're staying toward the end of this hour but today is the one year anniversary of the sudden death the\nLegendary Tom Petty and his new album that been tension and make him look put together a some remakes excuse me some re mixes and alternate tracts of some of his songs\nAnd live ones and I wanted to start tonight with a tribute to like read Tom Petty here on any one point five care cc [noise]\nWell [noise] well\n\n\nNo we now know\nNot allowed\n\nWhen you see when you\nDay\nAnd\nYou see you got to make it a\nUm\n\nShe said the first set of the Tuesday late night music mix with San Francisco based jelly fish great band that unfortunately put two albums out in the early nineties and the kind of a quintessential power pop band this was as close to hit that they had\nIn Nineteen Ninety One and that was that his wife from their debut album belly button I played that because two of the members of jellyfish\nRoger remaining junior and Jason Fox\nOr who were on this album playing keyboards and guitar and background vocals were performing with back which made it a great night with the with such a they had been passed to ban and those two are a big part of that\nBefore that we heard a couple of songs from back then he played in the concert a red rock to hurt hell yes from where oh\nAnd we heard they're coming from the information we started things off with a tribute to the late great Tom Petty a one year ago today it's hard to believe he left us way too soon and that is from this new album put together by his friends and family an American treasure and you heard I won't back down and\nThis week on MORNING edition Brett Kavanaugh is returning to Capitol Hill to respond to allegations of sexual assault really that you there's testimony the railing confirmation spring\nQuite we got two people involved and to people ought to be able to present their stories and then we'll have to be the jury\nListening to MORNING EDITION every we came from the NPR\nMornings beginning at five on Ninety One point five to your cc is currently sixty three degrees still pretty nice out here on October second\nThis week on MORNING edition Brett Kavanaugh is returning to Capitol Hill to respond to allegations\nOf sexual assault believing users testimony the railing confirmation spring\nMorning we got two people involved into people ought to be able to present their stories and then we'll have to be the jury\nListening to MORNING EDITION every week on the NPR\nWeekday mornings beginning at five on Ninety One point five to your cc\nIs currently sixty three degrees still pretty nice out here on October second\nTwo thousand Eighteen will have a little more looked at the weather\nIn the ... after this next set of music and was that he might have supported the precipitation and cooler temperatures as we get towards the weekend here on any one point five care see see if you're just tuned in is the Tuesday late night music mixes Dr T hanging with you I mean you're most Tuesday nights appreciate your staying up and finish up your Tuesday and getting ready for Wednesday\nHere on Ninety One point five care see see this next to the music or we're gonna play some new stuff from a group I like quite a bit out of England\nAnd that is mere Abou state it's their second release we just got it into the studio and I'm very excited about that maybe I'll miss kingdom in color\nOr end before and we're also going to hear a song from their first album called portraits but before that we are going to start things off with the brand new song from the Eighteenth studio album of Paul McCartney which right eight they made a lot of albums with other folks\nAnd with wings and the Beatles of course but there's is officially his Eighteenth with just Paul McCartney on the album name of the elements Egypt Station and here's a song for that to start this next set of music here on any one point five care cc\n[noise]\n\n\n\nThat these people\nIn Asia that they're\nPleasure [noise] wow\nShore [noise]\n[noise]\n[noise]\n\n[noise]\nNo\n\n[noise]\n[noise]\nFinish a set of music with classic the human leak from their actual third album but the one that put them\nIn the a musical world really and that there would be great single don't you want me up played that in part because today is the birthday of Philip ... front man and the man so you know in that part\nUh he was born this day in Nineteen fifty five and if you hang with me to the next the top of the next hour after eleven I'm going to have another kind of a birthday bonanza set of economic and featuring sting whose birthday is today probably the most famous and he's also featured in the day in life which here at the end of the show just before midnight\nThe always wonderful musical anthology from Colorado College\nBefore the human league we heard two songs from Arab state which is an English band is put together by two folks I'm kind of an electric music duo names are ... album um [noise] that's just been released but we heard from their debut album portraits with the really cool song the clown featuring but extreme on vocals\nAnd before that the brand new album kingdoms in color we heard the song nervous ticks which features Holly Walker who's a frequent guest vocalist for Merrill blue state and we start things off with the brand new Paul McCartney album each station with a nice song who cares\nAll pikes peak greens presents together at the table or community meal and discussions celebrating the themes of this year's all pikes peak read selections event happens October seventh library more information on the changing our Lincoln or CC's got orange gene\nBut as tree in on vocals and before that the brand new album kingdoms in color we heard the song nervous ticks which features Holly Walker who's a frequent guest vocalist for marrow boo state and we start things off with a brand new Paul McCartney album each station with a nice song who cares\nAnd all ... greens present together at the table a community meal and discussions celebrating the themes of this year's ... read selections that happens October seventh library more information on the ... pound and Lincoln or CC's orange gene\nEither this is my speech Lewis Hi this is Jonathan from your water than the dominant slowly from the most at\nSeventeen engineered now anyone ... he\nIs currently ten forty one here on October second before we get back to the last set of music of the first of two hours here on your\nTuesday lead on music ... take a quick look at that and whether said it's a we dropped a couple of degrees since our last set believe it or not I said sixty three at the start of this is that we just finished now we're down to sixty one so temperatures drop it a little bit fifty five overnight in Colorado Springs a higher eighty two and sunny them are looking really good\nA shower starts coming Wednesday night and then that continues to Thursday a and then kind of off and on showers and temperatures in the sixties and then\nThings get really chilly friday and Saturday Night and Saturday looking like only a high of fifty four so temperatures are starting to drop a little bit more fall like whether how about ... hunter will hire a little lower elevation it's going to be Ninety One tomorrow that's actually Seventy right now\nCan mostly sunny and in the rain a forecast starts to come in Wednesday\nAnd friday looks pretty good and want to and then dropped to sixty on Saturday still not too bad how 'bout canyon city at sixty nine and fair right now eighty five and sunny tomorrow with the same trend Somerset petition coming on Wednesday and Thursday and then cooling off considerably on Saturday\nAnd let's go up the past woodland park high elevation the eighty five hundred feet at the city above the clouds where it's currently fifty three degrees Seventy two not too bad but then rain comes a little early at the woodland park thirty percent tomorrow in fifty percent overnight with a low forty two\nThen it starts to get cool in the evenings in the thirties\nAnd there might even be a little chance of snow showers some time on Saturday evening or Saturday Night in woodland park\nSo temperatures starting to get a little cool and fall seasonal we can hang on with that can't we are a good let's get back to this uh last set of the first hour\nGo up the past when the park high elevation the eighty five hundred feet at the city above the clouds where it's currently fifty three degrees Seventy two not too bad but then rain comes a little early at the woodland park thirty percent tomorrow in fifty percent overnight with a low forty two then it starts to get cool in the evenings in the thirties\nAnd there might even be a little chance of snow showers sometime on Saturday evening or Saturday Night in woodland park\nSo temperatures starting to get a little cool and fall seasonal we can hang in with that can't we are a good let's get back to this uh last set of the first hour and I'm going to start things with a brand new from a group that I like about a lot Deb Heinz is the main person behind that blood orange it's brand new\nYou know the name of the aisle ms negro swan and just like you know quite a bit trying to play as much as I can when the show's ear on Tuesday or we'll also hear brand new from the ... factory and will celebrate an anniversary of a classic song from Elton John that this ... turns forty five years in a couple of days so let's start things off\nHere's blood orange on Ninety One point five K. R. C. C. [noise]\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\nSo young\n[noise]\nI'm going to be you\nAll these\nYears I don't think you\n\nKnow\nAnd then I learned so much for the [noise] the burden on the show and then\nThe phone call\n[laughter]\nGoing on [noise] the time to\nBe\n\nNot\nOr woman in the\nMiddle East I mean the thing you\nKnow\n\n[noise]\n\nCool [noise]\n\n[noise] ...\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\nAnd\nSo [noise]\n\n\n\n\n\nJust crossed the eleven o'clock hour here on Ninety One point five care see see we just finished a set of music you're on the Tuesday late night music mix we started that separate brand new blood orange with the song St love and that stuff after that also brand new from the California psychedelic rock\nA band that just doing some great stuff it sounds like Nineteen sixty eight but it\nAlso sounds wonderful here in two thousand they ... factory with the song shame on you after that to help those welcome in the month of October we heard the song October by broken bills a nice little song though I don't think they actually mentioned the actual uh\nNinety One point five care see see we just finished a set of music here on the Tuesday late night music mix we started that separate brand new blood orange with the song St love and that stuff after that also brand new from the California psychedelic rock a band that just doing some great stuff it sounds like Nineteen sixty eight but it is\nAlso sounds wonderful here in two thousand Eighteen at the creation factory\nWith the song shame on you after that to help us welcome in the month of October we heard the song October by broken bells a nice little song though I don't think they actually mentioned the actual ... a month\nWill say we're going to do another one that actually does mentioned the month October do in our second hours so they can stay up for that after that from TV on the radio\nThere are two thousand eight album was just passed a ten year anniversary I think it's a pound for pound their best album is called dear science you heard the song crying and which is a a departure from the normal a lead singer tuned the other day and this has kept Malone singing vocals great stuff there from KIPP\nAnd we finished things off with a forty fifth anniversary celebration of Elton John seventh studio album and that's the title track to the classic goodbye yellow brick road\nPresident Trump's choice to lead the department of Veterans Affairs official White House doctor admiral Ronny Jackson's confirmation hearing has been delayed over questions about his management skills these are serious allegations and their ones that are we will certainly want to get through and that proper challenges\nConfirming a new chief on the next MORNING EDITION [noise]\nTomorrow morning at five AM on Ninety One point five K. R. C. C. [noise]\nIt is eleven o two on southern Colorado's NPR station care cc care C. C. H. D. Colorado Springs Casey the hunter Casey see us start grilling K W C. C. F. M. woodland park\nAnd we're streaming as always that care C. C. dot O. R. G. if you're just tuned in this is the late night music next Tuesday edition\nAnd you're hanging with Dr to your music master hope you can spend a little more time up through the midnight hour here on Ninety One point five care see see it's always a joy to spend my Tuesday evenings with you out there\nSo folks were going to start the second set of music here on the late night music mix with a birthday celebration of one Gordon Sumner who was born this day in Nineteen fifty one October second but we know him as staying the singer songwriter and of course the police fame and settling\nThis is the late night music next Tuesday edition and you're hanging with Dr to your music master hope you can spend a little more time up through the midnight hour here on Ninety One point five care cc it's always a joy to spend my Tuesday evenings with you out there\nSo folks were going to start the second set of music here on the late night music mix with a birthday celebration of one Gordon Sumner who was born in this day in Nineteen fifty one October second but we know him as staying the singer songwriter\nAnd of course the police famous that a lot of solar work and just recently put an album out with reggae legend shaggy which are going to play in this study music\nAnd are for the neighbor Becker played a song from the police in her a set of music before me from seven to ten\nSo we know a lot of ... music and police I tried to pick a couple of things that are a little uh different\nUh quitting one from his salt solo album and a Bob Dylan cover we're going to start things off with that from staying here on Ninety One point five care see see we're also going to hear birthday celebration songs from a gentleman um [noise] named uh\nUm who's who goes by badly drawn boy it's his birthday today we'll hear a song from that and Gillian Welch the wonderful Americana roots artist here that was just a red rock this summer as well [noise] without further ado happy birthday staying on Ninety One point five care cc\nMm Mm Mm\nYou're traveling the country for\n[noise]\nJust\n[noise]\n... me to use\nThe [noise] in\nBushy once saw St food in\n[noise]\nFuel Lou into\n[noise]\nThe ruse fees\n[noise]\nBefore she was saying true in\nIn in in\nThis field for when we're in a\nIn a rural\nRoad rules too soon\nTo be a\nPolice see she has\nThe codes for\n... for\nMe um yeah\nIt's\nA more alert is she remembers all over\nThe\nMinutes are\nUp to ... you know I'm\nA dog there is a\nDay\n[noise] Mm\nUpper class or a\n...\nA\nFew or traveling the country for\nThe women to serve in the law in\nThe\nGreen room we truly one who is the\nFirst\nShe was saw truth burgers\n[noise] [noise]\n[noise]\n[noise]\nSeven hours on a show\nYou know who she was saw two new ...\n[noise]\n[noise]\n\n[noise]\nHe was a shoo [noise]\nShe simply [noise]\nShe simply [noise]\nUsed to be able to [noise]\nOh I don't mean to ensure my options about the war in\n[noise]\nSee [noise]\n\n\nVersus speak to my\nReally my\nMinor\nLeague right oh man but you\nKnow\n\nTo really\nMatter how\nBig a man can be bad\nFor\n\n\nSee them and\nDon't know how\nLong we\nAre\n\nBoth\nThe ball or spin re re\nBy men than\n\n\n\nRat bones we see what we think\nThat man I'm Bad they pass\nBy\n\nUm he's the\nMan I'm Me\n\nMe me me\n\n[noise] okay kind of weird and they're sorry about that that was the end of this set of music and that is Gillian Welch for six white horses from the ... and the harvest\nReally great album from two thousand eleven and that was part of our birthday extravaganza of that set to start to the eleven o'clock hour all those folks had birthdays that we played\nIn ... birthday was today in Nineteen sixty seven so happy fifty first birthday to her singing with her musical partner David Rawlings of course before that\nBadly drawn boy from the uh about a boy soundtrack with a great song Eliot Smith asked would you say something to talk about and his name is David ... um and he was born to stay in Nineteen sixty nine so he is forty nine years old today\nAnd we started things off with some songs celebrating stings birthday with this day in Nineteen fifty one\nAnd we heard morning this coming from his a collaborative album was shaggy stinking shaggy\nCalled for for slash eight seven six\nWhich has to do with the area codes of England in Jamaica that connect those two folks for that or something I like quite a bit off of his fourth solo album ten ... to the song seven days very catchy there also find that makes reference to every little thing she does his magic about the uh\nEnd up a point right pouring wet in the umbrella love that one and we started things off with his take on a Bob Dylan classic\nIt's coming from his a collaborative album was shaggy stinking shaggy called for for slash eight seven six which has to do with the area codes of England in Jamaica that connect those two folks\nFor that or something I like quite a bit off of his fourth solo album tens ... tale the song seven days very catchy there also funded makes reference to every little thing she does this magic about the uh\nEnd up a point right pouring wet in the umbrella love that one and we started things off with his take on a Bob Dylan classic girl from the north country from the album chimes of freedom the songs of Bob Dylan honoring fifty years of Amnesty International and great version by sting\nPresident Trump's choice to lead the department of Veterans Affairs in the official White House doctor admiral Ronny Jackson\nConfirmation hearing has been delayed over questions about his management skills these are serious allegations and there are ones that are we will certainly want to get through and that proper challenges confirming a new chief and the next MORNING EDITION [noise]\nTomorrow morning at five AM on Ninety One point five K. R. C. C. [noise]\n\nHey everybody does it through the foster ... hello this is Michael from Trump spirit we seem\nTo Ninety One point five K. I. C. C. music having PMDD midnight having nights a week [noise]\nIt is less than twenty four here on the one point five care cc we continue to drop a few degrees warmer down to fifty nine degrees one last check out the weather after this next set of music and that was a long a first I'd hope you enjoyed it so we're going to get right back to it and we're gonna start things off with a brand new album from\nAmy Ray one of the two Indigo Girls and we'll also hear a an album that we've had in the ... for a while it's Indigo Girls live with the University of Colorado Symphony orchestra so we'll start things off with some mental Indigo Girls it's a brand new from Amy Ray a lot of routes he kind of stuff good stuff from her\nAnd I will see where that takes us on this next set of music you're on Ninety One point five K. R. C. C.\nThat's good stuff for her and we'll see where that takes us on this next set of music you're Ninety One point five years you see oh\nDo you do in\n\nOh buddy shall we used to\nDo but [noise]\n[noise]\n\n\nBut in\n[noise] [noise]\n\n\n\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise] it sounds as fresh as it did when it was released in Nineteen Seventy seven that's Richard Hell when the voyage from their upon them as an album excuse me from blank generation at the title track from that excuse me that her debut album from Nineteen Seventy seven replay that because Richard ... birthday is today Nineteen forty nine he was born in this day\nOctober second happy ... birthday to Mr hell before that Nick Hayward over a used to be a haircut one hundred has made a lot of really great solo albums and single\nAnd this is one of his most more famous singles nuts whistle down the wind before that we've got a couple of songs featuring Amy Ray of the Indigo Girls we heard kids beers wicker partner Emily sailors\nAt the Indigo Girls live with the University of Colorado Symphony orchestra reached up their kids fears which is originally from Nineteen eighty one the palm of his album Indigo Girls and we started things off with Amy's brand new solo album called holler with the very catchy roots these songs sure feels good anyway\nHi I'm ... I mean your membership manager here in Ninety One point five years since the on behalf of all of us are stationed thank you for your support your ball membership drives could not do that\nIndigo Girls we heard kid fears with her partner Emily sailors at the Indigo Girls live with the University of Colorado Symphony orchestra great stuff their kids fears which is originally from Nineteen eighty one upon them his album Indigo Girls\nAnd we started things off with Amy's brand new solo album called holler with the very catchy roots these songs sure feels good anyway\n[noise] I I ... the membership manager here in Ninety One point five years on behalf of all of us here at the station thank you for your support for membership drives to not do this for gotcha [noise]\n\nMemberships or the largest source of funding at Ninety One point five K. R. C. C. allowing us to bring you local stories NPR News in music thanks for your generous support\nBefore we hit the weather uh in the pikes peak region we're going to have a brief announcement from the emergency alert system here on Ninety One point five care cc\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\nOh right let's get back to the weather here on Ninety One point five\nR. C. C. and it's looking like it's around fifty nine degrees here in Colorado Springs studio and let's see what's going to be happening sunny tomorrow in eighty two here in the springs looking pretty good deal more rain starts to check in on Wednesday and Thursday\nAnd then by Saturday we're down to the fifties and the fall weather is upon us\nAnd uh that's in Colorado Springs how 'bout in Pueblo the steel city it's currently still sixty eight warm degrees tomorrow eighty nine and sunny [noise] listen showers Wednesday night carrying over to Thursday\nAnd friday looking great Seventy five but then it drops down to sixty degrees and some rain on Saturday and how 'bout satellite at where it's currently fifty five degrees tomorrow Seventy five and mostly sunny again rank creeping in on Wednesday and Thursday back to Sonny Bono cooler temperatures on friday sixty eight\nThursday and then by Saturday we're down to the fifties and the fall weather is upon us\nAnd that's in Colorado Springs how 'bout in Pueblo the steel city it's currently still sixty eight warm degrees tomorrow eighty nine and sunny [noise] listen showers Wednesday night carrying over to Thursday\nAnd friday looking great Seventy five but then it drops down to sixty degrees and some rain on Saturday and how 'bout satellite at where it's currently fifty five degrees tomorrow Seventy five but mostly sunny again Rene creeping in on Wednesday and Thursday back the sunny but cooler temperatures on friday sixty eight\nAnd a cooler temperatures happening on Saturday with some rain here in the ... region so Tamara looks pretty nice then rain comes in for all we need some little precipitation friday looking great\nAnd then Saturday a little cooler temperatures and ... and your high elevations you might even get a little bit of snow sometime on Saturday evening\nI write folks it's eleven forty three on the Tuesday late night music mix of hope you've enjoyed hanging out with me doctor to your music master as I usually here on Tuesdays we're going to do our last set of music which will lead us up to a day in the life\nAnd we started this study music with the British celebration for staying and the day in the life will talk a little bit more about that that a young man who had his birthday today\nRight this last set of music we're going to start with our last birthday of many we've had a sting Richard how a Phillip ... of the human league Gillian Welsh\nAnd Damon golf of badly drawn boy and they were going to finish things off with genesis one of the ... one of the founding members of genesis the bass player and guitars that's my record and he turned his birthday today he was born this day in Nineteen fifty\nMike rather for going to play a song from the economists genesis album from Nineteen eighty three which in a couple of days we'll be celebrating this thirty fifth anniversary hope you enjoy this then we'll also hear the brand new limb and Neal Finn album and we'll see where that takes us up to midnight enjoy [noise]\nNo one yeah we'll see where that takes us up to midnight joy\n[noise]\nDa da\n\n\n[noise]\n\n\n\n", "month": "10", "day": "03", "state": "CO", "station": "KRCC"}