{"year": "2018", "show_name": "91.5 KRCC Late Night Music Mix", "city": "Colorado Springs", "content": "Five K. R. C. C. and starting\nIt all off with metric brand new called our of doubt and the sun dark Saturday that metric record is doing extremely well a nationwide coast to coast some great stuff on that from Emily Haynes and friends\nJack White following and the title track to blunder bus in there as well St Vincent from mass production and loss ages\nAnd a companion record uh hopefully we're going to get here sooner than later which is the acoustic version of a lot of those songs it's not all of them so you'll be the first to know mom but a stereo in there from their volume one record\nSome great music from them and and when we did the world music series uh one of the the bans in performances that people still talk about to this day Jupiter in our quest wrapping up the set with how low\nAnd you'll find that on their brand new record chin sonic\nThe midterm elections are coming soon the results could influence the nation for the next decade stakes are high at NPR and all things considered are covering national trends [noise]\nYou won't just tell you who wins will tell you why it matters listen to all things considered the you're the bigger picture every afternoon from NPR News [noise]\nAfternoons at three thirty Ninety One point five ...\n\nIf you are looking for something to do in the Ninety One point for our care see listening area check out the community counseling care she see that orgy and you can submit your event there as well [noise]\nThis is southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs K. E. C. C. ... case CCS start feeling he WC C. F. M. woodland park streaming at K. her cc\nDied or coming right on up NPR hourly news and DJ probe\nFrom NPR News in Washington I'm Joe park in the aftermath of hurricane Michael hundreds of thousands of people are waiting for the power to come back on from Florida to South Carolina but the biggest damage was done to the small coastal town of Mexico Beach Florida resident from Bose\nKate ... ... ... the the FM woodland park streaming I can see the God or\nComing up NPR our leaning and DJ proud live\nFrom NPR News in Washington I'm Jim hawk in the aftermath of hurricane Michael hundreds of thousands of people are waiting for the power to come back on from Florida to South Carolina but the biggest damage was done to the small coastal town of Mexico Beach Florida resident friend ... says most of our neighborhood was wiped out\nTotal devastation\nThe piece of property if it is and got something wrong with that at the level\nThings that we're we're on the beach are now on the other side of history\nTropical storm Michael continues moving nor of eastward off the Virginia coast after bringing damaging winds and flash flooding the portions of North Carolina and the southern mid Atlantic region\nMany people in Florida Field to evacuate before Michael hit the Pentagon handle NPR's Rebecca Hersher reports on when the officers finds counties in that part of the state or poorly prepared for a massive accusations\nResearchers at Florida Atlantic University analyzed the evacuation plan for all sixty seven counties in Florida\nThings like whether people with special needs could register with the county whether there were pickup locations for residents who don't have cars whether there was a plan for evacuating pets and whether evacuation maps were available to the public the researchers found that ten Florida counties have weak plan meaning they're poorly prepared to handle mass\nEvacuations before hurricanes or during other disasters all of those counties are in the Florida Panhandle in all only a third of counties in the Florida Panhandle have strong evacuation plans to fight threats from hurricane Rebecca Hersher NPR News\nPresident Trump says results of an investigation into the disappearance of Saudi journalist ... may be released soon in the meantime NPR's Ayesha Rascoe reports Trump is pushing back against cold from Congress for his administration to stop arms sales to Saudi Arabia\nTrump says the U.S will take action against Saudi Arabia is determined that Saudi harm democracy ... but he that he does not want to impose sanctions that will prevent the Saudi Government from buying US military equipment\nDon't like the concept of stopping and investment of a hundred and ten billion dollars into the United states\nAnd then the disappearance of Saudi journalist ... may be released soon in the meantime NPR's Ayesha Rascoe reports Trump is pushing back against called from Congress for his administration to stop arms sales to Saudi Arabia\nTrump says the U.S will take action against Saudi Arabia is it the time and that Saudi harm democracy ... but he that he does not want to impose sanctions that will prevent the Saudi Government from buying US military equipment\nI don't like the concept of stopping and investment of a hundred and ten million dollars into the United states because you know what they're going to do they're going to take that money to spend it or Russia or China or someplace else\nTrump said there are other ways to punish the Saudis though he didn't offer any examples Ayesha Rascoe NPR News the White House\nUs stocks saying more than two percent Thursday the second day of steep declines around the globe driven by concerns about rising interest rates and trade tensions that could slow economic growth\nThe Dow Jones industrial average fell five hundred forty five points after dropping eight hundred thirty one points Wednesday yes and the five hundred who is also down more than five percent over\nThe past two days this is NPR News\nA new report concludes that the Syrian deliveries of increased at an alarming rate worldwide as NPR's Michaeleen Doucleff reports the rise as putting women and babies at risk\nSince Nineteen Ninety the greatest the Saxons around the world has more than tripled from six percent to twenty percent in several regions like parts of Latin America southeast chair in China C sections now outnumber traditional delivery at private hospitals the rates can store up to Seventy to eighty percent\nScientists writing in the Lancet journal say this ride it mainly due to an increase elected the sanctions that are medically necessary that bring more money to hospitals these procedures rate a woman's risk of death and life threatening complications such is leading in hysterectomy\nTo start reducing the C section rate researchers say hospitals need to pay doctors just as much for traditional deliveries and they do for Syrians\n... NPR News\nWashington Supreme Court unanimously struck down the state's death penalty Thursday making up the twenty of state to do away with capital punishment in the past Fifteen Years seven states Connecticut Delaware Illinois Maryland New Jersey New Mexico and New York have abandoned capital punishment through court or\nTightening complications meeting in hysterectomy to start reducing C section rate researchers say hospitals need to pay doctors jak it's match for traditional deliveries and they do for Syrians ... NPR News\nWashington the Supreme Court unanimously struck down the state's death penalty Thursday making at the twenty of state to do away with capital punishment\nIn the past Fifteen Years seven states Connecticut Delaware Illinois Maryland New Jersey and New Mexico and New York have abandoned capital punishment through court order or legislative acts and street Colorado Oregon Pennsylvania have adopted moratoriums\nTexas continues to execute more prisoners than any other state one hundred eight since two thousand ten Florida has executed twenty eight Georgia twenty six\nAnd Oklahoma Twenty one in that same timeframe I'm Jim ... NPR News in Washington\nSupport for NPR comes from dream wave maker of luxury massage chair from Japan with Shiites viewpoint detection and sixteen program to massage news including morning night and stretch fashion retailers nationwide more dream wave chair dot com Andy any ... foundation\n... lovely to have you along my name is DJ probe and welcome to be the stay late night music makes on this the eleventh day of October two thousand and Eighteen ten of six PM in the mounting time zone here\nOn Ninety One point five K. R. C. C. at sip of field DJ hats to a friend and neighbor Vicki for a wonderful pasta three hours and if you happen to miss any of the key show just go to our website chaos C. C. dot org click on the next one point five music type\nAnd then you will see music on demand and you can relive order the music shows here it's wonderful stationed over the pasta fourteen days to my wonderful here is Mr Gary more\nBut part of the day it's a wonderful here is Mr Gary ...\nTry to\nKnow you\nTrying to\nYou do do do do do do the kinks kind of a ... for months will he'll be elites ahead of Ray Davies and Americans new music forms you meet your Copeland and kicking things off lifted from our ... our separate ways from\nGary ...\nYeah do do do do do do the kings have a cup of tea there for months will heal Billy's head of Ray Davies and co Americans new music from she Mika Copeland and kicking things off lifted from our ... our separate ways from Gary\nMall one voter in a poor Kentucky counties that she is doing well under President Trump and she said those still in poverty should work their way\nOut there some people that are just terrible life it kills me just because I Do work for everything I have her vote in November could help determine control of the house a view of the midterms from three corners of the Kentucky district that's on the next MORNING EDITION from NPR News\nThe moral morning at five AM on Ninety One point five\nKey or see see why there is this is Mike live at the beach boys died this is John ... is the dominant falling from the most at\nThe end the menu and ...\nAnd ... D J ... here at one point five K. C. C. thank you so much for listening along to me downtown Colorado Springs ... reporting stood cheap for degrees we have a mall in debt for costs coming up around about twenty minutes to\nEleven next eleven PM of cool and the mounting time is on\nAlright coming up in this next set of music music from the cooks a bit of Mr Bush didn't but we're gonna kick things off here\nWith something from Cousteau [noise]\nWhen a lot\nDo you go to see me\nDa da da da da da da da da\nNa [noise]\n...\nGo just stuff directly in the English beach never die lifted from the brand new here we go love release ahead of saving ...\nTrumpet lifted formed the will to boys Nineteen eighty five release this is the C make you feel my love you probably recognize that one for miss Adele but\nHe rotates and ... it's a book doesn't take informed climb out of mind you need the care not one point five chaos CC from the kooks wait all the world\nAnd kicking things off here with the second sets all be new for me DJ ... but lost a good day up here from ... to ...\nEngineer from NAFTA at the forefront of Mars exploration will share his enthusiasm for unraveling the mysteries of space\nSee make you feel my love you probably recognize that one from miss Adele butts he\nRotates and he performed at first I spoke Dylan taken from time out of mind new music here Ninety One point five Kelsey see from the coup swayed all the world\nAnd kicking things off here with the second sets of the nation from me DJ probe last day of the year from Cousteau\nEngineer from NASA at the forefront of Mars exploration will share his enthusiasm for unraveling the mysteries of space and Mars in particular over twenty six the incentive for the arts for information on the calendar link at our C. C.\nDot ORG everybody this is the five ... hello this is Michael from spirit\nIn Ninety One point five K. I. C. ... having PMDD meeting having ...\nThat's right hello to just turn it in my name is DJ ... and ... for selecting Ninety One point five K. C. C.\nOn you'll music dial or maybe you're listening to me on the world Wide Web at KFC C. dot org thank you so very very much for that at the apple currently sets the eight degrees partly cloudy downtown Colorado Springs opposing Seventy four degrees\nWe are looking for an overnight low a thirty three for the springs on the partly cloudy sky tomorrow that's friday the lessons of October looking for sunny sunny skies are behind their fifty eight degrees\nAnd uh we base of wind in the afternoon of feet ten miles per hour\nVariety Denver ... degrees currently with a few clouds around so the national weather service tells me\nOvernight low for you then but and surrounding areas such six degrees and the most economists guys tomorrow it's going to be sunny sixty one degrees Trinidad hello\nGood evening to all of our listeners in and around Trinidad and the seven most parts of Colorado and we have a fair fast guys huge Trinidad forty two degrees overnight low or forty degrees most cloudy\nAnd tomorrow it's going to be mostly sunny it with a high of sixty two degrees\nAnd also for you a piece of wind in the afternoon of ten miles per hour variety looking ahead Trinidad and Colorado Springs to Sunday well that's when things change\nHello good evening to all of us is in and around Trinidad and the seven most parts of Colorado and we have a fast fast guys huge Trinidad forty two degrees open I Know a forty degrees most cloudy\nAnd tomorrow it could be mostly sunny with a high of sixty two degrees\nAnd also for you a piece of wind in the afternoon no fee ten miles per hour barrage he looking ahead Trinidad and Colorado Springs to Sunday\nWell that's when things change a bit Trinidad you're looking at a higher twenty seven with anyway after three to\nSeven inches of snow for the springs a high of twenty five one to three inches of snow and for you to him but the national weather service at this moment sign a saying that snow is likely but I don't have\nA uh any debts of that yet when it comes to inches All right thank you so much again for listening to me we've got new music ... brand new music in fact from your Rao Thomas\n[noise]\nLetter\nA little\nOr\nNo\nCome home and my\nAnd [noise]\nUm [noise]\n\nSpeed\nWe\nYes and you can also go to our website chaos C. C. dot org where you can find on below cool\nThe nation national excuse me and the international news from NPR and the BBC ... one point five times that very you will find music on demand that's on the show's music shows or the palm fourteen days\n[noise] yes and you can also go to our website chaos C. C. dot org where you can find on the local\nThe nation national excuse me and the international news some NPR and the BBC curriculum that Ninety One point five top that very you'll find music on demand that's on the show's music shows of it upon fourteen days you can relive and also\nThere is not an option now which is the on ... so you can see all of a ... Vicki played\nThis evening I have three hour show a new set of tracks that I played in the first hour of\nMy show coming up to eleven PM in that mounting time zone they say southern ... NPR station\nK. C. C. K. I. C. C. H. D. Colorado Springs K. E. C. C. ... to Casey a stock veil and K W C. C. S. andme woodland park streaming\nAt K. C. C. dots oh here we have you too\n\n\n[noise]\n\n\nLabs you say the\nFrom the\nWaist do say\nThat do the way you do\n\nThe families\nBeen the key\n\nWould choose for the good\n\n\nTo the to\n[laughter]\n\nOf Jim standing between here and we're going to say\nWe saw driven days you know I ...\nMad and they do while\nMeasure to straighten him out\n\n\nLeaders in jail and stand there between here and we're going to say\nWe saw driven days are over ...\nAnything in well\nThe measure to publish straight Vermont\nRead the\nCheese\nBut do they\nWant to be\nThe way they should be\nRandi [laughter]\nTV [laughter] just too\nTo read too\nThe [noise]\nThe people on the\nShe goes to the [noise] the people she [laughter] [noise]\n\nYou mad and then we'll have\nThe ... you\nKnow well within\n\nThe realm Louis guy\nAnd\nThen then ...\nNo pun rain and\nTomorrow morning at five AM on Ninety One point five\nTo your cc memberships or the largest source of funding in Ninety One point five K. R. C. C. allowing us to bring you local stories NPR News music thanks for your generous support\nTo your cc memberships or the largest source of funding in Ninety One point five K. R. C. C. allowing us to bring you local stories NPR News music thanks for your generous support [noise] yep\nI like to associate myself with Jake's remarks thank you so much for support in the states should not one point five chaos cc\nFor listening and just being a cheer leader for us thank you thank you and thank you coming up in ... new music from metric we got a bit of Monday in here but we're going to kick off with ...\n\n\n\n... ... ... ... ... ...\n\nDa da\nDa and\n\n\nNa na\nNah nah\nAnd then say truthful ... music complete is the lone white ahead of but it's some ... and ... as a ... ... ... new music boom and a child by from a from a\nReally long time for him alone the porn I took from the most recent album more than you'd be secure Ninety One point five ... uh the\nOn the news hatred from New older music completes is the loan apply a [noise] a head of ... and ... as a man new music form and a cow by from her ... a really long time from blown the pollinator for the most recent album\nMore new music here in Ninety One point five K. I. C. C. from metric risk is attract you heard and kicking things off on this ... sets for me a DJ probe at least ...\nSays day evening you had seasons from future ...\nIf you're in your area or just a little forgetful and he'd like to know when your favorite program airs Ninety One point I Can't see the face at our website you'll find daily and\nWeekly program for me I have got to learn\nMore and\n... and you're listening to Ninety One point ... on gay are ...\n[noise] yes indeed you own introduce June and then if you may be just the alarms going off for the late shift and this is your work day\nBeginning this is not one point five K. R. C. C. D. J. probe in the ass studios in downtown Colorado Springs where it is ... degrees or so at the strings airports as well under partly cloudy skies\nOvernight low for the springs chief three degrees with not too much more activity based trials can stick around tomorrow that's friday\nThe eleventh of ... which isn't too far away it's gonna be sunny with the highest of fifty eight\nDegrees but we've been wind in the afternoon ten miles per hour is expected [noise]\nHello to all of our listeners in and around the\n... and ... area we're currently it's fast guys forty one degrees overnight low for you of the tea four degrees again under those fast guys tomorrow it's going to be sunny sixty two degrees canyon city how to you as well\nOver ... Lois such she's seven degrees for you ...\nOver fifty eight degrees but a wee bit of wind in the afternoon to most of our is expected [noise]\nHello to all of our listeners in and around the\n... and ... vista area we're currently it's ... degrees overnight low for you or thirty four degrees again under very fast guys tomorrow it's going to be sunny sixty two degrees Kenyan city how to you as well\nOver ... Lois such he's seven degrees for you partly cloudy and tomorrow it's going to be sunny with higher of sixty one degrees looking to be whether in on Sunday were looking for snow basically for al ... the\n... region to shore Kenyan city in Colorado Springs lows in the twin jeez no anywhere from one to three inches and for you ... ... is some snow expected more on Sunday evening is what the National Weather service\nIs predicting at this moment and signed but always check into this your local radio station for up to the\nOur food costs on the Web alright eleven forty four pie and in the mounting times and this is a final set coming up we're going to kick off here with a bit of an eye she Sacramento too [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise] [noise]\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise] [noise]\n\n\nYou know [noise] they try to keep the dog in changing\nThe changing of the people from those of you know one of her baby girl\nStay with you and things of that is the only news in the same page and we have to stay the same things that\nYou know in your head and they try to help them get picked a town in ... she things off changing the way they nod off to the guy's name a lot of money in the ... the ...\nOn the team in August car companies are on the bottom among all\nAnd they would have to pay for the magazine and they kept saying they've been paying him when he was the\nLead the way that they can\nBe on the table and the the [noise] the need to be in the home and be\nTo [noise] beep beep\nBeep the and the and you do when they would be the beep beep beep beep [noise]\nAnd you know do you have to be able to do in the country\nAnd the you know over a child I'm getting a pony thing came up she moved on to you started out on people\nFrom like a A R feeling a lot of them does a lot about the bottom I Would\nLike no no you can log on to the younger you are but I'm a [noise]", "month": "10", "day": "12", "state": "CO", "station": "KRCC"}