{"year": "2018", "show_name": "91.5 KRCC Late Night Music Mix", "city": "Colorado Springs", "content": "[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nKevin right to the judge must be a quote neutral and impartial arbiters who favors and political party he said he reveals the constitution and if confirmed would keep an open mind in every case\nSome Democrats say his performance was partisan and should disqualify him there than it is that for a procedural vote on his nomination on friday Kelsey Snell NPR News Washington\nA handful of US Senators say they have not decided whether to support Kavanaugh's nomination Maine Republican Susan Collins is among the undecided show is retiring Senator Jeff flake\nOf frequent Trump critic who was instrumental in getting the president to order the FBI investigation into sexual misconduct allegations against Kavanaugh a conservation vote on the nomination is expected by Saturday\nUs defense secretary Jim Mattis says the nine states is ready to help NATO allies fend off cyber attacks by Russia's intelligence services speaking in Brussels mad as as the G R U and other Russian agencies must be held accountable\nDespite denials from the Kremlin the international community clearly she's the reality in the United states and shoulder to shoulder with our judge and British and all NATO allies\nMattis calls the attack on the international chemical weapons watchdog reckless irresponsible and not surprising the same line was conducting tests to determine if a deadly nerve agent was used poison a former Russian spy and his daughter in England\nAnd upcoming summit in Canada aimed at saving the world Trade Organization will be notable because of the absence of one country ... reports that the United states was not invited\nWashington has been left off the guest list for the two day summit because the WTO is one of the organizations derided by president Donald Trump Canada's international trade diversification minister Jim cars says ministers from Thirteen like minded countries will attend\nAnd he says the hope is to ultimately persuade Washington of the continued value of the WTO but the Trump Administration has gone beyond rhetoric in its disdain for the Trade Organization and even blocked appointments with a new judges to its dispute settlement body\nCars as modernizing the world body is the best way to reestablish of rules based system something that would be more difficult if auto I have not preserve the dispute resolution mechanism\nIn the new free trade agreement for NPR News I'm Down in ... in Toronto you're listening to NPR News\nThe Pentagon is exploring the possibility of deploying insects to offer plants genes to make them more resilient and to protect the nation\nThe Pentagon is exploring the possibility of deploying insects to offer plants genes to make them more resilient and to protect the nation's food supply and opinion piece in the journal science suggests more study is needed since other countries they view the project is a potential biological weapon\nMilitary Research Agency says the state department has been briefed to ensure that the work does not violate international treaties State Department says the project is for peaceful purposes while the agriculture department says it's being conducted in control laps [noise]\nTo the south Carolina police officers wounded in a standoff outside the home in Florence Wednesday are out of the hospital South Carolina Public Radio's ... ... reports that the city's police department as morning an officer who was killed in the incident\nAt a press conference Florence police chief Alan Hi or had only praise for sergeant tyrants Carol way a thirty year veteran of the force killed by a gunman in an attack which injured six other officers and the person in the gunman's residents hydro described carried away as a standup police officer\nHe was the epitome of a community police officer you love this community you gave it as all with more than Thirty years he didn't have to do this job but this was his life and this is what he wanted to do\n... was a giant of a man but the proverbial gentle giant and I loved him for NPR News I'm ... Underwood in Columbia South Carolina\nOn stock markets in Asia shares are mixed up one percent in Shanghai following down day on Wall street than as that composite index fell a hundred and forty five points I'm Shay Stevens NPR News in Washington\nSupport for NPR comes from dream wave maker of luxury massage chairs from Japan with Shiites you pointed to action and sixteen program to massages including morning night and stretch sessions retailers nationwide more a dream wave chair dot com and the ... foundation\n[noise] hello there welcome to the food they late night music mix with me a DJ probe lovely to have you along\nOn this the full day of October two thousand and Eighteen\nSeventy six PM in the mountain at times on here at Ninety One point five K. C. C.\nMany thanks to a friend and neighbor Vicki fall and wonderful three hours and just remember you can go to KFC seatbelts old clicking on that night one point five music type and then you'll see music on demand and you can relive Vicks\nSee the dark ... clicking on that one point five music type and then you'll see music on demand that you can relive\nVicki program and thanks to all of her shows this week another pong was seen days all the music shows yeah you can live pose again before we go any further to the old DJ hats too my friend in DJ colleague Thomas with the sitting in for me last week\nWell okay let's go\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\nYeah just shoot and then you have to dial at Ninety One point five K. C. C. we our seven quarters and be a station DJ ... downtown Colorado Springs in the ass studios let's go back to that last song from Gary more on the twenty six of this month\nVisit brand new album coming out it's cool to more blues for Gary a tribute to\nGarry Moore gathered all of his friends are both days later his longtime bass guitarist Kevin folks like Joan ... I'm white snake who else do we have do you ever got Glen using their from deep a pool so these guys are just redo in\nA load of Gary's a song some of the big hit send some of the wonderful ... together Gary leftist planets in two thousand and eleven [noise] I\nI really consider myself a ... to have seen him\nAt least four times to my recollection Sarah twenty sixth of October more blues for Gary coming up in this next sets we have music from tore a most new music from the beach and then starts off now with new music from who may\n\n\nTo\n\n\n\n\n\n\n[noise]\nThe one\nThat I'm\nNot sure yet I'm Still\nNot that way when she found\nOut\n\nWere no no no [noise] [noise] [noise]\nMe bring\n[noise] Mm\n...\nThe ... from\n\nJust in the old way back to two thousand and sixteen bats protests Phillips with her take\nOn the cars classic drive a head of the cue of Brits and Dr ... good to me new music from Milo green from his adult contemporary release also new on the chops is certainly even on the one point five chaos cc jobs never die from being the speech\nDave waking on me for the coolest pasta mission tore a moss\nI mean kick invests sets off a second set with me DJ prohibit this evening on Denise from who may\nFor Waldo Waldo five grand finale happens October twenty in downtown in Colorado Springs\nMoney raised benefits while the Kenyan restoration and trail maintenance information on the community counter link I can see that all are gee\nWhy there's this is my live at the beach boys died this is John ... is the dominant ... from the most at Seventeen and anyone ... ...\n... you are on Ninety One point five K. or cc is supported locally by Kaiser Permanente offering pediatric care uh two locations in Colorado Springs kids can get six seven days a week and Kaiser has a twenty four hour nurse line and online care options KP dot org Kaiser Permanente thrive\nOkay my apologies in traditions in trucks and excuse me chip berry and Kaiser DJ ... into\nStudio one point five K. C. C. where it's ten forty two PM in the mounting time zone outside in the springs eight to nine zero three ZIP Code fifty degrees is what the National Weather service is telling me at the airport it's the same on the fast guys\nMust be clear this evening for the springs with a low of forty six degrees tomorrow that's going to be friday the fifth of October it's gonna be sunny but the height of Seventy three degrees but chunks of isolated shallow is off to sixteen hundred\nSeventy three degrees but a chance of isolated show was off the sixteen hundred hours that's for\nP. M. taken a look at the weather for Denver hello to all of our listeners in and around the Denver area count reporting forty nine degrees with a few clouds around every night low for you then but mostly clear\nForty six degrees and then some ... going to be a fifty percent chance of showers in front of the stones off the one PM with a high of sixty five degrees taking a look at the weather for Trinidad and the surrounding area mostly swear\nAt the moment in time sixty one degrees currently porch in Trinidad and overnight low uh fifty one degrees tomorrow it could be sunny with a high near to Seventy eight degrees very nice batches however to\nHold onto your socks here and do all the other loose bits and pieces around you because it can be breezy wins expects it between ten to twenty miles per hour would go up to thirty miles per hour so just be very very careful with that and the schools that s\nI C e word as well comes to mind with temperatures like that this time of year and wind gusts that light by this time of year back into the mix with me DJ probe here we have\nThe late great will be one of my [noise]\nI'm a\nMarine and claw would rise bowl\nMade [noise]\n[noise] [noise]\n\n\n\n\n\nActually apply\nSo do you live\nAnd dad\nWho was on a log on\n\n\n\n\nWas gone and joining me a nice making thing [noise]\nI Try I'm dumb I Try to do [noise] do you know it is in the meantime we also [noise]\n\n\n\n... well yeah\n\n[noise]\nTraumatic\nAnd she\n\nAnd the next MORNING EDITION from NPR News [noise]\nTomorrow morning at five AM on Ninety One point five to your cc\n[noise] to speak on air check we have a chat and hear a couple of songs on the river in free trial photographer met in the larger than on the ground but Saturday anyone with five [noise]\nAnd you have to choose to to seven or ... NPR\nStation K. C. C. J. C. C. H. D. or Colorado Springs key ISI Ceylon ... to keep the sea stock bill and K W C. C. F. M. woodland park streaming at K. R. C. C. adults\nKeith cc stock Phil and K W C. C. F. M. woodland park streaming at K. C. C. dogs or it's a few takes away from twenty three hundred hours in the mountain times arm\nBack is eleven PM on this for full state of October\nTwo thousand and Eighteen my name is DJ proved it is my pleasure to be your human a playlist for this the the ... hour to go and as a reminder to go to KFC see ... or click on that Ninety One point five music time\nThat you can see the music on the moms you can break on the ... or so and relive all of the music\nShows here are a bit of a palm fourteen days that are being broadcast also you can click on the play list and see what I played so far more Vicki played\nIn her three hours on this Thursday evening writes on Tuesday the second developed service that day but world lost a pioneer in music engineer Jeff interaction you\nMay or may not know him well if you do know him you will be aware of and that he was\nAs I say a pioneering engineer\nWith the bee tools is where he comes here he said he went on to work with such disparate acts such as Elvis Costello or ... an hour I could go on and so this next pets is gonna be a tip of the ... to Jeff\nWho passed away at the age of Seventy two\n[noise] [noise]\n\n[noise]\n\n\nThe community and [noise]\n\n[noise]\n\n\n\n\nOh lord [laughter] days and\nDays\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n...\n... ...\nIn ...\n\nAh there\nTrash you\nThat goes\nNo\n[noise] um [noise]\nI'm a bit\nNo\nI'm a gym in\nJune and\nAll the bad at all\nWay or the day you know\nDuring the live really\nNo\nNo\n\nAll up and down\n[noise] remember in award winning engineer Jeff\n... who passed away on Tuesday at the age of Seventy two in California I kicked off is sets\nWith tomorrow never knows from the Beatles classic revolver Jeff had his fingerprints or of a ... one\nBand on the run from Paul McCartney and wings going back to Nineteen Seventy three recorded in Lagos in Nigeria [noise]\nIn fact Jeff picked up a Grammy for all of his efforts on that one mind for life ... lead locals provided by mid you are from the quartet release\nGoing back to Nineteen eighty two the loved ones Elvis ... and the attractions from the imperil bedroom release and the last time that I just played new music for ... himself hand in hand [noise]\nAlthough just did not have his fingerprints of or that track from Egypt stations I'm led to believe that he was in on the sessions given ... me the two thumbs up\nProgramming on Ninety One point five K. R. C. C. is supported by the Colorado Springs fine arts center at Colorado College presenting Shakespeare in love a comedic Rob filled with adventure Elizabethan England September twenty seventh through October twenty first tickets at Colorado College dot edu slash FCC\n[noise] yep and if you just go down from that C. C. production I heard that you very very much and joined it and do you have it June to two K. R. C. C. [noise]\nNinety One point five seven kilometers NPR station DJ probe is my name is the host of the Thursday late nights music makes\nComing up in this next sense we have music from sting and shaggy\nBroken stone software miss angel leak could you do\n\nWas you know [noise]\nI\nAnd you're the\nOne of my way\nWill be able to\nSee the recall [noise]\nMe do you make\nA\nBall\nGame than\nAny other thing that\n\n... and it\nWill be a man why\n\n\nOf the one you know when he's\nOn um\n[noise]\nOh my\nGod yeah well\nThat whether or not\n\nI Know\nMe when\nI bought you [noise]\n\n\nOh [noise]\nWell\n\n\n\nAnd ... and ...\nAnd I'm sure they\nVery much weight on by the way I\nJury well ...\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise]\nStinging shaggy that was sad Trumbull and taken for their full for\nEight seven six release and it's a very popular album here at Ninety One point five K. I. C. C.\n... music from Orlando ... Lopez ... is what you had also ahead of Orlando\nMore new music from Jupiter and ... from corn Joe ... Joe the album is called ... make trouble man that's NATO cherries\nTake on Marvin Gaye classic that and then to Mac classics how about that one from Angelica joke kicking off is that the pronouncements sets at least for this or the night with me it DJ probe lay a lady lay\n... leaky Joe's from the chimes of freedom that just songs of Bob Dylan owner and fifty years of Amnesty International four CD set that one is lovely stuff as well\n[noise] I I filed the membership manager here in Ninety One point five years on behalf of all of us here at the station thank you for your support for membership drives to not do this without you [noise]\n[noise] to speak on air check we have a chat and you're a couple of songs in the river in free child photographer Matt ... a large extent you on the roundtable Saturday Ninety One we fight you know he [noise]\nEleven forty three PM in the mountain time is on downtown Colorado Springs reports in forty seven degrees on the fed skies mostly cliff for the springs is even just going to go down one digits according to the national weather service\nThe fat guys must be clear for the springs is even just going to go down one digits according to the national weather service to forty six degrees overnight no\nSunny ... of October ... high up Seventy three degrees isolated showers after ... pi I'm\nTaking a look at the weather for\n... and ... ... currently fifty one degrees on the staff skies\nOvernight low of forty nine degrees and it's good to be mostly ... tomorrow it's going to be sunny with ... eighty five degrees movie's gonna be wins in the Senate tea of ten to Fifteen miles per hour on\nThe Web ... and Voinovich a hello good evening to order by ministers in and around that area currently partly cloudy forty nine degrees overnight know off the tea nine degrees mostly clear\nTomorrow it's also going to be mostly sunny would hire sixty nine degrees though there is a chance of isolated\nFrom the showers staff Fifteen hundred downloads furry\nPie and so\nJust be warned about those final set with me DJ for at least for the says day coming up with a request here from the blind boys of Alabama\nNa na na\nYou know it's a mess\nKnow about\nYou know a day but I've got a brand name saying\nDime\nDon't go to put me on a train to say look down the road stray balls ... da da da\nI wrote that trade can ball ... times a day to\nSay it's a you get your money\nSo we didn't do as to whether a new\nIdeas that we have and I knew there were bad but I never think of the law the drama ha ha\nHa ha wise man a\nIs you know that God has\nRather than there used to kill someone else\nTown they live in", "month": "10", "day": "05", "state": "CO", "station": "KRCC"}