{"year": "2018", "show_name": "91.5 KRCC Late Night Music Mix", "city": "Colorado Springs", "content": "Brand new music from Kurt violent Ninety One point five\nK. R. C. C. sounding like this is going to be a really great record bottle it in\nMid ski ahead of that with nobody from being the cowboy phenomenally successful record right now from MIT ski yo la Tengo you can have it all some cream from Israeli gears and strange brew and starting it off with the replacements\nTaken from let it be and sixteen blew many many thanks to Hannah\nThe general manager of the Sox here Colorado College the student the sounds of Colorado College student run radio ah for putting together an amazing show I'll play records with you anytime\n[noise]\nYes [noise] you can have great music seven nights a week from seven to midnight on Ninety One point five K. R. C. C. [noise]\n\nThis is southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs Kate ... hunter Casey ... K W cc FM woodland park streaming it cares cc dot org\n\nLogged from NPR News in Washington ... Stevens the U.S has revoking the beaches of some Saudi officials implicated in the killing of journalists ... at the cell the embassy in Turkey\nIt's the Trump administration's first punitive action against which all these well President Trump is skeptical of the explanation for ... death each dismissing the possibility of canceling us arms sales to Riyadh\nDollars offered didn't which is really very order for various orders\nFrom Saudi Arabia\nFor fifty dollars I think it's over a million jobs [noise]\nVarious things\nFrom Saudi Arabia\nFor fifty billion dollars I think it's over a million jobs\nNot helpful to cancel it order like that\nBetter more that urge them\nTrump speaking at a campaign event in Nevada the president says he said to me Wednesday with U.S officials who've been inshallah the Arabian and turkey to investigate ... g's debt\nAnd liberal watchdog group is suing the Trump Administration for documents on the future of the FBI Headquarters in Washington D. C.\nE. mails made public last week indicate that President Trump was involved in the decision as NPR's Peter Overby reports it seems to affect the value of Trump's of Washington DC hotel located near the FBI building\nTheir group American oversight is suing under the freedom of Information Act a couple of years ago the FBI was planning to move its headquarters to the suburbs the old site would be re developed perhaps with a new hotel just across the street from the Trump International hotel\nThan President Trump met with officials from the FBI and the government's real estate office and the plan switched\nTo building a new headquarters on the existing site Democrats on the house oversight committee contend Trump veto the FBI moved to protect his business American oversight watch records concerning the meeting it's also seeking records have contact with the project with the Trump Organization or crumbs children of all kind of error and done junior\nPeter Overby NPR News Washington\nVolatility return to the u._s. stock market Tuesday with investors selling often largely buying back shares as NPR's Yuki Noguchi reports the market still end of the day in negative territory\nConcerns about slowing Chinese economy and increasing tensions between the U.S in Saudi Arabia prompted an early sell off at one point the Dow Jones industrial average get nearly five hundred fifty points before rebounding in the latter part of the day\nAt Tobar has already been a volatile months and market analysts say that could continue as investors worry that the global economic expansion that feel the bull market is beginning to slow those concerns meant big declines for industrial stocks that just three Yemen caterpillar\nThose stocks were hit especially hard as the company's forecast lower demand and higher costs\nNPR's Yuki Noguchi reporting this is NPR News to federal agencies that do not typically get together a meeting to discuss the future of lab grown meat the department of agriculture\nTwo federal agencies that do not typically get together a meeting to discuss the future of lab grown meat the department of agriculture and the FDA or considering how to properly label meat produced through in vitro cultivation has Caroline Halter of march for public radio in Texas reports\nAgriculture secretary Sonny Perdue welcome to the two agencies\nHere in this room today is filled with individuals who have an interest in ensuring that the food on America's tables remains safe wholesome and accurately label\nLivestock producers don't want lab grown meat labeled as neat\nWhat we look at it as we look at me and here we look at this fear of a living animal where the carpet from\nAmerican ... association president John scifri scifri once led me classified as alternative protein but companies producing it said biochemical ... their product is neat ultimately FDA and USDA me jointly regulate the product for NPR News I'm Caroline hunter\nFormer U.S Supreme Court Justice Sandra Day O'Connor says she is retiring from public life in a statement the first woman to serve on the U.S Supreme Court said she has been diagnosed with the beginning stages of dementia\nEighty eight year old O'Connor served on the high court from Nineteen eighty one until two thousand six\nAnd winning numbers have been drawn for the record one point six billion dollar mega millions lottery jackpot the largest prize in history they are five twenty eight sixty two sixty five Seventy and make a ball five\nAnd it's unclear if there's a winner\n... NPR News in Washington\nSupport for NPR comes from dream wave maker of luxury massage chairs from Japan with Shiites viewpoint detection and sixteen program to massages including morning night and stretch sessions retailers nationwide more a dream wave chair dot com Andy any case the foundation\nThis southern Colorado's NPR station K. R. C. C. care CCAs the Colorado Springs Casey see the hunter Casey see us start filling K W CCF emblem part\nWe're streaming the care C. C. dot O. R. G. or folks it's another Tuesday evening time for another late night music mix with your host doctor to your music master very very pleased to be with you for the next two hours\nThanks to Vicky on a great show thanks also to Hannah from the sock program of Colorado College that was a great set of music and hope you enjoyed it I Hope you enjoyed it so much will stay up for a couple more hours to hear\nThanks also to Hannah from the sock programs Colorado College that was a great set of music hope you enjoyed it up you enjoyed it so much will stay up for a couple more hours to hear a few songs\nFrom me here at the downtown studio here in Colorado Springs tonight we're going to have some new music from a ... state blood orange Bob Moses among others were going to say happy birthday to a\nModern country legend Dwight Yoakam who a birthday today we're also going to have a little tribute to anniversary albums that who's ... and the debut from traveling well berries\nI think that sounds like a pretty good night don't you were gonna start things off though with Tom York's brand new album and he's put out its soundtrack from an upcoming horror film a remake of the some ... here on Ninety One point five care cc ... back and enjoy\n\n[noise]\n\n\nFinished up that first set of music was brand new Bob Moses to do a it's a duo from Vancouver\nSet of music with brand new Bob Moses to do oh it's a duo from Vancouver British Columbia it's a brand new song brand new album battle lines and the song is back down I\nJust find that kind of infectious great stuff from those folks if you're interested Bob Moses it's a that is that's not a it's just a person they picked for their brand name the members or Jimmy violence\nAnd Tom how are you if you're interested before that we're ... dark from the radio radio heads most recent album for a couple of years back the fantastic moon shape pool and the song decks dark we started things off with Tom you work or the ... the front man of Radiohead with his brand new a soundtrack album ... area\nWith the very haunting song makes sense since it's from a horror film the song is has ended\nLike I'm running for governor our vote with\nTwo weeks until the midterms Democrats are doubling down on state races in Nevada the party is pushing to elect the first democratic governor in Twenty years\nWe've got to turn out voters return of the voters that we've identified work in the west but he's\nTheir candidate making convincing Kate where's that many White House and the next MORNING EDITION from NPR News\nTomorrow morning at five AM on Ninety One point five key or see see\nIn ... king and you're listening to Ninety One point behind you are the [noise]\nEverytime I hear that little spot from Chris Thomas King I think of the songs the background for my brother where art thou but I also think of this summer\nWhen he played a great set of music at the blues under the bridge concert here under the Colorado avenue bridge and one of the highlights wants his version of Jimmy hendrix is a little wing it was just fantastic it is currently fifty two degrees here on\nTwenty third It's Tuesday and this is Dr ... hanging with you up through about midnight it's about ten twenty three we're going to keep going and this set of music we're going to kind of continue that that a chill music you heard from Bob Moses down tempo um electronic I kind of stuff\nWith brand new ... a ... a group from England called ... states as a second full linked album were also going to hear another British Band that has that same kind of music zero seven and after that we're\nGoing to celebrate a birthday we're going to go we're going to go way off from the electronic uh to country and our country that Dwight Yoakam whose birthday is today turns fifty six years\nBirthday we're going to go we're going to go way off from the electronic uh to country and our country that Dwight Yoakam his birthday is today turns fifty six year fifty two years old [noise]\nAnd um [noise] this is sixty sixty two years old got that wrong about that the white and that's going to take his in his next set of music I sit back and enjoy here on Ninety One point five\nCare see see here's mere state\n\n\n\n\n\n\n\n[noise]\n...\n...\nBe read\nAnd yeah and did they come on down\nThat path and they have for a long night thanks for\nThe man and one day\nIt doesn't seem to be\nBut I'm ...\nAnd\nWas the\nLast ... ... ...\nYou hit it right on that one and we'll pay a couple of covers a throughout the a couple of more throughout the rest of the evening\nBefore that we play to one of his hits from the nineties ain't that lonely yet from a job this time\nFor that we heard zero seven from their album simple things with in the waiting in line\nAnd again that was kind of that down to bow show music we heard in the first set with Bob Moses and we started another one with that and that is ... state\nNervous chicks from their brand new album another British electronic band featuring on vocals Holly Walker and I should say that to seven features the wonderful sounds of Sophie Barker on on the vocals great stuff there on that sort of music cope you enjoyed it here in Ninety One point five care cc\nAnd the American association of university women will be sponsoring Colorado offers day October twenty seven all proceeds go to local scholarships for women in the ... region or formation on our community Kennedy link or see seat or G.\nOne point five terror cc is dedicated to covering a change\nFrom Asian on our community Kennedy link or see that a large in Ninety One point five K. R. C. C. is dedicated to covering a changing southern Colorado your membership dollars directly fund our local reporting thank you for your sustaining membership\nWe certainly do thank you for all the membership especially in her membership Dr we just had not too long ago all the new sustaining members great stuff there thank you for all your supports both\nIn supporting and listening on the evening a music shows which happens seven days a week from seven PM through midnight hope it's a great way for you to in your evening and uh just thanks again\nFor head back to this last set of the first hour of two here on the Tuesday lay down music mix let's take a look at that whether\nWe're fifty two degrees and our downtown Colorado Springs studio and I'm going to kind of go up elevation wise in this next set to in this or whether to see what we're looking for the next day or so let's start with a little lower elevation rocky Ford down there\nAnd that's a little over four thousand feet it looks like a good chance of rain overnight especially tomorrow or Wednesday eighty percent chance of rain and high fifty seven lower thirty nine the sun comes back on Thursday and the highest sixty nine rocky Ford\nThen we'll go a little a further up about ... just a little above five thousand fifty two hundred that's canyon city where it's fifty five and fair\nShowers likely overnight in forty percent on Wednesday a high fifty nine\nThe sun comes back for Thursday looks like the rest of the week and through the weekend is looking like the sun but the highest sixty six [noise]\nThey'll come here to Colorado Springs at about six thousand feet elevation where I said it's fifty to a slight chance of rain overnight twenty to sixty percent and that continues through Wednesday more likely early and that will be a higher fifty seven we could use a little rain\nA twenty percent chance overnight Wednesday lowest thirty eight\nWe will have to bring up the coverage tomorrow night for sure Thursday and mostly sunny and sixty four and that trend continues through the weekend and finally way up the pass at woodland park\nCity by the clouds but any five hundred words currently forty one degrees again that slight chance of rain overnight six twenty to sixty percent throughout the course of the day on Wednesday with some thunderstorms a hive only fifty\nFifty six and mostly sunny on Thursday in woodland park alright focused ten forty two here on October twenty third year in the midst of the late night music mixes Dr T hanging with you this last set of the first I was going to be a ... anniversary set of music\nThird year in the midst of the late night music ... hanging with you\nThis last set of the first I was going to be ... anniversary set of music between two albums very different albums but yet very influential in their own way and that is the who's ... which turns forty five years and a couple of days\nAnd the debut album from the super group traveling will berries which just turned Thirty years a couple of days ago\nTraveling all there is of course was that super group of ah\nGeorge Harrison Bob Dylan\nTom Petty Jeff Lynne and the late ... orbits and\nHe was only on the first job I made a second one but this is the one and it really kind of a was a big thing for a folk country rock roots rock Americana that kind of thing I mean we hear that a lot now but that was really\nA kind of brought it back there and it was great stuff there and of course who ... a a another one of those concept albums that Pete Townsend put together and uh it it just lots of great songs on that from Nineteen Seventy three\nAnd a few ... curious what caught your feeding it was the main character ah had some almost like four different personalities instead of schizophrenia was plot as it in for\n... I Hope you enjoy this next to the music going to start this one with a really nice song uh that Pete Townsend sings on this ... and then they'll we'll hear another one from that and then we're here to from the traveling Wilders take us up to the eleven o'clock hour\nI Hope you sit back and just relax here on Ninety One point five care cc\n[noise]\n\nNo [noise] but [noise]\n\nAnd Mad Max out there and he was married to\nLittle\nBit to write\nNa na\n\nNa\nNa\nNa\nNa\nNa na na\nBe\nReally long\n\nNa na\nNa\nNa\n\n\n\n\nCelebrating the anniversary of two great albums from a little while ago we started with two songs from Nineteen Seventy three ... from the who\nTurned forty five years in a couple of days you're on one if you drink the towns and only vocals and then drowned kind of a classic sound\nHorses Roger Daltrey sing and they're great stuff after that to songs from the Nineteen Ninety eight plastic from the traveling will berries are released Thirty years ago we heard last night uh Tom Petty telling a story with little help\nPlastic from the traveling will berries are released Thirty years ago we heard last night uh Tom Petty telling a story with little help from white or of a sudden we finished things up a margarita with Bob Dylan telling the story with a little help from Tom Penny\n[noise]\nYes [noise] you can have great music setting nights a week from seven to midnight I Ninety One point five I see the [noise]\n\nAnd we've just cross the eleven o'clock hour here on southern Colorado's NPR station KERA she she cares the C. H. D. Colorado Springs Casey Sheila hunter case CCS dark bill\nIn K W CCF him woodland park\nStreaming a care C. C. dot O. R. G. welcome to the second hour of the Tuesday late night music mix 'em your host doctor to your music master I'm usually here on Tuesdays and and I can't think of a better place I'd want to be on a Tuesday night than playing some songs for you as you finish up Tuesday and get ready for Wednesday in the middle of the week\nAnd a really appreciate that we're gonna do something fun this first set of music of the second hour we're going to do kind of new and old of artist that you know quite well\nAnd they all have some capacity of new album's coming out right now\nAnd that's Paul McCartney sir Paul ... Neal fan from crowded house and originally split ends\nAnd the smithereens even though ... unfortunately passed away last year he uh his group is put together a great album of covers and so we'll hear one from that and one from their early stuff as well so that should be a pretty fun said if you don't if I don't say so myself\nWe're going to start with that brand new Paul McCartney maybe ... Egypt Station and uh not too bad for the for the man who's been making music for over fifty years for us\nHere in Ninety One point five K. R. C. C.\n[noise]\n\n\n\n... or ...\nOr ...\nThat these people\nPut it in a slew\nTo be a nation that you need\nDo\n\n... ... ...\nEvery night I just want to go out and you know why they\nDon't want to get a get out of my bed\nEvery night I\nTo do what tonight I just want to say you and\nMe dear\nAbby with you\nTo\n\nAnd dad they feed on on both sides of the time wasting my time\nEvery night I lay\nEvery morning during the day you\nThrough the new\nOne tonight I just want to say and then and the season\nAnd be with you\nJeeze\n\n\n[noise]\n\n\n[noise] [noise] [noise]\n[noise]\n[noise]\n\nSides\nOf the banks are bad then I Need them learning\nOn the line for\nMe being a very\n\nLong and all\nNeighbors and dumb and dumber\n\n\nAnd then on a single mom or\nA young man down not to them\nCan\n\n\nSo you're on a on\nA ride finishing up with to smithereens from their newest a release called the smithereens covered tunes collection\nThat is one after nine o nine an old Beatles tune that was originally written by John Lennon when they were in high school and released on an album on the let it be album from Nineteen Seventy and we played a to Z or two songs of each of those albums\nOf those artist you just heard Mr music we started with two songs from Paul McCartney including his brand new album ... of Egypt Station his Eighteenth solo album with the song who cares kind of rocks a little bit I don't mind that I like it\nAnd then all the way back to a Nineteen Seventy when he released his first solo album they're beautiful I never get sick of hearing that song every night I could probably hear it every night actually after that to songs related to Neal Cindy famous song singer songwriter from New Zealand\nWe've heard is brand new album he does with his son Liam called light sleeper and that's a beautiful song any other way and I frankly as much as I Know Neal fan it's kinda hard to distinguish between the two voices I Know they're both there\nAnd it just makes beautiful sounds when they come together isn't that great after that we went way back to Nineteen eighty three to split in the group that Neal fan first became known he was a younger brother of temp than it was one of the founders\nAnd that's a very beautiful kind of underrated a classic ballad from Neal that he wrote and saying he was very young like twenty two twenty three in the song his message to my girl and after that like I said we are two songs from the smithereens we heard from the very first album from Nineteen eighty six\nThe wonderful power pops in infused song blood and roses from especially for you\nAnd other just said we finished up with one after nine nine from the smithereens\nFunny and I was like I'm running for governor might not vote\nWith two weeks until the mid term Democrats are doubling down on state races in Nevada the party is pushing to elect the first Democrat\nWhat are your vote with two weeks until the midterms Democrats are doubling down on state races in Nevada the party is pushing to elect the first democratic governor in Twenty years\nWe've got to turn out to return other voters that we've identified work in the west\nBut he's their candidate making convincing hey where's that money going how they're having an effect on the next MORNING EDITION from NPR News\nTomorrow morning at five AM on Ninety One point five key or see see\nWhy there is this is my ... this is Jonathan from your water than the dominant ... from the most at\nSeventeen Ninety Ninety One point five to ... a\nYear in the midst of that seven to midnight music were almost through for the Tuesday of October twenty thirty two thousand Eighteen still nice cool uncomfortable fifty one degrees here in our downtown Colorado Springs studio\nRight after this study musical look one more look at the weather which looks like a wet Wednesday and then increasing son threw the Thursday in through the weekend so not too bad\nThis next set of music we're going to hear from one of Canada's finance imports Sloan a from Halifax Nova Scotia we're also going to hear from the band another Canadian group\nAnd we'll see what else after that but we're going to start things off with a group from\nEngland mostly one person or lots of people that helps Democrats Deb Heinz with his group of blood orange have a brand new album out called negro swan and I like quite a bit and we're going to start this next set of music with said group blood orange on Ninety One point five care cc\nBig big big [noise] and\n[noise]\n\nSee the ...\nYou\nKnow\nIndian\n\n\n\n[noise] [noise] oh\nCan\nNo no\nMean I\n\nKnow\n\n\n\n\n[noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\n\nIn\nAnd\n\n\nFinish up that said music with classic from the second and the communist leaning album from the band from I'm from Canada and that is up on cripple creek and a hang with that a town for just a second and we'll be right back to that\nIn just a few seconds actually before that Chris Bell if you recognize that voice but maybe not the song he was one of the founders of big star along with Alex Chilton was on that very first job number one record\nAs that great song in the street among many things this was his one and only solo album which you recorded in Nineteen Seventy eight Seventy nine unfortunately had a tragic car accident died in Nineteen Seventy nine but it wasn't for a long time before they were released it uh it was just kind of their this song the title track came out I Am the cosmos\nAnd it wasn't until like the early nineties when they actually ... re released it for the first time it's a great album has one and only and That's Chris bells I Am the cosmos before that another power pop group ah from Canada and that's Sloane what they're really catchy everything you've done wrong from there one one court to another album\nAnd we start things off with a brand new from blood orange\nThe probably the against the title track because it mentions the name of the album negro swan really great song called charcoal baby\nThe Ninety One point five ... your cc news team the meeting was the third for scheduled around the country in demand passed on to sixty two over the past five years officials said a ... recognized for excellence by the Colorado broadcasters association\nEverybody that this ... this is Krista hello this is Michael from spirit in Ninety One point five K. I. C. C. music Kevin ... Ninety seven Ninety three\nThat's right and you're in the midst of that as we are getting near the end of the Tuesday edition\nVastly quickly approaching midnight here thank teen things go very fast on this Tuesday evening late night music mix thanks for spending reading with me here Dr tea on Ninety One point five care cc went to a quick look at the weather and we're going to start with the ... the place of the song we just talked about up on cripple creek\nWhat's happening up on cripple creek which is way up there above nine thousand feet and it's a forty degrees there and falling showers likely overnight a low of ...\nWhat's happening up on cripple creek which is way up there above nine thousand feet and it's a forty degrees there and falling showers likely overnight a lower thirty eight tomorrow fifty percent chance of showers and a high forty seven son creeps back on Thursday and cripple creek gets up to fifty one\nAnd then it steadily moves up fifty two on friday and fifty three on Saturday and mostly sunny\nHow 'bout hearing the springs where it is currently forty nine degrees we just went below fifty\nChance of showers pretty high overnight low a forty five thirty to sixty percent during the course of Wednesday a high fifty seven and then we go from sixty four on Thursday and mostly sunny sixty two on friday in sixty six on Saturday looking for sunny days very nice for late October [noise]\nHow about the hunter down around four thousand feet lower it still fifty three there again the showers overnight and I will continue through a probably very likely eighty to eighty percent chance on Wednesday high fifty six\nBack the sunshine mostly sunny on Thursday in sixty nine as well on friday and we hit Seventy hopefully on Saturday in all the hunter all that's going to give us a good feel of what's happening so you can expect a wet Wednesday and maybe even Tuesday night if we're going to be up for a little bit after the midnight hour\nWe're going to finish up that tonight with a tribute to attribute album and that is the the brand new tribute album called king of the road a tribute to Roger Miller of course Roger Miller the very famous American singer songwriters sometimes actor and he's ... most known for that to how to track of that song\nAnd died a little young at the age of fifty six but they have a new tribute album and one of the\nPersons that we played in the first hour Dwight Yoakam he just had a birthday will be on a will be featured as one of many artists on a remake of that classic album we're going to hear three versions of that including one that's kind of funky one from our EM from one of their ah beside albums\nAnd they were going to finish up with one more cover and it's going to be a Rolling Stones covered done very very nicely by a British group would need to get going because we're running out of time we're going to start with a classic song from Roger Miller I Hope you enjoy it a hero Ninety One point five care cc\n[noise]\nOr say rooms Gillette says no no no\nSmoking rooms to lead the dish sin\nNo fall no food no pets I ain't got no Steve to rent a but two hours of Bush in ... buys a pay ... for ... I'm a\nOf means no means it's game will be\nVery top scar midnight train ... moved to the world war now sued shoes for\nA donor they know you can use\nA slow road still is a\nSure but not to go around I'm a\nOf means by no means gang of the room\nLearning in general on a strain\nOn a show and\nI Know this isn't the same is\nAnd there are a lot today a lot from them around and saying\nTraders sorority say those are rent\nTo it if they said\nNo no\nGot sick or read a book for two hours from push him in the\nBig one but twelve for best brood momma\nMeans by my man\nGang other row\nTrainers who sued to rent a room to says ...\nNo ... no\n... and he can do cigarettes soon\nBut to resist Bhushan ... ...\n[noise]\n\n\nThe na\nNa na na na\n\nNa\nNa na\nNa na na\nNa king\n\n\n\n", "month": "10", "day": "24", "state": "CO", "station": "KRCC"}