{"month": "10", "state": "CO", "station": "KRCC", "content": "For more about our hard cash for information on pitching us your own story and everything else go to our website ... dot org\n\nThe midterm elections are coming soon the result could influence the nation for the next decade stakes are high and NPR and all things considered are covering national trends\nFor more about our hard cash for information on pitching your own story and everything else go to our website ... dot org [noise]\n[noise]\nThe midterm elections are coming soon the results could influence the nation for the next decade stakes are high and NPR and all things considered are covering national trend [noise]\nHe won't just tell you who wins will tell you why it matters listen to all things considered to hear the bigger picture every afternoon from NPR News [noise]\nAfternoons at three thirty on Ninety One point five K. R. C. C. programming on Ninety One point five K. R. C. C. is supported\nBy the Colorado health foundation dedicated to improving the health and health equity of Coloradans the Colorado health foundation invested in issues that matter and works towards improving health\nColorado health dot org just to southern Colorado's NPR station to your C. C. C. C. H. D. Colorado Springs key ISI see law hunter KPCC of structural and key W CCF them woodland park\n\n\n\n[noise] Mm\n\nIn a sand dune man\n\nCome to a\nWell known in and\nHis ...\n\nUh\nOn the wings\n[noise] live from NPR News in Culver City California Hi Janine hurt your abs is vowing to kids back hard if the U.S slapped with economic sanctions as NPR talent Blair reports\nUm and while\nIn and [noise]\nHis\nName\nThe [noise]\nOn the wings\n[noise] live from NPR News in Culver City California Hi Janine hurt Saudi Arabia is vowing to hit back hard if the U.S slaps it with economic sanctions\nAs NPR selling wire report the threat marks a new chapter in a diplomatic crisis over the disappearance and suspected murder of a Saudi journalist\nPresident Trump has warned that Saudi Arabia will face consequences if it is behind him all showed the suspected murder this is Trump on CBS or sixty minutes we're going to have to seize\nWe're going to get to the bottom of it and there will be severe punishment but\nSaudi authorities didn't take long to answer with a warning of their own a government official told the kingdom state run news agency but be totally reject any diplomatic threats according to official quote if Saudi Arabia received any action will respond with greater action\nAnd the Saudis said the widespread allegations of murder are nothing more than ... ... they have yet to offer any official information about the whereabouts of been missing journalist college where NPR News\nAnd Egypt Today called for a transparent investigation into showbiz a death\nSomalia is marking the anniversary of the deadliest single terrorist attack in its history a bombing in the center of Mogadishu that killed nearly six hundred people a year ago ceremonies were held across the country and many gathered at a new memorials commemorating the date with a moment of silence than an convicted of coordinating the attack last year was executed\nAre still raw in a country that's faced decades of deadly chaos and attacks by the al Shabaab extremist group every few weeks a bomb explodes somewhere in the country and despite tight security al Shabaab has been able to continue detonating bombs inside the capital city\nFour days after hurricane Michael utility crews are working to restore electricity to customers from the Florida Panhandle to Virginia warning some they can be without power for weeks and here's Jeff ... reports Michael is the latest of several weather events that are prompting new efforts to make the nation's power grid more resilient\nAfter big storms the question always comes up why not put the wires underground where there'll be protected from the elements Julie ... an energy analyst at union of concerned\nOnce in a line of entertainment\nFour days after hurricane Michael utility crews are working to restore electricity to customers from the Florida Panhandle to Virginia warning some they can be without power for weeks and here's Jeff ... reports Michael is the latest of several weather events that are prompting new efforts to make the nation's power grid more resilient\nAfter big storms the question always comes up why not put the wires underground where there'll be protected from the elements Julie ... an energy analyst at union of Concerned Scientists\nOnce in a line of entertainment it can actually be much more ... me and take our line right now and\n... and an overhead wire\n... flood prone areas that can make more sense to elevate grid infrastructure one thing McNamara would like to see more of is independent micro grids at places like hospitals and facilities where residents can't easily evacuate Jeff Brady NPR News\nAt least Fifteen deaths are being blamed on the storm and rescue crews continue to search the rubble in Florida for survivors ... FEMA chief Brock Long calls the damage some of the worst he's ever seen he toured several towns in Florida Panhandle today was governor Rick Scott\nYou're listening to NPR News from Culver City California\nThat second space telescope has entered safe mode and held at science observations rented burn from member station W. M. F. E. reports it comes shortly after the Hubble Space telescope shut down\nThe Chandra X ray observatory went off line less than a week after Hubble Nassar says the telescope went into so called safe mode possibly because of a gyroscope problem safe mode is automatically activated to protect the spacecraft if it's computers think there might be a technical problem\nThe telescope uses a set of gyroscope to help navigate and study the spacecraft\nHubble went off wind due to a similar issue\nBoth orbiting observatories are old and in will extend admissions Hubble is twenty eight while Chandra is Nineteen white controllers are working to assume operations with both Nassar says it's just a coincidence both shutdowns so close together for NPR News I'm Brendan Byrne\nThe former chairman of eight of ... of course has died bill course was also the grandson of the Brewing Company founder he started his career with the company in Nineteen thirty nine and was chairman from Nineteen fifty nine through two thousand helping it grow from a regional brewer into one of the world's largest also served as an official taste tester for the company will of course\nAnd in will extend admissions Hubble is twenty eight while Chandra is Nineteen white controllers are working to assume operations with both Nassar says it's just a coincidence both shut down so close together for NPR News I'm Brendan Byrne\nThe former chairman of Adolf ... corps has died bill course was also the grandson of the Brewing Company founder he started his career with the company in Nineteen thirty nine and was chairman from Nineteen fifty nine through two thousand helping him grow from a regional brewer into one of the world's largest he also served as an official taste tester for the company\nWill of course was one hundred two years old\nAt the weekend box office the comic book film that um continue to defy poor reviews and its second weekend in theaters with an estimated thirty five million dollars in ticket sales but that's down fifty six percent from its first weekend\nThe Sony Pictures film has earned one hundred forty two million dollars to date from North American theaters in second place a star is born with twenty eight million I'm Janine hurts NPR News Culver City California\nSupport for NPR comes from NPR stations other contributors include the corporation for public broadcasting and the state of John crock who's ... serves as an enduring investment in the future of public radio and the Robert Wood Johnson Foundation and R. W. J. F. dot org\n[noise]\n\nYou hear the train in the back room this is the jazz exclusion\nWith myself here Jessie J tune\nYour tune to southern Colorado's NPR station Ninety One point he or she [noise]\nOld lady she was why\nWhy don't we should do say the average man\nTo say that the duty to learn new to you know gee I Love the\nOkay the key why\nWhy we should I Do say the name\nKnow they do they do they let you know\nGee I didn't see the bad\nWas the guy that bring\nFeel sad day no no no no I\nA nice day [noise]\n\nI Can't give you anything but love performed by Django Reinhardt and the ... of the couple of France it's from recordings taken from Nineteen thirty six to Nineteen thirty seven\nAnd if he treats defined ... billion boiling Django Reinhardt on guitar so elusive Reinhardt a peer\nI Can't give you anything but love performed by Django Reinhardt and the ... of the hot cup of France it's from recordings taken from Nineteen\nThirty six to Nineteen thirty seven and that featured stuff on ...\nOn violin Django Reinhardt on guitar as well as just sort of Reinhardt a peer ... on guitar Lucien Simmons on base and Freddie Taylor\nOn vocals before that\nWe heard from the complete Benny Goodman also taken from Nineteen thirty seven to Nineteen thirty eight\nThat was the tune the blues in my flat and let's see who they're featured lentil Hampton um vocals as well as vibrant phone study Wilson on piano Dave telephone drums\nAnd Benny Goodman on clarinet recorded march twenty fifth Nineteen thirty eight and starting this hour of the jazz excursion was take a train as per a tradition performed this time by re Bryant\nAnd that's on an album entitled so low flight\n\nHope you're enjoying this evening I Hope you've had a good weekend interesting warm this has really\nSome of the first winter weather we've seen thus far so fully have a blanket and a sweater and do you stick around for some more of the jazz excursion on Ninety One point five K. R. C. C. southern Colorado's NPR station\nIn this critical election year you can count on Ninety One point five K. R. C. C. to bring you the information you need from NPR in the Ninety One point five K. R. C. C. newsroom we have the best journalists bringing you intelligent insightful reporting to help you understand the issues and the candidate\nBut quality costs money as a nonprofit media organization we looked directly to you to help pay the costs of our services\nBecome a part of the team contribute at K. R. C. C. dot org today thank you\n[noise] Mm\nHi I'm Chris Thomas King and you're listening to Ninety One point five K. R.\nOur cc to bring you the information you need from NPR to the Ninety One point five here see the news room we have the best journalists bringing you intelligent insightful reporting to help you understand the issues and the candidates\nBut quality cost money as a nonprofit media organization we looked directly to you to help pay the costs of our services\nBecome a part of the team contribute at K. R. C. C. dot org today thank you\nKnow\nOr um group Norman king and you're listening to Ninety One point ... or ...\n[noise]\n\n[noise] [noise] or\nOh black magic that we know\nI read it all depends on\nGolf and\nRunning around on all my\nJust\n\nNot only are kids and\n\n[noise]\n\nDegree and\nCold or\nFlu and bam level when a man under the whole black magic or [noise] or friends\nOther view or black magic all low\n\n\nHard to understand the love of what's going on in under the who black magic spend\nBlack magic non\nAshes\n\nOn their kids and\n[noise]\nAll\n[noise]\nBelieve\nOr understand what's going on man under the new black matching them all and end up spending billions\nUnder the black budget calling\n\n\n\n\nIn the background on crackling bono [noise]\nYou're hearing the trumpet summit\nWhich includes dizzy Gillespie Freddie Hubbard\nIncluding Terry [noise]\nAs a trio meeting up with the Oscar Peterson big for re brown Joe Pass and Bobby Durham\nPretty huge lined up for this album just tune is just friends\nBefore this you heard all doubled moon\nFrom the Ramsey Lewis trio in Chicago [noise]\nApril thirtieth Nineteen sixteen\nAnd starting this set\nWith his lovely wife ... Smith\nAs a trio meeting up with the Oscar Peterson big for re brown Joe Pass and Bobby Durham\n[noise] pretty huge lined up for this album is tune is just friends [noise]\nBefore this you hurt old devil moon\nFrom the Ramsey Lewis trio in Chicago [noise]\nRecorded April thirtieth Nineteen sixty [noise]\nAnd starting this set\nWith his lovely wife Keely Smith [noise]\nThat was a medley of embrace civil you\nAnd I got it bad and that ain't good [noise]\nThe song is going a little longer than I uh [noise]\nInitially planned so I'm just going to let you know the weather right now it's twenty three degrees here in Colorado Springs at our station [noise]\nUh twenty three as well and with um park and managed to [noise]\nUh we'll dip down [noise]\nTowards Fifteen degrees this evening as are low [noise]\nPueblo you're at twenty five degrees lower twenty Trinidad twenty three with the low of Eighteen and I [noise]\nIn hunters twenty eight with a low of twenty two this evening [noise]\nSaliva Twenty one degrees presently\nThey'll dip down to twelve\nAnd canyon city or at twenty five degrees [noise]\nReaching you're low of Twenty one for the evening\nIt was a great chance of snow this evening [noise] thirty percent across the listening area [noise]\nSixty percent in Pueblo Trinidad and saliva [noise]\nTomorrow the highs will be I'm pretty low though it will be sunny it will be brisk the Colorado Springs highest thirty seven degrees for tomorrow thirty three in woodland park and managed to\nForty in Pueblo thirty one in Trinidad forty one and log on to forty two in saliva and in canyon city thirty seven is your high\nFor October fifteens Monday Monday Monday\nThis is the jazz excursion and this is southern Colorado's NPR station Ninety One point five K. R. C. C. [noise] just to reiterate across the listening area there's a freeze warning tonight and a winter weather warning until ...\nForty in Pueblo thirty one in Trinidad forty one in ... to forty two and ... and in canyon city thirty seven is your ...\nFor October fifteens Monday Monday Monday\nThis is the jazz excursion and this is southern Colorado's NPR station Ninety One point five K. R. C. C. [noise] just to reiterate across the listening area there's a freeze morning tonight and the winter weather warning until nine\nAnd tomorrow we'll be brisk but sunny\nUp next we've got a little bit of ... a barrel garner it's a new CD of an old show recorded in Nineteen sixty four and some new stuff from nearly McKay\nAnd we'll we'll go from there [noise] [noise]\nHi this is helping black host of looking up to nurture on astronomy here on Ninety One point five care see see we're every Monday at nine AM and nine PM an additional shows are are tied to care C. C. dot org and available and I do remember keep looking up\nHigh there's this is Mike live at the beach boys Titus is Jonathan from sure what the dominant wildly from the most at the end of the menu and ... he\n[noise]\n\n\n\n\n[noise] [noise]\n\n\n[noise] [noise]\n\n\n\n\nStarting the arrow garner who also played where when on this very same live show up but the tune that you heard him play was night and day and that was recorded November seventh Nineteen sixty four\nStarting this at Errol garner who also played where when on this very same live show up but the tune that you've heard him play was night and day and that was recorded November seventh Nineteen sixty four\nAnd I thought I knew when I thought I knew where\nOh at the concert about Amsterdam is the southern Colorado's NPR station Ninety One point five cure C. C. and you're listening to the jazz excursion\n\nMy name is Benjamin Sharma president and owner of monument occupational medicine in monument Colorado for target audience are owners of companies HR professionals safety managers and injured workers\nThemselves to the medical care that they need to get back to work or CC's helped us quite a bit and we're able to team a lot of access to individual we normally wouldn't have access to through other means of advertising\nYou would like to become an underwriter like me please call genetic seven when nine four seven three for eight zero one\nOnce again this is southern Colorado's NPR station K. R. C. C. T. R. C. C. H. D. Colorado Springs key easy Cee Lo hunter Casey see us start fill in key W CCF him with them part streaming accuracy seat or ... or ...\nIn New Orleans and then you can understand what I mean\nThe wing of the mob on Saturday Night and they go\nAnd me was owned a mainstay on\nMovies and handlers Little Miss seeing\nIn ever seen that show up and down the brain of\nNow the boat was having a bad mother lived on\nLam a job and Jim is\nHad also bought us off\nWe bought it was nice and hot\nFish fry it was right\nIn saying that job but on the job to bring them\nSaying that got an answer\nWe let the jar\nYou know what I'm saying that God for that show\nWe all are letting the jar\nAnd I haven't seen that in governance job\nNow that women was leaving and jumping and\nLine in the ... with mellow\nUp above the law they made somebody ought to do a better get out ahead of the rain so\nI didn't know we were breaking the law\nI could get away if I had a chance but I Would say good luck I had the\nI was saying that dolphin on job until\nWe had in jail in a\nDon't ever mentioned appears to me it was\nDon't ever mentioned fish to\nAn avid fans out shopping shovel\nMade that comment on shopping\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\nAnd final track and they said there was drawn buggy from dean group a big band with Roy Eldridge and that was drummer man and on vocals you heard there um well the album Mr Olbermann the locals\nAnd that final track of this that there was drawn buggy [noise] from gene group a big band with Roy Eldridge and that was German and on vocals you heard there [noise] um well the album was reprimand the vocals you heard there was Irene day\nAnd so both of those were\nWell renown drum a jazz drummers and I found it interesting I already had gene crew but out but upon reading the inside of this buddy rich I found a quote from gene group of about buddy rich\nAnd he said buddy rich as the ... greatest drummer of all time I walk out thrilled for the moment and say to myself my God how did he do that with his foot [noise] what did he do with his left hand even more technically chubby Jackson described buddy rich as a musical phenomenon\nAnd he said he was extraordinary extraordinary coordination of the hands rhythmic imagination\nThat's ... that's not even the well that's not the quote I wanted to see too so um it was great the a lot of drummers in this album or speaking on buddy rich and how he's really a drummers drummer as a favorite to all of them really\nOh here's what I wanted to read I remember one night the entire percussion section of the Chicago Symphony\nCame in to hear him and damn near had a baby and I thought those great\nSo you're still listening to the jazz excursion this is still southern Colorado's NPR station Ninety One point five K. R. cc\nWas well ... well you [noise] Nineteen I satisfy it gets down to you know down with them [noise] we had tried to sell my team the status of not getting money out of it and I'm like no no one's getting by ... ethics and I think I was like okay you know again it's the simplest thing down\nUntil ... when I see I live in Colorado Springs Madison K. I. C. C. K. R. C. C.\nThere are others NPR station Ninety One point five years cc\nWas well loved while you Nineteen Ninety seven ... absolutely no bells and what we had tried to sell it my teenage daughter stop\nOr get money out of it and I'm like no no one's going to buy it and probably about I don't know six months ago I was like okay we are doing it at the simplest thing I've done\nAnd and I took out a wonderful\nI'm Susan I live in Colorado Springs and I was Kay are these the tree or CBC dot award jeep record donation information\nHey everybody this is the cost of this is Chris ... hello this is Michael far Trump's period\nBetween the Ninety One point five K. or see the music that PMDD made Ninety seven nights a week\n\n\n[noise]\n\n\n\n\n\n\n[noise] [noise]\n[noise] [noise]\n\n[noise]\n\n\n\n\n\nMm\n[noise]\n\n\n\n\n\n\n\n[noise] ...\n\n\n\nAnd\n[noise]\n\nFollowing nut Pete McCann from his album paid for it on the other side and that was a trip to\nFollowing that Pete McCann from his album pay for it on the other side and that was track to floor three\nIn the last track there was without a doubt from the one o'clock lab band after album lab twenty Eighteen the rhythm of the road\nThis is southern Colorado's NPR station care C. C. K. R. C. C. H. D. Colorado Springs ... hunter key CCS sparked will start Phil and K W CCF in woodland park streaming accuracy seat or gee [noise]\nHi I'm Tim every Sunday evening just show or Ninety One point five years he\nJoined me for a journey through mainstream lead you to know the vocal was covered all Sunday evening seven to ten Ninety One point but here's the [noise]\n[noise]\n[noise]\n\nMm Mm Mm Mm\nIt wouldn't be able to do the same time the baby's mother what did they\nI was able to\n\nIt was a little bit below and brave from the group tree blew up their album elemental door and before that you heard about performing little bit of a dream that was live a savannah jazz\nMark clerk Mike clerk I'm having a great time with words tonight Mike clerk and Dilbert bomb was just before that from their album retro report and that was deep in the inner city\nAnd the beginning that set was last phone from eddy Henderson from his album be cool\nYou're tuned to Ninety One point five K. R. C. C. southern Colorado's NPR station and you're still listening to the jazz excursion\nMore and more people are getting their news on mobile devices in through social media in Ninety One point science he ... he doesn't have to be any different missed It's MORNING and you can't find it on our website getting out of your car went to keep listening to all things considered download the mobile apps\nAnd he didn't want a local story impacting your community followers on Twitter feel like passing along that NPR story like us on Facebook and you've never stop\nWent five K. R. C. C. southern Colorado's NPR station and you're still listening to the jazz excursion\nMore and more people are getting their news I Know that might be through social media in Ninety One point psyche are cc doesn't have to be any different snippets mornings and you can find it on our website getting out of your car went to keep listening to all things considered download the mobile apps and he didn't want a local story impacting your community\nFollowers on Twitter feel like passing along that NPR story Mike is on the ... can you never stop can either do we Ninety One toy scientific RCB new\nMemberships or the largest source of funding in Ninety One point five K. R. C. C. allowing us to bring you local stories NPR News in music thanks for your general support\n[noise]\n\n\nUh\n\n\n\n[noise]\n[noise]\n\nThat was everything in its ray place originally a Radiohead tune performed by bread mellow and the bread Mel doubt trio on their album anything goes before that Herbie Hancock from his album the prisoner and that was the tune I have a dream\nQuick side note I watched a movie this weekend delivery and certify beautiful graphics good story and Herbie Hancock was a I'm\nA military figure and they're really good I don't recall seeing him in movies but I'm sure I have so altogether very talented due to always loved his work and check out that movie if you get a chance\nThis is Ninety One point five K. R. C. C. southern Colorado's NPR station DJ Iran will be up after our next set with the ... our\nSupport for Ninety One point five K. R. C. C. comes from our listeners answers from local organization wants to reach a discerning audience that values quality [noise]\nMarketing Ninety One point five carry the underwriters reached the people most likely to shop in their business support nonprofit and by taking their shelves [noise] to learn more about corporate department costs seven one nine four seven or eight year old\n\n[noise]\nCorporate support called genetic seven one nine four seven or eight zero why\n\n[noise]\n\n\nBoom boom\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\nNeeded if he\nShe she\n[noise]\n\n\nYou are so much for\nThe [noise]\n\n[noise]\n[noise]", "show_name": "Jazz Excursion", "year": "2018", "city": "Colorado Springs", "day": "15"}