{"month": "10", "state": "PA", "station": "WVYA", "content": "Information at a color guard half dot com [noise]\nI'm Fred Child this is performance today from eight PM American public media\nThis was W. V. I. eighty nine point on FM W. B. I. H. D. ones record Wilkes Barre have pulled in W. B. Y. eighty nine point seven up and Williamsport\nWTO eighty eight point three of ... Mansfield and W. P. A. U. Ninety One point five FM palm Ira township streaming live at W. V. I. A. dot org we'll translators in Allentown that Ninety nine point three and in Bethlehem at one of my point seven\nListener supported public radio W. V. I. S.\n\nMostly cloudy this afternoon with a slight chance of showers or thunderstorms has in the upper seventies and mostly clouded this evening with a thirty percent chance of showers and thunderstorms lows in the lower sixties you're listening to WBAI\nEvery hour of every day the programming you've come to expect on WB I he's paid for through the financial supportive listeners like you think so much for your membership learn more about membership and sign up today at W. V. I. A. dot org\nIt's October and live from here with my family is kicking off that's even at hardly strictly bluegrass in San Francisco this weekend [noise] you know the one with the Golden Gate bridge to tune in for that so gas and Lindsay Buckingham answer rate for the riff raff\nRadio there will be there with our new music director Mike Elizondo and our news team with our allies in America correspondent Tom Papa dum da da da da da Vinci a up out [noise]\nOr something a bumper sticker or something special call or two we'll or history or values lifestyle here we haven't forgotten to care\n... grown to be one of the most scientifically adventures and innovative build your organization in America but we've never forgot where we come from we care such an old idea mostly [noise]\n\nFly from NPR News in Washington I'm Barbara climb President Trump is taking political advantage of the Senate confirmation yesterday of his Supreme Court pick Brett Kavanaugh at a campaign rally in Kansas last night the president demonized Democrats and called on supporters to vote in November\nAs President Trump told the hyped up rally crowd about the confirmation of Brett Kavanaugh he focused as much on the fight is on the victory painting Democrats as an angry mob out to destroy Kavanaugh each mention of Democrats drew loud boos\nAnd then Trump turned to the midterms saying the fight has energized Republicans\nWhat each of you will have a chance to just four weeks director your verdict on the Democrats conduct at the ballot box [noise]\nEarlier on air force one reporter asked Trump if he had a message for the women who are devastated by Kavanaugh's confirmation after he was accused of sexual assault Trump said he doesn't think they are camera Keith NPR News\nThe opponents of Kavanaugh's confirmation say they're also emboldened NPR Shannon van sent spoke with many protestors on Capitol Hill yesterday who now say they're going to energize voters\nSeems like for the most part the mood is one of determination there were a few protesters I spoke with who seemed to be depressed that resigned I thought the confirmation votes at but the majority of the people I spoke with solved a both upset but also very an impassioned [noise] and I said that they felt that they\nThey are camera Keith NPR News\nOpponents of Kavanaugh's confirmation say they're also emboldened NPR Shannon van sent spoke with many protestors on Capitol Hill yesterday who now say they're going to energize voters\nSeems like for the most part the mood is one of determination there were a few protesters I spoke with who seems a bit surprised civic resigned\nAbout the confirmation votes at but the majority of the people I spoke with solved a both upset but also a very impassioned\nAnd I said that they felt that they needed to take back the country as as some people put it in and really take back the courts and he said that they wanted to fire up voters for the for the midterm election\nNPR Shannon's and sent on Capitol Hill secretary of state Mike Pompeo has stopped and sold to brief South Korean president Moon Jae in on a three and a half hour meeting with North Korean leader Kim Jong on bump pale is providing no public details but moon told him well done\nIt's now been nine days since an earthquake and tsunami flattened parts of central Indonesia the death toll has risen to more than Seventeen hundred NPR's Lauren Frayer reports from ... where the search for bodies continues\n[noise] workers shovel away the rubble of one wall of the holidays airport part of\nThe ceiling its collapse two but commercial flights are landing on the damaged runway\nThis airport is a bottleneck through which some aid supplies are trickling in won't give up what level of logistics coordinator Sam ... says he's set up a makeshift kitchen on the airport grounds to feedback you eat\nThree whole neighborhoods of Polly were mostly buried under mud the government is considering declaring them giant memorials were an unknown number of bodies remain Lauren Frayer NPR News ... new Indonesia\nThis is NPR News\nTurkish president tie up ... says he's personally following the investigation of a prominent Saudi journalist who disappeared last week after entering the Saudi counseling is Stan bowl\nSome Turkish officials say Jamal ... was killed ... who's a sharp critic of the Saudi regime has been a contributor to the Washington Post\nThe international police agency Interpol is calling on China to divulge the whereabouts of its president NPR's Rob Schmitz reports Interpol chief left France for native China late last month and has been missing ever since\n... president Malone way is the first Chinese national to head the police agency he also serves as China's vice minister of public security that's why his disappearance so surprised international observers\nThe south China Morning post has reported the sixty four year old Communist Party official is under investigation and China's citing anonymous sources police in France have launched their own investigation and amongst disappearance after being contacted by his wife and Leone where the ... and we're in trouble as its headquarters\nMalone was last seen in France on September twenty ninth before he left for a trip to his own country he was appointed head available in twenty sixteen is expected to serve until twenty twenty Rob Schmitz NPR News Shanghai\nThe private aerospace company SpaceX has going for another first tonight after launching a satellite atop a falcon nine rocket it plans to end the rockets first stage back at California's Vandenberg air force base\nNine minutes later I'm Barbara Klein NPR News in Washington\nSupport for NPR comes from capital one committed to reimagining banking offering savings and checking accounts that can be open from anywhere capital one what's in your wallet capital one\nThe private aerospace\nCompany SpaceX has going for another first tonight after launching a satellite atop a falcon nine rocket it plans to end the rockets first stage back at California's Vandenberg air force\nBase nine minutes later I'm Barbara ... NPR News in Washington\nSupport for NPR comes from capital one committed to reimagining banking offering savings and checking accounts that can be opened from anywhere capital one what's in your wallet capital one day and that John B and Kathryn ... foundation at ... found a dot org\n[noise]\nHello and welcome to notes on film I'm your host policies are on notes on film\nYou explore the cinematic scores featured in films from a classical psi phi traumatic genres but summer blockbusters old favorites and more on today's show we feature selections from two thousand nine avatar\nThe film featured Sigourney Weaver is always felt Donna Sam Worthington Steven lying and Michelle Rodriguez and was directed by James Cameron the film is set in the mid twenty second century as humans are working to colonize Pandora\nA habitable moon orbiting a gas giants and the ... system in order to mind the mineral on obtaining it however as the mind colony expansion comes into conflict with and threatens the survival of the native people the Na'vi\nDevelopment of avatar began way back in Nineteen Ninety four the film was set to be released in Nineteen Ninety nine but before production began cameras stated that the necessary technology for his vision of the film was not available to him and so the project was postponed\nCameron began working on the language of the Na'vi in two thousand five and he would develop the screenplay and fictional universe in two thousand six\nIt premiered in London a December attempt to two thousand nine now was released to the United states and Canada December Eighteenth two thousand nine critics highly praised the film stunning visual effects and avatar would open to mostly positive reviews\nThe theatrical run of avatar saw the film break numerous box office record it will become the highest grossing film of all time raking in over two billion dollars\nAvatar was nominated for nine Academy Awards including best picture and best director and won three for best art direction best cinematography and best visual effects composer James Warner which were the film and it would mark his third collaboration with James Cameron after aliens and Titanic\nWater would record parts of the score with a small chorus singing and the Na'vi language in two thousand eight he also teamed up with an F. nobody's a college just to create a music culture for the Na'vi\nDecompose the score is two different scores merged into one he first created a score that reflect the Na'vi way up sound and then combined it with a separate traditional score to drive the film\nLet's get to the music now on notes on film as we begin today's presentation of two thousand nine avatar with you don't dream and cry on your arts and information station\n[noise]\n\n\n\n\n\n\n\n[noise]\n[noise]\nOr uh\nOr [noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n[noise] the bioluminescence up tonight on notes on film before that fewer spirits of the forest and we opened the set with you don't dream and cry you were listening to selections from James Cameron's avatar released in two thousand nine with music composed at conducted by the late James wonder\nWe'll get back to the music and just a moment but first it's intermission [noise]\nJames Cameron said his inspiration for avatar was inspired by every science fiction book you read as a kid in a time magazine interview back in two thousand seven Kamron was asked about the meaning of the term avatar man he replied it's an incarnation of one of the Hindu gods taking the flush born in this film what that means is that the human technology\nIn the future as capable of injecting a human intelligence into a remotely located body a biological body\nTime now for some fun facts about avatar first at the time of auditioning after Sam Worthington was living in his car second director James Cameron known for being tough on set precedence allegedly kept a nail gun onset they would use to nail cell phone that had the misfortune of bringing to a ... above the exit sign\nFinally after Chris' point would go on to play James ... Kirk in Star Trek rebuild what edition for the lead role in the film but would end up saying it was his worst audition ever some fun facts about avatar\nComing up it's the weekly trivia question coming releases and more but first it's back to the music as we continue our exploration of the soundtrack to avatar which climbing up ... the path to heaven on WB IRA\nMatter\nAnd [noise]\n\n\n\n[noise] scorched earth ... notes on film before that Jake's first flight and we open the set with climbing up ... the path to heaven we're listening to selections from two thousand nine avatar directed by James Cameron with music composed and conducted by the late James Warner\nMore music still to come but first let's test your movie metal with this week's trivia question the spiral shape creatures chicken counters early on in the film or giant versions of the\nMarine invertebrate commonly captain reef aquarium what are they said that answered immediate policies are W. V. like a dot org that's P. A. U. L. L. E. Z. A. R. W. B. A. dot org by Wednesday of this coming week\nThe winner receives a well deserved round of applause\nComing soon to theaters across the land goose bumps to hunted Halloween opens October twelve that's rated PG\nThe remake of the ... gentle classic horror film ... opens November second it's rated R. the crime thriller the girl in the spider's Web opens November night there's no rating on it as of yet but sources indicate that it will have an R rating and creed to opens November twenty first and that does not have a rating as of yet either [noise]\nLet's get back to the music now want notes on film as we continue our Journey Through the soundtrack from two thousand nine avatar with gathering all the Na'vi clans for battle now on your arts and information station\n\n\n[noise]\n[noise]\n[noise]\n\nOh\n\n[noise]\n\n\n\n\n\n\nOr\n[noise]", "show_name": "Notes on Film", "year": "2018", "city": "Williamsport", "day": "07"}