{"month": "10", "state": "PA", "station": "WVYA", "content": "Right wing ideologue who had divided Latin America's biggest democracy Sunday on weekend edition Sunday Morning eight to ten on W. V. I. A. about\n[noise]\nJoined\nMe for the un I Would have live music from ice cream on both sides of the Atlantic ivy neither the chief traditionally these anymore it's live undecided this week on the ... [noise]\n\nComing up at eight pm on WB I Am\n[noise] [noise]\nFrom American public media [noise]\n[noise]\nFrom here in the ... in my yard and drank and yours truly the arena Brock how America is\nAre right in their mind ... I Know\n\nComedian and\nThe Buckingham [noise]\nBy their employee owned an independent bears kept clients financial interests for since Nineteen Nineteen\nOr W ... dot com\nAbout carbon night offering data protection solutions for businesses including automatic back up their servers\nHigh availability and disaster recovery and data migration learned more carbon I dot com\nBy Sierra Nevada Brewing Company\nFrancisco\n[noise]\nJust grieving breathing deeply [noise]\nOh I Wish you folks at home because the world saying right now just look deeply into your radios\nIt's a lovely side a lovely so I thank you to everyone here and everyone back home listening in radio land for making our dreams come true yet another year we are [noise]\nThen ... look again\nI'll root for the\nNew friends Aerosmith to archery is hardly strictly bluegrass [noise]\n\nWe're just totally appropriate here at hardly strictly bluegrass the Golden Gate park\n[noise] hard to put\nInto words just how special this festival is but if my pile Steve Earle but it\nIt's the most free live music reaching the largest number of people on a yearly basis anywhere in the universe that I Know of [noise]\nAnd\nI get to see my friends we get to see our friends here it's so nice nice to see all if you like to see all of your [noise]\nThere's also usually a stricter there's usually a drinker\nBut that's beside the point I Know the question on everyone's mind today is\nHow was my summer I had a great summer thank you for asking I spent a lot of time on a tour bus with my fellow punch brothers drinking my ties because they paralleled with the news cycle and I got to spend money\nOn a tour bus with my fellow punch brothers drinking my ties because they parallel with the news cycle and I got to spend many happy afternoon on a playground in Brooklyn pretending to be chase from pop patrol\nSometimes if I was lucky my son would like to\nBut I also spend a lot of time this summer thinking about a different children's television program after watching a documentary about Mr Rogers\nCall [noise] won't you be my neighbor have you seen it\nHave you stopped growing yet made her all the tissues on delta flight three Ninety were not enough to soak up my parents were not an official consider this my formal complaint twenty five thousand bonus miles deposited into my count up to cover it\n\nOn a series not there's been a lot of confusion lately about what it means to be a map\nA real man\nFred Rogers was a real man\n[noise]\nI'd never thought I'd want my son to be more like a daytime TV star who played with puppets\nThan a Supreme Court nominee [noise]\n\nThen the bride or there'll be due\nTo this is changing going to turn this thing\nThat goes without saying\nShe'd go steady as\n... known\n\nThe funeral\nBegan to choose he isn't\nLike we want him to do some necessarily bleed red blue\nFees [noise]\n\n\n[noise]\n[noise] [noise]\n\n\n\n\nBoy speak you know boy I'll be speaking with mine it's been since ... boy the\n... channel men's channel some bars too bad with the harder so the lover says the holding cells as friends do and should do to them and he won the\n\nNot sure what that means that\n\n\n\nWell [noise] [noise]\n\n[noise] [noise]\nReally\n\n\n[noise]\n\n\n\n[noise] [noise] [noise]\n\n\n\n[noise]\nOf the show was brought to you by San Francisco board of you are is um in our new slogan\nPrint let's go in for you you rent taking visit does raise the food at great Nightline in San Francisco it's for you I'm a software engineer and bother to San Francisco with for years\nGreat Nightline in San Francisco is for you I'm a software engineer and father of to San Francisco is for you know visual artist gonna like San Francisco is for you I'm an ER doctors studying to become a Buddhist monk [noise]\nSan Francisco is definitely for you [noise]\nDo other cities make you feel like a weirdo just because you live a little differently to go is for you\nI'm a studio musician in transcendental meditative boots counting down the days till November six like an advent calendars [noise]\nSan Francisco I use cloth diapers and claw sandwich bags\nYou know it's\nGo to the doctor because I discovered the healing heart how we're of quartz crystal [noise]\nSan Fran for you baby hey do you want to be a part of the new economy through on a honey get on your computer and check us\nIdle limited my carbon footprint in do you agree to a new ... every year it's\nKind of guy who was looking for a place to live that slightly more expensive than Manhattan but as an LA [noise]\nSan Francisco and definitely for you\nDowntown and make two hundred and fifty thousand\nDollars a year and can't afford a studio apartment in Selma maybe open for you [noise]\nVolunteer on a computer chips are because they live off my parents' trust fund [noise]\nSan Fran I'm a Reagan who wants to be buried in a mushroom bag\nI Am an eyebrow coach monthly made a few\nFriends for [noise]\nAt this time a number of our stations need to take a break to fill their listeners what station they're currently listening to and what the weather is like in a place where they currently are we'd like to take that opportunity to play a piece of music\nThat comes from where we currently are this week's local break features the great Oakland band tower of power\n[noise] um [noise] what\nThis was W. V. I. eighty nine point nine a pound WB I each one scratch Wilkes Barre he's written W. B. Y. eighty nine point seven up and Williamsport nobody TI eighty eight points ... Mansfield um W. P. A. U. Ninety One point five FM Palmyra township streaming live a W. V. I. A. dot org\nWe'll translators in Allentown at Ninety nine point three and in Bethlehem at one of my point seven listener supported public radio W. V. I. S.\n\nCloudy this evening with a slight chance of showers lows in the mid sixties mostly cloudy on Sunday with a slight chance of showers are thunderstorms in the afternoon highs and the upper seventies most of the quality of Sunday night with a thirty percent chance of showers and thunderstorms lives in the lower sixties\nAnd partly sunny on Monday with the thirty percent chance of showers and thunderstorms highs and the upper seventies you're listening to WBAI eight eighty nine point nine Afghans [noise]\n\nMe for an out of my ice cream on both sides of the Atlantic ... to ... I mean we're live on ... on the one China [noise]\n... ... eastern traditionally these on anymore it's live side if this week on the system in China [noise]\n\nComing up at eight pm on WB I Am\nBack [noise]\nAbout it\nThat you think\n\n\nGraders and gentlemen please take a moment to join me in a welcoming for the first time as musical director the secret to wizard himself Mr Mike and was no [noise]\nPut some money for his contribution already and we're really lucky to have him with us all\nSeason long and hey we're excited to announce a brand\nNew segment this season one that runs contrary to my nature is a control freak\nWe're calling it three minutes of the improv three minutes of improv [noise]\nWe have no idea what's going to happen but I Know that it's one of the great pleasures of my life to play music with Mike Elizondo surfer this first installation\nOf three minutes of improv\nWere the a timer for three minutes start playing and see what happens is\nWish us luck this is a beautiful place right\nLike how does it sound in your heart and had to end fingers and right now being in this place\nIs is this your first shows researcher or move your mouth you know\nI think you got to take this from Chris I bet you I think you got to take this one man it's it's it's all you\nAlright alright tough tough but fair I'm okay\n[laughter]\n[laughter] [noise]\n\n[noise] [noise]\n\n[noise]\n\n\n\nI Can't believe that my life including getting to do something\nLike ... or radio\n... Lindsay Buckingham talk show [noise]\n\nOh yeah\nWe shall\nCan treat\nOver ...\n...\n... ah\nI Know\nTreaty you won a\nLow\n...\nLa la la la\nAnd he\nDid yeah\nOh\nYeah\n...\nWho he is he is\n...\n...\nC\nI could see him\nTime no longer\nMust have a ...\nJeff ...\nDitch your ...\nYour ... just\nIn ... ...\n... there's a\nWhole\n...\n...\nHow man a man who\nThe\nMan clearly yeah\nThere for\nHundred no good job I\n... ...\n... and it's\n... a\nDa da\nAbout our fun live from here banned the\nDuck time and\nAnd this is about to be\n\nThe pay any need to be that um they you know that is that they have\nPaying off the you know that right now they're looking at the higher\n[noise]\n[noise]\n\nYou know the Disney ... what what was\nThe next song is called by\nThat means to move forward\nAnd that's where we got to go no matter what\nGet back home these something\n[noise] oh I just want to fall in line\nOr something\nOh I just want to fall in line\nBased on the\nI don't see a\nNot mess it up\nLike the\nBill more now than when I was treated as a tool\nMet a man [noise]\nDo that right [noise] [noise]\nC ... [noise] they\nOr something [noise]\nSee some [noise]\nLately\nThen my heart\nJudging\nMine oh man\nYou my friend but do you [noise]\n[noise] [noise] Mm\nThey read a\nOn and he said oh all\nI don't know where I'm\nGive it time and I don't\nOr any ...\nAny day now\nOr any ...\n\n\n\n[noise]\n\n\n[noise]\nIs India are read\nNo matter what I Would always be the reason\nI got to meet in your once and can confirm that she is nothing short of a ray of light as one might expect upon hearing her music such a\n\nTo have to let us opens and give them a bother with the windows and they'll be able to pull the Marlboro [noise]\nSo not ...\n... by\nGlass half ...\nA leader\nWill know\n\nGotta be\nIndia or read [noise]\nPublish off his birthday segment with the one and only Jillian well\n[noise]\nTuesday\nYou know whenever I get down about the world\nI remind myself that it contains a whole lot of Gillian Welsh sons\nThere's a piece of profound to music by giving it a lot for any occasion including this one\n\nNo\nGo\nDon't you\nKnow\n[noise]\nThe nice if\n[noise]\n... [noise] a\n[noise]\nThat was that it's time for an instrumental that's instrumental break is supported by Sierra Nevada beer crafted to be instrumental to your weekend\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\nCalled gold rush for a ride so [noise] with our targets on the federal Chris over\nOn the guitar [noise]\nYou have been around ... ... and you can check out here it's on Comedy Central it's not very funny and the only\nThing that you came for music and I'm telling jokes what's going on\nSan Francisco [noise]\nUm I always wanted to say that dream to come true ah\nHow fantastic I mean I'm\nOn tour with Lindsay Buckingham\n[laughter] I mean you know it's not official\n...\nTo me so\nSome\nThink he's very while I was in ...\nMe to tell you man says um\n\n[noise]\n[noise]\n[noise]\n\nThis is my favorite yeah\nLook it's my favorite surfer he is so totally your point what's my type skinny eighties nerd is going to grow up into that Grey's Anatomy guy now that\nHey guys welcome back I'm Chad can start you off with some drinks tonight\n... Ah yes\nYes that will have a bottle of the house red please and thank you how did\nYou bet I'll get that out you guys prone to okay thanks [noise]\nAnna may I point out to you that you were just totally rude to my favorite server oh man I point out to you that your favorite server just called us guys\nYou guys he said it twice I didn't even notice of course now we've been called Geiger entire life we don't even hear it anymore but once you start\nNoticing it it's the men are only a few days ago my nephew from high chair was saying to me and my mom well what did he want from you guys Thomas and that's not funny [laughter] but come on women call each other guys all the\nTime that's the point where all too happy to be like she was in with the most valued gender is ... keeps coming back kept coming\nGuy's house read for ya what you guys like to go first or oh out the door at the little spill their K O man oh boy I thought there goes my cellphone died\nMy\nGod oh it's fine it's fine really why don't we just order um I\nHave like the all of the book a teeny yeah the ...\nFor the woman and I another woman with like the ... oh\nOkay oh get that right in and again those are ... yeah\nI might put this fork in my ... crushes over in\nMagic and if you walked up to a table dude didn't was like hey gals can I start off and drink and there'd be a fight there would be a ... fight they'd be like what\nDo you just call laws\nChic dude let's go pee on ... yes\n[noise] you\nThought about it you know I think it's weird that the mom carried the baby for almost a year you know read her life and childbirth and then we named the kids after the dad\nIn one of the dad do the equivalent of ...\n[noise]\nWhich you write their names are on everything yeah every street I walked down is named after him in every building I Walk into is named after a man when I was born I was named after a man and if I ever marry all have the option of changing from being named after one man to be named after a different man\nOh man James Brown was right it's a man's man's man's man's world [noise]\nIt's just three man says it's a man's man's man's where I could have started with man's man's man's man or you're thinking of it's a mad mad mad mad world oh I Am\nBut here's one beyond say who runs the world okay who'd win a fight between beyond saying James Brown Green Bay would clean up dude don't call me do o\nO G do you hear some fresh bread for ya but be careful the plate is hot [laughter] just like you to come on they um maybe this is to forward but uh I\nBe careful the plate is hot just like you know what they um maybe this is to forward but ah I see you in here a lot I was I was wondering if maybe you'd like to get coffee sometime\nOh Chad that took some ... oh I'll tell you what Chad if you have a single friends maybe we could double date with you gals\nUh I don't know what's happening right now\nI was just wondering if you'd like to go out and get some coffee\nYou know what she'd like how about a little R. E. S. P. E. C. G. were not lesser then we're tired of being called guys at the end versus or derogatory\nSo that's a no on the coffee\nAt a girl [laughter] [noise]\n[noise]\nThere's gotta be more at all [noise] Serino broke and how we run\nY'all\n[noise]\n[noise]\n... ... ...\nYou know yeah and hit me yeah\nAnd made me see well uh-huh\n... yeah\n\nYou\nKnow going back to the\nKeys", "show_name": "Live from Here", "year": "2018", "city": "Williamsport", "day": "06"}