{"month": "10", "state": "PA", "station": "WVYA", "content": "Novels in the great American read\nOn nationwide celebration of America's Best loved books Tuesday nights at eight pm on WB I ATV serve out October more information is available at W. V. I. A. dot org slash great American read\nThis was W. V. I. eighty nine point nine a pound WB I each one scratching Wilkes Barre have pulled in W. B. Y. eighty nine point seven up and Williamsport WTO eighty eight points ... Mansfield and W. P. A. U. Ninety One point five FM Palmyra township streaming live a W. V. I. A. dot org\nWe'll translators in Allentown at Ninety nine point three and in Bethlehem at one point seven listener supported public radio W. V. I. S.\n[noise]\nFrom American public media [noise]\n[laughter]\nThen we\nHear the ... theater in Saint\nDealing with musical director Mike Elizondo and ms eats Donovan and [noise]\nWe have a fantastic house\nThan boy it's a nice day Palmer on keys Brittany hall non middle Chris Albert John good far and Trevor Lewis junior on the drawing ...\nI guess the night oh my God we have a show for a comedian again last son\nMystic Gabriel campaign [noise]\nFive years supported by carbon night offering\nSecure native protections solutions for businesses including automatic back up reserves in advance and point protection high ability and disaster recovery solutions and the automated data migration learn more carbon I dot com Mimi [noise]\nAnd ... bared\nEmployee owned in independent Barrett has kept clients by natural interests merge in Nineteen Nineteen\nOr W. dot com has more information\nAnd by Sierra Nevada Brewing Company standing up for independent voices and beer since\nNineteen eighty [noise]\nShe would you want to see what's happening here on stage tonight you can watch live video and live from here dot org\nHere is produced by\nPublic media\n\nAnd the whole way there I Hope you've had a nice week my wife and three year old or out of the country so I've had the house to myself for the last few days to that\nNot used to that and I can tell you it's been it's been a sonic ally jarring experience uh I've worked closely with the life and here's sound design team to to recreate it for you and your your queued up there Jason\nSyrians I've worked closely with the life and here's sound design team to to ah recreated for you and your your queued up their Jason again okay here we got this is what it sounds like in my home right now\n\n\nThat is the sound of toddler Les Mis [noise]\nAnd it's pretty amazing\nFor about Fifteen minutes at which point it turns into abject lonesome nests\n\nI spent most of the week looking out\nAt the river family is not going to like Kurdish gambling on the road I sit here I'm ...\nI'm ...\nLow similar in the\nWater rose Hi\nNot here\nCal allow theory in\nHere\nNo Mm to do to try\nA little longer road ah\nOn the river and\nI yeah I'm sure\nA\nHuman being banned due ...\n\n\nShe had me this morning\nNo longer ...\nKids me the\n...\nKeys me do I\n\nYou know I guess the main difference between me and a\nIs\nGood I don't think he was on the banks of the East River in Brooklyn when he wrote that song and and also I'm pretty sure my wife is coming back [noise]\nAlso I've known that at the end of my we can get to see what people like you know Donovan and Chris Eldridge [noise]\nAnd [noise]\nAnd if you if you're up for it there is no cure for long minutes like singing with people you love except maybe also singing with strangers when's the last time you did that what can we do we do now should be up for doing it now [noise] what's up with something we all know I mean\nHard times we all know how hard times foster site [noise]\n\nLetters ... sin lives pleasures and\nBusinessmen me to say well\nWe are so\nSo we're to pull\nTheir service I'm the\nOne thing the four ... been a huge\nOh hard times\nCome again no\nA ... uh\nNo\nIs the ... oh that's a\nWe\nHow\nCome can no more men\nMe days you have\nMany good or Ralph\nDoor\nOr hard\nGetting no oh\nWow we see my duty and\nThese\n\nSaid to me\nA\nVery diverse\nUm [noise]\nOh\n[laughter]\n[noise]\n\n[noise]\n\nSounds like a him doesn't it certainly feels like a him to me just a pop star no ... I mean it's a really really really good pop songs from Eighteen fifty four but it's not a\nSpiritual songs strictly speaking isn't it amazing though how any piece of music and become a him if we get together this week's new song is they ... him to all of those non him out their per se if\nYou will\nSpelled like ... only with an H don't you think it's funny on paper I promise [noise]\nI don't want to send the song out to all you lay men and women who have the urge to harmonize to address voices to the choir without drowning out your fellow singers it's a pleasure to be with you this evening which makes music\nBeen city he he being ...\nBy the pool man and\nA blue blanket to swing\nCurrent legal ground power line taught at the department of TV\nGloom in the dark catchy he'll breathing for\n[noise]\n\nSwing spoke [noise]\nLet's not use them turn\nThe city's much doing\nThe blood ... ...\nGood attorney ski [noise]\n[noise]\n[noise]\n\n[noise] Mm [noise] [noise]\nYou know the satellite phone [noise]\nJake's income home [noise]\nJason do\nIt all the stuff that goes\nBack to simulate [noise]\nShady Asian snake [noise]\nShady and to create new in the state\nThree she\nDo you do to follow him sales\nFriendship FOIA tales\nThe bank to family back to Baltimore\nSharon Bodie Israel's\nOn the back to family back to Baltimore\n\nThe tall law convenience store [noise]\nBeans are sitting around the ambulance well\nNo they're the ones I Know what that is not known ... any more\nHave to go\nWith some some well to do for\nFamily was broke\nWe became friends [noise] the parking lot of the shooter field\n... and the ... she was going in a holiday\nTo pay them not to sending to my mom would the county jail [noise]\nLive tree or me under the sun\nI'm a ...\nDegree you to reach Barnes planning dreams and some guy in the pitch this\nThis uh the ... well\nBeing you is the is it that I'm going to be\nGoing back back to boats in\n\nThe ... the convenience store the in the food and\nThe um ...\nNo that is a no ... and ... any more but I\nHave to go ... ...\n... ... ... Scott him too soon to find to Kim\n... surgeries later that night buildings\nSerious show but next morning he died in the satellite phone with the crew which made\nI'm Talking to Tom ... months old [noise]\nPregnant with law [noise] preparing for the things that may make you feel\nNew mom you know no ... well [noise]\nThe neighborhood block\nAh will Lee\n[noise]\n\nGabriel ... hand [noise]\nThey'll get you some more for travelers [noise]\nMm [noise] [noise] [noise] yeah\nYou face the music do you ... you don't need to using IP UPENN managed\nRip up the ticket because he didn't cheat jak\nJonah picking keep that route so bad\nSo you'll be promoted to defend that batch of end up ... percent matching\nI'll tell you the woman and assembled detached\nHave like you cannot do you feel bad batch ban such she'll get ... you see the picture but things show bash\nYou cannot do you pay that much better ... ban should be in the ... but the thing is so bad\nIn the window a taxi cab but yeah\nLike I'm ... I think you'll die\nAnd get back in the lives back in the day they don't die\nKnow you don't get the\nWould you then you lose to\nNot have the when they have a cup of judgment and the\nYou go to heaven if you've been that\nWWW been that bad\nEnd in Stockton Julie said they don't try\nDoppler the game you know you don't get what you\nBeing not have my head trauma don't\nJulie later and I\nHave gotten a judgment day\nWhen\n\n\nTime now for our local break which which is going to be some some votes for yeah I mean I don't think I Would have\nThat comes from St Louis check it out that first record they made trace which you know it's kind of one of the things that the bill that that that old country swell up to a fever was recorded in Nineteen Ninety four in Northfield, Minnesota [noise]\nMinnesota town which as you may know if you've been listening to this show I might still be banned from\nMore on that never [noise]\n\n\nI\n\nTo you\nI can change can happen now she did she know that\nWho the hell did it how the that\nHe's going to be keep it thins the data\nTuesday\nWe\nOwe Donovan [noise]\n\nAnd I started walking back on traveling corresponded comedian Tom ... in a second we caught up in America are you there Tom I'm here\nCrafts that was a beautiful song it was fun listening to it from inside the parking garage\nWhen I'm ready to go on behalf of fly from here I'm resuming my journey across the country sharing the good stories of our fellow Americans\nThis week I traveled to Buffalo New York along Lake Erie were the sky was cloaked in a constant gray missed allowing for just occasional peaks of the colorful leaves\nThe forecasts was calling for the first snow fall of the year but for the good people of buffalo that's not even cause to wear a long sleeve shirt\nWhen you live in Buffalo complaining about the weather is complaining about life itself\nI was picked up at the airport by a woman named Charlie she's been driving for twenty two years and their cabinets filled with stuffed animals they line the dashboard hung from the rear view mirror and the monkey was attached to the steering wheel\nThese are my co pilot she said some people have Jesus I have these guys she goes by Charlie because her father was hoping she'd be a boy I really think the name made me a bit of a tomboy when I was younger\nThey don't say tomboy anymore now everybody is filled with gender fluids\nI guess I was ahead of my time but anyway I'm all girl now and everyone still calls me Charlie\nAfter growing up in Buffalo she went to college down in Arizona because they want it to go to the hottest place I could find but it turns out I'm not built for the desert seems more like a place for lizards people who stay there\nYou can find but it turns out I'm not built for the desert seems more like a place for lizards people who stay there too long start to look like us funds that was left out in the sun\nShe came home after school and it's been in Buffalo ever since we have a lot of moisture here and I love it I'm like a plant water me and I grow when it's not raining it's snowing and when it's not doing either we can count on them is from Niagara Falls are you here to see the falls\nHave you ever lied your cab driver about seeing Niagara Falls because you didn't want her to know you planned your entire trip around eating buffalo wings [noise]\nTo drop me off downtown and I went out looking for a bar if you're looking for a bar or tavern buffalo is a good place to look they have a lot of them and last call his four AM they say that staying up to open later gives the snow plows time to clear your way home [noise]\nI entered what looked like one of the older bars in the city covered in lights and years of signed coasters stuck to the walls to kind of place where it's always midnight the kind of place that so tired that even the ceiling seems to be hunched over at the end of the bar\nThe bartender was a big bear of a man named Chris he had a giant beard and big pause and then grab while he worked\nHe says he's been in this bar for Thirty years and then he's been there so long he doesn't even smell they're famous buffalo wings any more people come in all the time and they say they smelled them all the way down the street but I don't smell is thing who knows maybe it's to me they smell\n\nEagerly place my order there's something great about eating food that makes a city famous\nIn addition to whatever natural elements are involved the water the air the ingredients there's also a pride and love and as corny as it might sound the love the people add makes all the difference\nHave you ever been away from home for so long that you started professing your love for a plate of deep fried chicken wings\nI have\nCritz had a big hartfield laugh his kids are grown and just him and his wife down the kids all moved away which means that his grandchildren are too far out of reach for his liking\nI don't understand what everybody's after I mean sure moving to another city you might get you a little more money but when you lose from being away from your family is too big of a cost everyone complains about their parents until they shell out twenty dollars an hour for a babysitter and then suddenly we're not so bad\nHe keeps busy with this bowling league he said people like to knock bowling but it's a damn good game especially when you have your own shoes he pointed at a wall of bowling trophies behind him that his team and one throughout the years their name is great falls a fire\nBut this year we're a little nervous we lost one of our guys to a heart attack and there's a young team called the kings that's been gunning for us but we refuse to lose to a team whose name isn't even a little funny it might be a different story if it was ... splits\nAmong the trophies with the fate of newspaper article featuring a high school football team there was a picture of Chris he was the captain in the last year they won the state championship\nThis was a different life it's all just a memory now he said just like this will be one day have you ever started to tear up about bartenders glory years only to realize it was just your eyes watering from a plate of piping hot buffalo wings\nAnd boy were they hot my lips were on fire\nWatering from a plate of piping hot buffalo wings\nI have and boy were they hide my lips were on fire tears were rolling down my cheek I wasn't thinking clearly have you ever tried jak cool and in front of a bunch of local until one of them pointed out that you were sweating from your bald spot\nI stumbled outside to get some air and the first snowflakes were starting to fall the first snow falls like a visit from your family who you're happy to see before they hang around too long and becomes difficult\nI looked up to the sky as a snowflake landed on my cheek and I brushed it off have you ever forgot that you would wings thoughts on your fingers touch dry and had to run into a bar to beg a giant bartender to throw beer in your face [noise] I had\nAnd that's why I'm not a local but I'll return to buffalo just as soon as the snow melt and I buy some gloves until next time this has been Tom Papa out in America [noise]\nIt's supposed to come out on the road\nCity Missouri at the trimming Peter I'm November first\nHey this is Warren treaty\n[noise] I don't know [noise]\nUh\n[noise] Hi\nYou can subscribe to our newsletter for updates on guests and ticket information check out our full season schedule read interviews with our performers in cash to shop for the latest live from her merchandise all that plus video and audio from every show and much much\nMore at life from here to work life from here is produced by American public media\n\nThis was W. B. I. eighty nine point nine of M. W. B. I. H. D. one ... W. B. Y. eighty nine point seven FM Williamsport WTO eighty eight point three ... Mansfield and W. P. I. U. Ninety One point five FM Palmyra township streaming live at W. V. I. I. dot org\nWe'll translators and ... what a three point five I didn't see ... Ninety five point seven you're arts and information station listener supported W. V. I. S.\nProgramming on WB I is made possible by our members and by auto bookstore\nAuto bookstore in Williamsport and W. V. I. A. T. V. invite you to vote for your favorite novels in the great American read\nA nationwide celebration of America's Best loved books Tuesday nights at eight pm on WB I ATV throughout October more information is available at W. V. I. A. dot org slash great American or ... or auto bookstore [noise]\nEvolved he wrote some five hundred concerto but he poured his talents into just one for the cello mandolin on the next Chicago Symphony orchestra program mandolin it out of the ... performed in\nPlus heightened drum roll symphony next time with the CFL nice it's any on the [noise]\nTo not a town on W. V. I. A. up [noise]\nMm [noise]\n\nPeter in St Paul Minnesota Welcome back to my from here with critics feeling just a reminder you can watch what's happening here in life on stage at live from here dot org\n... [noise]\nYou wouldn't be the new Dr ... how'd you do find thanks sorry to be with you but the ER can get stressful you know I'm not going to live with stretched\nOh man you wouldn't be the new doctor Nettie ... how do you do find thanks sorry to be so short with you but the New York and get stressful you know I'm not going to lie we're stretched pretty thin yeah but in any job that must be done there is an element of fun of yeah whatever I'm Glad you're here anyway here's your patients live let me know if anything\nAnd see what we have here are you on the homes\nOr your husband is ...\nYou know you don't look wet let all have you been getting enough exercise not really not recommended five minutes a skipping time each morning\nLike ...\nIt's where you've done on the roof and click your heels over how we think it's been many I live in a basement wonderful then you can just pretend and I'd like you to stop eating coins and stopped taking these pills and remember a spoonful of sugar submitted to go\nAnd join a better a spoonful of sugary literally German [noise] nah but if you don't take your medicine I wouldn't have to tell your mother and father that you are a rather not be that a boy I'm forty students yes you off to the doctor oh we have a severe hand lacerations possible nerve injury I\nHad a nice and whatever the math\nThan\n\nWe have to stop the bleeding give me one hundred cc's morphine drips and it's hard to get that right away\nBut just for them to attend again at the time the kid I supposed to talk about about that\nReal quick to talk of calls and home when you turn on your phone upside yo what\nWould you miss\nWonderful we're going to have to amputate well\nLet's get her into surgery so perhaps one long way while you still a cat\nAfter Mrs pass or don't you divide all depressed I think we've lost their\nHomes and see what we have had\nNight put it to the beach that knew she was like I said well you know I always say when I'm feeling sad and confused and I don't know what to do I have no idea he the\nHow how\nHow does that help like\nNo but it's much more fun and thinking about dead hurry please let me see what I have here in my bag I'm now\nSince strawberry cordial an umbrella typical audience here\nAt his id stipulate to have a clear here she come [laughter]\nOh it was so strange I Would move toward a night and then I heard someone singing about birds and I knew\nTo come back to find out what the hell it up and says [noise] well that's for next time we have changed my work is done what am I in a coma or did that lady fly out the window with her umbrella\nMary Poppins thank you for everything\nShe's not the best ER doctor but she was perfectly practically perfect in every other way\nTo measure blood on the table before we can advocate Daniel [noise]\nWell\nIt's been a heck of a week for musicians birthday is starting with Kesha coal cues your call her birthday was this past Monday Kesha moved from Oakland LA at Eighteen and\nPromptly ascended to R. and B. stardom on the strength of her stone and voice and songs like this\n\n\n\nI just think I\nAnd it's just things that I\nKnow I'm always not\nThe well you\nWould\nLike to do\nDid what you do\n\n\n\nKnees not\nYou should\n\nOh sleeve fleas celebrated his birthday on very we may know him as the head banging hand bloody being based system the red hot chili peppers but let's not forget him as a hilariously ineffectual ... in the Big Lebowski\nThey've given us so much like Lincoln backpacking checks and also this ridiculous baseline [noise]\n\nBought up you've got to get the pop\nKnow this brings me say\nCan make\nOkay yeah yeah we can work\nThat um we've got some super comfortable T shirts there like luck split for daily where he doesn't wear T shirts walking more of a button down kind of guy we have um I don't know button down I'm Sorry I should have been more clear he's like not a shirt guy\nOh OK Baird male and a well let's get some you\nKnow no Gino definitely not you know I Know I should clarify he's also not a pants guy [laughter]\nUm where are you were leaves our colleague leaves yes it's by no means like from trees you know he wears mostly fig but I think he could totally rock a palm fronds [noise]\nWe we sell you don't what kind of clothing store is the normal\nMan [noise] but no ... no ... I mean that's weird isn't it I mean just like okay when customers coming around asking for leaves for their boyfriends birthday is like where do you send them to treat me\nThis is the first time I've heard that you\nDid you see and I'm like a helper\nOkay so you're a serpent told me to eat an apple and I did and then my boyfriend and I looked at each other and we were like oh and she yours soup new food and it felt weird and so he started wearing a leave and I pretty much wore my hands over the important parts\nAnd it felt weird though he started wearing a leave and I pretty much more my hands over the important parts [noise] and we're going to say he's pretty weird that you're ... yeah the mole is pretty nasty [laughter]\nWell that's always\nGarments ah we've got these nice crude or the ... you know for no fruit a sense of um air directs the world wants you know what I mean maybe it would just like a\nNew Kim Jean tang\n[noise] where'd you find Saddam\n\nAnd back there on the piano Mr Gabriel ... [noise]\nSo\nWas before there were jammed bridge Analytica\nAnd before there were Russian trolls and before even that was Facebook before my speech there was a website called Craig's list and back into doesn't fix I wrote a song cycle called Craig's list leader where I'd said actual ads from Craig's list to music I'm going to do one movement from that cycle this is called neurotic and lonely [noise]\nErotic and lonely average height brown eyes slightly disproportionate brown curly hair Jew fro Twenty years old Twenty years old [noise]\nSlightly hunched occasionally employed anthropology of chain smoking Jew ... we're leaving with parents will\nAll through the rooms\nTo deal with emotional problems neurotic\nMedicated neurotic\nSikhs\nGorgeous artsy Jamie won\nIn ... in St Louis saw the score [noise]\nMaking out and television moody moving\n\nSo Loni is among\nChinese food tonight it's been shown digested [noise]\nNeurotic and loan neurotic and lonely lonely well\nMuch enjoy videogames much videogames ... enjoy the ... the video game\nSystems my parents were bused to buy one for me my parents are used to buy one for my parents parents parents parents parents my parents were used to buy one for me\nNo\n[noise]\nErotic and lonely neurotic and lonely neurotic alone lonely rod and rod erotic neurotic [noise]\nWhich\nIs so much for one more from from Brooklyn travelers\n... invite my dear friend Christie lead to play along as it's called little of\n\n[noise]\nChristie was to play along which is called little up\n[noise]\n\n...\nYou drew me saying well let's see we miss the most brutal ... little the\nLittle you know the low\n... middle though [noise] I Hope we die you know road\n\nMm\nWho gates to show to do so they played\nBy clear starfish are the times I knew when they used\nTo love those in the [noise]\n... [noise] ...\nI Hope we die and rural moved [noise]\n\n[noise]\nMm\nBeen when we're shrill and our lawn chairs by the sea\nBoth shrunken hands twisted ... speech\nSimply ... to ... the ... [noise]\nWhere do you talk\nTo close ... new peas middle ...\nLove is love [noise]\nThere's no middle though [noise]\nI Hope we die you went through the ... middle man [noise] I Hope we value and will [noise]\n[noise]\n[noise] [noise]\n\n\n[noise]\n[laughter]\n[noise]\n\n\nBut how much [noise] I don't\n[noise] and so much [noise]\nSo I'm not a ... an instrumental breaking Mr instrumental break is supported by Sierra Nevada Brewing Company crafted to be instrumental to your week\nAn instrumental breaking missing instrumental break is supported by Sierra Nevada Brewing Company crafted to be instrumental to your weekend [noise]\nLast week journey comes to us from Britain when he got brandy in our region to from the awesome partying or fiddle player on the ... and\n\nSal um no I yeah I like to stop and frisk him for no reason you know I'm thinking about what Marilyn I'm\n\nIs what our relationship is like a according to Jeff Sessions\n[noise] we saw\nThere were more time for the war and treating [noise]\n\nJob who need to\nKnow ...\nSay\n\nNo no no\nNo where ...\n...\nHe\nUm so and you know\nCold here ...\nI'm hanging over their\nMay be saying the for\nFun though [noise]\nMan their games or\nThrow\nTalk here very sad\nAbout\n\n\nWhere\n\nThose nice for you ...\nDo you um do you watch\n\nBand\nI read\n\nYeah we\nOh really ... you know\nI'm On my mom my mom my mom my mom\nThe mommy oh you are\nWell he\nMay say\n\n\nAbout\n\nBe a\n\n[noise]\nWhoa\n\n[noise]\nYou know we\n[noise]\nWe\n\n\n\n[noise]\n\n\n\n\n\nTo tell a story that he told me right after he got back from that train trip you mentioned earlier that was amazing [noise]\nThey let me off from my kids to be on the piano [noise]\nThere was I said before I took a trip right after the election to try to get out of my New York bubble which is a bubble and to try to have some encounters with books that I might not have met otherwise and I'm a secondary my trip as his two days after the twenty sixteen presidential election I was standing\nOn the platform to get on the empire building up between the goes from Chicago to the Pacific northwest and I'm standing there that she did six guys dressed in plaid shirt suspenders dark denim work boots and they're here which back severely in kind of shaved\nSeveral inches above ... could have been hipsters from Portland Ore Brooklyn but something with like a little askew and I thought well this is it I finally I've gotten out of my bubble and these are the guys are going to talk to but", "year": "2018", "show_name": "Live from Here", "city": "Williamsport", "day": "22"}