{"month": "10", "state": "AZ", "station": "KOFA", "content": "\nTwenty five ... a drink in Ninety One ... Ninety points of an F. M. K. J. C. K. Kingman in Ninety One point three ...\nSunny sky today in Monday's weather forecast for Yuma high is reaching up to eighty three degrees some north wins out five to ten miles per hour\nIn Kingman sunny sky today with the heightened you're Seventy degrees in Prescott there's a thirty percent chance of showers and thunderstorms partly sunny skies with ties reaching up to fifty nine degrees\nIn Flagstaff during the day there was a forty percent chance of showers and thunderstorms partly sunny skies with the highest reaching up to fifty degrees\n\n\nEye what more we want more great music like that that's the September for that special guest Larry ... Canada and the Dexter Gordon too and I want more from along the way\nSam mind or Larry both on tenor sax Japan non piano deal minor base had pizza no strength on drums\n\nThey've drawn here and we welcome you you're listening to the great American music recalled jazz Lewis Nash up next recorded that Vancouver British Columbia gory weeds seller jazz club in one of your lab and here's an order that Coleman to lose connotation\n[noise]\n[noise]\n\n\nThe the [noise] [noise]\n[noise]\n[noise]\n[noise]\nDr Bonnie Smith the history of what the jazz standard in New York that a tad dabble in to what a beautiful tune it is it's the I\nDoctor ... of course at the keyboard Jonathan ... got guitar Jonathan Blake on drums at us from the blue note CD all in my my\nJonathan Christ Bergen guitar and Jonathan lake on drums I just run the blue note CD all in my mind\nYou're listening to jazz would they want to pick up the pace quite a bit here with Cecil Brooks the third\nBoy does he have some people playing with him here Antonio hard on the also Ravi Coltrane on Tanner son of course of John Coltrane Jack ... is the trumpeter Stevens got on piano would like Loni ... all one race\nCecil books the third on drums from the CD smoking jazz it's cut is smoking to eight am in the village\n\n\n\nNone\n\n\nMom\nThat\nThey\n\nIdol\nLong\nAny\nLittle\nBe\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\nDu ... am in the village I'm going to take a guess and say that they're talking about Greenwich Village\nThat Cecil books the third and that was recorded at a club in Montclair New Jersey called trumpet Cecil works the third on drums Antonio heart on Alto Ravi Coltrane on General Jack ... trumpet Stevens gossip the ... money to go on base the CD called smoking jazz but\nDo Ravi Coltrane on tenor jak ... trumpet Stevens got the pianist at toxic oh on base CD called smoking jazz at named fits the bill here you're listening to jazz with baby swan we have some great piano coming up please stay with us\nTime you knew from Uma crossing national here does area will present scoops and spirits of Yuma it'll be the Saturday starting at noon at the heritage library three fifty some third avenue in Yuma for more information you can call us at nine to wait three or four seven six nine zero\nVery Harris doing a very interesting Mitt laid there three very different tunes flowing together seamlessly in the hands of a master of course it never entered my mind meet the Flintstones and I Love Lucy Perry heritage that made that recital hall in Berkeley, California\nYou are listening to jazz with Dave one here is Oscar Peterson from Nineteen sixty four and a legendary trio with ray brown on bass and it said that on drums like someone you love\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n", "year": "2018", "show_name": "Jazz with John Hill", "city": "Yuma", "day": "08"}