{"month": "10", "state": "ID", "station": "KRFA", "content": "\nGood morning Senator Ted Cruz who famously stopped short of telling people to vote for Trump to twenty sixteen convention now calls on\nThis from campaign cruise in Texas today It's MORNING EDITION from NPR News\nMexican officials talk of stopping an air of Adam Central American migrants I'm David Greene and I'm Steve Inskeep\nThe capture the governorship in deep red Kansas also this hour how Afghanistan's elections turned on its Monday October twenty seconds to say a Nineteen sixty two president John F. Kennedy\nTold the nation of Soviet missiles in Cuba news the signal the start of the Cuban missile\nThe news is next\nLine from NPR News in Washington I'm ... Coleman President Trump says he is moving to cut off aid to Guatemala and Honduras and El Salvador because they fail to dump thousands of Central American migrants walking caravan\nThe migrants are in southern Mexico and say they're trying to come to the un Trump says he told customs and border protection and the U.S military that this was a national emergency migrant Louis Puerto ... in southern Mexico and says the migrants will not turn back is very hard because [noise]\nIs in dire\nWe're warriors and [noise]\nWe got to go to the place and we got to\nPresident Trump has made immigration and border security important campaign themes will travel to Texas later today to campaign for Republican Senator Ted Cruz has used in gears up for tonight campaign event with the president\nThen came up over a shopping mall parking lot in Houston a large crowd of supporters cheered for a brief get out the vote rally led by Democratic Senate candidate that or\nJust hotel and brought her six year old daughter with her to vote on their way to school a choice that she decided to cast her ballot on the first day of early voting here but not about the president coming to town to campaign for Republican Senator Ted Cruz\nI think it's going to be packed and I'm not happy little positivity\nIn the morning the Trump campaign says tens of thousands of people have registered for the rally Sarah McCammon NPR News Houston\nThe Justice Department is expanding a program to make crime information available to Indian tribes NPR's Carrie Johnson reports the program has already help identify sex offenders and solve a missing persons case\nThe tribal access program makes it easier for law enforcement in Indian country to gain access to national crime databases\nThe U.S Justice Department says more than Seventy tribes will be able to check those databases with more on the way tribes have used the program to conduct background checks for teachers and bus drivers the program launched about three years ago under the Obama administration but it's a priority for the Trump Justice Department to\nTracy to direct the office of trouble justice\nNPR News Washington the national Hurricane Center says hurricane Willa has become a category five storm in the Pacific ocean with top team wins of one hundred sixty miles per hour that's the strongest wind speed category it's about one hundred thirty five miles west of central Mexico\nAnd expected to make landfall tomorrow\nOn Wall street the Dow Jones industrial average down thirty six points that twenty five thousand for eight\nThis is NPR\nSupport for NPR comes from NPR station other contributors include Jones Day and integrated partnerships collaboratively providing legal services for more than a century forty three officers fired confidence serving clients I was one from worldwide learn more at Jones Day dot\nCom it's a northwest public broadcasting News I'm un Ramallah\nCandidate for US Senate are out to draw distinctions between themselves at the November ... election approaches\nHealthcare with one notable policy difference emphasize during Maria Cantwell enthused and Hutchinson Saturday debate in though Ken ... said the provision she authored in the Affordable CARE Act is working in several states basically people are able to buy insurance for just thirty five\nQuestions just how much of a bargain it is for taxpayers\nBad as heavily subsidized which means your taxes go up even more than they already are\nA new analysis by Wesleyan Media project shows healthcare to be a key issue and federal midterm races\nOne person was killed and three others were injured after a shooting early Sunday at a nightclub in Lakewood\nThe attack occurred at the new world VIP lounge where police found three victims with gunshot wounds and took them to a hospital or one died of his injuries friends took a fourth person to the hospital all three surviving victims are expected to recover the names of the victims are not immediately released\nPolice say they don't know what sparked the shooting that appear to involve three shooters or fired about twenty shot surveillance footage from a nearby business showed the shooters or running from the scene it appear they fled in a vehicle\nPolice are asking anyone who may have been at the club during the shooting or who recognize the suspects in the video to contact detectives or submit an anonymous tip\nTo Tacoma appears county crime stoppers are on the liquid police Web site\nAt the northwest public broadcasting news more news at N. W. P. B. dot org it's eight six good morning I'm to enter a mellow [noise]\nModernize Wisconsin didn't think crop [noise]\nLots of ... saying shipped to Asia from Wisconsin and you'll hear more about that at eight twenty two [noise]\nWashington fifth congressional district has been represented by ... Republican Cathy McMorris Rodgers since two thousand four can Lisa Brown unseat her in a district that has not elected a Democrat since Nineteen Ninety to\nWatch or listen to the candidates and debate live Wednesday night on N. W. P. B. TV and radio station it'll also be on our website an app\nCathy McMorris Rodgers debates leads to brown live Wednesday night from six to seven on northwest public broadcasting [noise]\nSunshine for the northwest today though cloudy skies expected in Tacoma and Olympia otherwise expects sunny skies with high mainly in the mid to upper sixties today reaching near Seventy in the tri city and the west and [noise]\nThings in northwest public broadcasting [noise]\nHeard enforced for Ninety One point five and an oral female and wanted to point three [noise]\n\nIt's MORNING EDITION from NPR News I'm Steve Inskeep in Washington and I'm David Greene in New York City Saudi Arabia's\nIt's an operation that was a real golf ration this was an operational individuals ended up exceeding the authorities and which ones they had they made the mistake when they killed him on\nThat interview was on Fox News and it came a day after officials in Riyadh and now the arrest of Eighteen people in connection with the journalists debt and also the firing of five top officials Saudi Government says that can show gee died after a fistfight during interrogation\nAfter initially calling that explanation credible President Trump acknowledged in an interview with the Washington Post over the weekend that quote obviously there's been deception and there's been lives and quote\nWhat happens next with the investigation and also with the U.S response could have huge implications for us Saudi relations and also for the region stability and let's talk more about this with Gerald Firestein of the middle East Institute he's also\nFormer ambassador to Yemen and has held diplomatic posts in Saudi Arabia as well as in Pakistan and Israel investor thanks for coming on this morning to pressure before\nI dig into this with you um I I Do want to know to me this incident has put organizations with connections to the Saudis and in a sensitive spot in the Washington Post reporter and financial ties between your group um and Saudi Arabia and and I guess I just wonder if the middle East Institute going\nMet last week and put out a statement afterwards or and made clear that uh that the middle East Institute would not accept additional Saudi Government funding until there's clarification or what exactly happened at the Saudi consulate\nAnd and what about um the United Arab Emirates I mean there's Saudi ally organizations also taken funding from them is that is if the board can act in that way as well [noise] well\nUh no I ... the the money that we take from the the UAE he which is a group which has reported on our website it's ah all public knowledge it's not a tied in fact it was mostly a donation for uh the building that we're constructing in Washington\nDid this all speak to to how sensitive the issue is well it does put a\nAsk Dr universe at N. W. P. B. dot org and on northwest public television [noise]\nThe Lionel Hampton school of music at the University of Idaho is presenting an evening of baroque brash the concert will feature pollutes brass an ensemble comprised of U. of I. N. W. S. U. music faculty that is happening tonight at the University of Idaho\nThe races are on he's up for grabs in every state keeping up with the mid term elections can feel like running a marathon\nWas about eating out there every day on the front lines\nThing on top of all the election news can be a challenge and all things considered helps you keep the faith you're the bigger picture every afternoon on all things considered from NPR News [noise]\nAnd that's all things considered later today at four o'clock with Tom cocaine support for NPR comes from this station and from Tara data working to transform how businesses work through the power of data using pervasive data intelligence Tara data leverage is all relevant data to deliver answers to complex business issues\nTara data dot com\n[noise] from pe Jim ... Jim the global investment management business a credential it's for investors seeking alpha across private and public markets learn more it PG I Am dot com\n[noise] and from Viking was accustomed built ocean fleet offering a small ship experience over into state rooms and to shore excursion included in every port dedicated to bringing the traveler closer to the destination Viking Cruises dot com\nBusiness\nMajor province forced to lay there but the rest of the country cast ballots for parliament Pamela constable of the Washington Post joined us on friday just before the voting and now she's back Hi Pam Hi how are you okay thank you very much what was voting day like\nA well it was a it was pretty chaotic um every polling place a I visited in the capital and dozens of polling places across the country a reported on a large problems with\nA disorganization unprepared polling officials last materials um a biometric a quip meant that didn't work\nVery very very long lines um many of the polls opened three four five hours late some did not open at all so it was um a well intentioned effort\nBut the but the but the practical results were were pretty chaotic\nUm use you're pleased that enough ballots were cast a legitimate way that this will feel like a legitimate result\n[noise] that's a good question and I can't answer it yet because as you mentioned um you know a large number of voters and one province Kandahar where there were some serious killings\nWell that voting has also been delayed so you've got two provinces a where the voting hasn't even happened yet\nAnd you also have a dozens or possibly even hundreds of polling stations both in Kabul and elsewhere where people had to vote yesterday a second day of voting because the polls never opened a on on election day itself\nAnd election officials say they're not going to be any uh any results or of any of any significance for\nWeeks and possibly even for a couple of months\nWell so we have no idea who won these elections in ... given that they're not even quite over but let me ask you about what the winners will face we should note people know from a distance that Afghanistan has had a very powerful president to the extent that it's had a central government at all and of course a lot of decisions\nIn some cases are in the hands or influenced by the United states influenced by allies or for that matter influenced by the Taliban which controls portions of the country will this parliament once seated have much to say what were the Robie\nThat's also a good question I I I think and I and I hope I'm that the country and for change when I was reporting from the campaign\nThat this election actually bring change in parliament itself a young people voting young people running a more educated people voting running a and a lot of hope to sort of act out with the old faces and with the news so I think I can still help her that\nPamela constable of the Washington Post always appreciate your insight expect so much they are very welcome she's into\nAn unusual alliance is shaping up between Foxconn that global electronics giant that's building in a normal plant in Wisconsin and some farmers in the state who grow the medical routine thing from member station W. W. M. in Milwaukee Mayan silver reports\nIt's awesome and that means harvest time here at students didn't sing farms in Warsaw general manager Nick than quest is standing in front of a field of brown muddy rose with a degree machine worrying behind\nThat falling to the earth and following up the bad\nAnd the rug being laid out on top behind them\nAnd then people behind those run by hand the route\nAre white spindly chunk covered with dirt and Harry threat Wisconsin soil and climb\nThe American Jen thing along with the wider Wisconsin crop that Foxconn technology group wants to invest in the Taiwanese tech giant that likely made your cell phone is then Wisconsin to manufacture LCD screens in a huge plant south of Milwaukee\nBut pause to the Seventy five year old founder of Sudan thing says the company has a personal linked to a gym thing which you heard about after meeting Foxconn CEO Terry glow in China so\nEvery morning before he left for his mother was a very did you dream to have to sing so when he told his mom that he was coming to his guns into invest she saw the U.S coming to bite you or your husband do not knowing the projects much much greater\nGender thing is big in China especially for the older generations\nFoxconn officials wouldn't agree to an interview but in a statement said its investment engine thing will involve marketing modernizing the industry and research\nBoth on will it to his current owner he's does Foxconn could bring technical innovation to lab testing and use robotic ... to make sorting trimming and placing route less labor intensive potentially reducing costs\nI feel most is not being run\nWith Wisconsin gym thing may help Foxconn with branding back in China\nIf they're getting into medicinal products the pope the good one because Wisconsin gym thing has a very good reputation in China you know for being you know clean good very high quality and like other American products that relate to things that are adjusted and so she helped products\nLewis notes that Foxconn has been accused of bad labor practices over the years tarnished its reputation\nIn fact I'm In Wisconsin strongly opposed the billions of dollars and incentives and environmental roll back the company received to build the LCD screen plant connecting with the gym thing industry in Wisconsin may help the states growers and all the Foxconn in an effort to present itself as a good corporate citizen\nFor NPR News I'm ... over in Milwaukee so [noise]\nThis is NPR News\nAcross the country colleges are beginning to offer students nor can in case\nAnd we're in the middle of another Democrat affects every ... others question if it could encourage drug use that story plus the fallout from Jamal ... this afternoon on all things considered from NPR News\nJoined Mary Louise Kelly in Tom cocaine at four o'clock for all things considered here on northwest public broadcasting by now it's eight twenty nine news updated in a moment [noise]\nIf your kid has a healthy curiosity you know they ask lots of questions and it can be tough to explain why the ocean is healthy or help Bones Are formed but they can get answers to their science questions when they ask Dr universe\nSend in questions and watch episodes on N. W. P. B. dot org and on northwest public TV [noise]\nGraves endorsed Kelly soda GOP stalwart Nancy Kass a bomb she represented Kansas for Seventeen years in the U.S Senate as just co box promise to restore the comeback tax cuts convinced her go public\nJay Inslee try so hard to shake steadily let a lot of things she saw\nA spokesperson for the Obama campaign dismissed the endorsements calling graves and catch up on quote tired has\nThe Michelin doors were delivered on Twitter the day before the primary might've been the difference maker and his razor thin victory over the incumbent governor and he's counting on the president's recent visit to Kansas to energize his base in the final weeks of a general election campaign this coming down to the wire\nTo put it simply I Want to do for Kansas what President Trump has done for America [noise]\nProvocative Kelly virtually deadlocked that means that race could be decided by independent Greg Orman he's a wealthy businessman from the Kansas City suburbs who's hoping to exploit what he believes is widespread voter frustration\nI traveled through the state of Kansas I find talking to Republicans and talking to Democrats up you know sort of a broad dissatisfaction with what's going on right now and the fact that we don't seem to be solving problems we seem to be having food fights\nIn twenty fourteen was no Democrat in the race or men through a scare into Republican U.S Senator Pat Roberts but this time around he's pulling in single digits even so says former Democratic governor Kathleen Sebelius that could be enough to tilt the race\nHe certainly can be a spoiler Greg Orman could elect Kris Kobach governor and less Kansas voters are paying a lot of attention\nPaying attention to the likes of Braves and castle bomb who are urging\n\n\n[noise] [noise]\nThis is NPR News in the northwest public broadcasting Cathy McMorris Rodgers is the highest ranking Republican woman in the house Democrat Lisa Brown is hoping to unseat her in November\nThe candidates will debate each other Wednesday in Walla Walla he's in la chore cure it live on N. W. TVs radio and TV stations as well as on N. W. P. B. dot org and the app\nCathy McMorris Rodgers debates Lisa Brown live Wednesday night from six to seven on N. W. TV [noise] lose the new collection of short stories that touches on America's struggled with race class and\nConsumerism including the craziness of Black Friday [noise]\nPretty much knew if someone gets killed because people are more and more to try and get TVs in my mind the first thing that happened everyone in the country the world to the ... will\nFrom the author of friday black that conversation is\nAssisted surgery program with six Devinsky train surgeons and got an ecology urology in general surgery in nearly one thousand cases performed more information about robotic assisted surgery is at Pullman regional dot org\n\nCurrently in Tacoma cloudy skies forty three degrees in Walla Walla sunny forty four Lewiston sunny at forty five it's eight forty four the\nWeight has been along but it won't be long now are you ready to come to terms with\nThe term elections are about senator and governor is battling for power with the midterms aren't just about who wins and who loses or even which candidates at what they're about by you vote there about issues in your community there about you listen to all things considered and hear the bigger picture every afternoon from NPR News\nJoined Audie Cornish and Tom cocaine for all things considered today at four o'clock\n[noise]\nGood morning I'm Steve Inskeep who knows how this happened to be Eighteen hundred workers in Barcelona, Spain began building a church called the ...\nThey're still not finished brains rise admitted suppliers famous church has been under construction one hundred and thirty five years and all that time work\nA million dollars It's MORNING edition and this has northwest public broadcasting\nEarlier this month someone broke into K why and are the radio station of the ... nation in South central Washington feeling equipment and knocking them off the air now there's radio pilots were sixty three hundred tribal members and thousands of non native residents on the reservation\nNorthwest Public Broadcasting's as me him in as reports from ...\nWhen Roy Dick arrived at the station he noticed the light was on\nThere was papers all over the place that I walked into the control room and the control board was gone\n... is the morning how a K why in our fourteen Ninety am it's the ... nations official radio signal operating since two thousand and the only ... each of the cascades he alerted police to the fact of an estimated twenty thousand dollars of equipment that all told\nRepresented what they call the heart of the key why in our voice so far ... don't have any prospects for afternoon host Ryan ... the reality it's still fresh\nDoes it feel real you being robbed and having everything taken still doesn't feel real\nK why in our staff of four are working with the tribes newspaper staff\nNow the resources gun there's a lot of questions about where to get our ... specific news our weather and what's happening with the nation\nThat's Michael ... a reporter with the ... nation review he says the tribal council and the community had a reckoning\nAnd realized how much the station helped native and non natives feel informed and connected whether it was reporting the final score for the latest high school basketball game\nOr announcing from the job board or broadcasting the popular national call in show native America calling K Wayne art would very much the epicenter for the ... nation the tribal council agreed they've allocated thirty four thousand dollars for the station to revamp\nBuying a new console makes and equipment for staff to create and report local news the only problem is that some of the equipment is shipping from South Carolina flooding and road closures from hurricane Michael might affect when that equipment gets to ...\nBut K when our staff expects the signal to be back on ... before the end of the month well that news is good the actual theft leaves some tribal members worried about safety on the reservation last February the ... tribal council passed a resolution and acting eight pm curfew in white one\nWashington state patrol seemed to not to patrol the within the reservation bone\nThat's Ronnie machines the tribes multimedia program manager\nNeeds a whole heartedly effort to be sincere about helping our people\nAre not just you know\nTo get piecemeal servers put to the needs to follow through\nHe thinks more can be done by the ... county sheriff's office and Washington state patrol Katie ... is it those person for the sheriff's office he said well there's no specific task force assigned to the reservation when tribal officers coffers support they respond skill per call that a candidate inside the borders of Washington\nBecause the tribe has its own role as a sovereign nation so it can be tricky to navigate the relationship back at the station act the staff what their first words will be when the radio signal it live again\nHost Ryan Craig thanks\nI don't know my first words where we would I Want to invite some of our tribal leaders and\nTribal people there would be able to bless the building 'cause we have to hear you talk about the people in their communities struggle with homelessness and addiction they're looking for hope from us and that was taken when somebody came and took what we used to broadcast I was taken away\nAt ... in ... [noise]\nMm Mm\nIs has northwest public broadcasting could listen to or read the story it N. W. P. B. dot org\nI'm In\nA series of three potentially fixed unconfirmed the sex is unconfirmed as of now large earthquakes struck off the coast to British Columbia according to the USGS surveyed three confirmed won the strongest measured a six point eight\nThough there's no immediate you nominee warning in related news Oregon and Washington want you to be two weeks ready in case of an emergency like an earthquake\nThat standard advice for how much food water and medicine to stashed away used to be Seventy two hours but they've increased that\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise] [noise]\n\n\n[noise]\n[noise]\n[noise]\n\n[laughter] [noise]\n\n\n\n\n\n\nGeorge ... at the piano there with the first installment of our birthday observant for friends list\nOne of his six grand ate too tough to plug in any colds come peninsula or the little bell based upon the ability to run through the female lead to the second violin concerto by plugging any list like company in love with George pool lift ... was born in the kingdom of hungry owned\nThe artist an extraordinary artist he was generally recognized as the greatest ... of the nineteenth century and as we make our way from mid morning through mid day on this Monday we're going to hear two of his some funding poems form that he largely pioneered in terms of orchestral music\nAs well as his first piano concerto siblings still mania for you on this Monday\nHere at northwest public broadcasting good morning 'til you are very happy Monday I'm Steve leader great to be back with you for a brand new week of classical music\nHere at northwest public broadcasting a little bit of music now by another child prodigy Mozart he wrote the symphony at the age of twelve in Vienna Symphony number eight India look ... chamber orchestra has conducted ... Charles ...\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\nUm\n\n[noise]\n[noise]\n\n[noise]\n[noise]\nWell [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n[noise]\nSo\n\nLet's\n\nTalk about all the\n\nStuff\nThat you know [noise] [noise]\n\n[noise]\n[noise]\n[noise]\nNo it's\nThe talk of preference\n\nFor some of the [noise]\n\n...\n[noise]\n... ...\n\n...\n...\n... ... ... ... [noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n\n\n\n\n[noise] [noise]\n\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\nWith\nThe generous part for harp representing our protagonist there or if he is lead symphonic point number four by Franz Liszt\nSuggestive of one of history's most famous love affairs that have ... percent humidity we used to play Franz Liszt our birthday composed during the ... to ... seconds quick most who are on the podium leading the ... orchestra\nIn all ... composed Thirteen of those symphonic poems and and the eleven o'clock hour this morning you're going to hear the most famous of the mole late ... forthcoming heroic northwest public broadcasting streaming it N. W. P. B. dot org hurt in yeah come on and Ninety point three good morning\nSupport for northwest public broadcasting comes from listeners like you and from the get come on tell them whole speakers series pretending attorney a diplomat Caroline Kennedy speaking this Wednesday October twenty fourth eleven am at the Capitol theater information that y'all come a town hall dot com\n[noise]\nIt's no secret that harkens John ...\nArtist and so many of them whether you photograph with your phone for you to go to Katie gear you share with your fellow listeners your image is just beautiful part of the planet You're welcome to post your work to northwest Public Broadcasting's Tumblr we're just come visit and the the inspiring images your fellow listeners are sharing\nNow linked to all our social media and end up you can be done\nWhat's ... what's the music by the English when Edward Eldar composed before his enigma variations in pomp and circumstance marchers\nMade him a household name in the world of classical music there's just an earlier work by oligarchy is beautiful serenade for strings and your minor the strings with the Baltimore Symphony under David Simmons direction", "year": "2018", "show_name": "1A Plus", "city": "Moscow", "day": "22"}