{"month": "10", "state": "ID", "station": "KRFA", "content": "\nUh\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\nStay composer we've been celebrating all day Frederick Chopin Franz Liszt had something of a friendship and something of a\nMajor ego competition you heard Evelyn do work at the piano and show pants or the sharp not turn open one number six thanks for tuning in for classical music here at northwest public broadcasting I'm Gigi yelling the evening takes you into the Alto Rhapsody by ...\nAnd a string quartet that divorce shock dedicated to Brahms his teacher\nMusic by Amy Beach later on tonight and this hour well kind of rounding off the celebration of lists birthday with music by his celebrated son in law recharge Wagner and a Beethoven piano sonata that lift had some memorable advice for students\nAbout how to perform right now the piano George bullets and one of the transcendental aid to buy list this one called harmony of the evening\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise] [noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise] [noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\nGood morning the U.S withdrawal from a nuclear missile treaty comes just as missiles grow more dangerous\nThe prospect of super fast type responding weapon in our MORNING EDITION from NPR News [noise]\nAny of this hour the Supreme Court has weighed in on a dispute over the twenty twenty cents commerce secretary Wilbur Ross may not be can tell\nAs of Worcester, Massachusetts used to be over twenty third Nineteen eighty seven when the U.S Senate rejected Supreme Court nomination of Robert\nEver since Republicans have given the Democratic opposition to\nTheir decades long campaign desert but it was on the porch but it's just next\nLine from NPR News in Washington on corporate Coleman us stock market the fallen this morning the Dow Jones industrial average down one and three quarters present at twenty four thousand eight hundred Seventy four that comes on the heels of volatile trading in Asian markets overnight as NPR's Yuki Noguchi reports\nConcern over a slowdown in Chinese economic growth as well as increased global tensions between the U.S in Saudi Arabia over the death of journalists them all to show G are making for jittery markets\nChinese stock markets reverse some of their sharp gained the recent days and other Asian indices closed down two percent or more that fell off continued among European markets\nIn the U.S weak quarterly earnings from three yeah and and caterpillar attitude concerns at the global economy could be slowing down there was also a sell off in technology stocks as Tobar continues to prove especially volatile Yuki Noguchi NPR News\nPlanned NPR's Peter Kenyon says everyone is calling on Saudi Arabia to disclose who was behind the plot based on Turkey's evidence\nPart of the evidence that they have is that the Saudi team that showed up in advance of the killing scout it out some areas possibly for disposal of a body including a forest in northeast is done bull [laughter] ah and then he also or in his remarks called on Riyadh\nOr to allow the Eighteen people they've arrested in connection with the show ... death to be prosecuted in Turkey\nAfter a couple of weeks of shifting explanations Saudi Arabia is that that ... was killed in a fist fight in Saudi consulate\nFormer Supreme Court Justice Sandra Day O'Connor has announced she is withdrawing from public life in a statement she says she has dementia O'Connor was the first woman to serve on the U.S Supreme Court\nTonight is drawing for the record mega millions lottery NPR's Giles Snyder reports the chances of winning are astronomical\nMega millions grand prize rolled over when there was no winter for Friday nights drawing a jackpot is now I did this to me to one point six billion dollars winters can choose to be paid that about over twenty nine years what most up to the cash option which totaled more than nine hundred million dollars\nAnd attention as what lottery officials are looking for they reduce the odds of winning a jackpot to drive up top prizes that attract more players\nMega millions officials say they expect three quarters of all wedding number combinations to console by the time the numbers are drawn trials motor NPR News on Wall street the Dow is down one and three quarters present or four hundred and fifty\nPoints the NASDAQ is down more than two and a half and this is NPR News\nSupport for NPR comes from NPR station other contributors include Subaru featuring the all new three row ascent with feeding for up to eight and a choice of second row captain's chairs love it's what makes us Subaru a Subaru learn more at ... dot com\nIt's a northwest public broadcasting News I'm un Ramallah\nUnions and liberal groups are decrying a series of mailers that are showing up in mailboxes in for closely contested state legislative districts from close to Washington to still can\nThe mailers urge voters to ride in a real progressive candidate instead of voting for the Democrat and the race and man behind the mailers as conservative property rights activist Glenn Morgan who was sued over robo called the center voters in twenty sixteen\nAnd is a Republican operative who is trying to deceive voters particularly progressive voters by using our name and our logo and we're not going to stand for it\nFused Washington has joined with other groups to file a complaint with the public disclosure commission Morgan says the outcry is overblown and insist he hadn't broken any campaign finance laws he said the purpose of the mailers and to encourage liberal voters to send the Democratic party a message about the candidates they're recruiting\nVoters into counties in Washington state of mistakenly been and ballot return on to look that require postage secretary of state Kim Wyman says the election officials in his ... and ... counties notified her Monday morning at a vendor was to blame for the mistake\nEarlier this year in agreement between women and governor Jay Inslee ensured that voters and all thirty nine counties would be able to send their ballots and without postage\nTacoma base male vendor contracted by the two counties use the ... when distributing the ballot too about forty thousand voters and grant county and Fifteen thousand voters Minnesotan\nWhile the post office is still supposed to deliver ballot sent by voters without postage ... office said voters deal could drop off their ballot at drop boxes or ...\nAnd this has northwest public broadcasting\nNews more news that N. W. P. B. dot org good morning it's eight or six times to enter a mellow happy Tuesday [noise]\nJust ahead on MORNING edition would stir Massachusetts is experiencing the kind of boom that people in most small cities can only dream about\nProperties are hot commercially properties are hot residential ... everyone just wants a piece of West right now it's crazy a look at why the city's experiencing such explosive growth at that age twenty two [noise]\nCathy McMorris Rodgers is the highest ranking Republican woman in the house Democrat Lisa Brown is hoping to unseat her in November the candidates will debate each other tomorrow night in Walla Walla watch or hear it live on an W ... radio and TV station philosophy on N. W. P. B. dot org the app and live tweeted\nCathy McMorris Rodgers debates Lisa Brown lived\nTomorrow night from six to seven on all the services of an W. P. V. [noise]\n\nMORNING EDITION from NPR News I'm Steve Inskeep and I'm Noel King good morning Turkey's president has offered new details on the killing of journalists\nThe um if I should really the point I should\nBuy if you are to one also said that he has clear evidence that the killing was premeditated Saudi officials meanwhile now say that ... was killed in a rogue operation by individuals who are acting without the knowledge of the crown prince and members of the Saudi royal family reportedly met with some of ... relatives today\nHowever officials in that government first said because she'll do left ... alive all of this has prompted many U.S officials to question the U.S Saudi relationship including Congressman Adam Schiff he's a Democrat in California\nAnd he's the ranking member of the house permanent select committee on intelligence he joined us earlier in the day so what did we learn in are the ones who remarks today\nWe learned that the Turks have additional details the only trouble which they've shared with the public about the premeditated nature of this killing of the team actually didn't all had over the same time the part of the team won over earlier and may have done reconnaissance and a force to determine where to dispose of the body\nThey brought with a body double their images of the body double in ... close so they give a lot of added detail but they still withheld the some of the key evidence that they claim to have which\nWith what you've been told by the U.S intelligence community\nIt certainly far more credible than the Saudi account um but you know I have to say that the the Turks don't come to this\nWith clean hands are after all this is the same country now demanding extradition of this team from Saudi Arabia\nThat had a team of its own security thugs beat up people in the streets of Washington DC and refused to extradite them a turkey is also the leading jailer of journalists and the world so it's not as if there are the champions of democracy and human rights in a press freedom but still they're count is far more credible than that of the Saudis\nYou believe there are a reliable source in this case I\nI certainly believe that um their account a seems much more consistent with what we know what can be a proven but there's still a lot we don't know are still a lot we're taking the Turks word for and we need to get to the bottom of this uh obviously the most\nAnd\nMarket vineyards in Richland they'll bring out the canvas paints and glitter\nAnd wine for what hoops themed fall projects no experiences necessary the reading wind and water colors with Krista ... Thursday six PM more information on this event including ticket prices can be found on the events calendar at N. W. P. B. dot org\nThe programs you enjoy in northwest public broadcasting or made possible with financial support\nDrugs coverage in her options for its policyholders details at B. C. Idaho dot com [noise]\nHe'd like to reach northwest public broadcasting you can call one eight hundred eight four to eight nine nine one or email info at N. W. P. B. dot org it's eight Twenty one [noise]\nSupport for NPR comes from the station and from campaign monitor an email marketing platform used by more than two hundred thousand customers worldwide with email template uh dragon drop email editor and twenty four seven customer service more at campaign monitored dot com\nFrom it less than a collaboration software company powering teams around the world committed to providing the tools and practices to help teams plan track build and work better together more at ... dot com [noise]\nAnd from Hitchcock's insurance providing customized insurance for small and medium businesses so they can do more and be more learned more at H. I. S. C. O. X. dot com or from an agent Hitchcock's insurance encourage courage\nIt's MORNING EDITION from NPR News\nTo the court has sided with the ... the administration and temporarily blocked the questioning of commerce secretary Wilbur Ross dozens of states cities and other groups are suing over Russia's decision to add the question which asks census takers if they are us citizens\nAnd here's how long has been reporting on these lawsuits he joined us now from New York morning on the morning to oil spill why did the Supreme Court temporarily block a lower order for the commerce secretary to testify for these lawsuits\nWell this is a request from the Trump Administration which has been arguing that these laws you should be resolved based on internal documents emails memos they've already release for these lawsuits about the citizenship question and not on any questioning of commerce secretary Wilbur Ross\nThe plaintiffs in these last he's really want to question how much secretary Wilbur Ross because they think that these documents are not sufficient\nThat there have been inconsistencies in a row of his testimony to Congress about why and when he added the citizenship question and the plaintiffs want to use a deposition uh questioning of Rosh in order to get more evidence is all preparation for a trial\nThat is expected to begin on November fifth in New York could be the first trial of the sticks lawsuits around the country\nOr it could even ask the Supreme Court to hear this case so we're not quite sure right now what will happen to this trial if that is the case well\nWhat is it the ... court order mean for this ... that are doing over the citizenship question\nIt means that the windows really closing took like additional evidence to support their claims in this lawsuit\nAnd it's important remember the Supreme Court did allow last night in this order the plaintiffs attorneys to question Egypt the department official John Gore he's the acting head of a civil rights division that this administration says need this citizenship question to better enforce the voting rights act\nAnd the Supreme Court is allowing additional document requests but again we have to see what the administration does next in their next expected request to the Supreme Court and what they asked to bring her to do a before a trial starts\nAnd hungry when can we expect to find out like the the final fate of the citizenship question\nUltimately these this legal battle is expected to be argued in front of the Supreme Court\nAnd so I Want to get fully onto the Supreme Court docket we are likely not going to get any answer on whether or not this question things or goes from the court until possibly in early summer before the Supreme Court wrapped up its session\nTake some time NPR times the low long covers the center of things on the you're what\nAnd people are priced out people who can't buy an are moving to smaller cities stink about San Francisco and Oakland [noise] you know our Manhattan and Hoboken New Jersey which is a little bit cheaper\nOver the past few decades that process has brought big change to Boston and the town's surrounding it and now a four hour west of Boston Worcester, Massachusetts is seeing its stock rise from W GBH radio and Boston Aaron Schachter reports on what could become a case study in urban growth\nA few years ago if you'd ask most people in Massachusetts their opinion of Worcester you'd likely get an answer like this one from Michelle 'cause\nIt wasn't any place I'd ever come um made me nervous made me scared [noise] my mother used to tell me all the time when I was a kid and stay away from ... nice place to be\nHis had sunk into the psyche I think of the city that it wasn't gonna wasn't going to come back that this was just our faith Worcester\nCity manager and we don't go to screw up here and points to Union Station as a symbol of whiskers booming industrial revolution at the turn of last century by the mid seventies its roof in case there was also the gallery mole which was supposed to revitalize downtown but instead killed local businesses divided the city in half\nAnd then went belly up there were a lot is silver bullet\nTwenty ten by unifying the large park outside city hall and then demolishing the ... mall Kate McAvoy a vice president for Harvard pilgrim health care is a fifth generation Worcester writes\nProperty it's hot commercially properties are hot friends actually everyone just wants a piece of West right now it's crazy\nIt's actually not crazy at all considering the forces at play Brian sergeant professor of public policy at UMass Amherst says there is a classic path or a smaller city to boom in Worcester is following the formula a whole lot quicker than anywhere else\nYou need a smaller city near a larger city um you need the largest city to get really expensive fast that's Boston you need this policy to do through under development or a lot of times um post industrial depression didn't as the expensive city prices people out there will be some bleed over from their\nBoston is forty seven miles an hour train ride away making that bleed over a relatively easy commute this past spring average rent in Boston roast faster than any metro area in the country and that was on top of an already booming real estate\nMarket professionally it's a great place to be personally as socially it has been just incredible\nTwo year old Sam canary works for Morgan\nUniversities including the state universities teaching\nHospital I Walk to work every day I see three or four nights a week the food chain hairspray\nThe social scene here is great I get to be here and I had access to the world is right outside my doorstep\nThe city is experiencing booms and tax biomedical and specialty manufacturing city officials have Greenland two point six billion dollars in recent construction new housing as well as retail in restaurants space and Worcester is finally growing after losing residents for much of the last century\nBut it's the residents already here who Daniella revere thinks about she's with the central mass housing alliance and says over the past twelve months rent and housing prices have risen too far too fast\nWe need to remember that we are pricing our elders outlay uprising or young families out in order to have it like I really do say they don't want to end up extend the debt crisis is that we're seeing in the Boston area\nThe root beer says the housing speculation so far hasn't extended much beyond the city center but she worries that it's only a matter of time before affordable housing goes the way of Worcester is once vaunted industrial manufacturing for NPR News I'm Aaron Schachter\nThis is NPR News\nA long way to the answer waited long discriminated against racial minorities\nAnd require them to have to be able to go\nI'm Audie Cornish concerns over voter suppression in the mid term this afternoon on all things considered from NPR News [noise]\nJoin Audie Cornish and Tom cocaine for all things considered at four o'clock today here on N. W. P. B. it's eight twenty nine and news update in a moment\nThe Washington Idaho symphony brings culture and the urge to the community through their events and also through their support of northwest public broadcasting your organization to can enhance the cultural life of your community by sponsoring\nOur programs find out how it N. W. P. B. dot org under support [noise]\nUSAID and the region is meant to do just that addressing the root causes of migration by improving security and rule of law last year according to the U.S global leadership coalition the U.S provided about eight hundred thirty eight million dollars\nSalvador where he works for Catholic Relief services\nHistory the economics and he's just fire you got completely interconnected sports very much in the interests of United States to see that development happens here that violence is reduced year because it's pushing people into situations of irregular migration\nThe Trump Administration is reviewing all USAID making clear to countries that receive assistance that they should support U.S interests congressmen angle points out that Congress told the purse strings and he and his colleagues won't sit quietly by if the administration tries to go around the will of Congress\nWe keep hearing from the administration that everybody has to obey the law well how about the president obeying the empowerment Control Act which prohibits the president from with story or pounding money appropriated by Congress\nBut don't expect any quick moves on this is James Roberts of former foreign service officer now with the Heritage Foundation a conservative Washington think tank\nWhere thousands of programs in the three countries and they they could be reviewed not all of them are effective manner you're too small road and make a long term difference it's often difficult to measure the room\nWhile Roberts would liked a thorough review he points out that it takes time and needs to be coordinates\nRegion to keep them home cannot begin to solve all the problems of controversial but it has to be part of it is a very small piece of it although\nThe state department won't say whether it has received orders from the White House to cut aid officials ad that they believe Central American government are discouraging their citizens from taking the dangerous journey north Michele Kelemen NPR News the state department [noise]\n\nThis is NPR News and good morning it's eight forty to this is northwest public broadcasting let's talk about food celebrated chef Carla Hall says she didn't always appreciate the food that she grew up with her new book Carla Hall stole food reflects her personal journey to embrace the meaning of soul food\nAnd African American culture so talk about her new book at eight fifty one [noise]\nNo and gives them great tips on Oprah it doesn't always have to be slimy\nYou are listening to northwest public broadcasting on K. R. FAA Ninety One point seven FM Moscow Pullman a listener supported public service of the Edward our moral College of communication at Washington state University in cooperation with the universe\nMany events across the Pacific northwest is some family friendly some very frightening for you to enjoy could read the list of recommended events as well as movies and books and more at N. W. P. B. dot org also on Facebook\nIn\nAnd joined us later today at noon for Facebook Live with an interview about Northwest News with regional reporters that Facebook Live at noon subscribe to it that automatically pop up on your computer around lunchtime\n[noise]\nWaiters belong but he won't be long now are you ready to come to terms with mid\nTerm elections are about senators and governors battling for power with the midterms aren't just about who wins and who loses or even which candidate said what they're about why you vote there about issues in your community there about do you listen to all things considered and hear the bigger picture every afternoon from NPR News\nDes Moines Audie Cornish Mary Louise Kelly in alpha ... cocaine today at four o'clock on all things considered\nGood morning I'm students ... on your car you should calmly pull over and the same uh\nAnd Harry descent and smoothly merged into traffic on a freeway near San Diego passengers of a car captured the perfect landing on\nVideo although they're amazed profanity means we cannot play this out It's MORNING edition\nSupport for NPR come from the station and from the ... to fund supporting individual dignity and sustainable communities are investments and transformative leaders and ideas learn more it can be toughened dot org\nFrom American Jewish World Service working together for more than Thirty years to build a more Justin equitable world learned more ed AJ W. S. dot ORG\nAnd from the Jacob ... foundation supporting the health and wellbeing of underserved populations at ... dot org\nIt's MORNING EDITION from NPR News I'm Noel King and I'm Steve Inskeep good morning Hoover the ride hailing up as in business with hundreds of virtual restaurants these are restaurants that exist mainly on line delivering food to your house via service called ... eats Hoover\nSays it is helping restaurants grow their businesses and providing a service to customers NPR's Jasmine Garsd reports on how it works and why it's such a divisive issue in the food industry\nIt's chilly autumn afternoon\nLatin goodies cookie thaw led chess and homemade dues to lead to and cakes as I Walk in one customers ordering for a birthday ... basically going to\nBe very running behind the pastry counter in a corner there's little grill with meat patties sizzling [noise]\nA few months ago over eats approached the bakery with a proposition that sounded bizarre to owner ...\nWhy don't you set up a virtual restaurant like are you crazy what do you mean what are you talking about a restaurant that exist solely on line to brief suggested they serve burgers nachos to leave us decided to give it a shot that's how Brooklyn burger house was born\nLate us as it might be a virtual but the profits are real we've increased our sales by about thirty percent so it's very exciting is very exciting a least ... leads a virtual restaurant over\nShe explains that people use over eat to search for food\nAnd when we see people searching for something but not finding at that signal to watch the third and opportunity and there's unmet demand\nOver eats approaches an eatery and suggests they create a virtual slide restaurant\n... about the industry she says in the restaurant business the delivery part has always been a headache\nFor they have to pay somebody they have to figure out if they need to insure them you know they have to figure out the delivery distance do they need to provide them with a vehicle or car a bike whatever maybe or over it's already built in to that platform not everyone sees over eat and the virtual restaurant is a good thing\nYou know I haven't had the stones cut them off I mean although many many people would love to just to go you know jump off a bridge\nJay terrier owns can roll so woods fired pizzerias in Texas they specialize in then cross you know what else is then he says profits on any restaurant and overeating is taking a big slice\nYou know because they charge us between thirty and thirty five percent of whatever the bill is and then the customer pays anywhere from you know two bucks to six bucks for the delivery postal service the plus credit card fees so I you know it's not\nIt's wouldn't provide specifics on how much it charges restaurants it says it varies by location terrier says for all the promises of expanding a customer base delivery is just never as profitable as someone dining\nWe may be going out to like neighborhood restaurant he wanders are we losing that but Gerry are still uses ... his Pete says she feels he can say no because for better or worse big tech has staked its for deep into America's dish Jasmine Garsd NPR News New York\n[noise]\nIs NPR News good morning it's eight forty nine classical music is ahead at nine o'clock with the reader lyric trumpet concerto Andy ana Roman carnival overture solve this morning from nine until four o'clock when all things considered and Tom cocaine will review the day's news enough that you\nCould check out the schedule of the programs that you may find and discover and enjoy it and W. P. V. dot org [noise]\nThe university\n[noise]\n\n\n[noise]\nA Russian waltz to begin our classical music this morning here at northwest public broadcasting\nThe walls coming from a score colds tend to battle a ballet or dance scenes actually a purely concert work not just showing for choreography dedicated by the composer Alexander gloves going off to the orchestra of the Russian imperial approach right at the end of the nineteenth century\nMusic by gloves off with the royal ... conducted they're buying ... exactly five minutes now passed the other quote good morning to you\nAnd welcome to all of our glorious classical music and all the ... performances of it\nThat you're going to be here and throughout the day in the evening here at northwest public broadcasting on line at N. W. P. B. dot org happy Tuesday to you on this twenty third day of October I'm Steve reader looking forward to a Roman carnival here and just about Fifteen minutes\nBut in the meantime an Australian moravian violinist and singer and composer basically of the generation between bug and the hype born in Seventeen on uh\nSo\n\nHere at northwest public broadcasting herded N. W. P. B. dot org the same place where you can get more detailed information about all of our individual selections and a complete overview of our playlist an W. P. B. dot org [noise]\nWe get program support from inkling bookshop an independent bookstore in ... showcasing curated gift cards books of every genre and approach supporter of the great American read\nThe list of all one hundred votes can be found it includes book shop dot com as well as weekly book review used an upcoming events also on Facebook do in the moments just ahead a salvage job by a French romantic of the nineteenth century\nI this is from a clock right now fighting to come exploring music I'm Hungary\nFascinated very flavorful music from list and bark and go die and it was\nA folk music which exerted a powerful influence on western composer from hiding promise I Will be thrown\nMore about from St Louis in some of his contemporaries tonight it's seven when bill returns exploring music\nOnto that French romantic indeed a friend of Franz Liszt little French ...\nHe fell which this particular music from an earlier opera on the ... subject it'd be separately published it as she's Roman carnival overtures the ... the company orchestra until ... conducting here\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\nNa\n\nNa\nAnd\n\nNa na\nNa\n\n\n\n\nSome ... for you this morning his violin so nothing number six in ... with violinist Lucy fund dial an ... ... split them\nHere at northwest public broadcasting herded N. W. P. B. ... Oregon proudly serving forks that Ninety One point five and Walla Walla that eighty nine point one\nEither and good morning I'm Steve leader right do eleven minutes before ten o'clock yes indeed the regular lined up joining us today actually do that you will keep you excellent company this afternoon for one and two for teaching going putting together a\nA really entertaining program of classical music for you this evening from eight until midnight of bold and demonstrative statement by ... that comes next\nCritical election essential coverage from NPR News\nYou can hear a central reporting every day on MORNING edition all things considered and weekend edition here on northwest public broadcasting as we focus now on the show she basically said he was told employment", "show_name": "1A Plus", "year": "2018", "city": "Moscow", "day": "23"}