{"month": "10", "state": "ID", "station": "KRFA", "content": "Mm Mm\n\nMm Mm Mm Mm [noise]\n\nMm Mm [noise]\n[noise] [noise]\n\n\nNerves are ... ...\n...\n\n... ... ... ... ... ... ...\n...\n\n... ... ...\n...\nOf the\n[noise]\nThe composer was guitarist Andre they go via you heard two guitars in his daily study called prayer\nThat guitarists were Enrique muddy ghetto and Eddie Keely here on northwest Public Broadcasting's NPR and classical music service\nGood evening I'm Gigi yelling and as the nighttime begins so much earlier this season it's ours music and sports in the night with Beethoven his moonlight sonata\nAnd a piece by John Ritter called midnight bell the elements song later on tonight a string quartet for guitar quartets Philip glasses dream quartet called ...\nHere's the piano sonata that Beethoven did not call the moon lights but ever since his publisher gave it that name we've known it for that beautiful opening movement here's the pianist ... in Beethoven piano sonata number fourteen the moonlight\n\n\n[noise]\n\n\n[noise]\n\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n\n[noise] [noise] [noise]\n\n\n[noise] [noise]\n\n[noise] [noise]\n[noise] ... ... ...\n...\n[noise] [noise]\n\n[noise]\n\n[noise] ...\n\n[noise]\n\n\n\n\n\n\n\nThe races are on and the stakes are high number one in the midterms approach NPR has the latest news an expert analysis on the Democratic and Republican agenda\nOur priorities to make sure\nThat we're not only ... for the ban was published a mature on Capitol\nCritical election as central coverage NPR News [noise]\nIs central reporting every day on MORNING edition all things considered and weeks\n\n\nA\n\n\n\nNew\n...\nEd\nEd ...\n\n\nSays bad you know hey to\n... ... ... or\n...\n\n\nAnd\nUh ...\n\n\n\n\nOh\n\nThe voice of baritone Simon Davies in music by John Ritter to bill ... song from midnight Dell with the composer conducting the Cambridge Singers in the city of London and pony up on northwest Public Broadcasting's NPR in classical music service\nThanks for tuning in its while listening that Ninety point nine at them\nAnd Joseph listens at one hundred point nine earth was public broadcasting on line at N. W. P. B. dot org Arthur Bliss another British composer in Nineteen twenty two went to uh\nJury and found their symbolic meanings of certain colors so he wrote for movement inspired by four different colors purple red blue and green you can use your own imagination if you like\nTo hear those for movement now performed by the almost ... orchestra Vernon handling conduct a colors symphony by Arthur Bliss on northwest public broadcasting\nMhm [noise] oh\nOh [noise]\n\n\n\n\n\n[noise]\nAnd\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n[noise]\nMm\n...\nThe secret service is investigating suspicious packages sent to Hillary Clinton former President Obama and the building where CNN broadcasts in New York City [noise] It's MORNING EDITION from\nThing and you wonder stand this moment in Brazil's politics why not traveled to a rain forest I'm Steve Inskeep\nAnd I'm David Greene the controversial far right leader expected to become Brazil's new president grew up in the rain forest and some people they are having a hard time supporting his environmental policy\nLeader how Israelis reacting to the killing of Saudi journalist I'm all for show a Japanese journalist is released three years after being taken out there yeah it is Wednesday October twenty\nFour he started from the bottom now he's here turning thirty two years old happy birthday Drake\nHere's the news\nLine from NPR News in Washington encore of a cold and the secret service says fishes\nIntercepted the packages were identified during routine screening as potential explosive devices one was discovered last night address to Hillary Clinton in Westchester County New York another was found early this morning in Washington D. C. address to the Obama residents authorities say neither package ever gotten near the intended target\nThe secret service has opened a federal criminal investigation\nThis comes after a bomb was discovered earlier this week at the residents of liberal activists and billionaire George Soros that bomb was destroyed in a controlled detonation by federal agents cirrhosis like Obama and the Clintons has been the target of right wing conspiracy theories for years Quil Lawrence NPR News New York\nMeanwhile CNN is reporting it bureau in New York City has been evacuated along with the rest of the time Warner building a ... device has been identified there are no reports of injuring thousands of Central American migrants are still in southern Mexico their goal the U.S border\nThe Guatemalan government says he stepping up security at its southern border after hearing that a new large group of migrants it's planning a similar journey from El Salvador Maria Martin has more\nReports say a Salvadoran migrant group as being organized via what's up and Facebook and respond to what a modest interior and defense\nHonduras that once that when a government official caught us by surprise\nMaria Martin reporting President Trump is threatening to cut aid to Honduras Guatemala and El Salvador and closed the U.S Mexico border\nThe Kremlin is warning President Trump's intention to develop nuclear weapons banned for the last Thirty years could lead to a new arms race and fears Lucy and Kim reports from Moscow this week the Trump Administration informed Russia about its plans to exit in Nineteen eighty seven treaty banning intermediate range nuclear missile\nOver the weekend President Trump said the U.S will develop weapons prohibited by the treaty unless Russia and China also refrain from doing so president flooded ... spokesman told reporters in Moscow the U.S plans are extremely dangerous and we'll practically start a new arms race\nNational security adviser John Bolton met with ... Tuesday to tell them about the U.S withdrawal to also discussed a possible meeting between Trump and putting in November during World War one commemorations in Paris\nBefore leaving Russia Bolton told the inter facts news agency the two presidents may hold a full scale some in Washington next year followed by a visit to Moscow by President Trump Lucian Kim NPR News Moscow on Wall\nStreet the Dow was down one hundred eighty three point an ad\nTributaries include Amazon Prime video with their Romanoff a new series from the creator of Mad Men starring Diane Lane no awhile Christina Hendricks and Andrew rentals a new episode every Friday on prime video\nThat the northwest public broadcasting News I'm un Ramallah\nWashington governor Jay Inslee joined ... of this to corporation and cutting the ribbon yesterday on the state's newest and largest solar array the two hundred acre project is nearly eighty two thousand solar panels\nEnough to power about four thousand homes it's located on a hill above the farming town of blend in Adams County about eighty miles south west of Spokane ... says the new solar farm will not only bring the state energy and environmental benefits but economic benefits as well\nAs an agricultural county it depends on the er good climate a receiver claimant we're going to have to start a British woman he forces field so this is a perfect example of how you save and cultural killed him with clean energy so that we don't pollute your kids get less asthma so we get more clears your job [noise]\nUh that's what we used to for about during cross the state\nWeek in the approved a solar project of similar size and could attach county the lint project was developed by the end\nProject a judge removed his robe and gave chase after two handcuffed inmate made a run for it from a Washington state courtroom\nVideo obtained by the daily chronicle shows judge R. W. buttered leaped into action one twenty two year old Tanner Jacobson and twenty eight year old Cody Howard bolted for the door down the stairwell Jacobson within the lead bounding down to four flights of stairs but the judge closed in on Howard the judge grabbed him just as he was about the exit the court house\nAuthorities apprehended Jacobson a few blocks away\nBoth are charged with second degree escape share Rob ... says these things don't happen very often\nThat the northwest public broadcasting news more news that N. W. P. B. dot org [noise]\nPotato six good morning I'm to an Ramallah environmental groups warn it'll be disastrous for the Amazon is false denaro is elected president of Brazil coming up and go to the rain forest town where he grew up\nCommunity that's now deeply divided about him the story at eight twenty two [noise]\nCathy McMorris Rodgers and leaves are brown debate tonight in Walla Walla at ... pm you can listen to or watch the debates lie\nBring these dates to the air and also our regional news coverage very important information and we really appreciate your ongoing financial support to be able to do that and provide this service\nCurrently in Olympia cloudy fifty degrees in Okinawa and clear at forty two and ingrained feel cloudy at forty six this morning [noise]\n\nIt's MORNING EDITION from NPR News I'm Steve Inskeep in Washington\nAnd I'm David Greene in Culver City California we are following breaking news from New York and also from Washington DC this morning about\nThe discovery of a number of suspicious packages two of them were intercepted on their way to former secretary of State Hillary Clinton\nAnd former president ... Obama and the New York city police department is now saying it's investigating a suspicious package that was sent to the building in Manhattan that how does CNN broadcast center there and let's turn now to NPR justice correspondent\nRyan Lucas who was following this and a rhyme what is the latest here well\nIs actually out of New York city and that's a where the New York police department says it's\nThe unit that includes an explosive ordnance disposal unit and they are responding or CNN bus Jeff Zucker has told staff that a suspicious package was discovered in the mail room or the New York office was being evacuated out of an abundance of caution there aren't any details at this point on the package it self\nUh but NYPD as well as the FBI and the bureau of Alcohol Tobacco firearms and explosives are are all on the scene investigating a find out as much as I can of course\nYeah it's it's been something to watch a lot of the CNN journalists who were literally outside look on their phones reporting on this and they've been evacuated from the studios um okay so we have this suspicious package in New York this follows earlier announcements about these other potential explosive devices catches up to date on that\nRight so the secret service said this morning in a statement that it intercepted too suspicious packages one was addressed to Hillary Clinton at her home in Westchester County New York on that one was discovered late last night and then early this morning the second one second suspicious package address to a ... bomber was discovered here in Washington DC\nNow both packages were immediately identified as potential explosive devices this was during routine screening that they were identified a the secret service does it neither Clinton or Obama ever actually had their hands on the packages they never received them they were never\nTry to get to the bottom of this and we're already talking about some potential attacks suspicious packages sent it to George Soros the billionaire philanthropist that there could be some sort of relate related here\nAt N. W. P. V. dot O. R. G. [noise]\nWas public broadcasting has version of enriching the community through programs which engage in late ... entertainment it's possible bugs for the financial support for losers like you are local businesses and organizations like within hospital if you want to support this public stew she'll visit N. W. P. B. dot org for more information\nOn just a reminder that the debate tonight between Cathy McMorris Rodgers and Lisa Brown it's happening at six PM and you can listen to or watched the debate\nOn all the services of northwest Public Broadcasting's radio and TV service as well as on line and W. P. B. dot org it's eight Twenty one\nHolistic financial planning from taxes and investments to retirement and estate planning in the client's best interest let's make a plan dot org\n[noise] from the department of homeland security with e verify dedicated to providing employment eligibility verification for all businesses and the employees that help them thrive ... verify dot Gov flash go\n[noise] and from Lyndon mood del learning process as committed to helping all students learn to their potential they're learning centers and on line private school offer instruction in reading and comprehension Lyndon mood bell dot com slash NPR\n\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm David Greene on Sunday Brazilians elect a new president so year both in our own is expected to win easily he's a retired army captain and congressman from the far right\nEnvironmentalists see his policies as a threat to the Amazon Wilson are all grew up in a rain forest in a community that has now deeply divided about his rise to power and probes Philip Reeves has more [noise]\nThis is the small country town in southeastern Brazil ... spent his childhood\n... said one day I'll be president office yeah Chinese drinking beer with his brother Luis Antonio who says he used to go fishing with both of NATO ... feet or that he's the son of this town was his Luis Antonio Gianni\nAn ultra conservative who stands up for family and religion and fight corruption [noise]\nLocal officials say about sixty percent of this community support ... Luis Antonio's proud that both NATO grew up here this place is called Eldorado it's not as glamorous as the name suggests\nThis is a shabby town or Fifteen thousand people it makes a living growing bananas and for tourists who come to see nearby caves multiples full that our riches here just a few minutes\nDrive away they say in the town that they live in the middle of the Atlantic rainforest and telling the truth because here we are surrounded by forests the Atlantic rainforest floods stretched a little much of Brazil's huge coastline before the country was colonized began building cities\nMost of the forest destroyed but chunks remain the chunk in this area covers nearly twenty times more land the Manhattan the forest is one of the richest in the world and ... it has\nThe ... the negro phone we have everything air planned animals insects micro Fonda\nEverything the forest around here is on the Gulf and the protection get both NATO talks with loosening Brazil's environmental licensing laws because he thinks they suffocate the economy Brazil's powerful agri business lobby hungry for new land farming and mining is behind him his rebuttal [noise]\nIn the forest around Eldorado there about a dozen killing boat has these are small impoverished Afro Brazilian communities often establish centuries ago by Africans who escaped slavery these days ... says he sees all Brazilian Suzie\nHit in the ... people haven't forgotten his past racist remarks about them ... who lives in one\nCan imitate those people say he's very prejudiced and then he doesn't like black so we feel really offended\nOfficials say both in I Lived in Eldorado from the age of five to a team his father was the town dentist\nWho ... also vice principal of a local school says he and both NATO hung out with his kids swimming and the rivers playing soccer and hunting birds his mom was a washer woman and the boats to NATO household he says\nPresident should you not to people is not defined from like both of them out of the object [noise] Nike is creeping across the rainforest in the house or an elder autos big town square at\nThe map and his deputy aghast at ... locals have completed fashion and bakery causes\nThese two officials belong to a centrist political party and yet they say they don't see both an outer from the far right it's a threat to include these it there's a ... ... ... is a little scenario becomes president I'm sure he'll look kindly on the town says vice mad you know show\nWhat about the Atlantic rainforest all around the moon and also what are the only change the forest is elders out of his greatest treasure says Matt devout shut my eyes and the lungs of the region yet the town's broke it needs income and jobs he says\nSo it should profit from the forest allowing in what he calls non polluting industries and protect it you can do both says jeopardize your cause you to ... oh yeah and I believe shy about ... knows that he says\nPlaylists flip battle the Eldorado eco tourists guide disagrees number boss of the Disney ... doesn't have any conservation policies since ...\nBecause once you lose it you will never get it back\nThen it breathes NPR News El Dorado after historic flooding in Austin, Texas that cities one million residents have been told to boil their drinking water most ... shells member station ... has more [noise]\nRushing into Austin reservoirs has the look of chocolate\nIt's been so turned off by flooding brown SEAL Team and when it goes to Austin treatment plant it takes a lot longer to filter soap on Monday the city told people to conserve\nWater and as a precaution to boil what they were going to use for drinking and food ... you can probably guess what happened\nNext and I'm calling as they\nPlan here yesterday Maggie Chapman was one of a bunch of shoppers at a supermarket wheeling out bottles of water supply had improving the day before when shells were bear after ... started to limit how many\nBottles people could buy it just inconvenient at this point but I keep thinking about daily things that we use water I hadn't even thought about\nKinds of things to the restaurants are close to cafes aren't serving so you need a lot of people desperate for coffee and on a more serious note the city of San Antonio sensible water tank or to help keep the local jails supplied with drinking water and the city of Austin worried about maintaining water pressure\nThat bill load water treatment the city's system of pipes and red divorce started to lose pressure if it loses too much pressure that said he won't be able to spray water from hoses to fight fires and water pipes risk getting contaminated as microorganisms sneak into a hole and openings they wouldn't normally accept\nThe good news there is that is that water conservation is working people in Austin or using less more water is going into the system and water pressure has improved he says if conservation continues and the weather cooperates things could start returning to normal by this weekend if heavy rain kick up more still in the river could last\nDay beyond that for NPR News I'm mostly shell in Austin and this is NPR News\n... campaign and the ball how they unified theme we've got the big health care John knows firsthand how important health care's her family\nUnlike him I'll take on the big drug companies to reduce prices candidate are playing to their voters we are seeing and take on health care more and head on in part because they're so concerned about health care in the mid term this afternoon on all things considered from NPR News\nAudie Cornish and Tom cocaine for all things considered at four o'clock today here on N. W. U. P. B.\nI think we see program support from the Moscow food co-op destination for local and natural food without from scratch bakery deli and salad bar where selections are seasonal unprepared daily\nOctober is national co-op mob located in downtown Moscow and on campus at eight twenty two elm street more Moscow food does go up\nCorrect says he thinks Democrats will flipped anywhere from eight to a dozen governors seats this election the popular Republican incumbent in Nevada Brian Sandoval is barred from running because of term limits\nSo it's just like has a chance against his Republican opponent Adam lack solve the current attorney general Irish ... felt campaign for this story too but no one responded\nNow something is shifting this year with voter turnout was higher than usual during the primaries and in the first days of early voting and the race is really a toss up according to polls\nDon't often is the editor of the Nevada independent and an expert on Nevada politics we needed a coffee shop\nIn Nevada electric reflects the nation's electric very polarized\nThe lower turnout election so it's tribalism Republicans are going to vote for the Republican but Democrats are going to vote for the Democrats\nLike the country Nevada those mostly Democrat\nYears ago for for attorney general he's the only candidate in modern Nevada history too of lost both the urban areas and still won a statewide race\nBack at the grocery store democratic candidates keeps his rack wraps up his visit to people he meets a reflective of Las Vegas is transient character summer recent arrivals or visitors who can't vote in Nevada others are conservative to shake just like sand and later tell me they're not voting for him and then there's more Eli\nLilly\nShe registered without the sixteen to go to legalize marijuana she thought the money that came from it would go to her kids' school so far she says that\nWhere's the money going how's it going to fix the schools\nBecause we first started my my daughter had come to work you know during the debt and\nShe'll do for the person who will improve her three children's education they follow the NPR News Las Vegas [noise]\nNews and good morning it's eight forty two and this is north with public broadcasting ahead look at how Helen Reddy Nineteen Seventy two anthem for female pride and solidarity still speaks to women and\nMen engaged in the fight for equal rights at that age fifty one [noise]\nYou were listening to northwest public broadcasting on K. R. if a Ninety One point seven FM Moscow Pullman a listener supported public service of the Edward our moral College of communication at Washington state University in cooperation with the University of Idaho school of journalism and mass media [noise]\n\nAt the ... gallery in Dayton and you can see an interesting exhibit of fractal art it takes one shape and repeated in various patterns in size is using mathematical algorithm\nPhotographer Debbie Linda Lauer created some digital butterfly that uh to pedals and drag and flies from fully edge in a series of fractal art photograph of being showcased at the ... gallery the exhibit is free\nAnd that's in Dayton and find out more about this event and others on the events calendar at N. W. P. B. dot org [noise]\nFare fifty one and and or a female partly cloudy forty seven\n\nThe weight has been a long time but it won't be long now are you ready to come home with\nThe term elections are about senator and governor is battling for power but the midterms aren't just about who wins and who loses or even which candidate said what they're about why you vote there about issues in your community there about you listen to all things considered and hear the bigger\nPicture every afternoon from NPR News Des Moines Audie Cornish and Tom cocaine for all things considered at four o'clock [noise] [noise]\nGood morning I'm David Greene with a story about the importance of return customers the BBC is reporting on a group of men who were about to Robert shopping Belgium until the quick thinking owners that have come back in the end of the day I'm going to have more money than\nThe guys left the owner told police to show up later they were skeptical but they\nCame and when the thieves returned in the evening they arrested them maybe the owners should have asked the guy to fill out a customer survey or something you're listening to MORNING EDITION\n\nSupport for NPR come from this station and from the ... foundation committed to improving lives through invention in the U.S stand in developing countries\nFrom the John Dean to Catherine the MacArthur Foundation recognizing exceptionally creative individual this year's MacArthur fellows and more information or at Mac found dot org and from the listeners who support this NPR station\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep good morning we're deep into an election season when a vital question is who shows up Karen Grigsby Bates of NPR's Code switch team met people who want to grab young voters' attention by making them laugh\nA new campaign called call the cops started a few days ago and it's thirty second spots are popping up on the Internet in one a guy with a laptop sitting on a cafe patio he looks disgusted Lee into his recyclable cup as a stunning young black woman pulls up a chair\nThe coffee here sucks you know what else ... voter suppression how did you know mining people voting\nNo fly zone because the parties will represent me assistance broken my right so the woman without her phone and makes a call nine one one\nReporter writing I have several thinks he's going to be the next ... you know\nFight on voting oh I can describe him he's white with that little they have\nWe'll just doing stuff really in the park using the condo pool waiting in a coffee shop for business partner\nOnly in this video black people are calling the police on white when they think are being irresponsible citizens\nKaram a gallon heads acronym the nonprofit agency that commission to for videos that are popping up on your mobile devices she gets that they're taking a risk riffing off whites policing black bodies for this campaign to cheat reverse parity\nThere's nothing funny about that but I Do think that tying that to civic engagement and using your vote to really make a stand about what kind of country you want to live in in the direction you want this country to go in I think that can be really powerful\nAcronym worse to elect progressive candidates be targeted digital media campaigns the gallon says call the cops is part of the not the vote project which has a specific goal\nIt is a program designed specifically for voters who may not vote in all elections or especially in mid term election\nThe company approach director milk um do you lead to help write and direct the spots ... work includes night school and last year to comedy girls trip the idea of a direct pleaded voters appeal to him\nYou know I think it's just important for people to um just be aware like when I tell them you know [noise]\nBlack and devised the call the cops series there's the hipster a suburban mom and a worried black man played by the daily show's Roy would junior who's calling the cops on a group\nOf ... shows me some plans to vote November now\nNumber one I like to report an emergency in part three white women just thinking self is Trumbull something in progress using filters ... St puts over and over again playing the drama and they literally have no plans of voting in November gave me that's not a legal [noise]\nAvocado [noise]\nTearing the gallon says most of the responses they've received had been positive and even if a minority of people are offended she says\nGetting their attention is half the battle\nWe elected and then most of our reading or during a pretty good job\nMalcolm leave much humor to drawing people who see these spots\nOnce you get people laughing their mouths are open you know the truth and\nAndy says the truth is mid term elections count\nThere's not enough people who vote in the midterms and those that do um you know get their person and\nCalled the cops videos go run for re election day Karen Grigsby Bates NPR News\nAnd this has northwest public broadcasting classical music\nWith at nine o'clock this morning with the reader [noise]\nKeep you company throughout the morning and on through the afternoon\nBut the return of the news at four o'clock with all things considered and Tom cocaine and then at six o'clock on all the services of an W. P. V. including on our Web site and on our Twitter feed featuring the\nTo the university\nOr\n...\n\n[noise] [noise]\nMm\nMm\n[noise]\n\n...\n\n\n\n\nMm\n\nMm\n\nMm\nNa\nMm\n\n\n\n\nOriginally Felix Mendelssohn he wrote all the other ones for solo piano his own instruments but in this case a standalone piece he actually conceived at Fort cello and piano\nThat late some without forged by middle son a fun way to begin our classical music on this Wednesday this October twenty fourth\nThank you for joining us here at northwest public broadcasting screaming at N. W. P. B. dot org hide their good morning I'm Steve later your host to the music until one this afternoon later in the shower the combination of trombone and piano\nAs the trombone stand in for the human voice in a quite famous passage from the world of Italian opera\nBut right now a German of the Eighteenth century or contemporary abusive heightened by the name of ... the author of this trumpet concerto in the major both gun Bosh pleased to fill a park here in partnership with the ... chamber orchestra New York\n[noise]\n\n\n\n\nA while\n[noise]\nLa\n\nLa la la\n\n\nWhoa whoa whoa whoa whoa whoa [noise]\n[noise]\n\n\n\n... ... a trumpet can sure too windy major by the Eighteenth century German you'll ...\nBut obviously some generous writing in there for over when the soon is will ... ... as the trumpet solution to this recording with the conductor list or feels chamber orchestra of New York now twenty minutes past nine on this Wednesday morning you're a northwest public broadcasting\nOr approaches to fork so Ninety One point five and ... Ninety point three I'm Steve leader ... will keep you excellent company once again today with the classical music between one and four pm NGO in from our studios here from eight pm until midnight\nRape is Iran and its daycare high democracy has never been I've been in terms of depression NPR has the latest news an expert analysis on the Democratic and Republican agenda [noise] our priorities is to make\nCentral coverage NPR News [noise] your essential reporting every day on\nMORNING EDITION all things considered and weekend edition right here on northwest public broadcasting\nWell in addition to his rather well known music for the stage production pay to get\nIt for greed scored other theatrical productions and works as well including a piece called ... yourself for the board the crusader this is the concert tweet from that score with the Swedish radio symphony orchestra conducted here by ...\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\nMy mother never never let them go and\nMom\nFocus on the other one was one of the Muslim and\n\nWere all\n\n[laughter]\n\nThat's\n\nLeast in a bike curious ... morning reaching hourglasses an offering you a musical toast but putting did she like drinking songs ... Trump to leap yum oh indeed the principal trombone as the New York philharmonic ... uh let's see\nWith Warren Jones shut the piano you probably didn't expect that ... was going to go but\nNext up today a little bit of music by the Englishman Gustavo host well there's a good deal of national attention on Washington's fifth congressional district where a Democrat Lisa Brown is challenging the seven term incumbent Republican congresswoman Cathy McMorris Rodgers\nAnd the candidates are going to be in a debate this evening and you can watch or hear it live on the radio and television stations of northwest public broadcasting also available at N. W. P. B. dot org and on the app\nThat this evening from six to seven live from Walla Walla a debate between these two candidates in the ... congressional district Cathy McMorris Rodgers and Lisa Brown to be heard and seen on all the stations of N. W. P. B.\nHi this is from o'clock on friday the ... music I'm Hungary\nFascinated very flavorful music from this didn't bark and could die\nA folk music which exerted a powerful influence on western composer from hiding promise always around the\nExploring the role of this magnificent my yard I used to say muggy hours\nWeek when exploring music [noise]\nWhen you read showing buildings evening at seven you're going to hear one of the\nYou're walking tonight at seven right after all things considered from NPR\nI Know a sweet for strings by the English when Gustavo post named for the girls' school in London a quite prestigious school\nWhere he served as head of music for three decades written for the girls there back in the first part of the twentieth century his polls sweet for strings the board with the infant yet to ... ... conducted here by George first\n[noise]", "year": "2018", "show_name": "1A Plus", "city": "Moscow", "day": "24"}