{"month": "10", "state": "ID", "station": "KRFA", "content": "[noise]\n\n\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n\nMy\nName is ... du da\nDa da da da\nNa na\nNa na na na na na na\nNa and AA\nNa na da da da da da\n\n\n\n\n\n\n[noise]\nMusic from Spain of the lead renaissance early but rough period you might want to recognize that tune ... an ancient Liberian dance form adopted as recently as the late twentieth century by what Keane Rodrigo\nIn one of his guitar could charity they're presented in more or less an original former adaptation of the period by Lucas to release the rebuilding of\nFrom a collection he published in Madrid in the seventeenth century cold a lantern and a guiding star ... her concert directed there by Andrew Lawrence king and those kind of audience\nThen all of our glorious classical music here at northwest public broadcasting end end W. P. B. dot org I'm Steve leader great to be back with you here to serve as your host until one this afternoon leader in this hour one of those expensive to live on a ruptured each\nBy ... for shock but right now music from the latter part of the twentieth century a score from Nineteen eighty one by the Australian calling from ...\nWho wanted to write a kind of ... overtures foray composition in that particular you're right a a competition competition if I can put it that way he ... he did not win but he certainly brought this work to the attention of many a conductor around the world\nHis festival overture on Australian themes calling from beach music with the west Australian symphony orchestra conducted by Richard Mills\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\nPlus the and Italian of the boroughs Kara represented by that early flutes another industry they're arranged for saxophone by Eugene route to\nAn outstanding virtual so on and teacher of the instrument Steven month playing the Sopranos stocks their partner to the piano by Mary and covert and show caged on this Monday morning already the first day of October is we spend it together\nHere at northwest public broadcasting end to end W. P. B. dont Oregon I'm Steve leader well N. W. P. B. dot org it's a great resource for all kinds of northwest public broadcasting news and information\nBeep beep dot org [noise]\nIt's no secret that artists draw inspiration from nature is beauty so it's only natural that one of the most beautiful regions\nAmerica's specific northwest inspires\nThe inter artist in so many of them whether you photograph with your phone sophisticated gear you share with your fellow listeners your image is just beautiful part of the planet\nYou're welcome to post your work to northwest Public Broadcasting's Templar or just come visit and CD inspiring images your fellow listeners are sharing now\nLinked to all our social media and end up to be done\nBeautiful music therapy ... an hour work by a fellow bohemian shook composer onto me more shock his live on a corrupt to the number one the indeed played for you this morning by the Slovak Philharmonic orchestra that was conducted by then it ...\nThem\n\n\n\n\n\nYou just heard the ... corrupt city number one in ... by ... more shock\nThe first of his three long form companion pieces to his ever popular ... but first of all new corrupt city bug foreshock offered to you today by the Slovak Philharmonic understanding ... direction\nHere in northwest public broadcasting herded N. W. P. B. dot org oh speaking of Slavic music we're going to devote most of the first half of next door so we'll get to it in just about twenty to twenty\nOctober first Cuban northwest public broadcasting thank you so much for joining us today I'm see bigger\n\n\nLet's turn now to music by the children it ditch from his early years his league teams will still living and working in his home town of born in Germany before relocating to begin to this is the duo number three in ... teacher for a clarinet and platoon it with members of consortium classical\n\n[noise] [noise] [noise] [noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n\n\n\n\n\n[noise]\n\n\n[noise] [noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n\n\n\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]", "show_name": "1A Plus", "year": "2018", "city": "Moscow", "day": "01"}