{"month": "10", "state": "ID", "station": "KRFA", "content": "Oh\nYeah\n\n\n\n[noise] [noise]\n\n\n\n\n\n\nMm\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\nOkay I I ... [noise]\n\n\n\nViolinist you heard was Oscar ... with Milton K at the piano here on northwest public broadcasting and W. P. B. dead or good evening I'm Gigi Yellen first Monday in October brings you a first hearing perhaps for a couple of pieces in the ten o'clock hour tonight\nI'm not tour no by Michael ... Thomas and a harp concerto by age ... well between now and ten o'clock you have ... only string quartet to enjoy and a piano quartet by Mozart\nRight now Fritz no friends Trump's list Hungarian Rhapsody and number two played by the experts of the Budapest festival orchestra conducted by even ... or\n\n\n\n\n\n\nNa\nNa\nNa\nNa and\n...\n\n...\n\n\n\n\n[noise] [noise] [noise]\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\nMm\n\n\n[noise]\n\n\n...\n\n\n\n[noise]\n\n[noise]\n\nDone and\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n... premiered in Nineteen oh for written when he was twenty eight\nThat was the Juilliard string quartet playing for you here at northwest public broadcasting and W. P. B. dot org thanks for listening to northwest public broadcasting in Pullman in Moscow and Ninety One point seven FM or online streaming\nAt N. W. P. B. dot org thanks for downloading the app their\nMozart coming up next our Vivaldi coming up in just a moment as a matter of fact the music you hear every day and every evening on N. W. P. B.\nWell it offers a welcome respite from the chaos of politics and crises and catastrophes doesn't it it's good to stay informed of course but sometimes you just need a break from the constant barrage of news and the music that helps you get that break is made possible here by the financial supportive listeners like you\nOn the next super Thursday fundraiser on October eleventh join those listeners be one of the twenty five hundred members who will keep the music playing with your guest in any amount\nTo end W. P. B. it will be a gift to yourself of course and also to the community thank you so much there's an oval concerto for use by Antonio Vivaldi\n\n\n\n\n\n\nGood morning be updated version of the north American free trade agreement next faces a vote in Congress will question a presidential advisor\nOur MORNING EDITION from NPR News [noise]\nSeveral states are reforming their printed veiled distance that other reforms making it worse I'm Rachel Martin and I'm Steve Inskeep how can a breach survivors of the individuals who nominates\nIf women were as ...\nPublic and control center and joined the Democratic controlled house happens to the south Africa\nWhere the two thirds vote but overall president Ronald Reagan retail\nAnd using it\nLive from NPR News in Washington I'm more of a Coleman Senate majority leader Mitch McConnell says the Senate will vote by the end of the week on Brett Kavanaugh's nomination to the Supreme Court\nNPR's Kelsey Snell reports the Senate will vote soon after the FBI completes an investigation into allegations of sexual misconduct by Kevin off\nThe FBI has until friday to investigate allegations against Kavanaugh but the process could take less time their mandate is to investigate any current credible claims of misconduct Democrat to criticize that definition is too vague and so far it's unclear who will be interviewed into pro\nDemocrat the Republican leaders are constraining the investigation and have criticized the process an incomplete\nVillage in terrible unless you're bragging practically here the south of the demographic moving with ...\nHe's not fattening exact day for a final vote Kelsey Snell NPR News Washington\nOnline retailer Amazon is raising the minimum wage for us workers to Fifteen dollars an hour\nFor the holidays and fears Alina Selyukh reports that is a big development for a company with a growing reach\nEarlier this year Amazon revealed that the median pay its workers was twenty eight thousand four hundred and forty six dollars this is a huge contrast to the fact that the company itself is worth nearly a trillion dollars and it's being run by the wealthiest man in the world\nAmazon now that it will set the minimum wage at Fifteen dollars an hour for all of its workers in the U.S including contractors and seasonal employees\nStarting in November this is actually clever timing because the seasonal hiring is promising to be really tough for retailers the labor market pretty tight in the retail companies have already started competing to hire workers for the holiday season Alina Selyukh NPR News\nAmazon is one of NPR's financial supporters\nThe Nobel Committee has awarded this year's Nobel Prize in physics to three scientists American Arthur asking Frenchman Gerard ... and Canadian Donald Strickland they're being honored for ground breaking work with leaders strictly notes she just the third woman to receive the ... Nobel Prize\nCelebrate because we're out there um and hopefully a in the time and I'll start [laughter]\nAsk and developed ways to use lasers as tiny tweezers to pick up incredibly small item letting scientists study how proteins operate in the body on Wall street the Dow Jones industrial average is up eighty one point the twenty six thousand seven hundred and thirty two and ... down more than seven and eight thousand twenty\nNine you're listening to NPR\nSupport for NPR comes from a campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email template a drag him drop email editor and twenty four seven customer service more at campaign monitor dot com and Americans for the yard\nThat the northwest public broadcasting News I'm un Ramallah\nThe new trade agreement signed it midnight Sunday called the U.S and the a short for United States and Mexico and Canada agreement by the Trump Administration could change commodity prices for North west farms correspondent and king has detailed\nAre hopeful this new agreement will lift their commodity prices many of which are low right now for Washington and Oregon dairy the new trade deal might help lift the price of powdered milk by blocking Canada from offering their powdered milk for ...\nThe milk can add up to thousands of dollars on his farm each month he was eleven hundred milking cows on his very in space and to the Washington\nYou know the other way it is pretty substantial um ... you mean though uber\nWith this new agreement and more certainty northwest grain growers are hoping that Mexico will now by more U.S wheat again I'm Anna King in Richland\nPopular program that support conservation an outdoor recreation projects across the country ... fired after Congress could not agree on language to extend it\nLawmakers from both parties back the land and water conservation fun but the program ... Monday and the dispute over whether it's renewable should be part of a broader package of land use and parks built\nA Senate panel is set to vote today on a bipartisan bill to permanently reauthorize the fund and ensure it fully paid for the Senate energy and natural resources committee is expected to consider a bill offered by senator Maria Cantwell of Washington\nCan't well called the conservation fund the key tool that Congress uses to help communities preserve recreation opportunity and make the most cost effective use of land the program uses federal royalties from offshore oil and gas drilling to fund conservation in public recreation projects\nAs his northwest public broadcasting do mornings at N. W. P. B. dot org and later this afternoon at noon joined us on Facebook Live\nA reporter at me and then it and Scott leading have our news manager will be on to discuss how the Supreme Court will hear the ... nation case about Washington state gas taxes and plus more regional news discussion\nAfternoon on Facebook Live [noise]\nOkay do you remember that movie the network and the character Howard Beale speech I'm mad as hell and I'm not gonna take it anymore [noise] one of Howard was a woman with this same anger and forever have resonated [noise]\nI chat with author Rebecca Traister on how anger expressed by women had been both politically transformed end perilous for women throughout us history a conversation is at eight twenty two this morning [noise]\n\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin good morning President Trump says he wants to find a new trade deal with Canada and Mexico by November but he admits that won't be an easy sell and Congress which needs to ratify the agreement\nIt was one of the architects Peter Navarro at the top trade advisor to the president and joins us now on the line Mr Navarro thanks so much for being back on the program\nDuring the morning is Martin how are you\nI'm doing well so the president um has been able to check this box and he talked about this for many many years how he believes that NAFTA was not a good deal for American workers he didn't exactly ripped up the NAFTA deal um a lot of the foundation still there but what do you believe are the most substantive changes\nBut you can just check a box he checked a Walmart big box of all boxers I mean this is a major\nAchievement going back in Nineteen Ninety four this is a twenty four year old agreement or there's two things that are different now want it to modernize is the agreement back in the day we didn't have things like digital trade we didn't have things like biologics which are complex of pharmaceuticals\nOr we have a strong a new disciplines and protections for that so that that's a really good thing\nUh but the big thing really is is what the trade represented likes to call restructuring the old NAFTA basically ah the the Ross Perot giant sucking sounded sent our jobs and factories offshore turn to what factories we had more into assembly plants rather than manufacturing and there's really strong\nThe factories here about that the auto manufacturing in particular the new agreement cents forty percent of the cars content has to be built in places where workers are not least sixteen dollars an hour that may bring some manufacturing back to the U. S. but want to add costs that China car prices for consumers\nSo ah the full rules or Seventy five percent of the content has to be um in in in that zone for the three countries and then the higher wages um make sure that the United states gets a good share\nOf that are in terms of the price cause she raises might think one of the lessons Americans have learned over the last Fifteen Years of having countries\nSupport for northwest public broadcasting comes from a fully instituted W. S. U. presenting a lecture by Arthur Andersen on his book fair to the land how America what wires Thursday October force for thirty PM and the cub junior ballroom open to the public in books I Need to follow more at fully W. S. U. dot edu\nAnd also from sleeping lady mountain resort on the banks of icicle creek offering fall relaxation packages including Vanya that as well as sipping paint details and reservations that sleeping lady dot com\n[noise] mid term elections are coming up every vote matters at every day matters to it can be hard to stay on top of it all things change fast when news breaks off\nFrom NPR News joined Ari Shapiro in Tom cocaine at four o'clock today for all things considered [noise]\nSupport for NPR comments from this station and from his car insurance providing customized insurance for small and medium businesses so they can do more and be more learn more H. I. S. B. O. X. dot com or from an agent Hitchcock's insurance encourage courage\nFrom tire Iraq with more than five hundred retire models from twenty to manufacturers and an online tool for finding tires based on vehicle needs budget and brand tire rock dot com helping drivers find deliver install\nAn from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial well being first learn more Raymond James dot com\n\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin the FBI is broadening its investigation into Brett Kavanaugh this week and with the Supreme Court nominee still in the news it's hard for a lot of us to get last week's hearing out of our mind\nSo polite so constrained I understand and appreciate the importance of you're hearing from me directly about what happened to me and the impasse citizens had on my life and my family\nAnd then in came Brett Kavanaugh his instinct was very public fury on his\nOwn behalf um number one in the class honest I thought well no no no no no no no no doubt this I'm going to I'm going to borrow more I don't know I'm not sure I'm going to talk about my ... studio and mocked me was\nThat was an exchange between Brett Kavanaugh and democratic Vermont Senator Patrick Leahy during those hearings Rebecca Traister says men in general are allowed to use a full range of expression and still come off as credible he had in his arsenal the ability to use anger\nFury\nTears\nIn a way that he felt confident would resonate with the American people I don't think that Dr Christine Blasey Ford I Can't imagine a scenario in which she would have gone into that hearing room\nArmed with that same weapon that same tool that she could yell and be furious\nIt's called good and bad the revolutionary power of women's anger\nThe moment that it occurred to me that I wanted to write this book it probably was just in advance of the women's march and you could feel the Post's twenty sixteen\nElection anger building and it wasn't just the anger of the women who were planning a women's march it was also anger at some of the white women who were planning a women's march after fifty three percent of white women had voted for Donald Trump the intra ally anger was crucial and important and then there was the women's march\nAnd it was the biggest single day political demonstration in our nation's history\nAnd it obviously made a big impression and yet I saw the political press not treated as politically serious\nAnd it was really just missed and a lot of quarters as being about the cats the plus he had you know a bunch of women getting together and there's a pundit mark how print on MSNBC who asks the Monday after the women's march seriously what are these women gonna do not just running for school board down the road\nBut this week and of course then that gets us to a year that has women protesters opposing the health care repeal teachers' strikes women running for office and historic numbers and then meet you [noise] you lean into history\nAdmirable political change the Boston Tea party is a great example\nWhat historically was so threatening about women thinker well in part that anger of the founding our founders who were the white men chafing against their lack of representation\nAnd who were angry and protest it in ways that we understand correctly to ... this is our revolutionary moment but when they made their new nation\nThey codified some of the very inequities that they themselves were angry about with regard to the British Government so they built the nation on slavery and the disenfranchisement of women\n[noise] you referenced the racial dynamic of the me too movement earlier but I Want to ask again because women who speak out are condemned to in the broader culture under many circumstances but there is an outside penalty for women of color who do so do you think those voices are being heard loudly\nEnough in this moment I think it's almost impossible for us to conceive of the voices of women of color as being heard loudly enough because they have been so unheard and so marginalized for so long and in fact it's women of color who have been the leaders and the leading thinkers of so many of our son\nThat the definition of sexual harassment\nStems from cases that were brought in the seventies by women of color who were actually borrowing legal ideas from a civil rights movement around racial discrimination and applying them to their cases of having in many cases been brutally sexually harassed in their workplaces\nIn Nineteen Ninety One it was a need a Hill who testimony against Clarence Thomas claiming that he sexually harassed her sort of cemented the idea that sexual harassment was not individual behavior but damage done to a class [laughter]\nIt's Toronto Burke who in two thousand six pioneers and leads the me too movement and then when the me too movement Iraq\nI think it's really important that we understand that the first people to gain attention were very wealthy white actresses which is in no way I don't say that to diminish their experience with the reality\nOf the harm they sustained but in fact all of that is for grounded by women of color who stories so often get lost or kind of erased\nAs the author of a book called good and bad the revolutionary power of women's anger you could not have to find more appropriate time for your book to come out [noise]\nThat's true but that could have been true of so many other weeks in the past ... years although we have to stay there\nWe're only a productive force if it's done in the service to progress a partisan agenda not at all it is very often politically potent and yet we're told not to take it seriously still\nI think that the anger that women are feeling around the country that is having a catalytic connective impact and this is part of a long process social movements take a long time and the kind of anger that women are feeling in this moment around Kavanaugh\nIs going to be part of a far longer story that's going to extend deep into our future Rebecca Traister is the author of the book good and bad the revolutionary power of women's anger is out today\nAnd [noise]\n\n[noise] this is NPR News\nDrinking water around the country is polluted with actually harmful chemicals went to a wide range of illnesses cancer\nLow birth weight thyroid disease\nAfternoon on all things considered from NPR News\nJoined Ari Shapiro in Tom cocaine at four o'clock today here on your NPR classical music service of an W. P. B. about eight thirty a news update in a moment and thank you for your membership deport you're helping to make news coverage of Northwest News\nPossible northwest public broadcasting refused program supports listeners like you additional support comes she'll be idle forest products commission national forest products week begins October twenty first using local wood and paper products\nIs a sound environmental choice but can help communities schools and the economy more than I Do forests dot org\nJohn rape playing with human rights watch says he's deeply concerned this bill simply replaces one course of tactic for another bail for pre trial to tension that if he says to use the tension to pressure people of color and the poor to plead guilty to lesser crimes often regardless of their actual guilt\nIs pervasive in the criminal justice system this happens every single day the new Dell reform law in California does not address that problem now you're just giving them a whole other mechanism to keep people in\nACLU and more than a dozen other legal groups have raised similar concerns\nAnd conviction history and other data that algorithm gives the bill of near of objective science attorney rifling says but in fact becomes a kind of feedback loop merely reflecting social biases\nIs a pretty well documented fact the police stop search detain harassed by people more than white people poor people more than wealthy people\nTend to the courts treat people of color and treat poor people worse or there's various factors that these risk assessment tools are looking at to judge who's higher risk\nAnd it's not yet clear just what data would actually go into the algorithm the bill doesn't say\nSharif fan over dean CEO of a nonprofit pre trial justice Institute admits the new law is far from perfect but she says some of these concerns are a bit alarmist fan over the notes that discretion to detain or released pre trial has always reside with judges\nThis new law she thinks will simply help judges get it right more consistently\nOh that makes it should also keep being identified as a threat to public safety it should result in fewer people needlessly incarcerated\nCertainly collecting signatures to try for a statewide ballot initiative that may put bail bondsman and an awkward de facto alliance with scores of progressive legal groups who said there'll be ready to challenge the law's constitutionality in court\nAs soon as it takes effect next year Eric Westervelt NPR News San Francisco this is NPR News\nAnd you're listening to northwest public broadcasting is eight forty two this field of nursing facility plagued with gender stereotypes all nearly Ninety percent of all nurses are women a headline more men aren't nurses\nAt that eight fifty one\nThe programs you enjoy a northwest public broadcasting I made possible with financial support from both people of Moscow located on main street an independent bookstore offering new in classic titles in addition to a selection of cookbooks local publications gifts and more\nOpen daily with announcements at both people of Moscow dot com [noise]\nMost public radio stations have fund drives at this time of year it's one of the way stations raise the money to pay for a program that and lightened and entertain but where most stations than anywhere from five to Fifteen days asking for donations\nYou and your fellow last year it's actually pledge so donate during the super Thursday fundraiser on October eleventh [noise] spend more time with your favorite programs and less on Sunday evening and thank you for your support [noise]\nMm Mm\nMid term elections are coming out every vote matters and every day matters to it can be hard to stay on top of it all things change fast but when news breaks all things considered is on it and then we help you understand what it means for the nation for you\nListen to all things considered every afternoon and here the bigger picture from NPR News\nJoin Ari Shapiro in Tom cocaine at four o'clock today for all things considered here on northwest public broadcasting [noise]\nIt's eight forty four\n\nThe morning I'm Steve Inskeep I was on a train the other day it assigned declared see something say something\nCommon security messages spread across this country and reached west Fargo North Dakota where a person saw something aside seemingly written and blood that said help me\nThey said something calling nine one one WBAI\nSupport for NPR comes from the station and from that William and Flora Hewlett foundation committed to supporting ideas and institutions that advanced the wellbeing of women and improve lives and livelihoods and developing countries\nMore information is available at Hewlett dot org from the doors do charitable foundation whos clinical scientists developments award support promising early career physician scientist\nAnd their research effort to improve human health\nAnd from the ... foundation\nThis is MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep one woman found a way to attack high health insurance prices\nAnd that news because it's hard for any one person to do if you go to the hospital the hospital charges your insurer\nWhich passes the cost on to you and it's hard to negotiate a better price and that system Marshall Allen of the nonprofit newsroom ProPublica has been investigating high health insurance costs and he has the story of a woman who used her power to hold them down either Marshall\nGood morning Steve who is this woman or talking about sixty eight year old grandmother named Marilyn Bartlett and Maryland Bartlett took over the\nFamilies that plan was in deep trouble it self funded so the employer paid all the health care bill and it was projected to lose about fifty million dollars in the coming years and basically go broke\nSo the classic situation here that people in all sorts of insurance arrangements face where they're basically told healthcare is really expensive gets more expensive every year and we're short of money we need more from\nExactly and if people hadn't noticed the cost of your health care benefits is rising there's about a hundred and fifty one million of us who get our health care benefits through our employers\nAnd part of the problem is our employers have been deferring to the medical industry when it comes to the cost of health care and so the industry keeps raising the cost and basically those costs keep getting passed on to the workers what did Marilyn Bartlett do differently [noise] she had spent Thirteen Years working in the insurance industry\nAnd so she knew a lot of the games she was also kind of a math nerd who knew how to follow the money and so working with our team is she compared what her plan paid each hospital in the state the bigger hospitals to what they were paid by Medicare and Medicare published as its prices and so she could see\nThat her health plan was paying hospitals in the state anywhere from two times what Medicare gets paid to five\nUnder control and so she had to do some really hard ball negotiating and why she decided to do which is kind of a revolutionary idea in the health care world as she decided to set her own prices and set the plans prices now in this case she had some leverage and actually all employers have this leverage because of the health care industry really does need our money\nSo she said look you hospitals that are five times the Medicare rate you're going to need to bring your prices down to about twice the Medicare rape\nI Wonder if hospitals simply had to accept that I'm thinking that in Montana there can't be all that many hospitals there surely would be a hospital that would just say listen our prices are price\nIt took some hardball negotiating she threatened to go public with the price variation and expose the high price hospitals she called in the union to campaign against the hospital was holding out and they had a whole campaign statewide they spent hundreds of postcards and made phone calls to the hospital executives and leaders\nAnd eventually all the hospitals signed on and the plant saved about a million dollars a month just from the reduced hospital prices\nIs there a lesson here for employers of all sizes that if they put in that time they can get the leverage to hold down what is paid for hospitals and other medical costs\nWould say absolutely out her message really to employers is you need to push\nAn itemized explanation for all of the expenses and when you do that you know you may need to smaller employers may need to join together with other small employers to increase their leverage but they can bring down the prizes\nMarshall al other ProPublica thanks very much thanks so much Steve\nThis is NPR News\nThat the north with public broadcasting that was really interesting piece of information there it's eight forty nine always learning something new on northwest public broadcasting\nAccording to a new study from the American Academy of pediatrics drivers in their mid teens have the highest rate of car crashes of any age group and the country\nWith an increase in teen driving death after years of decline to back in twenty Fifteen nearly one thousand nine hundred young drivers died in nine percent rise from the year before and that same here about a hundred and Ninety five thousand teen drivers the stained injuries\nUniversity\n\nA\n...\nIn a\n\n\nThe eight to ... ... ... ... popularly known as his revolutionary eight to ... they were in the hands of mass\nSelf to noon for northwest public broadcasting and I did end W. P. B. dumped or get lots of glories music to share with you on this occasion including a seasonal work by ... we'll get to that in just about Fifteen minutes or so but right now a defendant to work in this form by George Frederick handle\nHis concerto grows to number two in before I made sure Iran period and historical instruments to members of the English concert directed by ... [noise]\n\n\n\n\n\nWhoa whoa\n[noise]\nMm\n\n\n\n\n\nI\n\nThe concert overtures in also by Edward Greek given that reading by conductor named ... as he let the members of the Gulf and Bert National Symphony here at northwest public broadcasting proud to serve the tri city said Walla Walla and pencils and with classical music daily on eighty nine point one a very good morning\nDidn't follow was with the handle at N. W. P. B. classical\nYour favorite programs on northwest public broadcasting or made possible with support from recovery international\n\n[noise]\n[noise]\nMm\n\nAnd they\nOf them in the ...\nAnd then in the\nThe women and then they're going in there get in the mid ... there were members\nThe day in\n\nThey didn't do that then the liberal members of your day [noise]\nPeople in the\n\nThe work of a child prodigy you've just heard this morning from Eighteen to in the year in which he turned Thirteen Years old ...\nAnd she was string quartet number one the first Fifteen he would eventually composed the code they quartets here at northwest public broadcasting hurt in Tacoma Seattle and Olympia on Ninety point nine a very good morning 'til you had a very happy to stay on this out tumbled day the second day of October\nAs we spend it together here at northwest public broadcasting showed the music you hear every day on N. W. P. B.\nOffers a welcome of Russia but from the chaos of politics crisis catastrophe and well it's good to stay informed indeed well it's important to stay informed\nSometimes you just need a break from the constant barrage of news and the music that helps you get that break is made possible by the financial supportive listeners like you on the next super Thursday fundraiser on October eleventh\nPlease join them be one of the twenty five hundred members who will help keep the music playing with your gift in any amount to end W. P. B. it will be a gift to yourself and to the\nBoth he meals [noise]\nIt's no secret that artists draw inspiration from nature is beauty so it's only natural that one of her most beautiful regions\nAmerica's specific northwest inspires\nThe inter artist in so many of them whether you photograph with your phone\nWhere you just is Decatur gear you share with your fellow listeners your images of this beautiful part\nOf the planet You're welcome to post your work to northwest Public Broadcasting's Tumblr we're just come visit and the the inspiring images your fellow listeners are sharing\nNow linked to own our social media and end up you can be done\nFrom a glorious score by ... ... let's turn to his protege on to mean for shock and he was sort of five Prague all the little Russian philharmonic orchestra has conducted here by me pretty ... ski\n", "year": "2018", "show_name": "1A Plus", "city": "Moscow", "day": "02"}