{"month": "10", "state": "NY", "station": "WAMC", "content": "We will be doing that well bringing you all a little bit of news momentarily we're going to go to a newscast in a couple of minutes because it is important to stay informed and as\nMuch as we're sure you're enjoying are um\nYou know banter and backing them we will will bring your newscast and a little bit one eight hundred three two three nine to six to one eight hundred three two three Ninety six do we know the phones are very unlikely to ring during the news to listen to it and then be like oh that was I learned that stuff from the news and now I'm informed and now a call\nOr pledge on line and that way you can listen while you pledge\nCan do you think the yes you can you can listen or at least here while you're tired you know what I understand you're like cannot process as well when you're typing and sometimes it's hard to focus on two things raiding yeah but I Believe in you know of course no I'm In each to their own ability sure\nOne eight hundred three two three nine too thick sewer online at WAMC dot O. R. G. one eight hundred three two three nine to six to ... on line at WAMC dot org [noise]\nThank you\nJay in Burlington, Vermont beautiful Burlington, Vermont I Love it there I'm I've last with their ... year in a month ago [noise] just too long I should've actually ten I'm with the three cheers for the night crow thank you Jay\nOne eight hundred three two three nine to six to her online at WAMC dot ORG\nWe're going to go we're going to go to an idea and then the newscast very very shortly so race race for a pledge [laughter] we'll be back with you in just a few minutes one eight hundred three two three nine to six to ... on line at W.\nA. M. C. dot O. R. G.\nAm CSI ... Ninety puts me Albany W are you in ... three rooms and Utica W. A. K. exchange any point I\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including ... robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nAnd the dot O. R. G.\nU. A. M. C. F. M. H. D. Ninety point three Albany\nW. R. U. N. H. D. Ninety point three rooms in Utica W ... Ninety point nine Kingston W. O. R. H. D. Ninety One seven Middletown WC el ... Ninety One nine Plattsburgh WC a an HD Ninety three three candidate Harry W. N. C. H. D. one oh three point nine tie kind of rogue W. M. D. H. D. one by one great aren't in\nW. W. E. S. H. D. eighty eight point nine mount Kisco W. A. N. D. H. D. Ninety point one Stanford W a an eighty eight points by Brewster and WAMC am fourteen hundred Albany\nLive from NPR News in Washington I'm jak sphere\nPresident Donald Trump and first lady Vilonia Trump surveyed hurricane damage in Florida and Georgia today in the wake of hurricane Michael the jumps all over some of the most heavily damaged areas and a helicopter Robbins air force base in Georgia the president praised FEMA director Brock Long for the job is agencies doing\nOr want to just come in on the job you're doing we love Florida and it was so thrilled\nWhat's happening with our people are talent but they're not real\nSorry because this was brutal haven't seen anything like it as a possibly that has invested in the ... most of them this way\nThe Florida Panhandle took a direct hit last week from the hurricane with maximum sustained winds of a hundred and fifty five miles an hour hundreds of thousands of homes and businesses in Florida and Georgia are still without power at least Seventeen people died in the storm and more remain unaccounted for\nOne of the hundred and fifty thousand people are without power and Florida's panhandle after the hurricane WFSU Sean ... reports that with recovery effort is expected to extend it into member people that are turning to distribution sites for food and water\nCrossroads academy a charter school in Quincy, Florida outside Tallahassee remains closed but students and teachers are here distributing hot meals and food to the community you know people in here eating with her son and daughter she says the storm\nWas terrible it was terrible watching how the wind was blowing it will take it all the same about them home and everything and um [noise] I was watching all the trees they have three and half\nOf define everywhere crews are working around the clock but officials say could be anywhere from weeks to months before cleanup efforts are complete ... electric hopes to restore power to most queen the residents by friday but the hardest hit areas could be in the dark for two weeks or longer for NPR News I'm Shawn okay he in Tallahassee\nThe Supreme Court has refused to hear an appeal brought by three major paint manufacturers found liable in the lower courts were selling advertising led based paint NPR's Nina Totenberg\nHas more at trial court found that companies knew as early as the Nineteen twenties that led based paint cause brain damage it specially in children the court then ordered the companies to pay for the removal of the paint and homes in ... California jurisdictions including Los Angeles and San Francisco\nThe pain companies have held all the way to the Supreme Court with lots of support for manufacturers of other products\nBut now the high court has refused to hear the case leaving in place a lower court order to remove their pain in all houses built before Nineteen fifty one when the companies stop promoting lead paint\nThe estimated cost of the removal four hundred million dollars Nina Totenberg NPR News Washington\nMicrosoft cofounder Paul Allen has died on the report to have died from complications of non Hodgkin's lymphoma in Seattle He co founded Microsoft with Bill gates ... sixty five years old on Wall street the Dow was down in eighty nine points\nStreaming support for WAMC come from Tom ... what's the warmth in homes and businesses throughout the northeast today's self stoking automated would heat would boilers dot com\nThat paint the estimated cost of the removal four hundred million dollars Nina Totenberg NPR News Washington\nMicrosoft cofounder Paul Allen has died on the report to have died from complications of non Hodgkin's lymphoma in Seattle He cofounded Microsoft with Bill gates ... almost sixty five years old on Wall street the Dow was down in eighty nine points you are listening to NPR\nOregon Senator Ron Wyden is blasting a plant under consideration by the Trump Administration to use military bases or other federal facilities for fossil fuel exports\nWind saying it amounts to trampling on the rights of West coast communities diminished ration is considering using west coast military facilities or transport term for points for shipments of us coal and natural gas to Asia\nThree new releases hit the feeders over the weekend but Ben I'm was two deadly for them to overcome the comic book adaptations repeat says the top drop the box office for a second straight week and ... Williams says more\nThan I'm growth is thirty five point seven million dollars in ticket sales defined poor reviews\n\nBlack villain and more anti hero in this big screen version the venom ... human health fight to save humankind star is born also remains runner up with a strong second week finish\nThe highest grossing newcomer is first man debuting at number three goose bumps to hunt at Halloween followed opening and for the wild small foot dropped to fifth despite as all started line up bad times that the ... open at number seven three new Williams NPR need spent\nA scape cow did manage to stay on the lam for two weeks after a tractor trailer overturned north of Atlanta has finally been captured news outlets their report it eighty nine cows escape one of the livestock truck overturned other coal relief I Seventy five and I to eighty five fish will say the final cows founded a wooded area captured this afternoon\nI'm jak sphere NPR News\nSupport for NPR comes from NPR stations other contributors include farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life ups and downs\nCoverage options and more information can be found at farmers dot com and the ... foundation [noise] one\nEight hundred three two three nine to sixty one eight hundred three two three nine to stick to we are back James decided to eat a slice of pecan pie on that break which is just the best thing to eat for your ability to speak\nColor and they're all ready to the ... it's\nGreat this is a bit this is a bit I'm do you have a bit of ... and [laughter] and that's what I like to walk to work on that later you got it eight hundred three hundred and Ninety sixty where I'm at WAMC dot org we're dry in the coal [laughter] three ... three\nNineteen sixty we are trying to reach the three quarters on point in the fund drive at night one I'm Sara Lee do I am James fairs and we're hoping to hear from you one eight hundred who are you what is your name\nCall us and tell us attach that to a little bit yeah you can do whatever you can do to pledge and all you have to do is famous for being here give us your name give us a pledge you can give your comments if you want will read them on air\nOne eight hundred three two three nine two things to her online at WAMC dot O. R. G. we're losing volunteers left and right they're done they're set\nStreaming support for WAMC come from birch are Center for weight loss surgery with a focus on life skills and support for a long term success with we've district to me and gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nEdge and all you have to do is send you for being here give us your name give us a pledge you can give to your comments if you want will read them on air thank you\nOne eight hundred three two three Ninety six to her online at WAMC dot ORG we're losing volunteers left and right\nThey're done they're set you don't think they're coming back after they get some ... [laughter]\nFor for the Mumbai listen I don't want to start a fight so I'm not going to talk about the prosecution of pie can [laughter] but I think I've already made my or stand clear ah we heard from Hannah and Sean uh ... Morrison of kicks in New York Thanks so much\nWe also heard from ... New York who loves everything but the opera and from Ira making bird of Saratoga Springs New York one eight hundred three two three nine to six to we're trying to reach the three\nQuarters done point in the fund drive by eight o'clock tonight which is just about fifty two minutes from now what eight hundred three two three nine to six to and we need to raise six thousand eight hundred and fifty three dollars it's actually five thousand in there for three dollars\nIf oh good you gave me a hard ass [laughter] we make this challenge if we make it but if we don't\nKnow it's off of the sea anonymous in Albany New York says let's get their let's get to this this landmark this milestone amount and I will if you get most of the way there I Will give you a thousand dollars to get you all of the way they're one eight hundred three two three nine to stick to a WAMC dot O. R. G. another\nCavalry batch of folks that have come in to try to help us get there are our\nMarvelous museums [laughter] Oh nice we are we are a ... we are able through the generosity of many museums in the region to offer you passes as a little perk for your pledge all the money that they donate these\nOne fifty four to double up at one museum or pick to museums two hundred for three et cetera et cetera\nYes so if you wanted all of them it would run you ... so there's so there's eight of them oh man math\nReally [noise] ah so you're a grand total of four hundred and fifty dollars or you want to make a pledge and get absolutely all of them you got\nOne eight hundred three two three nine to six to her online at WAMC that we're also trying to get to a very important milestone in the fundraising and it's been pretty slow this evening we would love to hear for some more people one eight hundred three two three Nineteen sixty we're trying to reach the\nSeven hundred and fifty thousand dollar point in the fund drive\nLeaving us with two fifty to go and we're six thousand five hundred eight away from that but we do have a challenge on the table from anonymous in Albany who says if you get nearly to the seven hundred and fifty thousand dollar point as close as one thousand away I Will give you the last thousand to get you there and that's something we would like to accomplish before eight PM\nPlease one eight hundred and three two three nine to sixty were WAMC dot O.\nR. G. the museums again you're volunteers are ready to speak with you about them and if you want to pledge on line that they won't be in the job done when you type in your comments which ones do you like and if we have and we'll get them to right now your other good when they're not moving terribly quickly\nBut you might want to get on it because you never know when it's going to pick up a have you been a Mae Sai I've not been to my site I mean to go to my thought so here's the deal about my thought is awesome I'm hum that it is a museum that I think the intention\nSupport for streaming on WAMC comes from the Davis financial group providing fee based financial planning and wealth management services to individuals families and business owners and the pioneer valley and beyond Davis financial G. R. P. dot com\nYou right now your other good when they're not moving terribly quickly\nYeah but she might want to get on it because you never know when it's going to pick up a have you been a Mae Sai I've not been to my site I mean to go to my thought so here's the deal about mind's eye it's awesome I'm hum that\nIt is a museum that I think the intention is to go especially if you have kids it's really cool for that on there's a lot of hands on stuff love that they do\nUm I went and not that long ago not with any children just me and I loved it because I like to go to museums in touch things yeah there are a lot of museums where they tell you not to embarrass I'm fury I've only been\nA little bit to look at a painting ones and the thing that sense that I was doing\nA beep so loudly at me and I was humiliated pretty terrible [laughter]\nI only worry I wasn't going to touch it but as you look on there like that you know the ...\nLet's see what ... what are they either they got like a lot of anger graft generator a big one so it can make your hair stand up okay cool they've got um last time I was there there was like a an optical illusion exhibit which is ... probably not there anymore but that's the kind of thing that they do they\nFeel like the butterflies or sometimes they have they do during the warm months they have a um they ... they have the planetarium of course and that is included with your four pack you get museum and planetarium which normally is after I think\nAnd I'm trains new annual trained stuff it's just a great place and I mean\nObviously since can actually um so you kind of know that there's going to be some history of the whole um gee you know Thomas Edison Arlen kind of sort of part of a one eight hundred three two three nine to think\nThrough a WAMC dot org we're talking about museums and we would love for you to pledge to that station supported station supporter programming and then go hang out with one of our friends the museums are our friends yeah sure\nI mean I think there's probably a high crossover between people who like museums and people will like WAMC offshore and here's the way that you can make a pledge WAMC support the station that you love and simultaneously you get to go a partake in some of the wonderful museums in the area\nEight hundred three two three nine too sick to that is my side the national Yiddish book center is in Amherst, Massachusetts the national book center as a beautiful campus preserving very important history I Believe is the only place like it\nAnywhere um that absolutely this book center it's a ... a you enter a lively world of Jewish culture when you go there they'll find a million in his book that says a million I'm not\nI'm not I am prone to hyperbole but I'm reading directly from the sheet of paper a million books\nPermanent and visiting exhibits and English language bookstore in a year round scheduled educational programs concerts lecture some special events including in stock the festival of new Yiddish music\nWhich is very fun and cool um the for the ... center pledge you get to go to the you get a membership to the other sports center you get a slip back which is a campus so bad featuring the Guinness Book center go logo which is a very cute goat\nUm and the word slapped in the it is is excellent for slipping ... everywhere you go and uh you get your news flash cards and the Senate was on a Nineteen eighty by Aaron Lenski now in their fourth decade\nThey are attracting unprecedented numbers of young people you just spoke centered dot org they're excellent for instance station I Love working with them when we get to feature one of their events including like we feature every year on the round table it's just it's a ...\nStreaming support for WAMC come from birch are Center for weight loss surgery with a focus on life skills and support for a long term success with we've district to me and gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nSki now in their fourth decade they are attracting unprecedented numbers of young people you just spoke centered dot org they're excellent for instance station I Love working with them when we get to feature one of their events including it's like we feature every year on the round table it's just it's a fantastic and they are always so generous to us and\nGive the grounds of the bag alphabet cards and the and the membership absolutely\nThey're great Francis Asian we really appreciate all that they do\nAh we got a couple of online pledges here one from Stephen ... afford Edward New York thanks so much Stephen and one from Jeffrey Morris income hose plugging for the ... um Mario book school so it sounds book yup that's pretty cool we do I don't think they will to look\nThe other one is\nSomething I'm not going to remember it because it's comical early civic [laughter]\nSo me and Mario is about ... out and Mario Cuomo so if if you're not sure what you want you want to make a pledge but any want something but you're not sure\nFirst of all you can always call one eight hundred three two three Ninety six you are volunteers will talk you through it they many of them have been here for many many years and know the kind of stuff that we haven't have been\nOtherwise they can always ask and we can look\nAt 'em or if you want to browse yourself go on line WAMC dot org make that pledge you can there's a drop down menu that'll help you fly something if none of us off we're talking about how good don't worry we've got you covered\nAnd you can be covered with the umbrella if you want 'em by a ... percent too busy to listen to the roundtable at work\nWhich is why I Love the fact that I can listen to it online anytime I Want yes a very good feature\nA and most of our programs it's not all are available\nAre on the Web site that's right as podcasts I'm constantly emailing people that's yeah there are a couple of exceptions button button for the most part they can they can be access that way that's right so I mean always always a good thing or there's a feature requests for the ap here so I Will pass along to the right people\nOne eight hundred three two three Nineteen sixty were online at WAMC dot org things to Margaret men of Petersburg New York keep doing what you're doing listens everyday thank you\nAnd thank you to anonymous uplifting Park New York or just keep up the great work one eight hundred and three two three Nineteen sixty her online at WAMC dot O. R. G. it's museum we have the national baseball hall of fame and Cooperstown historic Hyde Park and Franklin Delano Roosevelt librarian Hyde Park\nLand it's our freedom and aspirin my science Schenectady national you this book center in Amherst Norman Rockwell museum in Stockbridge Springfield museums in Springfield, Massachusetts and the Clark and Williamstown\nMassachusetts our volunteers can tell you more about them or go through that lets more slowly with us I'm being obnoxious Lee fast one eight hundred three two three nine to sixty we also have a challenge on the table so please keep calling\nI'm anonymous from Albany wants to get us to the seven hundred and fifty thousand dollars raised point in the drive if we get most of the way there\nThey will give us the last one thousand dollars and we really want hoped to achieve that in about the next three or four minutes which is a eight PM gyms I Will be with you until nine PM so let us reach that goal and then ... ts\nThe house [noise] know now you're going to think more underwriters absolutely and support for WAMC comes with the Adirondack aquatic center molten New York's a plant aquatic facilities where children adults with varying abilities in the region can learn he'll play exercised train and compete\nAdirondack aquatic center dot org stone soup concrete specializing in hand crafted environmentally sound concrete counter\nStreaming support for WAMC come from birch are Center for weight loss surgery with a focus on life skills and support for a long term success with we've district to me and gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nAquatic center molten New York a plant aquatic facility where children adults with varying abilities in the region can learn he'll play exercised train and compete\nAdirondack aquatic center dot org stone soup concrete specializing in hand crafted environmentally sound concrete counter tops sinks furniture and floors certainly northeast since two thousand one stone soup concrete dot com and on Facebook\nPark building a mill work Schenectady offering mill work flooring kitchen and bass designed and more preventing staff large displays samples and design ideas\nOr building and mill work dot com Mary Scanlon strategic communications consultant certainly WAMC listening area for more than twenty five years offering public relations and communication strategies for individuals and groups\nFive when a four to four five one to five for information\nCopper see distillery new ... New York a farm to glass distillery feature heritage method distilling in New York's Hudson Valley\nProviding tourist Hastings and more ... dot com\nThe Poughkeepsie public library to stretch coordinating be two thousand Eighteen and eat a big read offering films discussions art individual visit with author Celeste in\nP. O. K. L. I. B. dot org\nStudio Katie I'm salon red hook specializing in all phases of cutting organic color from corrective to fashion by side was crushed in Marquette studio ... dot com\nMiss whole school Pittsfield, Massachusetts a boarding and day school offering girls and grade nine through twelve the real world experiences of its horizons internship and service learning program ms halls dot org turban restaurant\nFor lunch and dinner seven days a week and historic renovated church building in the heart and brand village turban restaurant dot com arch of an all time fine jewelry and gets the dream ones these designs created with colored gemstones pearls diamonds and precious metals urge mental ... main street chat on New York's then all of a sign jewelry dot com [noise]\nAppreciate not being the first group\nThe air today to lose the challenge I can take it if it happens\nI've lost a challenge both over yeah it's just hard to deal with um [noise] yeah I had for Boston\nI'm ah I'm really in that the pit of despair right now and that I was talking about earlier well I Need you to [noise] not so let me just swallow for two minutes and then I'll bring back the excitement ... on the radio yep [noise]\nJust looks just you're dead air for a two minute no we can't and then we'll go back to I think that's off the bat [laughter] okay well I've been told them nothing worked for it so here's the deal we started this challenge off one at like six thirty roughly\nRoughly yeah and uh I'd rather hire and we had about ... eight thousand dollars to go right so do you make it ain't nothing no we're right now we have a little less than five thousand dollars to go\nSo we made a lot of progress yes yeah but I Would say to me 'cause I go by the time that we need to make it which is like you said twenty minutes from now we are pacing poorly twenty minutes and seconds [noise] this is where I started to panic which apparently\nAnother one minute and fifty seconds are going to be used for you to wall\nSo we need about five thousand dollars and what that means I mean if we get the challenge is about four\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including ... robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nApparently another one minute and fifty seconds are going to be used for you to wall\nSo we need\nAbout five thousand dollars and what that means I mean if we get the challenge is about four All right [laughter] so it doesn't always gets us to the seven hundred and fifty thousand dollar plan the drive but the challenge as established will help us out will give us a lot okay\nSo let's say we need four thousand let's just be conservative\nLooking at this room we've got ... eight people in it at the average pledge of a hundred dollar I'm going to do some math on the air here 'cause I Know is engaging content or the average pledge of about a hundred dollars [noise] we need about forty pledges right yeah that means that everybody in this room means to answer recall\nFive times so I Would love you said how long has this phone call take two minute less than two there's plenty of time for that yeah\nBut we need to get started and now now we need to make those ones ring we just don't have the staff to handle it so make that call me that played online let's get them in now because we only have\nTwenty minutes and we don't want to live leave a thousand dollars on the table you know we have terrible yeah anonymous in Albany New York said get within spitting distance of seven hundred and fifty thousand dollars and I will finish that\nPut you had the three quarter mark and then that last hour is all extra credit awesome I Love extra credit I Love to get to that point but we got to make the original\nCredit for ... to do the work yep and we can only do so much\nYeah I think we're doing half of it we're not we're not only five percent yeah what the other people didn't work are the volunteers yeah we have our wonderful ...\nWe have um everybody who gives food and even that cumulatively maybe twenty percent total because eighty percent of the work has to be done by you\nAnd it's really it's a the ratio is very much in your favor because it's it's a huge percentage of getting the thing accomplished\nBut it does require very little effort from you ... to to call or go on line it doesn't you don't have to get up you don't have to leave your house or wherever you are sure if I'm understanding of course one feel the pinch\nOf the of their wallet but whatever you can do helps anything you can afford health\nOh do whatever you can we talk about a hundred dollar level a lot if you can't do a hundred dollars we get that you know we don't want you to spend your last dollar donated WAMC we don't want you to skip meals for it\nIf you can't afford to do a hundred dollars I totally understand that yeah we just thought that you do whatever you can do and if there are people who can't give anything like I said if you can't afford to give anything we don't want your last caller we should go hungry because of this week but what we ask is that if you have\nEnough if you have enough that you you know can't afford to maybe pledge a little extra because there's somebody else who relies on the station but can't afford it um\nIf you think it's important to be there for the community listen we do to where we're here with this station and we charge zero dollars for it we just ask for donations from those who can give and that meant that everyone in the community have access to it\nSo when you're a hundred dollar pledge you're supporting a radio station that have listened to by over four hundred thousand people over five hundred thousand I laughed metric\nThat's amazing that's a great thing that you can do and there's a lot of those people who can't play\nStreaming support for WAMC come from birch are Center for weight loss surgery with a focus on life skills and support for a long term success with we've district to me in gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nEveryone in the community have access to it so when you're a hundred dollar pledge you're supporting a radio station that have listened to by over four hundred thousand people over five hundred thousand I laughed metric\nThat's amazing that's a great thing that you can do and there's a lot of those people who can't pledge\nOr having pledged or if you're one of them ... who can and having now is a great time yes 'cause you're supporting yourself you're supporting a lot of other people you're supporting the station for the future too if you want us to still be around a for your children or your grandchildren\nUm if you think this was an important service I mean I remember we got 'em you know we've been answering phones for the um locked box kind of mini drives yeah for the past week or two and I specifically got somebody on the phone who said to me\nLike she was one pledging I don't want any gift or whatever I don't I don't remember\nBut she said that the reason she was flooding was because we carried\nMe full Kavanaugh hearings and I ... I was really grateful for that because it's always nice to hear that someone thinks that the services that we think are important they agree that they think that's important and they're saying I'm willing to pay for that because I think that it is that important\nWe want to provide those services we want to give the highest quality coverage that we possibly can\nAnd uh all we're all willing to work for it we just need you to pitch in to help finance so make that call make that pledge white hundred ... two three nine to sixty you can play online at WAMC dot org throw volunteers would love to talk to you one hundred and three nine to\n... we heard from the cost of children from Massachusetts who says I started listening to the station during the fund drive years ago it was fun to listen to so that I'm not anymore I said no [laughter] as\nSaid I bet if you're listening right now this isn't the first time you've listened and said well I started during the fund drive and I said of course\nThe exception not no nothing comes of his rule just like the it's not impossible certainly that you are then if we say things that turned out to be incorrect and to get somebody to call in I'm for it [laughter]\nLet me make all sorts of his own K.\nCareful [laughter] I Know I think he's much I appreciate that negative Jennifer Smith of turning are pushing for the night crew and planning for the challenge thank you Jennifer thanks to June in Northampton who does it as one of the best radio stations there is an iron from anonymous and oh no sir you we heard from\nMargaret and Sean from hurting Margaret and Sean from Hurley called up and pledge thank you eight hundred and three two three nine to six to her online at WAMC dot ORG\nWe're trying to get to the seven hundred thousand dollar point seven hundred and fifty thousand dollars raised point in the entire fund drive toward our one million dollar goal that three quarters of the way done on the first day of the official fund drive\nThe first day we did we had a fantastic locked box we talked about we talked about a bunch on the air during our programs to pledge to get us halfway\nThe floods were locked box you're off the hook you want to make a second blood we'd love it but you've already do your part and we think that's so great thank you so much\nYou mentioned a few minutes ago that we have WAMC has at any given time hundreds of thousands of listeners absolutely and we have the number of people are the number of pledges sick have come through today from starting at six AM until right now and that is one thousand four hundred and Seventy three pledges and I\nHappen to know that at least one person pledge twice today so that this doesn't even mean that one thousand four hundred and Seventy three people pledge\nStreaming support for WAMC come from birch are Center for weight loss surgery with a focus on life skills and support for a long term success with we've district to me and gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nFrom starting at six AM until right now and that is one thousand four hundred and Seventy three pledges and I\nHappen to know that at least one person pledge twice today so that this doesn't even mean that one thousand and four hundred and Seventy three people pledged because at least one person pledge twice so\nOut of the hundreds of thousands of listeners we have that's really it's a teeny tiny teeny tiny itty bitty fraction of them it's like one thousand four hundred and Seventy three people you can imagine\nSeeing that many people yup and then five hundred thousand people\nYou can't write like kind of cat and so many people where do you put them yeah\nYou put um near or radio or near a computer on your smartphone and they're listening and they and many many\nMany many people can't afford to donate to any not for profit they'd want to support and that is a okay totally true so many people can and then whenever you can't afford to pledge we hope that you will now to help us and the ... get us back to regular programming one eight hundred three two three Ninety six to if you've never pledge pledge now if you haven't pledged in a while\nPledge you know there's no no\nShame and having had to stop for a while and coming back when you were able to air under three two three nine to six to\nRock can be like what happened no room to say thank you that's what we always do we always do or we heard from Matthew Myers Afghans abort a who pledged and this is not something that's supposed to be read but I Will just say it\nUm for a ... code or who use are awesome they are we only get one they're very cozy and you know what time of year we're going into your love having tasteful navy blue with a small yellow logo ... yes big pockets very comfortable uh he says he really enjoys the round table and fresh air\nIt makes his commute tolerable and please vote please vote great you have to watch I just\nDon't know if you're in New York Way with the voter registration deadline is this is this week from Massachusetts I think it's the seventeenth and left last friday for nearly\nEight hundred three two three nine to ... to one eight hundred three two three nine to ... to anonymous from ... New York pledged on line at WAMC dot org", "year": "2018", "show_name": "Fresh Air (NPR)", "city": "Albany", "day": "15"}