{"month": "10", "state": "NY", "station": "WAMC", "content": "Bullets false hospital or regional health care system with twenty four locations across eleven communities gloves falls hospital dot org for more information and take Lee Allen combining legal strategy with a fish and sea to address clients legal needs with offices in Albany yet throughout the northeast a line that ... Allen dot com [noise]\n\nThis is Northeast Public radio WAMC F. M. H. D. Ninety point three Albany\nW arguing HD Ninety point three rooms in Utica W. A. K. E. H. D. nine point nine Kingston W. O. R. H. D. Ninety One seven Middletown W C. E. O. H. D. Ninety One nine Plattsburgh WC a an HD Ninety three three Kennedy Harry W. N. C. H. D. one oh three point I kind of rogue WHM cue HD one by one great aren't in\nW. W. E. S. H. D. A. D. point I had not just go W. A. N. D. H. D. Ninety point one Stanford W a an eighty eight point by Brewster and WAMC am fourteen hundred Albany from WHYY in Philadelphia\nAnd Terry Gross with fresh air do they have the Supreme Court became so politicized\nDivided into liberal and conservative\nBloc if the court is just another purely political branch of government why haven't\nPoliticized divided into liberal and conservative\nBloc if the court is just another purely political branch of government\nWhy haven't we talk with David Kaplan author of the new book the most dangerous branch inside the Supreme Court's assault on the constitution\nOr other talk about what comes to appointees Neil Gorsuch and Brett Kavanaugh mean for the future of the court and will consider the significance of having a chief justice John Roberts is also considered the most likely swing vote\nYou will be the first chief justice in eighty plus years who is in the middle such as it is of the court will truly be his court\nAnd Ken Tucker reviews ... seventh album bottle it in that's coming up on fresh air\n\nFirst news live from NPR News in Washington I'm ... beer President Trump says he may send thousands more troops to the southern border to help keep people from entering the U.S illegally ... more from the White House\nSays the caravan of migrants approaching the U. S. from Central America is dangerous he repeated his pledge that he will not allow them to cross the border\nAs far as the caravan concern our military is that we have about five thousand a will go up any wherever we receive our military personnel on top of border patrol and everybody else in the water nobody coming in\nPentagon chief Jim Mattis defended the deployment of troops to the border saying it is not a stunt the military cannot act as law enforcement inside the U.S so he said soldiers will mainly help with logistics and provide other support to border patrol agencies Ayesha Rascoe NPR News the White House\nA federal appeals court has ruled Ohio wins or move for not voting over a six year period must be allowed to vote in the mid term election Karen castle of Ohio public radio has more\nAn appeals court in Cincinnati says voters who were removed from the rolls between twenty seven and twenty Fifteen may cast provisional ballots as long as they still live in the county where they were registered and hadn't been disqualified from voting because a felony convictions or other reasons\nThese are voters who may have been removed or purged before a lawsuit was filed in twenty sixteen challenging Ohio's voter roll maintenance method which was upheld by the U.S Supreme Court in June\nOhio secretary of State John Houston says he disagrees with this ruling but won't appeal it because it doesn't affect many voters and because of the short timeline and tell election day\nThere are more than eight million registered voters in Ohio and no voters had been removed since the Supreme Court decision for NPR News I'm Karen ... in Columbus\nSuspecting Saturday synagogue shooting in Pittsburgh has now been indicted by a federal grand jury\nIndicted on charges Robert Bowers with forty four counts including hate crimes authorities say open fire the tree of life synagogue eleven people in the morning six others including for police officers Dr Donald Verrilli is chair of emergency medicine at the University of Pittsburgh Medical center ... as a police officer and a congregation member they're treating her both improving\nThe zoo in the sense of your unit or doing much better now\nNo longer with reading some medications to support the war\nPowers remains job without bond facing a preliminary hearing tomorrow the federal government has indicated it will seek the death penalty in that case you know services for the victims began yesterday and will continue to the rest of this week\nStopped short higher for a second straight session is what has been a punishing month for the market came to a close some stronger quarter quarterly earnings numbers help to boost or boost and socks for investors the Dow was up two hundred and forty one points today that that gained a hundred and forty four points than ... also hire this is NPR\nThat was up two hundred and forty one points today that that gained a hundred and forty four points that I was stuck in the U.S and people were also hire this is NPR\nA former federal investigator says a mafia hit man is a key suspect in the prison slang a former Boston crime boss James Whitey Bolger\nThe eighty nine year old Bolger was found dead yesterday in West Virginia prison cell going to a longtime investigator who spoke to Associated Press rock edition of anonymity he believes inmates forty is Freddie Yassin least one other one big were involved in Bulger's death\nGas was convicted in two thousand three of killing a western Massachusetts mobster federal officials have said they're investigating Bulger's death as a homicide [noise]\nIt is a day for Boston Red Sox fans to celebrate their World Series champions Lynn ... of member station WBFO ... was there was the team paraded through the streets of Boston aboard duck boat [noise]\nRuling rally celebrating rent the reasoning for two thousand four germane poem left work to watch the parade\nHe says he wouldn't have missed cheering for his hometown champs\nFamous I can kind of lived through them as as fans we lived through them in a suicide and happy in it and then so happy for the fans you know and I know how much we support them and the energy we get them to help them or do we know games so it's like we all are happy and\nThis is the eleventh time Boston has hosted a parade celebrating a national sports title since two thousand to ... seem to agree it never gets old for NPR News I'm Lindsey Pollak her in Boston\nOil cap one of its worst bunch in more than two years amid concerns a looming global economic slowdown could cut into sales brutal futures prices for more than one percent to end the session that sixty five thirty one a barrel in New York I'm jak spear NPR News in Washington\nSupport for NPR comes from ... am committed to changing lives through math by building math achievement problem solving and critical thinking skills for thousands of students every day and nine hundred franchise locations math ... dot com slash NPR\nSupport for WAMC cups of the eighth step celebrating fifty one years of folk and acoustic music presenting Betty and the baby boomers November third at seven thirty the Eddie at proctors eighth step dot org\nAnd the ... museum and Kennedy Harry presenting portraits at landscapes featuring works by with little ... for for a deliberate Stewart more at our museum dot org [noise]\n\nThis is fresh air and Terry Gross\nThe Supreme Court has changed during the Trump Administration the court now has to Trump appointees Neil Gorsuch replace the late Antonin Scalia after Mitch McConnell block President Obama from choosing Scully a successor and Brett Kavanaugh who replaced Anthony Kennedy after Kennedy retired\nNow the chief justice John Roberts is also considered the most likely swing vote in a court that has five conservative justice is\nMy guest David Kaplan says the court has reached the point where justices are often seen as political proxies of the Republican or Democratic Party\nHis new book is about how the court became so politicized and so powerful\nIt also includes profiles of several of the justices the book is based in part on ... interviews with several of the current justices as well as pass justices sixty five law clerks who worked at the Supreme Court and congressional and White House officials dating back to the Reagan Administration\nA lot of the interviews were done on the condition that he not named the source Kaplan is also a former\nTo the show's dating back to the Reagan Administration [noise]\nA lot of the interviews were down on the condition that he not main source Kaplan is also a former legal affairs editor at Newsweek where he covers the Supreme Court for a decade his new book is called the most dangerous branch inside the Supreme Court's assault on the constitution\nDavid Kaplan welcome to fresh air so one of the main themes of your book is that the court has become so politicized you can predict elites justice will vote it's become politics by another name elaborate on that idea for us\nWell on those hot button issues like abortion and same sex marriage and voting rights and gun control and campaign finance you pretty much know ahead of time where they're going to come out so the larger question I'm trying to ask in the book is whether the court ought to be as interventionist\nAnd as involved in American Life\nAs it is and during for example the recent Kavanaugh's confirmation hearings you heard questions about specific issues like abortion or presidential power but nobody asked\nWhether the court is properly involved in so many of these political and social issues because everyone pretty much assumes a that it ought to be\nIn what sense do you think that the court is overstepping\nThe court docket is almost entirely discretionary the justices decide which cases they want to hear and too often they choose to hear cases involving issues that I argue would better be left to the political branches at cheaply means Congress\nStill on the federal appeals court in Washington and ... who of course was Obama's pick to succeed Scully in two thousand sixteen\n[noise] so I think there are a lot of concerns now that we have two justices\nIn the Supreme Court who has been accused of sexual misconduct Clarence Thomas the sexual harassment and Brett Kavanaugh sexual assault and these men might have decisive votes in matters pertaining to gender equality sexual assault or sexual harassment issues\nAnd questions the credibility\nOf the ... court because they might be very uh biased in their opinions\nWhether their bias or as you know have the appearance of bias is a real problem for the court and there's no real solution I don't for example think you will see recusal\nIn such areas of the law I don't think you'll see Kevin recused himself anymore than Clarence Thomas to part of that is it's hard for justice to recuse himself\nOr herself at a lower court you can always substitute in a new judge you can't do that\nOn the Supreme Court there nine justices if one doesn't sit in the case then you're down to a they don't like even numbers of justices but we'll we'll Kavanaugh bend over backwards in in such cases to try to undo the concern people have that's\nSuch dime store psychology is beyond my pay grade they're certainly isn't any indication in his opinions to date of a bias but you know his performance after Dr Ford testify\nTalking about how this was a vast left wing conspiracy the Clintons and all that even if he apologized for try to in the wall Street Journal op ed piece\nI think that in some respects\nA leaves him\nIn an even tougher position than he might in a sexual harassment\nCase there are a lot of cases it if they don't involve the Clinton specifically obviously they involve politics and a cabinet or you could argue showed his true partisan shelf in that twenty minutes of testimony I Would be justice concern in that area\nWhat kind of cases do you think that might influence\nYou could imagine campaign finance\nAppeal coming up they're going to be more of those and depending on who brings it\nYou know are are there Republican interest or their democratic interest I think even if he's not in fact biased the appearance of by a bias is a real one having settled that there are all kinds of reasons of course to criticize\nJustice Thomas's performance on the court for the last Thirty years and I do so in my book but I'm not sure you can point to a lot of cases in the area of of\nA sexual harassment or regulation of the workplace 'em and say that\nThomas ruled the way he did out of ... or bitterness from his hearings back then\nI don't know if this was after last February or not my last February there was in New York magazine cover story headlined the case for impeaching Clarence Thomas with stories of other women besides Anita Hill who had stories that sexual harassment ... um regarding Clarence Thomas\nWith stories of other women besides Anita Hill who had stories of sexual harassment ... um regarding Clarence Thomas [noise] so it's um it's a story that keeps you know coming back to life\nIt does and some folks could argue that maybe it was truly generous it was unique and it was dated but the Kavanaugh stuff brought that all back\nTo light and as you point out now we've got two justices under a cloud separated by Thirty years that is really bad\nFor the court it's bad for the courts ... I think it helps to a feeble Congress we have a lousy Congress for any number of reasons but one of the reasons as various congressmen and senators would tell me they don't act this 'cause they know that the justices across the street\nWill act and I also think it\nIt distorts presidential elections and the way that we saw in two thousand\nSixteen twenty twenty five percent of Trump voters said they didn't like Trump's temperament they didn't agree with the with a lot of what he said but they voted for him simply because of the Supreme Court\n[noise] so um it in terms of how politicized the court has become I'm President Trump supported Brett Kavanaugh through the hearings and Trump insulted Christine Blasey Ford who made the allegations of sexual assault [noise]\nAre you concerned are their concerns out there that Kavanaugh will feel the hold and teach Trump and therefore\nCome to conclusions in ways that support the Trump Administration when the Trump Administration\nIs involved in the case\nI think they're all kinds of legitimate bases for criticizing Cavanaugh I thought his testimony\nAfter Dr forge was appalling I thought Kavanaugh's performance of the press conference at the White House was a ... of a justice but I think the notion that now that he's on the Supreme Court he's going to feel beholden to the president who appointed him is misguided one of the great aspects of the system\nWhich has lots of laws is that once you're on the bench and have life tenure you really don't have to look down Pennsylvania Avenue with any degree of loyalty because the president can do anything\nAt that point other than tweet so I think by and large most justices or throughout history have\nSuccessfully proclaimed and demonstrated their independence from the president's so pointed them look at the Nixon tapes case in Nineteen Seventy four were unanimous court ruled against Richard Nixon that doesn't mean you kind of a friendship\nWith the president and various FDR appointed justices remained friends with FDR butter on my list of criticisms of and concerns about Brecht cabinet or the fact that he's grateful to this president I don't think will affect his decision making I think most justices most of the time\nOnce they're up there they're free and clear\nI hadn't known of Brett Kavanaugh before he was nominated to be a Supreme Court justice but you write that some people some insiders were surprised that he wasn't on\nTrump's first list of a potential nominees the one that the one that that ended with the core such nomination and you say some movement conservatives\nCalled Kavanaugh\nApprove Eric ... milk toast to lacked guts and again this was before his nomination this was during the course hatched nomination why was he called ... ... ... to lacked that's\nAll they would say he was such because of an\nGorsuch nomination why was he called ... ... ... that's\n... ... they would say he was such because of an opinion he wrote in one of the Obamacare cases where he didn't reach out and strike down the statue which is what the movement conservatives won and instead he said\nThat his court the federal appellate court in Washington or should not be hearing the case deciding the case at that moment on procedural grounds there was a technical issue that we we don't I Will go into details on but he wrote what I thought was a measured\nScholarly legal opinions saying the case isn't quite right for us it's a timing issue I thought it was a good solid opinion Dwyer that doesn't matter but I think he was taken out to the woodshed by a lot of movement conservatives who said why didn't you do\nOr the right thing here and that was the chief strike\nAgainst him now I happen to think that cabinet or on the court will wind up being less of the arch conservative that Thomas and Alito\nHad been or that Gorsuch will be I Would predict the capital will be closer\nTo what passes for the center of the court that chief justice Roberts is now the swing vote and I think his institutional is him his affection for the court and for its own reputation may\nLead him in ... on some occasions to rein in the courts power in the way that chief justice did decisively show\nThe Obamacare ruling upholding the statute back in two thousand twelve I think Kavanaugh will\nVeer on occasion closer and then in that direction and for example Neil Gorsuch\nMy guest is David Kaplan former legal affairs editor at Newsweek and author of the new book about the Supreme Court called the most dangerous branch inside the Supreme Court's assault on the constitution we'll talk more after a break and Ken Tucker will review singer songwriter ... new album\nI'm Terry Gross and ... [noise]\nThen you've our family foundation supports WHYY fresh air and its commitment to sharing ideas and encouraging meaningful conversation [noise]\nSupport for NPR comes from this station\nAnd from progressive insurance [noise] I'll bring it home quote explorer shoppers can evaluate options in one place when buying home insurance\nLooked like and sometimes as justices will say Robertson otherwise the opinion just doesn't right\nAnd he quickly came to the conclusion that the law ought to be upheld I think Roberts and the best sense of the word in a close case decided\nI'm going to give the benefit of the doubt to the legislature and he decided as an institutional matter to strike down the Affordable CARE Act in the middle of a presidential election year would put the Supreme Court smack in the vortex of that presidential election and that would be bad for the court\nIf you're just joining us my guest is David a capital and he's the author of the new book the most dangerous branch inside the Supreme Court's assault on the constitution he's also the former legal affairs editor of Newsweek is going to take a short break and we'll be right back this is fresh air\nSupport for WAMC comes from New England hydroponic ... the un dark gardening experts offering a full selection of hydro politics organic soils and indoor gardening equipment Southampton in Framingham, Massachusetts on line it and eat hydro dot com\nAnd Albany law school offerings online master's degree in cyber security and privacy law also offering master's degrees focused on government affairs health law and health care compliance Albany law dot edu slash on line\n\n... support for NPR comes from this station and from logged me in makers have go to meeting a collaborative meeting platform over Eighteen million monthly you they're designed to connect people from anywhere in the world on any device learn more and go to meeting dot com\nAnd from west in hotels in ...\nStreaming support for WAMC come from ... what's the warmth in homes and businesses throughout the northeast today's self stoking automated would heat would boilers dot com\nSuper foods I recommend you and gear lending Irwin workout gears left behind at home Weston let's rides learn more western dot com\nThis is fresh air and if you're just joining us I guess is David ... Kaplan author of the new book the most dangerous branch inside the Supreme Court assault on the constitution he's also former legal affairs editor at Newsweek\nSo we have to come to the point is on the Supreme Court now Neil Gorsuch and Brett Kavanaugh Justice Scalia who was replaced by Gorsuch or wasn't originalist\nWhich means are interpreting the constitution as it was intended to be interpreted by the founders when it was written\nAnd not considering it a document that has to be updated for the times that we live in and Thomas considers himself an originalist or a texture last I say that not really understanding the difference between those two\nTerms but um is Gorsuch or having a an originalist or attacks journalist or do they not subscribe to that point of view\nI think they would both call themselves card carrying originalists and to some extent ... having said that I'm In my book originalism is bunk because even original is\nOnly use originalist originalism when it suits them when it doesn't suit them they ignore it I think it's a lot of nonsense and of course the most important thing about the whole original as a a a a trope is that if you look at the constitution and I've read mine a lot\nThere is no clause in the constitution that says thou shall interpret me based on what you thought those who wrote me two hundred and fifty years ago thought it's nonsense\nBut something you say about originalism is that because you're trying to literally follow at the founding fathers meant when they wrote the constitution\nAt a time when there was slavery at a time when women did not have equal rights\nYou say that originalism favor as a status quo fixed in the Eighteen century and it tends to favor the halves of that time and to this favor all others such as minorities and other unpopular litigants and maybe we can add women to that\nAll true but of course the constitution is not written as a set of regulations some constitutions the world are written that way when you use phrases like a equal protection of the laws or due process of law\nOr no unreasonable searches and seizures when you write things in such general terms you necessarily are inviting those who interpret you whether they are judges or presidents or senators I'm to use their own\nJudgments as to what it means that's why you write a constitution\n[noise] do you think that justice is in general have become more politicized in recent years than they've been in the past yes okay why do you think that is\nI think in part because the selection process that we use now and the better if more cynical\nA process that White House is used to pick nominees results in such candidates you know the Brett Kavanaugh is a competent judge show was Neil Gorsuch but they weren't chosen because of their stellar credentials those were unnecessary requirement for getting chosen\nStreaming support for WAMC come from ... Center for weight loss surgery with a focus on life skills and support for a long term success with we've got struck me in gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nFor example was chosen by ... Obama and you know you can blame presidents that are blamed the Senate but I I think you in the first is that you need to blame the court because it gets involved so often it raises the stakes of who sits\nOn the court so if the court is in effect going to govern the country on so many key issues than you really need to look at how you think individual members of the court are going to vote when you do that politics the role of a politics necessarily becomes heightened it wasn't\nAlways that way when John Paul Stevens was picked by Gerald Ford in the mid Nineteen seventies\nAnd it wasn't for that reason and I could give you half a dozen a dozen other examples those days are long gone I Would like to see the return of those days\nDo you think the political politicization of Supreme Court nominees but includes how Mitch McConnell blocked Merrick Garland from even coming to the Judiciary Committee after he was nominated\nAbsolutely and and listen if the Democrats get control\nOf Congress of this this time round or in two years twenty twenty I think you'll if they can get their act together because they're not really good at playing dirty or you may see them raise the stakes you know they talk about ... about getting rid of life tenure at the Supreme Court that would require\nA constitutional amendment but if you want to increase the size of the court\nPack the court as it were all you need is an act of Congress if the Democrats control the house in the Senate or the White House and twenty Twenty one I don't think court packing is off the table at all and if you want to get back the Merrick Garland seat and if you want to take back control of the court\nJust add to more seats a point to liberals that an eleven member court you have a six foot majority do I think that's possible yes\nVenus Supreme Court justice is I'm a lifetime appointment you leave when you say you want to leave and how old is your third against but now eighty five and how old was a jump on Stevens when he left\nNinety yeah so it's a you can say for a really long time um\nSo a lot of people already good it's a pretty good gig gig [laughter] yeah\n[laughter] um so the lifetime appointment issue has been challenged by many people because now that people are living to such\nOlder ages than they used to when the Supreme Court was first created you know and when the constitution was first written\nUm the president's power to appoint a Supreme Court justice that's become a much bigger power than it ever was big cuts in part of the extension of\nThe lifespan of Americans [noise]\nUm so you know some people including you have proposed changing the lifetime nature of the appointment why do you think we should consider changing it and what are some of the suggestions you have\nWell would lower the stakes of any particular\nNomination if for example there was a single term of Eighteen years as many others have suggested in which I indoors I think that would lower the temperature it would allow once you kicked in the system over time because she couldn't make courage justices leave it would\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including may go robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nWill never happen um I mean I think the most creative idea that I came across was not so much a single term but by staffing the Supreme Court randomly I'm with a rotating series of nine judges picked among the chief judges\nOf the twelve lower federal appeals court in the country\nIf it was just any bunch of judges picked and maybe it wouldn't be a nine of twelve maybe it will be five of twelve venue might", "year": "2018", "show_name": "Fresh Air (NPR)", "city": "Albany", "day": "31"}