{"month": "10", "state": "VA", "station": "WHKT", "content": "That's our town halls on top of\nThe nation wide ban on her way for a trash bag had a motive\nFor the series of pipe bombs venture a number of prominent Democrats including the concerns on the Obamas CNN's New York bureau also a target there's a lot of physical evidence or in the explosives did not get that all of us has President Trump condemning the threat of political violence and he was calling for unity across party lines\nAt a rally here in the upper Midwest the president promised going to rent the investigation and vowed to find those responsible for mailing pipe bombs and bring them to adjust to hopefully very soon\nHe said such violent acts or an attack on democracy itself the president also said the news media have a responsibility to set a civil tone ... with the president\nLaw for us our borders illegally will be sent back home\nI don't\nTell them not present got along hike but they can't they cannot\nThe way they want to comment doesn't work that way\nPresidents and last night you know the campaign rally in Wisconsin bench ... century vanished and the search for Thirteen year old Jamie cost goes on the Wisconsin girl disappeared after her parents were found fatally shot in the family home or to ensure that Jamie\nCould be grave danger now offering a reward of twenty five thousand dollars for information that directly relate to her location\nThe FBI's Justin ... male one of the agents working the case now captain for more than three years in Syria a Japanese journalist recently set rate now arrived back in Tokyo Wall Street hoping to recover some of what Washington yesterday stock market rallied\nNow futures up one forty five more on these stories a town hall dot com\n\nYou guys can hear from the hip typecast\nToday's growth who would win at three mile bicycle racing eleven year old girl or last year's winner the Tour de France it all depends on the bicycle it depends on their vehicle ... tend to be in the ... going to win every time but put the race run a trace Ikle and the eleven year old when every time you see it's not the driver each the vehicle when it comes to\nGenerating revenue it's exactly the same if you have a job or a small business\nYou are writing the trace it all you can only go so fast if you need to make up ... it's not going to happen on a tray sickle no matter how fast you pedal it's simply not going to win the race why do many people with new school and you know advanced degree often\nBecome very wealthy simple they choose to only right ten speech when it comes to helping people create their niche ribbon model bulls Forbes any recommend income\nStore as a can't miss when it comes to putting people in it tends to be good your household their business using additional revenue model that doesn't suit depend on you if so you need to check out income store dot com best income store dot com\n\nIt's not only Wall Street's that has taken a hit lately Asian stock markets as large as one\nCan look at three main reasons that as tempting telling me that's an interesting in the United states which is affecting sentiment in our ... for economic growth ending us as well as corporate\nEarnings and failing out here in ancient ways staying Asian and like it's probably across the region CNN factor\nQuestions for U.S China trade wars and finally I think it is the emotional factor which is the reason why people are selling is because people are staring\nAt the BBC's ... German automaker John reporting that profits plunge Twenty one percent in the third quarter company is facing backlogs registering vehicles are doing missions rules in Germany costs have risen news item than our son is a town hall dot com\n\nLeader of a Southern California white supremacists\nLast year in Charlottesville, Virginia us attorney's\nOffice spokesman Tom Rhodes says rise above movement leader Robert ... was arrested Sunday at Los Angeles international airport run too appeared in federal court Wednesday where a judge denied bail rose accent to\nOther members of the group were arrested Wednesday morning in a forest remains at large federal complaint alleges they took actions what they intend to incite organized promote encourage participate in or carry on\nRiots last year in Charlottesville and then the California\nCities of Huntington Beach Berkeley and San Bernardino case seniors reporting\nResidents of the commonwealth of the northern Mariano islands right saying for months without electricity or running water the aftermath of on the strongest orange and it I think part of the U.S this year more than they used stories that town hall dot com\n\n\n\n\n\n\n\n[noise]\nC. H. A. P. Jack Jack Peterson and the emily's domain litigation Bruce\nGovernment's coming for your land chef chef so you just said and the image domain litigation Bruce ... and you get use that money you deserve blind coming for your land read I tell you for your land and sea aid agencies jak\nJak Peterson Sandy imminent domain litigation [noise] all seven five Seventy four four six Ninety nine Ninety eight\nAbusing the expression on the John Frederick Shepherd was the host of gas in Congress and are not necessarily those station it's management or other host for advertisers\nTime this is a share of David Clarke of\nFirst policies it's happened again another young woman Molly tidbits a twenty year old college students from Iowa with a bright future ahead of her was brutally murdered and illegal alien reportedly confessed to the murder\nThe American people how many more American\nLife will be long before Congress takes actually to a broken\nSystem make no mistake the breed men and women the border patrol Cheryl is on the front line protect our\nHomeland and keep us see deer and they what they can't bear the burden of ending illegal immigration law Congress must step up to one a border wall and put an end to deadly sanctuary city call your representatives\nAnd senators tell them to bully want the war for ... for both easy [noise]\n[noise]\n\n[laughter]\n[noise]\n\n\n[noise]\nLike a [noise]\nYou for them to decorate the best of luck on your W ... good luck Charlie Chaplin John you're on the yeah\nAll right thank you I haven't ... Johnson is radio network let's let's go to quick word from our sponsor a your calls my narrative on the bombing when you get back there for you know John for eight oh five six or six stay with us\nYou could you couldn't you know what I'm saying [noise]\nI think that's a long term [noise]\nThings aren't you when you didn't blink are together in this little or any other way you want to have been any mind to\nDo anything [noise] I mean some of them is [noise] ... [noise]\nYou know [noise]\nHe told her she and her family spinning one and two million dollars to tune in for ... ... ... is our taxes by ... and there wasn't any Fifteen thousand child tax credit\nGilbert prosecutor which can be easily plea bargain can finally currently like talk radio station\nFor teaching you are independent Tony is Barbara Comstock I'm Barbara Comstock candidate for\nAnd I approve this message pay for my concept for Congress [noise]\n\n\nLove this child more love bringing\nTogether Virginia's movers and shakers badly policymakers if the John Frederick share your life has been fending for about a lot you can read it\nAll going any time at the John Frederick showed dot com [noise]\nAren't you back on the junk circus radio network truck the truth across America great to have you with us no job or showdown since I have your commander\nOf common sense and\nWhat a nice call from I don't know what a way to start off the day we were outside we're up of course last night very very late I think I got back to my hotel here enrichment after midnight trying to get everything set up and so far it's working you can check us out go to W. J. F. N. dot com I'm Sorry W J FM radio\nDot com and you've got the stream there which is streaming my show where should be hopefully somebody should check it out go to W. J. F. at radio without copy sure that I'm streaming there and of course my ap stays the same everything else stays the same\nAnd that but there's a lot of work and this is the first radio station I've actually uh purchased one uh\nI run my show and I've been a general manager but it's a little bit different when you have to put all the pieces together I got a great team that we put together and they just did a marvelous job and how we got this I gather so fast and here we are and we're going to continue to grow so in fact your argument for that\nViolence and the political arena is now beyond the pale and we've looked the other way when it's been changed on by the left and such a\nYou know I remember when Steve skill least was gunned down and almost assassinated along with the shooting at the baseball field over a year ago remember\nHorrible that was somebody gets a gun to just starts shooting a mentor to practice field and when women were children there that had to dive under the rug out I mean where where where where\nWere the only thing I remember what that is turning McAuliffe our governor who I was a supporter of\nPromise of Puerto of him as governor goes out to the northern Virginia fielding calls for gun control I mean where was that where we are I mean think about it think think about the reaction to these pipe bombs which is horrible\nAnd thank God they didn't go off and no one was hurt\nBut you've got people sending around\nOn Twitter calling these mega Bob's\nI mean what is going on in this country can't we just debate and have conversations we can fight and argue but then you go out and vote and it is what it is [noise]\nThis idea that that we can simply you know sending a setting anthrax white powder and said that the gist of the violence of and ... and\nYou know you go to a Trump rally you take your life in your hands\nSo look here's the good news none of these problems went off we're going to get evidence the FBI says in the next several days they're going to pieces together no one is ... that's the that's the good news here's the bad news somebody actually did this\nAnd the Democrats are now taking advantage of it in order to help them when in the midterms which is just ... they are now the ... they are the party party of mobs caravans\nRepublicans are the party of jobs in the country\nNow they're trying to take advantage of this to the Republicans ever tried to take advantage of any of the Republican being shot at that baseball fields all they did was pray for their victims didn't go on TV blaming Democrats so right away\nYou've got democratic operatives out there on CNN and other networks trying to leverage this event this potential\nAssassination this violence for their own political gain\nNow if you listen to me right now you tell me that's not saying this is a sick party the Democrats are sick the people that do this are nuts\nMan this is just a horrible event [noise] and I'm pretty convinced that ah\nIt was the same person because all the FBI is saying is they're all the same so this is the same person or persons person or persons probably per se\nBut then then there's the question of you know who did it and what was the motivation and the joy get the facts and we don't know we don't know\nWho did this we don't know if this was politically motivated by a Trump supporter we don't know if this was a democratic supporter try to influence the election\nIn the back of your belly and wait we have no idea we didn't know what the facts are\nWas the same thing that I told you about Saudi Arabia and showed me killing and the president to the right way he his position evolved as the fax came it let's let the facts come in but I'm\nI'm not even going to speculate up till we get more information more information you can text me seven five seven six nine to Seventeen Jennifer from Norfolk says if in fact the pipe bombs or for from a real anti\nDemocrat moon I hundred percent condemn them if we find out they were sent by a democratic operative to make Republicans look bad I Will not be the least bit surprised as a sad state of affairs\nFor the fake news and the Marlboro Democrats when I suspect everything that happens to them to be some sort of political move on their part\nHere's what Jennifer ... same thing I I don't know the facts you know the facts but here's what she's she's saying if it was a democratic operative that did this and the bombs were never intended to go off and it was to influence the midterms she's saying I wouldn't be surprised\nThat Jennifer from Norfolk I Would be there and probably you probably would anybody\nBecause of the ... of this election and I mean the Democrats President Trump in his right unless I started off by saying this has got to stop my pet set out a great tweets saying it's unacceptable where it came from doesn't matter this has to stop\nWe all have to knock it off and below sea at Schumer condemned the president\nI mean these people what power so bad it's almost there Quaid I got to go but I'll be right back John Frederick to radio network W. J. offend one hundred twenty five ... usually Richmond stay with us\n[noise]\nThe the [noise] me [noise] [noise] [noise]\nTime seven five seven six nine to Seventeen ten eight today marks the day of our launch our new\nRadio station and one of what we think it's got to be many that come W. J. F.\nW. J. F. N. one hundred twenty five in good fun you can check it out on the line that's right check it out on the line W. J. F. at radio dot com there say listen why button air if you're not an area you can also of course get me on\nLap and everything else W. J. F. than radio one point five FM goose when Richmond western right go short pop if you're listening to right now on AMA twenty and you're in the western part of Richmond then W. J. F. at one point five\nFM might be a better option you can also get me a Ninety two point seven FM so we got a lot\nAs we build our presence throughout central Virginia we are going to go from there does have you on Hampton Roads that are disappointed that we lost our affiliates air well\nOutta thanks for being with us really appreciate you have those calls coming in for a though John ... for eight out five six for six don't be shy about it today is one of the forecasts broad you by dominion energy dominion fighting for you for lower rates all the time were information dominion energy dot com\nThey got to go twenty twenty five fifty percent of all the energy they deliver in the commonwealth\nFrom her noble energy sources each fish it renewable energy sources power\nComing from solar and wind Fifteen Percent twenty twenty five and the Washington DC greater metropolitan area today I put the six thirty nine sunny skies my family be there this week and my son has his last baseball tournament up that uh Maryland\nUniversity of Maryland so there'll be coming up to a Washington DC on friday afternoon and that's going to be it baseball season will shut down and then we'll go to basketball [laughter] so that's it for the high school baseball fall season I Will and on Sunday whenever does\nIn Hampton Roads high up fifty nine low forty two very sunny skies I Love the sun is shining Chinese on us today no doubt enrich Vegas high up fifty seven thirty second also a very beautiful sunny day in ... Virginia home a bill Stanley bill remembered today\nI W J offend one hundred twenty five ... FM you go to W. J. FM radio dot com\nDon't forget the fighting Joe Morsi show coming up fighting Joe ... show tend to noon live here in Richmond now you can't get Joe on the John ... these are separate companies or\nYou want to hear the joke Morsi showing your outside of the listening area when\nHer point five FM in Richmond bill you got to go to W. J. F. in radio dot com it's not on my at W. J. F. and radio dot com ten am Joe Morsi fighting Joe Show don't miss that\nHire fifty six below thirty two very sunny skies great to have you with us eight eight eight for eight oh John eight eight eight for eight oh five six\nA potential act here of a domestic terror I really want to get your thoughts on this what you make of it where do you think it came from\nWhen you do a little speculating today but uh the FBI all over the years they're saying and various news reports that they're going to get the bottom of it and the president did the same thing Washington's a little bit on the edge as\nThe FBI now investigate a string of attempted male bombings address to top Democrats are\nWhich is very odd because here's who they pick the bomb a Clinton holder John Brennan Soros Maxine Waters and Debbie Wasserman Schultz ... it's just it's just very odd to me that like half of these people aren't even aren't even involved\nNow I just find that odd I just find that out just to the whole thing is a odd to me [noise] let me leave it at that\nIt's just odd happening or eleven days before the midterms the FBI now investigating the potentially destructive to devices because we don't know if they were actually set to go off either we have pictures of them but um none of the devices thank\nGod discovered this week exploded and no one was harmed so thank the lord for that these six inch long package Bob's each had a battery\nContaining powering\nBroken glass were constructed from a PVC pipe and covered with black tape [noise] this is what we learned from a law enforcement official who saw the bombs at the X ray images of it and told the Associated Press\nThe white power in the package set the CNN was tested and determined to be basically baby powder\nSo the white powder was harmless they um it's not really determined right\nNow if these bombs could have actually cut off a\nThe FBI intercepted the packages for Obama Clinton in ... before they were received\nNow anybody that does one of these would be odd that they didn't know that you can't get to bomb or Clinton or Trump or anybody of this nature because\nThey have Secret Service protection and\nEverything is screen before it ever reaches them so that seems to me [noise]\nThe package for a recall there was forwarded to return address where the offices of Debbie Wasserman Schultz in Florida [noise] package for bread and\nThat was sent the CNN resulted in the evacuation of the cable John's headquarters in New York City leading to the surreal scene of actors and journalists reporting on the breaking news event from the street\n[noise]\nThe FBI says it's possible that other packages were male to other locations that are still in the mail string the makeshift bombs are going undergoing test inspection at the FBI\n[noise] that the trail of clues are eventually going to lead to the would be bomber\nAnd of course the timing it that's not good now speaking in the East Room yesterday President Trump condemned the axe or threats or political violence and called for unity as his audience to two apart\n[noise] he said that in these times we have to unify we have to come together and send one very clear very strong unmistakable message that\nActs of threats of political violence of any kind have no place in the United states of America that coming from President Trump\n\nThat was immediately condemned by Nancy Pelosi and Chuck Schumer who then turned around and I said it was an insufficient response [noise] let me read it again in these times we have to unify of course a Hillary Clinton said you can't unify until the Democrats win\nThat's what you said it would you go but\nThe Democrats thought that the president's message of unification and coming together to send a very clear strong unmistakable message that acts or threats or political violence of any kind of no place in the in the United states obviously they are\n... statement it said it was insufficient [noise] and then he was part of the problem\n\nYou had another democratic operative coming on TV last evening who said that uh all the people targeted by the pipe bomber in the mail he said you could uh basically get the less by following the president's Twitter feed\n\nSee this is the Democrats now trying to take advantage of what could have been a horrible situation\nOr maybe not\nBecause then to determine as bombs could actually have gone off we don't know like the power sent to CNN was baby powder so until we actually know that the bombs had the potential to go off and they could have harm someone [noise] courts out\nWe don't know we don't know anything\nKnows what we know so let's wait until the FBI if they're being honest about it I mean we were now questioning the FBI\nBut if they're being honest about it let's wait until they give them their reports the Washington Post free ports that Republican leaders were very quick to condemn package bombs are threats to politicians\nOfficial or news media [noise] later on a campaign rally last night in Wisconsin [noise] I'm Sorry at a campaign\nRally in uh Wisconsin President Trump's message of common purpose shifted to criticism of this\nPublic spaces seems like a pretty reasonable statement to me\n[noise] and that the press has a responsibility to set a civil town and stop the endless hostilities in constant negative and fake attacks and fake stories\nPretty cool\n[noise]\nWorking in this hour town halls are job I'm rich [noise] as the FBI investigates pipe bomb\nSent you a series of prominent Democrats this morning the my pd investigating another suspicious package this one found in the truck back your neighborhood of lower Manhattan and in light of all of this President Trump is urging unity across political ally\nAny acts or threats of political violence\nItself [noise]\nNowadays you can succeed\nThat tolerate violence or the threat of violence as a matter of political intimidation co workers your or control we all know that\nThe president pledging to find those responsible and bring them to justice hopefully very quickly at least seven pipe bombs have been sent none of them exploded they\nWere manila envelopes with six stamps at a bubble wrap deteriorate containing pipe bombs full of glass shards in powder none actually detonated the FBI study each in a lab in Virginia\nThat's correspondence are going to be gone at the outset of the flu season the FDA approving the first new type of food drug in two decades\nAgo is appeal that can reduce the severity of flu symptoms and short them in one does it's developed by the Roche group which is promoting an F working just as well as older blue treatment Tamiflu that is taken twice daily for five days\nOr responded Donahue says each year we're typically kills about twelve thousand to fifty six thousand American up to six hundred fifty thousand people worldwide\nThe red socks they can get you nothing read in the world series reading the Dodgers for two last night Wall Street futures wanting to a higher open later this morning following yesterday's stock market debacle right now Dow futures up one hundred twelve point\nThat's our future is better by Ninety to ... that's in the future is up\nBut he wasn't points more on these stories that town hall dot com\nThinking bowling is not an actor but a real life story from Trinidad management you\nProbably been about ten years ago I had quite a few credit card the interest on the car is really high I was making the minimum payments but they're like and it was just getting to be too much so I called trinity\nIf you're in depth and unique hill called trinity one eight hundred nine nine oh six nine seven six to talk to a certified counselor\nIn that with me and they were able to get all of my credit card in one lower painting\nTrinity will consolidate join account Cindy one easy to manage monthly payment put a stop to late season over limit charges reduced Sharon\nHelped me learn how to manage my money now you know we have a house and were given a lot better if you're just you're down coal trinity one eight hundred nine nine six nine seven six lane is highly and I am debt free for keeps one eight hundred nine nine oh sixty nine Seventy six\n\nIsrael's important in the middle east and yet the tales from the media lines Michael streets and\nAccording to prime minister Benjamin Netanyahu if it weren't for the Israeli military presence Palestinian Authority president Mahmoud Abbas would have been assassinated by terrorists too long ago tightening of Boston survival to his demand for an indefinite Israeli military presence in the west bank and send you out until the conference of American Jewish federations that without\nThe presence of Israeli troops to Palestinian leader would not have survived until now without elaborating\nIt's an Yahoo referred to work toward it plot uncovered a couple of years ago in which you're forced to one hundred Hamas fighters set out to kill a boss the prime minister Senate rainy and back in ... when over on the west bank and say did when Israel unilaterally withdrew from the Gaza Strip I'm Michael ... town hall News Jerusalem\nBreaking news and analysis at the meeting your line dot org and the town hall knocked\nOr changes in store for the company formerly donors Dunkin donut\nFirst sunk and drop the doughnuts from its name now is having a special drinks to its menu Duncan says most of it's Ninety two hundred US stores will offer locked age gap between those are the other espresso based hot and cold drinks by the holiday season is all part of an effort by the cancer Massachusetts based chain to increase beverage sales\nAlready sixty percent of its revenue and compete more directly with Starbucks bark new reporting\nTurkey has been focusing on a well in the garden of Saudi Arabia is ... ... a lot of its investigation into the killing of columnist you have to show me his body is still missing there are conflicting reports as to whether investigators of actually search the well the case has you know political implications because of the\nSaudi Turkish rivalry in the Mid East as well as us alliance with both\nCountries more on these stories that town hall dot com and\nMercury really now what about liberal Democrats Armageddon spanberger and her policies well we know she never underneath the tax cuts that has helped in Virginia families we know spanberger support sanctuary cities in Virginia and then she gets offended that binary gang Thirteen Reno liberal healthcare plan\nWent bankrupt Medicare and to be no answer thirty two trillion dollar spending increase something\nLike ... she went socialized medicine and that's what the government in charge of your house ... instead of you know that spanberger would be a rock solid vote to make Nancy Pelosi the speaker of the house [noise] Angelino she'd vote for impeachment of president [noise] liberal Democrats Abigail Spanberger\nParasite sanctuary cities bankrupt ...\nRubber ... see what else do we need to now\nRunning for Congress and I approve this message\n[noise]\nPardon me this how many times have you been in the conversation and he's someone said that they used to be Catholic it happened to me more often than I'd like to admit when I hear the state and I want to have someone could ever leave the church founded by Jesus Christ did they lead to go to another Christian denomination\nIt may have been or music or better fellowship [noise] what did they joined a congregation has better preaching did they leave because this scandal in the church and find a place of worship rent brand obscene or think about this new church or the has to be a print to Jesus Christ\nAny new other non NATO or they ... they had better music better fellowship and better preaching\nBut they do not have the wheel in the [noise] most intimate experience with the the [noise] never leave intimacy\nAlways teases me Kelly in this political moment it's brought he kept the pension industry [noise]\nAm your Godzilla other truth great to have you with me eleven days before the germs the most important measure of elections in the streets of very public a number of\nOther potential pipe bomb as you know now it's all the news mailed yesterday to a number\nHigh profile prominent Democrats the FBI looking into this I encourage everybody not jump to conclusions or a lot of speculation well you do something oh let's let the facts coming after I got to figure\nA all that we have heard is that they've got a tremendous amount of clues are trying to get it down\nAnd many of the spokespeople and for people familiar with the FBI investigation in the U.S over these five bombs were saying that it's got to be a sooner rather\nThat they ah they have this figure it out so we're looking forward to that and we're looking for the information that's got to come\nBack great to have you heard the John triggers radio network truck the truth across America and want\nThank all of our listeners also since the first day of our new radio station W. J. F. N. whatever twenty five ... FM\nIn West Richmond and goose one thanks for being with us today Joe Morris either Joe fighting Joe ... show he's a Democrat the fighting Joe ... show but\nLawyer now is not a lawyer in right now for a lot of reasons but my longtime\nLawyer great guy and he has his own show that's only talking about what's on your ten am soon as I get off fighting Joe comes I'm going to be a lot of fun like joke show so you want us to stay with Dennis Springer after that Michael Savage three o'clock WG up in one place I\nReal news real talk real time twenty four seven a lot of fun great to have you know a let's get to the phone lines in let's get to Frank in Norfolk Frank you're on the\nFor a no John J. wage and they ... five six for six go ahead right\nUm a developing story and police bomb squad just today removed a suspicious package from\nBuilding associated with actor Robert De Niro so this thing is now getting worse and again we don't know what the deal is so just hang in\nThere with us as we um as as we attempt to uh to follow the news to the the best that we can\nLet's go to a quick word from our sponsors drunk drivers radio network I'll be right\nBack with your calls for a though John an age for you know five six for sex\nDid you know that homeowners now control fourteen point four trillion dollars in ... home equity Hi I'm Mark Livingston with cornerstone first financial and this rise in appreciation has led to record\nNumbers of people using their homes and ATMs with the elimination of some he locks be tax deductible credit card debt on the rise in interest rate increases looming now\nIs the time to act if you're looking to fix\nYour house up eliminate P. M. I. or take cash out for any reason even if you're working with\nAnother company uses of sounding board to make sure you're getting the best deal for you and your family whether a purchase or refinance and ask about our hometown heroes program we guarantee we'll meet or beat any competitor on this very station or we'll pay your mortgage for an entire year some restrictions apply\nCall now at eight six six six to five twelve Twenty one that's eight six six six to five twelve Twenty one or cornerstone first dot com\nRobert Smith in my view I make the commute home to the first district every now I Know what's at stake for service members federal employees and families trying to make ends meet on fighting to stop crisis budget and the bill that says if Congress doesn't pass the budget on time\nBill for the future and that means stronger for [noise]\nI'm Ron with I approve this message I never forget I work for you\nKnow [noise]\n\nIt's the perfect way to start you're more than a find morning or I'll shoot you John Frederick show your home for the hottest topics the biggest name oh now you're just being a crazy thoughtful commentary analysis head listener interaction [noise]\n\nOther than the Joshua trees radio network your Godzilla the truth that America\nOur lessons for our brand new station are stationed W. J. F. N. one hundred and twenty five FM west Richmond goats thanks for being with us all news all the time\nReal talk real news real people and we're just went on the air today at six AM so good to have you with us in a short pop west Richmond western right go and all the ... area and ... county great to have you with us\nAnd especially in the short pop in and got a lot of listeners that this and that we can't really get the signal there now you do one hundred twenty five an\nF ... W. J. F. in our new radio station that we just bought a couple of weeks ago so we're going to expand from their good to have you with us as always right here you can always get us on the line\nWGM than radio dot com and of course to get the John Frederick shall we do the same thing you always do you go to my website Jon Stewart who's radio dot com\nHit listen live or download rap or go to any station I monitor and get me so you've got to go get a lot of options options are good great to\nAnd we continue to grow because of your listening supported thank you very much Saudi Arabia is a public prosecutor said yes said today that your mouth to show he was killed in a planned operation or\nMurder this is now version number\nOf the Saudi story version number eight [noise] tomorrow I guess the golfer biggest doesn't this is like ... this is like Keystone Cops it really is ridiculous and here's the bottom line crown\nPrince Mohammed bin solving and I said this on out here for two days here's the bottom line he's thirty three years old and he's incompetent\nIt's just a topic that I mean it's simple you don't have\nIt ever be people that just a cop and the guy the guy everything touches church the crap guys a disaster and his father needs to own up to it and put somebody else on that [noise] anyway\nNow they say it was a premeditated murder this is the latest reversal from the Saudis who have changed a story not types and\nFirst they said he left the conflict and they said he went out the back door then they said the dog ate the camera filmed and they said uh\nThe cameras didn't work\nThey had a double but he had the wrong shoes on so we didn't have the right shoes off and they have to change that story then they said he was at a fist fight then he said they choked to death\nOn a chicken bone\nAnd it went out from there\nThe foreign ministry did not say what led the Saudi prosecutor to draw that conclusion only than it was based on information shared by Turkish investigators working with Saudis in Turkey according to a statement the Saturday prosecutor will continue its investigation based on new information\nSo story number eight [noise] and the message for President Trump and Jared Kushner is nice try not a bad plan where the Saudis not a not a bad plan like the factor investing money [noise] but ah\nHere's a daily you Jared put his faith and eight thirty three year old air to the throne who is basically incompetent and so they could just have to deal with it\nYou got to deal with it I mean that you know you guys did it and\nNow the guy that your talent around with is the top of that and also looks like he planned a premeditated murder in an embassy not exactly the kind of guy\nYou want to bank your Middle Eastern strategy on if you were to ask me but that's just me John traverse radio network\nHey this message brought you buy the job creators network folks you know when I was an off year elections are about one thing showing up\nThis election is the most important in decades the liberals in the left doing everything they can so you don't you know there's a lot of things on the ballot besides your candidate your tax savings bank on about\nThe American economy bang on the ballot this great American economic renaissance we're having it's phenomenal\nHey look we just put a radio station why are we doing that economy is booming advertising is up blister shippers up so you invest your money Doug that's on the ballot your jobs on the ballot your kids jobs on\nBallot your basement your man gave you know the one that your kids lived in that got out of it because they got a job\nAnd then you put the big screen TV down there and really get that and they the billions table that's going that's on the on the ballot\nYour wages your promotion your ways that's on the ballot to Michael Coleman he wants to raise Mike your raise it on the ballot sorry small business owners your tax cuts like me that's on the ballot\nAnd here's the biggest issue on the ballot who's in charge of your future politician said bureaucrats in Washington DC or you know if you want to preserve the victories in the past two years I'm urging you get involved in stove ever going to tax cuts work dot com that's tax cuts work dot com\nAnd don't make it easy for you get involved\nNow I don't want to send emails are okay said textile ever\nOkay that cannot yours I got bad foot okay you can take your neighbor to the polls oh I don't drive okay make the coffee there something you can do go to tax cuts work dot com tax cuts worked out constantly have to do because the only way you lose interest are thinking\nIs if you don't show up they're going to show up tax cuts work dot com do your part this message pays for unauthorized\nBy tax cuts work dot com on the John Frederick radio network trucking the truth your calls when we get back there\nFor eight of John eight eight eight four five six four six eight eight for eight out five six for six or seven five seven six nine to Seventeen ten Josh Rogers radio network welcome our listeners that or do\nRadio station W. J. F. one hundred and twenty five FM what's Richmond go showing real talk real news [noise] real time see\n\nYou're listening to Shaun French or share\nOn the brink radio stations across Virginia and online\nAny time at the Johns Frederick shows dot com [noise]\n\nRejected by\nThe media will respond\nThe end is when\n\n[noise]\nAm truck in the truth across America eleven days later the bedrooms\nYour Godzilla or the truce your commander\nCommon sense ain't no doubt no Jim Risch All right here don't forget just launched a new radio station that we bought today it's really cool W. J.\nGo in Richmond many many many more to come we hope and for our newest here real talk real people real real time what number twenty five W. J. F. radio you can also get a sideline\nAnd it can be hurt on whatever one by\nAnd the west Richmond area\nJoe ... show I'm so excited he'll be here today first ever\nFighting Joe ... show judge Joe Morris combination in the morning he'll be here starting at ... tend to do after that Dennis Prager\nWill be with us then Michael Savage and Savage Nation three to six Larry Elder six to nine Joe Walsh nine and midnight and then\nMain yeah best out from that to one\nFrom Dallas what am I to my favorite guys are being with us from one sixth and then we start all over again so it's ... it's going to be a lot of fun job Morsi following me ten AM don't miss it have fun it's gonna be a lot of great so all got [noise] uh\nLet's go to the let's go to the phone lines well let's not go on the phone lines because we don't have any ... or say ... we did a couple of them\nDropped off sorry for the weight names for eight oh John ... for you know five six six eight ... ... for eight oh five six or six with this caravan is coming and I'm kind of unbelievable this is a message from America First policies over seven over now seven thousand illegal immigrants\nAre marching from Central America to a border right now and more are joining the march every day they're determined to crash the border and if they get through millions more are coming\nThat's why we need to build a long way to build a now if we don't border you don't have\nNo border no country Congress is supposed to talk for months but they're about to take up the funding for the wall liberals want to abolish ice when everybody end including criminals have sanctuary cities big business wants cheap labor\nEveryone into you know why this is the unholy alliance of all time and we can't let them have their way Congress needs to hear from us and no one's certain terms court Congress tell them build the wall now too old to two to four thirty one Twenty one or two two to four thirty one Twenty one this message paid for an authorized\nBy America First policies incorporated in America\nFirst policies and corporate and an eight eight for a though John ... for eight out five six for six kids if you clips here that I Want to run if I may Mike\nAnd let's start with Hillary Clinton thanking the secret service for their protection after suspicious packages targeting her for like a bomb and CNN were intercepted ... Wednesday now it seems like one might have gone to a Robert De Niro that's unconfirmed but here's Clinton now\nThis is a week after Clinton said that an civility in the face of the Trump was okay because you couldn't get civil until you won back the house or Senate and took control the government [noise] now she changes the\nTone a little bit\nNow she changes I don't know I find this whole thing of it\nYou know we're not talking about the caravan\nWithout talking about jobs the economy or talking about pipe Bob's going the Democrats\n[noise] I don't\nKnow it's an awfully odd timing offering a suspicious that's all I'm going to say very odd don't you find this on or is it just made a name\nFor a little John painted eighty four five six words like who would target Robert Deniro like what kind of a deranged person would do this\nIt's almost like\nUm it's a two slick like let's find all of the people that blast Trump and send them a pipe bomb which we don't know if it's can you offer not uh\nIt just it seems very strange to me that's all I'm very suspicious about this and those have you been listening to me for ten years now that\nI don't do conspiracy at all ever I say wait for the facts to come out that's it I don't do it but this just doesn't add up maybe I'm wrong\nAnd maybe it's some deranged wacko and I hope the FBI for whoever it is going to jail\nRight left otherwise [noise] I just find this odd [noise]\nAll right I'm going to get to the ... because she changed her tune Jennifer from Norfolk again says I just heard your line of free radio show I'm really excited\nI used to live in Los Angeles and listen to ... elder other local stations their love love love this lineup congratulations again I'm looking forward to in J. F. ... radio network across the country well\nI'm not sure it's going to be across the country but it's certainly\nGoing to be crossed Virginia that I can guarantee you that I can get wrote to me that they say ... or\n... let's go to cut one the hill Hillary Clinton a week ago saying well it's okay to be a civil in the face of truck because we have Trump the socks and until the Democrats take over\nIt's justified to be on several was spit on people and and uh\nHave been restaurants to chase them down subway hall that's okay\nNow see changes your tune a little bit caught one Hillary Clinton\n[noise] thank\n[noise] um [noise]\nI I began a I Want to say Eighteen worrying about the news this morning\nA suspicious package and being sent to bury a public figure and a news organization many of you and others across our country have asked after me and my family and I'm very grateful for that\nFor service [noise] uh who intercepted uh the package\nAddress to last long before it made its way to our home every day we are grateful for their service and commitment and obviously are never never more than today [noise]\nBut it is a troubling time isn't it [noise] and at the time of deep divisions [noise] and we have to do everything we can to bring our country together [noise]\n\n[noise] that's after she said a civil unrest in the face of a boy's okay [noise] that'd be just to get her facts right\nMy comments vice president\nPence says the crude type ... sense of CNN Clinton a former President Obama and others were cowardly acts and he condemn these pretty ah pretty pretty full throated matter as I say in the business cut to my pets\nFor get started\nFor me and for my fellow Americans but issue I Know is on many of our minds today [noise] getting\nMuch attention [noise] but just received a breathing about the suspicious packages\nThat were sent to the Clintons the Obamas to CNN and others [noise]\nAnd let me be clear\nWe condemn these but tempted acts of violence in the strongest possible terms [noise]\n\nFerry\n[noise] breaking news is our town hold on I'm going to ...\nAnother is suspicious packages\nTurned up this one in New York City they tried back in the neighborhood of lower Manhattan\nThis latest one discovered early this morning was addressed to actor Robert De Niro at a building in lower Manhattan the houses of restaurant owned by the narrow\nAt Jews Tony Awards deniro went off script and openly criticized the president Mr Trump responded with a tweet calling him a very low IQ individual this now makes nine devices sent a prominent Democrats and to CNN the FBI released a statement this morning saying the investigation is up the highest priority\nAnd asking anyone with information to contact the agents\nOr responded volley Hines says a package found this morning has been friends for the joy that Y. P. D. facility in the Bronx for examination and disposal and in light of these episodes President Trump only on all sides to tone down the political rhetoric and so it's a media has a role to play to\nThe president was unusually subdue during a rally in Wisconsin and wanted you to know when\nYou see how nice I mean this is like have\nYou ever seen the blasting political violence as an American and called for all sides to come together in peace and harmony saying the media has a role\nTo\nStop the endless constant constant negative and oftentimes false attacks and stores have to do saga\nRemain Donny Washington Saudi Arabia says countries powerful crown prince was attended the first meeting of activity ended restructuring they came here in the intelligence services and the aftermath of the killing of your mouth to show after losing more than six hundred points yesterday doubt could be poised for a rebound this morning ... futures are higher\nAlong with NASDAQ and that's when the futures\nNow futures up Ninety six points and I said actors better by eighty five and that's when the futures up Nineteen parts\nOf the stories that town hall dot com\n\nFollowing is not an actor but a real life story from trinity debt management\nMy story begins grants that a lot of\nFor eternity I Can't call if you're in depth and you need him called trinity one eight hundred nine nine of those six nine seven six when I first called I was a little embarrassed and kind of a shame and I look at the numbers and I saw how quickly\nThat astronomical cat that was in my life with cattle ranch community will consolidate doing accounts to do one easy to manage monthly payment reduce your interest and possibly improve your credit score you'll save thousands what I Would tell people please pick up the phone and call train and he just let\nThem put together a program and see how affordable and easy events to pay off your debt\nCalled trinity one eight hundred nine nine oh six nine seven six that's one eight hundred nine nine oh sixty nine Seventy six\nA former Malaysian prime minister has appeared in court pleading not guilty to corruption charges involving more than one and a half billion\nMany layers of the one empty pie financial scandal now finding a set of challenges against former prime minister Nazi Brian track it's an edgy appeared it's cool to in quantum ... with the former secretary general of the treasury\nWho was also championed have won MVP to his takes charges of criminal breach of trust relating to around one and a half billion dollars of government funds which were allegedly divested to pay off some of one ... debt\nAnd that's the BBC's Jonathan Head you're running a fish will say on Saudi led coalition airstrike hit a fruit and vegetable market killing Nineteen civilians children among them strike comes amid mounting fears of a fresh coalition of salt breaking news man that Alice ... a town hall dot com\n\nBritain's information commissioner office setting Facebook where the maximum possible fine six hundred and forty four thousand dollars for its behavior and the Cambridge Analytica got\nThe icy our investigation found that between two towns in his cousin to to talking and fourteen states the proof that the parents no information of use it on Saturday by giving out developing access to the information without informed consent\nTo sign with the maximum allowed under the no at the time to reach kind how this scandal taking place after he needed a data protection rules went into effect in Mount would have been far higher than it shocked me and I'm\nDavid Price finish six innings three hit a ball and major league are beyond leader J. D. Martina broken fifth inning time or another to out rally leading the Boston Red Sox according to victory over the Los Angeles Dodgers\nFor like two to nothing lead in the world series or on the story it's a town hall nonstop\n\nTide folks judge sugars you're if you're like me you may see among the millions of Americans who feel\nUncertain scene when it comes to their health care we're happy to inform you that there is a solution and that's a religion is liberty health share liberty health share is a community of like minded people that work together to pay for their medical costs there are no network so you get to choose your doctor at your hospital liberty hill share allows you could you can easily decide how\nAnd where you will access your healthcare it\nCould be the best price of gold moral an economical choice for you and your family starting at a hundred and seven dollars a month for single up to four forty nine a month for a family that's mom dad and all the kids and this is the way health care should be and it's been great for me and my\nFamily for more information going fine five five eighty five four to three seven four visited liberty how share dot org dot celebrity held share dot org and regain control of your health care costs members is January two thousand Fifteen liberty hill share has been a godsend for our family together we're changing health care for good\nDid you do that homeowners now control fourteen point four trillion dollars in ... home equity Hi I'm Mark ... with cornerstone first financial and this rise in appreciation has led to record\nNumbers of people using their homes as ATMs with the elimination of some he likes being tax deductible credit card debt on the rise in interest rate increases now\nIs the time to act if you're looking to fix your ...\nWith another company users are sounding board to make sure you're getting the best deal for you and your family whether a purchase refinance and ask\nAbout our hometown heroes program we guarantee we'll meet or beat any competitor on this very station or off your mortgage for an entire year some restrictions apply\nCall now at eight six six six to five twelve Twenty one eight six six six to five twelve Twenty one or cornerstone first dot com\n\nWere gathered together today to address America's drug in an opioid crisis in a crisis it is [noise] which now planes Seventy thousand lives a year one year ago when he addressed the nation in this very room and declare the opioid crisis a National Public health\nEmergency today we are here to update the American people on the historic action we have taken and to sign a landmark legislation to defeat\nThe opioid epidemic together we're going to end this gorgeous drug addiction in America we're going to end it or we're going to at least make an extremely\nBig dent in this terrible terrible problems\nOver the past twenty month our department of Justice Department of health and Human Services fraud strikes targeted a combined three point three billion dollars in waste fraud and abuse related to the unlawful distribution of opioid that's by far\nThe most ever put together we will defeat this epidemic say true epidemic as one people one family and one magnificent nation under God\n\nYou're on the judge herders radio network truck mushrooms across America great\nOnly eleven days to the mid term I Want to welcome all of our listeners I Am your guts of the truth in America\nTruck the truth\nTalk radio station in West Richman W. J. F. N. W. J. F. and one hundred twenty five to ... yes it is our station we have a great\nUp I'm On six to ten than after me\nCould not be more fundamentally a predator\nEvery single major public policy including health care taxes in our theory economic downturn in the country and people need to get out and understand this is a big choice election [noise]\nWe got to get out and vote and you got to work right there's there's two things you have to vote and you have to work because you got eleven days left and the momentum is on the side right\nNow of Trump and the Republicans gaps are closing you know we were talking an awful lot of the other day Elaine and\nNormally I've been covering this a long time and here's what happens during every important evil lecture and I went through in two thousand sixteen and beyond that and other things that I was involved in but here's what normally happens the Democrats\nAn absolute last on early voting they've perfected it they have bigger\nHave more early enthusiastic people they get their people out and they do this major push in early voting absentee voting and so when you get the first results of the early voting that comes and no matter where you are what what state Virginia Florida Nevada it doesn't matter\nThe Democratic precincts from way up and the Republicans are flat or doubt run it and it happens\nEvery cycle exceptionally to cycle all of a sudden out as a blue from nowhere absentee ballots and early voting is up\nBy enormous numbers in Republican suburbs and Republican precinct strongholds like it's never been seen before\nAnd it came nobody projected it nobody saw it it's just showing up why\nYou know my daughter at the University of Florida is he the freshmen and she um interpersonal actually getting in and she requested her and then the ballot and cover the yesterday and told me hey I got my answer them could if those and that's an Eighteen year old\nIn in in solving yourself in the ... that that people are said it again I go out there for my\nPeople on the ground and the enthusiasm is high and people do understand like steak and so I'm not the highest\nThat we're seeing a difference in the early voting on it every single one of these stop me charged the people there with it with the past but more importantly to go out and talk to five people\nConcerned for his liberal hook them around her farm the colonel directly related critical how her murder they probably will currently own mystery shopping [noise] put their policies were going to go backwards [noise]\nYou're on the John feathers radio network trust the truth across America I'm Elaine Parker Olin as they can be achieved communications officer for the job creators network she has gone\nThe country on a tax cut plus chore for months talking to small business owners or just regular people trying to figure out what is going on there is definitely a red undertow going on here Elaine\nYou've talked to a lot of people cat Republicans is their chance that Republicans could actually hold the house or do you think\nYou know I'm pretty optimistic and talking directly to their [noise]\nPeople who showed up at the rally that we help [noise] I I'm not going to think that we can that people are feeling um [noise] I'm up in it [laughter] [noise]\n\nAnd what were the other thing that we're saying is when you look at the generic ballot numbers that they favor the Democrats but there's a lot of the polls out there the other thing\nThat we're seeing internally is in the fifty or so races that are going to determine who controls the house remember the Democrats really have to pick up twenty six seats Elaine not twenty three\nTwenty six because there's three seats now that the Democrats hold that um my sources are telling me are leaning very strongly ... Republican those are going to flipped so the Democrats are going to have to pick up twenty six seats what I've heard\nIs the twenty six seats they need 'em that are toss ups that all of them\nAre now trending towards Republican now in the last ... forty eight hours\nPart of it is you know people are looking at the economy and they're saying do we really want to go backwards do we really want to go back to the bottom of regimes that we really want to go back\nTo getting rid of the tax cuts a half a percent growth savings are down nobody has any money family comes home father comes over mom and dad come home on a Friday nights or they can't take their family to a movie they don't have\nAny money there is fear of their jobs\nThe other thing is Elaine that you have to look at is not only our jobs up a an unemployment is at the lowest it's been since Nineteen sixty nine you don't want to do in Nineteen sixty nine wasn't land that was one of the New York miracle Mets won the world series Nineteen sixty nine\nMean I was a kid back then I was uh twelve years old or something that's so far but the number of people Elaine that have entered the job market that had basically given up\nTwo thousand and eight recession dropped out of the job market are now coming back and let me give me some other ... the number\nOf former felons that have been released out of prison getting jobs is at a record high you know how great that is for people that made a mistake and now they're getting a second chance let me give\nYou another stacked the hiring of handicapped people in the Trump academy Elaine is up thirty five percent to the handicapped people getting jobs I mean this is an American\nEconomic what Assad's that Trump has done that is it's starting and of course nobody wants to talk about it so how do you get the message analyze\nWhy I like I said I heard every birthday every single stop with Dorie type of information and I'm not the clients that were on that one out [noise] incarceration and be able to find jobs [noise] and that's what we can it can help them\nTo acclimate back in the reality is we haven't found them point one million jobs out there who don't want people to help [noise] so I think it's been getting the training that they don't get the job will keep them out of trouble and keep them from becoming repeat offenders\nThat the current grant program that could ever get a job [noise] nothing now that\nThat happens when you have a job and you're making and you can [noise]\nAnd the thing is that line or a job for a family a raise 'em a better pay rate more take home pay a job\nIs not read and it's not blow in your in your you know what it is is great and so when you get a job you're right and when uh when when men and women feel better about\nTheir ability to support and take care of their family things look up for people and this really this is the jobs economy I mean it is incredible the number of people the other thing the other auto storyline Parker with is a trumpet economy and the resurgence we're having\nIs the number of people now that in in uh in middle income jobs or\nLower to middle income jobs who now feel comfortable in changing jobs because there's a better opportunity for that\nYou know before this when you looked at the numbers nobody would leave a job they already because they were scared like the next job wouldn't be there long walk now that's changing so people that uh\nBetter opportunity at another employer they're now moving to benefit themselves that's another untold story of this economy do you agree\nAbsolutely and and where people do you have this kind of choice [noise] employers are competing for where\nSeeing wages rise and people are making changes in their jobs because there are better opportunities that pain or an been under the tax plan\nIt took it back this year we're going to the um ordinary family be able to keep two thousand dollars more each year out of their earnings and one other thing is that I'm told stories and doesn't get a lot of [noise]\nA lot of press on the [noise] the needle conduction for small business owners are the small business owners partnerships sole proprietorship and that's\nCorporate [noise] they're able to actually feel twenty percent of their fitness training from taxes which is what you were talking about you're a small business as well and they're either reinvest that money and now they have to reinvent getting more into\nInto higher leader because they're competing for scarce labor out there\nFor a job and killing queens do you feel good about their choices out there and and that's a great thing too I mean it just keeps coming in more and more and more and what we keep reminding people out in the wind keep the\nOn our new radio station that we just launched today that we bought in West Richmond and go ... W. J. F. N. W. J. F. at one point five FM west Richmond and go you can hear\nUs in western right go in short pump the mall all of cooks one county and beyond that gets into\nGesture where I Am now become your life from Richmond is all over the fourth district and the seventh district and ah we got a great line up I'm six to ten\nStarting attending up today the fighting Joe ... show now that it's going to be fun you know what I miss that if you're outside of the listening area go to W. J. F. that radio dot com WG FM radio dot\nCom Joe ... show Dennis Prager written noon the Savage Nation three o'clock Larry Elder six to nine nights at midnight Joe Walsh good friend of mine and then midnight to six or hip are friends of Dallas while you're asleep red eye radio if you're not\nCheck them out on the John Frederick ... radio network a this\nSegment is brought to you by America First policy for I Love America First policies and you know why I write because I'm a true believer in Trump's agenda a true believer it's easy for me to be a Trump surrogate chairman of Virginia wherever I\nAm because I I'm a believer when you believe in something it's really easy to do I'm a true believer in the ... Howard first agenda\nAnd the president's policies and so as you know over seven thousand legal immigrants are marching right now through Mexico to bum rush or southern border of the United states it's an invasion and more are joining them\nDay it's going to be ten thousand by the time it hits the southern border now these invaders are determined to crush the border\nBy the way they went in front of a U.S embassy and burned tires that's why you need to build the wall now if you don't have a forty dollar country Congress has put this off for months but they they're about to take up funding for the wall liberals want to abolish ice they want to let everyone in\nThey want sanctuary cities they don't care who comes in whatever big business a big donors the gangster banks on Wall street Goldman Sachs oh let him into you know why she flavor better shareholder value\nBigger bonuses that's the thing on holding alliance of our time now we can't let them have their their their way Congress needs to hear from us and then what certain terms this is our country\nCall Congress tell them to build a wall now too old to two to four thirty one Twenty one for more information you can go to America First policy dot org this message paid for an authorized by America First policy incorporated joining\nUs now Ryan McAdams the pastor he's in the fourth\nCongressional district of Virginia at the beginning of this campaign people like me had\nWritten him off or dad said he couldn't win John mceachin is the incumbent I went through this last year the sheriff was running and he's a good guy share of weight and they thought they were gonna when they got crushed and so I'm like no way you're going to win this you're going to witness to district but McAdams\nHe's doing this in a little bit of a different way this guy is everywhere in Don's mceachin strongholds he's in their churches he's in their communities knocking on doors he no he is going to win the Republican areas but he's given John or\nRun for his money into force just he just had vice president Pence on Saturday came for a rally for macadam plus\nThe vice president's time here with Fifteen ten days to go into very limited they don't go and help candidates they don't think in when because they don't have the time and he's with us now we've got some went behind his back in ... Ryan McAdams running\nFor Congress Republican district for against incumbent Democrat John mceachin that'll be determined on November sex mceachin running for a second term Ryan good to have you with us man\nJohn good morning it's great to be with you can relation on your your radio show be expanded under the acquisition appreciate everything that you said I I Love the elite in and thank you so much to begin with being with you this morning [laughter]\nLook I think you're you're turning this into a fun race I'm not saying that you're going to win\nBut you're turning it into a competitive race and you're working hard and so a couple of things let's start with these pipe bombs what are you are making this yeah [noise]\nWell he he kind of well a hundred and fear and you know there's no place for some politics I think that that we've gone too far maybe on all sides of even I demonizing one another and I think we need to get back to talking about ideas and solutions and and what's best for the American people and stop trying to paint each other\n... and races but we need to get back to what is American and that is not this type of activity that we're seeing a right now in bombing or what the just the hyped up rhetoric I'm\nNot that we see a in politics today so I'm definitely for a more moderate town and and focusing on the things that really matter to American ... solution [noise]\nSo tell me a little bit about\nYour position on this caravan right we've got ten thousand people that's basically going to bumble Russia border the United states and\nAs you know even though the president said he's got to put the military there\nOr or um or or\nThe or the national guard it's a it's unlikely that he closes the border because that was close off trade and\nOur laws are such it's very odd ride\nBecause when you step one foot over the border without your documents you've broken a U.S immigration law right you're here illegally soon as you step foot but Jack Ryan as soon as you step the other foot in you've got three laws protecting you\nThanks again the floors law so\nThere's nothing we can do we can't catch and release you can only keep them for twenty days and if they say the word asylum you can't turn them away you have to process it and you can only what you can only detain them for twenty days and the asylum processing the\nNow Ryan two years so basically you get a piece of paper and you get released into the interior of the country if you were in Congress what do you do about this caravan how do you deal with it\nYeah well there's two different issues there but let's talk about the caravan\nFirst number one as we got to stop them I think the president's going to stop 'em there's no doubt in my mind that he's going to follow through with what he said that he's not going to allow them to come in I mean I I think the continuing to put pressure on Mexico um I I Love what he's he's done with Honduras in Guatemala\nAnd said look if if you can't stop them them and we're going to start taking our money away and found that we've given you or whatever that looks like but I agree there's got to be consequences countries just allowing the type of thing this caravan lawlessness that to happen across their borders coming up\nOur way so I think continuing to push ... number one put pressure on Mexico\nTo stop this caravan I don't know if they'll be able to do that you know if it's ... Fifteen thousand strong now or whatever [noise] um but we're going to have to stop them at the border and then the recognition is what you said is I think that we need to change those asylum a law on that when someone comes in and and I know you know this but eighty percent\nOf those that claim asylum will will get it um [noise] then they'll go through the process and then most of them eighty percent of them will get turned away by the court\nAnd so there's this you know this connection between those claiming asylum\nAnd then does actually going before the court and then and then being beamed that it's completely\nOnce they've gotten that that status per se [noise]\nThen they never show a record and then running amok in our country and so we've got to change that and I don't know exactly what the solution will be we've got to change that to to where the you know they have to be more stringent policy for people seeking asylum wants to cross the border\nRoy McAdams you're right we have to close loopholes and if you just read some of the facts here in two thousand or one half\nOf one percent of the illegals that cross the border claimed asylum now fifty percent claim asylum by two thousand Nineteen it'll be eighty percent I mean they they did they just figured it out you coming in the in the United states you get effort look if you come in and you don't get apprehended then you don't get apprehended and only Fifteen Percent are apprehended\nEighty five percent just come out of the Fifteen Percent that actually get apprehended at fifty percent of them claim asylum and\nEven though eighty percent don't qualify it doesn't matter because they're already God I mean they're ... they're handed a piece of paper and they have a hearing in two years they just get on a bus [laughter] I mean it's an insane\nIt's Saturday what is going under the president said this and she can't get the Democrats tobacco he can't get Republicans are back in those that", "show_name": "The John Fredericks Show", "year": "2018", "city": "Portsmouth", "day": "25"}