{"month": "10", "state": "NY", "station": "WAMC", "content": "Streaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nAlso boutique that supports creative communities and cultures from America and around the world with a showcase for their jewelry gifted women's fashion him maybe more Facebook north shy bookstore presenting be a Shapiro author of the collectors of print is Thursday October the Eighteenth six PM Manchester sooner Vermont north China or dot com\nThat you're joining us today on WAMC northeast report or engineers lawyers are growing and shields all\nThings considered and that support comes from Warwick valley farmers market the twenty fifth season and bringing fresh from the farm food ready for the table weekly new foods from artist and vendors on Sundays ... through the you were with valley farmers markets outward\nForce I plan services over forty five years off of the civil engineering Lance urban\nPlanning an environmental permitting [noise] private in municipal clients that the Berkshires in eastern New York for science land dot com Saratoga Chamber Players opening it's thirty second season was bald headed strings food Sunday October the twenty three PM at the Saratoga United Methodist church Saratoga Chamber Players dot org [noise]\nThis is Northeast Public radio WAMC FM HD Ninety point three Albany W argue NHCD Ninety points reruns and Utica W. M. K. E. H. D. nine point nine Kingston W. O. F. R. H. D. Ninety One point seven Middletown UCLA each dean any one point nine Plattsburgh WC A. N. H. D. Ninety three point three candidate Harry ... three nine tie kind of robots\nW am cue HD one oh five one great Barrington W. W. E. S. H. D. H. D. point nine mount Kisco W. N. D. H. D. in any point one Stanford W and our eighty eight point five rooster WAMC am fourteen hundred Albany\nLive from NPR News in Washington I'm Laurie London\nIn the aftermath of one of the most destructive storms to hit the U.S mainland it's all about recovery officials in states impacted by hurricane Michael are assessing the damage and preparing for the work of putting things back together\nBut for some areas like Florida's Mexico beach that will be a daunting task Florida Senator Bill Nelson says it's pretty much been flattened\nThere's no barrier island out there to protect the\nFull force of the wind and the ... water that came and what you see our houses that are no longer uses\nThe concrete slab of the house and that's all that's left\nIn parts of North Carolina trees and power lines are down and half a million people in the state are still without power\nThere have been at least Thirteen storm related deaths authorities in Virginia stay strong tropical storm Michael took at least five lives there including a firefighter Ben ... from member station WBUR Seavey has more from Richmond\nVirginia state police officers responded to around three hundred traffic accidents during the storm that includes the death of Richmond area firefighter Brad Clark who was struck corresponding to an accident along interstate\nFor other people around him flash floods including a man and the southern part of the state who was swept away from his car marine Geller is a spokeswoman for the Virginia state police\nAnd local residents they dont attempt to try and pull the gentleman safety but unfortunately the ... kickback strong and he was swept away\nFive tornadoes also touched down in Virginia and around four hundred thousand households are still without power for NPR News I'm Ben ...\nThe Democrat challenging Texas senator\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nWithin a three month period congressman Beto O'Rourke raise more than thirty eight million dollars of Ashley Lopez at member station ... in Austin reports that's more than any US Senate candidate has ever raised in One Fund raising quarter\nBeto O'Rourke has been lagging in the polls lately that he is vastly out fundraising his opponent in fact he received more than tripled the amount Ted Cruz raids which is about twelve million dollars and the same time period according to our rights campaign he received more than eight hundred thousand individual contributions none of what she said\nCame from a political action committee or corporation even though over our individual campaign is raising a lot of money Cruz has been receiving a lot of support from conservative groups across the country cruises also maintained an edge in the ... the latest Quinnipiac poll shows truth is lead has widened to nine points in recent days NPR News I'm Ashley Lopez in Austin\nAt the closing bell stocks recovered some of the weeks long says the Dow gained two hundred and Seventy six points this is NPR\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair a new episode every Friday on prime video\n[noise] the problem with Larry I'm Randy Simon and this was was was that are changing environment [noise] oil and gas are typically produced together the oil wells are located near a gas pipeline from the gas gets used\nThe wheels are far offshore word is not economical to get the gas the market than oil companies get rid of the gas burning a process known as flaring\nAccording to researchers at Stanford University in two thousand Fifteen nearly nine thousand oil fields in Ninety countries produce roughly five percent of all global greenhouse gas emissions by flaring gas so this was a huge source of carbon in the atmosphere\nThe industry needs to reduce the amount of flaring they do one challenge is that most countries don't even track flaring much of the data on the subject has actually been obtained by satellite imaging a flavor seen from space\nWhere there are regulations in place or has been progress in Canada offshore oil fields have to shut down if they flare too much excess gas has to be re injected back into the ground converted to liquefied natural gas or pipe to customers\nHere in the U.S the current federal minister ration is on surprisingly not aggressive on this topic\nBut various states are taking action for example North Dakota head wells flaring thirty percent of their gas in the states set a target of ten percent the producers of actually met\nUltimately as the oil industry that must act fortunately the gases economic values are not burning off there's not necessarily have to be an unacceptable expense for oil companies\nThe transition to renewable energy is well underway but will still be using a lot of oil and gas for the next few decades is essential to use them in the most responsible way possible and that includes not burning gas just to get rid of it [noise] for more information\nOn this topic at other environmental news visit us at birth wise radio dot org or find us on Facebook or twice as a production of WAMC Northeast Public radio\nSupport for WAMC comes from babbling instance oil change where customers can stay in their cars for a drive through oil changes open everyday service you can see experts you can trust the aisle seat dot com\n\nNPR News this is all things considered ... Chang and I'm Mary Louise Kelly\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu grabbed\nThe aftermath of hurricane Michael to us today we begin this hour taking stock of the devastation in two towns Appalachia cola and the neighboring town of East Point they're the heart of the Florida oyster industry and they are where NPR's Greg Allen has spent today he is with us now Hey Greg\nI'm Mary Louise so tell me what the two towns look like today well\nYou know these are this area is somewhat east of where hurricane Michael made landfall and they fared better than communities that we're right near the center of places like Mexico beach in Port saint Joe\nSo when we drove in today might lose your body solving and I we didn't see the massive tree damage that we've seen like in those other communities you know the the trees they're mostly stayed standing which shows that they didn't receive the same high wins you know the there I think there was tropical storm force winds and the trees withstood it\nHere in Appalachian coal in East Point storm surge was the main ... along highway Ninety eight the coastal road many buildings were destroyed and these were businesses that were really part of the seafood industry they're all kinds of businesses resist in rubble I'm somewhat already taken a hit economically\nBut uh there's not as many there as a war there before the storm we also saw some people who live on highway Ninety eight who were flooded a but this is nothing like the destruction that we've seen some of those other communities\nAnd are you able to get around or the roads clear you were telling me yesterday I took him nine hours to make a drive that normally would take to so what's what's how's that going\nRight it's it's gotten much better I think throughout the region\nIn this area of the storm surge that a lot of damage to the coastal road highway Ninety eight that's the section that runs really all along the coast through all of these beach towns and it's been damaged in in several places\nAnd it will be some time before that role will be reopened again because the storm surge came up and basically just made the concrete buckled under washed them and a half an hour yeah yeah I watched it out\nThere also in that area there's a causeway the links apple electrical in East Point together that was damaged now just single lane but that said there is now a pathway through apple logical or going\nWest it would be toward places like port saint Joe which were really badly affected you have a steady stream of traffic going through with power company trucks your emergency crews and others and the people in a in a Appalachian coal watching these trucks go by saying hey we don't have power but they they know that their neighbors in Mexico beach need even more help so I think they're willing to wait at this point\nBut in Appalachia go no power no very limited cell service and no outside help you\nSupport for WAMC comes from the sun common helping bring the Hudson Valley a healthier environment\nBy making solar energy more accessible pay beak or offering residential accessible commercial and now community solar some common dot com for details Ellis medicine cardiovascular care offering up to date technology Antonio vascular treatment options\nTo New York's capital reachable heart care in a community hospital setting Ellis medicine dot org slash heart to heart\nTerry Institute of ecosystem studies Newberg New York hosting scientists Jeremy Jackson at Scripps Institution of oceanography discussing his new book break point reckoning with America's environmentally environmental crises October twenty six seven P. M.\nC. A. R. Y. Institute dot org twenty minutes after four o'clock\n\nSupport for NPR comes from the station and from logged me in makers of go to meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more it go to meeting dot com\nFrom exact science is offering color guard for average risk adults over fifty a non invasive colon cancer screening test that can be used at home by prescription only information at color guard taxed dot com\nAnd from the listener to support this NPR stations and\nNPR News this is all things considered I Know for Chang and I'm Mary Louise Kelly today in Turkey a court ordered the release of an American pastor held for the past two years Andrew Brunson spent most of that time in jail he'd been under house arrest since July\nPresident Trump made pastor Brunson case a priority and tweeted today that he will be home soon we don't know yet but it's possible he could be home as soon as tomorrow NPR's Peter Kenyon joins me from Istanbul Hey there I'm Mary Louise so we're me why Brunson was in Turkey and the first place in what exactly he been convicted up\nHe's pastor ran a small church in is near and western turkey for years and years a but after a turkey had this failed military coups and twenty sixteen there was a massive roundup of suspected or enemies and grants\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nThat he had anything to do with this cleric for to the Gulen turkey blames for that coup attempt\nThe U.S said the charges were baseless but he was picked up any way he's been in jail or house arrest for a couple of years now\nAnd then today in court we had three witnesses who were justified against him suddenly changing their earlier testimony somehow he was still convicted after that and since a little over three years in jail but then the judge is basically suspended the rest of the sentence removed restrictions on his movement so he's free to go home\n[noise] All right lots of questions about what evidence they actually had against him why release him and why release him now\nWell in some ways Brunson was caught up in these bilateral tensions between Akron Washington I mean there were Turkish officials who wanted to see us some Turkish executives who had been jailed in the U.S back in Turkey\nAnd of course turkey wanted the extradition of his clerk for to the Glenn who lives in Pennsylvania because they charged him in this a coup from twenty sixteen\nA president rid of type ... said at one point give us our pastor we'll give you a yours or this summer Trump spoke with her to one and reportedly drunk thought he had an agreement to get Brunson released instead he would simply moved to house arrest\nThen the U.S got tougher they levied sanctions and then the pressure kept moaning and then we had this court case and that was released\nSo a lot of moving parts obviously and the U.S turkey relationship but bottom line is the release of pastor Brunson or a good development a breakthrough in us Turkish relations\nIt should be an improvement that the question is how much I mean this has been a high profile issue of the Trump Administration is very important to evangelical Christians in the U.S they tend to support Trump\nAnd we should mention that for instance an evangelical pastor that's his that's his church that he was running and turkey\nYeah absolutely and so that is the key for the American side of the equation on the Turkish side of the equation\nThey now expect these us sanctions that were put on recently to be lifted but will for instance a Washington continue delivering at thirty five fighter jets to turkey will lay re raised the issue of extra dieting the cleric for to Glenn I mean and there's other problems in the relationship this was far from the only one Syria and other things\nPossible murder of a Saudi journalist at the consulate of Saudi Arabia hearing his doubles taking up a lot of attention at the moment\nThe ... case that we've been tracking all of us this week\nThe democracy Yogi case right and I think turkey will at least be relieved to have this Andrew Brunson issue off the table\nThanks Peter You're welcome That's NPR's Peter Kenyon reporting from Istanbul we can\nTake the next few minutes to get to the bottom of an economic mystery with ... reaching all the way to the White House or at least to the White House press corps vending machine [noise]\nIt was my attention by NPR White House correspondent Scott Horsley yeah Stacey Vanek Smith and Cardiff Garcia to look into it they are the co host of NPR's daily economics podcast the indicator from Planet Money\nAnd the trail started as Scott Horsley with at the White House working on a story about the following price of corn\nIn the middle of writing that I came up to the employee break room to buy myself a bag of freaked does and I noticed that the bag or Fritos had gone from a dollar and a quarter the old price to the new prize of a buck and a half\nAnd I had just written that corn futures had fallen twelve percent since may so this was kind of puzzling to me\nSo our mystery why she it's getting more expensive at a time when coke or in it\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nPets he owns ... which makes ... in fact the vending machines got uses in the White House is all Pepsi products and all of the products in the machine got more expensive so we see they would not comment they declined to comment okay find out things I Know a luckily there was a second clue a note left at the scene of the\nCrime to our valued patrons effective in the next couple of weeks the prices in the vending machine may be\nTo offset increases we received in product costs from manufacturers so presumably wholesale cost the Fritos has gone up and they're passing those along to us but it is kind of curious at a time when corn prices are down yeah\nAnd you know there's only three things in a free to there's there's corn\nAnd salt whoa how naive to think that's all that's in a bag of free to Carolyn Dmitri it's an applied economist at NYU who specializes in suits daddy's she says the price of a process food like free does\nHas almost nothing to do with well food prices killed is a much bigger part of the cost of the food like Fritos is and things like labor and rent and transportation because trucking companies are complaining that they cannot find enough drivers\nTo keep up with all the shipping needs that they have which means the trucking is getting more expensive for companies so that could explain why Fritos and all the other snacks and the White House vending machine\nMight suddenly cost a lot more\nWe just shipping costs were not acting alone so on a hunch we called him ... Sharma ... capital markets Mitt analyzes food companies including Pepsi and he has another clue about why the price of Fritos might have gone up aluminum terrorists\nIf you think about the soft drink companies [noise] ah no my mom because the parent has gone up as well because they're\nLike the aluminum cans yeah\nIf the U.S has not importing cheap aluminum from overseas it will have to get aluminum from us suppliers and those us suppliers no longer have to compete as much with overseas aluminum suppliers so the domestic suppliers in the U.S can raise prices\nOf all the companies and it looked at coke and Pepsi were a couple of the hardest hit by aluminum tariffs see maybe Pepsi or coke or just raised the price of their drinks to offset this more expensive can but they can't really do that right now stale so to have been falling but you know we are consuming more of what sex\nBacking growing category alive many of the other categories and that allow companies that make back potentially more pricing power\nIn other words the power to raise prices and so they charge more because they can so there is trucking prices aluminum terrorists in our love for snacks at your best guess for why you're Fritos went up a quarter Scott Horsley that's satisfying it's not as satisfying as the bag or Fritos I'm going to go get right now [laughter]\n[noise]\n\nThat was NPR White House correspondent Scott Horsley meeting with Stacy Vanek Smith and Cardiff Garcia our co host of the pie cats the indicator from Planet Money [noise]\nWhat Planet Money comes from transfer why a service that helps people send money internationally three million people and businesses use transfer wise to send or receive and convert currencies and more\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu or from their ... [noise]\nThis is all Fritos considered from NPR News\nUm so there is this naming and shaming and providing details at a level we really haven't seen previously now one of the interesting developments is how to respond or two months ago President Trump has signed a directive\nThat would streamline the ability of a U.S agencies to to take action so this is something to look forward to see if this deters the Russians in any way\nNPR's Greg Myre thank you thank you turned out that the two Russian operatives behind the u._k. nerve agent attacks have their identities blown by a team of Internet researchers NPR's Geoff Brumfiel has the story of who they are and how they get it\nOkay so here's the one thing you need to know for this story everything is on the Internet\nA problem is that there is no to the conclusion of the the\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nBritish authorities held a press conference they released passport photo said names used by two men and they believe tried to kill a former Russian spy with nerve agent\nIs likely so they would ... says I'm visa ...\nTo a guy like Eric towler that sounded like a challenge towler works for a group called spelling cat his job is so unusual even he doesn't know how to describe it\nSomething like digital researcher digital investigator digital something probably works\nPolar and his friends are very very good at finding all kinds of things on line they've used commercial satellite images to track Chinese air bases watch security operation some fold on social media in Venezuela pinpointed the locations of chemical weapons attack in Syria the true identity of a Russian spy\nIt's tough because this guy you know military intelligence officer so it's not going to be easy to find this guy just on Facebook but\nRemember everything is on the Internet these days including photos of a military academy that trains intelligence officers taken by Russian tourists [noise]\nWhen you look at these photos on there on our on our website and\nIt's just a bunch of rushing just random Russian guys going through and kind of fight saying if it's like military academy\nThese tourists visit the academy and one thing they like photographing is it's wall of fame with pictures of notable graduates\nThis was a year before the poisoning some totally random innocuous normal Russian person ... shows are boy ... 'em up\nOn the wall colonel ana totally ... the spitting image of the men and the photo released by the British right there on the wall with his name's spelled out for all to see and\nBell and cat turned up a lot more it turns out if you're willing to risk getting a nasty computer virus you can download all sorts of Russian databases\nThings like insurance databases um driver's licenses voter database and things like this is one hundred percent legal but it's out there\nIn in those databases they've found way more photos and details about their man ... old phone numbers and addresses including one that linked him to a local military intelligence headquarters\nThis week they also I D to sell us by a guy they think is named Alexander Michigan Michigan came from a small town in Russia's far north once they found them deli cat worked with Russian journalists to send someone up there\nAnd they had a picture and are showing the around people in the town they're like oh yeah that that's all right you know that ... that ... in short in Russia in ... Michigan over there he's a good you know it was a good boy he's a good lead his grandma Ninety two year old grandma always shows us a photo of him receiving a metal from\nButte and Russian President Vladimir Putin probably didn't give me skin metal for being such a great grandson doesn't get past ten fulltime researchers scattered across the globe told that works out of Kansas City others are in the u._k. the Netherlands and elsewhere they say they're funded by a combination of grant money money from classes they run\nCrusty on treatment is another member of the group\nWe firmly believe is so important to have more people are aware of how to do this kind of things and most of the times it's not too hard I\nCaught up with him and told her during a training they were doing near Washington DC\nToday where to start with how do you determine approximately or exactly when a photograph or videos taken\nThe students include journalists law enforcement types human rights workers ... says getting a lot more people to do this stuff is what battling cat is all about\nThe name ... comes from one of these apps fable about a group of mites who decided to put a bell on a stealthy cats in order to expose its presence Trey Burton says that's how they see this new kind of work\nI Hope the group of mice keeps growing and I hope we can\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nKnow how to look Geoff Brumfiel NPR News Washington rainy rainy goes\nIf somebody's not ready to [noise] [noise] and you're listening to all things considered from NPR News\nWhen the new NBA season ... next week a relative newcomer\nIs going to be hitting the court not a player and she had to write the athletic ran who may is stepping back into the basketball shoe business with an updated version of its Nineteen Seventy three classic Clyde that was a shoo them meet famous by New York Knicks great walk Clyde Frasier and\nTo hear all about this come back we're going to go into ESPN Nick DiPaolo who covers the athletic she industry he joined us from Portland, Oregon hey hey how's it going there good so why don't want to get back into the basketball market now I mean it's been what Twenty years since there last basketball she liked him\nYeah so they had it for a night to Ninety eight and it was very short lived they aren't just one clear and been quarter\nAnd yoga broker after two years and so they've been out to a game for about Twenty years now but when I think when you look at basketball basketball's always have the elements of culture style and music that no other American Sport really hasn't so I'll come with a big part of the appeal\nBut tapping in with the players of today that are young and trend setting and exciting and also\nI think a big thing for them as as a branded as they look on to China and how they can make their mark their basketball's really a big gateway in terms of being a global brand as well\nBut how much pull did they have now to get a big name behind him because I'm thinking like Nike and Adidas they were able to attract people like Michael Jordan and LeBron James is ... even in a position to be going after a name like that right now\nSo signing players is definitely one of the biggest hurdle for any newcomer\nYeah um you know I I did a lot of research last year and like you had about ... percent of the week wearing their shoes what oh okay step in and combat that it's pretty tough but okay [laughter] yeah they do have they do have a huge budget an allowance for corporate standpoint and they signed\nSix of the top Fifteen draft picks this year along with an old darned about end market cousin so you know in terms of offers they've been extremely aggressive and that's that's a big part of how they are looking to make their imprint back\nHow big of a gamble is this for a company like you said the markets already pretty saturated is this a long shot to get back into the basketball she business\nIt's incredibly aggressive um the ... is a big hurdle and I guess the biggest thing that the detractors have been\nNot as high on his you know when you're signing a lot of rookies which they have\nIt's really tough to say how these guys will pan out and there's so many cases of guys that were drafted high that\nYou know we're but that didn't pan out and so I think one thing they're really doing is is relying on social media she's gotten a chance to check out Pomona hoops on Instagram they are unlike any other brand in a kind of wild wild west and they'll post whatever [laughter] and it's very on corporate life but I think people have taken to that and man made it kind of fun\nYou see the wild wild west is it more important in some ways how these players act off the court on social media when it comes to promoting she ran than what they do on the court\nYeah that's a huge component of it I think you know as you look at all the stuff in terms of high school kids they're watching less and less of a full through our game and they're really kind of immersing more on what these guys are doing away from the game and and they're seeing snippets of highlights on his grandmother and like that but I looked it up the other day and out of the nine guys up colorblind\nHave six and a half million combined followers on Instagram so that's why this huge base as the brand of starting out you know I think the ...\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nWinning in on their players counts and ethical big part of their ... their news that they don't want that look just like a standard basketball shoe they're trying to create stuff that maybe has a little more lifestyle to it that guys can be showcasing in different ways on their own pages so that's going to be a huge push for sure\n... covers the athletic she industry for ESPN takes so much Nick stars [noise]\n\nYou're listening to all things considered from NPR News high everybody\nI'm Alan I'm ray living let me tell you re just between us I have a little problem is that on Tuesday and Wednesday next week we had a couple more bodies in the morning to help us answer the phones because without the volunteers we are nothing but how do people sign up yeah they they call one eight hundred\nThree two three nine to six to that one eight hundred three two three nine to six to\nProbably the most important telephone number ... anybody knows and then they dial extinction one eighty nine\nSupport for WAMC comes from Amtrak fall foliage trips aboard the Adirondacks great domed car windows on all sides and overhead Albany to Montreal stops the wrapping works and what country Amtrak dot com\nBig wide family owned and operated market with five locations and the Berkshires celebrating more than ... years of serving communities throughout New England big wide dot com Berkshires Center for weight loss surgery with a patient centered focus on long term life skills and help with weight loss surgery monthly seminars open to the public\nIt's in Northeast Public radio WAMC F.\nM. H. D. Ninety point three Albany W are you an HD Ninety point three ramps and you could W am cage the Ninety point nine Kingston W. O. R. H. D. Ninety One seven Middletown WGLA HD Ninety One nine Plattsburgh WC a an HD Ninety three three candidates Harry W. A. N. C. H. D. one oh three nine tie kind of rogue WAMC wage do you want o five\nOne great Barrington W W E S H da da na ... kids go W. A. N. D. H. D. Ninety point one Stanford W ANR eighty five\nBrewster and WAMC am fourteen hundred Albany\nSupport for WAMC comes from Massachusetts General hospital mass generals research bacteria approach drives them to develop treatments were complex conditions to help their patients get back to their lives revolutionizing care Mass General tax trim dot com and online tool for New York's homeowners to find out if\nThere were over a sense than to automatically prepare a personalized property tax grievance tax drum dot com the times five o'clock\n\nAnd and you wonder what does that sense of security now ripped away\nAt school principal in Panama City Florida where one resident tells NPR this whole town is destroyed today it's friday October twelve and this is all things considered\nI'm Mary Louise Kelly and I now think Chang ahead is our business leaders pull out of ... in the desert as the scandal over a missing possibly murdered Saudi journalist white and we'll follow up on does gas explosion in Massachusetts where crews are still working to replace pipelines tell you the truth\nI Am scared to death when they joined that gas or I don't want to be in this neighborhood and\nThe cheating scandal rocks the wine world ... hoping to become a master\n... have to do over there and going to have to once again perform in the way an athlete in the Olympics is my first thing he's\n\nLived from NPR News in Washington I'm jak spear\nAs oil and gas workers begin returning the platforms in the Gulf the job of assessing the damage along the Florida Panhandle after hurricane Michael continues\nIn some Gulf Coast communities just a matter of twenty miles appears to have made a major difference NPR's Greg Allen describes to where it was that appear to sustain slightly less damage but it's still cleaning up after the storm we visited Appalachian\nCoal and you point to communities that are the harder Florida seafood industry there are a little bit east of where the storm made landfall they didn't get as much when some of these other communities what they saw was a massive storm surge that came in and push buildings\nBought off their foundations destroyed many and did a lot of damage there and to some buildings that are really the heart of waste ringing and other fishing in Florida\nAs short distance away in the town of Mexico beach where Michael made landfall as a category for stormed the damage is immense President Trump will visit some of the hard hit areas next week the FBI is looking at a major security breach at Facebook the attack was detected in late September\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu is Jasmine Garsd\nHackers initially stole access to four hundred thousand accounts bend the hackers topped those users friends' lists snowballing the tall took thirty million Facebook users who is information has been compromised emails phone numbers and recent search history were exposed\nGuy Rosen overseas safety and security for Facebook he says\nWe have a tool in our health center that people can now use to see whether they were affected what information may have an access\nThat tool is not easy to find a better back to a Web search for Facebook newsroom Jasmine Garsd NPR News New York\nMedicare announced today premiums for its part the plan will go up next year though by relatively small amount Medicare officials say retirees will see the premium rise by a dollar fifty a month with a standard premium costs about a hundred and thirty five fifty a month\nStocks finished a wobbly week with games though not enough to make up the five percent lost the markets abstain during a big two day downturn some analysts appear to be brushing aside the wild market gyrations though White House economic adviser Larry Kudlow telling reporters states not the first time the market has had ups and downs\nCorrections come and go I've been around a while they come and go ah [noise] the policy is put into place by this administration have delivered an economic boom that virtually everybody thought would be impossible\nAlthough pointing to job creation of this brought down the unemployment rate along with wage gains he says a rising faster at the lower and middle end of the scale than at the top checking the numbers on Wall street today the Dow closed up two hundred and eighty seven points to twenty five thousand three thirty nine the\nNASDAQ was up a hundred and sixty seven points this is NPR\nSupport for NPR comes from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefellers work and food health power jobs and resilient cities at rock found dot org and Americans for the arts\nThis is WAMC regional News I'm Brian shields vandals damage to Republican office in Manhattan party officials say they left a note behind claiming it was just the beginning\nRepublican candidate for governor Mike Mullen arrow says the damage includes smashed windows the spray paint the door and glue in locks at the metropolitan Republican club which the candidate uses as a campaign office the state's Democratic Party condemn the vandalism the damage was discovered today the same day the club is set to host the\nFounder of a men's group known as the Proud Boys\nAs the legal marijuana industry comes to Massachusetts there was a move to help people who were harmed in selling marijuana was a crime Paul title reports\nThe Springfield city council will consider adopting is social equity policy when it comes to deciding who will be permitted to legally sell marijuana to the general public\nCulture Justin hers who chairs the council's ad hoc committee on marijuana regulations said the city should set as a target that half the marijuana retail stores in Springfield the owned and operated by blacks and Hispanics\nBlacks and Hispanics have um unfortunately suffered overwhelmingly when marijuana was illegal and our hope is that we can level the playing field in terms of possibly given them priorities that it\nThe proposals based on a social equity program adopted by the Massachusetts cannabis control commission fulltime he'll WAMC news\nThe Nuclear Regulatory commission has approved the sale of the closed Vermont Yankee nuclear power plant too\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nDecision today to approve the transfer of the plant from Entergy nuclear to North storage still needs the approval of state officials forecast cloudy tonight some showers lower forty some rain tomorrow morning than a cloudy cool afternoon a few breaks the sunshine but some showers is\nLow fifties I mix of San ... Sunday ... fifty forward Rockland great Barrington fifty four Woodstock fifty seven Albany fifty five support\nFor WAMC comes from the community foundation for the greater capital region celebrating fifty years of building communities through giving CF the juicy our daughter word WAMC news at five thirty [noise]\nFrom NPR News this is all things considered I Know for Chang and I'm Mary Louise Kelly search and rescue teams are out in force along the Florida Panhandle they are looking for survivors of Hurricane Matthew\nWhich is now being blamed for at least eleven deaths one of the towns along Florida's Gulf Coast that was pummeled by the hurricane is Panama City\nEmergency crews there are working to clear down trees and to breathe the city is still without water without power and there is no time table for one of those services might be restored NPR's Joel Rose reports\nThe roof of the St Andrews United Methodist church is still in place at the pews are still there but where the back wall should be there is only blue sky\nWe're all in our little safe rooms and one of my members came out and looked in the search word he gave me fill me in and just said John the sanctuary\nPastor John Blunt with sheltering inside the church along with two dozen other people when the hurricane hit the wind ripped two of the walls away but blunt didn't even hear it because the storm was so loud one says he's grateful that everyone in the building survived now he's looking ahead to this weekend\nWill have where terrorists will someday somewhere um and ah have a very social service is claiming the God of good\nAs we talk in what's left of the church a visitor arrives almost as if on cue\nFather Michael talking about like I'm a write up here at St john's rate uh we'd like golf Iraq facilities on\n'cause we we didn't have that much damage\nFather Michael tug well says his church just a few blocks away came through the storm relatively unscathed but Doug well knows that with the exception in Panama City\nThat is going to take years for this place to get re established\nNo it's going to take months probably to get electricity back on hope it doesn't take too long for water 'cause that's important\nCell phone service is sketchy there's no clear sense of wind power and water might be back on and the ... streets are still a tangle of fallen electrical wires twisted metal\nDowned trees [noise] Jose Maria ... owns a landscaping business in Jacksonville traveled\nHere to work cleaning up the mess what a storm like this there's really no worst are basically just got to come in and whoever is yelling out for help and try to help\nStill haven't been able to wrap my\nThis kind of devastation\nHarold Jordan was walking around her neighborhood in Panama City with her husband have their dogs\nWe have two dogs and two cats not children's a house it's unlivable their campaign with ah [noise] um\nMass General but well the forecast a few spots showers overnight it will be cloudy overnight lows in the lower folders of tomorrow morning cloudy some rain\nThan a cloudy very cool afternoon a few breaks the sunshine but a few more scattered showers or possible was well tomorrow afternoon lower fifties on Sunday a mix of sun and clouds in the mid fifties this is all things considered a WAMC\n[noise]\n\n\n\nSupport for NPR comes from this station and from log men makers of go to meeting a collaboration meeting platform allowing people to connect around the globe to get work done learn more is go to meeting dot com\n[noise] from Tara data working to transform how businesses work through the power of data using pervasive data intelligence Tara data leverage is all relevant data to deliver answers to complex business issues Tara data dot com\n[noise] and from the sustaining members of this NPR station\nIt's all things considered from NPR\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nAddict can that Pope Francis has accepted the resignation of Washington's archbishop cardinal Donald Wuerl world has been under tremendous pressure to resign since the report that summer detail the abuse of more than three hundred children in the Pennsylvania dioceses\nWorld was accused of mishandling several cases and abuse well at the diocese of Pittsburgh for over two decades\nAnd in Pennsylvania this morning the man who prepared that scathing horrific report Pennsylvania attorney general Josh Shapiro\nBirds state lawmakers to eliminate the statute of limitations for child sexual abuse prosecutions he's on the line now from Philadelphia Welcome to be with you thank you so I'm going to ask you about your reaction to worlds recognition what went through your mind when you first heard the news today\nWhat cardinal worlds resignation is a necessary step a given what the grand jurors uncovered about his role in the systematic cover up of child sexual abuse I actually second his comments about the need for greater transparency within the church\nI think what's missing here though is an acknowledgement by the Vatican on the extent of the abuse and cover up in Pennsylvania and then bishop worlds role in it now\nI'll I'll I'll leave it to the church is you know the the churches internal politics to them and their preference but I I Do not think that the people have Pennsylvania will accept that anyone proven to be part of this cover up\nShould face no real consequences for that criminal conduct\nThat's exactly what I wanted to address because in a letter to cardinal Wuerl that the cardinal released today Pope Francis actually praised him a letter seems to suggest that the only thing cardinal world is guilty on his managerial mistakes not covering up any crimes what do you think of that characterization by the pope\nI think that it is demonstrably false to suggest that then bishop world did not play any meaningful role in the cover up the church's own secret archives show the active role that bishop we're all played in it\nOkay I I Want to turn now to your calls for a changing the current statute of limitations you you basically agree with four recommendations that the grand jury report articulated tell me about how you think the law should change\nIn Pennsylvania we uncovered three hundred and one predator priests sadly I could only charged two of them and if we lived in another jurisdiction where there was no criminal statute of limitations I Would have charged every single one of them who is living every single one of these victims has been time barred from bringing a civil suit\nBut with respect to completely in eliminating the statute of limitations for criminal cases it is true that the longer you wait before you prosecuted crime the heart of the case becomes to prove witnesses pass away memories fade evidence grown stale does any of that concern you as a lawyer\nCourse but the burden is always on us the prosecutors to bring that case and yes it is more difficult often times when the number of years goes by but it doesn't mean that we should be barred from bringing a case especially when the data clearly shows the children who were abused\nOften don't come forward right away and in fact the average age that a child comes forward to share their truth is when they turned fifty two fifty two and yet the law here in Pennsylvania says that we couldn't bring a criminal case after the age of fifty\nAnd so we believe and the data shows that if it's going to take that much time for someone\nTo come forward we shouldn't be barred from prosecuting\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nInstitution in this instance the Catholic Church but there are so many other examples how a large institution can go to great lengths to cover up sexual abuse and to protect abusers does revising the statute of limitations get it that when it actually increase the accountability internally at these institutions\nWere you hit the nail on the head so much of this is about an institution in this case the Catholic Church arguably the most powerful institution\nIn the world constantly and consistently putting its own reputation above the needs of the people they were there to serve in this case children I think there's a reckoning going on in this country right now about how we are going to or how much we are willing to\nHold powerful institutions accountable\nAnd I think you're seeing across this country with all that's going on with the me too movement and the Kavanaugh hearings and The Cosby trial is is you're seeing more and more people stepping up and being willing to hold powerful institutions accountable in law enforcement plays a unique and critical role in that process that's what we're doing here in Pennsylvania and\nJoshua Shapiro it's Pennsylvania's state attorney general thank you very much for joining us thank you\n[noise] some of the last secrets from the Watergate scandal may soon be revealed a federal judge in Washington has ordered the national archives to review key documents and prepare for their release\nThe papers helped to advance the impeachment effort aimed at president Richard Nixon and scholars say they are relevant today as another special counsel investigating the current administration NPR national justice correspondent Carrie Johnson reports\nA few years after the resignation of Richard Nixon the special prosecutor who investigated him recalled the critical moment in that probe\n... succeeded which was first in history to get the courts to promote the grand jury report to go to the house Judiciary Committee because the committee would have had a real difficulty and doing its workers ... hadn't gotten all the brown\nLeon Jaworski told an interviewer in Nineteen Seventy seven the document contained in detail list of the evidence the Watergate prosecution team had gathered\nWe call it a road map in our office because it was just that\nFor forty four years that road map remained a secret under seal by the federal district court in Washington on orders of the judge who presided over the Watergate cases\nThat secrecy persisted to protect the grand jury's work but not for lack of trying in Nineteen Ninety seven Stephen ... was working for the independent counsel investigating President Bill Clinton base was looking for a precedent for how a special prosecutor might send an impeachment referral to Congress\nThe national archives let me see a lot of uh from the water ... a year to that was very interesting I when I asked you to load laugh at up to the house I they ...\nSaid no Bates tried again years later that the answer was the same no last month he and others petition the court to release the Watergate roadmap their lawyer is Larry ...\nIs relevant historians it's relevant to the intrinsic ongoing interest in Watergate that alone would be sufficient to justify releasing this material but there's real urgency in this instance to getting the road map on to the public\nRecord urgency because another special counsel is on the job now investigating the Trump campaign and one of the big questions about the end of Robert Mueller's investigation is whether he'll try to send to report to Congress or the public\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nSomething that the lower team started likely considered\nSales box on the Watergate team was James corals to now serves as mothers deputy\nBut he says unlike Richard Nixon Donald Trump's legal team is likely to object to any such material going to Congress Trump's personal lawyer Rudy Giuliani has already signaled he would fight in court to stop lawmakers from seeing that document\nMeanwhile the battle over the Watergate road map could soon come to an end this week judge barrel how ordered the national archives to review it and directed the Justice Department to get ready for its release\nCarrie Johnson NPR News Washington [noise]\n[noise] [noise]\n[noise] [noise]\nThis is NPR News\nThere are caused by a number of members of Congress we're suspending are ending arms deals to Saudi Arabia\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nOn he says that ah these arms sales produced jobs for Americans many jobs for Americans he\nAnnounced about a year and a half ago that there were a hundred and ten ... billion dollars in New arms sales to Saudi Arabia although many analysts feel that those numbers were inflated but still it does represent jobs for American\nAnother facet of the fallout over the ... because she'll gay\nSituation NPR's Jackie Northam thanks so much things matter with\nPresident Trump has stepped up his attacks on the Federal Reserve this week after stock prices plunge Trump ripped into the fed for raising interest rates which it's been doing for the last few years\nI think that it's gone crazy I think the fed is out of control I think what they're doing is wrong\nAll right for some perspective on that we are joined by someone who worked at the fed for forty years until twenty ten Don ... was vice chairman of the Fed's board of governors thank you so much for coming in today thank you for having me here also\nSo how usual is it for a president to be attacking the Federal Reserve like this\nIt's been very unusual since the early Nineteen nineties before that and particularly under George W Bush the president and its ministry shouldn't often voice displeasure with the Federal Reserve's\nA monetary policy and maybe didn't call the fed crazy no I don't know that doesn't sound like his rhetoric does it but since uh the Clinton Administration came in\nThey decided that it was best for the Federal Reserve and for the country not to be constantly harping on monetary policy so they could make their views known private lead to the chair and other members other decision makers but not with this public pressure\nOkay it's all up until now fed officials happened defending said from the president's attacks but then today the president of the Chicago fad Charlie Evans he was quoted as saying it's fair to question the right height so does Evans have a point putting aside the president's rhetoric is it fair to question these right I\nI think it's always fair to question whether the Federal Reserve is doing the right thing and a democratic society the Federal Reserve has to be able to defend itself\nOr with the elected representatives and the public I think it brings all the information to bear but it's a legitimate question always and the fed needs to be able to answer why is it doing what it's doing\nDo you think then at the president's comments pose any risk at all on how the fed managing the economy could the president and help sway the fed to slow down the rate hikes\nNo I don't think the president's words will affect what the fed is doing and I would note that the president has made some very high quality appointments to the Federal Reserve which makes me even more confident\nThat it will continue to do the right thing based on economic analysis using them from using the institutions well insulated from the political wins the president's attacks could be sending or I think is very well insulated I Do get concerned that if the president keeps up his attacks\nAnd others drawing him and so far there really hasn't been that he's putting the Federal Reserve into the middle of a very difficult polarized political situation\nSo I don't see\nAn economic riskier given who the decision makers are but I see a political risk and I think it's important for the Federal Reserve the have the confidence of the people of the United states\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nNonpartisan institution much acting in their best interests but you're a little concerned that maybe Trump's rhetoric could be affecting that trust among the man I think it could overtime German power she says has worn out the carpets on Capitol Hill\nTrying to explain to the legislators who are the Federal Reserve's oversight group why they're doing what they're doing and I think that's\nAs well as explaining to the American people and I think that's the basic insulation for the Federal Reserve\nFrom political pressure is understanding\nThat's Donald come the former vice chairman of the Federal Reserve board of governors thank you so much for coming in today You're welcome thank you for having me on [noise]\nYou're listening to all things considered from NPR News\nMad Men creator Matthew Weiner is back with a new series for Amazon called the robot offs it is an anthology series different cast different story and each episode but NPR TV critic Eric Deggans says the series it rarely matches the heady ambition of its creator\nEpisodes of the Romanoff that I've seen feel like a collection of creative ... aimless indie films linked by single than premise at least one person in each episode thinks they're related to the ... the last royal family to rule on Russia and that connection has seriously messed up their heads\nTaken the ... an aged ailing woman in Paris played by Martha color who's cared for by her American nephew Greg played by Aaron Eckhart and those cars racist classes then demanding reacting predictably when a Muslim woman is sent to workers are home health care aide\nI made a cat is I I'm not terribly\nThey emailed me or references she's educated she's studying to be a nurse you know CPR first day she's the best caregiver and they have any you are by far the worst client\nI Hope to see whether when she really top my top\n... claims a family connection to the Roma knobs lamenting the humble end of our once proud family line Greg is their only relative left struggling with a caustic French girl friend who just wants to know what's going to die so they can have her opulent massive apartment in Paris or to themselves\nShe my own family [noise] why Haiti even when he\nMe to the same disease washed they claimed to me the last night he keeps you from going in the case um eating in restaurants\nSo let's see terrible French girlfriend doesn't want a baby nice Muslim caretaker shows up nice American nephew likes or\nBy the middle of this nearly Ninety minute episode you can guess where the story's going which is a serious problem but that doesn't compare to how contrived things get in another episode called the royal we\nIn this story Corey stole is a sad sack has been in therapy with his wife played by Kerry bus Shea who wonders why he never wants to do anything with her\nI don't care what we do\nI Would do anything you want\nBut you do care because you make the decisions what I Do with my spare time how many hours I work I went to face the business is those alerts OK but we both know that you're the boss employee id will always say that because it's true Shelley we try not\nSay people always say anything\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nHelping students prepare for standardized test when he confronts a not too bright kid who is fixated on getting into Harvard\nDo you have to accept the reality and try to be happy with whatever you get ill\nYou're not listening Andrew the big secret\nI just came here for a test drive\nEventually those character meets another woman he would very much like to spend time with during jury duty this story has an awful ending which mostly leaves you wondering why was forced to spend so much time with the Supreme Leon likeable people\nMatthew Weiner wrote and directed every episode of the Romanoff filming in beautiful locations across the globe there's also an ace cast with names like Diane Lane Christina Hendricks and Catherine hon\nBut one or who may deplorable people so compelling on Mad Men and as a writer for the Sopranos can't manage the same trick here\nCritics were only given three episodes in advance so it's possible the series gets better but so far the Romanoff feels like a glitzy showcase for mediocre stories with a tenuous connection to each other it's disappointing second act\nFrom the guy who created one of the best dramas history [noise]\nThis is all things considered from NPR News this is a WAMC\nBusiness update I mean pick us today on Wall street stocks claw back some of the ground they lost this week but still suffered their biggest week we lost in six months\nThe up and the five hundred roast thirty eight points to two thousand seven sixty seven and not that gained one hundred sixty seven points to seven thousand four Ninety six and the Dow wrote two hundred and eighty seven points to twenty five thousand three thirty nine\nTreasury secretary Steven Mnuchin said president Donald Trump respects the independence of the Federal Reserve and has written comments were simply a reflection of the fact that he favors low interest rates on CNBC ... says Trump understands that the fed is doing his job\nWhen your chin praised chairman Jerome Powell who took over its leader in February\nTrump this week has blamed the markets big fell off on the Fed's interest rate increases saying it's out of control\nToyota is recalling more than one hundred sixty eight thousand pickup trucks SUVs and cars because the airbags may not inflate in a crash the recall covers twenty Eighteen and Nineteen tundra pickups and sequoia SUVs as well as twenty Nineteen Avalon sedans", "year": "2018", "show_name": "All Things Considered (NPR)", "city": "Albany", "day": "12"}