{"month": "10", "state": "NY", "station": "WAMC", "content": "Streaming support for WAMC comes from Tom ... what's the warmth in homes and businesses throughout the northeast today's self stoking automated would heat would boilers dot com\nJames Hand blown glass and sculpture curated find arguably ... artist makers throughout New York city I'm twenty eight must have things to Facebook or which stock exchange dot com [noise]\nThis is Northeast Public radio WAMC F. M. H. D. Ninety point three Albany W are you an HD Ninety three ramps and you could WHM cage the Ninety point nine Kingston W. O. R. H. D. Ninety One seven Middletown double UCLA HD Ninety One nine Plattsburgh WC a NHCD Ninety three three Kennedy Harry W. A. N. C. H. D. one oh\nThree nine tie kind of rogue WAMC ... five\nOne great Barrington WWE ... Kisco W. A. N. D. H. D. Ninety point one Stanford W a and R eighty five Bruce during WAMC am fourteen hundred Albany\nOne eight hundred three two three Ninety six to one eight hundred three two three WAMC I just got a text from home is it over the answer being\nNot no no no no we\nHave a race eight hundred eighty eight thousand four hundred and sixty dollars and there's a bunch of stuff you're on the table or folks we have to think so let's let's move right along one eight hundred three two three Ninety\nSix to I'm Joe Donahue Selma capital here the volunteers [noise]\nAll right so a ... or so far in this entire WAMC fund drive we have raised eight hundred and eighty eight thousand four hundred and sixty dollars\nTo go Selma that means what that means one hundred and eleven thousand five hundred and forty to one hundred and eleven thousand five hundred and forty dollars and uh so everything that we do today is what we don't have to do tomorrow\nAnd raising right now it's pretty much yeah OK and we're ending of on drive that we're trying to do to help me\nDown and end up on a chip chip\nAway All right now uh we're gonna we're gonna do a stuffed tonight and we're going to talk about a couple of things are but we want to thank some people and then we'll we'll get started on the other stuff a one\nEight hundred three two three nine to six to one eight hundred three ... three WAMC\nThank you to Michael of Greenfield centered in New York to Janice of mills river Massachusetts thank you Paul of knew who loves everything especially morning report the roundtable the book show wait wait Terry growth and much more and thank you as well to David of highlands is York\nAnonymous of mounted you New Jersey checked in says thank you Rachel Carson who wrote the Silent Spring and the Nineteen sixties before water pollution was even in the public discourse\nThank you to know Philips of Hudson New Yorkers or he is not sure which son works in this field and it's earlier than they can calculate twenty forty ... the the no turning back point for global warming something has to change\nOne eight hundred three two to three nine to six to one\nEight hundred three two three nine to six to anonymous intrusions do much good to say I don't know where to start about WAMC will thank you\nGretchen court of Sheffield I think the carbon certificate would be a beautiful Valentine's Day gift yes for your holiday made very whatever you wish to give it to you can you give it for [noise] um I personally wouldn't be able to hold onto that long I Would I Would want to give it prior right but but if you have that kind of\nThanksgiving is right around with that's where I\nThink having a trick or treat us Steven Greene of great variance in Massachusetts a longtime listener couldn't live without WAMC uh George of ...\nSupport for streaming on WAMC comes from the Davis financial group providing fee based financial planning and wealth management services to individuals families and business owners and the pioneer valley and beyond Davis financial G. R. P. dot com\nTo one eight hundred and three ... three WAMC one eight hundred three do three nine to six to um can we do the\nUh by the ... the food vox food thank you a one in five hundred I'm In the arena Fox Channel\n[laughter]\nHow many how many tons is no no it's a kitten Fox's right now a kid is the baby ... yeah okay with the litter boxes um litter boxes I don't know I don't know the collective for Fox has\nOne eight hundred three two three nine to six to one eight hundred degree ...\nSo what was that we all have dachshunds are we going to ... have you ever seen more than one document together a lot of ...\nYeah they're very cute I look like a one eight hundred and three two three nine six two one eight hundred three ... three W. A. M. C. one eight hundred three two three nine to five or six to\nAh All right now we have a [laughter]\nWe're we're on we're on a skeleton basis here okay we've got we've got like for volunteers\n[laughter] [laughter]\nWhere the staff does that might want to however yet they're coming in\nOkay All right I Know my students are coming so that that will be you know that's ... [laughter]\nI'm calling because there aren't enough be\nNo no no no no no no I'm doing fine and so\nWe we need your we need you right now because we're trying to end the fundraiser we want to and we want to get to the end of the ...\nNow a to do this tonight and we talked about this last night and uh so we we were talking about the carbon certificates we were in and if you still want those you can still have those we have a few left we have about two dozen of those left [noise]\nBut we we have um and and my number would\nBe about two hundred or a hundred and ... what what do you think that is what does that number\nYeah a one eight ... thank you one eight hundred three two three nine to six to one eight hundred three two three WAMC\nOne eight hundred three two three nine to six to\nSell 'em we talked about this last night and we want to make sure that I'm at that every opportunity been talking a lot about opportunity that's fun drive and we want to make sure that every opportunity that we're given has been exhausted and so to do that we want to give you the opportunity to call in and make sure\nThat you have a chance to do this as well as the um as well as the carbon certificates because we want to\nMake sure that uh we finished the fund drive and that all these opportunities are exhausted now one eight hundred three two three nine to six to one eight hundred three do three W. M. C.\nOne eight hundred three two three nine to six to one eight hundred three two three nine to six to okay so um what we're going to do it tonight for the uh for the next a few hours [laughter]\n\nA fruit\nFrom now six o'clock\nOh this'll be fun so uh we're gonna we're going to work very hard to\nTo help as many people as we possibly can I'm In\nSupport for streaming on WAMC comes from the Davis financial group providing fee based financial planning and wealth management services to individuals families and business owners and the pioneer valley and beyond Davis financial G. R. P. dot com\nInto three nine to six to ... this was good All right one eight hundred three two three nine to six to one eight hundred three two three WAMC\nOkay we have um we have time together and ah so in the next hour between now and five o'clock we're gonna chunk this uh we've been trying things out her while\nWe have we in the good old days we used to we used a chunk things up all the time but now that they've been so city ... that's right so so now I'm it's like it's taking the mandate of fast or slow\nThe rate of a thousand cuts or one ...\nSo we um but we are a ten thousand three hundred and thirty dollars away\nFrom being at the nine hundred thousand dollar point of the fund drive so we would like to get to the one hundred uh the nine hundred thousand dollar point in the fund drive by five o'clock that is that is a fair amount of what we're doing now not only do we have um\nThat uh and that'll get us that'll get us into the nine thousand is nine Ninety nine Ninety nine right nine nine nine nine nine four nights a one\nEight hundred three two three nine to six to one eight hundred and three two three W had her\nWhen we have a carrot in front of us that's right we have a goal\nA one eight hundred and three two three nine to six to one eight hundred three two three WAMC so\nUh we have a we have fifty two minutes or to make ten thousand three hundred and thirty dollars now to help us along with this we have um the uh a wonderful opportunity to help\nThose who are in need in our region and what we're doing is feeding a family of four for three months thanks to see more Fox memorial foundation\nAnd and MVP those two folks coming together have made it possible so that we\nYou get the money to WAMC\nThat triggers that triggers\nThe um Fox foundation and BP to make money available so that the food pantries with a capital district throughout our region sixty food pantries throughout our region sixty plus actually can serve people in need\nYou guys do a great job thank you very much one eight hundred three two three nine to six to one eight hundred and three ... three nine to six to nine thousand dollars we have forty minutes to do it in every body on a phone one eight hundred three do three nine to six to\nOne eight hundred and three ... three WAMC one eight hundred three two three nine to six to [noise]\nDo anonymous uh ... uh we appreciate your generosity and helping out with the food pantries we also thank max of adults in Massachusetts anonymous of all to Massachusetts and vets of Troy New York one eight hundred three two three nine to sixty were in the eight thousand Z's now\nEighty seven people eight thousand seven hundred and twenty dollars and we have this but we only have forty minutes left [noise]\nDie for one eight hundred and three two three nine to six to ... we have a lot going on we have a we have the feeding a family of four for three months\nThanks to the scene where Fox foundation and MVP you watch a hundred dollars to WAMC that triggers the donation of the funds necessary to feed a family of four for three months\nThrough the food pantries with a capital district that's number one number two\nWe are trying to get to the nine hundred thousand dollar point in the entire fund drive what you mean we have less than a hundred thousand dollars to go in the entire WAMC fund drive we're trying to do that by five o'clock if we do that by five o'clock we have not one but two\nChallenges one from anonymous and another one from ... [noise]\nThat's two thousand dollars that we have on the table reminder we need a hundred and eight to go in the entire fund drive one eight hundred three do three Ninety six years so you can see how handy two thousand dollars comes in and out one eight hundred three two three nine to six to one eight hundred three do three W. A. M. C. [noise]\nAll of this to say that we need your phone call we need your support WAMC dot org if you want to do it on line we just read a whole bunch of people who did it online you can do that as well [noise]\nThe food pantry family of four donation is on the drop down menu if for whatever reason you do not see it or you were having trouble finding it just\nSupport for streaming on WAMC comes from the Davis financial group providing fee based financial planning and wealth management services to individuals families and business owners and the pioneer valley and beyond Davis financial G. R. P. dot com and just a\nOne eight hundred three two three nine to six to one eight hundred three two three WAMC\nSo eighty six people that we need to find right now to get to the hundred thousand dollar point eighty six people that we need so that we can come back and ah and be on the downward slope of of in instead of six digits have only five and how much money we need to raise in the entire WAMC fund\nThat's a very important psychological crossroads\nIt is because we're so long for the last several days even weeks with the with the lock box we've been working in in\nThree and we've been working in six digits and now we right we will only been five and we liked that one eight hundred three two three nine to six to ... thanks to Julia ... who's helping out and helping a family of four one\nEight hundred three two three nine to six to one eight hundred three two three nine to six two\nEighty six people at a hundred dollars each and we have got it but we only have thirty seven minutes to do this and we need thirty seven I'm Sorry we need eighty six people and we only have thirty seven minutes to do it in that's a lot [noise] that that's a lot but we can do it\nOne eight hundred three two three nine to six to one eight hundred three ... three W\nWe have a thing you are one eight hundred three two three Ninety six to ... when we are\nStruggling when we are entering the flow of the spine you come through and for a one eight hundred three two three nine to six to this is something you can actually do\nRather than sit and read your hands about how awful things or you can help a family of four for three months [noise] that's that's a pretty big deal [noise]\nOne eight hundred three two three nine to six to one eight hundred three two three WAMC one eight hundred three ... three nine to six two\nThings to Sally incurred in hopes that we can become a country that cares for the least of us at all times because we're all brothers and sisters it's a beautiful sentiment Sally and courage and we thank you helping a family of four eighty five people now we only have thirty six minutes to do it and we need everybody on the phone\nIf we can get more volunteers back here that would be awesome and someone to help or Jessica get the uh the forms in the stickers would be great\nOne eight hundred three two three nine to six to one eight hundred and three two three W. A. M. C. how people are starting All right one eight hundred three two three nine to now the ... the ... lines are loaded but if we can get more volunteers back here that would be awesome one eight hundred three two three nine to wherever you go to\nOne eight hundred three two three nine to six to\nUh I think yeah we are loaded so one eight hundred three two three nine to six to one eight hundred and three ... three W. A. M. C. one eight hundred three two three nine to ... All right thank you to ah Michael adults in and\nUh we Mila says yes or no about I Believe and I hope I'm not pushing her name I probably am but I Apologize thank you for your great work and helping the family of four one eight hundred three ... three nine to six two things to a rolling and mark Mary cinnamon\nOr my good friends are from ... New York ah thank you they're helping a family of four also to Jean in Troy\nI have great affection for the station things for all you do in helping 'em several families and we thank you anonymous ... New York likes roundtable them off and wait\nSupport for streaming on WAMC comes from the Davis financial group providing fee based financial planning and wealth management services to individuals families and business owners and the pioneer valley and beyond Davis financial G. R. P. dot com\nFree one eight hundred three do three nine to six to one eight hundred three two three nine to six to\n[noise] a very\nLow right thank you won a hundred and three two three nine to six to anonymous uh Newport New York and thank you for your support of the food pantries are and the seven thousand disease now Seventy nine people at a a hundred dollars each and we will have\nWhat we need to get to the nine hundred thousand dollar point in the fund drive one eight hundred three two three nine to six to one eight hundred three two three WAMC one eight hundred three two three nine to\nSix to oh my significant Autor is listening oh yeah yes he says say Hi to Dan Hi Dan\nWhat eight hundred three there on the freeway on their way oh okay one eight hundred three two three Nineteen sixty so this is the deal we are with your help\nSupporting the capital district food pantries via your pledge to WAMC you gave a pledge of a hundred dollars to WAMC the Seymour Fox foundation in MVP turn around and give a donation to the capital district food pantries\nA donation\nA hundred dollars worth of food which is basically food to feed a family of four\nFor three months which is quite extraordinary and I'm just looking at something that I can hardly believe in front of me one eight hundred three two three nine to six to\nOne it under three two three nine to sixty one thing and not um is of Albany New York who um [noise] we don't give amount but gave a lot of uh helped a lot of\nFamilies many many many many many many families well they're anonymous oh they're anonymous we could it was it was a thousand dollars you know that's yeah that's an that's ten families before who\nHum and ah so right ah one eight hundred three two three nine to six to\n... to Cynthia hobo junction thanks to Mary Windsor, Connecticut I really appreciate alternative radio for like the ... radio dogs and the opera I never miss another show great info on the Media Project and Susan from car honked and thank you anonymous Catherine tons of walled in New York thank you very much one eight hundred three do three nine to\nSix to ... thanks to anonymous uh Pittsfield, Massachusetts love the show is keep doing everything that you're doing\nWhat we can do even more a nine to\nSix to one eight hundred three two three WAMC if you're pledging on line WAMC dot org just let us know that you want to help one eight hundred three two three W. A. M. C.\nThirty two minutes and we need sixty four people thirty two minutes and sixty four people you do the math\nAnonymous of a New York ah says good work well thank you anonymous we'll see another del mar I like everything especially the news and the morning programs one eight hundred three two three nine to stick to the next caller will talk to her and his directory and\nPick a one eight hundred three two or three nine to ... to maybe one eight under three two three it it it just set up that way we'll see what happens there do we're going to order there's no one eight hundred three two three nine to six to one eight hundred three two three W. A. okay so anyway Hi\nTo them for us one eight hundred three two three nine to six to what thirty one minutes and I'm Tony one is they go\nAll right we're in the five thousand Xi's Julie\nNiles in mark ... of the Wilson in New York keep up the great work Sarah from queens Barry\nSupport for streaming on WAMC comes from the Davis financial group providing fee based financial planning and wealth management services to individuals families and business owners and the pioneer valley and beyond Davis financial G. R. P. dot com\nThree W. A. M. C. one eight hundred three two three nine to six two\n... we started out with eight hundred of these we uh we're down to what\nDo we have the last one hundred and Twenty one I Believe right one hundred and Twenty one so that's a hundred and Twenty one families that will eat good healthy food thanks to the generosity of WAMC listeners one eight hundred\nThree two three nine to six to put right now we only need to hear from thirty six of you thirty six people can turn this around one eight hundred three two three nine to six to\nOne eight hundred three two three nine to six to one eight hundred three do three WAMC one eight hundred three two three nine to six to eight thirty six people thirty six people and the next\nUh twenty minutes\nStreaming support for WAMC come from Tom ... what's the warmth in homes and businesses throughout the northeast today's self stoking automated would heat would boilers dot com\nThree W. A. M. C. one eight hundred three do three nine to any of that you can do absolutely\nA one eight hundred three two three nine too sick to thanks the merits of William Sound thanks to Larry and Jenna male or a ... bill\nAh thanks to Amy who loves the station really loves being able to help people with this new nation and we love that you're able to do it and to a share one eight hundred three two three nine to six to also things to Eleanor ... of Ryan back in New York Thank you one eight hundred three two three\nNine Illinois over and\nThe local news is the opera wars every fund drives this happens people say I love everything but the opera and then the next person calls and says but I Love the opera so that's WAMC you might not like everything on your plate you might not like a you know the liver but somebody's got a lot of the liver\nYou can eat the mashed potatoes\nThere's something on his radio station for everybody as we're speaking of food one eight hundred three two three nine to six to\nI Hope you're going by the my plate model I well [laughter] one eight hundred three do three dying to six to one in three rivers are not all of her litter\nOne eight hundred three tiered your your little one I ever not particularly but my my mother was my mother in law is a wanted under three ... three nine to six [laughter]\nMaybe my favorite comment of all of all that we've received the most serious okay this is from Darlene McCarthy of only on a New York and said I'm now they're helping a family of four or no husband no trout children but I got you babe [laughter]\nWAMC oh\nThat's good what eight hundred three do three nine to sixty we need two thousand nine hundred dollars and the next Eighteen minutes ladies and gentlemen hurry let's go push push push anonymous of a new uh Springfield center in New York I'd encourage all my family members to listen to W a try again\nI encourage all my family members to listen to NPR for the best news and they are helping a family of four and you can do by pledging one hundred dollars that triggers the Fox foundation MBP to make the funds available to the food pantries with a capital district to feed a family of four for three months\nOne eight hundred three two three nine to six to you know I think we've been saying that now for a day and we've been saying it really fast and I I don't know that it's ... percent of what that is or how many meals or if if you if you look\nAt a um let's just say a very quick calculation Selma okay of three meals a day right I'm three meals a day a times Ninety Days which would be um three months correct that's two hundred and Seventy meals times for\nIs one thousand eighty meals that you would be providing as a result of your donation one eight hundred three two three nine to success to think of that one thousand eighty meals\nLet that sink in one eight hundred three two three nine to six to one eight hundred three two three W. A. M. C.\nTile ah Garcia ups connecting New York listens every morning on my way to work it's the only news I listen to anonymous ... New York thank you helping out the food pantries one eight hundred three two three nine to six to twenty five hundred dollars do you have it\nAh thanks to anonymous a poke hip see things also or they're helping the food pantries anonymous of applause is doing that as well\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of perks or health systems providing orthopedic services in the Berkshires including ... robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nFive hundred dollars we have exactly sixteen minutes one eight hundred three two three Ninety six to who went out we'll find out one eight hundred three do three nine to six to one eight hundred three two three WAMC\nOne eight hundred three two three nine to six to thanks to anonymous a pleasant ballet when a multi ... an anonymous of what are the leaked\n\nThank you to Karen Megan hotel of Greenfield listen to all the time was wait wait the gardening show and medical Monday [noise]\nThank you uh I did all those right uh yeah I'd have to go get one eight hundred three ... three nine two men who are you say ...\nI Love those Dutch yeah OK so Nineteen hundred and fifty dollars is what we need one of those nine hundred and fifty dollars we have to have many minutes that's once around this room with the drama one eight hundred three two three drama Dr\nAlan Cumming now come on people [laughter]\nI Love you [laughter]\nAll right I'm sort of sunshine is what it under three two three and now when we are\nFailing in ... what makes us happy one eight hundred three two three nine to ...\nTo one eight hundred three two three nine to six to okay so uh we need to get a one thousand nine hundred and fifty dollars whatever part of that you can do it can you do the fifty\nCan you do the hundred can you do nine hundred can you do a thousand and we've had people that just that we just had a thousand dollars come through we just had five hundred dollars come through 'em or whatever you can do or if you can do fifty dollars that's great if you can do twenty dollars that's great\nWhatever it is that you can do right now but a hundred dollar pledge if we got just Nineteen people to give a hundred dollars which is once around this room I Would add\nNineteen people at a hundred dollars that would ensure that we make our goal of two thousand dollars and we are under a hundred thousand dollars to go in the entire WAMC fall on dry one eight hundred three two three nine to six to\nThe hundred dollar pledge will ensure that uh if you wish that one hundred dollars can go to the food pantries and make sure that it feeds a family of four for a three months\nThe money comes to us Fox foundation and MBP make the donation to the food pantry\nAnd that allows us to to do this and to feed their family but also for us to make our money for it's a trigger it's been a center right one in ... leverage that call one eight hundred and twenty three deny it making tremendous leverage\nOne thousand nine hundred and fifty dollars where are you in that one eight hundred three two three nine to six or you didn't take any of those numbers\nAnd take them and make it your own one eight hundred three ... three nine to six two but\nEverybody on the phone doing what they can do one eight hundred three two three nine\nTo six to one eight hundred three do three W. A. M. C. one eight hundred three two three nine to six two\nThirteen minutes Thirteen minutes and I'm Thirteen minutes\nTomorrow [laughter]\nStreaming support for WAMC come from Tom ... what's the warmth in homes and businesses throughout the northeast today's self stoking automated would heat would boilers dot\nCom or twelve minutes and\nThirty seconds wanted under three two three nine to six to one eight hundred three two three WAMC one eight hundred three two three nine to six to we can\nLose is we only have twelve minutes to go hurry please do what you can do if it involves pulling over your car please do it\nOne eight hundred three two three nine to six to if it involves pressing paws on your Netflix do it one eight hundred three two three nine to six you know what you're saying you listen to the radio while you're watching Netflix yeah people do that one eight hundred three to three I started ... okay I'm getting\nAnonymous of hide behind don't judge just pledge a sub Hyde Park we miss Car Talk again we it is it is no more there is no hard for\nUs a step on a\nIt's either Stephanie or stuff on ... there was an eye on there which means Stephanie I think that there's not the I eat so I don't know maybe it has a twitch\nIts way they're stepping her Stephanie okay a Rosendale my favorite place to be as WAMC Christine a chicken be sustained her an additional pledge and we thank you very much for that one eight hundred three two three nine to six to Selma how much we have an exact\nTotal total of what we need a total of ... you know we need we need Seventeen hundred dollars in debt that's exact presented that to the penny and we have exactly\nEleven minutes to do it in one eight hundred three two three nine to now we're into fractions and that's a little scary and now we're not only are we getting into fractions were getting into scary territory\nA one minute in thirty seconds and we'll go over the news right back yeah OK one eight hundred three do three nine Tuesday extra thinking a Jackie\nFrom the Bronx zoo anonymous from Northfield New York\nThe boom common one eight hundred three two three nine to six to feeding a family of four for three months you give us the hundred dollars that triggers the Fox nation and MBP healthcare to give the donation to the money to the food founders of the capital district to provide\nThe meals for which is over a thousand meals for a family of four for three months one eight hundred three two three nine to six to less than a minute ... anonymous of Hurley in New York in support of the fight against a tyranny listened to what they're saying\nI agree thanks cylinder was out of ... falls New York and I thank you for your wonderful challenge also thanks to anonymous from Catskill New York thank you very much\nThank you for a very generous donations from Saratoga Springs I appreciate the discussions around the dinner table that listening to your programs generate an especially about astronomy and food that my kids here on their way home from soccer\nGame very cool that's cool things ah two Fifteen seconds David ... of the cardinals of a longer these thank you and to marry an Albany Thomas and burn hills and a kid from WAMC that or gee this is northeast\nPublic radio WAMC FM HD Ninety point three Albany so what you are you an HD Ninety point three runs in Utica W am cage de Ninety point nine Kingston W. O. S. R. H. D. Ninety One point seven Middletown WC EL HD Ninety One point nine Plattsburgh WC A. N. E. T. Ninety three point three Kennedy Harry WAMC ... three point nine to ... WAMC\n... when a five point one great Barrington W. W. E. S. H. D. idiot point nine mount Kisco WAMC HD Ninety point one Stanford W ANR\nEighty eight point five Brewster and WAMC am fourteen hundred Albany\nLive from NPR News in Washington I'm jak sphere\nAfter a full day of meetings in Saudi Arabia secretary of state Mike Pompeo pale next heads to turkey he's on a mission to find out what happened to a journalist who was reportedly killed in the Saudi consulate in Istanbul and ... on the trip with him and filed this report\nAs State Department spokesperson describes ... meeting in Riyadh adds direct and candid President Trump sent him here to call for a thorough transparent and timely investigation into the disappearance of Washington Post columnist your mouth ...\nIn public the secretary has had little dare say smiling for cameras as he met Saudi Arabia's king Solomon and crown prince Mohammed bin Salman\nPresident Trump said he spoke to the crown prince by phone who quote totally denied any knowledge of what took place in their consulate Michele ... NPR News Riyadh\nOfficials are now essentially doubling the number of people they say died in Florida as a result of hurricane Michael which hit there last week Florida State officials updating their death toll today state officials did not provide details of how\nSupport for streaming on WAMC comes from the Davis financial group providing the base financial planning and wealth management services to individuals families and business owners and the pioneer valley and beyond Davis financial G. R. P. dot com\nAfter it roared ashore as a powerful category for hurricane upwards of a hundred and Ninety thousand homes and businesses in the southeast are still without power\nA spike in the federal deficit has members of Congress concerned including Senate majority leader Mitch McConnell NPR's Scott Horsley reports the deficit jumped Seventeen percent last year mostly because of the ... tax cut\nThe deficit ballooned to seven hundred Seventy nine billion dollars in the last twelve months a remarkable tired of reading for a country not mired in recession or widespread war\nThe increase stems largely from tax cuts and hike in military spending but in an interview with Bloomberg Senate Republican leader Mitch McConnell blamed the big entitlement programs Social Security Medicare and Medicaid\nOr there's been a bipartisan reluctant to tackle entitlement changes because the popularity of those programs so hopefully at some point here ah we'll get serious about the ... yeah\nThe federal deficit is expected to grow to more than a trillion dollars in the current fiscal year Scott Horsley NPR News\nWashington the number of help wanted ads going up in August to its highest level in nearly two decades showing the economy growing strongly over the summer\nThe strong numbers also assault indication companies are becoming increasingly desperate to staff up with the economy expanding strongly Labor Department says job openings Rob a tens of percent to seven point one foreign million that's more than the six point two million people on the unemployment rolls last month\nA strong day on Wall street the Dow Jones industrial average up five hundred and forty seven points to date at twenty five thousand seven Ninety eight that was again of just over two percent the NASDAQ was up two hundred and fourteen points\nYou're listening to NPR News in Washington\n\nA federal judge has approved a settlement between Tesla CEO alone mosque and securities regulators over his infamous message on Twitter about taking the company private\nThe SEC had argued a message Moscow posted was misleading and harmed investors who bought stock in the electric car company as a result company later announced it was not going private the SEC find mosque and the company a total of forty million dollars [noise]\nAn American organization that defense free speech is suing President Trump for violating the first amendment NPR's Lynn Neary reports the suit argues the president's use the power of government to retaliate against journalists and media organizations he doesn't like\nThe lawsuit I guess that President Trump is free to express his own views on the press but cannot use the regulatory and enforcement powers at his office to do sell\nIt said several incidents to back up that argument including the Justice Department's antitrust action against the merger is CNN's parent company Time Warner with aging and the\nAnd the president's executive order to the postal service to raise postal rate on Amazon which is owned by Jeff Bezos\nThe president has complained about coverage of his presidency by the CNN and the Washington Post which is also owned by day says the suit maintains these and other actions by the president threatened journalists ability to do their jobs without fear they marry NPR News Washington\nDespite the legalization of marijuana in Canada US Customs and border protection officials are noting it remains illegal in the U.S and it was found to be in possession of the drug could be arrested and prosecuted recreational marijuana officially becomes legal in Canada\nTomorrow I'm jak sphere NPR News in Washington\nFor NPR comes from the alliance for a lifetime income a nonprofit composed the financial services organizations working to educate Americans about ...\nSupport for streaming on WAMC comes from the Davis financial group providing fee based financial planning and wealth management services to individuals families and business owners and the pioneer valley and beyond Davis financial G. R. P. dot com or\nOne eight hundred three two three nine to six to one eight hundred three two three WAMC one eight hundred three do three nine to six to one eight hundred three two three W. A. M. C. I'm Joe Donahue I'm Selma Catholic and you're the volunteers\nAnd when all is said and done we made what we need it to me and I thought I threw it was great at in the sun dried [noise] all that is left of it is now is Ninety four thousand seven hundred and thirty five dollars\nAll right now or that is Ninety four thousand seven hundred and thirty five dollars now a compared to a million that's great compared\nTo whatever what makes for a living and usually it's it's quite a bit Ninety four thousand seven hundred and fifty dollars\nCompared to what our capacity is to make right now it's a lot of money right\nSo what we want to do is what we would love to do and what our what our commander\nWhat a Allen has asked us to do wake up on a Allen has asked us to 'em because he's going to be coming in tomorrow and ending the fund drive right so if we get it down so let's just say this happened so this was this was the kind of strategizing that\nUsually you go out I don't mind the mile high on not not while we're on the air right for it to just talk amongst yourselves that's right so this was their will give you a little scene behind the\nScenes as to how these kinds of things go so if we were to make right now a Nineteen thousand dollars that would bring us down needing Seventy five thousand dollars to go\nIn the entire fund drive now then the night crew will come on now they may ten thousand dollars last night that sometimes they make much more than that but if they said they made ten\nThousand dollars actually more than that last night but let's say let's just say ten ... then then that would mean sixty five thousand dollars for Alan in a re in the morning\nAnd then we could on the phone Dr Ammerman we could even have around the yuppie\nI'm In favor of that now that all the way I ever [noise] All right they're all and say now or someone we don't need you to do this again I'll write one eight hundred three two three nine to six years so that would be a fifty\nA right that would be fifty one fifty one I'm fifty one and then I'm so down a reset reached that\nAh and then a down at ... if I were nine one eight hundred three two three nine to real excellent one eight hundred three two three nine to stick\nTo the point is we only have fifty one minutes to do this and we need to make twenty thousand dollars\nOr so where are you in this now we are a kind of at the end of the uh the the cupboard is bearer here with stuff and because we're at the end of the ... we only have Ninety five thousand dollars to go in the entire fund drive so\nWe've got um we have Seventy food pantries certificates lab we have Seventy food pantry certificate slapped we have twenty five a carbon certificates lap we'll talk about what these are in a moment\nTake you to Dianne Smith a very New York who says thank you so much for all you do helping with both the food pantry and retiring the carbon thanks to a looks like Donna ... Albany New York clubs and Fox Pop and radios luck and thank you Jackie and Frank Don again\nA Schenectady who says thank you for making everyone pay attention\nEight hundred three two three nine Tuesdays do we need exactly sixteen thousand dollars but we only have forty minutes to do it and everybody needs to dive one eight hundred three two three Ninety six do we have sixteen hundred dollars on the table and\nA one eight hundred three two three nine to six to one eight hundred three two three nine to six to we have about Seventy certificates for the ah oh I Would probably last though but we'll we'll get an updated number here\nFor the food pantry is so actually throw that out because because why not because the numbers are an actor and we will because we will be recorded ts one eight hundred three two three nine to six to one eight hundred three two three WAMC but\nWe have the food pantries that's one option okay you have three options one option is to just help the radio station that just do it perfectly\nAcceptable option all ended up if you have if you have whatever money you have twenty bucks eighty bucks Seventy dollars thirty dollars five dollars\nHeld the radio station now if you want to do a hundred dollars and held the radio station you can also help the food pantries how's that work too well that works because you take the hundred dollars from the um the donation that triggers the Fox foundation and the and then BP\nTo give the necessary money to the food vendors from the capital district to make sure the family of four yet\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of perks or health systems providing orthopedic services in the Berkshires including ... robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nWe now have let's see I shouldn't we now have Seventy but under Seventy one eight hundred three do three nine to six to fewer than they were them so let's say over just slightly over fifty one under three two three nine to six to\nJennifer of south once falls they listen to you guys every day and I'm a single mom with two kids and I put myself through nursing school using the food pantries in government assistance like God Bless you we need to maintain these social programs\nI told you you today and I and I absolutely did and I I Love seeing this and Jennifer I appreciate your call so much it's it's the people who are giving who ... who knows this better than anybody because they abuse the food pantry and they know how important they are\nAnd here she is a single mom to kids put herself through nursing school\nAnd knows that we need to maintain these programs uh there's a wonderful woman her name is kitty she is a chef at I'm\nAt a wonderful restaurant here in Albany and ah she was on with the food pantries and she uh she was saying that she was a recipient and now she has a business owner in in the city and owns a restaurant and what does she do most of the time well helps people who are hungry\nUm it's a beautiful thing and it and it's it is and they know better than anybody else and uh there are these are these are heroes in our in our wives\nOne eight hundred three two three nine to six to one eight hundred three two three WAMC a one eight hundred three two three nine to six years because we haven't made it easy for them we have seen in recent days and weeks of what entitlement can do to a person we have seen of what entitlement\nOf what people expect because they feel they're entitled to but people do have that and who have to scrape and you have to work and who have to go uh and and and work their way through the system of whatever system that is\nWell then they're the ones to to me that are the true heroes that get things done in our world and in our country and in our communities one eight hundred three two or three nine to six to and if they need a little help right now than we should help them right now\nOne eight hundred three two three nine to six to [noise] uh we need Fifteen thousand six hundred and Seventy five dollars we only have thirty six minutes to do it in if we're going to make this we are going to need a huge surge here right now one eight hundred three two three nine to six to\nEverybody on a phone Matthew burns V. screen Bush New York and memory and my father James Burns thank you very much and thank you for your generosity Robert ... thank you my money but our station well thank you for that\nOne eight hundred three to three nine to six to to Bob and leads a pet of ... New York wants to support the station with programming and they are both a long time listeners Elaine broom of Galloway New York or helping the food pantry as we need a hundred and fifty three people have a hundred and fifty three people come forward\nWe've got it we've got our thirty six we have thirty six minutes to make one uh Fifteen thousand three hundred and twenty five dollars\nWhatever part of that you can do please do whatever little part or big part you can do now is the time now that would bring us down to the Seventy five thousand dollar point in the entire fund drive\nIn the entire WAMC fund drive but we need you right now one eight hundred three two three nine to six to we only have thirty five minutes we have Fifteen thousand three hundred and twenty two dollars we have people to feed we\nSupport for streaming on WAMC comes from the Davis financial group providing fee based financial planning and wealth management services to individuals families and business owners and the pioneer valley and beyond Davis financial G. R. P. dot com\n[noise] yesterday somebody called and pledged and said if it's my first led to the radio station and all I wanted to do was dive through the telephone and ask her what the heck it was the joke said or that I said\nIn her brain to make her make that phone call because if we had it we would bottle it and put it in the water\nOne eight hundred three two three nine to six to every now and then you know somebody just gets it and says I really need to do this and I really need to do this now\nThis be the moment for you\nIf you would let this be your moment the moment you decide hey this is worth something to me this radio station is worth something to me that's the one Tanglewood concert I enjoyed the summer while I was on my deck\nHaving a beautiful glass of wine and listening to the night sound that's worth it to me to pledge a hundred dollars to this radio station or\nFor if you were with us on election night and you were waiting for the\nWaiting for the results and you stayed up way past your bedtime to hear what was going on mainly that's worth a hundred dollars to whatever it is whatever\nWhatever value you choose to put on this radio station that's all we're asking you to do consider it put a dollar sign in front of it and calling now with the pledge and if you do you will be\nYou'll be helping not only the radio station you off but you will be helping feed a family of four for three months\nThanks to the Fox memorial foundations seem more Fox he was a guy this is not just like this amorphous organization seeing Fox was a man he was an attorney he was a bull loving bull loving man around here a philanthropist\nWho really really wanted to help the hungry\nAnd in fact I'm Sorry to interrupt but he but he actually dreaming of establishing a food pantry in his lifetime he was unable to do it\nBut he recognized that there were so many individuals and families that were struggling\nSo it's one of the reasons why the facts Fox on ... so interested in helping the adventures and helping us in this effort right\nBecause he was so hell bent on making sure that people obtain good neutral she's kind of one of these people who would you mentioned his name to anybody who knew him back in the day they go oh yeah and I've done so much and we're the foundation has done you're really incredible um and\nCarrying on in his name it and that's right it's pretty remarkable and their fame done so much they gave us a hundred of these\nOf opportunities is the only thing we can call them opportunities your pledge of a hundred dollars helps to feed a family of four for three months that's an extraordinary\nOpportunity and on and and for once you could say yeah there is something I could do I'm not going to just sit here and ... my television or curse my radio because I hate the news\nYou can still do them you can it's blood pressure down\nAnd we don't want to do to stop doing that kept my parents live for like a really long time by screaming at the TV but by the way I Am so sorry about your Oh thank you that's we I Know I don't know but I but I Wonder in the first time she had a hell of a life\nI Know one eight hundred line we've always talked about I Know yeah we always meant to her but she's she's up there watching them\nStreaming support for WAMC come from Tom ... what's the warmth in homes and businesses throughout the northeast today's self stoking automated would heat would boilers dot com\nYou know the thing about it is that that we are we just heard of the from from the person who is listening or the worst Porto was as he takes care of an elderly parents\nUm you know there there are people who just do wonderful things in life and uh the the people who do God's work is going to say and um you know some of us do that some of us don't some of his supporters of the camp it's it's it's what you can do and you know what that is that you know that better than anybody\nElse but there's really good work being done and that's one of the things that the Fox foundation does is one of the things that MBP helps highlight as well that they they showed that they they helped these programs so that more people can take advantage of them and more people can uh can benefit from them\nOr what we try to do a showcase than we do that through falling into place we do that for the fun drive\nThe least for a moment oh I'd love to hold the leaves yes well then you pass the oh would you like\nMe to to use that little baggy one eight hundred three two three those are the kind of be kind of use\nSupport for streaming on WAMC comes from the Davis financial group providing fee based financial planning and wealth management services to individuals families and business owners in the tiny your belly and beyond Davis financial G. R. P. dot com\nTo six to we can't stop now Peter and Karen from Felicia Claire um\nClara found on New York helping the food bank and we thank you Deborah I'm Sorry W down and uh the outcome on New York thank you and Carol Field of stone ridge glad the WAMC is there and we're glad you were there because otherwise we wouldn't\nHave gotten a phone call WAMC people look out for each other they drive their neighbors to the polls\nOne eight hundred three to three I Can't read up and down any well I'm Sorry I'm tired one eight hundred and three to three nine two will make you do that although if you put your glasses upside down you can do it if I told my glasses\nWith one of the people at the top of my head\nRedo three down to six to hurry ladies and gentlemen hurry we have Thirteen thousand dollars to make or maybe less now won it under three two three nine to six to one eight hundred three two three WAMC one eight hundred three to three I mean I assume\nIs fast as I can there is that accurate yes oh well one\nDay and under three two three nine to six to one eight hundred three two three WAMC All right we're in the trial thousands these\nWe need a hundred and twenty two people under twenty four people hundred twenty four people twelve thousand four hundred and fifty five dollars you know what we can still do this [laughter] we can really knew that said I think he might him no we can really do this so we just need everybody to dive where we can help the food pantries\nWe can help uh take carbon out of the air uh to to retire those carbon\nCarbon [laughter] [noise]\nPerson yes I drank the carbon sort of retiring carbon yucky carbon yes carbon ... air it it no longer in the air because you have\nWell it wasn't like we are taking it out of the ... you go in there that's what I'm trying to say I am a jak in Albany New York Thank you and helping out the ah the food pantry also to anonymous of great Barrington there is no way to live without WAMC and thank you for your beautiful work\nHelping out with the carbon certificates even though I'm I'm having a difficult time explaining them right now anonymous of infield Connecticut thank you very much also things to see even money Kramer in these difficult times it is incredibly important to have WN speed is WAMC to speak the truth\nTony Blair of Massachusetts thank you I'm Brenda and\n... and ... is Gianni I Believe I'll to keep up the good work thank you very much ah Ricky in del mar loves the show anonymous ... that we're thinking of feeding people at this time of year\nWell what people need help all times of the year and that's why this is over three months and we do this every fund drive so but thank you we understand the point where we thank you very much anonymous in Albany New York Thank you and to anonymous Hudson great work thank you\nOne eight hundred and three ... three nine to six to one eight hundred three two three WAMC\nWe have um we're under were in the ... you know a damn are anonymous of Saratoga Springs New York thank you one eight hundred three two three nine to six do\nWe have Seventeen minutes we need twelve thousand dollars okay now whatever you can do is is a what we need\nRight that's right what he says one\nEight hundred three two three nine to six to one eight hundred three ... three WAMC if you're going to be generous new two or three or five or five hundred dollars great if you get to a thousand dollars great\nStreaming support for WAMC come from ... Center for weight loss surgery with a focus on life skills and support for long term success with we've ... to me in gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register or are we are are within\nStriking distance we still have Seventeen minutes we couldn't make the most of that time making the most of that time as a community coming together we have wonderful volunteers in this room and can take your phone calls\nWe have enough people to take the phone calls we have enough people or to a process than we have enough people with some and I are here to keep track of the numbers and we have all we really need missing all we need is you we have really good things to help people with\nWhat we need now is you one eight hundred three two three nine to six to David rumble\nOf New York second pledge this drive with like a replacement bumper sticker sold truck it was on [laughter]\nWill ah will will try to\nGet that great story on selected shorts about the the black guy who bought the trucks that have the Confederate flag on the back of the Confederate flag ball I don't think I heard the with such a great story one eight hundred three two three nights\nAre so so we can send most well I I made a note David will try to send you a bumper sticker agenda of wall kill we love everything you do and glad that you are there\nJessica Becker loves the station and red hook and to sue\nI'm\nThis is for their children to he was the other on the council and the food pantry and we thank you very very much a also thanks to anonymous of east green Bush knew your keep up the good work I really enjoy the sports program on Saturday morning and\nIt's only again and Nancy Garden of Adam's\nEveryone please vote of the roundtable one eight hundred three two three nine to six to one eight hundred three two three and a half the anonymous of Warner bill New York one eight hundred three two three nine to six to hurry everybody we only have Fifteen minutes do we have ten thousand dollars when the ten thousand disease\nWe actually need ten thousand nine hundred dollars but [noise]\nIf it if it helps morale ten thousands the one eight hundred three two three nine to two things to anonymous Asperger I'm On my pledge to go towards food\nAnonymous of Albany thank you one eight hundred three two three Ninety two six to ten thousand dollars hundred nine people\nA one eight hundred three two three nine to sixty we only have thirty forces if it gets a lot for the food pantries only thirty four left let's do this now I hate to be crashed because we're talking about this but it's three thousand four hundred dollars that is a great chunk out of what we need if we if there's thirty four people wanted to help the food pantries we'd be a third of the way through what we need\nAnd the next Fifteen minutes everybody died one eight hundred three do three nine to six to [noise]\nAll right ten thousand dollars Fifteen minutes the stations on the line here one eight hundred three two three nine to six to we are what we're trying to do is to get right now we need eighty eight\nThousand dollars less in the entire ... [noise]\nWe want to get to Seventy five thousand we do um so once all the paperwork overhear clears\nWill be at eighty five thousand and then we need another town and then that'll be that'll be Seventy five thousand dollars then um [noise] and then we're all taken out and then [noise]\nOne eight hundred three ... three Ninety six two so so we\nWe have the um out of that ten thousand dollars you take that um [noise] we make that somehow the Seventy five thousand dollars to go on the phone drive the night crew does whatever great work they can do the night and then that's what's left\nIn the ... in the morning with ray\nSupport for streaming on WAMC comes from the Davis financial group providing fee based financial planning and wealth management services to individuals families and business owners and the pioneer valley and beyond Davis financial G. R. P. dot com\nYeah one eight hundred three two three nine to six to ... and thank you very much but to do that and to make it happen so that you have a round table tomorrow\nAnd that we get back to regular programming is what we have to do tonight\nAllen talks a lot about Lynch pins [noise] this is the lynchpin we've got to do this we need this ten thousand dollars in the next Thirteen minutes sharing Klein of Socrates New York thanks for all you do one eight hundred three two three nine to six to one eight hundred three two three WAMC one eight hundred three two three nine to six to ...\nAnonymous of writing back New York everybody get out and vote one eight hundred three two three nine to ... they were saying you know the choir here I Know but you know what will take it one day and I go to three two one eight hundred three two three nine to ...\n... ... in anything\nI could see the music from surgery or yet it's not just because you're spacing out all I Want to drive to three Nineteen sixty\nOne eight hundred three ... three ... won it under three two three nine to six to uh what can you do what part of that can you do one eight hundred three two three nine to six to one eight hundred three do three W. A. M. C.\nOne eight hundred three ... three nine to six to\nOf this is from a homicide ... of ...\nNew York a second donation in honor of his wife a doctor a we have said and helping out the food pantries big time and we thank you very much for that that is a very generous and very helpful at this time especially a friend in great burying to thank you for your generosity and things and you are correct in your assumption\n'em and Karen ... lake thank you very much keep it up ladies and gentlemen we've got to do this let's go Ninety five hundred dollar and we only have eleven minutes\nTo do it in but come on we can do at Ninety five hundred dollars um work we have to do it we got to get this money we we have to do this one eight hundred three two three nine to six to ... from ...", "year": "2018", "show_name": "All Things Considered (NPR)", "city": "Albany", "day": "16"}