{"month": "10", "state": "MA", "station": "WBZ", "content": "When just when should you take Social Security and everything else but we don't charge extra for that so we we just feel like you know we do very well at our from as far as you know are we make a good living but we we feel that we don't have to charge an extra financial planning the\nUm but then there um our advisors are that\nAre professionals that they don't\nThey don't actually managed portfolio is joining the what they do they just charge by the hour\nIt's the only way you go in and they'll charge you a fee to put a financial plan you know could be a eight hundred could be five thousand mhm and then um you would meet with him or her you know several times a year or once a year in charge an hourly rate like a hundred and fifty an hour or two hundred dollars or whatever it might be\nBut then it's your responsibility to go back with whatever that the only planet told you and to make your own investment choices and to know when to rebalance and to do all that so\nMost people that I talked to don't want that because they don't want the responsibility of doing it on their own they'd rather just say well I don't want to\nGo check pay pay somebody a fee and then have to go back and do it myself and then you know what am I going to rebalance our one of my window I changed the way things in a way it's like the the only plant are really has no skin and again because they get their hourly fee and however you perform well that's up to you as a fee based plan or the way we do it\nIs we have skin in the game if if you know the way we manage our clients portfolio is it's either going to help the clients and help us or hurt the clients and hurt us revenue is based on you know a client's value so all we want them to do I get us to do better\nSo I'm not saying once better or worse but there's different ways of of working with different professional so that's um you know as far as the fee based on the only and then like Larry said even the fee based\nYou know you can be very simple like we have it and I for one percent per year are you know there's other firms that they have what they call lattice schedule where could start as high as ... percent and even if you invest more than a million\nA lot of schedule you still can be paying two percent for the first one fifty and then one and a half so you figure that out and even over a million dollars just to pay more than one percent so\nYou guys just didn't want to do all the math and the ... we like to keep\nIt separate ... much better for\nUs and simple for our clients to understand\nYeah well I mean I clearly remember and I mean this was years and years ago\nThe first time I was like I think I should man it you know when somebody's like I'll talk to my friend and you know then I talked to the friend and I was there and he's like well before I can do anything it's Fifteen hundred dollars I'm like oh I thought I was going to talk to you and you're going to\nHe ... he was like well my time is worth a lot of money and why wouldn't you why wouldn't I get paid to give you this information I'm like I'm not going to pay you I was like I had no idea that I was going to have to do that and how I Know but you feel that\nWhile our time is worth a lot of money to buy we we um fail we put the time and effort in for new people coming in we put the financial plan together before they even become a client I Believe we we've been doing this so long Jody have twenty five years become clients my dad alone I have you know whatever you want to call it the ability the skills to know what questions to ask\nAnd how to put the plan together and we get right to the point is no fluff up plans [laughter] this as as we hit the important part too and so but if you don't know what questions to us and you might not get the dead full plan so to speak\nRight right well it's I mean again I'm I'm all about power to the people and making sure that everybody knows you know you have the right to ask people like questions\nYou know you get your money and you should feel confident on how it's been managed and how the professionals being compensated and don't be afraid to ask any questions whether you're a new person know professionally ... professional\nSide All right we'll be back right after this\nFor foreign one payroll over planning Iran portfolio asset allocation analysis of more Paul Ninety three financial group today at eight hundred nine zero eight nine three three or four [noise]\nAre you one hundred percent comfortable with one hundred percent of your portfolio hello I'm Paul well\nAnd I'm Larry Welsh principles the Ninety three financial group and host of family financial focus heard here on WB face Saturday at six fan\nThe market has short and a roller coaster ride over the last ten years\nAre you ready for retirement do you have a dedicated advisor who understands urinate\nSwear Ninety three financial group believe you need a plan for retirement income along with growth to keep up with inflation and solid professional advice from a team that will consistently monitor your accounts in understand your objective\nWe are that team whether you're planning on retiring next year are in ten years\nOr four one K. roll over planning IRA and portfolio asset allocation analysis and more call Ninety three financial today at eight hundred nine zero eight nine three three or four that's eight hundred nine zero eight nine three three for ... eight hundred nine zero eight nine three three for\nMore information including their disclosure visit Ninety three F. G. dot com\nHas your doctor told you your blood pressure is too high are you looking for ways to possibly lower your blood pressure if the answer is yes then you may be eligible for a study conducted by the sleep and inflammatory systems lab at Beth Israel Deaconess Medical center the research study tests weather changes to your sleep pattern can lower your blood pressure and as for individuals age twenty five sixty five years old\nCalled six one seven six six seven five to four three or email sleep time at B. I. D. M. C. dot Harvard dot edu the study involves up to eight weeks of monitoring your current sleep habits at home followed by an eight week behavioral sleep program to study involves no medications three overnight\nStays at B. I. D. M. C. is also required your sleep and blood pressure will also be measured during the overnight stays participants may receive up to one thousand and fifty dollars and will receive a personalized summary of their sleep patterns\nFor more information called six one seven six six seven five to four three four emails sleep time at B. I. D. M. C. dot Harvard dot edu\nWe look forward to hearing from you\nWhether you're planning on retiring next year", "show_name": "Cindy Stumpo is Tough as Nails", "year": "2018", "city": "Boston", "day": "27"}