{"month": "10", "state": "GA", "station": "WNGH", "content": "Join us for the sound of Athens Sunday night at seven on Georgia Public broadcasting\nHave you alive here this afternoon on GDP were Eighteen station radio network of Georgia Public broadcasting another hour over the weekend all things considered is next year on G. P. B. and B. Newt stock [noise] support for deep ... comes from generous listeners\nWeekend all things considered is mix your own gp B and C B new stock\nSupport for ... comes from generous listeners like you and Georgia State university G. P. B. Atlanta is license to Georgia State university ranked among the top universities in the nation and commitment to undergraduate teaching more information is available at G. S. U. dot edu checkout\nGDP music on our website we feature videos at performances from touring artists and emerging musicians and you can see short documentary about people who make Georgia music it's at ... dot org [noise]\nNinety seven ... seven double your G. P. B. S. W. A. G. P. P. H. D. role or to the Georgia Public broadcasting radio network [noise]\n\nFrom American public media [noise]\nFrom here at the center for farming thing getting yeah\nI'm here with musical director Mike oh we're going to admit\nThe ballot heartbreak on the little\nMind comedian John Barry is here [noise]\n...\n\nOffering secure data production solutions for businesses including automatic back up for ... advanced and point protection pie availability and disaster recovery solution\nThe automated data migration learned\nAction higher veil ability and disaster recovery solutions\nAutomated data migration learn\n\n\n\nSo we told by the fire is the gas like bubble like a diet for [noise]\nGoes who like our ... in the long night when I did not look over my shoulder\nAnimal just lurk in the ... the whole under the stairs where the guy made a\nThat we went to the thing and Carol swamps [noise]\nWasn't there wasn't a shaving up among to light the flying street\nAt the end of a long road was a drive that led to a large house\nAnd we stumbled up the darkness\nEach one of us afraid [noise]\nEach one holding a stone\nAnd all of us to brave to say a word in the winter\nThe trees made noise just as of old and\nMaybe Web footed men yeah we using\nCaves ...\nReached the black book the house\nOur forces high and seemingly\nDistant and leave felt darkness\nOur voices high and seemingly\nDistant and the leaves felt darkness around the house that was occupied by\nWish to close together\nNear the dark door\nSit\nDry poised to like the voice of someone who\nHas not spoken for a long time\nShe joined are singing a small\n... voice from the other side of the door a small\nThrough the day and\nShe\nAnd the worst is your story around so\nAt that time of year y'all [noise]\nBig story time [noise] that one\nWas from Mr Dylan Thomas once a little help from getting ill but\nYou know my my theory favorites are the true stories that we tell each other in small apple jak fuel groups about our own paranormal encounters I've got one for yeah if you promise not to tell anyone\nThis is this is one hundred percent true\nAnd uh I I'm not a ghost\nGuy just so you know uh I remember this had happened\nYesterday even though it's it's it's been about Seventeen years almost exactly a okay there we go [noise]\nWhat\nShe's doing Thomas gets creepy improv but I don't\nWhat\nShe's doing Thomas gets creepy improv but I don't know [noise]\n\nI'm driving home from dinner with my girlfriend on a dark chilly fall night in Boulder, Colorado\nWe stopped at a stop sign as one does [noise]\nWhen I started pulling forward my girlfriend gas violently and I mean like\nMy land on the brakes and a split second later out of nowhere this guy with an absolutely crazy look in his eyes comes barreling past us on a bike I mean maybe ten feet in front of the car [noise]\nAnd I hadn't thought the car I Would have killed him\nFor sure I hadn't thought the guard would've killed that guy and if my girlfriend hadn't gas I wouldn't stop the car [noise]\nThere's a creepy part as soon as I cut my breath I turned to my girlfriend and I said what in the ever looking out we'll just happened how did you how did you see that guy I Can't see a damn thing it isn't right in front of the headlights [noise]\nShe was shaking white as a she still just looking straight ahead and said almost in a whisper\nYou mean you you didn't hear that I\nI didn't hear anything I heard a crash I\nBut you'll as God is my when I was there\nThere was no crash there was that was great [noise]\nI Know right [noise]\nOf a show for you tonight Jeff Gordon\n[noise] [noise]\n[noise]\nSo my family has three ghost stories that likes to tell around the fire this time of year you just heard one of them that one's mine and again seriously one hundred percent true or the other two\nWe just heard one of them that one's mine and again seriously one hundred percent true or the other two\nMuch you can leave a little something to the imagination\nWhen you ... it was appropriate okay I I bought the\nMuslim little revealing I checked okay back to the book a\nBiography of your own egg oh in Spring Hill I sign up for candy corn ... and parents\nDon't worry we have a black on all the candy corn griffey\n[noise] what\nWe do yes because some people think it's okay to look at it in a while to read\n[noise] I Do not look at corn I I wouldn't even know where to find it is you're lying dying always bring\nEvery where the\nJak but do they ever jak\n[noise] they actually do they are due in three weeks or you will be issue to find [noise] that goes for you to tell you what are you saying well you've had fifty shades of gray checked out there if\nI'm starting to worry about my reputation library ours are still six eight an still six and you should really go straight home right after that I don't hit the clubs anymore Deb I told you got a good\n[noise] [noise]\n\nOh I'm so excited about the musical\nSent me her new ... which is called the hard way about a month ago and I reached out the singing is so good songs are so good so fresh and yet there's also something familiar about dental turns out I've been humming her songs for quite some time and so have you\nBut the songs are so good so fresh and yet there's also something familiar about dental turns out I've been humming her songs for quite some time and so have you she's written hits for and with such artist as Mary J barge Jennifer Lopez and um [noise]\nUh All right the queen of America ...\nHere to perform some songs from the new UP the hard way ladies and gentlemen please make welcome Diana Gordon [noise]\n\nLittle mom will love and then go to all of that and a sheet of payment of a\nWoman and she is I Love the end but a and a king mother\nAlone for a bullet\nThrough all ... all of them die that well and then got a story ...\n... ... take a trip to the moon ... the body well never mind on one hand on any other oh no holiday a reminder nurse she could\nDance all night they called me in the mall and when that will ... adult lay around baby she is a and\nYou know and and\nWrong wrong wrong\nNa na acceptable J. put the money on the counter well um she the ... brains no don't you live that down\nAnd got a bingo on a trip and she'd come but about that on a she's a dangerous so how do you like to do that and that is\nAm I don't know wrong wrong\n\n\nMan I don't like going from wrong\n\nGo home on the\nWhere you know by\nIf you are oh no no John\nFound out that was yeah\nHelps out a day job our I share\n\nWell you know no don't\nThese day\n[noise] [noise]\nWorried about that sounds so many easy it's called pure not that hard it's called pure and I wrote that song after finding my missing brother who he was missing for sixteen years and I moved from New York to California and one day I was just\nAnd I wrote that song after finding my missing brother who he was missing for sixteen years\nAnd I moved from New York to California and one day I was just coming home from the flea market and there he was on the street homeless sitting on a box so I read that from my brother and that's just a little personal pure is about my brothers and sisters so [noise]\n\nProcess where you're going through an experience like that and\n[noise] you just feel everything everything is feeling everything is emotion that was very quick I wrote it in my basement in a very safe environment and yeah yeah like built out the garage\nUm yeah I mean I wondered where he was for so long and I think it was just really ... for me to know it wasn't my fault and so I it was easy acts as\n[laughter]\nAs a bulldog\nI mean you know no one that gave me\nE yeah\nThat though I mean what's your name\nThey get in the last bit of good the bad\nWas the lack\nThe streets\nTo come he didn't\nGet to anyone\n[noise]\n\nPapa in a segment we call out in America Tom are you there\nI'm here Chris I'm half of life from here I'm resuming my journey across the country sharing the good stories of our fellow Americans\nThis week I was lucky enough to experience the iconic New York on them as they rolled into New York city there's something magical about fall in Manhattan It's that sweet spot between the summer humidity and the icy winter when you can actually walk around town\nFeel good and things don't smell so bad\nIt was late afternoon when I checked into my hotel and dropped off my bags New York is a great walking city and nothing encourages that more than a hotel room the size of a pine cone\nStreets were colorful is always\nHalloween has hit the city have you ever complimented someone's costume and realized he was just a New Yorker wears a milk carton is a hat\nI walked into Washington Square park who sat on a bench near a dog run there's nothing crazier than in New York dog part\nThese are not dogs that are used to the freedom of backyards and rolling hills these are pets that have been locked indoors for hours drinking coffee trying not to pee on the New York post [noise]\nWhen they finally get to the dog park they lose their mind [laughter]\nI sat next to one of the dog owners musician named Dave even though he was in sweat pants has long hair and cool Jean jacket said he was a rocker his dog look cool to he was a mutt named Rocco with a spike collar and an upper lip and the permanence ...\nDavid lived in the village with Rocco his whole adult life and makes a living now is a studio musician he was lamenting about how the city has changed\nAnd in the village with Rocco his whole adult life and makes a living now in the studio musician he was lamenting about how the city's changed\nThere's no scene for the young bands anymore than New York used to be a city of artists weirdos who we are too strange to live in their hometowns but now there's nothing left at the weirdos can afford\nIt said the one thing that will never change is the amazing diversity in the city\nThere are people from all around the world he said just look at this dog park ... just a crazy mud and here he is hanging with three pug a purebred German Shepherd and the French poodle who's getting a little too friendly with her nose [noise]\nThis is New York [laughter]\nAfter meeting some friends for dinner I headed back towards the hotel through the west village on a normal night those areas hopping but\nAs Halloween comes near it's truly outrageous but bars were in full force and people were dressed up in costumes roaming the streets to me it's the adults in costumes or the scariest part of Halloween\n[noise] at least want a child dresses up like a ninja turtle chances are he won't be drunk and hitting on your girlfriend [noise]\nAnd they had it down McDougal street I was approached by what can only be described as large dirty humor his\nFace was smudge is had had a muddy footprint on it he was sweating and confused grabbed my arm and asked if I knew where his friends where\nI felt bad for the summer but I had to\nWhat kind of friends will be looking for [noise] for the worst too [noise]\nDid they live in a magical land should I Try and return them to his hollowed out tree [noise]\nAnd I felt bad for them so I took his big white hand in mind and walking down the street [noise] have you ever gotten looks to strangers on the street and you knew without a doubt they thought you in the ... were lovers [noise]\n\nWe try to reach racist steps and we saw a lot of people but no ... that's when he got desperate and decided to climb onto a mailbox for a better view the postal department might be slow they may not run their post offices that well but one thing they did right was designing their mailboxes [noise]\nThey created a square bottom that makes it seem as if climbing it would be easy [laughter]\nAnd they did right was designing their mailboxes\nThey created a square bottom that makes it seem as if climbing it would be easy [laughter] when you get to that rounded top you quickly find out it's impossible to stand on [noise] especially if you're drunk desperate and dressed like a blue cartoon character [laughter]\nHis effort was valiant he wasn't falling off but he wasn't going up either he was clinging to the side throws in like a very koala bears [laughter]\nNever heard alive Kuala bearing couldn't tell you what kind of noise they made this one let out little half ... runs that broke my heart [laughter]\nJust as I was about to help three others ... came running up and grabbed\nHis mom lost rather have them and knock them to the ground in a pile of blue and white for I felt as if I was responsible for this story book ending and I wandered away [noise] have you ever tried to cross the street and found yourself tackled by a gaggle of giant beer so stuffed animals\nThey insisted that I come with them and get some pizza before they caught the train as a bank you we went to Joe is on ... street in sixth avenue it's a tiny shop with one table a couple stools at the window most people just by through the crowd and take their place outside\nI was worried about causing esteem by walking in with these smirks\nBut as soon as we entered I realized it was not going to be a problem it turns out that at midnight on friday before Halloween in the west village there are a lot of people in costume thinking the same thing there was a sexy devil a hotdog Michael Jackson to clowns from it and\nBecause it showed that even though I'm dressed in business casual I Am related to people like farmers that people who like farmers\nLook at how wave rolled up the leaves of my business shirt and I've let\nCorn kernel poultry my fingers as I talked to the\nI'm smiling and not as if I Know what he's talking about but the truth is I don't\nI'm smiling and not and if I Know what he's talking about but the truth is I don't\nNow watch my should be young children and passively attractive hug ... motion\nWe are all Christian and we're all laughing\nNow you know that I Am a Christian parents who labs\nBut I can also\nBe Syria because now I Am in a business off and there are papers and a telephone on a desk in front of me if you enjoy paper or telephones that are plugged into a wall and [noise]\nYou were going to want to vote for me [noise]\nJust remember if you want things like change or change\nWould also want everything to exactly the same I Am clearly the best choice to represent\nSome thing I'm candidate and I approve this message paid for by\n\nAfter a short intermission you are listening to live from here coming ... from the center for performing arts in Nebraska\n[noise]\n\nI'm here is supported by the S P certified financial planner professionally trained in providing holistic financial planning in their client's best interest for short and long term goals from starting a business the label for college to retirement must make a plan dot org\nAnd by gobble meal prep service delivering fresh gourmet dinner kids that are table ready in Fifteen minutes just one bad double dose to prep work do you spend less time dropping them more time with family or more gobbled ... from here\nAnd buy a home advisor measure homeowners and home improvement professionals for a variety of whole project from minor repairs to major remodeled homeowners can read reviews of local ... home advisor dot com\nAnd by the real price offering a strategic investing approach that examines investment opportunities first hand\nInstitutions advisors employers and individuals shoes she wrote\nOffering a strategic investing approach that examines investment opportunities first hand\nInstitutions advisors employers and individuals shoes he wrote price T Rowe price investor confidence\nAnd by fracture creating modern photo decor and gifts by printing photos directly on glass of fracture is image frame and Maryland all in one hand made an carbon neutral Florida factoring\nLearned more at ... dot com slash law\nBy progressive insurance offering a way to buy a home insurance for their home quote explored some quotes rates are available online learn more and progressive dot com or one eight hundred progressive\nAnd by mother goose online test prep for the ACT that's designed to improve scores student can get video lessons practiced questions experts support on line smart go far and enjoy the ride at ... dot com slash easy\nVideo killed the radio star but I think the Internet is really helping\nThe live from here dot org to learn more about our upcoming shows in the checkout video clips like show and other recent favorites Lindsay Buckingham and the war and treaty you can also join us for live video streams from the town hall throughout in December with guests like power John the\nAll that and more at lives from here to talk more\nFlak from here is produced by American public media\nLike you so much for spending a portion of your evening with a fear on GDP radio were in Eighteen stay some service of Georgia Public broadcasting live from here with crispy early as next done gp be\n\nFor all of us off on a lecture night stay with NPR News I'm Ari Shapiro\nAnd I'm Sarah McCammon NPR's political team will be alive all night watching the close races around the country living on election night then wake up and hear what the outcome means for America on MORNING edition\nCritical election essential coverage NPR you\nJoin us for all the results on election night starting at eight Iran gp\nWhen a life hangs in the balance what goes beyond a reasonable doubt really mean\nTroy Anthony Davis and on the phone on my mind about ...\nG. P. B. present the radio way beyond reasonable doubt that Troy Davis project by Atlanta play right we know the story\nBear GPA be present the radio way beyond reasonable doubt the Troy Davis project by Atlanta play right we know the story follows the death penalty case of Troy Davis subscribe now in June or wherever your podcaster found\n[noise]\nNinety seven ... seven FM double your G. P. B. S. W. A. G. P. H. D. Rome quarter but Georgia Public broadcasting radio network [noise]\n\nThe center for performing arts in Lincoln, Nebraska welcome back to la from here with family and\n[noise] and\nNow every other political ad\nLet other candidate wants to take away the rights and freedoms of the good legal citizens up here [noise]\nI'm not going to let her\nJust to look at this quote that other candidates said about something totally unrelated\nTo look like it's ripped from the headlines just like the other candidate will ribs and stuff out of your hands\nLike freedom and your gas powered automobile\nNow look at this footage of that other candidate with the person who does it look like you know why she's smiling water they up to [laughter]\nTo remind you what this is scary here's this dog photo of the bill of rights and it's on fire [laughter]\n\nNot scared yet well here's some random B roll footage from the TV show the walking dead [noise]\nAnd now look at this slow motion footage of meat staring sadly at a closed steel mill\nJoe the walking dead\nNow look at this slow motion footage of meat staring sadly at a closed steel mill the other candidate wants to keep it closed but you don't want this even though you don't really understand what a steel mill is\nHere's me with my gun and here's me with my oil rig ears me at a football game that other candidate wants to take away football and give it to immigrants who want to call it soccer\nGosh candidates like you I'm scared of change so I promise to change things so that they never changed\nHere's my name and white letters and here is me with my white picket fence and hears me with my family who match the letters and [noise]\nHere's a slogan that build what style job for a time that we legally kid returned to\n\nCandidate diet\n[noise] prevent\nGrow them back to the stairs risk Diana Gordon [noise]\n\nAlong but\n\n\nShall we took the world by storm when she released ... album I Am Shelby Lynne I'm not ... I'm ... and I have a record a bunch of us who were previously unaware became an instant friends upon hearing the opening track or to\nDay\nYou\n\n\n\n[noise] hey I'll\nWas Jeff main gums birthday on Wednesday Jeff magnum a neutral milk hotel family\nOne of my favorite living songwriters if you haven't already check out the neutral milk hotel record in the Arab playing over the c._e._o.\nOr you'll hear well absolutely no mandolin during\nBut something kind of like the\n... ball\nHere has huge time on your job and\nYou\n...\nIt is a ball or\nDay shoes\n... too\nCold for ... years for\nMe the same thing in your heart\nDe ...\nDe ...\nDe ...\nA day to day ...\nDay ...\nDays in the you know\n\nOh\nTo Franco show all of a leading musical voices are\nOur generation and it's easy to hear why spend on a little time with songs like wanting to choose to\nShow oh may\n[noise]\nOf [noise] diverse\nAnd I was shocked at first they segment with one of the greatest musicians to ever let Joni Mitchell [noise]\n\nOut there her birthday isn't actually until now\nBeverly Joni Mitchell [noise]\nOut there her birthday actually until November step in\nBut we don't have a show scheduled that wage and let's be honest\nIt's always the right time to celebrate the fact that Joni Mitchell was born and\nHere [noise]\nStuck in the man\nThe\n\nWas I think yang [noise]\nI should've bought do [noise] let me rephrase that the CBS house brand of um [noise]\nWhat a colossal waste of money [noise]\nI told a joke in New York and when I said job SOPA table in the back cheered [noise]\nI was like you don't work for a job so do she's like yes we do [noise]\nLong story short made them send me a case of so [noise]\nAnd I'm\nNot lying send me a big old boxer so\nI Would call it an uncomfortable amount of so [noise]\nI like\nGetting free stuff but I'd like to be able to explore other soap options [noise]\nBefore my eight hundred birthday [noise]\n\nWhat'd you do get free stuff when you're in show business I get more than most people because I asked for it [noise]\nI might try to open myself up tonight served with the beard what do you do service administer you got nothing for [noise]\n\nMr service administer you got nothing for [noise]\n\nI live near a big CBS walked in there recently perfectly times just as the guy was asking if they sold sausages [noise]\nI was to feed into the store here you still sausages [noise]\nWho this might be an unexpectedly delightful trip [noise]\nTo CBS let's see how this played down [noise]\nOr we don't sell sausages you don't who he's surprised [noise]\nThat CBS was not sell sausages [noise]\nI guess when he walked in there and thought ten different types of bed pans for sale [noise]\nLike this is a place to get killed but also\n[noise]\nWhen he was there recently it sounds like killing shampoo prescription [noise]\nLike it'd be crazy to leave your without some trees a [noise]\n\nI memorize to solve the just for that ya [noise]\nDid some shows in Canada I wanted to tell a joke I remember they don't have CBS there\nBut the last second I changed to shoppers drug march [noise]\nJoke worked fine [noise]\nFewer people start tweeting at me actually shoppers Dr Mark does sell some suggest [noise]\n\nThank you for that object [noise]\nThank you for a fact checking a Joe [noise]\nBefore I go I like that show chocolate that's a great show for chefs compete for a ten thousand dollar first prize\nMy favorite part about that show was none of the ... the grass what'd you can buy for ten thousand dollars [noise]\nIt was like ... what are you gonna do if you when the ten thousand dollars why what was going through the travel around the world for a year [noise]\nFlying first class everywhere [noise] or you can do that for another one point three million dollars [noise]\nHere's what you're going to do unify first class to Cleveland [noise]\nSick America about Columbus [noise]\nFly back premium economy from Columbus [noise]\nThen you're out of money [noise]\n... what are you going to do when the ten\nThousand dollars six brothers I'd love to buy the major Rolls Royce\nHere's what you're going to do it by three decent skateboard\nA hundred dollars but six brothers I'd love to buy the major Rolls Royce [noise]\nHere's what you're going to do by three decent skateboard [noise]\nThey can make a little sign up sheet and your brother can take turns [noise]\n... what are you going to do if you when the ten thousand dollars so I think it'd be great to buy my mom a house [noise]\nThat'd be the greatest buying your mom make sweets ten thousand dollar house [noise]\nIt by yourself and upgraded food processor [noise] then the best wooden spoon [noise]\nThen you can make your mom's some death\nShe can enjoy it in the house she currently let [noise]\nKind of you very much for [noise]\n\nJeffrey\nFor you please thinking alone [noise]\nPretty [noise] do our\nTime with you it's going to a close a and a in a show\nFull of scary stories and songs I mean that's a long while ... quite happy is\nPretty scary yeah it's it's a place for this week released a death yeah [noise]\n\nHad a Halloween ... but I had their\nChest waiting always finding a way\n[noise] form\nJeff Twitter only finding a way\n[noise] but\n[noise] so\nUh what would you have a new shows with Gary song has been scary stories or how is it possible that we have not yet heard that\nAnd said\nWell done to read a little excerpt from the book\nInspired to know about this I learned this this week I was listening to the song that can all do this on the show this week and as I was paying attention to the lyrics and usually it goes by and like\nYeah you won't you get like\nTotally I Will [noise] I Know who you are a but it was actually looking at the we're supposed to this is a lot like the master and margarita the ... novel is anyone ... read the the master and margarita credible incredible victory phew oh my goodness\nY'all it's going to be a good and scary at night for you [noise]\nA master margarita mckell Boulder cough wrote it and it's a it's an amazing story or that fit Jagger was clearly reading while he well he wrote the lyrics to sympathy for the devil", "show_name": "Live from Here", "year": "2018", "city": "Chatsworth", "day": "27"}