{"month": "10", "state": "AZ", "station": "KJZK", "content": "\nA brochure first produced by the Arizona department in Nineteen twenty five\nArizona highways evolved into one of the most respected and revered publications in the world doing K. A. W. sea and retired Arizona highways publisher when hold and at the next spirited discussion to learn the story of this remarkable magazine Wednesday November seventh five thirty seven\nYou're listening to the Arizona community radio network in eighty nine point five FM cages EA Drake Ninety ... Ninety points have enough in cages decay Kingman [noise]\nAuthor of the communist revolution\nYou know if we want to learn a lot about hiring the right people for organizations that might be wise to listen to the folks at Nordstrom\nBased on customer reviews they get it right [noise]\nIt just seems to be something about their service sets them apart from the competition Nordstrom has known for their legendary customer service and most of the credit\nThat exemplary services a direct result they're\nWhich they called her the smile\nThat included that it's much more effective to hire someone with right attitude\nTeach them retail skills\nRather than hire someone was skills and teach them a service attitude\nPowering the folks who make it right\nFor our customers with us we're at an attitude a service\nIt'll make our world's kinder and such as the stuff of revolutions\nSupport for the Arizona humidity radio network has provided by cable one providing local and long distance phone service for your home with standard though and receive caller i._d. blocking goal forward they got more\nKeep your ... phone number talk as long as you like anytime anywhere in the continental United States for details go online to cable one dot net that's cable one in ... by golly [noise]\nItem sires are nice summer absolutely casting pointers orange planes that dragon has been grown exclusively for the Prescott area dragons or a natural about birds with author blooms it's that\nInto bloom again in spring\n... center in Prescott regarding cyber snapped ... tend to play with\nBy useful information all the public radio programs you enjoy that inform entertain educate edited lighten plus a link to our Web stream that kj Z. A. dot O. R. G.\nTechnician is the right thing to do is very very\nSo I did want to be aware of this\nTwenty four hours ago and and we took a ... right away\nAnd a lot is walkers running mate on the independent ticket in a tight reelection bed Walker says it's too late to remove them a lot to name from the ballot Walker appointed Alaska department of health and social services commissioner Valerie Davidson to film a lot to post\nA lot is clean cut his resignation as a possible blow for native voters who historically have low turnout Walker told national native news anchor and Tony Gonzales native voter turnout is critical but he says that's not the primary consideration in this instance\nAre the places they had nothing to do with\nYour hair the top internal watchdog for the U.S department of interior is being replaced with a political appointee from the department of housing and urban development\nThe Washington Post reported deputy inspector general Mary Kendall who has led the office for nine years is being replaced by two than Israel tough assistant secretary of hide Kendall was leading several investigations into interior secretary Ryan Zinke heat including issues about travel by his wife\nAnd land development deal in Montana government ethics watchdogs are concerned the inspector general audits an investigates waste fraud and abuse at ten agencies it's considered a nonpartisan position\nTops has no background in government investigations or an environmental regulations the announcement came in an email from HUD secretary Ben Carson and took the inspector general's office by surprise\nA spokesman for interior referred questions about who hired tough to the White House which did not respond to a request for comment\n... nations came why and our radio studio in Washington state is working to get back on air after a devastating burglary last week\nThese pushed in a window air conditioner to gain access and took some twenty thousand dollars worth of equipment to station has been off the air sense right Dick the morning men DJ says staff is working on purchasing and installing new equipment thanks to an emergency financial boots from the ...\nThey want to get back on\n... says the equipment is insured the items stolen include the broadcasts consul and electronics that would be difficult to sell secondhand\nEverything was gone control\nThe E. A. out to the emergency alert system which is a requirement for broadcast by the FCC to Seventeen year old tribal radio station or the variety of native programming including national native needed fix says as news adopt emerged the station received numerous offered the support and sympathy\nCallers have been called to see what they can be without heartbroken\nTribal police are investigating they say they've notified local pawn shop in case suspicious items show up there for national native News I'm Megan camera\n[noise]\nAnd\n\nNational\nLatest news or do you got the Annenberg national NATO voice studios like water Broadcasting Corporation wanting to buy ... are going to be the last ... by the corporation for public broadcasting reports from the public radio that like the support by the law must not allow the chamber's\n... among the national trouble right swap are ... there was a Washington DC New Mexico California\nAnd Alaska and online that W. W. W. dot ... dot com support for law and justice related programming provided by ... the\nNational law firm dedicated to promote and defending tribal rights were more than Thirty Years' war information available at all just atrocious dot com oh\nNative boys on the Native American radio network [noise]\n\nDo you remember being near ... well you know I remember being [noise] you know\nMean\nWe\nNa na we don't know\nI'm aware when\nYou're done we remember and\nDonny\nNeed\nWe don't know\nYeah you\nDo want to be done guy you've gotta really\nYou\n\n\n... ... ...\n... ... ... ...\nNa na na na\nNa na ... ...\n... and ...\n... ...\n... ... Ben ... na\nNa na\nNa na na na\nNa\nNa na\nNa na na na\n\nA\nOr here's the saddest thing about it or did you get there it's truly nothing for you you're going and when you die it's too late for me to go to\nBirth of Christ\nMissouri's ...\nA kid I gather dad\nWar you go ... you don't\n[noise]\nAnd oh my God\nWhy our and I were in a band death and then you know then there's man\n\n\nThe objects yeah as long as I had to put\nI died and I know\nAnd I\nI can just say you will\nI was listening to um\nThe the block right melts and I'm like All right ah I'm listening to smile for Christine and I'm about two or three minutes into and I'm like is this thing I mean it's just an instrument so [laughter] and I'm like is it a\nThen I got busy and I didn't finish the rest of the song I have to step up above the boost right here but I I think it's an instrumental but yet both Williams definitely had me going I was like All right I Want to listen to a you know what are you going to say\nAnd for like I said like the two minutes I was like watch instrumental instruments anyways I ride mark Stuart didn't read the reckless bastards gave us power of a woman a that is awesome track I ... yeah that's powering the yeah yeah [noise]\nYeah well just leave it like that the power of a woman [laughter] ... of the road album for twenty or twenty Fifteen a fortunate ones capable gave us northern star\nVisit brand new joint a brand new album this is off the hold fast from twenty Eighteen just dropped the goal copy fortunate ones that's right and been buzz Williams gave us a what I think is an instrumental because like I said I listen for about two minutes of it and but I have to step up to now for Christine I'm awesome instrumental\nAnd then Jon Andrus gave us parade that was awesome song bad [laughter] yeah\nI'm John address I Hope you enjoy it as much as I did anyways a\nBrand new joined us Rob brand new album and it would've been able to track obviously pray and the name of the album is called Johnny Was twenty team gold copied we definitely need to put this got on the map ... dude\nRight I got a parking courts coming up next a with re bird do such a rate quarter the brothers lander and some Logan magnate is coming up next year I Am thirty twenty crossing borders bought a radio Yuma\nBorder radio is supported by ... regional medical center focused on advancing heart Carrie ... why are AMC's cardiologist and heart surgeon specialize in all aspects of cardiology including preventative intervention all an surgical learn more about the many advancements in her care at ... regional dot org slash heart care\nYou went to two party radio Thirteen twenty am Yuma and where to radio a C. dot org we also broadcast on the Arizona community radio network\nIn Prescott today sunny skies and the highest fifty nine east when six to ten miles per hour tomorrow sunny near sixty three Flagstaff has a chance of rain in a high a forty six today\nAnd tomorrow mostly sunny ice near fifty one Kingman mostly sunny today ice near sixty nine and tomorrow sunny but the high near Seventy one and you must sunny today in a high of eighty degrees tomorrow sunny skies with a high near eighty five degree\n[noise] na\nNa\nNa", "show_name": "Crossing Borders", "year": "2018", "city": "Kingman", "day": "18"}