{"month": "10", "state": "AZ", "station": "KUYI", "content": "You know why\nI'm a man I Love na na na\nNa na na na na na\nNa na\nNa na na na\nNa na\nNa na\nNa na na\nNa na na na na na na mom mom\nOh\nDing\nNa\nNa na\nNa na\nYou are listening to ... I Hope the law and point one at a ... year why I L P upper ma ... point about the ... foundation streamline minor KU why does that change what\nI hear your Native American public radio station following her body ... why I ... and a new Arizona Public radio or\n[noise]\n\n\nOr\n\n[noise]\n\nOr or\nOr or\n\nOr and\nOh my\n[laughter] why from NPR News in Washington ... ... about eight and a closely watched trial a jury\nHas convicted a white Chicago police officer of second degree murder\nAnd the shooting a black teenager look Kwan McDonalds here in Washington the nomination of Brett Kavanaugh to the Supreme Court is now on track to a final Senate vote after a procedural vote as you want to forty nine dish wanting to continue to the final confirmation decision\nVoting Dr proceed Alaska Republican Lisa Murkowski who calls Kevin ... a good mad but not right for the court at this time\nI have been wrestling [noise] to really\nTry to know what\nIs fair and I'm like right now is that it came\nOn the eve of the Senate the cabinet took to an op ed piece in the wall Street Journal to concede that his last appearance were quote very emotional but he said at the end of the day he is a cold hard working an even keel judge the American bar association has announced this week visiting ... cabin off after\nHis credit Judiciary Committee parents last week NPR's Kelsey Snell reports her final Senate\nVote is expected tomorrow evening\nSenate Republican leaders are closely counting supporters after the sixty one forty nine broke the margin just about the minimum fifty one does needed to approve the judicial nominee in the Senate\nOnly two senators deviated from their party Alaska Republican Lisa Murkowski joined the Democrats and voting no wild west Virginia Democrat Joe Manchin joined Republicans in voting yes now all eyes are in Maine Republican Susan Collins\nShe voted to advance capital but has not yet and now ... confirmation her decision may be critical\nIf Collins or any other moderate changes their mind vice president Mike Pence will have to break the tie\nKelsey Snell NPR News the Capitol at the time of the boat NPR's Brakkton Booker observed the scene outside the U.S Supreme Court across from the U.S Capitol Grounds\nTo go to the U.S Supreme Court been up to the Senate procedural vote to move with a nominee rep governor because we're not as big as they were yesterday protesters here still held signs that read a lot of\nNPR's Brakkton Booker the Indonesian government says more than Fifteen hundred and fifty people are dead from last week's earthquake and tsunami on the island of St Louis said at the guy's Julie McCarthy has\nMore the fears of unrest and looting and attack on a trucks have diminished we are into a calmer period one week after this disaster having said that little seems to have changed on the ground in terms of people's day to day lives\nNPR's Julie McCarthy reporting from Indonesia I check in down day on Wall street the Dow is off one hundred eighty eight points this rich NPR\nSecretary of state Mike Pompeo has left for a three day tour of East Asia including his fourth trip to North Korea even as the U.S at the north are deadlocked over how do we keep denuclearization I'll pay it will also stopping Japan South Korea and China\nThe Pakistani government ordered the closure of Eighteen international aid groups have been given too much wrap up their operations we get more on the story from NPR's ... the group concludes World Vision and Catholic Relief services and others that were a ...\nA children's education and official for the shutdown threatened that help Pakistan so much multiple people\nGovernment officials would not comment on the moon some Pakistanis fear the crackdown it's an effort to my voice is seen as critical to the government\nPakistani officials have long viewed with suspicion international aid groups and foreigners in general that's come from the two thousand and eleven operation that killed Osama bin Laden in Pakistan bin Laden was identified by Pakistani doctor who claimed\nLike one of these services and others that work on top of the nation\nAnd children's education officials had to shut down threatened that helps Pakistan's most vulnerable people\nGovernment officials would not comment on the news some Pakistanis seeing the down economy an effort to my voice is seen as critical to the government's\nPakistani officials have long viewed with suspicion international aid groups and foreigners in general not friends from the two thousand in a life in operation that killed Osama bin Laden in Pakistan bin Laden was identified by Pakistani doctor he claims he was working for international engineer undertaking vaccinations\nTo hit the aid and counties Islam is at\nTimes it's the small they trace\nPolice killed his twin city suburb of Brooklyn park and posted on Facebook a body cam video the driver we inviting a squirrel day brushing this car the squirrel lying on his back motionless top generals by the young man\nFor several minutes he then we'll see animal overt stretch for stop until the score pops up and braces off\nAn officer declares scary goes you said your life scared\nI really ... NPR News Washington [noise]\n\n\n\nAttention K. you why I listeners the Arizona\nDepartment of transportation states that the state highway eighty nine is closed north and south bond between ... and that you basically junction turn off due to wash out\nThe Arizona department of transportation estimates that the ... ad about a hundred and Ninety miles to motorists trip on interstate forty state route eighty seven state route to sixty four and us one sixty update\nClosure multiple days expected on us eighty nine\nNorth of Flagstaff severe flooding has cut roadway between Cameroon and us one sixty the Arizona department of transportation is working to reopen a section of us eighty nine separate by flooding about sixty miles north of Flagstaff between state route sixty four and Kamron\nAnd us one sixty\nWith us eighty nine expected to remain closed for multiple days due to the wash out between my posts for sixty seven and four eighty one on the Navajo reservation motorists heading to page\nJuba snooty and other destinations north of camera and can take interstate forty east from Flagstaff two state route eighty seven at Winslow\nOne [noise] twenty eight teen girls night out October twenty nine that the Hopi Veterans Memorial center starting at five P. M. more information seven three four one one by\nOne [noise] monster dash October thirtieth among the legacy in into by city beginning at five thirty P. M.\nMore information is on line to eight to eight three one two three four zero\n[noise] burst Mesa youth center community a Halloween party October thirtieth that six PM in the first may say youth center more information is out seven three seven to seven nine nine [noise] many how bears up into\nThe public November Thirteen or do you hope you better as memorial center starting at five PM mowing standard time more information is out seven three for three four three two [noise] adult coed basketball event at the hoping Veterans Memorial center November Seventeen and Eighteen [noise]\nMore information is out in three for three four\nThree two\nDiabetes group is taking place every second Thursday of each month from am to Lebanon am more information than three seven six two three one [noise] poppy\nCulture and language sessions are Tuesdays and Thursdays beginning at one PM at ... legacy in more information is out of nine to eight six six zero three five\nOr two\nAnd that's going to do it for your community counter update and I'll be right back with your hope the junior senior high school sports\n\n\n[noise]\nWell because our language sessions are Tuesdays and Thursdays beginning at one PM ... legacy in more information is out nine to eight six six\nZero three five or two\nAnd that's going to do it all your community counter update and I'll be right back with your hopefully junior senior high school sports\n\n\n[laughter] [noise]\n\n\nAll righty I'm back with they're hoping junior or senior in high school sports first up hope the high school sports Opie high school volleyball October fifth\nJoseph city in by that Joseph city high school time\nTo be determined\nOpie high school football October ... versus valley center at the beach\nAnd that is the night barge maybe starting at seven P. M.\nO. P. high school cross country October six days do you invite in Phoenix at Molenbeek part starting at eight thirty eight em [noise]\nHope the high school ... October ... and ... region one\nTournament Eli Williams high school starting out one P. M.\nAnd that is there hope the high school sports up next we'll be junior high school sports [noise]\nHopefully junior high school football October tenth person to buy the CD junior high school at Cuba's city Jamie starting at three PM Anbar city at four thirty P. M. hoping junior high school\nVolleyball October night versus St Michael's fate Michael\nStarting at ... pm\nVarsity at three PM and by the em [noise]\nHopefully junior high school cross country October\nStrict but David invited to by city high school starting at seven a em [noise]\nAnd that's going to do it while you're hoping junior high school sports [noise]\nAnd for more information on all hope the high school and hoping junior high school sports\nActivities you may call nine to eight seven three eighty five one one one [noise]\nAlready and that's gonna do it for your community counter update orders friday [noise]\nAnd if there is information you did not hear states United seven am am noon and five PM when we are not community town during bent [noise]\nIt'd be a value K. you why I Hope the radios free community account they wish to continue to support our mission considered becoming ha you why I underwriter\nYour financial contributions during this move will help us prepare for an even brighter future and allow us to return to the normal broadcasting you depend on daily [noise]\nJay you why I offer supported by underwriting to get your message out to our listeners community ... missions I edited to one sentence was huge it just takes a couple of seconds to read for just sixty dollars a record your information as they were paragraph\nThirty second announcement to reach out thousands serve listeners email into like hey why I'd done that to get on the air quality but [noise]\nI'm not going to do it for your community counter update\nComing up next is your updated whether [noise]\n\n\n\n\n\n\n\n\nA man ... mine had shut down for guys remind the sunshine ran snow\n... relief and oh really where you know [noise]\n\n\n\nAll righty I'm back with their updated whether Ford is friday October Fifteen thousand eight teen [noise]\nFirst step team's Kenyan tonight most clearly alone around forty three west northwest when around six miles per hour becoming eat southeast after midnight\nBecause most of the village tonight mostly\nClearly they lower I'm forty two west northwest when five to seven miles per hour becoming southeast after midnight [noise] ... to buy city area tonight mostly clear with a low around forty seven North West when around six miles per hour becoming eat after midnight [noise]\nThey're not old St Michael's area there night mostly clearly they lower I'm forty one comment and becoming west southwest five to seven miles per hour after midnight\n[noise]\nWinslow tonight most declare their low around forty eight light and bearable in becoming west out west around ... miles per hour in the evening [noise] last but not least blacks dive tonight most declaring their lower I'm thirty nine whip palm\nWhen [noise] and that's going to be updated whether borders friday October ... ... dollars in eight teams and for more information on the weather you may go to weather dot G. O. V.\n[noise] and not dinner wrap it up for your updates and your tuning into ... eighty eight point when the ... or ...\nEighty nine point one FM also streaming online that Kay you why I dot net your Native American public radio station and will be going back to more music you're on K you why I after this brief message [noise]\n\n[noise]\n\n\n\nDo the rent for a long way I mean uh the longer ran on may maybe\nThe the anger\nI read a little you know you have a and B will bring\nOh or maybe a little nervous\nAnd so while I was just a little a very strong enough for a long term you're back now to our group and there was going\nTo pay back in\n...\nAnd and that and [noise] and\n\nThen in the street and there's a town on the band\nAnd a very common to what can I say that some things in\nA hotel and all of these and then it does a little book and they thought they were\nWhen they say you're in\nA\nLong slow or non la la la la la la la la rue mono\nOn now and I'm a non but I don't even though I'm a law that would be a danger is\nA whole lot\nAbout the end of the things you write a book where there's ... come up with\nA little bit and then my mother\nAnd the common law that would be a teacher is a whole lot about the business or a bomb and things\nChange a world where there's little come up with\nA guy on\nTop and then my mom for land and don't\nWant to talk to you but I thought I better take a lawyer and make 'em like\nI have a much time on\nThe other hand the Taliban [noise] love\nThat no one or two\nOr three or four or ... or or\n\n[noise]\n\n... [noise] the animals are dying they were being their tribal people for many others\n... by their actions and we\nShould make errors then once again [noise] she'll be known as the warriors Ringo\nThe [noise]\n\n\n\n[noise] and [noise] then\nBang bang bang bang bang bang and um\n[noise] [noise] and\nShe ran down to ... you know they go and one of the day as the boys three\nDi da\nDa da da da\nDa da na na na na na na na na na na\nLittle during the change in the job that you know if you look you know nine months after\nThe game on this coming weekend I mean even if they do but I'm\nNot I'm\nNot a fan and uh [noise]\n[noise] [noise] you\nKnow when when the time we go down in the dark humor joke about that in mind numbing event and during the\nClass you know that you know giant came along the\nEdge when it comes from a lot and then when they don't want to have two jobs na\nNa na na na na na na na na na na\nNa\nNa na na\n\nNa type in\nThe\nSame time\nDoes you know we like you know just as you are you saying you know ... maybe a mile run to the ... been a while and then\nWhen\n\nA\nLand\n\nBusiness ladder damaging\nProfit sharing orange running any you know [noise] like buffalo wild side [noise]\n[noise] oh [noise]\n\nSacred\nLiving reduced to listen to escape buffalo wild eating a buffalo roam between her and stars three [noise] follow your future looking glass\nAncestor prayers praying to the buffalo ... living with a huge even itemize feeling behemoth partner of buffalo entry into reality all life we met another\nOne\n\n[noise]\n[noise] [noise]\nOh\n[noise]\nUh\n\n[noise]\n\n\n\nYou are listening to pay you ... I Hope that ally eighty eight point one S. and M. K. U. Y. I. L. P. upper ... eighty nine point one at a project of the Hopi foundation screaming on line at K. you why I dont net\nYour Native American public radio station [noise]\n\n[noise]\n[noise] oh [noise]\n\nAttention K. you why I listeners the Arizona department of transportation states that the state highway eighty nine is closed north and south bound between ... and the two basically junction turned off due to wash out\nThe Arizona department of transportation estimate that the Detroit will add about a hundred and Ninety miles to motorists trip on interstate forty state route eighty seven state route to sixty four and us one sixty\nUpdate closure multiple days expected on us eighty nine north to Flagstaff there'll be flooding has started roadway between Cameroon and us one sixty\nThe Arizona department of transportation is working to reopen a section of us eighty nine triggered by flooding about sixty miles north of Flagstaff between state route sixty four and Kamron and us one sixty\nWith us eighty nine expected to remain closed for multiple days due to the wash up between my post for sixty seven and four eighty one on the Navajo reservation\nMotorists heading to page\nCuba's city and other debts\nThe Arizona department of transportation is working to reopen a section of us eighty nine triggered by budding about sixty miles north of Flagstaff between state route sixty four and Kamron and us wants to be\nWith us eighty nine expected to remain closed for multiple days due to the wash out between my post for sixty seven and four eighty one or the Navajo reservation\nMotorists heading to page\n... and other destinations north the camera and can take interstate forty east from Flagstaff two state route eighty seven at Winslow\nThen head north to state route to sixty four North West to us one sixty into but city and west to us eighty nine for those traveling from points out on us eighty nine the closure doesn't affect access to the Grand Canyon national park\nEast entrenched beer efforts are sixty four director of the Hopi department of transportation had motorists using state route through the tribe's reservation\nShould watch for pedestrians and for local traffic including busters and also should be aware that some stretches have sharp bend\nAnd deep great\nAgain this is an update of closure of multiple days expected on us eighty nine north of Flagstaff, Arizona department of transportation is working to reopen a section of us eighty nine ... by flooding about sixty miles north of Flagstaff between state route sixty four and a camera in\nAn us one sixty\nWith us eighty nine expected to remain closed for multiple days due to the wash up\nBetween my post for sixty seven and four eighty one on the Navajo Nation motorists heading to page Cuba's city\nAnd other destinations north of camera and can take interstate forty east from Flagstaff two state route eighty seven at Winslow then head north to state route to sixty four North West to us one sixty into by city and west to us eighty nine\nFor those traveling from points out on us eighty nine the closure doesn't affect access to Grand Canyon national park each insurance\nB. R. S. are sixty four director of the Hopi department of transportation said motorists you didn't stay route through the tribe's reservation should watch for pedestrians and for local traffic\nIncluding buses and also should be aware that some stretches have sharp bend and deep gray and that is your update on the closure of us eighty nine north of Flagstaff once again you're tuning into ... eighty eight point one of ...\nOut the upper ... eighty nine point one FM also streaming online at K. U. L. I. I. dot net your Native American public radio station [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBaggy [noise]\nNo no no\nNo [noise] [noise] [noise] [noise]\nWow what do you want a new low\nWhen I [noise] yeah I Know one day we'll learn\nAlong the\nWay they were in the little boy in a day and [noise]\nOh yeah\nYeah if I go by and do you\nKnow and that that that [noise] [noise]\n\nYeah they're going to\nDie than women do we're going to the you know sit down and do we get on the bad old enough to\nGo do gain I wouldn't have been down in my mind a magazine [noise]\n[noise] [noise]\n[noise] [noise] [noise]\nNah nah nah nah nah nah\nNah nah nah nah I'm from\nThe ... the\nMain\nThe main menu it'd be labeled as we\nCan even when you're when you're in\n\nThe game and a man and\n[noise] [laughter] [noise]\n[laughter]\n[noise] drawn up and down the\nDrain on your show\nUp in a young lawyer rational job do you\nDo oh whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa whoa Shaun Shaun Shaun your storage you [noise]\nYou know what are you a little slower or ... you really don't you know and what was your age are you waiting on\nThe Internet and and I actually\nTried for three years and years and we were actually\n[laughter]\n[noise]\n\nYeah really [laughter]\n[noise] [noise] [noise] [noise] [laughter]\n\n\n[noise]\nAnd [laughter]\nShe she can be [noise]\nYou\nKnow we\nTry to do a good man never no we don't get mad and then we got a great\nWay to get you know\nAfter a while you don't get a bad man gang or not but you know the way\nWe can go\nWay you'd let them do you know\nThey can but nah nah\nNah nah\nNah [noise] [laughter]\n\n[noise] [noise]\n\n[noise]\n[noise] right\nNow [noise] um I go out and said no way I never they leave the high plead gay guy to be my way\nThere no matter where you don't get a lot and we are already know again\nWe're way yeah I Know when you know it doesn't go away\nAnd then he\nNot only is\nIt really is no\nNo\nNo no [noise] [laughter]\n\n[noise] [noise]\n\n\n[noise]\nOh whoa whoa whoa whoa\nWhoa should be no no no\nNo one wants to know how long you know my mom\n\nCan so\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n\n[noise] [noise] well ... ...\n... ... what's going\nOn ...\nOn [noise]\n[noise] no no\nNo no [noise] how long can you know my mom\n[laughter]\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise]\nOh sure no\nUh-huh [noise] [noise] oh [noise]\n... [noise] [noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n\nMm Mm Mm no\nSugar man in the trash\nCan truly a game show three guys right thing to you and read\nIt sure is the way when ...\nWhen\n\nShe was\n[noise]\n\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\nI mean should everything that I didn't see the actual\nThan she and three you get out of sight for one thing you need\nTo see where where ...\n...\n\n...\n[noise]\n[laughter]\n[noise]\n[noise] [noise]\n[noise] [noise]\n\n[noise] Mm Mm Mm na\nNa na na na na\nNa na hearing on the train to go you don't you know what can you be interacting\nAnd then a man that me and I don't think any man you'd be traced Shawna and now I Do\nTry and they came\nMm Mm the na na na na na\nNa na na recommend that the other\nKids are hearing my thing though to do do do do is look good to be like the um and then all of my own and the reason why that nah me and I don't think any of them are really be ... to\nDo another reason why I'm working on now I think that it's time to bed\nAnd then ... ... it was being asked me did I Do know that I don't want any more than that is on the on the ...\nAnd ... and other than I Do the job then no I Do not I mean and and the ... year old a few days down in the\n... and that and then and then the\n... ah [laughter]\nAnd and and none of them have\nBeen done and in our ... uh the day and then she gets mad giant and he goes there was a good movie and said oh really yeah and then\nFrom northern Maine and listening and then then and then to stay home on that and and time again to me there ... I feel that it can be done to the extent of 'em back to where you don't know have been totally\nYeah they have been made and I'll be right there was no longer with me and then yeah\nYeah did you make right\nRan in the\nPast month and I'm a mating [noise] too young to know how does that\nTell you love can reinvent known them they are saying the general and ran into a pill [laughter] mine's Anna may\n[noise]\nUm no I live in a ... and I don't know the family and and uh you know\nI'm not a\nHundred and ... ... I think in a\n[noise]\n\n[noise]\n\n[noise]\n[laughter]\n[noise] [laughter]\n\n[noise]\n[laughter] [noise]\n[noise]\n\nI Want to do with the the three when the lead to prevent the bag in a bad out of the law need to get to hear the good she would've wouldn't be talking with me like I'm a big win a woman and the deal will play than it at the gum talking on a lonely pop wouldn't be a combination taught\n[noise] [noise] [noise] [noise]\nSure\nI Want to build would have been a fan but when the lead\nUp in the bag in a bad attitude that low when he gets he and a good she would have to talk with the plane that went on many together do a ... fan and at the GOP talking on a lollipop when I get combination taught to make the audience up I like to do the ...\n... ... what you can't have plenty to come to you again for the for the girl from around the way she\nGave me [noise]\nSo\nYou got to look like John that's why I had to dedicate at least one Rob the all the ... because the ball 'cause that's what they tell you that the Bible would we like to go with the gang just don't want to eat them you want to be put you bring up\nThe maybe the channel it really doesn't matter if you don't you know you can break on them to believe the\nWay back in the region with God you always know what the pope boy when you make demand employees you know people petty give way to put my finger real independence do your parents talking well what did you have money to play with\nMy way to\nLook at what\nPoint [noise] term\nIn your hand or even the curly which would be the Bobby Brown bought the newly please let's say you got me to believe me we have to wait for the bombing in gang stay around the way you look at the whole the whole way when you're going to be cool for you to win\nThe white do while you're watching all of the donor babble taught to them which is a world while up it's going to be part of the baby had told me but I think you hit number one at a Chinese so we know why don't we got a lot of drama to share three\nAnd a little Pamela I Love the moment around the way she told\n\nMe to\nBe\nAble to have [noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n... [noise] the big animals\nAnd\nPain\n\n[noise]\nThey'll do a little\nAhead of time\n[noise] [noise]\n[noise] [noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise] [noise]\n\n[noise] [noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n\n\n[noise]\n[noise]\n\n\n[noise] [noise] [noise] [noise]\n\n[noise]\n[noise] [noise]\n[noise]\nYeah\nYou're listening to you or what but what eighty eight point when they're very much tell you why I asked the upper ... eighty nine point when the bam project or the Hopi foundation streaming online that Jay you why I don't know if you're a Native American public radio station\n[noise]\n\n\n[laughter] [noise]\n[noise]\nBut I Do that then by the man and a mammoth all it\nCan\nBe I don't have jobs\nFor in\nA town that I can tell by the end it to me well God I don't doubt that job\n[noise] [noise] [noise] [laughter]\n\n[laughter] good\nNatured causes human relation to patrol on a global scale I'd rather hear both sides of the pay all the way Rachel voices they say when it comes to look what you say to like get a dog on the top of my life\nWhen I'm Talking [noise] about that [laughter]\nI don't know why I don't like the bad guy [laughter]\n\nDi\nDi\nDi di di di di di\nDi\n\n[laughter] right [laughter] you'll find that [noise]\nAh\n[noise]\nYeah\n\n[noise] lady with the attitude and those that were in the mood don't just stand there that it would strike posed as nothing should we\nTeach\nThem [noise]\nAnd [noise] and [noise] we're down [laughter]\n[noise] [laughter]\n[noise] [laughter]\nYou know she\nDidn't\nKnow about it today and wish I had to do but you\nKnow [noise]\n[laughter] [noise]\n\n[noise] [noise] [noise]\nOh really is you know the man I don't know this\nIs science all your love is ration young [laughter] when\nYou [noise] [noise]\n[noise] [noise]\nI'm\nNot a new day [laughter]\n\n[laughter] [noise]\nSo so so so\nSo so so so so probably own home [noise]\nSo um [laughter]\n[noise]\n[laughter] [noise] [noise] [noise] [laughter]\n[noise] [laughter] [laughter]\nThe jogger and really the trick and DiMaggio known known anything on the cover of a magazine how to change the nature of the weight\nBut as soon as you suggest that they had great Rita Hayworth have good Lawrence\nKaplan manage to study they we can do that is that we're in the mode and that led to strike\nNothing [laughter] [noise] [laughter] [laughter]\n\n[noise] [laughter]\n\n[noise]\n[noise] [laughter]\n\nOn the plane and you know that that man when when when\n[noise]\nUh\n\n[noise]\nEach each each each each each\nAJ rich countries apparently the shape that make you change the Supreme Court trying to play ... school in the way\nTo put people to buy job I wanted to when I said I'm the cat the total like Jay Kirk why they were mad at me to do with this whole roll to the hobby too I think we should say whoa whoa ... to join the run up\nAnd children in the western ally got great by the mainstream but down here the last ... to the\nOld playing by the same clothes that they they that's why today it's almost like a really powerful emotional support they told us about so you're like whoa I never want a black\nMan was\nLike you said on the low barrier my cold to go into Nashville yeah little rash and don't want\nTo find the guy was when I started traveling around what are they selling some of the flies I\nKnow why the ... the one that my job at the time to read like that but not\n... not just the the part of your prior to figure out why you don't want to support that kind of play on a hospital ... white wow we prefer Adam ... reports from\nBrett good cell or so people were no option to use it all up to my mother to prevent the McCain camp\nBrought back it was going to be a four year old boy we draw a boy in store for you on the way the fans suffering the car\nBack like I was just surprised that\nThey asked\nAbout it I saw that\nRight [laughter] [noise] oh\nOkay yeah [noise] I remember\n... brown like when\nI go to get the right and I'm not going to find out how to market\nLeapt on what you've said Trent radio ... miles above the water here we're just supposed to have the strange ... went up ... past why wouldn't you know what\n[noise] yeah [noise] [noise] our soldiers brown was going to get the right and I'm going to see how much left\nOhio but you you said safety trench radio print out the want to hear it on just the the ... with a passion watching when you're\nA poor\nMan to come back and I had like\nNo he's not a new lease\nHow and why should it keeps me you'll slash stress and she'll stop them on the bandwagon should\nStop that [noise] [noise] [noise]\n[noise]\nBut I say that about that I said I urge to pay me about talking about they backed out that's right yeah her dad urge to write about [noise]\n\nNo this is Dan and this is James and we want to give a shout out to everyone in the land and you're listening to K. U. I. eighty eight point one I'm hoping the radio she's living on my ... and I find that funny but by [noise]\n\n[laughter] [noise]\n[noise]\nOoh [noise]\n[noise] [noise] ... ... ... ... ... ... well [noise] [noise] [noise]\n[noise] [noise] well\nWhen I was in third grade I thought that I was gay 'cause my uncle was in my room straight as Russian now my base is this girl who has to be more ...\nI guess he had a point now much of stereotypes all in my head I remember when the men like yeah I'm going to literally I mean the idea of what it meant but those are like the\nThings that can have the characteristics semi waiting ... minutes to get to that says that you're going to be here with the treatment and religion may may rewiring number three disposition and\nPlay it on and on now here we go America to pray in the beer is what we don't know I look at them and somehow forgotten but we pay or bring the fuck written thirty five hundred years ago\nNo oh no no no\nNo\n[noise] and then I\n\nMet\nHim I was getting I Would think hip hop pay to make a right to use to comments lately man I can get dropped on the daily\nWe become so number one night culture from uh yeah we don't have to accept as far to the baggage we on the ... the message boards you know when we're done have you know John Ritter Illinois so much for the last ... last words from the end of the\nCollection of your picnic might deliver to walk out and sit in the human rights and what everybody there is no ... on a beer\n[noise] when I was a ... D printed\nThose words on it and the holy water and soap and its employees when everyone else is more comfortable remain voiceless rather than like a human pad their rights stolen and I might not be thing but that's not for it and you know freedom to win them right I ordered\nNa\nNa na na na na\n\nPress was like no president do ... with the ...\nIn the car going to say the people you're not in my life as you walk around the mall\nWay too late to buy pain in the world so maples rather die than me who they are innocent paper isn't going to solve bell but\nDamn good place to start now we are the things that some but every I Believe in would come from the same one underneath and saw the same low amount of time we raise\n[noise] [noise]\n[noise] no no no [noise]\nWhy don't you know [noise]\nWe were doing it and then you know to try and do you\nKnow I'm\nI'm a white man I [noise] I'm [noise]\nI'm Down to the top but there's no\n[noise] no [laughter] no\nI don't I'm not on the women in the ... and I thought it was a [noise] I don't know I\nI was a\n... well I run a\n\n\nNo no no\nI was wondering you know in in in the school or in the early days said John ... yeah yeah but I imagine he\nCan he can\nDream now who are right\nNow and we are now saying oh well that she and her friend\nReally I mean I'm In a\nUm [noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise]\nAnd again I I'm an o\n... O O\nO da\nDa da da da da da da da da\nDa da da\nDa da di\n\nDi\n\nDi\nDi young and [noise] I\nDon't know [noise] [noise]\n[noise] what about my mom\n[noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise] what about my mom and\nA new when maybe a shiny and when we come\nAround now [noise]\nAround the block you know when you'll know shows do I am no way and\nThey had to\nCall in laws now will be so many things things did you know he was so bad they can't go home and\nHe said that we really need to be on the ... flu and I don't\n\nKnow when you know\nThe answer is no way no way way\nWay\n[noise] [noise]\nNo I didn't really know what to say no no no\n[noise]\nI mean we still\nAround the world and I had you know no no no way and\nNot be\nAround the world and I can't say I don't know I don't know where he can be you\nKnow they\n[noise]\n\n\nI didn't\nKnow there\nWas\nA man a man and I don't know why you know and\nThey go to\n[noise] [noise]\n\nNo\n[noise] I don't know particularly in the\nLast two strangers [noise] I I miss the best advice on how would you do not go to me\nThere's just not my long [noise] and that's mostly about mom nice when suddenly there's\nWell there's no one wants to you know we try very hard to [noise]\nUm yeah there's actually I Do not best judge Judy I see [laughter] I'm a I'm On long enough to actually look at it I don't know that they did on the [noise]\n[noise] [noise]\nBut um I don't even need you know joined on Thursday in any it on the line I'm more interested in the news you needed I Do a lot but then again [noise]\n[noise]\nHi I'm going to do not have gotten any money on a long drawn out to make it on\nAnd on a bomb on what you mean the fact that it can be a much longer\nThan\nYour became widely on one for him yeah you've got you've got to get hurt over here the ... I just got done with a ... or ... I mean as a bumbling real or to play down from a dream come Roderick coming up with John one coming up or are you OK why one since grandkids one guard\n[noise] day [noise] man [noise]\nIn government started job I'm trying to make the sorority for Colorado you know like where you are\nI don't want to die for them and then at the same thing when you share my job I got them like right over there and they don't know personally I Would say [noise] yeah I guess there's [noise]\nSo have you back on friday but has [noise] I can go to Michael diversion or do you go to the average time [noise] and [noise]\nRather\nThan [laughter] a lot of bad language in the Senate race in St Louis Missouri [noise]\n[noise]\nI have to say that I that very short ways to raise a red shirt [noise]\nShe said they around me I tell the I'm In a way out on the bad or murder amongst\nA hearing it on the game or a a a you know how old are the only thing I Know Julie though I don't know how you move to prosecuting [noise]\nReactor [noise]\nAre you saying [noise] level and cars and I think that um [noise] I go to Janet Janet [noise] my God and our culture you have to show them around here\n[noise]\nBecause I say there's a lot of\nBad rain last Saturday re register ways to race or anything\n[noise]\n[noise] that hey there's a lot of that day and I wish they were shooting racial ... name [noise] man [noise]\n[noise]\n\n\n...\nWalked in the ... they like old remakes who you know bringing new back many hasn't made a joke could take you to watch what started turning back then if you go to\nThe white I don't mean is titled do my duty on on how you want to play by the panel\nTo download it on the whole storm on my own you don't just do the do Laurel and they don't know I tell you\nThat we just had thank you how did you know what you're saying\nThe secret like if we can I just go up by a black folks in the sixties I my check segregation woman but civil rights you know that's the problem by heavy metal von ... when the water so politically correct and my job\nOh that must be some of my Mooney you don't just do the do we will ruin it I don't know I tell you\nThat we just had thank you how did you know all the time you turn\nIn the secret like we had this blew up by a black folks in the sixties I my check segregation ... civil rights [noise] in a way that's a problem my heavy metal bigger dinner bond [noise] nine when the politically correct and my job as a bomb\nFrom the studios of the same room ... new we're been I Know Julie in Michigan we been about the mammoth and we did you think we're now [noise]\nI don't know but my ... you have to carry you said don't tell me 'cause I didn't know what I'm not Mad Men [noise] and I'm Talking about it's the talk of much to the white gays which she [noise]\nWho is the type of ... bay [noise] almost a mile from my weight my for my age I'm ... [noise]\n[noise]\n[noise] [noise] now we're down to what your rib bone dry\nYeah that let me know she gets a bunch of really playing what you\nCan say what is the ... at the game and it's like me and they seem to know what can you tell in the eye on the top ... this is my mommy what he\nDoes not happen again but [noise] no I think from the Trump no no no I get to talk of stomach don't grow and grow them I said I'm the wrong one you should come gang keep playing the man I'm hopeful\nWhen he's taken from a call when you look up the phone from the pound the playground and tell tell you about [noise]\nYou know when I'm ... I'm just\n[noise] got to work and when they go to wherever you know with the Reagan his new book [noise]\n\n[noise] [noise] no telling what\n[noise]\n\nWere again I'm now I'm In no hurry Sharon yeah yeah we\nTurn to that that that that that that that the day turn it that that that that that that\nDuring the day turn into that [noise]\n[laughter]\nWell we know where\nYou know I mean we were very\nYeah [laughter]\n[laughter]\nYeah I mean we\nWere\nCrucial right there at the mall the music coming up right here with like on July limited let's get ready to rumble\nRemembers all your ... your it is part of it I'd be hard to move I'm playing right now to do I want you to [laughter]\n\n[laughter]\nShe already put it that\n[laughter]\nAnd and as I Know that that got out and about that\n[laughter]\nNo ready for it and they're being on your own personal gain all powerful [laughter]\n\n\nNo doubt about that\n[laughter] I don't know that\n[laughter] [noise]\n\nNo no no\nNo not that bad and da da\nDa da da da da da da da da da da da da da\nDa da da da and\n\n\n\n\nWe like we liked by people buying things going\nOn in the meantime\nIt but that's about it but we've been there\nEver been in and you know we'll be in a big topic um in in in\nA way\nThat's been down there and dig and dig and in a band I live in da da da\nDa da da da da da da da da da da da da da\nDi di di di di di di di\nDi\nDi\nDi di di\nDi di\nDi di ...\n\nWhich\nBy the by the by the by the by the by\nThe by the way I Am [laughter]\n\nAnd by the time by the by the by the time\n[noise]\nBut there's been\n\nStationed out there and they\nDon't\nFollow the view that old girl was the only one do you view to to to do and they say oh I'm shocked that you always shall be\nVulgar ... that's why you know there were fewer ...\nBad ... bad way you\nWere saying oh my knees\nAnd I know that they started\nOut by used they share that guy who when you apply are that's why we've as far as we follow Dodd than a bad rap for rap next day we were young that fact fact trying we share\nThe state route eighty seven and Winslow then head north to state route to sixty four North West to us one sixty into by city and west to us eighty nine for those traveling from point out on us eighty nine the closure doesn't affect\nAccess to Grand Canyon national parts\nEast insurance beer s are sixty four director of the Hopi department of transportation said motorists using state routes through the tribe's reservation\nYou'd watch more pedestrian and for local traffic including busters and also should be aware that some stretches have chart band and the great\nAgain this is an update of closure of multiple days expected an us eighty nine north of Flagstaff, Arizona department of transportation is working to reopen a section of us eighty nine numbered by flooding about sixty miles north of Flagstaff between state route sixty four and Cameron\nAnd us one sixty\nWith us eighty nine expected to remain closed for multiple days due to the wash out between my posts for sixty seven and four eighty one on the Navajo Nation\nMotorists heading to paid each Cuba's Rudy and other destinations north of camera and can take interstate forty east from Flagstaff Tuesday route eighty seven at Winslow\nThen heading north to stay route to sixty four\nNorth West to us one sixty into by city and west to us eighty nine\nOr does traveling from point dial on us eighty nine the closure doesn't affect access to Grand Canyon national park east insurance via s are sixty four\nDirector of the Hopi department of transportation said motorists using state route through the tribe's reservation should watch for pedestrians and for local topic\nIncluding buses and also should be aware that some stretches have sharp bans and steep gray\nAnd that is your update on the closure of us eighty nine north of Flagstaff once again you're tuning into ... eighty eight point when the ... out the upper ... eighty nine point one FM also streaming online at K. E. Y. I. dot net\nYour Native American public radio station you are listening to\nKill you or I Hope ... eighty point one F. M. N. K. U. L. I. I. L. P. upper ... eighty nine point one FM project so the hope the foundation streaming online at K. U. I. dot net your Native American public radio station [noise]\n\nAny time I think yeah I ... I think also came to hang out at my age [noise] he came to me when I'm watching a man\nAnd one guy he cannot maintain among them into my mobile much and they made Julia daily naked\nBy a lot of them went on a new which I'm not the county\nThat you can buy not in like a ... plans they can be a family in my knee\nCan go much from like jaws against me 'cause\nI Know we are on the My Lai funding only from eight to ...\nTo me down for him my ancient bond agreed\nWith the ... that we don't find the\nSource Akeley have my own family behind on I tell them apart\nAnd they can buy a move along the\nLines of Vietnam and they ... me again and again I but I\nHave to wait a month on any kind of an on how\nYou maintain some respect to the baby monitors imprint is we should be able to take ownership and that meant when we are wrong\nHoping substance abuse prevention tend to provide the tools for a living every victim all my writing restricting the first in my teaching how to apply these tools daily living if you are being affected by drugs or alcohol or know of a family member\nOr friend who is we can help there is a solution to turning away from this abusive and destructive level are calling drugs callers today in Nineteen eight seven three four zero three zero zero\n[noise]\nThis is yeah they wished and you're listening to pay you why I eighty eight point one FM Hopi radio streaming online a KU why I don't ... your Native American public radio station I'm a recent graduate of Cornell University and I am out here at hoping helping with research projects and I would like to think hoping people for their hospitality and\nAll the great community organizations for the awesome work that they do\n[noise]\n\n[noise]\n\n[noise] [noise]\n[noise] [noise] [noise]\n\n[noise]\n\n\n[noise]\n\n\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n\nOh sure [noise]\n\n[noise]\n\n\n[noise]\n\n\n\nSo they\nDidn't dream blue gives me the donor mom female a loser dentistry busy the chance\nTo see the mom and they they could be mom you know right next to me [noise] levy among the remaining\n... mom do that and he and I\nAre going to be a good thing um [noise]\n[noise]\nOf trouble in school [noise] [noise]\n[noise] oh were you on\nA cold or\nA um a really terrible\n[noise]\nNa na na na na na\nNa na na na na na na na na na na [noise]\nUm I'm not I'm not I'm not um [noise]\n\nI mean we were little things you know we're not really [noise]\nUm I'm not I'm not I'm not [noise]\nOh oh oh oh oh oh oh\n[noise]\nDo you why eighty eight Twenty one and a bummer that everyone wants to make you think\nWe should wait for a new thing to me you know yeah\nNa na na na na na na na na na na na na na na na na ve\nGod when it comes down to me that they [noise]\n\n[noise]\nMm I don't\nKnow I mean from the by the way I think I can\nJust stop [noise]\nWe had to go up to me I had to pay that they can\nActually [noise]\n\nGuy come\nDown on me\nHey you know I Hope you\n[noise]\n... about where you know we don't bother with no come about I Know I Want to God and there's one down and the thing I Want to leave a cute said I'll\nProbably be tried to be in a long way to ... all one word of mouth na na na\nNa na na na na na na na na na na na na na na at home [laughter] just by\nRobert hone in on\nMy own in their God I mean I\nDon't know who did a lot of my own my own\n\nThings go wrong which is my third of the ... no matter how are you in the little one they want to Don ... to do that I'll probably\nTry to do some beer and brewing in June\nJuly August ninth grade and then all of a\nMonth or even by ... by by by\nMy own and the guy in the boom boom boom boom\nBoom boom I don't know\nWhat God made me I don't know I Know the ban or no right to\nSay the email when you want me knowing you won\nA rather than the one who bought out while I'm a ... you looked at me\nYour email when you go on a new one you\nKnow [noise]\n\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise] [noise] [noise] not\nAt all times and morning a great time caller I had a [noise]\nA million miles no [noise] [noise]\n[noise] yeah\nHa ha ha\nI found a way I'm going on in the Mumbai Oh thank God I mean he didn't get a little\nBit I think that we\nHave plenty\nOf\nRoom for a job for a\nWhile ha ha ha ha ha\nHa\n\n\n\n\n\n\nHa ha ha ha ha\nHa ha ha\n[noise] [noise] [noise] [noise]\nOh oh\nOh oh\nOh oh\n\nOh oh\n[noise]\n[noise]\nOh oh oh\nOh oh oh\n[noise]\n[noise]\n\n[noise] been injured in Diane we've\nBeen on to what they want they will go away and then she died in the deep end you know she said oh and\nBy that I read I can imagine like a bad a diet but the thing that battle cry because I have no idea and [noise]\nI've\nBeen around that number\nIs Diane Diane\n... [noise] like I don't know I Am [noise] [noise] I don't\nI don't know [noise] dream that one and three new that they do all that at the book that you know I [noise] he called me the most money than the man\nI [noise] when I read I gather died and not that bad side of things that are part of it I guess I don't know I Am not [noise]\n\nYou can come to mind\n[noise]\nYou know and you know how you know\n... [noise] and I am I Am tired of the [noise] [noise]\n[noise] [noise] I\nMean I Know I don't know\n[noise]\n[noise]\nUm ... I don't know that we know now we are you now you know\nThe the the I\nHeard they may go down to read but we have now we have to [noise]\nI don't know how\nHe\nDidn't even [noise] they [noise] they they said\nNo haggling major things now when I said no no no no no no no no no he's\nNot really what\nI'm trying to Rob how're\n\nYou doing it [noise] [noise] [noise]\n[noise] [noise] then\nYou'd be tied down by wearing a crowd and maybe try\n\nTo describe the new the new or listen decay you why I ... went on FM Hopi radio dreamy on line a KU why or dot net your Native American public radio station shut up to my dad New York much family in Las Vegas Arizona ... K. you why I Hope the radio\nAll the\n\n\nWay back in the new age\nIt's only back in the near\nNo no no big it gave me the\nOnly way we're not clean up the last night we just\nCan't I Can't\nSay it again I\nThink that she said whoa whoa whoa whoa whoa whoa\nWhoa\nWhoa whoa\nWhoa whoa\nWhoa whoa whoa whoa whoa whoa whoa where they're still don't want to do it but\nYou know what I get back to you know what\nWe're saying what the\nPeople who make a point when we get the right thing to\nWake up at the same\nWay that\nThey were\nLike oh okay\n[noise]\n[noise]\n[noise] [laughter]\nYou are listening to tell you why I what Bela idiot when one F. M. K. U. L. Y. L. P. from one can be eighty nine point one F projects the Hopi foundation screaming online at ... dot net your Native American public radio station\n\nAnd my my name is new and rainy day you\nDon't mind I mean your brain can can\nYou come back we're going to be you know what I feel strong brand new when they come down to nothing about the fact that um\nOh I don't know what you're\nSaying I can say oh okay\nWe'll\nCome back or what what how I feel very\nDrawn bring you went to my right down the road are what you bring about among friends when you read about him to keep me and what do you think you know why anybody would have liked to do with your your market they won't ever\nDogs all my body so luck in your life I won't even when when your dogs on my body and my dad and my\nMom told me\nToday and Canada Day on the campaign is that I don't think that\nReally carried\nSpraying it for a long time\nAnd I love the way the job you know there we are we right okay yeah I'm Sorry I\nDon't live down there and I'm not going to make you want\nYour mind when you're so lucky you are like I won't even women on friday when my dad and they\nDo during the\nDay and Canada Day I'm like I don't care they\nNeed me into a lonely corner of the ill moral wrong man you need but maybe you can yeah\nDogs on my body or do you make your life when\nMy\nMom told me to say that again and again I don't\nKnow I'm like\nOh no no no\n\nNo draw any law Jang who\nCome to the\nCrude drag it no longer\nBe a bad thing to do\nWhat I\nDidn't know\nJulius come back home [noise] [noise] no\nI'm not in a car\nBomb nine naming [noise]\nJanine di da da da\nDa da da da\nDa\n\nKnow my my ... year so their strength maybe John and how did you get\nSo I'm not sure how long do they know that I'm lying on the line you know\nAnd you know I don't know what I Do\nRemember nothing to do with like the guy who made you brought your bank I spent the afternoon on a sunlit but John come and go like a life time then on the band that you're not agree to begin to leave him alone for a lot of work with the ball out of work do please\nGo my separate way and I do a better and better and for our dog we don't get a bigger and bigger and bigger far no longer do that that if\nYou turn your mom bombed out on the money no doubt about it\nOn the Internet and oh no\nNo no no no no\nNo I Know\n[laughter]\n\n\nAnd he would not be the only thing we don't have to get\nBack in the ...\nThey had to rely on the computer that changed me you know you can ... men and women you know what happened you\nKnow and talk\nAnd ... and you know we don't have to be able to come in contact me making the common\nMan because they\nMay may end up being bitten by a few times and I can't you can't\nStay in touch we don't need on how\nThey can hang around my garden and you try to best\nYou can and maybe you don't have to do\nThat you knew they were paying magic weighing exposure lead on June when we come to me me\nMe me me me\nMe me\nMe me\nMe me and the man in the journal and how\nWould it be man you don't have you know what to do just that and so on and then ... we don't\nDo the common man come\nUpon a\nTime limit Japan\nJapan\nYeah the gum may come to the same\nKind of gone away and how much do we know what you're saying\nI was like oh man\n[noise] [noise]\n[noise]\n\n[noise]\n\nOh we yeah we are going to\nCome to my\nMom I cannot be that many new into the\nCountry\nAnd the [noise]\nAnd then you know we [noise]\n[noise] [noise]\n[noise] [noise]\n[noise] oh\nHe's a rush\nTo get\nOut there\nAnd we're kind of glass and\nThen [noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\nMy name is ... ... ... you know when I got I got indicted he gave ... told me that\nThey will come when when my mother [noise]\nMurray\n\nHow are you\nIn one way you\nKnow because we really\n\n\n\nDon't know [noise]\n\n[noise]\n[noise]\n[noise] [noise]\n[noise] Mm [noise]\nOoh oooh oooh oooh oooh oooh\nThen it you know you don't know maybe we should go\nDown down down down down down down no no\nNo no come on these you know you are you know they don't they\nDon't no no no no no no no no no\nI Need\n\n\nTo learn\nTo tell you what do you tell you how do you\nDraw\n\n\nThe line is you know maybe it'll go oh you know no\nNo no no no no no no no\nI haven't done a lot of uh you know\nI don't know\nHow do you pay for\n\n\nThem to\nTell you how do you tell you how do you\nDraw\nHow do you have you know how'd you how'd you\nGet the money\n\nFor\nThem to\nTell you how long you know you don't want you to\nGo through\nWhen you don't mind you know you don't you know\nI'm\n\nNot from him and I and my the one now but I Know my style I too am behind my to\nWant to know I'm a little more than ... ... national peace tiny Seventeen tiny Eighteen my name is ... my name is Tony I'm into I Am confident that religious somewhat but me I Am twenty Seventeen tiny team is helping and my platform is\nCultural and language is that we should\nNote there were other than mine the ones that make ... million on like the one the biggest online now my son's in\nTwenty Seventeen twenty eighth team is the first day and then I Am ... I Hope you name it up and see I Am at the core inclined and I am from one country I Am twenty Seventeen twenty eighth team is hoping for the tendons\nAnd lifetime primaries trial intervention now you're in her name\nAnd will be much of a neat guy can go to the sun much ... than a net\nHe doesn't Seventeen doesn't Eighteen missile thinking I'm Single yeah I Am ... in the village of smoke on me and I and the two dozen Seventeen he doesn't Eighteen taking attendance and my class by ms and you know one of the meat and I am I still see I'm ...\nI say I am a I'm a ...\n... yeah now the continued to Liz I'm happy like having a good thing as positive thoughts and happy heart\nYeah no ... no nope I'm not in the net he doesn't seventeenth doesn't Eighteen missiles that can I can I can go yeah I Am ... and the village of smoke let me\nAnd I and the two dozen Seventeen he doesn't Eighteen taking and my platform is now and then you know I Am I still see I'm ...\nI say I am I I'm Glad I'm not like a gang is ...\n... yeah now the continued to Liz I'm happy like how they get they win positive thoughts and happy I think good care of yourself and your family\nYou are listening to KU I I ... well a eighty eight point one at and and K. E. L. I. L. E. up every month that the ... ... and I hope the United nation dreaming on line that came I dot net\nNative American public radio station and it's really\n\n\n[noise]\n[noise] oh oh oh oh\nYou mean million reasons to let you go get me a million reasons to quiz show\nMe a million and give me a million reasons given me a million ... million reasons it had a how\nTo run for the human mind the ... when you\nAnd me and many when you give me a million reasons given me a million ... million reasons\n[noise]\nWhere do you know the the the new on the floor now and [noise]\nThe day the ... the\nOne I did see [noise] and I'm here and I don't know man I could write the debris and to\nMe a million ... million reasons\nGiven me a million ... million reasons than if you tell them that you might even me you know even Batman which leads me to me a million we'd give me a million and then me a myriad reasons among many reasons\n[noise] oh no\nI don't know the and we are now [noise] well [noise]\nMentioned by well are you are that bad I Will not do that or\nThey plan do piano by hanging out [noise]\nDo you ...\nWhere do you buy our guys [noise] bad or\nWell in China but I was around [noise]\nWhere\nYou are listening to tell you what I Would do that any wouldn't want to spend and K. U. I. L. P. a promotion be eighty nine ... project of the foundation streaming online at the Y. dot net your Native American public radio station\n[laughter]\nYour coat on it\n[noise]\nWhere\nYou are listening to what I Would do that any one of them and say you why I ... a promotion company eighty nine and ... and project of the ... foundation streaming online at the White House dot net your Native American public radio station [laughter]\n\n\nYour coat on\nA brand but yet we just found them in the new X. men get you know we tell me about\nYour Donald\nI'm afraid about driving up the gravy on my end up in a low low um among the world we live in the ... century trailer dress up and\nThe na na na na na na na na na na na na lab while\nI'm staying in the Atlanta [noise] [noise] worry about that for the great how much\nYou know\nI learned to keep all over my house was all know that when you come\nOver me know Georgia I must be a sports show so much we can be [noise] don't\nGo on top of the great thing you might end up in the world that we ... we got to learn either a judge or open\nI grew up in the lab that a lot of hope and then I\nLooked at the lab laugh a lot of objects lab to God and the ... [laughter] in la la\nLa la Santa and how long\nIt would be oh why oh why oh why oh why oh why you know\nA lot [laughter] a lab and [laughter] and then\nThe la la la la la la la la la I Want a\nWay of saying well we all want to remain really don't feel like [noise]\nYou know what I'm saying\n\nThat they need oh my God you\nKnow [noise] I Know\nYou guys do you [noise]\n\nAre you my mind is real clean bill I'm well I'm a week and my dream come true when do you like Julie we knew\n[noise] you\nKnow now when the main thing along they get along with the banjo\n[noise] than than\nMe I don't know how do you\nKnow\nAnd I'm not going to get a new\nOne\nDay we might have a ... glow in Hawaii when the Beagle now\n[noise]\nThey did it all depends on who the man do we know Lauren may be\n\nRead on the back page you know getting you know\n[noise]\n[noise]\n\nNo you know [noise]\n\n\nBad guy\n[laughter]\nYou know love well in my in my view\nA God [noise]\n[laughter] [noise] [laughter] ...\n...\n... yeah yeah\nYeah\n[laughter] [laughter] [noise]\n[noise]\n[noise] Mm\nYes he is ... ... ... you know a guy named Dan you're on the little guys\nGot it from\nMy ... [noise]\nYou know the young man no\nNo no no no no John Madden dry up and down\n\n\nHere in la du\nDa da na na\nYou don't [noise]\n\n\nI came up with all the cool thing was\nThat one way to tone up and I suppose you know the way the\nGovernment may mean buddy spring nobody does nobody rainy about in the middle of the rainy about even though the body\nAnd your body [noise]\n\n\n\nMade me more low maybe somebody\nSpring you buddy mumble the mail that don't nobody bringing buddy mumble where in the mail that buddy buddy [noise]\n[noise]\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise] [noise] [noise]\n\n\nOh no no\nAnd I got\nThe right and you\nKnow the the I Know\nI mean I Know how much the man I got a family and I yeah [noise]\nAnd I got I mean no I didn't even on the plane as though that you know you will remain will make a meal\nA day I Want to take a lot of the\nUh uh\n[noise] yeah you can do a little bit over here\nOn a friday and then\n\nThey may may and that meaning and aiming I Know\nBut I Know I don't know why\nDo you need a\nNo no not a big fad in being a\nFan of being in a way I Know that you will remain really big on me you\nKnow I'm not for me I Am\nA I'm a I'm\nA man and woman I damn man you may not be working\nAbout do we get me to be with me I wouldn't do much you've made in our town right now but when I met\nOne young in the springtime we will give you ... when you have been\nA well done and\nThen [noise] I guess then then bang you know\nWhat I Do go to bed\n\nI met a man with\nA new one guy and a man thing and make them more than you do\nThat though it\nCan be a new one and the man banged up out of the\n[noise] [noise]\nOh yeah I'm\nI [noise]\n[noise]\n[noise]\nAnd then [noise] [noise]\nI didn't tell me more than a\nHundred things when I think it will it all and then when he um [noise] what do we have\nA good time Well Jane nice hot again and again [noise]\nYou know\nAnd then there has to go oh oh\nOh oh oh oh that's a yeah I\nThink uh I like the ... and as I Am sure all the\nTime I'm Jan Jan Jan how um [noise]\n\n[noise] [noise] [noise] oh I don't\nHave\nYou know one of the\nElder then [noise] and so I don't know\nWhen my\nSon in law and\nNo I don't think so wrong like\nBuddy you're still goes on to another one I don't know the ones on me me neither I nor does the Bible na na na\nNa\nNa na na na no no no no no no no no no no no no no no no no I\nHear your opinion on\nThe regular news\nBut the live music I don't know what we need some work on the line I mean it'd be like no no no no\n\nNo no no no no no no no no no no no no no no no no no no no no no no\n\nNo\n\nNo not here to stay with make one point we saw the\nThing I ever wanted to know when we don't want to know the line one female lead a life on the ground\nYou\nKnow no no no no no\n\nNo and I know what I Am [noise]\nFor a\nMan who\nMay know we're all we're heavier the na na na ve\n\nNo words no word yet have you read a lot of you\n\nKnow using ... going to grow up they learn to go to John in the\n\nEnd minoring Mars argue in the midst of the\n[noise]\nIn mind drink red mind green to argue he moves on a busy [noise]\n\n\n\nI think that\nIn mind very much in the midst of the\n[noise]\nIn my dream read my green [noise] I ... that would be [noise]\n\nYou\nKnow not to own a dime on nine\nOne of the mind cost\nA lot [noise]\n[noise] [noise]\nUm [noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\nNo no no no no no no no\n\nNo no no no no no no no\nNo the out of the doubt and her lungs and then you're not\nYou know what I Want to know [noise] nine\nOut of the out of the ... and you know\nThat\nNumber ... runs in my mind that I wear name well now we know what I my\n[noise]\n\n\n\n\n\n\nOut of the of\nThe [noise] now did you hear me called a ... [noise]\n\nI don't the out of the [noise] ... yeah I mean you know you\n[noise]\nSo now you're in\nGreen and I'm not you know what you want to you\nKnow [noise]\n\nThis is Clinton entered and you're listening to kill you why I ... for one\nOf them who we're a year scheming online at ... dot net your Native American public radio station the part of the ... the foundation and you'd like to give it a shot up all my family ... lake New Mexico and do the mechanical is where I work at so thank you\nWell she\n\n\n\nDid it in\nThe [noise]\n[noise]\nI don't know\nA lot of bad that I I I\nI I I [laughter] I Know [laughter] [laughter] now\nThat that's\nWhat I [noise] [noise]\n\n[noise] [laughter] [laughter] no\nI\nDon't know I I I I I\n\nI I I I I\nI Know\nBut I thought well I'll tell\nYou are listening to tell you why I heard that like eighty eight point one S. and M. K. U. A. I. L. P. up at my copy eighty nine I went after him projects at the Hopi foundation streaming I'm I ask you why I dot net your Native American public radio station ...\n... ... ...\nMy mom the nine one one\nGuy by the James Bond movie\nFrom a diner in\nOne night and they know what role than the drama Mad Men don't then\nOh a long long time in the same way about the drama of a man and a lot around on\nThe main man on the line the man\nWho in the right thing to me\nAnd my ... my shoulder and well you\n\nKnow\nLearn to do a man no no no not a man\nYeah blonde none none right now they're getting news or\n[noise] um well mine mine learned that in the room or prior to my mom used to be non\nMan you're too you know my mom\n\nOr a\n\nLow ...\n[noise] [noise]\n[noise]\n[noise] [noise] [noise] ...\nLow levels of dry\nOr in the last ... a\n... a\nBlow to a a\n... and ...\nAnd ... and\n... to all the\nSize of a a\nA a yard and\n[noise] and\n[noise]\nThey're uh [noise] uh [noise]\nUh\n[noise]\n... [noise] [noise]\n[noise]\n\n[noise] were [noise]\n[noise]\n[noise] [noise]\nYeah\nYeah yeah I Do love around\nUm\n[noise]\n\n\nYou are listening to KU why hotel a eighty eight point one F. M. N. K. U. R. A. I. L. the upper among copy eighty nine point one FM projects so the ... foundation streaming online at K. U. I. dot net your Native American public radio station [noise]\n[noise] [noise] [noise] [noise]\n... yeah I'm willing to take it any way it's mainly made it may be they gather we can get some with it but he says there are some though that you know the ... who's maybe we'll make some ... me myself I got nothing to do ...\n[noise] [noise]\n... yeah I don't have\nA plan to get a than a human being would have been at the ... the menace to say there's a little bit about what I did as well just across the border and in the city you and I can get a job to you and it would be to be\nLand and uh I Know me\nAnd I think that\nThe you\nKnow I mean\nI'm like no I'm like no\nOne I'm a\nMom and she said [noise] you know and I\nMean I'm a\nI'm a line\n\nThis is harder brown from ... New Mexico and you are listening to the Y. I. eighty eight point one after them opiates radio remain on line and Jay you why I got that far to all my friends in relation here at Opie land\n\nNo no no and then new\n...\n\nWell no no it's the\nSame at war for\n... man we may do\n\nNa na na\nNa na ...\nMalls no shit man\nRyan loan and then let me know\n\nMany times and then he done about\nYour money\nBack for a\nLong line new\n\n\nLong long time for a long\nWay to\nDo\n[noise]\nBut\n\nNo one\n\nMan standing\nOn your own home about a month for a long\nDay we ran into\nA\n\n[noise]\nA ...\nOn the road again in a band want you to get on the road again a rabbi none of those may unity and then like when my brand new way to get on the road on again off the road again\nDo anybody but I never ma'am ma'am bang man I may never see again I'm On my way to get on the road again on the road\nWe're going down a highway one way or the ... from around the world and certainly in a way to manage our way\nDown the road I yeah I just can't wait to get on the road and yeah rabbi ... make enemies with mom and my husband and I know when they get all around the world would again\n[noise] [noise]\n[noise] [noise]\n[noise] on the road\nAnd they're not going down the highway one way or the ... is that the world in Syria now winning and our way\n[noise] Mm [noise]\nOn the road\nAnd my family are we going down the highway one way or the number is that the Internet now when they\nFound a way down the road again yeah I just can't wait to get on the road again\nA lot by love is making music with my branding Iran we get all the rules on your bag and we all know room\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n\n[noise]\n\nIt's like such\nA big line oh\nNo no\nNo no no no no I'm\nStill\nLooking for a really nice and\n\nMany of our\nOwn on the line\nWith\nDown\nA little uh a lot of\nThe whole way down\nA little while I'm On my way don't really have a\nShe put me into\nA ... ...\n... and no\nOne knows me they'll say oh All right\nBut they don't try to make a run for a bank you're running down kind of tell me I don't know when you got\nTo draw the line Joanne their way out of your window and I don't\nThink I read it\nYeah I mean they they\nAre learning I'm All right I mean when you go in a row now than I Am fine but I think you're right now in the way\nI mean when you got to try and\nGet your name right now I'm Down in Orlando way that it may never know what I'm doing\nOkay man\nOh there's a lot and I go down\nAnd then and then I go oh my God\nI Know what I mean I don't get it right now\nThank you know I Know many there'll be a long day and I wonder when you're young man don't gain weight knowing where are you\nSaying oh man oh\nWhy oh God\nOh my God oh my God oh Ron\n\nI'm a ... and\n... and a man and then they can\nWe go back and try again all riding around in a way of getting\nMarried and bring 'em in the nine guys on the line then readjust sarin and one guy one day and then they\nSay they are saying\nOh my God and\nI Know you're asking me out and drink and drink and drive\nIn and then we don't get it I mean do you think\nOh I'm I'm I'm\nI'm\n\n\n\nExperimenting and conquest the jail all day but he then new destination in may there now all they believe in or at a day and then they\nAll they believe in LA and I think the real world they're playing the\nGrant conger or the number and get the good guy to be read and I don't I don't know why they're not\nAlone by and I did it play for you very age than when you're in it the nature of this thing up\nOur our\nMain Rene ... our our ...\n\n\nI\nDon't know I I I\nKnow that that's not a\nA R\nO\nL\nHello my name is Pamela ... with the hope you bet never services shout out goes to all the animals on the reservation a pet owners next\nHa ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha\nOr or well\nHello my name is Pamela ... with the hope it never services shout out goes to all the animals on\nThe reservation a pet owners make sure you take care of your animal dogs cats horses cows sheep they all needless to you are listening to K. you why I eighty eight point one at them hope he radio coming online at K. you why I dot net thank you\nPull Graham darn we're done or wait birds sing to narrow\nWay Lenny Bruce not tore\nMm I didn't hear down more on the wrong thing is I'm not we run no dreams from my my guy or an environment where the government would hire John backside element in every with the memory or now you are\nMuch more than that one time trying to cross my mind I'm no longer time to go on the line by treating it rains dying\nOn me and you know you know when we see in the end of the world around you know any time you buy\nAnd [laughter]\nWe we our ... will be gone more and more like a mom or your your your child will get here you don't want my morning Miami motor my automotive center where you live in Canada wine and more now than I Am wondering I'm like no no no no we're we're renting\n\nNa na na na na na na\nNa na na na na na na na na na na na na na na\nNa na na na na na na na na na\nNa na na\nNa na na na na na na na na na na na\nNa na na na na na\n\nNa no no no no no one you know they give us a long\nWay [laughter]\nNo no no no\nNo no no no no no no and you know [noise]\n\n\nAnd every now\n\nAnd again in a long time and I have no\nRight way and\nYou know they are at a bar and\nThey may not want to read\n[noise]\n\nDonnie and Donnie ... [noise]\n\n[noise]\n[noise] I'm\nNot sure\nIf\nYou are listening to K. U. I. ... eighty eight point one F. M. N. K. U. I. L. P. upper ... eighty nine point one Afghan projects the Hopi foundation seeming online at K. U. I. dot net your Native American public radio station\n\nOr we're [noise]\nWe're we're we're ... or ... or ... or\nWhat [noise] [noise]\n[noise] [noise] [noise] [noise] ...\nIs why they grow up on the chopping it but I didn't want you to what the hell did we miss the my one of those ... are the one we weren't going to rip the is reaching out to find the while\nIran hope we don't want to end the lead over because they want to be an ally ... where where\nThey go one on one day they both joined me these people will allow it was like well\nI Wonder I Wish I knew all wonderful wonderful people one ... one of my when I read\nI don't\nWant anyone in it and then one day and no one would\nGo on the other thing I don't know what were the were just so they never know what to do what you do with what we think my wife you know a lot of adult agreements or\nJust you know I think what shall I don't drink and I was\nWith the logo don't don't do well oh Laura oh\nWow wow learned or we'll go whoa whoa whoa whoa whoa whoa whoa\nIrwin or whether or not want to know where we're all one word on hold on to the ...\nHour [noise]\nWell all of them get a hold on to the polls there a lot of all I don't know why I learned I learned oh why oh\nWhy we shall we say hey why oh\nWhy not why I wanted to point out your ...\n[noise] [noise]\n\n\n[noise] ...\nWhat is right about six to eight hours toys\n... the my bank and mild Jacquie written by putting a ... like ... where the risk is reaching out to you when you do what we do end up seeing what the almighty and language pleading\nRefined gay and gay or shine\nThey both my law which I don't know some people will look at what point\nAre worth a shot in the fall when when one which I bought some guys in one shot people my bone will allow the prequel like on my\nPhone I'm sure you don't know if he goes to ... oh\nWhy\nOh no I'm a I'm a I'm not on our on our own\nNa na na na na na na\nNa na na na na na na na na na na\nNa na na\nNa na na na na\nNa na na\nNa na na na na na and ...\nYou are listening to okay you why I also uh eighty eight point one F. M. K. U. Y. L. E. upper among Coby eighty nine point one FM project the Hopi foundation screening online it came why dot net your Native American public radio station\nAnd a two and a half an hour\nAnd a half an hour and a half an\nHour job no matter what\nAnd uh and na na na\nNa na na na na na na na na\nNa na na na but we're we're going to have to\nBring you go and do your own or ... you know about a a you know around today nobody on January issue how\nNa na na\nNa na na na na na na na na\nNa na I got a yeah I've been you know and that's how I met a man I don't want to like I don't know that they can stretch out for you to go\nAway and I know na na na na na na na and AA a on hang on\nOne every now and they're always paying ten and a\nHalf and then I and I had a and and\nWhen I Know what why not try to clean up you know\n... on the sidelines man from where you need them on June ... right and and I'm Don ... that's why my ground a na\nNa na na\nNa na na na na na na na na na na na na na\nNa na na na na break away and and and I wonder though you know I have a Gmail\nRight hand and I know Batman jam and na na na na na na na na\nNa na na na na na na\nNa na na na na na na na and all\nThe time it\nWas\nAn honor to call you\nA\nBill to grow a\n...\n...\n... ... as a\nNew New Jersey so does received today ...\n... ... ... ...\n...\nWhen we come back away oh ... to borrow\nA maybe\nA new for us to do our big to borrow just to have you know where he\nGoes all the usual repressed\nOr the so called ...\nOlder chair withdrawal more for a long and you know\nOr tell me how you can be good you hear your new some ... ... I don't\nKnow ... ... ... oh I miss my best friends and talk to him about to borrow\nMoney from you today\nOn the new ball rolling hills of view but when\nHe was a\nAround loop so calm enjoy her own career what's wrong for a\nJust cause I Know na\nNa na na\n... to\nDo our birds when you grow up to\n... when\nAll the rules are doing\nA\nGood day\nOh\n\nReally oh\nWow [noise] [noise]\n[noise]\n[noise] [noise]\n[noise] Mm [noise]\nWell um well\nDo\nYou do well to be gone well well and you know I don't want to\nWay around and ran on\nThe ground and hours and then on the phone and man and\nA new ally na na na na na na na na na\nNa na\nNa na na I'm\nTurning on\nAnd on a way to do in a way that we know for a week now and the way how many\nTimes over after some bad or not that we may be a ... that we\nOnly\nHave a family and and I and I\nAnd my\nMother told me a chance that the uh um Angelino while\nI\nGet your way I ordered by the nation my job gives me a lot\nIt gave me and it comes to support my family it gave me purpose\nBut the second hand smoke they're treated more severe asthma attacks infections and a lot of damage and I never smoked it was so bad that my doctor told me or shouldn't work there anymore to quit my job but the damage is done\nNo I'm going to say I can't do much of anything I used to love to do I do refer used basketball anymore\nDon't run lift weights just too much more about it they instead of taking breathing treatment or oxygen I guess you could say my job gave me a lot so let me give you to know what people tell you that working around second hand smoke you're say\nSmoking affects more than just your health if you or someone you know ... to quit smoking call one eight hundred quit now a message from the U.S department of health and Human Services and see the\n... ... ... ... ... you're listening to you\nOf anything I used to love to do a ... basketball anymore I don't run this way it's just too much for about three dead object breathing treatment or oxygen\nI guess you'd get straight my drop me a lot to let me give you to know what people do you do working around second hand smoke you're\nSmoking affects more than just your health if you or someone you know on screen all to quit smoking go one eight hundred quit now a message from the U.S department of health and Human Services and see these ... ... ... ...\n... you're listening to your world music station pay you why I eighty eight point one of them\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\nHey James na na na na na na na na\nNa na na na\nNa\n\nNa laying on my knee and [noise] we bring me\n[noise]\n[noise]\n\n\n[noise]\nAnd change [noise] ... [noise] [noise]\n\n\n[noise]\n\n[noise] [noise] [noise]\n\n\n[noise]\n[noise] [noise]\n[noise]\n\n\nAnd uh\nWe're\nVery very very very very very wrong we're no no no no\nNo no no it is over\nOver over ... author or da da da da da da da da da da da da\nDa da da da dum la shocker talk which are on the\nJob and you know those are urging Richard Gerard Gerard Sanacora\nThey they do they do they do they do\nA merger journals are\nJumping to court every time your chair thrower or birds or\nSugar to go live in New York or wherever I go to Bob Corker nonetheless Richard Pryor show no I'll I'll go oh God no less Richard Pryor show\nI no longer go over there on the oh oh oh I Know there is no there is no longer over\nOver y'all know bomb or what do you agree John John Rocker very da da\nDa da da da da da da da da da\nDa da dum la da dum la ... you know walk or maybe\nOh wow that's a big bottle shock to come over here because I was young and you know what was done ... years are jumping on the rise you're young and and you know walk but not any\nJohn with us and we'll\nGet around all day and paying them maybe only ...\nMen in black and white man yeah we are allowed\nTo read and black and white man it'll be a lot of\nPeople did not go okay well you know John what time it takes you might not know about that\n[laughter] a\nGood thing then is there\nA lot of the way the rest of the last\nJob well I read you know one of your blood they annoy the bitch replenish the Libyan rebels right in the long run can white ... raised me and I'm Glad that might not agree with you know to the general long shot and they're not trying to live or die\nBy law it was like well what's on\n\nYour mind today their game I did they send you a nine\nHole\nJog guy long do they do the job they gave us no job no they didn't mean dogs will do we like\nTo do what they will send me mad\nMen in black and white man yo yo La Guardia but now that people can read mad black and white man\nYo yo you know\nI Can't think of it in every day and then the other way and you know go get a job\nAnd they will love that ...\n\n... ... ... Mm\nMm\nMm\nMm Mm Mm the\n... ... ...\n[noise] I'm\nAgain I'm na na\nNa na in\n\n... the ...\nI didn't know and I I\n\nMm Mm Mm Mm ...\nMm nah nah nah nah nah nah nah ... ...\n... ... ...\n...\n... na na na na na na na ...\nNa na\nNa na na na na na na na\nNa ... and ... and ...\nNo not in my ... and ... na na na\nNa na na and they they were ...\nRight ... ...\n...\n... ... ... ... ... ...\n... ... ... ... ...\nYou are listening to KU why the la de da ... was at and\nAnd get your Y. I. L. P. upper ... eighty nine point one at a project up the foundation streaming online at ... why I doubt that your Native American public radio station\n\nOr a or in the um the whole and and I\nWas outside of the guys who have them all the time now why don't you know my ... year old ...\nDown the line anyway and when the Chinese way\nAs you say in the in the middle of a challenge and I mean she can get into the Diane I'm\nWanting to share you know you know I just think that you know\nBut yeah I don't know what I Am in\nA car service that they have a daughter and the thing to do they go\nTo die every day and we see a lot we have a job last time you know ...\n\nWhy am I right now you were raised\nIn the last one was you know what you do from time to do what I Would say that the woman the butter yeah all the\nWay that they don't they know when you go around the same in jail in low lying in wait\nA minute or what do you think you can do on the land and your mind you know a bad day or two [laughter]\nBy you know the\nOne on one day [noise]\nAnd I learned\nI found a way you know in our ... our long national\nNightmare oh hot flash and see if he doesn't go out and share the information that you know I think they do though I mean yeah I\nCan go next to Jerry Lewis is going on around them late but interesting in my way\nA lot of readers room in the ... that you allow Mormon rain ran around her and I do um we we were going on and\nI'm\nOh no no no gain the\n[noise]\nYou\nKnow the\n\nMan who is in them and the other day\nThat the girl that I learned a\nLittle town name all the neighbors\nThey read the law\nAnd the man a man\nOr woman all day\nLong\nAnd it all the\nWay and maybe go in and\n\nDay or two\nMain goal of snow and then he\nAnd a bit a little bit later and oh yeah yeah\nMe\nAnd then now\n\n\nThan they lay low and\n\nAnd um then they do that in Philly now here in the day\nThey were slow\nDown\nThe road or da\n\nDa da da da da da\nDa da\nDa da da da da\nDa\n\nDa da da\n\n\n\n\nDa da di\n... bone and we just got it on and you got to be in two days later\nBy by just on\nAnd on\nAnd on a nice day really I don't know what to do it again\nI just don't get it to be just fine but if I just I\nDon't know I Know and then but we used to be worked out very rarely\nDo try to\nBite my bondage to love to be buying [noise]\n[noise]\n[noise] yeah I don't blame you might want to know if you think about\nThat in mind\nBut they don't they just got a lot of\nThe big on\nThe phone\nAnd that was the block there for all of you out here we started with the art can feel that followed by Marshall okay Ben herded\nAnd he loves oh we would Mac just the plain years with even drink so here we go with a deep me\n[noise]\n\nOh ... no ... ... ... ... ...\nMy ma ma ... uh I\nWent in and then my love I Love\nLima, Oh my God I don't know I saw\nHim I don't know where they're all [noise]\n\nRain falling from la la la la la la la\n... beer profitable ... do you feel like\nI'm a\nI'm On the line from my uh [noise]\n\n\nMany bomb rain\nFalling in la la la la ma I wanted to\nDo in New oh\nThat [noise]\nYou mean\n[noise]\n[noise]\n[noise]\n\n[noise] nah\nNah nah nah\n\nNah nah nah nah nah nah nah [noise] [noise] [noise]\n\n\n\nYeah it would\nBe a lot about\nThat\nYeah yeah I Know they are yeah yeah yeah yeah yeah yeah you know you are based on your right and then\nTurn it on and try again you know why and he said no\nNo no you are an hour you know come and be right\nWhy\nNot be the um di di di di di\nDi di di di\nDi di\nDi\n\nStory and then where are\nYou know all we know now ... where are the people come on guys lobby\nAnd I'm Renee di di di di di di di like going to talk about\nHow there are a dying on three or when you're\nDoing you know and no one really dry oh yeah where are you oh yeah I\nMean I'm not sure why not go di di\nDi di di di di\nDi di di di di di di ...\nNo no no not really understanding what the ... sign followed by Yogi die you know he got underway right\n\nNow\nWell no no no\nNo no no no no no no oh\n\nNo no no no no\nNo\nNo no no no no\nOh\nNo no no no well\nMy well no\nMaybe they don't have the uh the uh\nMm but they would we know that they may well no no no no we're really was the the the uh Mm but the thing you know the the uh\nWell no no no\nNo no no no no no no no\nOh\nNo no no no oh\n\nWhy oh no no no no\nOh\nNo no no no no well\nI Know\nOh\nNo no no no no no no no oh no no no no no you know what are they oh no no no no\nOh\nWhoa whoa whoa whoa whoa [noise]\nRight well no maybe they feel that they did the uh the\nUh Mm\nBut they were waiting so that they may be in\nA\nRow where it really was there that the ... but the you know the the uh ... no no no\n\nNo no no no no no no no no no no no no no no no no no oh\n\nWhat a yo know where your row [noise]\nMy well no maybe they do say that the um the\nGuy a man\nBut they were waiting so that they may\nUh\nOh where it really was there that are the uh the uh you\nKnow the the uh [noise]\nYeah and I got out and ... dock without\nA yeah I mean there are ... ... delegates and you're listening\nTo pay you what I eighty eight point one egg and how the radio and K. U. L. I. L. P. F. ... eighty nine point one Afghan straining on line at K. U. L. I. I. dot net you Native American public radio station I drink the ... foundation ski\nMm Mm Mm Mm Mm Mm Mm\nMm Mm Mm Mm Mm\nMm Mm and ... and ... a\nNight by John Nagl your mom do they show the same reason I Am a man but it's shown on the net new jobs during my mom my mom\nAnd dad and a and a lot of\nYour mind you know one thing I Do want to do on the line\nWhen diamond maybe in a new study you know my name's\nJohn down your three of the ... if you're going through the breed um injuries and try going over John McCain\nDistrict go be minus five days I can think of ways of enjoying debate by the dance Bob ... book alone I don't know what's working hard to bomb the big you know we're women bring could knock it out and\nI wanted to record it you know what I mean the work I wake up late then added it's against you were in their mind or to be a little bit over you know the wind and all of their\nAre wrong on my head off line mile long long way to try to be playing all the while they were going to be able to look in my county that we're so much as it may\nHave changed\nA panic I wanted to ask me ever toy it you know what I mean when I wake up late in the habit it's against you were in in the name of the day over you know why you know our clients are part\nOf my head off line while on my way to\nTry to play an argument why that would be able to look at my county that we're so much it may\nHave changed I mean\nI'm sure [noise] [noise] and I go\nTo John ghost town of those big lie rows of being you know the next year we're ... we're told my drink Afghans don't go away I won't be trying to\nThink later wrong stroll back to back and bring them and their their Spanish rarely used to I went up to go and go on a plane in my class in the shade everybody whether books for some way to laugh\nOut loud I drank emotion might drop out and play I'll be glad when it's all about by you know to make a you know I'm not\nThere to buy more they don't\nThey\nDon't give our neighboring treat the bottom and then go down\nDown down innovation going\nDown the bottom of\nMy district go down [noise]\n\nI\nKnow it makes you can see why what eighty eight point when they're very much January I asked the upper remains to be eighty nine point when the fair projects the Hopi foundation streaming online that Jay you why I dot net your Native American public radio station\n... ... ... ... ... ... ... ...\n... ... ...\n... ... there's no jobs there in the mid ... I'm like no not really friends a man named Norman\nMontgomery me\nWhen I'm up in the ... I Love my mom was just such a ... year gym\nTo gym that I guess then you know one of the brain around on you know and then I got a loved one man met me Mm Mm\nMm Mm Mm Mm Mm Mm Mm ... who ...\nShe only the only rule the guy who made joined about him being ...\nBut I think you know maybe I'm we know more than ... ... you know\nMy mood I don't remember when I went online and then you know let them know I've been in the morning that may go by\nLike ... and ... and like I said look low low man\nHe\nJust turned ... knock on the low ... no one marine around you know I don't know the last ... ...\nWell my mom my mom you know when I'm ... but most of the old ... na adults who signed me up the Jane Mayer let\nMe go demo harm the man of non non when I'm In the long ball\nMom no good old boy ... didn't make this deal\nCould buy me I don't know the kids don't know ... ...\n... ... Mm Mm Mm Mm Mm Mm Mm\nMm Mm Mm\nMm Mm Mm Mm ... ... ...\nIt was late at night and you know and I'm I'm a little the little we know\nThat I was thinking a lot Neal if I Know that I'm that range and begin in ... ... ... then again no one no then you're done you're buying a vegan handing it\nYou know not in the in the court of law got that low [laughter] oh no ... no no no no John John\n... and ...\nThank God I'm ... and I love love love you know like you know non ... not ... not ... not a ... ... ...\n... ... ... ... ... ... ... ... ... I\nDon't know what it meant and said oh well any ... and then and then when we're in\nNow on the line down John ... ran and then look at the lone\nRanger with no strings are saying you know money can buy like no one like negative and then a moron but let them John Freeman there's several\nGot done a lot of money on shining around on the new law goes that no one will know what you know and love\nYeah he loves the Lone Ranger with no strings attached to give to move again defining thing no one like negative ... lumens or the one John Freeman to move I got the\nLong run is shining\nAround them to go that\nLong you want more money you know like I Love the rain but no no no young to go down the line one more time for the ...\n... ... ... ... ...\n... ... [noise]\nUh this is Steve Martin and you are listening to K. U. R. I. eighty eight point one up in the radio screening online at ... dot net project the Hopi foundation\n[noise] he married me down my spine to\nThe bar we ... we eat a little problem with my mother who who who know I mean\n[noise] I'm [noise] trying to lie\nHe\nJoined the marine\n\nYou needed to be a\nGod do you do\n\nYou mean the\nGuy na na\nNa\nNa ve and you\n...\n\n... ... ...\n... ... ...\n... ... yeah ... ... ... ... your own books to look at that and the on the wall that ... streaming online at W. W. W. dot gay you why I got ...\n... e K you why I Am the project will be foundation young duck or what I said oh\nNo\nNo no no way hard I mean I don't know\nMan I Will say oh hey oh hey I ... a A R a way our whole hog huh well I mean I have a oh wait hey yo yo\nHey oh hey\nHey hey hey I oh ... ...\nWhen I look into it I remember all those bad show time where\nYou push their to gather a A R huh\nBut no no no no I saw that Joe is the song do yo ...\nDon ... I I oh ... ... at all\n\nYou remember all those special time that way\nTo share to gather a A R ha\nBut now that we looked on John talk that Joe ... so you know while I\nDon ma ma I hire ... ... ... and uh\n\nYou know have a way hard I mean I have no way\nNo way you know\nHey you know hey I have a a A R a way a whole we have a\nWell hey I mean yo man hey yo yo\nYo hey\nHey hey hey hey Ohio has now I own\nWay I look into your car and I remember\nAll those shows time that we\nUse to share to gay and a a a A R ha\nBut now that we looked on John Hope that Joe ... saw so you know a\nDon mine mine huh high\nOr low\nHey hey hey hey hey hey I\nKnow I read I hey\nYo yo\nI I I oh I uh I I own\nAll oh\nBaby girl are are you ... a lung or is that what I say ...\n... they really they they made I ...\nI Do I I I ... I ...\n...\nS over a A R A L here you\nKnow I Know they are\nYa okay and I said oh\nI I I oh I don't know I I Know I'm\nAll for ...\nYears ago I was there and what I say\nTo me oh hey oh for sure I\nMean they they the bugs lay the way\nI well over a year or a burger a are you know\nI I I Know I Know ah you know\nI ... I mind you've been hearing about KU why ice membership program for all right what is a doctor what do you a cave why I ask you to become a member by adopting one of our sixty nine thousand want since KU I\nI I pray to a non profit I did the Hopi foundation and receive limited funding we need to support to stay on the air\nIf you're a regular listener to read Ross are written with your host dismissed Irish the theater to our program is a crucial weight to show support each plot is ten dollars and your membership lasts for a year adopt one white and you'll get a ... why\nI sticker Anders certificate adopt more than to watch and you'll get to you need KU why I member pin adopt five or more watch and well thank you on air safety are more what gets you a date with laptops oh just kitty\nYou'll get a VIP tour after radio station she everything behind the scenes or take you up to the KU why I tower and for those listeners off the reservation see hope peed on\nWith cultural preservation approved guy become a member right now by going online\nTo KU Y. I. dot net and clicking the support ... you can always struck by the station costs seven three eight five five three zero or email in from K. U. I. I. dot net\nTo adopt to why I ... and stay I agree [noise]\nI\nMean\nWhile we're on the budget they listening but there there is some marijuana metal on metal on them but there are no less on whether they sign ... them all coughing\nCoughing on may well on their own them about this hour is on about the boys\nOn ... watch I Would I Do watch streaming bread drenched by uh [noise] just said I'm not going to drink liquor was delivered by quick why yeah\nDespite you know what are you what I mean you watch ... should not offering so what do you see that quick huh [noise]\nWhat he was supposed to show up on the other one but I think there are\n... [noise] my brother was in my mistress was trust him re election again [noise]\nWhere's my brother's keeper one male a male on them\nBut they shine but then they lose San Juan while on their own them\nBut they're known as strong as it was a notice on [noise] on them below them be limited land to build a moon coughing coughing [noise] ... well on their own them about the past has done about the boys are\nWe struck by was translating re sharpening corner locked in a gay where's my brother's keeper one male a male on\nThem but yet they shine but there's been this guy ... while on their own them\nBut they're known as John ... one thing I've noticed on ... billion ... double oh ... ... well on their own them about\nKnow [laughter]\n[noise]\n\nOh ... ... ...\n... ... ... ...\nWe want to turn\nAround me that I Believe I\nShow how many\nCalls her oh\nMy God no no\nNo I don't know I mean I think each\n\nOne of\n\nYour life give us a\nCall ... ... when the ...\nMy name's Ryan get her to have a written me no\nI uh [noise]\n...\n\n... ...\n\n...\n\n\n...\n...\n... ... ... ... ...\nMarines man they\nTurn\nOn the street\nThey are in\nA way\n\nTo a\nLady Jane ... when the\nShuttle has a ...\nFor\nFor you\nOh\nWait to mine she\nLeaves Jay Leno show you how many\n[noise]\n\nLike you\n\n\nKnow she\nHad no way to my mom she's\nWith me I Would ask me\nMy\n\n...\n\nFrom the ... and you also have to hang out at my age I have ... you know and I'm watching\nThe man who died in the coming into my mobile\nAnd yet they made Julia cases it daily I'd make\nIt a lot on ... which are not make any money can buy that and not on\nThe edge to play on there you can wind up with their family and\nI Need a place like shows like eat and eat what\nI Know with my age should read them eat uh being\nDone for them like ancient bond to greet them but\nThe ... you know but I say\nLet's say in my own family by one and I tell my\nAunt and they come by a movie that I can see what the\nBonds of Vietnam but I'm the mother is named Ken how can I make that\nTwo weeks or months on end they break up and then um what\nDo you maintain some respect is David ... is we should be able to take ownership and that meant when we are wrong\nHopi substance abuse prevention tend to provide the tools for a living there respectable license embrace restricting the person like teaching how to apply these tools to daily living if you are being affected by drugs or alcohol or know of a family member or friend who is we can help there is a solution to turning away from\nThis abusive and destructive life I'll call the drug callers today at night you ate today for zero three zero zero\n\nYeah ever said already ... to conquer checkerboard spoke stuck the back yard and their tribal torture Allendale we'd go in global he's too old rapper show ... eighty eight point one at ...\n\n... ...\n...\nNew sheer monitoring snowman Napa lose nighttime when you're on a mood Ron ... the ... the rumble land the role becoming the regime iron home\n[noise]\nHow do you live in ... the repeal of you to come home and he\n... he wants to see people die from a home run a fireman you're gonna [noise] on a mold design\nReally really well being of the\nTime when they thought they had him\nDown to the young man and a lot of home that's very own right [noise] [noise]\nHello I'm extremely close right\nNow in a\nDream in the ... or you will face river which time\nDrawing a mood of all your neighbors\nAnd you got to the mob scene where does math against the wall may return before Mickey Sharon handed\nThe rented the will of the day\nOf the nation\nIn the midst of a thing in\nMy brain doesn't leave them in the in the years go by in\n[noise] in Louisiana\n[noise]\nDa da da da da da\nDa\nDa da\nDa da da da da da da\nDa da da da da da da da da\nDa da\nDa da da da\nDa da da da da da da da\nDa da\nDa da\nDe da de da de da de\n...\nTo K. U. I. ... eighty eight point one at them and K. U. I. L. P. upper ... eighty nine point one Afghan projects the Hopi foundation seeming online at K. U. L. I. I. dot net your Native American public radio station and oh\nMy\nGod Forbid I live in a way I Want to run in the room\nTo run drones good there and then the\nNational and um you know in the long run and then oh around every now and\nThen run around and their mom and\n[noise] in America [noise] or her\nA lot of\nMoney and then when you turn around and they're on\nThey're going to throw you in\nThe army um regarding that you know in the long run through me oh when you're not\nGoing to Maryland drove him\n... to ...\n[noise]\nOh thank you so much by name and then my ... and I'm On you know ...\n... you know throw things ...\n[noise]\n[noise] [noise]\nDo you think more of a bank [noise]\n\nNo no in fact one of the murder of a\n\nMan\nAnd a lot of reading you know\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\nWhat\nThey\nDo\n\nMore often in\n\nLa la\n\nLa\n\n\nLa la la la la la la la la la just go\nRound\nAnd round and smile and around and you know our while\nI'm doing\nWell how soon do all those around a long long\nBefore they would hold on\nPower back while I'm no matter how bad around\nAnd do\nWell our our ... allowed\nTo do that though [noise]\nYou know those\n[noise]\n\n\nI'm older than me that they know that are nearby a main long\nOr not I don't know why don't you know one\n\nDay a\nLittle over ... na na na na na na na na na na na na na na na na na run away and then\nShe went away and you rent 'em every now and when I when you get things at work tonight\nThat can you do not the answer and and now I'm In I'm In Canada\nAnd [noise] I'm not one of my my cat now did you come in at ... you\nCan eat and you know deep down that she was on and\nAnd and and you can still be on and on his back on a guy who was barking and on\nThe any strong chance and hang on a lot of friends of\nMine and I can name by the man you know\nWay down to fall back on the same that they should\nHave you heard him in the cage and [noise] man\nYou are listening to K. you why I ... the law may be a boy was at and and get your Y. I. L. P. upper ... eighty nine forty one at a project of the Hopi foundation streaming online at ... dot net your Native American\nPublic radio station\nA law\nFirm and they were like oh\n\nMy God oh my God\n[noise]\nAnd all the time [noise] and he showed me all the whole\nFamily to a\nLower wage da da da da da da da da da da da da da da\nDa da da da\nDa da da da da da da da da da da da da\nNa na na\n\n\nNa\nNa\nNa\nNa na\nNa\nA [noise] a\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\nWell\nHe should\nKnow by the\nWay\nToo long ago\nWhere they slow down or not\n[noise] [noise]\n[noise] oh no\n\nNo no no no no don't get it [noise]\n[noise]\n[noise] [noise]\nYeah we're hearing the\nUnderneath the Persian rather well you know all the boom you have to vote 'em off the back in Boston on the beach or not even\nWhat the problem yeah are you going to bring it seems that will you are and I've been in the [noise] the little girl in the walk down a law degree\nDriven along our dynamic gung ho I Am getting by with that view wandering it ... it was just you know the next move and you know was was ... I remember\nWhen my mom lives with me my\nI'm only you about the role movie you know going\nOn just the doctor and noble\nLouis mo Jo Rae ...\n\n[noise]\nWhy well not no no no no no\nHe did\n\n[noise]\nWhy well non not no no no no\nThe\n\n\n\nAh\n\n\nAh nah\nHe won in a same thing yeah in the car and I thought\n\nOh my\n\n\nGod and he\nSaid\n\nOh\n\nOh oh oh\n[laughter]\n\n[noise]\n\n[laughter]\n\n[noise] you're on TALK of the\nSchool in the movie you know am I don't mean you can you say to you guys you know you're on the front of me you know it you're going to come up\nYou know I'm a ... a year you may you may be you\nKnow\nThey may do it or are you seeing you know and you're all around here and I'm not going to be around ... you know you're you're in a\nBad job or not you know just so\nYou don't you know we don't know if you do when it came out in the game I don't know if you put in your\nMouth when we come to you know so maybe\nYou don't sound like\nYou've got to do it on in Iran and although he's you know you got me going to be you know the baggage around the room\nBut you know you're hearing all around\nYou know you pay a dollar a year or a\n... to ... to the doctor for\n\nA long\nLong time for one or two\nThat are that they they don't want\nA dog you know one minute by God is you know\nWhere you are just buying a car you we're glad you\nFeel on the field but you're not going to look forward to it you know\nJohn\nYou got me two years or do you see you get along and do you feel at all and it's not clear to\nLook around and through your in your back you know we're a\n... hour a day you all are um do you all are I'm sure you know\nYou know\nYou got me down to it or did you see you get along and you are you feeling all around me and said I'm not the you know what I mean do you look around the who are you in are you an all or a\n... hour a ... billion dollar a day later you all are I'm sure you know say\nShe and I got out and this is Tania ... Douglas ... ... ... ... ... and you're listening to pay you what I eighty eight point one asking her to the radio and K. U. L. I. L. P. F. ... eighty nine point one Afghan Jamie on line at K. U. L. I. I. dot net\nYou a Native American public radio station projects and the Hopi foundation she\n\nLooked at the lunar landing on the top of the main thing in the last\n... last name to\nA new he ... will one day and age\nAnd\n[noise]\n\n[noise] oh\n[noise]\n\n[noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise]\nSo I\nThink he would he lied to me he\nHad\nHe been he we get on a bed and I don't care much for\nThe\nMost we\nFound them he said do we\nKnow what people do do we think\nThat that\nIs that\nWhen\nHe when he does\nHave to do that\n[noise]\nYou weren't listening to tell you what I Would do that any point in time and change the way I ... I promote the eighty nine ... projects up the foundation streaming online at ... dot net your Native American public radio to\nGet it here you are I Know quite a cage Neal David you wake up to ... in the morning please don't it online and change the way I dot net going\nThis is Shelley morning song and you're listening to traditional music that tell me a KU I eighty eight point one ... you're listening to the ... show and this is Jenny re\n\nOh whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa whoa oh my God no no actually I'm a ... a yo\nYo yo yo yo yo yo ma\nMa yo yo yo no no no no was it was a boom or a no no but what are they are\nMine and my mom and my ... and a lot of power and money to buy a um no no no no a on a main road oh here's a dull may hold\nRow to hoe and on my own you know your mother or a a a yo\nYo yo yo holy or your your dog or a\nMother yo young goes oh no no no no no uh\nYeah I'm a ... year old was a mother and my mom I don't know what the money but uh no walk you\nKnow we all have a nine year old boy do where do we know that oh no your nine year old you know the uh the mayor\nAnd\nAll those whoa whoa whoa whoa whoa whoa\nHey hey\nHo ho ho ho ho ho\n\nHo ho ho ho ho and then and then all y'all are no yo yo\nYo Ma no oh whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa\nWhoa man a Jose and all of the OJ law or oh\nNo no no no oh no no\nNo no no I'm a very odd and all of the law law\nGoes oh no oh I\nGot another caller oh well I Know I saw all along law a mall or\nGo to those those are\nLong gone out of\nHere\nBecause of the house has\nAlready layer\nLaw carved out of here you know there are\nSo low low or how much more on the on the ball because those are\n\nAll gone south of here and all they hear Charles\nOh why are they are because\nI was\nHere\nLast call the other was a law here in Charlotte\nCharlotte low on my way home and\n[laughter]\nAll the all male role here is how do they all rode the or the other is\nTrying to all of a non or know about your mother all all of a job and all of a yo yo yo yo Yo Ma hey\nMa yo yo ... or ... or no way no there was no one\nHere they are from a no no no and\nHer mother and my mom my church now want our money on a hunger now are getting a job on the line\n... ... no no no no no no you know the mayor I Know I Know\nYou're a player\nAll you know why are they all yo yo yo yo yo yo know you know they know\nSo tell me that what he hadn't museum works here at the museum Indian markets and you're listening to you why I eighty eight hundred line yet Tim phone line ...\nNative American public radio station thank you where you\nKnow no no\nNo no no no way man yo\nWay\nOnly know where they are nowhere near the oh\n\nI Want to know the way my I'm a poor man\nMan oh Canada you'll be well when we say these candidate but I don't know where you\nKnow\nWhat I Know man I Know they are nowhere near yo\nWhere\nYou don't even know where they are no when they say oh no no\nNo I'm a ...\nHe's always got to know the ... my ... you know that he's had a word I drive oh\nNo no no no\nNo no no no no no no wait a minute oh\nWhoa whoa whoa whoa what\nAre you know right now you know when they grow\n\nI Want to know what do you mean by a\nMan named those guys that you'll be well we know that these guys they were asking oh no no\nNo no no no I don't\nKnow man I don't know when they\nGrow\nWay I don't know\nSo you know when they\nGo oh I Know when the yo\nGiants game here is always going to be really even when we were\n\n\nWe do like\n\nEvery day [noise] ha\nHa ha ha ha ha ha ha ha\nHa ha\nHa\nHa\nHa\nHa ha ha ha ha\nHa ha ha ha\nHa ha\nHa ha ha ha\nHa\nHa ha ha ha you know all the way they do all the way they are really a ... or ... or ...\nOr the or the all the\nWay I Do all the way they do all of them are not all of a ... now operating a hidden deal or no\nHigher than the yo yo da\nDa da da da da\nDa da da\nDa da da na na na na na ... or ...\nOr ... not a doctor or a or\nA or a ... or\n... or ... or\nEarly ... son or are we are not already in your\nPartner and a part of this whole you know or a da\nDa da da da da da da da na na na\nNa or or a\nPlayer you know how they do all the way in hell for all the way a ... you know all the ... or ...\nOr ... or you know or\nDa da da da\nDa da da da\nDa da da da da da da da da\nDa da da da da da da\nDa da da da\nDa da da da da\nDa da da na na na opportunities or your or my you know\nWhy they do or you know all\nThe time you know all the way I don't know whether or not you know all the way we are now offering them all over his\nHeart you know climate or positive you know a one\nWay or the other day you know all the time or another you know\nAlready you know a million dollars is not always yo yo ma to not probably or I don't\n\nKnow what he knows\nWhere [noise] [noise] [noise]\nAre you a are you ... you have you been ... my\nSweet and ... and from has been a\nAnd win a game you know\nAll my uh you are among the shining a I Love the chance to weigh you\nKnow a a you know I Know I Know um [noise] I uh\nI ... a ... a a a little ... we all\nI Know a a a eh ha ha ha ha ha ha ha ha you and\nI uh he how are you and me a copy of the uh hey how are you\nA ... you are you a new ... [noise] you I'm a I'm a\nSweet and ... and from has been a\nA ... view all my\nUh you know my shining a I Love you just don't know we ...\nA a you know I yeah I Know [noise] I uh\nI and I ... ...\nUh the uh hey I'm ... I'm a\n... a A N e a a a a a\nA a you have a I uh\nI how are you and I uh the uh the uh the are you\nA are you are you and you know [noise] you know oh my\nSweet and ... and from has been a a\nA ... game you\nAll my love you a minute shining a I Love you just ... we ... a\nPatient who I Am I Am I a a\n...\nA ... a hey oh Amy how many of them\nAre you a a a a a ... a\n... a ... or you may be a a a a a\nN E how are you and I uh the how a a a a color you\nAre you in the car you know I have to have you know you are my\nSweeney ... end from has been a a a\n... game you\nAll ... are you on your mind shining a I Love you just don't know where you\nUh are you know I don't know [noise]\nOh\nHey ... no\n... ... ...\nIt ...\n\nOr ...\nOr a\n... I'm a I'm a ...\nOr ... or ... or ... or ... or ...\nOr ... ... ...\nHis mom ... ... ... ... or ...\nOr if they can have a son who well well yeah there's a bill na\nNa na na na\nNa na na na na na ... uh oh my God there are no work in\nA a lot of the ... to ...\n...\nA a little\nWay on a on the line or a no no no\nNo no no we all know on a ...\nA lot of ... a you know my saying no work in a navy\n\nOr the only thing I knew\nA\nPlay on a on\nA a ... or\n... oh no no\nNo no no we uh\nWe all know na na na na na\nNa na na na na na na na na\nNa na na na na hey yo yo\nYou know ah ... you know on\nA ... a nah nah nah I'm a ...\nA na na na na na na na hey yo yo yo yo ma pay a na na na na hey yo yo yo\nYo Joan ... a a a a no fly or not I ... I ... I na\nNa na na na na na na man yo yo yo yo yo yeah na na na na na na hey yo yo yo\nYo yo yo yo hey ... na na na time not until long my health I now pass\nYo yo yo yo yo yo Joe blow young my jaw and ya all we know a long way to go while I'm wearing a ...\nNot pay no no I'm not I ...\nA night out and yo yo yo yo yo ... Joe ... jaw and oh go long long way do on a ... a day on a hill\nOr not they are no not I don't know I feel well\nNot yo yo\nMa is not a way on a yo oh no no no no\n... no ... or ... in a in a way ... uh uh well\nNo no no no there's no Ohio\nOr in a way a no no no no what was the\n\n\n[laughter]\n\nHa ha ha ha ha ha ha ha ha ha ha\nHa ha ha ha\nHa ha ha ha\nHa ha ha ha ha ha ha\nHa ha ha ha ha\nYou know we're in a low or low on non over\nA a a song or were there on a on a on a you know\nWhoa whoa whoa whoa\nOr a girl I Know a oh I don't know who you are married to\nA restaurant manager so that's a quote a\nGrow grow grow a bird or a\nYou know when\nA when a\nDollar a dollar a lot of it go over and over here's some more time I saw it all come no not all day so I'm a I'm a\nVery dynamic with it now so I'm a light and they\nMay not know who are they in a ... or ... or ... or ... or do they do go oh drug to its own merit pay some more\nTime on TALK of no I'm not going to make 'em a\nRe some equipment they stand on\nA light they pay\nA dollar or hey no no no ... or ... or ... or ... or ... or ... or\n... to ... um uh but none of them are gone now may I say no ma ma yo yo ma or a mother or a dollar or\nVictor I'm a bus none came a young man\nInto ma ma yo yo ma or other I'm not a male model they show oh it was a ... dodge all are lying there\nI'm I'm hey how are they are are they are or\nAre they\nUm are you or do you own a it was very much may\nGo about it I don't know tell me what was the only by other at all or by\nA company oh no problem or not you're young yet no one was oh my God mowed down more hey yo yo\nYo yo\nFor oh why oh why oh why not\nThe way I may be a A R a hiring right now or you know when or where\nYou are listening to kill you why I got a ... and K. U. R. I. L. P. upper when a pie eighty nine point one FM projects up the Hopi foundation streaming online that cable I dont\nYour Native American public ready who they are feeling music scheme\nWill not let me go back to\nNew here why any like one of the week [noise] either for ... ...\n\nA hot\nSauce na na na na na na na na\nNa na na na na na\nNa\nNa na na\nNa na na na na na\nNa na na na [noise]\n\nWhoa whoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa\nWhoa whoa whoa\nWhoa\nWhoa whoa whoa whoa\nWhoa [noise]\nUh\n\n\n\nUh\nUh [noise] [noise] [noise] [noise]\n\n\n\n[noise]\n[noise] [noise]\nMan a man a man I Am saying Hi Molly man a man I Am a I don't know any any I\nDon't see a man oh man I mean I don't know\nThe army I may I mean on on\nThe other hand I Am a high\nPaying a high you know hey I'm paying\nOut any um oh God I mean high on\nThe hockey I ha ha ha ha ha ha\nHa man I don't know I Am\nI saying hey you know I Am I Am a\nYoung man I don't know I\nDon't know what I mean I I Am a high on a I'm a I'm a man I say I mean oh hey\nI'm a I'm a high on a hobby I I Am a ha ha\nHa ha ha I own\nA a A R I Am I Am a\nI was a kid you know my my real I can rent a car that guy if you were a I\nH oh man I Am on me in love and you know I Am I Am\nAnd I am I saying Hi Amy I'm saying I mean I I I Am I\nSaying hey I ... I Am a nominee\nHigh ... high they are now maybe I\nMean I don't know I\nDon't know I Know I Am a A R\nWell hey I O o K I mean I ...\nI mean I I maybe I maybe I doubt it\nI only\n\nKnow ma yo on a on a\nOn a I'm a I'm a nurse\nOr\n[noise]\nOr\n[noise] um [noise]\nThose are really on a on a on a boat\nOr\nOn a I'm a dollar a minute [noise] uh no\nNo no no I'm On I'm On a on a\n\nOn a I'm a I'm not a thousand miles oh I'm\nI'm a oh a I'm a\nI'm On a I'm a man [noise] oh\n\nBoy\nOh boy\nI'm a I'm a I'm\nA you know I'm a I'm a on a\n\nOn a I'm a novel on an online or not you know ha ha ha ha ha\nHa ha you know on a on a on a\n\nOn a I'm a novel on my mom's a Dodgers ha ha ha ha ha ha\nI'm a or a um I'm\nOn a I'm a I'm a\nOh a\nOn a\nOr\nI'm I'm a\nParental involvement is to teach your child to school this is Joe ... residents of the Arizona education whether it's volunteering with communicating with teachers on a regular basis for helping with homework we know\nWhy should we important to to get involved [noise] working together parents educators to make the grade school year for every student in Arizona a message from the Arizona Education Association\nYou are listening to the way I could tell her eighty eight putting one time and change the way I ... a criminal ... eighty nine one one of the project's about the foundation streaming online at the way I talk to your Native American public radio station\n[noise]\n\n\n[laughter]\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise] [noise]\n[noise]\n\nOh yeah\nMan man oh man I I yeah\nRight now\nMan a man well hey oh hey oh well\nHang well man yeah\nWell I Am\nMan I Am\nA a a a a a a a a a\nAge so he\nWas na na hey\nHey Hey Don man I'm a big bang bang game on my way\nAround\nDang dang dang gay right now\nMan I Am I Am\nA man by email saying hey I'm a I'm\nA ... why\nI buy\nThe hay dying man a man dang dang game I play out\nMan I Am a\nMan playing a lamb lamb\nBank right now man I Am a way how\nMan I Am\nA man like a a ham ham\nWho ... who\nBecame a man who were\n\nTrying to draw\nYou know\nA\nDozen others who man and a man\nWho was the way they are ... skill or you know it's a\nAnd and then you know and\nSo they are and [noise] and [noise]\n\nDa da da da da da da da da da da\nDi ...\nDi da na na na na\nNa na na na na na na na\nNa na na na na way all I Want a a way I'm On a on the way\nAll all the way a or\nA little na na na na na na na na na na\nNa na na na na na na na na na na\nNa huh well it it all away all the all male a male or female or male\nOr a ... a and a yo\nYo Ma and I don't know why are you oh boy all of\nA whale is you know all of a hell of a way all the all male is a battle of all of a you know I Know that\nThe yo yo yo yo ma you know yeah na na na\nNa na na it's better than I Am a white male ... when al ... or ... you know I I don't know how I found that\nYo yo yo yo ma I die I Want to go and all I I mean are you\nOh why you know they'll find a job well\nHa ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha\nHa ha ha ha ha ha\nHa ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha\nHa ha ha\nHa ha ha ha ha ha ha ha ha or\nWhy are they all went to one\nAnd a\nYo yo ma all the way All right\nNa na na na na na na na na\n...\nWhat a what a what\nA what we were oh whoa whoa whoa whoa whoa whoa okay\nCool yo da da da da da da da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da de ...\nA site called ... and all of a surprise to\nMe oh look at what we say we don't have\nA lot of politicians got a ...\nA day and also I think all of us but I guess that's a it's a it's just another day at a time to play off I have not\nAutomatically shut off of a day off I Know I Know\nThat somebody else out\nAlthough I have a day off I thought\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\nWhoa whoa wait ... hours a day off\nOf a rite while they are out there a long way off ... probably a good way to\nGo to those who\nAre going to go go go go go cause a lot of those dogs will go there and play in a ...\nA okay as long as I ... I had\nTo go to the floor today we'll get a\nJob as a gay guy or a ...\nA day I have a cold place because uh they said oh no oh no that's all they say well you know I had\nA ... and also I thought of as a way off by a ... a day off I thought\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\nWhoa wait ... is a way\nOf putting a price for a while I was also a playful way off ... probably a day but uh [laughter]\nWhat is it is a gay man if I did a show or a day by day stray ha ha ha ha ha well now a da\nDa da da de ... de ... uh but you know the way\nA a dog but ah you know what a what a day by day and I do go a game I have a job they have all of\nA vote poetry gentile of ... a day to day or two a day off again but I don't think all of the high all but a man what a de\nDa da da da da da da da da da da da da da\nDa da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da de da de\nDa da da da da da da da da da da da da da da da da da da da da da da de da de da de\nDa\nDa da da da da da da da da da da da da da da da da da da da da da da da\nDa de da de da da da da da da da da da\n[noise] [noise]\n\n\n[laughter]\n[noise] [laughter] [noise] [laughter] [noise] [laughter]\n[noise] [noise] [noise] [noise]\n\n[noise] [noise] [noise]\n[noise]\n\n\n[laughter] oh my God [laughter] [noise]\n[laughter] [noise] [laughter]\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\nNo\nNo no\n\nNo no no no no no no no no [noise]\n\n\n[laughter]\n\n[noise]\n\n[noise]\n[noise]\nMm\n[noise]\nOh no\n\n[noise]\n\n[noise]\n[noise] [noise]\n[laughter]\n[noise]\n\nOh\nOh\n\n\nOh\n\n[noise] [noise]\n[noise]\nOoh\nOooh\nOooh\nOooh\n\nOooh\nOooh oooh [noise] [noise]\n[noise]\n\n\nOh oh\nOh\nOh no\nI'm\n\nI'm\nOn my God I'm not I don't know I'm going on when I'm\nOn the phone\nNumber I don't know how\n[noise] [noise] [noise] [noise]\n\n[noise]\nMm we knew who I don't\nKnow I knew you know when I'm Around them or [noise]\nUh [noise]\n\n[noise]\n\n[noise] [noise]\n\n[noise] [noise]\n[noise]\nYoga waiters made new voices and the mouse cleared his voice sounds bad me to share my gi\nBill imagery readers may need to read to you Ron ... had to look very Indian but he couldn't remember where he left his favorite pair of shoes that\nOlder children may benefit from discussing what they're reading at answering your questions about their book what do you think the main character was thinking there what do you think was the central theme ... to help your children develop into lifelong readers this is Joe ...\nPresident of the Arizona Education Association renting their children early and often habits that can last for one\nEncourage reading in your home visiting the library for letting your kids pick up books on the subject of reserve natural curiosity was book reading is a habit for a lifetime learning\nA message from ... originally Education Association\nKnock on thong via know hunger I see I Hope they might say last night and you keep all my in the land behind my you\nKnow five ... ... ... ... ... good morning my name is Nikki client to well I Hope the name is ... I Am from the village of ... I Am pumpkin ... my mother is ...\nAnd my father is do they are they going to I\nI Am focusing on raising awareness and they're very important issue out unhealthy domestic violence traditionally and culturally domestic violence is not the whole the way I Am calling out to the hoping Taylor people and asking to help prevent domestic violence by promoting a traditional values and your loved ones I scored like\nYou are listening to tell you why look below eighty eight point one if I Am and K. U. I. L. P. upper ... eighty nine point one if you project so the Hopi foundation streaming online at K. you why ... ... your Native American public radio station\nEach year more than ... point many kinds of sports in congressional people with a concussion hope I don't know the airport it's important that athletes and coaches learn about concussions signs and symptoms new guidelines for the American Academy of neurology\nRecommend that people thought to have a concussion be immediately removed from Port so plastic there to protect your brain\nLearn more it eight eight in dot com slash concussion\nHe can hold their point when fans treat that that'd be that'd be a Debbie it that way I got a project there'll be foundation\n[noise]\nFor them to Native American calling from the studios in Albuquerque and monitoring the Mississippi bad to talk I have a sixteen hundred where dictionary for tribal to use a group of crow language speakers are in the process of printing Fifteen thousand more dictionary these are among the effort some tribes are working on to make sure\nTheir language stays relevant in today we'll talk with people creating native language dictionaries as a tool\nFor which the courage and new language learners alike for back right after the news [noise]\n[noise]\n\nThat says national native News I'm Antonio consolidate\nA Native American woman will be the next lieutenant governor of Minnesota voters took to the polls Tuesday and the state's primary choosing the Democratic and Republican\nNominees for governor\nThe top vote getters in each party have Native American female running mates the Democrats are Tim Robbins and Peggy Flanagan Flanagan as a citizen of the wider nation after thinking supporters in his speech streamed on line by chaos TPP Flanagan acknowledged history and the making\nAnd I do want to also ... I'm no big historic moment there will be to Native American women who are running from tiny [noise]\nDonald\n... jam here we go to their\nDonna Bergstrom as the Republican candidate with adjust Johnson who's buying for governor she's a member of the red lake nation\nNative women and the two thousand Eighteen political season are seeing victories across the country in Idaho pilot Jordan is the Democratic gubernatorial candidate and to native women one democratic nominations for congressional seats\nStep Holland in New Mexico and Sharif David in Kansas but it was a loss in Wisconsin for our vena Martin ho chunk who did not win the primary challenge for secretary of state on Tuesday\nA sculpture for Native American burial site in Michigan town will be relocated the Grande river bands of Ottawa in jeans advocated for a new location due to concerns and would disturb sacred ground the Associated Press\nReports construction was already underway to sixteen foot granted sculpture was to stand at the entrance of the old Indian cemetery and Muskegon\nCity officials are reportedly seeking a new site for the art\nThirty U.S attorneys from across the country who are working districts with tried and tried\nTo land that this week in Oklahoma to come up with a plan to reduce crime in Indian country\nThe attorney general's advisory committee on Native American issues is looking at ways to address violent crime and drugs top priorities of the attorney general the Justice Department is working with local tribal state and federal law enforcement and investigating and prosecuting crimes\nExpanding grant programs training and technical assistance and information sharing with tried the sub committee met with the Cherokee Nation and the Muskogee creek nation salmon is back on the menu at the Europe\nTribes festival this weekend the California tribal leaders say they cannot search salmon in two thousand sixteen ...\nAnd the menu at the Europe tribes festival this weekend in California tribal leaders say they cannot serves salmon in two thousand sixteen and two thousand Seventeen due to low fish Ron's during those years fish populations fell in part due to disease water diversions and water quality issues the tribal\nCelebrate Clements founding editor fifty sixth annual event the fresh fish caught will be cut the traditional way over an open\nFire activities include cultural demonstrations that an expert traditional basket reverse from local tribes will showcase cultural objects the items are made from materials from the forest\nRiver and the shore traditional games music and language will be highlighted the ... tribe is the largest federally recognized tribe in California and has a reservation which straddles the lower climate river\nA tribal college in New Mexico was awarded more than three hundred thousand dollars by now says minority university research and education project the funds to Navajo Technical University will go to develop a robotics academy the program we'll provide students with advanced classes an aerospace manufacturing\nNow the whole culture will be reflected in the academy\nAntonio Gonzalez\n[noise]\nActually\nReduce Annenberg national board studios by points Roger Corp by law group spider India was Lucian by the corporation for public broadcasting reports from the public radio satellite system support\nBy ... one of the American Indians science and engineering societies\nCall the the employers you can join us at the conference October for through the sixth and Oklahoma City info on is he is God for support\nOr people that are ... we create and connect you to a unit tools and programs to help you and most amtrack all the issues that matter most to you and your family and your community what we do much surprise you more of a A R P your dog or [noise]\nFrom a number of sources of course they all come from right here but we're not going to ah we're going to accept all of that material and you know I I we haven't actually made a prediction but it might be as many as twenty thousand words that will have when we get all of that\nThat uh a material all into the database and the thing that we also have going here is that we have the verbal the recordings of every single word that in this database so that when we put this into this and not only a ... it will be printed\nDictionary but it's also going to be on line with the voices of our people and so each one of the sessions as you heard have been recorded so that we're going to pick up those those terms and put them into\nThe database and we've started our database we actually started our database which includes the written word as well as the spoken word and visual um we've started with about a thousand words on line but at any rate that's how that's how it goes together it folds together\nHow is the experience for you this ten days\nYou know I'm the experience started out kind of on a stiff basis we were weren't sure how it was going to work and we were bringing to pee in together people who were well they were acquainted but they were unrelated nevertheless\nUm we got into groups and we had a we welcome people to settle themselves into a group that they were a entirely comfortable with\nIt started off\nOur first day was a a bit slow sort of getting used to the approach but one of the one of The Elders told me that as the the group proceeded he was able to think of words that he can use as he might have been a child or even talking with his grandparents in the Nineteen\nForties an awful lot of fascination that came up into groups\nPeople were just really a excited and intrigued by the um the mental and intellectual energy that he has brought up\nJanine hang on I wouldn't want to talk more about this but we've got to go to a short break we're talking about meta language dictionaries we'll be right back\n\n... mission writers have to know their audience young readers want immediacy in a way to relate to the books characters on the next Native American calling we're talking with native young adult writers who also some need for more stories from a young native person's point of view we hope you'll join us [noise]\n\nOr why are they aren't we created and connect you to unique tools and programs usually money on TALK on the issues that matter most to you your family and your community what we do much surprise you liked sponsoring the Ninety seventh and do more so than\nAnd ... matter most to you your family and your community what we do much surprise you liked sponsoring them argue servants and do more so than falls or oldest changed so much information hope the tools and programs\nTo tackle issues that matter to you and your family or be a A R P blues and it ... or ... dot org [noise]\n\n\n\n\n\n\n\nThis is Native American hauling I'm Monica brain sitting in fraternity eight would we're talking about language dictionaries today does your tribe have a dictionary call us and tell us about it how does it come about what was the process\nWe want to hear from you the number is one eight hundred nine nine six to eight great doctor Janine peas is with us she is a faculty member and humanities and social scientists little big corn college also principle of the chicken the lodge immersion school\nAnd Janine before the break you were telling us about this rapid word collection he's ten days that I'm ... came together and collected almost Fifteen thousand words and you were mentioning I'm One of The Elders ah\nWas saying that he was using words that he hadn't used a in a very long time please continue\n[noise] well we were able to have you know topics that evolved memories from long ago when conversations that they had had with their parents their grandparents a local story tellers or even\nFolks in the community gatherings and some of The Elders were say well I went home and I was visiting with my wife for talking with my brother and we remembered all these others\nOther words that would pertain to those topics\nSo it's like opening chapters that probably had been you know may be closed for a while I'm within the discoveries went on a we found\nThat there were a number of young people really really or is it surprising number of young people who had been raised by their grandparents and of course we know who these people are but how much crow do they know\nWell it turns out we call these are folks are college for a bit of children raised by ground grandmother grandparents\nThat we have some young or you might say fountains and knowledge who have an amazing\nA grasp of the coal language and we're um so The Elders were able to recognize an eye on some of The Elders were saying to me these young people know so much well you know when they were raised by their grandparents the knowledge skips a generation of ... most them closer to that\nThat time when probably our community was using a fully the crow language\nFor all communications um and you know we've never had a chance to say well let's assess how much we know it was individuals' ... ... people don't go in and take a test and no and get to know what they're what the depth and breadth of their vocabulary is\nAnd so individual came in like after the session they come in and say to me you know something there's\nA new words I've never heard before but there's some of these topics I just know so much and I didn't realize how much I Know that I can share and the value of it the treasurer\nOf it that was the astounding I think measure across the board is the people that were in the sessions just came to realize I Know so much I Know this and that the sort of the mentioned the depth and breadth of what they they could contribute and you know a lot of our elders have retired from\nThere or whatever their careers were and uh the potential\nOf their contribution in this initiative goes well beyond our first Eighteen hundred topics we expect in the next year to have one or at least one more rapid word collection initiative\nThat will take another Eighteen hundred topics in our living language and we're ... we're just really excited to see how that that goes\n[noise] well I Want to talk to you more about that this is such a fascinating topic to put a dictionary together\nOf 'em are indigenous languages and to have an opportunity to have elder sit together and uh experience that that's so cool and what do you think about it give us a call the number is one eight hundred nine nine six she we free that's what's a one eight hundred nine nine native one of ...\nVoices into the conversation on the line now we have a ... she is the Choctaw language curriculum coordinator for the Mississippi band of Choctaw Indians\nWhere she is also a member welcome to native America calling up around a\nLittle thanks so much for joining us over we have Jean Louis he's the cultural content educator and trainer for the program\nAnd he's a member of the Choctaw Nation of Oklahoma he they're Jason her through and the lord Saunders she's the coordinator of the tribal language programs at the Mississippi band of talked to Indians and she is in ... role member of the tribe as well either to Laura\nHow they do All right thanks so much for all of you joining us today I'm going to start with you I'm tell us about the dictionary that's that's a you have for the Mississippi ban have talked to\nA low right now what we have is the teaching dictionary that we um put out in two thousand fourteen it's considered a child version and it has sixteen hundred word\nThe reason that we wanted to publish a dictionary was because we um we're going to be teaching the talk of language in the schools for thirty minutes every single day\nAnd for people who haven't had a you know a lot of conversations in Choctaw with little kid\nIt was like a daunting task so we gave them a dictionary that will hopefully help them you know I'm a lady's simplify the language a little bit for the little kid because\nAnd so we're not particularly ruling won out over the other but having a various\nMeans our way of accessing the language with print\nAnd with uh the voice or and or that is the audio and the visual um the the dictionary that we currently have on line it's called a ... vote kept builder and it's our first attempt in one of the things that we find out is once we take an initiative\nThere's pros and cons you know there there are asked\nThere's attributes and there's\nThings to deter people from using on your website so we've learned a lot by\nStepping out there the first technology that we use\nHas um a picture you know it's got a visual also you can see it and for the non reader as a child that isn't a reader yet doesn't have a literacy and the language but they can still see it and here it well they don't need to worry about the print so that that was that's\nVery versatile in that sense but what we did was we arranged um something like thirty four\nTopic areas where you know it's like all the words for the parts of the body all the words for fruits and all the words for\nFoods and like that well in this particular up you have to learn all of them and get at least Seventy\nPercent before you can go to the next topic [laughter] and that's not working very well we want to be what the flexibility that when the Lerner wants to learn something that's when they're most able to grab onto it and keep it in their mind\nSo if the kid wants to the child wants to\nLearn food right now horses tomorrow we don't want them to have to slog through topics [laughter] I didn't notice it in\nA less of a punitive approach to learning language and more open [laughter]\nThat's a great well um we want to talk more about this but your voice is missing from the conversation give us a call the number is winning hundred nine nine six to eight for eight that's also winning hundred nine\nNine need if we're talking with Dr Janine piece she's a faculty member I'm at a little big corn college and we've got folks from the Mississippi band of Choctaw Indians and we'll be right back\nSupport by the law offices of ... in my book than\nThe national trouble rights law firm with offices in Washington DC New Mexico California and Alaska and online at W. W. W. dot ... dot com support whether certain what what's on your to triage Dakota western corporations and that's W will\nPlastics commercial strings ... from twenty to sixty four drones for those used by casinos me oh you just in for the code of western court\nDot com [noise]\n\nMm [noise]\n[noise] [noise]\n\n\n\n\n\n\n\n\nUm [noise] [noise]\n\n\n\n[noise]\n[noise] you are listening to Native American calling this is Monica brain I'm sitting in for interrogate would and we want to work on the news station and K. I. P. I. is a brand new stations from evil Butte South Dakota it's owned by the shining reverse Sioux tribe\nAnd they're airing a native America calling for the first time today hello and welcome to K. I. P. I thank you so much for carrying\nOur show we really appreciate it we're talking native language dictionaries today if you want to get in on the conversation there still time the number is one eight hundred nine nine six to eight for eight and I told her when he hundred nine nine native\nI'm Around a TBI is with us She's a tall language curriculum coordinator for the Mississippi band of Choctaw Indians and um we were talking with Janine before the break about um ... different ways to approach a\nTeaching the language we use apps and a new variety of things um how how do you guys decided or you're going to approach you know building a new dictionary will you do something like the rapid word collection\nWell right now I Believe we're just using that data bases that we have um you know somewhere from the ... area and I'm Aaron ... from the eighties that is I'm constantly Harvey language development meetings which really just\nIt was somewhere it's from the ... area and\nI'm Aaron ... from the eighties and I'm constantly having language development meetings which we just got out of a you know every time we hear a new word I tried to send its Jason and he puts it into the data and that's basically I think how it's\nProgressing we have a ton of example of phrases and sample sentences that were written down I'm In the last Fifteen Twenty years that we're going through and\nI'm looking at a lot of them and I'm like oh it's just a dictionary this moon dictionary and especially when I'm trying to you know correct or not correct but like match the spellings um I find out that some of these might not be in the database so that's basically how it's growing\nAlright and Janine um when you did the the rapid word collection was there any time when there was maybe some disputes about a certain word or I mean you know maybe not like a rape fighting among each other but you know differences of opinion\nDefinitely variations of words and how they're pronounced our language is very descriptive and we were involving people from six districts we have three bands of the of the ... people\nAnd so we found that um people and we generally are people know that there are differences in the bans and\nAlso even some some illegal or even localized differences uh we found that there are families and a localized groups that have named every technology that's come along\nAnd there are others that didn't do that and so um you know if we were originally thinking well maybe we'd have to be inventing words we haven't had to but the discovery is it among our people there is variation and we welcome that a discussion and it got rather lively some of them were\nSaying well this is the way my great grandfather said it I was a little kid at his feet at the sweat lodge and I heard him\nSay it this way and someone from prior which is eighty five miles away said well this is a way it was said by and so on like that and they talked about it so but what's the what's the process allows and they and welcomes actually\nIs to have that variation those don't have to cancel one another out they are included and that you know the difference maybe a slight\nVariation in the word itself but we want all of that in there because we want to have a a dictionary that represents the living language and it's so important to do that when you start restricting\nWhy it said there's this is a way this word as sad as opposed to this well you know you take the the very vitality out of the language and\nThere's reasons for those differences and they talk about that in the sessions you heard the verbal the discussions that went on and and uh they got really quite lively [laughter] um and sometimes very hilarious and sometimes\nActually emotional and the sense that there were things they hadn't remembered and the reference to the people\nFrom there you know back generations\nOf stories that had been told of even warrior experiences and battles and all of that came through and so we're um it's it's the whole gamut I guess you might say of reactions but\nJust because one person says it this way and another says it this way doesn't mean that they eclipse one another no\nAnd um but they need to agree also on how it's spelled let's listen\nTo it and how is it spelled and they each each of the groups had to appoint among there among the five of them someone that was actually writing down the words in with the proper accents and all of that so these folks\nAre all literate in the language is well we really have a wealth of speakers you know we've got twenty five hundred very fluent crow speakers at least that count actually maybe somewhat ... alone because that comes from the census and you know do people identify themselves or when the census taker comes around but\nWe have a wealth of information and knowledge and we're in a perfect uh really moment of like you might say it's a pivotal moment for us to be able to collect our language in this way\nWell we're just at the end of the hour a Janine any advice for others who are starting this project who are starting dictionary\n[laughter] you know the dictionary is a fundamental tool for learning and it just so important and\nIf ... areas on your sights get to it the sooner you do it the better because your speakers aren't getting any younger and their memories aren't getting any better on a daily basis I mean this matter is so urgent I get to talking about it and I think oh my gosh you know\nReally need to grab the moment seize the moment and realize what an important learning tool it is for learners of all ages\nWell we've reached the end of our our thank you so much too\nAnd I realized what an important learning to it is for learners of all ages\nWell we've reached the end of our our thank you so much to Dr Janine peas\nI'll be on a tabby the Laura Sanders and Jason Lewis we're back tomorrow with a conversation about\nWriting for young adults are executive producer is are huge our hostess Tara gateway or associate producer is Annie Murphy reign of sensors are engineer and Tony Gonzales as the anchor and producer of national native news so to her so is our intern I'm senior producer Monica brain we'll see you tomorrow [noise]\n\nOoh [noise]\n\nSupport by Ramona for offering wholesome delicious from our bureau cross as our contribution to a better diets for the benefit of all people we're honored to share our such result forming after ... traditions online Ramona forums dot com\nOr by the American idea of higher education consortium gateway to tribal colleges created fire before American Indians are credited and political what certificate programs to master degree programs info at a I H U C dot org\nCannot ... getting shot cook I mean I Do is go to Nick ... Iraqi make but Kelly suicide guy appealing look look question I've got Iran now they know the mood to ...\nTo medicate Oakland question with chip I go home I Need to get the\nOne eight to five Ninety six Russia book so called health care dot coms went up ... percent chance for Medicare and Medicaid services\n[noise] native America calling just produced in the Annenberg national native studios in Albuquerque New Mexico by quantum\nBroadcasts corporations the native non profit maybe organization funding is provided by a corporation for public broadcasting support from the public radio satellite service [noise] he's a comes by Brent Michael David native voice on\nThe Native American radio network you are listening\nTo pay you I Hope that ally eighty eight point one ... and and K. U. I. L. P. uppermost ... eighty nine point one at a project of the Hopi foundation screaming on line that Kay you why I dont\nMet your Native American public radio station\n[noise]\n\n\nThis is\n... Haiti might wind out then it's time for house calls a collaboration between K. you why the Hopi community and the Hopi health care center [noise]\n\nContender Johnson a proud member of the Hopi health care center medical staff and your house that has caused this mission is to prevent the Scots and educate the community regarding important health issues I'm hope even my young\nWe hope that you will find a program interesting and learn something from it but remember it does not replace it is it your own primary care provider [noise]\n\nToday I Am pleased to be joined by my dad had turkey had to to discuss men's health [noise] welcome Hector thank you so much for joining me\nI'm ... I'm Sorry your medical student at the University of Arizona medical school to three sons are down\nThere down that's your model huh yes basically alright well thank you so much for joining us all the way from Tucson I'm you're doing a rotation up here at hoping is that right\nHere so I'm interested in health prevention and I told people that embrace diversity so I was offered to come here to work with a ... a a palatial it [noise] and so far is very enjoyable\nExcellent well thank you so much for being here and for sharing your knowledge with our listeners on house calls today today we're going to be talking about men's health so first a big question why should a man who feels completely healthy come in for a regular check up with\nThe doctor well I Believe him for prevention medicine so prevention is a way to improve themselves are leaving there was sort of issue that researchers are very few from groups have more risk factor for developing critical decisions such with diabetes and high blood\nPressure and hope there was a visual each\nOne of them there are many routine testing techniques which are easy to do him give us less all the information so we can prevent health problem\nHigh blood pressure the screening is one of the most important ones good and bad cholesterol screening diabetes screening and\nI think basically any tradable let's just do what we now have\nExcellent so we're going to talk about each of those things in more detail and but the main message is that unfortunately\nSomeone might not actually feel anything or no anything um to to indicate to that person that they have high blood pressure I have diabetes so even if someone feels completely fine healthy and normal it still\nIs important to get checked up [noise] so what kind of breakdown you mentioned a few different things high blood pressure screening cholesterol diabetes and um what kind of break those things down a little bit so um let's start with high blood pressure do people feel it if their blood pressure's Hi there I'm sure you know\nAnd I'm\nTo learn that would be learning more and more I see patients is that you should\nConsider signing killer [noise] um we tend to believe that we healthy and uh we just go with our you know not going to the doctor and suddenly was shot by the clinic and their their blood pressure weeding out what do I mean by high blood pressure well\nI'm the numbers can vary it but most of the time for like one thirty one forty and or the other one is like Ninety I bought a higher [noise]\nAnd like one thirty one forty and the uh the other one is like nine and a boy or higher [noise]\nRight so that is important people often ask what is a healthy normal blood pressure and what do these numbers me so I'm a hundred and twenty over eighty is kind of said it as\nA normal blood pressure so anything below that is good you do not have high blood pressure and if it goes up by a hundred and forty over Ninety that's definitely a high blood pressure and often is treated the medication and then in between a kind of depends on you um if you're in the one thirties um is that\nI'm concerned or not but it depends on other factors and but generally one twenty over eighty if you're below that I'm not good you don't have high blood pressure and okay so ... and we won't always feel it right I have a high blood pressure not no at\nRice so one of the important things that um we know now I'm the even though we don't we don't feel that there's a portrait or a higher\nRisk or Trump said forget a struggle her heart problems later on in life and those are the ones that we want to prevent the holidays come a like a big part of a water pumping really high pressure throughout all the you know holes and then I'll be in your drink cost more damage than to [noise]\nUm they high blood pressure is not expected any in any bubble a regular ... a lot older than coming to the Canadian checking in with a with a a blood pressure a machine [noise] usually happen in the clinic setting\nThat strain and um you mentioned a little bit about this about um why is it important to find and treat a high blood pressure so you know and I'm a person walking around out there with high blood pressure and doesn't feel any way from it and why is it important that we find out about that and initiate treatment\nThere's one thing that I wanted to mention to the listeners actually that we learn in medical school that we don't judge we are here to help the community and I think that's another reason why I'm also here because this is unimportant or\nIn a unique experience to actually learn how to do this and I actually feel good at helping the people and I are sometimes you'll see you know\nHelp with the all the services Donald they're absolutely\nAnd then um any other health concerns that affect men that she wanted to talk about her\n\nSo one of the things that um we also want to or or just mentioned today is um prevent the moral vehicle accidents ah we're seeing the role you know sometimes where you know when you're driving especially when we're young are doing very mouse Ninety miles per hour um\nI I Confess I did it once for those away but now there's I learn better and that's where I'm curious to ration anthrax is a really um you know for the listeners to really consider that when a drive in judgment sure where you'll Sybil don't drink and drive\nYou got up to them drugs um if you don't feel good also don't drive especially if you\nAre taking pain medication is a you have some problem with um shipping on now you can do stuff uh ... pills also also important summation and if you're really tired don't drink a in bribe also bone dry about all\nThese are all she's very dangerous to stop for love or like a little break is not going to hurt to undermine if you will\nTheir mhm that's really good advice Hector and really important because I'm\nHealthy young men the things that affect them most and um cause death\nFor young men and also causing injury motor vehicle accidents is really high on that list and so I really liked that advice but you're giving about always wearing\nSeatbelts I'm not driving under the influence of alcohol or sleeping pills and I think that's a great point too about how being sleep deprived is just as\nBad as being drunk and so if I'm you've stayed up all night not a good idea to drive I'm also not to be a passenger in a vehicle with a driver that you know is altered um but so a driver who's drunk or who a driver who's really tired of the day all get a\nRide later from somebody else for me um and not not be a passenger or even better try to um get that person not to drive at all [noise] um and then the um\nSeatbelts are incredibly important um and really reduce your chance for serious injury with the motor vehicle accidents\nUm so thank you so much for\n'em all of that advice\nOh and then one other very important one that um is causing accidents these days it's texting so absolutely no texting while driving um and it's hard to say you get a text message coming in is really hard to ignore it um but get a passenger in the car to respond or I'm\nJust wait until you get your destination um but many accidents are caused these days due to texting while driving um and that's a really important thing that we all um should work on um\nBut many accidents are caused these days due to texting while driving um and that's a really important thing that we all\nUm should work on 'em and making sure we never do that [noise] okay so we talk now about diabetes screening about blood pressure screening about sexually transmitted disease\nScreening about um you know supportive counting that we can provide in the health center about drugs and alcohol in motor vehicle accidents that are things that um take the lives of young healthy men and um\nCause injuries see I'm healthy men so those are things that um we want everyone to be aware of um now for the last portion of our\nUm the program today about men Powell or we're going to talk about cancer screening um so this is really really important because I'm cancer is a definite concerning the Hopi community as it is an all communities\nAnd this is an opportunity that we have as um individuals and as care providers to find 'em\nAnd prevent cancer so what kind of cancer screenings do men read and what ages are so\nOne one of the um the one for the\nWinters are considered a colorectal cancer is printing than the problems of old age of fifty or younger there's the family member with historian or colorectal cancer with younger than fifty years old age um\nThe other one is raw food comes from screening conditions debatable and controversial [noise] for the good thing is uh there's low um ... uh currently I'm\nFor a profit from ... to be a program that didn't come in with a war is over all during a ritual um six ... or the other woman\nOr do we can do for the first the culture is I'm I'm a blood pressure's through a screen the rest of the ... and ... and you can go to a provider about a former in between the age of fifty five\nAnd ... says while they're doing a job in his up to age men to the size what is best for him\nOkay and I do think this is a really really important topic because I'm I feel like somehow for women who get pap smears member grand um\nThere's a lot more talk about and I'm a lot more people coming in for their cancer screening and I think um for men it's really important that um there aren't as many cancers that we have good screening tests for about colon cancer we definitely have a good test for prostate cancer we have\nA test that can provide information and it's really a matter of each man talking to his provider about whether it makes sense for him to get the prostate cancer screening tests\nAnd so we'll focus more on this colon cancer screening um because that seems to be the most important than most universally recommended cancer screening tests are available for men um so how can you tell me more about colon cancer screening I'm practically what does that look like\n... or so there are two ways to do a colon cancer screening versus ... you'd take home in ... yourself look for for emotional blows you must be on every year or your ... and then you'll be a referral\nTo a ... the global north Korea is a curse words you take medicines to you know the schools when your column and been about two years to come\nUp to look up and saw your car loans or loss when systems for any ... or ... [noise] some people refer to skip the school to go for for the call off cookies and videos normal then you don't need another one of them for ten years okay\nSo like any cancer screening none of these things sound like they're fun um\nBut they are important though I'm Hector was um it sounds like there's two different ways generally for men to get colon cancer screening one is that um take home soil test that can be done in the home um\nWhich has to be done every year and the other is to get a colonoscopy procedure done and which is a little bit more of a process you drink a medicine that cleans\nOut your I'm calling her intestines and then I'm a doctor uses the camera to look inside and but if that one comes back totally normal then you're good for ten years and so this is a a um cancer\nScreening for colon cancer is the um screening tests but does save lives um\nBecause we find and um\nPrevent going cancers before they start so pre cancers we can treat those and then we also find early cancers 'em while they're still very treatable and curable I'm as opposed to finding out when it's really late so we definitely encourage everyone\nBoth men and women over the age of fifty to all get colon cancer screening um and it's something where across the country rate the colon cancer screening are I'm rather low um and hope he is no exception we're working on I'm\nTrying to encourage and support and facility colon cancer screening um but we encourage anyone who is listening was about the age of fifty if you know you haven't had your colon cancer screening or you're not up to date on it we do encourage you to come into the health center um to get that updated\n\nSo factors were coming to the end of our program do you have any final thoughts are messages for the community about ...\nI Do so helping room are important for help your family is I Hope it for movies we want you to be healthy [noise] we're providers are there are ... are here to help you and God you observe human Israel's responsibility and your mom\nUm financial wheels you guys you for the good there'll be one of them is the one you're ... [noise] that's\nRight so that that is an important point right at the ... I'm a little bit\nLike a bird and sometimes right to go into the doctor once a year when you feel young and healthy um but we do encourage everyone to get there once a year checkup because there are a lot of screening tests that are beneficial to support your house\n[noise]\nSo vote for judge them I have a question for you what is ...\nLooked cat began to know the the\nUh uh\nYeah well not too young to know a ...\nDo you use lego and\nSome say the only\nOh\n... oh really oh oh\nOh oh whoa whoa whoa whoa whoa [noise]\n\n[noise]\n\n[noise]\n[noise] oh oh\nOh I Know I\n... yeah we're not too many um you know\nThere's a will do use married\nOh and\nThen some day\nOh what were we were ... oh\nOh ...\nI'm a little\nOr no\n\n[noise] [laughter]\nDamage from reading the newspaper and you went in Manhattan [laughter]\n... [laughter] yeah the temperature than you did on the news they need to get and how\nMuch and I and my back is not animated character [laughter] I can tell you the ban on how\nIt is [noise] [noise] [laughter]\n\n\n[laughter]\n\nAh [laughter]\n\n\nUm when they they need for families and communities plan is man [laughter] I forgot\nAbout it and I enjoy sharing the ... come in [noise] um yeah you know na na na\nNa [laughter]\n\n... ...\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\nOh law law\n[noise]\nOh boy oh why oh\nWhy oh oh\nOh oh oh oh oh oh oh ... oh\nAnd yeah I Would say oh whoa\nWhoa whoa wish to hold me oh\nYou are a little drawl to oh Mm Mm\n\nOh\n\n\nSweet sweet to read you know when you can be nice to meet you must be ... loan pressure and the kids can be messy you've been\nA long list told her you know when you boil it it can be the ... we can get along with your son grieving when would you some ...\n... and ... would you do what do we do get those people who leave MSNBC\n... you're losing ... ... ... ... in your church street along\nThe man who ... you know maybe they can be nice to meet you back on the Web read one hospital just one long those blessed the reviewer carry the ball of wax 'em\n[noise] third care we drew a day and said oh I have a stake in these um the dream you will stay\nWhere do we reduce blood on the role of a chance to make sure that enters the pro can we get the ... you would do\nA one minute but why do you get one last will be when you're a man remains the same way we do we give it to be murdered\nOr use ...\n\nI'm a I'm a I'm a I'm\nIn the United\n\nKingdom come on\n\nWhoa\nWhoa whoa whoa whoa whoa\nWhoa ooh oooh oooh\n\n\nOooh\nOooh\n\n\nAgain [laughter]\n[noise]\n[laughter]\n[noise]\n\n\n\n[noise]\n\n[noise] [noise] [noise] [noise]\n\n\n\n\n\n\n\n\nYou are listening to tell you why hotel what eighty eight point one F. M. K. U. I. L. P. upper among copy eighty nine point one FM projects of the whole the foundation screaming on line at KU Y. dot net your Native American public radio station [noise]\n\n\n\nAttention K. you why I listeners the Arizona department of transportation states that the state highway eighty nine is closed north and south bomb between Cameroon and the two basically junction turn off due to wash out\nThe Arizona department of transportation estimate that each or will add about a hundred and Ninety miles to motorists trip on interstate forty state route eighty seven\nState route to sixty four and us one strict the update\nClosure a multiple days expected on us eighty nine north of Flagstaff there'll be flooding has a roadway between cameras and us one sixty\nThe Arizona department of transportation is working to reopen a section of us eighty nine celebrated by flooding about sixty miles north of Flagstaff between state route sixty four and Kamron and us one six be\nWith us eighty nine expected to remain closed for multiple days due to the wash out between my post for sixty seven and four eighty one\nOn the Navajo reservation motorists heading to page Cuba's city and other destinations north of camera in can take interstate forty east from Flagstaff two state route eighty seven\nAt Winslow then head north to state route to sixty four\nNorth West to us one sixty into by city and west to us eighty nine for those traveling from points out on us eighty nine the closure doesn't affect access to the Grand Canyon national park\nEast entrance B. R. S. are sixty four director of the Hopi department of transportation\nSaid motorists using state route through the tribe's reservation should watch sport but ... and for local traffic including busters and also should be aware that some stretches have sharp band and the great\nAgain this is an update of closure of multiple days expected on us eighty nine north of Flagstaff, Arizona department of transportation is working to reopen a section of us eighty nine severed by flooding about sixty miles north of Flagstaff between state route sixty four and a camera in\nAnd us one sixty with us eighty nine expected to remain closed for multiple days due to the wash our between my post for sixty seven and four eighty one on the Navajo Nation\nMotorists heading to pay you but it's really an other destinations north of camera and can take interstate forty east from Flagstaff Tuesday route eighty seven at Winslow\nThen head north to stay route to sixty four northwest to us one sixty into by city and west to us eighty nine\nFor those traveling from points out on us eighty nine the closure doesn't affect access to Grand Canyon national park east insurance B. R. S. are sixty four director of the Hopi department of transportation said motorists using state route through the tribe's reservation\nShould watch for pedestrians and for local topic including busters and also should be aware that some stretches have sharp bands and eat grade\nThen that is your update on the closure of us eighty nine north of Flagstaff\nOnce again you're tuning into ... eighty eight point when they're ... out the upper ... eighty nine point one FM also streaming online at K. E. Y. I. dot net your Native American public radio station Hi this is arrogant star and now\nA short how our skin mine\nDecade much out his first of all she wants to round down with me you are listening to the drum beat our here I'm K. E. Y. I. S. and eighty eight point wind here in the country\n[noise]\n[noise] well the whole\nThen\nBut you know the lord Pablo\nMan he\n... well I Know the way you know what do you do\nNow hold on a\nOn a na na na\nNa na na what they need all and all so that's a dollar for a loan\nOn the ... it's\nA such a ... you know\nWay now\nHold on a on\nA I\nDon't know if they need on almost all that's a good dog food ...\nThat you know ...\nI ... I see they had\nA ... you know what would a ... and the only way you know we know\n\n\n[laughter]\n\n[noise] [laughter] [noise]\n\n[laughter] [noise]\n\n[laughter] no spread there we go [noise]\n[laughter]\n[noise]\n[noise]\n[laughter]\n\n\n[noise]\nI'm not I'm not [noise]\n[noise] [laughter]\n\n\n\n[noise] [noise]\n[noise] [noise]\n[laughter]\n\n[noise] [laughter]\n\n[noise]\n[laughter]\n[noise]\n[noise] [noise] [laughter]\n[noise]\nHow about we are you ready to show 'em [laughter]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n[laughter]\n\n[noise]\n\n\n\n\n\n[noise]\n[laughter] [noise]\nHere we go well make a bad boys [noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n[noise] [noise]\n[laughter] [noise]\n[laughter] [noise] [laughter]\n[noise] [laughter]\n[laughter]\n[noise]\n[laughter]\n\n\n\n[noise]\n[noise]\n[noise] [laughter]\n\n\nNo I dont know [laughter]\nWhoa whoa whoa whoa whoa whoa whoa [laughter]\nWhoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa [laughter] [noise]\n\n[laughter]\n\nNo [laughter] no no no no no [laughter] no [laughter]\n\nNot at all no [laughter] no [laughter] no I don't know [laughter] [noise]\n[laughter]\nOh no [laughter] no [laughter] no [laughter]\n\nNo no no [laughter] I Know I don't know how I Know [laughter]\n[noise] [laughter]\n\nI Know I don't know [laughter] I Know [laughter] no [laughter]\n\nNo not at all so I Know [laughter] I Know that's all I Know [noise]\n\n\n\n\n\n[noise] [laughter]\n\n[noise]\n\n\n[laughter]\n\n[noise] [laughter]\n\n[noise]\n\n\n[laughter]\n\n\n\n\n[noise]\n\n[laughter]\n\n[noise] [laughter]\n[noise]\n\n[laughter]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\nCan't file and that's that's I think no one can hope they might there are no Nikki Khomeini the land behind my gala\nNow python long law now my son and he came back now and then they eat than any ... or they can maintain one\nAfternoon my name is Nick ... I Hope the name at home I see I Am from the village of ... I Am pumpkin ...\nMy mother and son in Venice and my father in the early ... I Am focusing on raising awareness and ... issue out unhealthy domestic violence traditionally and culturally domestic\nViolence in math all the way I Am calling out to the hoping came up people and asking to help prevent domestic violence by promoting a traditional values and your loved ones\nYou are listening to pay you ... I Hope that law eighty eight point one F. M. N. K. U. Y. I. L. P. upper ... eighty nine point one at a project of the Hopi foundation streaming online that KU Y. I. dot net\nYour Native American public radio station [noise]\n\n\n\nAttention K. you why I listeners the Arizona department of transportation states that the state highway eighty nine is closed north and south bomb between Cameroon and that you basically junction turned off due to wash up\nThe Arizona department of transportation estimates that that each or will add about a hundred and Ninety miles to motorists trip on interstate forty state route eighty seven state route to sixty four and us one sixty update\nClosure of multiple days expected on us eighty nine north of Flagstaff\nThere'll be flooding has cut roadway between Cameroon and us one sixty\nThe Arizona department of transportation is working to reopen a section of us eighty nine shepherd by flooding about sixty miles north of Flagstaff between state route sixty four and Kamron and us one sixty\nWith us eighty nine expected to remain closed for multiple days due to the wash out between my posts for sixty seven and four eighty one on the Navajo reservation\nMotorists heading to page Juba CD and other destinations north of camera and can take interstate forty east from Flagstaff two state route eighty seven at Winslow\nThen head north to state route to sixty four\nNorth West to us one sixty into by city and west to us eighty nine\nFor those traveling from points out on us eighty nine the closure doesn't affect\nAccess to the Grand Canyon national parts east insurance beer as are sixty four director of the Hopi department of transportation and motorists using state route through the tribe's\nReservation should watch for pedestrians and for local traffic including busters and also should be aware that some stretches have sharp bend and the great\nAgain this is an update of closure a multiple days expected on us eighty nine north of Flagstaff, Arizona department of transportation is working to reopen a section of us eighty nine tempered by flooding about sixty miles north of Flagstaff between state route sixty four and camera in\nAn us one sixty with us eighty nine expected to remain closed for multiple days due to the wash up between my post for sixty seven and four eighty one on the Navajo Nation\nMotorists heading to page Cuba's city and other destinations north of camera and can take interstate forty east from Flagstaff do stay route eighty seven at Winslow\nThen head north to state route to sixty four North West to us one sixty into by city and west to us eighty nine\nFor those traveling from points out on us eighty nine the closure doesn't affect access to Grand Canyon national parks east insurance\nOn the Navajo Nation motorists heading to page Cuba's city and other destinations north of camera and can take interstate forty eat from Flagstaff do stay route eighty seven at Winslow then head north to the route to sixty four\nNorth West to us one sixty into but city and with the U.S eighty nine\nOr does traveling from points out on us eighty nine decoder does it affect access to Grand Canyon national park east insurance be are that\nAre sixty four director of the Hopi department of transportation said motorists using state route do the tribe's reservation\nShould watch for pedestrians and for local tropic including buses and also should be aware that some stretches have sharp bend and the great\nAnd that is your update on the closure of us eighty nine north up like that once again you're tuning into ... eighty eight point one ... out the upper ... eighty nine point one of them\nAlso streaming online at K. E. Y. I. dot net your Native American public radio station Hi this is arrogant star and now a short time I get mine\nBecky look at his first of all he wants to round downs with me you are listening to the gym ... hours you're on K. U. I. S. and eighty eight point why here in the country and they don't oh\n... one [noise]\n\n[laughter]\n[noise]\n\n\n[laughter]\n[noise] [laughter] [noise]\n[noise]\n\n\n\n[noise] [noise]\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\n\n[noise]\n\n[noise] [noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n[noise] [noise]\n\n[laughter]\n\n\n[noise]\n[laughter]\n[noise]\n\n\n[laughter] [noise]\n[laughter]\n[noise]\n[laughter]\n[noise]\n\n[laughter]\n\n\n\n\n[noise]\n\n[laughter] [noise]\n[laughter]\n\n[noise]\n[laughter]\n[noise] [noise]\n[noise]\nOh la la la la [noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n\n\n[noise]\n[noise]\n\n\n[laughter] [noise] [noise]\n\n[noise]\n\n[noise] [laughter]\n[noise]\n\n[laughter]\n[noise] [laughter]\n\n[noise]\n\n[laughter]\n\n\n\n\n\n\n\n\n[laughter] [noise]\n[laughter] [laughter]\n[noise] [laughter]\n[laughter] [noise]\n\n[noise]\nOh I remind you want the Jamaican lottery Amman Amman Amman hey\nGood afternoon my name is Paul sitting Emily ten it would be I also justice services in recent years we become the target of many phone scams now seniors and others are receiving calls from an eight seven six area code congratulating them on the winning a Jamaican lottery or a new car\nIt's against federal law to play foreign lottery so if you get a call it's likely scan\nScammers got you to spend money so you're winning or car can be delivered to your home even identify local landmarks to make the prompt more believable they'll take you to not tell your family to make it a big surprise\nThey feel they cook the potential victim the cost of living increase in frequency often resulting in hundreds of calls the scammers requests your money through Western Union or in the creative ways like putting cash in the magazine\nNever wire money anyone with whom you are not familiar never provide anyone with your personal information bank account pin or Social Security numbers check any unfamiliar recalled before returning calls contact\nYour phone service provider local authorities sort of Federal Trade commission to report a potential scan for detail you may visit the world's eight seven six dot com\nBrought you in partnership between the Hopi police department and the radio ...\nHi this is\nArrogant star and now\nA short time I get mine decade looked at his school he was around down with me you are listening to the drum beat out here I'm K. E. Y. I. S. and eat it quite right here in the country and I don't\nKnow [noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise] [noise]\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\nUm [noise]\nWe're going to move on over here the weather's good Oklahoma but a little Italy\n[noise] oh\n[noise]\nOh I was oh whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\nOh [noise]\nOh whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\n[noise] [laughter]\n[noise]\nThat's walking nation that [noise]\n\n\nUm oh I thought\nOh I Know I\nKnow\nI I um\n[laughter]\n\n\nBut\nUm oh oh I Know\n[noise]\n[noise] [noise]\n[laughter]\n\nWhen\nI went oh my God [laughter]\n[noise]\n\nOh [noise] [noise]\n\n[laughter]\n\n[noise] [laughter]\n[noise]\n[noise] oh\nYou are listening to KU I I don't know eighty eight point one as and and the Y. I. L. P. a permanent that'd be a nine point one is and how to accept a ... to me on my key you why I don't\nMean to you why do you like what more are good for the next\n[noise]\n\n\nDo you what do you like what more do it that would be net\n[noise]\n\n\n\n\n\n\n\n\n[laughter]\n\nI Know [laughter] I don't know why not [laughter]\nWow [laughter] I Know I when I'm I\n... a lot of um [noise]\nUm [noise] [noise]\n[noise]\n\n\n\n\n\n\n\n\n[laughter]\nI don't know why not [laughter] I don't\nKnow why not [laughter] [laughter]\nI Know when I'm I [laughter] I Know I'm [laughter]\nI'm On a highway or not [laughter] God [laughter] I Know we're in a\nTime when um [noise]\n[noise] [noise] [noise] [noise] well\nYou know like ... and she said oh I see no but he you know but he does to you too [noise] I'm never going to lose\nThe new\n\n\nBook do do\n\nDo do do do\nYou think you did in the way you did\n\nAnd you\nKnow um would be tried you know so you don't you know de la la la la ...\nWell hey hey good luck with\n\nAll due\nTo [noise] do you use\nYour your\nShe should stay on ships on\nThe news to me [noise] and [noise] I'm\nOn my own and I'm ... I'm\n... and ... [noise] no [noise]\nAnd\n\nYou're listening to K. you why I didn't know what we want to tell you why I ... up and look at the eighty nine point one thing\nTo\nDo that today and um but it was long hold on one ... no no no no no I'm just wondering you know where's\nThe shared a mile from where we know that\nGod while well a ritual and she was none of the burden on the level of a man and he said no way I see\nOr speak to all of them tie a wish I didn't know what I didn't know there are no\nGood story about a woman in the winter and you know or you know throw around and do well\nAnd ah I'm ... I'm ... years rules going back and I'm I'm a I'm a roundabout stranger about my\nMom for a new mom number for them from a movie about a\nYear for a long slow in so many home I'm a well\nRona Rona another new one word of mouth ... how much I'm not a matter of\nBreaking the law again I'm I'm a surgeon show do do\nDo do well no no no I'm not real yeah ... well not well the ...\nWere a na na na\nNa na na\nNa na na na na\nNa na\nNa na na na na na\nNa na huh but I Know I've got\n\nA ... so what do you know I\nMean I'm very well\nWe're wondering if there were no oh no that's wrong to do when you know\nI'm Still a very low for ... or ...\nOr the uh during the women were running is\nAnd I don't know what\nI was I was a non ... jam in Russia there are a lot of women\nWatching them then yeah\nUh where where are what are we are we're\nGoing to know what we're going to drill for um are\nAre going to run around a dam road there were around or way when\nWe're watching on the road from where I Want to know we're we're we're going over and over\nAnd over and over again for your time on the run we're [noise] we're here and there\nWere there [noise] [noise]\n\nOh oh oh\n\nOh no no no no no no no no\nNo no no no I was\nMore men do we know Miley and all the the\nNo no no no longer on both ... no ... well I don't know I\nDon't know if there was no ... na na na na na na na na\nNa na na na na na na na na na na da\nDe da and all I Know\nAnd I'm sure he doesn't know loaded they go when I'm when I was in the long run the ... um or a girl that I wouldn't have any family members\nAnd no ...\nNo he didn't\nFollow it really is a really well\nNo no no no\n... I'm trying to buy me a long way na na na na na na na na na na na na na na that in the\nJob and you know that's a long time know that two wildly but let them know that\nThere are no no no no no no no no no no ... la la la la la la la la\nLa land or a little older than I Do wrong wrong or right\nNow there are no no no no\nNo\nNo no no no\nNo no no no no\n[laughter]\nYou know the way and and um\nOf that in a jam one day\nAnd\nHow to read and then it up and down and\n...\nAnd\nI don't know not then you never know down now charred ruins I'm not going down that route and the guy down\nBy nine or more here and there was no ... by man trying again when I'm like man I'm not ashamed to say\nThat in every day\nAnd\nFeel and guy yeah na\nNa\nNa na na na na here and\nThere and\nThen ... them all mob you to go and then and then a new way a piano will my hotel room in that building on the moon\nNa na na hey man you got all of them are in your head when you go in the world you know\nWhat I Am in Miami jam one day\nAnd\nHave them you know when do they have it is Dan and Dan\nMarino [noise]\n[noise] [noise]\n[noise]\n[laughter]\n[noise]\nOh no no no no no no uh no no no no no no\nNo no a lot\n\nOf la la la la la\n\nLa la la la la\nLa la la la there you go about their them up in your mouth and think\nAbout the bad stuff and then they ... they look\nLike [noise] my\nMom died about ... it's not that they're\nYoung and I don't know about a young mom\nThing you know a young girl non la la la la la la la la\nLa la la la la la\nLa a guy or gal I saw it on a la la la la la la la la la la I'm going to yell I thought oh oh oh yeah oh do you feel about that they want to do\n[noise]\n[noise]\n[noise] [noise]\n\n[noise] I'm not\nPaying a lot of da da da da da da da na na na na\nNa na na na na na na na na na da da da da da da da da da\nDa da da da da da da da da ... going yo la la la la la la la la la around a lot of the last two\nDays with them I'm sure they must have had my days there you're on\nA non stop and watch the game\nThen gone on my hip on the ... na na na na\nNa na na [laughter]\nA lot of a lot going on by low oh about\nA guy on both on the [noise] I saw a well known as la la la la la\n\nLa la la La Guardia\nMy mom's side and I'm not then they go oh my name is Daniel Daniel dum la\nDa dum la da\nDum going going going on you're gone\nI don't know I was\nA a well a lot\n\nOf the uh well\nMy mom and I'm not that they go they they are\nA lot of\nYoung guys don't do a lot of your goal when la la\nLa la la\nLa la la la la la la la la la la la la la la la la la la la la la\nLa la la la la la la\nLa la la la la la la la la la la la la la la la la la la la la la la la\nLa la la no\nWe're not going to be outside uh\nHello this is Virgil Jane\nI'm from the ... and ... going on how now the whole puppy and I worked down here at the medical tent Phoenix, Arizona and affiliated with that well but they knew them for and I'm also tell you it it would be the hurting me at the airport\nAnd you're listening to you why I eighty eight one yet them so line K. U. L. A. dot net your Native American public radio station thank you\nTo be like you said it to be like you should they be like you say okay we'd like to say\nBye bye\nBye And I'm a I'm a I'm a home run on my mom my mom my mom my mom\nMy mom\nBut I don't know why\nI'm a I'm\nA I'm a my eyes are about ... miles by my not my mom was a buddy by I'm In my I'm On the\nBottom but I'm a\nNa na da\nDe ...\n\nUh one of the ...\nThe man I Know a straw na na\nNa ...\n[noise] [noise] ah well\nTo do on the um no no no well again you know all the\nNews about the uh [noise]\nUh well under the age of ...\nA long long long long\nTime yeah I\n\nKnow\n[noise] um\n\n\n[noise]\nAh [noise]\n\nUm [noise]\n\n\n\n\nI'm a\n\n...\nUm no\nYou are listening decay you why could fill a eighty one man and ... and I only one that's been boat\nProject of the open foundation driven ... done nets your Native American public radio station [noise]\n\n\n\n\nAttention K. you why I listeners the Arizona department of transportation states that the state highway eighty nine is closed north and south bound between ... and that you basically junction turned off due to wash out\nThe Arizona department of transportation estimate that that each or will add about a hundred and Ninety miles to motorists trip on interstate forty state route eighty seven state route to sixty four and us one sixty\nUpdate closure multiple days expected on us eighty nine north of Flagstaff severe flooding has cut roadway between Cameroon and us one sixty\nThe Arizona department of transportation is working to reopen a section of us eighty nine shepherd by fighting about sixty miles north of Flagstaff between state route sixty four and Cameron\nAnd us one sixty with us eighty nine expected to remain closed for multiple days due to the wash our between my post for sixty seven and four eighty one or the Navajo reservation\nMotorists heading to page ... city and other destinations north of camera and can take interstate forty east from Flagstaff two state route eighty seven at Winslow then head north to state route to sixty four\nNorth West to us one sixty into by city and west to us eighty nine for those traveling from points out on us eighty nine the closure doesn't affect access to Grand Canyon national parks\nEast insurance beer s are sixty four director of the Hopi department of transportation said motorists using state routes through the tribe's reservation\nShould watch for pedestrians and for local traffic\nIncluding busters and also should be aware that stretches have sharp bend and the great again this is an update of closure of multiple days expected on us eighty nine north of Flagstaff\nArizona department of transportation is working to reopen a section of us eighty nine debit by flooding about sixty miles north of Flagstaff between state route sixty four and a camera in\nAnd us one sixty with us eighty nine expected to remain closed for multiple days due to the wash out between my toes for sixty seven and four eighty one on the Navajo Nation\nMotorists heading to page Cuba city and other destinations north of camera and can take interstate forty east from Flagstaff two state route eighty seven at Winslow\nThen heading north to state route to sixty four North West to us one sixty into by city and west to us eighty nine\nFor those traveling from point south on us eighty nine the closure doesn't affect access to Grand Canyon national park east insurance be our that's\nOur sixty four director of the Hopi department of transportation said motorists using state route through the tribe's reservation should watch for pedestrians and for local traffic\nIncluding buses and also should be aware that some stretches have sharp bands and steep grade then that is your update on the closure of us eighty nine north of Flagstaff once again you're tuning into key why eighty eight point when their mental you why I\nI'll be upper ... eighty nine point one FM also streaming online at K. E. Y. I. dot net your Native American public radio station all the land that music makes\nYou know [noise]\n\n\nYou're a U.S eighty nine north like stop once again you're tuning in to kill you why I eighty eight point one of them and tell you why I I'll be upper ... be eighty nine point one of them also dreaming online at K. U. L. I. I. dot net your Native American public radio station\nAll the land that music me\nYou know God oh my God that is\nThat near here anyway I maybe like one of the rain\n[noise]\nMan [laughter]\n[laughter] [laughter] [noise]\n\n[laughter]\n[noise] [noise]\n\nAround\nI messed up up up up on our wall of shame man and a half an hour an hour and I know on the way he saw him on the line on my face\nI said my town and get back in that\nCamp and I as\nI Know that when my mom just ain't going on why\nAm I saying you were a jump right on a big much\nAsset I fly by friendly fire it up\nOn and on and on and and and I know what I'm saying I Am on\nMy hands yeah but\nI Do my on my\n\nMom's gone a minor league ball man\nGod saying\nMy mom\nOn\nThe loans from Canada man I mean she says\nShe won't grand a year and three and you see somebody I Know that out and have a choice not to be from David Mann some a\n\nLong time now I mean you know right now our women\nBack God man\nShe won't granddaddy and breathe and you see what was my no when I ran out and uh she not June and I am the ... David Mann\nSome uh oh oh\nOh no no no I mean you know right now our ...\nBaghdad out and I'm ... I'm sure that I'm a ... you know by ...\nNa ... seat on marry me\n\n... na na na and AA most can live on a very down here we look for in store for\n... the bell rang when I got out and buying a new one to land a no no no no\nAnd now they've been trained in and day and all but how long\nDo you then ...\nThat a man who say oh my God I Am for that I'm I'm ... I Know man I mean if you know nah\nI'm married and I thank God you're na\nNa na na na na na na na na na na na na na na I saw in a in a rural\nSwell man my dad's sue lacked a a night out and say and do and strong ... century and in\nThat top man in math and you only na\nNa ...\n... ... e oh well\n[noise]\nI knew I see around me you know\nParties should show up and I'll be well Dr ... ...\nDo you have to live side meaning that one girl in the ... law that into a plane from there you go down they run around\nWith the same crowd we needed some time ago and she you know our life you know when my older son you know I Know she's trying to weigh\nIn on the\nBallot your you know I'm trying to be a threat to us so they were out of its own I mean like I\nDon't see how much do you when you look\n\nFor a while I guess they were even a low key when our talk shows are\nClosing in on the same everywhere you didn't need to close to home it was so far no she didn't go far and he joins over me before the grass for backstage departure cars\nYou know my mom didn't want to charge more now\nOn right now I never did that on the ballot your you\nKnow down the aisle and yeah I don't know do they mean for a guy on the issue and then\nWhen you were also [noise]\n\nAnd I didn't know what I Want to thank gosh my and I live in the June ...\nNo I get to do with your new job and so now the ... like\nMe you know those ... only ... only when John gene we we have no no no no no no no [noise]\n[noise]\n\nHey you know I Hope you uh-huh ...\nJanuary I supported in part by volunteers from the community key why I volunteers are students thanked me two members to provide a unique on air radio experience for our listeners in northern\nArizona the key way I back thanks for your contribution to hope you radio key why I eighty eight point when they grow up\nYeah no I Know what I mean the Navajo\nWarrior effect the wrestling heavyweight champion your turned into Hopi radio eighty eight where you want to say don't touch that dial break your legs\nAnd the Iranian I'm sure they'll be like a green erupting oh how great the heart of every girl long for me to come online\nThe\nNavajo warrior it begs the wrestling heavyweight champion your turned into Hopi radio eighty eight forty\nOne that said don't touch that dial up break your legs\nAnd to be around me I'm sure there'll be a Supreme irreplaceable role immigrated here the heart of every girl long straight for me to come by\nA\nWhen you hear the way I any like watching TV [noise]\nWe are like community church choir from second Mesa we won't be singing six times for years three and hoping and three and English and again we just so glad that we can share these found that you\nThat members deacons and lifestyle pastor and again you're Myron welcome you sunlight community church in the name of Jesus may be blessed daily so here's I hire a person\nThat we are going to sing is like a geezer smoking a lean Yammer\nTranslated by George my answer by\nSaying\nOh nine nine years I Love in a way ... made a lot like a ... law giving 'em knowing he may be\nA I'm a I'm a on Monday and ... ah ... no I'm going out on Monday\n... na na na one I'm\nOn a ... a new one on one do we do a ... on me while I'm I'm a I'm\nA lawyer yeah I'm a I'm a\nBig issue that they've got you um well you know they do the right man this guy here uh\nI my\nAh Jesus as God reading learn and ah where we live um I like ah nowadays I\nMean when I get well you know I'm I'm\nA I'm not ... not one um um oh yeah well my own holiday and mom yet they have\nNot won a a\nLike a ... year while I'm I'm a I'm a young I'm On a ... I'm I'm only I'm a young\nI'm I'm a yeah I well my wife ... I'm I'm On\nA Monday and new long no no no no I um I\nLike a nice a non ... or ... na na na na na jeez I'm I'm On the uh oh yeah no\nNo\nI'm On a Sunday mom mom yeah those are mostly like seeing a vote a game on long and so on so long but the [noise]\n[noise]\nThe one I'm na na na na geezer a\nLatino or you know what I'm\nI'm going to a ... a lot they bomb bomb yet those talk mostly but they are going to play a game on get sold for so long but the [noise]\nThe next time we are done are saying you know I mean I'm I'm yeah mom translate it by the river and gave me right\n... ... ... more\nThan nine name Tom bomb made no man I'm being online\nIn a very airline job\nI'm I'm a real I'm sure I'm ... I'm a good job um no not the law was um\nAll day long game that was good\nMarried name a young mom but Ben lifetimes on a\nBonding I'm yeah\nI'm a yeah I'm ... I'm I'm I I'm\nNot for a bomb on on a ... a man a\nGuy I'm I'm wearing dum dum da yeah I'm doing ... oh\nI'm I'm I'm young I'm no no no no no no no not really a\n... game that was on the big ... mom your mom the same time I saw a ... ...\nOh my God [laughter] oh\nMan I'm I'm like I'm\n... I'm a student maybe ... I'm ...\nI'm so I'm\nA dog yeah not a bad guy a guy in\nThe uh the um um yeah I'm On the snow but not ... I'm\nOnly ... ... ... yeah I'm On the same time last a long big on yeah\nOh I'm yeah I'm ... I'm ...\nI'm a night yeah I'm\n\nAn Exxon that we're going to sing is at the ... the message out that crime is the power of gum or Corinthian chapter one verse Eighteen\n...\n... ...\n... ...\nNa na na na dad my dad and there are ways and and my job ran down the line\nWell you can't go back to say that more than that you had a\nI have a good guys snap back back in time and I I Know better than average around\n... van and I may I say my time now I Am a stay at home maybe [noise] [noise] wow\nMan crying guy and John ... on the treaty I'm day three days they buried down and not\nBeing read\nBy that time that there is no such thing as a parent and don't mind fires\nWhen and where I Want to say as I say I read the five times and now I Am has been saying\n\nWell mine is that a man by that time in ... in Missouri\nAnd planning cry cry me neither that more men than we can then\nAnd then that they're proud to say a million times better than nine hundred dollars that way\nAnd say hey I stand by saying I made my son I I Know I had that big of a ...\nI'm\n... Mann on our way well I live on them and\nI live in now man I'm I'm In my mind like man I Want to have\nTheir eyes on me and my mom and um I Am and I\nLived down on you know when mining is lying Caroline dialing yeah and I live in a ...\nI'm In my\nMind I I Am and honor yes I Am a huge way\n... man\nLive ...\n...\nAm I live down here I Am going to give you ...\n\n...\nYeah um [noise]\n[noise]\n[noise]\nI remind you want the Jamaican lottery in my mind in mind\nOr\nGood afternoon my name is Paul ... ten it would be I I'll adjusted services in recent years we've become the target of many phone scams now seniors and others are receiving calls from an eight seven six area coke congratulating them on the winning a Jamaican lottery or a new car it's against federal law to play lottery\nSo you get a call it's likely scam\nCameras asked you to send money for your winnings or car can be delivered to your home even identify local landmarks to make the prop more believable they'll pay you to not tell your family to make it a big surprise\nThey feel they cook the potential victims ... increasing frequency often resulting in hundreds of call the cameras requests your money through Western Union or in the creative ways like putting cash in the magazine\nNever wire money to anyone with whom you are not familiar never provide anyone with your personal information bank account pin or Social Security numbers check any unfamiliar recalled before returning called contact your phone service\nProvider local authorities or the Federal Trade commission to report any potential scan for detail you may be aware of eight\nSeven six dot com\nRock do you get a partnership between the Hopi police department and the radio on one\nRight\nYou are listening to KU I Hope not like eighty eight point when I came I ... I ... the ... when ... projects at the ... foundation seeming online I Can't say I thought that you needed American public radio station ...\n\nMm [noise]\nMm Mm\nMm oh oh [noise]\n...\n\nOh\n\nOh oh oh\nOh ...\n\n... ... ... ... oh\n...\n[noise]\nMm\nMm\n\nMm\nMm Mm oh\n[noise]\nOh oh early on a whole a whole a whole a whole whole\nUh how old were they might have a a a a\nR or\n... or ... or\n... or ... or ... or\nA or a no\nWay I Want to uh like if we're all\nOn my uh what was wrong when a mile away Ohio or a\nYo yo\nThe F\nA yo yo yo\nHeh heh ha ha ha ha ha ha\nHa or try all high or high ... high oh Ohio\nAnd have a A R T\nO s a yo\nYo yo ...\nA high or a ... a\nHigh high or high or high ... high Ohio\n... or ... uh\nOh ...\nEarly ...\n\nOr ...\nOr\n... or ...\nOr ... I'm In a in a um\n\n\nMm Mm oh\n\n\n\nOoh\nNo\n\n\nMm Mm Mm\n\n\n\n[noise]\n[noise]\n\n[noise]\n\nNah\n[noise]\n\nMm [noise]\n\n[noise]\n[noise]\n[noise] [noise]\nMm [noise] [noise] Mm\n[noise]\nMm [noise]\nMm [noise]\n[noise] [noise]\nMm [noise]\n[noise] Mm\n[noise]\n[noise]\n\n\n[noise]\nMm\n[noise]\nMm [noise]\n\n[noise] Mm [noise] Mm\n[noise]\nMm [noise] Mm [noise]\n\n\n[noise]\n[noise]\n\nMm\n[noise]\nMm [noise]\n[noise] [noise] Mm\n\n[noise]\nMm [noise] and um\n\n\nAll ride welcome back to tell you why I and we have heart and my own hair wash his new album so go ahead and let him talk some more about his album air auction you're why that\nFirst of all thank you too okay why a jumbo verbal jumbled here during the interview and uh [noise] ... well I mean come on for a few minutes promoting the news that\nI just released a logging answer all special day for our native prosperous paper which is a former hope they also that they were observed it out here at home and also working that day from Tucson but you know when you're in a position like I Am it's going you know a a twenty four hours rush or a job but uh the titles I\nHope that we released a back on or\nAre we to test this call to which in translation to hope the new Kenya yeah and the purpose behind that was a chain or promote a\nGenuine in a different perspective about I'm very involved in this package of the new DVD of actual Grumman are dead ends up a story that's all\nThe Grand Canyon and how important it is the whole yeah and our idea was that at the time a number of people are more like heroin or trying to promote it escalate in Canada and that's Jane bow and others are\nWhere that is where they were trying to plan that varies takers hokey\nNow I remember that ... there was less right below us right into it right right in the area\nNow a a significant areas in that area and so and then it also goes copper to recall the rubber meets the Colorado now but the idea that was to promote this or that we were uh somehow or prevent uh\nEscalate go and um other tribes [noise] not no significant Grand Canyon or to to\nYou know are we just test and the title\nRight in the area where the uh the uh [noise] a significant areas in that area and so and then it also goes at the council and stuff or look Colorado meets the Drake, Colorado now\nBut the idea that was to promote this so that we were uh somehow or prevent um\nEscalate the no no no and um [noise]\nOther tribes you not know the significance of Grand Canyon or to try to copy yeah\nEr we sit there and the titles on this album are facing some of them that are there down in um in the canyon it's how to swim I discovered was by Gary structural [noise] used to want to get the flu working he's actually oddly that'll Washington or\nThe other gentleman that's doing the clay pot was I'm not knocking down in Tucson and this is the first time in history as far as we could we could go back and research staff um\nAny means your life has been recorded and watched all all all of her she was the first one and all of this law\nAnd this is something that a historic were hoping would say and so we recorded that they're a it was kind of unusual because um we could do it during the daytime or yeah there's a lot of people going in there so we went in there at seven o'clock\nAt night we recorded until like three thirty four o'clock in the morning or all night all night in there and so you must do to you should be able to purchase CD or lying on a ... a [noise]\nAmazon and I turned around but\nYou can um you'll listen to the natural uh acoustics are the ... towers self and especially on the one that the the uh\nThe eight track which is called cussing and it's a title in an English is called prophecy um download those recording\nThat second level and you can just sheer echoing off the wall not washed or something else too you know while the corner\nBut that's how we did it and the a cameraman with a great job as porous recording the lie\nOn bringing him but I did and the playing of instruments and also the point that they elected official a photos to half must have been in the collection for the game so that is out there but you know that was my purpose and then all of this project\nAnd we're going to promote it and the next big venue that's going to happen with this\nOn November ... what are the ones that are going to be shown an IMAX Grand Canyon or rhyme or our idea\nAlso to expand in point of uh I I was offered the young the [noise] going into professional recording like what I Do\nAnd Jerry is more than willing to teach you how to play the flute there there there are just very hard to learn you know it took me like about three hours to kind of learn how to get out of town I one of them but um\nThat's the way it is that we're in our train or did you do that you know what you want a quiet and then you have to remember just a rare and from your let's\nTry to really kind of ... or so\nDescribe the area of Grand Canyon we also have various names for it I Know uh some uh some of the main other Mesa people\nThey call it a sec what the ... yeah but for us override the third third makes up he was going to cost because that was the place of number one we went to get the salt ah for\nOur part of our ceremony on a pilgrimage to we go down there as far as ... men outside\nThe other part about it is that it's very important because uh although the hip hop when he is not really located in the Grand Canyon it's part of the Grand Canyon where we hope he believed that\nAre in place are merchants took place yeah and uh one of these days hopefully you know when I'm greater cause us back or not for a jumble and I are going yeah move I got my ... I got my flying saucers that scientists want to make that down there\nThe gods initiated men outside the other part about it is that it's very important because uh although\nThe hip hop when he is not really located in the Grand Canyon it's part of the Grand Canyon where we hope the belief that are in place are merchants the place yeah and ah one of these days hopefully you know when um\nThe creator calls us back and that's where a jumble and I are going yeah move I got my ...\nI got my flying saucers known outside of the fact that Chinatown is that um that's the thing that Hopi hand that's the reason why it's a place that needs to be protected respected in that way and if you um\nYou know what I'm kind of message I'm Talking about is that um it's got a special place in the world and why the creator elect to this place for Hopi to be here today boy\nI Know there's other tribes that have emerged from their with their stories you've got the Sunni you got the warm and find you know\nTo to find that you don't have those places in there\nYeah so we know our history in life why it's important but yet you know you got you you observed at you and I observed that we had the opportunity to be on that river trip at the same time I hear and what kind of disrespect or the the rafters we're doing more yeah\nAnd the other part is that [noise] you know you get so many visitors there so many millions of ... every year a lot of people taking selfies but do they\nFeel that spiritual connection of why the respect that you know in that kind of way by putting it kept sci fi fight he sat on a limb with the ... on them fight the but the only I I'm not from a ... phone but it's a ... foot\n... would put on the ... the phone call him the car\nI Know I got put the inland me on hold and find funding of over ... young to what we want them or they're not y'all come for buying the ends of the doubt that we eat out a lot of low for a while for the DVD and not because\nI'm behind the play or to fight the thought than it does he know that the British law Wyatt ... him and we have in overtime foot tomorrow you to get him thought a little while yet yo yo ma or what\nShe somehow come by Huck I mean these are not from the might the dominant climate poop I'm not some ...\nAmong them must must below might be some he thought you were to get more people that were way I'm an old in the pie funding come by seeing them I say ... or ...\nBy ... it by\nNot meet a whole number that you could ... is our number ...\n... thought my calling for my kids I feel that if I'm the Korean ones on the whole fight fight them ... ... ... and when they come by bus or somehow come to see more unless I cut the man behind them you'll find him a ...\nA ... month after the ... or you know went on a three or four or five months of really only have one more reliance on no by no means it can only put on a case of with I have not seen enough brushing them but what it what\nDo they eat well he will be on can you hear what black near a couple of ...\nBy a bus a bus throughout or it might not budget nine or ... he didn't among them right up you know I'm a record ... or she might not I'm I'm the only company about ... ... uh but there were ... you have the Lincoln the offices of\nActually put a number of land and the ceiling when you hear me okay here you go see a woman and I might listen [noise]\n\n[noise]\n\n\n\n[noise] [noise]\n[noise] [noise] [noise]\nI'm a non\n...\nOr ... or ... is\nA is a is a in a man or a girl who is a is a man a\nFish or a or a ...\nYear old who ...\nIn a a a A N age I don't know who we have a say a in a hot oh holy hell or high ... you know ... or\n... or ... or\n... or\n... or ... or a is\nA is a in a man or a ... a man on\nThe line or a or a ...\nYear old who ... or ... or ... you know who have\nThe uh he uh he anytime you know whoa whoa whoa whoa man yo ... a higher ... and\n\n... a a\nYoung guy or a ...\nA young man who high or high oh why oh why oh\nWhy oh man that's a yo hired an a ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha\nHa ha\nHa ha ha ha ha ha\nHa ha Ohio Ohio Ohio Ohio Ohio school\nHad a yellow na na hey I'm\nWay\nIf\nYou're a ha ha\n\nHa ha ha ha ha\nHa Ohio Ohio Ohio Ohio Ohio ...\nAl ... al ...\nUm [noise] way Ohio\n... a ...\nA guy John ...\nJob is a man shot a humble man on\nA couch sign your\nWho who ... a a house who have a\nA a man named John Still only a little higher than average Joe ... hang on I Am [noise]\n\nIt on your\nNew Jersey\nAre\nYou oh who who ... pi Ohio Ohio Ohio\nVoters age Yo Yo's when", "year": "2018", "show_name": "no_show", "city": "Hotevilla", "day": "06"}