{"month": "10", "state": "AZ", "station": "KUYI", "content": "\nYou are listening to you why I\nCould do a one man and kill you why else be upper fees I point one never been a project of the open foundation\nLuminal lie to kill you or your ... your Native American public radio station following you provided to a partnership between the way I Will review and tea and you ... [noise]\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise] oh my\nLai from NPR News in Washington I'm Laurie London President Trump says the FBI should do a comprehensive investigation into the allegations surrounding Supreme Court nominee Brett Kavanaugh and that he's keeping in his words an open mind but as NPR's Mara\nLiasson reports he also says that Senate Republicans should determine the scope of that investigation President Trump said he wants the investigation to end quickly and that the FBI should look\nInto whatever the Republican Senate wants it to he said he believes Kavanaugh was truthful in his testimony and that his family has been treated horribly but he also said he has no backup plan if Kavanaugh should withdraw\nOr be rejected by the Senate I Hope that he gets approved I Hope that the report comes out like a ... like I really think it should I think it will I Hope\nI Hope but look I'm waiting just like you the president said he was surprised how vocal Kavanaugh was about his drinking problems in high school President Trump doesn't drink which he choked today was one of his only good traits Mara Liasson NPR News Washington Trump\nIs also accounting and newly reached trade agreement with Canada and Mexico Canada's chief trade negotiator in negotiator agrees NPR's Windsor Johnston reports the U.S Mexico Canada agreements or replace the north American free trade agreement or NAFTA\nTrump says the new trade deal is based on the principles of fairness and reciprocity\nOnce approved by Congress this new deal will be the most modern up to date and balance trade agreements in the history of our country with the most advanced protections for workers ever developed\nTrump says the agreement will create jobs across a manufacturing agriculture and technology sectors it would also protect Canada from any future automobile terrorists imposed by the United states but for now at least in place us imposed duty not steel and aluminum imports and retaliatory terrorists\nLike Canada and Mexico implemented in response which are trying to an NPR News\nPolice and Germany are questioning six suspects believed to be planning terror attacks as may Nicholson reports\nI saw her she's kind of outrage Eddie this morning and has arrested six men age between twenty I'm such a seven month believe to be the ... was arrested last month the suspects\nUh German citizens from the eastern states just ... onto western states at the very least police they were planning attacks in order to destroy Jenny democratic order the men are accused\nOf forming a far right terror group called revolution cabinet named after the eastern city where anti immigrant protests took place last month the announcement of the U.S and Canada trade agreement with Mexico\nStocks higher today the Dow closed a hundred and Ninety nine this if NPR\nTrumpeter composer and band leader Jerry Gonzales has died as a result of a fire at his home in Madrid the sixty nine year\nOld Gonzalez was a creative force in Latin jazz for over four decades NPR's Felix Contreras has this report\nJerry Gonzales was unique that you play both afro Cuban percussion interrupted literally straddling the worlds of Latin music in general\nIs the beginning of the new year Rican neighborhood to the Bronx and along the way he played with Latin alleging teacher pointed in jazz legend require\nTighter but he's best known for the group you started with his brother the Fort Apache\n\nEarly two thousands he moved to Madrid recorded a series of critically acclaimed albums which China strategy [noise]\n\n... NPR News\nTo scientists credited with one of the decade biggest advances in cancer therapies won this year's Nobel Prize in medicine American Scientist James Allison who is currently chair the department of immunology at Mt Anderson Cancer center\nAnd task who hope Joe is professor of immunology at ... University in Japan they will share the honor the research has led to a treatment\nKnown as immune blood checkpoint blockage which works to unleash immune cells that attack tumors this is NPR\nTone for no drug mirror Newt you Joe under\nYour tree you why our community calendar\n\n\n\n\nLawyer\nWho\n\n\nCame to you why I listen\n[noise]\n\n\n\n\nOkay you why I listeners thanks for tuning in on this Monday October first two thousand eight team and here is your community counter update [noise]\n\nFirst step K. you why I cannot be heard of villages I'm going to be an eighty nine\nPoint one FM 'til opening up and say no as a hundred yards and reaches approximately ten miles [noise] goes decay you why are down there now to donate and support K you why I finally reaching are hoping villages and keeping are hoping voices and broadcast\nStrong [noise] stay tuned for our official on as we continue to shake airline assignment K. you why I now located at the junk you know to some extent born in eighty seven in second may or\nMay you why I stomp on number is nice you wait three eight five five zero five and our backs number is nine to eight seven three eight five five to five\n[noise] K. you why I seek more hoping that by speaking volunteers and community advisory board members are CAP helped raise funds for the station and educate the community about the importance of why\nI Hope he radio visit K. U. I. dot net or email us that info like hey you why\nI dot net for details again our telephone number is nine\nTo eight seven three eight five five zero five [noise]\nSo I make\nCommunity counter announcement or at least two weeks before you're a best buy on your to employ like K. U. I. dot net and\nAllowed you to do business days prayer event to be added even better find are moved by getting airport message out to our listeners right away for just a few dollars to record your information out there for a paragraph thirty second announcement email into like KU why I'd done that to get on the air quality [noise]\nAll righty and for the mobile computer lab\nMore information for them oh about computer lab nine to wait three ... three six six four four and for the whole the bookmobile bookmobile trailers open for library services that they hope ... tribes administration complex from ten AM to four pm Monday through Thursday\n[noise] more information funny hoping bookmobile nine to\n\n\n\n[noise]\nAll righty I'm back with their updated weather for this Monday October first two thousand eight teen or step kings canyon tonight showers and thunderstorms low around fifty pours out to insects to eleven miles\nPer hour\nBecause the more the village tonight showers and thunderstorms likely cloudy with a lower I'm fifty four star southeast when six to fourteen miles per hour [noise] money's got paid for by city area tonight showers and thunderstorms low around fifty seven south southeast away in Ninety two fourteen miles\nPer hour\n... St Michael's area tonight showers and thunderstorms likely cloudy where they lower I'm fifty three star southeast went\nBy to nine miles per hour [noise] Winslow tonight sour John thunderstorms likely cloudy with a lower I'm fifty eight Easter when the nine miles per hour\nLast but not least Flagstaff two nights showers and thunderstorms low around fifty two dollars topless when around five miles per hour becoming calm [noise] also Flagstaff is in a flash flood watch\nNow and tell five pm tonight [noise] and that's gonna be are updated weather for this Monday in October first two thousand eight teen and for more information under whether you may go to weather dot G. O. B. and that's going to wrap it up for your updates on your tune against\nAt least blacks dive tonight showers and thunderstorms Laura I'm fifty two dollars tablets when around five miles per hour becoming calm also Flagstaff is in a flash flood watch\nNow until five pm tonight and that's gonna be updated weather for this Monday in October first two thousand\nEight Jean and for more information on the weather you may go to weather dot Gov G. O. B. and that's going to wrap it up for your updates and your tune again to tell you why I eighty eight point one F. M. N. K. U. R. A. I.\nL. P. upper ... eighty nine point when FM also streaming online at ... dot net your Native American public radio station thanks for tuning it more music coming up next\n[noise] [noise] [noise]\n[noise]\n[noise] [noise]\n[noise]\n\n[noise] um [noise]\nNo no John ... who who I chose\nThe winds doctor I was in love with you ... up to the doctor I was in love with you will and then we'll doctor he told me what is your new when you ...\nA ... uh being banned in my mind living back to dig a bank found a lot of big bank\n... doctor you know be true Lou ... when you talk to you know me nine students will and then the doctor he gave me my family and he said\nA ... I mean back in ... back in April ... asking bang bang bang murder\nOr you may be going on a on a much larger one way or\nThe ... ... ... my three which doctor he told me what they do the math for him to win you doctor you know I mean what do I know you'll be mind when they do you win the\nGame will ah ah being back probably one of the big bang okay I'll be back right now\nAnd I was a joke I mean\nWhat what what memory when you got your hero me one of my friends have no one's Dr me what to do new I Know you'll be mine when I say to you or not\nIt will I paid back ... back in April I in fact probably one of the big bang bang bang bang bang bang bang back a while a bad\nGuy\nBang bang do you like what you hear\nWhat we love playing you all these wonderful tenants and doing shout out in medications are okay you're white listeners but without your support and contribution to KU why we were it not be able to stay on air and bring all these wonderful programming\nSo why don't you do your part in lock onto your computer and go to Katie why I dot net\nDonate online today that's Kael why I dot net we certainly appreciate all your continued support and remember to keep your dialing eighty eight point on FM that's calling [noise]\n\n[noise] well I don't\nKnow I remember when I was looking into\nThat more and more heart whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa\n[noise] way a\nWay way way\nWay way\nWay way way I I I always I always vote a young my job but look where where\nAre you know how bad it all of a way\nI I was at high on the way up high ... away by a ... you know [noise]\n[noise] oh my God whoa whoa whoa\nIt's way way way way\nWay I I always had a young boy oh y'all sweat and you know what I hear your new way\nWay way all the all the\nWay I buy your way yeah it's fun to go away yo yo yo yo yo\nYo yo\nYo way way yah yah yah de yah de yah away a Yahoo or what do you hope a job away\nAll the way I look at my ...\nOh by the way they are like a\n... by the way it that way I Am a ... a\nWay yeah I had a young lady at a young boy oh a job in the way that he I I you know\nWhat ...\nWhat a way the way I ah yeah I'm a white yeah ah yeah ... oh oh you go away but I I I you know\nWhat a ... by by by the way a way out way ahead by\nA Hawaiian shall I say wait wait don't pay a young lady who had a job away Oh hi John away but I Will\nWait yeah oh yeah by\nThe way they are always a way I had a yeah oh yeah oh yeah oh but wait oh huh yeah away but yeah hey I can tell\nGo\nTo the ...\nOr a\n\nLaw professor who knows what's that mean they can show but may not be the case of ...\n... manages to somebody\nWho's lively into couponing phone calls and wish it was like well maybe they can solve all the\nTime and the ... ... ...\n... ... email address is ... ... ...\n... you know who this person let's say you can't tell me\nWhat was going on over and over and\n\nOver and over [laughter]\n[noise] [noise]\n[noise]\n[noise] no I don't remember\nBut I don't know\nThe same you know kept a shortage and he'd only on channel ... she came to my well my my\nMan you know the kids were calm in a way you said just so that now\nThey don't care if you don't care says it will take some time and eventually she so my mind\nShe came to my [noise] my my\nMan you know you can call in a way you just said they they don't care if you don't\nKnow ... says it will take some other you know and he was only ... she says mom\nI don't think he shares the same thing he can sing\n\nWhen you're based in Kenya as long as they come here as well I mean you mentioned thirty million\nOr a\nMan a man a man and\nI got you on the rise again in a God you leave them a lot of them you know we are so deep in my ...\nBatch your rarely up or do you you\nKnow I've got two martinis are biased in and\nI tried to do I do I said\nTo him I Know this is a bad and never will go so well known but why should I Try to raise that when they the\nNose so\nI've got to be on their own biased and I'm a Muslim\nI sacrifice anything come what my mother's name a town and then they manage to by law and then by guns in the ... and every day of rain and then my daughter you know middle\nNever can around here and there are men families the way up to three out of the\nTime and I thought you meant by a bar I began\nA got you know on my skin\n... [noise]\n\n[noise]\nAh no no no no [noise]\nI\nWould not grew by ... they come what my brother saying a hat and you and yeah and the fight over one named boy but from the Knight\nMemory in the hallway and yeah they might yeah you know metal you never can win why not use\nThem in the last time I thought it'd be nice to meet you can\nUh but I got\nYou on my memory is\nNot got to be on a much ...\nFor\nMe these days about the book\nYou have a do not know we we will see what the hell does [noise] [noise]\nI Know you're good to have the\nMeans to me I Would not be that much power that yeah\nWe live on the high I'm a non ... yeah [noise]\nWell then I'll look at that okay I don't even [noise]\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise] me neither one of\nThem no no no no wait maybe they thought was well [noise] what else they [noise]\nThey they let me go back to when I\nSaw it on the um [noise] the [noise] the [noise]\n\n\n\nWhoa any real\nAutism able to do a lot of people have commented on how do we live on your hand in a while you were a lot of people ... around do\nOh\nNo no no no\nI'm going to a job well the guy on the job on them I Love that in the LA or people where you're from Iran do afraid I said\nNo no\nNo no not on\nThe go without the guy that got them out and I love the way other people waves roam around and do what\nDo you know\n\nYou are listening to K. U. I. hotel eighty eight point one S. and M. K. U. A. I. L. P. upper among puppy eighty nine point when s and projects of the Hopi foundation streaming online ad you why I thought that your Native American public radio station\n... do you watch the clock when that more than that for me\n[noise]\n\n\n\n\n\n\n\n\n\n[laughter]\nNo [laughter]\nNo [laughter]\nNo I'm\n\nA\nI'm a I'm a la la la la la\nLa la\n[noise]\n\n[noise] right [noise] [noise]\n[noise]\n\n\n\n\n\n\n\n\n[laughter]\nI Know um [laughter] I don't know why not [laughter]\n[laughter]\nUm I [noise] [laughter] um [laughter]\nI Know I'm going oh my\nGod why not [laughter] and um [noise]\n[noise] [noise] [noise] [noise] [noise]\nMe in my bag and when I see no but you know but he but you you you know I'm never going to lose\nThe new new\nLittle\nDog you\nCan [noise]\nDo you do\n\nYou think you said in the way you did [noise]\n[noise]\nYeah [noise] and\nYou know the would be tried ...\nSo you don't you don't love love love love\nWe live in ... well hey hey good I'm\nA little bit\nBut I Do\nDo\nDo do you\n\nGet to see all the way do you\n\nHave\nNo oh no well we know the the the well oh who can from Jim\nIn a I'm\nA young teenager anyway\nYou were in you know the man\nThat other\nGuy and I had never met him in\nHave a well well not recently she was not a bird in the seventies and\nEighties when she saw\nOr down the hill oh I'm Sorry oh no no no what I Need to know the game boy and a\nWoman in the winter and the more you know ... and ... and a and I'm\n... years old going back to\nMomma buffalo\nI'm surrounded by strangers low amount for a new mom well were there for them from a movie or\nA little slower and you\nKnow so many home a a one on a road another new one word of mouth or even how much no\nMatter who\nBreak at all levels and again my mom marine searching for shelter to learn and you know a lot\nTo do well no no no I'm not ... well not well we can shelters where a\nA na\nNa na na na na na na\nNa na na\nNa na\nNa na na na\nNa around but I Know I've got\nA\n... on one team or a a\nReal real world and if you're a no that's wrong to do when\nI'm Still a new\nArea\nWhere the um when I was wondering is doing and [noise] and I am Andrea\nAnd Ron jam raining there aren't as you know when\n\nI was wondering you know who they are going up man too much [noise]\nAnd [noise] and on top of the road runner near and\nDear to\nMy students [noise]\n[noise]\n\nOh oh oh oh\n\nNo no no no no no no\nNo and then ... you know I Love what\nMen do get the\n... no no no and all the [noise] the no no no no longer on boats and then come on you know\nMaybe you know when I was living in\nNew Jersey and they try and bomb making manual my man\nNo no no no no no no ... no ... no no\nNo no no for a while ago and a lot of ... I Know my mom made in Orlando\nAlone then not I don't know not in the mail is wrong the wrong none of them when\nThey are or were all the little or no\nAnd a lot of dumb down low for a loaded it up like when I'm I don't know the low ...\nHow does that or a girl that I wouldn't have any and all the way I really ... me today and so he didn't follow\nUp and there is a really well well well ... I Am not alone by NATO or a loan\nAnd then you know so little Ron ... that no lie\nAnd they had that in ... alone no oh no no no no no that while we were looking for a woman on\nThere so and I live in la la la la la la la la la la la la la land are older than I knew they were\nWrong wrong about Iraq but there are no no no\nNo no I'm In\n\nMy ... my ... well I don't know\nI don't know\n[laughter]\nAnd and and and Mm Mm Mm Mm\nNo man I go for that kind of got our hands and\nAnd and and and\nSo on and on and on\nAnd have a A R and learn more rain and\nThere are no end run around [laughter] and um and I don't know where your job and\nI ... and ... are you know I I Am and\nI'm a strong and and me and him and saying\nNo no no\nNo no no and I have\n...\nNa na ... well ... ... pm now one of my hotel room and that will be no they don't know well known that have you got to boil them\nThen the engines down loan money to go when she did\nAnd then a new way of meeting him now we're in a hotel room in that building on the mountain that have and you've got to bring it on them and you're yeah go where the woman he didn't want to know more than I\nAm in a jam one day\nAnd\n... down in their hand in it and it is a Yankee fan and I mean [noise]\n\n[noise] [noise]\n[noise] [noise] [laughter]\n[noise]\nOh oh oh oh you're a you know I'm a\nI was a well a lot\n\nI saw a boy\n\nI saw a lot you know\nMa is not a lot of there being [noise] about paying\nThem up in my in my mind that a man that day\nBy day ... there's been a little bit about my mom died about that day but yeah no I'm not young go about young going on now that\nI'm now a young girl na na na na ...\nGlow little [noise] like a ... a ... a month ago\nI saw it on a la la la la la la la la la la la la how long do you know what they want to do [noise]\n\n[noise] [noise]\n[noise] I'm\nNot a lot of men da da da da da na na\nNa na na na na na na na na da da da and a nine month I'm\nNot on a la la la la la la la la la la la la la la la land around a lot of them are allowed to\nBail them out there and my my name's Darren [noise] yup oh it was\nAbout a bad day in my day\nTo come and gone ... nah a group of\nYoung guy I'm not a young girl\nA about a lot of a lot of going out and buy low oh about a guy on the phone [noise] I saw a lot\nNa na na\nNa outside on a la la la la\n\nLa la la La Guardia\nMy mom's side and I'm not going to come by my name is Daniel about bringing a like\nA ... a law that banned\nThe young young going up and you're going to come\nDown with a la la la la\nLa la\nLa la la la la la la la la la la [noise] um I a guy\nOn the talk about the oil [noise] I was about la la la la la la la la la la la la la la la la la la la la la la la la la\nLa la la la la la la la la la la la la la la la la la la la la la la la la la la\nLa ma bought I don't know\nI mean I can be side a lot [noise] [noise]\nHello this is ...\nI'm from ... and ... they're going on how the whole puppy and I worked down here because he and then of course Henry Phoenix, Arizona and affiliated with that will run day museum board\nAnd I'm also a belly ate it with the hurting in the I'm bored and you're listening to a new Y. I.\nEighty eight point one at them so lightning K. U. I. dot net yard Native American\nPublic radio station thank you\nSee like you say to see like you did you say okay we'd like to say\nBye bye\nAnd I'll tell you what that will name as them for and I'm also a belly ate it wasn't the hurting at the airport and you're listening to you why I have one that's in line K. U. I. dot net good Native American public\nRadio station thank you\nHave to be like you say to the ... you say like you say okay we'd like to say\nBye bye Bye bye Bye bye bye a bomb bomb bomb bomb bomb\nBomb bomb bomb bomb bomb\nBomb but I don't I'm a\nI'm a I'm a I'm a my eyes on my on my mom my mom my mom was\nA funny but I'm In my I'm about I'm\nNot I'm not I'm a I'm a\nI'm a I'm On the na na na na na na na na\nNa na na\nNa na na na na na ... [noise]\nNo no no\nI'm from I'm\nFrom a friend of mine who was on the\n[noise]\nUm but\nOn the man who are you going to know my\nMother in law and order man [noise] but I\nCan you know the job is on and\nI'm\nI'm a I'm a I'm a\nAh [noise]\n\n[noise] oh [noise]\n\nAnd I'm a nurse\n[noise] oh\n[noise]\nAnd then the\nWrong\nWay [laughter] yeah\nMm\nNo ooh\nYou are listening to tell you why hotel uh eighty eight point one F. M. N. K. U. I. L. P. upper ... eighty nine point one FM projects or the Hopi foundation screaming on line\nAt KU why dot net your Native American public radio station new he noticed your\nChild when they walk for the first time it's easy for you to notice what their favorite foods are you remember exactly when they said hello in your\nNative language you notice when they do well in school and even what friends they hang out with one thing you may not have noticed is that they may have\nAlready had their first drink of alcohol nearly one third of youth begins drinking before the age of Thirteen when children start drinking early there six times more likely to have alcohol problems when they're adults\nHave a conversation with your children about under age drinking to learn more about under a screen revenge and please call\nEight hundred seven to nine six six six or visit speak with them dog S. A. M. H. S. A. dot Gov up to you by the U.S department of health and Human Services and the ad council [noise]\n\n... radio today on his temper gr normally don't hear someone when we're downwind from a black man\nAnd woman no no no Mary and all the big bang\nOut of California and they only need to call you right after national needed [noise] [noise]\nAnd\nThis is national native News I'm Antonia ... is the mayor of South Dakota second largest city wants to replace an eating Indian Health service facility the current hospital is one of several in the region not meeting standards of care South Dakota public broadcasting Gary Olival reports\nRapid City mayor Steve Allen juries working with the ... river rose ... tribes to seek approval for a new ice ages hospital Susanna hospitalist the courage it'd be in health facility for the Galleria officials have\nClose and hospitals emergency when\nAdditional issues same hospital has failed to standards of care mandated by the federal Centers for Medicare and Medicaid services on gold layer elder a tribal leaders have is to bring the new facility to a more convenient location\nNear interstate nineties and closer to bus routes housing and recruit with opportunities for students from western Dakota check\nThe tribes passed resolutions earlier this year to approve the effort for a new hospital\nOfficials also authorized to probably will help for domestic sushi in hospital and the short term at a new hospital when built that move is covered by the end begins self determination and education assistance at\nThe tribal health board would handle day to day operations while keeping federal funding due to historical treaty obligations for national leader news like your real and bold\nSocial justice issues facing Alaska Native people as the focus of the gathering this week and you know the first Alaskans\nInstitute is hosting the event with community members advocates elders and tribal leaders Monday's discussion included honoring and protecting needed women two recent cases have impacted the native community\nThat ten year old girl and cause to be a went missing and was later found dead\nEnd in Anchorage judges sentence demand to know jail time after being charged with assaulting a woman clean getting high to Indian tribes president Richard Peterson says the Alaska Native community has the power to make change and one step is going to the polls\nWere sick and tired of it right or you sick and tired of it\nThat\nYou know we can do to change you need a ... D Brad judges their their elected to power isn't us just turned on\nAfter we have to vote we have to be the solution because they're not we have to put people in there that represent all of us\nThe two cases have renewed calls for improvement and law enforcement the justice system and public safety across the state the social justice summit wrapped up Tuesday\n[noise] meanwhile officials have charged a forty one year old man with kidnapping murder and sexual abuse of the ten year old girl and caught severe Peter Wilson faces charges in connection with her death Alaska Public media reports\nA funeral was held over the weekend for Ashley Johnson bar where hundreds of people show their support for her family\nThe Bears Ears case will continue in Washington D. C. a federal judge ruled Monday cases involving Bears Ears and the grand staircase Escalante national monument will remain there in us district court in addition the Interior Department ... at least forty eight hours before any ground disturbing activities\nTake place on disputed land a number of tribes are fighting to protect Bears Ears in Utah from development the cases filed against the Trump Administration revoke Andrew replacement of the national monuments five tribes are among those to hold the area sacred including you tried the Navajo Nation at ... am the ...\nTribe attorneys with the Native American rights fund say they're eager to move forward with the case and claimed the removal of\nProtections of Bears Ears is illegal\nI'm Antonia Gonzales\n[noise] national\nNews is produced at the Annenberg national ... voice studios by going to broaden your corporation funded by law group provider of Indian law solution to buy the corporation for public broadcasting with\nSupport from the public radio satellite system for like ... are paid a A R P increase and connects people unique tools and programs help some sort of personal resources and tackles issues that matter most to individuals families\nAnd communities war at a A R P your dog or for Native American\nSo maybe there's this like you said the anniversary national NATO boy studios bike and want to broadcast preparation funding by loggers provider of Indian law solutions by the corporation for public broadcasting support from the public radio satellite system [noise] support might have a A R\nT H A RV free than connects people's unique tools in progress Celtics sort of personal resources and tackles issues that matter most to individuals families and communities for as a heartbeat dog or for Native Americans affected by domestic violence the strong\nHearts native helpline offers peer to peer support\nAnd resources safe confidential\nWhen toll free I think for for seven native program support by the national indigenous women's resource center [noise]\n\nNative voice on the Native American radio network [noise]\nThey see is native America calling on your host charity would when it first witness actually timber music makers take the stage in summer in ... Arizona has rocked the canyon it was sort of like someone recharge\nThe crowds battery never elders and long skirts Swain sweethearts dancing together and young people well they were jumping up and down and he kicked up a lot of emotions and if you want to see some of the check out our Twitter feed at one eight hundred nine nine native now they're seen\nAs something that might sound familiar something you've seen in your own\nCommunity when the blues band starts to play especially if there's someone from your own or just in tribal nation\nToday we'll hear from the black horse blues ban how special it is to see crowds react like this when they let their music travel over in through all the music lovers will also\nEight for eight or let's turn back to the band a with us today is Randy Peters from the ... nation as well as Rick perish from the shy ban ... Indians\nAnd they make up the black course blues band well gentleman um that was some good blue there people love to to get down and here's some of these great sounds I'm just even knowing that new song went out to a time to people how does that make you feel Rick\nMake her feel a greater speechless you know you get into this a musical business not knowing what to expect or where it's going to take you oh you want to do play music and then all of a sudden you're on a radio station and the music's me include your your ear\nYou're go wild and then unfortunately I started hearing the mistakes [laughter] but I Am my worst or whatever you call it but anyway it is awesome\nIt certainly is you know what we got more for you hang tight we have more\n\nOn it was very don't do well on the menu tonight\n... some of the traditional thing nice people for generations and they're still making a prized yet Nina talking today when I was for the next Native American calling me give you a taste of flavor ball game\n[noise]\nSupport by New Mexico community capital bringing the tools for success story emerging Native American enterprises including programs and financial literacy and business basics with microbes lending available to early stage native owned businesses information at\nTheir E. R. R. program dog or or five oh five nine\nTwo for two weeks to zero New Mexico community capital\nHelping make the impossible possible\n[noise] [noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise] [noise] [noise]\n\n\nSo what do you think about the blues make America calling is connecting you to\nToday tells on their toll free line at one eight hundred nine Ninety six to eight for eight and we will connect you with our guest today the black corners blues band\nWhat's going on and do some of that right now we're going to say Hi to Cindy in Santa Fe New Mexico listening in on the one hand and you've got your back and go hey your thoughts on these blues\nOnly on June and it sounds really great\nIt does and Sunni what is it about the booze that pulled you in\nOn all the loans just always going to go on and on the law harmonic lawn every theloop on going on on the far\nRight well thanks for sharing that with U.S India there in Santa Fe let's go now to Farmington New Mexico the sale of the Gilbert who's listening in on keys UT thank you for giving us a ring Gilbert you're on here\nThank you for your own um I'm just listening to you know working in Australia lights came on and I\nGot my it reminds me of my voice voice but now they're all grown up even if I were to go\nListen to a more [noise]\nBut um [noise] well it sounds good [noise] that's what I read your worry if I could get one that's about it but uh but yeah [laughter]\nWell let's hear from them and give birth thanks again for given to ring\nA and again you can join us one eight hundred and Ninety six\nTo eight for eight looks like we got eight CDs last plenty of time to to talk with the band give us a ring phone lines are open one eight hundred nine nine six to eight forty eight with us today are two members of the group Mr Randy Peters as well as Rica parish and gentlemen I'm\nBeing one of your callers Gilbert says that it sounds like some\nHis kids or even a band from home I'm any thoughts for our callers go ahead Randy\nOh thank you very much [laughter]\nAh oh I go back to this one are you on the radio station here I'm like Rick said we're we're\nWe are a lot worse or they can can you know if this were\nA group or do you want a nice you know where you're cooler or I'm\nReally went when ... when you when Rick say things like that that just means that you just want to make the booze better and better and better than some good stuff [noise] um let's connect you with another caller we got Alan in St Tina brings go listening in Allen thank you for giving us a ring go ahead you're connected to black horse blues band\nNo go ahead Alan\nI'm missing the first time I heard as bad and there's a pretty good I like to do more of them\nAre right you know what else can you can have that you can have that right now let's go ahead and give you some more black horse blues band uh we're going to go to their so nothing to lose right here on native America calling these are our September music makers\n[noise] [noise]\n[noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [laughter]\n[noise]\n[noise]\n\n[noise] [noise] [noise]\n\n[noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n\nMm\n\n\nThat's nothing to lose by the black horse blues band can connect directly with them right here at one eight hundred nine Ninety six to eight for eight let's go\nNow to another caller we're going to say Hi to Lisa in ... California listening in on PG you way Lisa thanks for calling go ahead you're on here\nThank you thank you for taking my call 'em I'm embarrassed to say that I've lived in this area which is right here in like a shower\n[noise]\n\nThat's nothing to lose by the black ... blues band can connect directly with him right here at one eight hundred nine nine six to eat for heat let's go now to another caller we're going to say Hi to Lisa in Guatemala California listening in on cagey\nAnd way Lisa thanks for calling go ahead you're on the air\nYou know a company takes no personal you know in ... Richard make things happen so definitely like to get out there where you are Melvin we'd like to get over it a lot of places Arizona especially there is such\nA wealth of the people the ah the blacks are they're shocked or Arizona or Robert and Raquel have just been just\nSuper super house to us when we were there and the real love it and the other about what I have to say\n[laughter] well Rick I'm we\nShared a little bit of what you did when you were there and Sean too I'm asked him to the festival this summer the rock canyon\nFolks are interested you can see with the man looks like but you can talk directly to the band today it is actually timber music maker I you can give us a ring one eight hundred and Ninety six to eight for eight to talk a one eight hundred nine nine native and that's our Twitter handles to\nSupport by New Mexico community capital bringing the tools for success to emerging Native American\nEnterprises including programs in financial literacy and business basics what's micro lending available to early stage native owned businesses information at N. E. R. R. program dot org or five oh five nine\nTwo four to eight to zero New Mexico community capital helping make the impossible possible\n\n\nTo live\nIn\nA\nI'm\nA\nHome [noise]\nThanks for joining in here June Native American calling them turkey went from is not apply blow angering reserved space for some native\nBlues today and we have the black horse blues band with us in all meet a band with roots in the ... nation and if you'd like to talk directly to then during the conversation by calling one eight hundred nine nine six to eight forty eight\nAnd when you are one of the first ten people to do so you don't get a copy of their album courtesy of the band we are ready for your calls dialing\nAgain one eight hundred nine nine six to eight for eight and it looks like a we've got a couple of more CDs laugh I with us today is Rick perish from the ... band of Indians also with us is Randy Peters from the pony nation\nAnd both of them are joining us today from California\nAnd they are two other members\nOf the black horse boost gentlemen thank you for being with us and the folks they want to talk to you know let's try Martin again and who is in Warwick Rhode Island thank you for giving us a ring go ahead you're on here\nThanks for taking my call and good morning good afternoon\nHe is Rick parish some ... band of Indians also with us is Randy Peters from the pony nation and both of them are joining us today from California and they are two other members\nOf the black horse expand gentlemen thank you for being with us and the folks they want to talk to you know let's try Martin again and who is in Warwick Rhode Island thank you for giving us a ring go ahead you're on here\nThanks for taking my call and good morning good afternoon [noise] from rainy Rhode Island and the first of all I'm listening or in a chair your job your direct you know the answer to that streaming\nI haven't been for the past three days twenty four hours a day or just absolutely love this station that's number one number to try and keep to the black core stand and many other beers for\nKeeping us old truck driver who's a week for forty years on the road you guys Chester\nI Love your music where you where you can build from one extreme to another and just take care of reaching melts you guys are just\nTrickle people so here's your is your role large make sure your station with everybody is I really appreciate that and uh on are you gonna hang up ... probably about ... said she for K R B music for being there and being showed very entertaining for my wife ...\nAlright Martin Rhode Island's got their ears on how about you wanting hundred nine nine native thanks are given us a ring and Rick I'm any thoughts were connecting in Rhode Island and in Martin likes what he's hearing\nYeah just faking again ... ... uh\nUh uh\nSee our music can you hear of music and it's a I've never heard that before were just nails right into another and go into another but thank you thank you thank you for that and we'll keep trying that\nSo um but yeah we're happy to be a than a bomb\nOr doing our thing is we're going to go to get this coming weekend and are actually two of them this for many weekends are we going to get a practice and get a rehearsal in and uh you know turn it up here or ears and what have you and er [noise] but again thank you very much often\nAlright thanks for that or we're going to go now to Gerald in Albuquerque New Mexico to gain today and keen William Gerald thanks for calling go ahead you're connected\nHello I'm a spent many years in Memphis, Tennessee\nAnd I wanted to congratulate church ... years\nI'm southern rock blue sound but you out and ... I was wondering where you've got most of your influences far although you have some very original sounds being Native American and argue plane even more cars around the Albuquerque\nTowels Santa Fe area the big polluters uh festivals going on around here\nI write Gerald Randy tells a little bit about some of the influences\nOn my lunch break your girl we sure that um oh so am I influence the way back like I'm ... I'm\nI'm forty waters Johnny winters I don't ... I'm\nListening to these guys all my life and those are my influences you know like that or even the newer like the the ... a ... I'm John mail\nI'm even some of the sun with the older ones\nThat are that are out there you know she couldn't walk or um [noise] those are so many so many um blues artists out there um it's hard to remember what his name\nRight now [laughter] what were you on your list is is pretty good in in you know something to do often he's put some of the music that you're hearing today right next to some\nOf their ... influence them and it's it's a fun thing to do I do it often um thank you for your call\nAnd Randy we hear when we go through this album we hear different styles of blues and tell me a little bit about them a sampling these different styles instead of just sticking to one\nOr the styles of blues that we have that's ...\nYeah you know we got a little bit of that Memphis fail and we have some a blues coming to us sometimes feel like it's a little ... and you know you guys go all over with what's your plane and then sometimes some bands they just stick to one style um you know why why so diverse\nWell that's that's that's our\nThat's our stuff that's like um [noise]\nWe live where diversity like we we we like a Chicago style you know are like ... he's a Chicago blues man he's like Sonny boy Williams says Mr all night\nI'm and I'm a ban ban handful each like into like a little Walter I'm Johnny winners either way on a\nJimi Hendrix\nUm we all love God oh so you know I'm just bass player but [laughter] I I'm a but it's hard to I taught myself I let it slide 'em but a sound\nDot com and tomorrow we hope you'll join us we're going to take a look at the wrong small game play in her native nations thanks for a coup here at native America calling\nAs well as national native news and needed voice one I mean hosting producer turkey would [noise]\nUh [noise]\nOh [noise]\nOr Santa or can I add real resort and casino and on average falls or presenting like they changed\nTheir annual meeting of American music awards hosted by Williams Henry on friday October ... well that seven\nPM tickets during the gala honoring achievements of today ... native\nAmerican artists plus performances by W W wing and country music star Mickey dreams and so much more available now at Seneca Niagara casino dot com and old ticket master locations support\nFor this program provided by the University of Tulsa College of law offering a one hundred percent online master's degree program in Indiana law degree can move your career forward and help you work is actively\nIn Indian country deadline for spring applications December first info that law dog you also dog we knew slash energy All right bill\nMarket calling reducing the number of national NATO in Albuquerque New Mexico\nBy quantum broadcasts operations a native non profit media organization [noise] funding is provided by a corporation for public broadcasting support from the public radio satellite service [noise] music by Brent Michael J. then later voice on the Native American\nRadio network you are listening to tell you why I what Bela ... point one F. M. N. K. U. L. Y. L. P. upper money can be\nEighty nine point one FM projects up the whole foundation streaming online at K. U. Y. dot net your Native American public radio station\n[noise] [noise] what am I drew Albert warmer lied you can do or do you\nDraw a line in [noise] [noise]\n[noise] [noise] [noise]\n[noise]\n[noise] [noise]\n[noise] okay British ... you're trying to show when I tell you I Love you\n\n\nMay not a problem that that are and where I got excited about that one\n[noise] [noise] [noise]\nNow known by the older you\nAre and why why why [noise]\n\n[noise]\n[noise] [noise]\n[laughter] [noise]\n[noise] [noise]\nLast over and over I don't want to be doing\nAnd why are you\nAnd in\n... and [noise] and\n... and do all of the adult than what they do so well and\nDo a little while [noise] and\nTo\n... or ... or buy a new album with a woman I view it all I can do is make your ...\nAnd ... a little\nLonely\nAnd\nI'm\nA loner\nDe la la\nLa la la la la\nLa la la la la la la\nLa la la la\nLa\nLa la la la over\nThe ... is a for a while my man and\nA a one way or the more powerful\nMan on the bed and I\nNeed a ban on a ... year in Norway ...\nEven though I don't know when ... when mine were not ... I'm like well you know they don't already have a timer\nOn my name is ...\n...\nThey are all around the ... the na na na\nNa na na\nNa na na na\nNa na na na na\nNa na na\nNa na na na na na na na na na na na\n\n[noise]\n[noise]\n[noise] [noise] [noise]\nMhm\nI think we're going\nTo need\nMore on\nWhat you're going to run the warring stricter were Russia and all of your air dug up there all your bag or a girl role models and trust Bolger\nNumber ... ...\n... very naturally to me walk more when I'm all for more than ... Georgia ran around in a long\nTime for our ... in Oregon now or you know more real short but there\nAre a lot going on over and over and over and over and over\nAgain and your ... year old\nGirl and her name or you're not\nOn my driver and you're not\nIn any direction\nAnd I don't get\n\nMe read every day and it was really only one\nIn New Jersey you're\nAiming why your old oh joy will do that without a widow who don't most of them are in\nThe long run [laughter] ... bomber\nHe ate all\nDay long [noise]\n\n[noise]\n\n[noise] [noise] [noise] [noise] [noise]\nThat's\nOne that he may have a Monday and much Afghan no Laurie one young man behind my door ... ... ... it's hard when you I'm a night Ken\nBut rain but yet that make you know happy but twenty ... twenty four team is the first attendant\nGood evening I Am sorry when yeah my my hoping it's happened when I have quite a class and the village of ... my father's had honey I'm a senior and my mother ... my platform is focusing on special needs and speaking and advocating\nOn their behalf and letting society no people with special needs or disability or not to be excluded from our everyday like we're all human and all function as what I Am representing special needs and the hope these people as well and we'll do is go to the best of my ability or ... but\n... but the ... as well but\nYet feel it's them stop ... a new\nWay beyond behind my July\n... yet know what you need to be much there was no you should still mullah ... yet ... get that feeling that the deal\nI'm a radio station K. U. L. Y. I. eighty eight point one egg and hope you radio all the stimuli on line ... K. E. Y. I. dot net\n... come to rely on on the on the ... ... ... so great that is ... ... ... ... ... ... ... ... ...\n... da da da da da da da dum la\nDa dum la ... de ... them all there are like ... I'm On the you know ... I you\n\nKnow [noise]\n\nIn the world over and over are going on there were jobs were burned and daughter are not a lot\nThere were\nA woman to\nMake your own you know like oh what a word that are very well right now we're starting to make a harder over\nOur goal there ...\nOr do you do in order to do\nYou're a garbage man or woman do they\nMake a little worse you're the only thing I ever worked for the next day I was about ... very well right now we're very we're burning ... been writing on our ... our our our little boat and they are very well\nI Know they're ... and other options do\nI Do know and I'm sure we're going to do nothing but I remember being lowered rumored to go and live or die during our bird robotic Krueger no oh no not ... I'm not that\nI Love\nMeals a day or some\nOther voters are there are certain you know I don't know and then they go through some of her ... year old girl and then there were a goal or not there are a little out of Iraq and\nI mean do\nYou know corporate or they do not know that there was\nA a a\n[laughter] ha ha [laughter]\n[noise] and I\nAm Anglo\nAre courting words and drink and a murder Andrew Cuomo for our daughter burgers water right oh local garden center all day and\nI turned ...\nAnd I\nDon't know I Know Robert I don't know what to do and I'm not that are very aggressive now through rather than do gardening older they learn not ruled burns and now you know our our\nOur adult male mutual beyond just no\nWay [laughter] today [laughter] you\nKnow things are bad in LA or Orlando and as you are a lot of dirt you know there was all about it I'm not no not enough to\nShow how could you do you go there [noise]\n\n\n[noise] [noise]\nNo\n\n\nNot\n\nReally very they seem\nTo\nMe\n... oh\nYou're a\n\nStudent in New Jersey they\n\nRuled on the\n\nRoad to\n...\nYou know you don't want to treat to go to you know want to see\n\nMe at home and they ... ...\n...\n... ... ...\n\nIn the in the mid ...\n\nReverse new money but then it would be you\nKnow\nEugene you do with ... ... ...\n... ...\n... ... ...\n\n... ... ... ...\n\n... ... ... ...\n\n...\n... ...\n... ... Austin loves the beer and you are listening to KU why I Hope the radio seeming Ron lineup KU why high dot net\nAnd we have that many exciting to be here talking about possibilities of working with her being more of a whole people on warship oh\nI just sometimes we we restoring water why does the restoration of registering committed to\nWorking with the land to restore the watershed something that you have done for generations and in the face so global warming and climate change each one of the most important things we can do\nAnd we can't wait for having been invited ... K. you why I Hope the radio\n[noise] I'm a\nSingle mom long cab mom got old oh\nThey love it I don't know a little kid when I got a\nLittle bit more\nOn on on on online\n\nOr on the phone and by the people on\nNew or [noise]\n[noise]\nOh hold on while I don't know [noise]\n[noise]\n[noise] [noise] [noise]\n[noise] [laughter]\nOh I see the whole time you're going to be a while and I have a lot as a lawyer by the light at all or [noise] [noise]\n[noise]\nYeah I I don't know why oh why oh why\n[noise] why\nWhy why ... is our own little oil well if I I'm not I learn\n[noise] [noise]\n\n\n[noise] [noise]\n[noise] [noise]\n\n\n\n[noise] [noise] [noise]\n\n\n\n\n\n\nI Believe in you know and I won't be back more ... than\nYour own you know if\nYou want to know oh you\nKnow I'm leaving you want them to do won't know about it yeah\nAnd\nThen we'll\nGo\nTo\nA man\nWho\nYou are listening to KU why what below eighty eight point one F. M. N. K. U. I. L. P. upper one called the eighty nine point one FM projects do the Hopi foundation streaming online\nAt K. you why I dot net your Native American public radio station\nParental involvement is to teach your child to school this is Joe ... president of the Arizona education\nWhether it's volunteering communicating with teachers on a regular basis\nFor helping homework we know involvement is crucially important so get involve working together parents educators can make the grade school year for every student in Arizona a message from the Arizona Education Association\nMm [noise] yeah we got a you don't hear will do California are you I Want them\n[noise]\n\n[noise]\n\n\n[noise]\n[noise] oh no no no no way to marry my\nDad my dad [noise] I Know I [noise] my man that\nI heard you're\n\nSpeaking to them\nAnd they show on the way in in your health law\nYet but I'm not sure\nHow long did you feel like\nMaybe three and a man\n[noise] oh no no no no no\nNo I\nAm I Am a and when you are\nGoing down [noise] and I asked him [noise]\n\nAnd experiment on I said we don't\nReally\nKnow what they're feeling but they [noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\nYeah I Know what to\nDo you go from here with the hotel California coming up until you are born one\nBlack really\nShows John me that they know that and\nIt's gone man they know manage it all out in the movie and I did that\nAnd\nThen around and you know on may know him de dum de Leon ...\n\nAll those green\nJobs and drove me but then a man did the\nMortgage\nThe gunmen who didn't know that\nThey\nMe all the way they could\nDo the lord around the know would you know the old around with you and he told me about it he told me\nWas the the the the the whole thing [noise]\n\nYou know in the late night and then when they made by\nThe name of the big bang bang bang bang bang [noise]\n\nDid you meet a lot more of a mind and lie down on my way\nTo do with a look at it in the in the\nMeantime homeowners being more in the wild they bought the\n[noise] [noise]\nMm we don't know I read I read\nLittle um\nI'm going to rain down\nOn my knee\nI pretty much what we're\nWe are I'm ready to read\nA lot I\nKnow\nA little or no\nYou're not going to be a real um do you all\nOver the rain in\nThe law in ... I\nMean uh you know I mean I'm a A R o\nI did not move on my mind around\nFor a while they are a\nLittle under read in the\nLast thing in a lot I'm\nOn a you know\nI'm a I'm like oh\nPlease let me let you go oh jeez you\nKnow ...\nA\n\nLarge ruled by the county jail land the label that way when you're on the non band when we do not\nKnow that no matter what the hell do one thing\nThat you know all the drama and all the people that you want to\nGo and buy more by a\nLarge number three you did you ever did you tell me what to do a lot\nOf oh my gosh\n[noise] no no no no I don't\nWant to do we know loan money don't you know we can find a bond you wouldn't\nEven [noise] hold on one thing\nFor him but it's one of the big brain trying to make it around a lot of my ... year\nOld [noise] [noise] [noise]\n[noise] oh yeah nothing like I always figure out who your Belleville when\nI got more meets boy if you got to do right over your ears you know you weren't on board wander around and say you are I Hope you know for my ... and I for one year Native American public radio station I got plenty of more than\n... you know I have an\n... am sure that\nI Know the first one going out to all the postal workers or whether all we got there were handling our mail from Monday through friday even Saturday of you are working on a Saturday or Sunday just went out to just want the mavericks are Nineteen sixty one mister postman I heard it depending if you've got all the post people they're\nLaying low maintenance but\nHe can find\nA\nWay [noise] you know\n[noise]\n\n[noise] now he can't do what\nHe meant by then and then\nI think [noise] and um yeah and then when they get in\nA way that only men in Miami and\n[noise] [noise] [noise] and\nWe were in a way I\nDon't I Can't I Can't I\nMean no nobody but nobody knows who they thought they'd be up to the beach and do you buy your bank shop in there that are being taught to stop the the dogs are barking she died they died\nDuring you know there was a\nBig fan of your main demented man [noise]\n[noise] [noise]\n[noise] [noise] I can and [noise] and on and on top\nAnd and [noise] you\nKnow you're anything in my Toyota visiting the main thing that hasn't been anything\nOn the plane\nAnd I don't mean to tell me about\nYour best bet the farm [laughter]\n[noise] [noise] and that is not that much of a\nA [noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\nYeah ... I've heard is regulated ... the big lord ... what kind of like a regular ... immigrants enjoy a genuine one and\nAnd now we're all well ... oh\n[noise]\n\nOh do you think you can go now to the gloom how it can ruin a guy called me in the bar and you're like me in the form of going on in the mining\nFrom Montana\nAnd you'd think you can\nGo and do you get your extreme in your book go a jerk but I I Am more of a cold and rainy and\nTalk lots more than ... and did you get\nA walk on well did they will lead a role in my Jane Harman [noise]\n\n\nOh we should all the way here to answer because we're going to cause any like any\nOh we should at least you know and then we go oh my mom did you hear me now I Do a little while and all of this in order to enter what we\nLook at the grand a year and what we are [noise]\n\n\n\nDonald ... my only thing\nThat you know I mean\nWhat do you think\nPeople were telling me oh I'm a big thing about a mile and a\nLittle while and then all of their own or do you do and what we are what you can go and we just you and your friends or\nOne of the joke on the Internet [noise]\n\nBecause due to lose one of the older you\nKnow [noise] I got my Marty I don't want to hear\nYou I mean one [noise]\n[noise]\nAh and ah [noise] [noise] right\nNow and [noise] and [noise] um [noise] [noise] [noise] [noise] right\nAnd wrong\nOn the road that we all want to really yeah\nAnd and all of them were in the\nAir and bourbon or this gray hair or better than the ... where are\nAll in cash and [noise] that you know the ... men\nAnd women and men and the guy or a test on you or\nYou do all we well we do\nThat or the trees that we\nShould [noise] be it may be\nBut now you know there\nNow I don't like to know that we did it on and\nOn other than to live my life\nThat we did it on one night than being more of your friends you know I Do too\nNo they're not\nGetting paid the night and day by day to be in your bag being that better than the non guy\nThe guy I mean you know I mean do you mind telling me about the ... by that given by you know they're not in not come in and you've been you know\nOne day we read in how we did I Know one of them on a lot of man yeah they\nDid is I don't know I I don't know one of the law\nThey say that they probably died overnight you know I'm\n\nA I'm a [noise]\n... why I support it in part by volunteers from the community key why I volunteers are students take me to members can provide a unique on air radio experience for our listeners in northern Arizona the key way I dont\nThink since the your contribution to hoping radio G. Y. I. eighty eight point when they go\nYeah no I don't know how\nYeah I've been a volunteer for the past me the seven years now we're here to tell you why station jamming out with music that I've been playing\nFor all those years and I walked away for a while maybe about five years now\nGot back to tell you I missed it so I came back and I'm joined K why stop again it's a long career so if you come down here and Philip application\nJoined us as a volunteer and help with our we've got a lot of things to do around here to we can use your help to have a bone here but I Want to say a special thank you for our newest volunteer and she's been helping us you'd be doing real good job her name is Joyce she's been here for what should we know\nReally I guess I'm wrong three weeks so I got to find burn up to her she's a\nShe's a she's over here helping us up we appreciate her her help that she's been doing over here to tell you why station so I mean I just went up to her like very thank you very much from the ... station staff and everybody else out there to push a church to\nHelp you I get no matter\nUm na\nNa na na na na na\nNa na\nNa na na na\nNa na na na na na\nNa na na\nNa\n\nNa na na na na na na\nNa na\nNa na na na\nNa na na na na na na\nNa na na na\nNa na na na na na na na na\nNa na na na na na na na\nNa na\nNa na\nVe land that needs to me that in fact Hi I'm Janet Hi this is Eric and die or the whole uh my name is Hi I'm Jim boy and you take\nOn a on a\nReally [noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise] [noise]\n\n[noise] [noise] [noise]\n[noise]\n[noise] [noise]\n\nOh no\n\nNo no no no no\nNo [noise] [noise]\n[noise]\n[noise] [noise] oh\nYeah that was back to back ... creed right there I Would like to go to I haven't heard the music for a while I thought were over there\n[laughter] or I Hope you are too good for you guys are you [laughter]\n[noise]\n[laughter]\nThings like that but I think maybe\nThey were back in\nTime for our\nBedroom Andrew\nWhen you're on your shoulder\n\nWhen\nI'm In my\nRoom during\n\nA number of\nNo no no I don't know\n[laughter]\n\nI\n\nDidn't know what\n\nI was wondering too much and it's true that were on so\nThere were\n\nSome winter [laughter] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise] no doubt\nK. U. I Hope you\nKnow beautiful down and hoping that\nYou have to there's a beautiful day outside lots of fun lots of cool air near getting full time role don't forget to get those jackets out and get them ready to start putting your in your stove inside your house because I Know you probably took 'em all ready for the summertime\nIt's called dark jumping those work getting ready to your wholesome Cohen some work to your house yeah it is going to be a time of year again we're going to be all shoveling and everything I say I wish summer well here\nIt's too cold yeah I Know that's what everybody will say if you are worried about anything out there or not the San Fernando\nBars bearing right down\nTo be happy to be happy to I Want to look like we have some drama but when you may get a loan whoever is the new may have been ... dog or wherever we got\nTo know where is the only way\nTo go on\nFor about\n...\n[noise]\n\nYeah\nMy outlook on raising the fee and we ... we will from that will bring nearly body down so don't worry be happy to be all the way you may have\nBeen trying to do is we have the all the way I really\n\nDon't\nTalk about\n[noise]\n\nYeah Joanna [noise]\nAm I\nAm [noise]\n[noise]\n[noise] I Can't imagine I don't\nThink I kind of bring it back like you I bring it back in the car with the job and you tell me that [noise] way way way way way where\nCan you give me one of the day and then they just didn't know how you know well\nNow I don't know I mean the main thing is how\nThey're certainly [noise]\n[noise]\n[noise] [noise]\n\nOh I heard\nSomething about do you want to do a lot of people I Know they're not\nNo no no no no no no no no\nThird survey [noise]\n[noise] [noise] [noise]\nGet a job pulling the Lakers you want to put you on what the brain that um they told me that later I got the three Baltics above ground I mean did you like another one but pretty good they show how did the only bad why am I don't know do you still don't know what\nYou need them to go up by your level in the window of time because you\nDon't need to do with it [noise] did you when you when you put you\nAt the end they don't let the kid in the world will look\nLike something better but\nThe one that women need to get the government now by the name of the sheep and the mood like his old job we should bring him back to ... but the you know what you like to put the other than that I don't know but we're like that do not read them play ball that you know right I Know you've got to take a ...\nBut I don't know what the lady I'm Alive and you know where to drop drop in the ... how do you want to know me don't be fairly\nBig wet it my way to do\nWith it and you can you can do anything we just we need the\nMoney they're making\n[noise] [laughter] [noise] [noise] [noise]\n\n[noise] [noise]\nYeah that was a real good for their ... with it on the wide for one I got some parents were coming up on next shake it off on Telluride for one\nThing that people have to tell people to do this\nDo for people to\nStart\nThe\nBay area and I have to pay\nThe bad thing would have been a bad day they\nDon't like\nThe people\nWho may have been\nPaid for my main thing that way\n[laughter]\nI think well you know down in about a lot of dirty dirty serve her well\nTo cut down to the man God right just like oh my God I've taken that had a baby shake shake shake\n[noise] [noise]\n[noise]\n[noise]\n\n\nYour prayers were partner with drinking all listened to tell you where are they going to want your Native American public radio station a project of the nation I'll be darned wrong that are being born or your guard so keep your radio during her blocked by me to play again what's going to get up and go on a ... from\nIts jak road here that that\nGuy and the combat role models were dying don't come back no I don't come back role model my when I called back long were\nYou guys don't go knock on wood oh my God I'm not you know I Do not own model we don't go not no\nNo no no no no no no more no more [noise] [noise]\n\n\n\n\n\n[noise] [laughter] [noise] [noise] [noise] that\nGuy and don't go overboard on why don't we don't I don't know I don't know I don't know I don't know that\nWe don't want to normal no no no no no no no no\nNo no no [noise] [noise]\n[noise] [noise]\n\n[noise] [noise] I don't\n\nKnow when you have a A N my the one now but I Know my ... behind my the one now I'm a little more than ... but\nNow let's hope a tiny Seventeen twenty eight my name is but in my opinion is I Am from the villages somewhat but me I Am the twenty Seventeen tiny team it's helped me and my ... from it\nYou have to\nFind out about the weather out here now they know brand new but I I when I ... I thought you were talking about and shopping\nDot dot dot the pups off the you know I mean do you stay on ten years from now on top\nBecause people but what I\nYounger readers may need voices and then now clear is really sad for me to share my key\nYoung readers may need voices and the mouse clear just poisons bad me to share it you\nKnow a mystery readers may need to read to you Ron ... they had them look marriage and eat and you cannot remember where he left his favorite parachute and\nOlder children may benefit I'm discussing what they're reading and answering your question about the ... what do you think the main character was thinking there what do you think what the central\nMissouri her children develop as a lifelong readers oh this is Joe ... president of the Arizona Education Association will\nRuin your children early an awesome Marie so I have a lot from my courage reading in your home visiting the library\nAnd letting your kids to do multiple subjects are either natural curiosity was book reading is looking for a lifetime of learning a message from ... Education Association\nYou're listening to you what I ... in K. U. R. I. L. P. upper ... eighty nine point whenever I'm Roger go the Hopi bone they should and streaming online that January I don't ...\nYour Native American public ready oh ...\nYou're listening to tell you why I quit villa he played one of them and tell you why I L. P. O. from a puppy eighty nine point one FM hello this is ...\nAnd ... and you are listening to a point when if there is hope you already a gym in online at ... I met a project or the whole paper and they shouldn't\n[noise] mine was\nIn\nThe body that don't want to know that well her lungs were not carbon in the day that they can\nThey do well now [laughter]\n[noise] [noise]\n[noise]\n[noise] [noise]\nAnyway the making but you know you're\nIn trouble [laughter]\n[noise] [noise]\n[noise] [noise]\n[noise] and\nThat that show the mind of a silly and you know if you want to know that that sounds about what\nI mean it's all the time we didn't get that besides the little topic did you find that got Donald sibling me have the last decade has been covering jak helping army that's been on top of\nThe time I have no one pops\nUp again [noise]\n\n\nIf\nI don't even know really I don't know\n[noise] [noise]\n[noise] [noise] oh [laughter] oh [laughter] [laughter]\n\n[noise]\n\n\n\n[noise]\n\n[noise] [noise] [noise] [noise] [noise]\n[noise] [laughter]\n[noise]\n\n\n\n\n\n[laughter]\n\n[noise]\n[noise] [noise] I'm\nFrom\nI'm from I'm from I'm from ... ...\n... ... ... ... ... ... ... ... ...\n... ... ... ... ... and ... ...\n... oh [noise]\nOh and then you do in your so who knew\nIn New Jersey oh in the in the ... [noise]\nI don't know\n\nI'm a\nI'm a long [noise]\n\nThat you could read a a ranger I'm a very aware of where\nI'm I'm I'm\nA I'm a little more ah\n[noise] [noise] [noise]\n\n\nMm [noise]\nOh oh\nMy little one you know\nIt's really easy easy easy on the other hand you know\nWhen you move\nOh\nWhen ... when you when we do\nWe do when you know we didn't do any gardening or the needs to be getting a\nLittle small because you don't want to know who should be allowed to do no harm him\nOne time before nighttime and he just returned from nine to ten painted on the right thing is that they're putting the money on it and do you do you mean like two\nAnd three in the morning I didn't know it didn't really\nKnow me know if he hears keys and teasing you may be\nYou know\n\n\nHe did not just the fact that I can imagine the\nLodge I Am not to send it to\nMe that the number to see them on the other one was the one with the one in ... and you know when you when you get up on the head of the\n\nMoney you know she is you\nKnow maybe maybe you may be it on TV you know\n\nYou\nHave the game saying you know\nBy the time and [noise] and when you come back on the [noise] [noise] [noise]\n[noise] [noise] [noise] [noise] ... well you\nKnow on a ...\n\n\nA\nMan named thing\nGoing on for about a\n\nMan [noise] you know like the man\n\nThat make\n\n\n\n\nThings on\nA bus\n\nAnd you know like a man from\nLow\nPaying\nThe\nLa\nLa la la la la\nLa man you know the young man\n\nMan [noise]\n[noise]\n[noise] [noise] [noise]\n[noise]\n[noise] [noise]\n\nAnd I mean\nI don't know [noise]\n\n... ... you\nKnow and and and [noise] and\n[noise] and as a\nBad [noise] and then\nUm\n[noise] [noise]\n[noise] [noise] [noise]\nAnd [noise] and [noise] and and\n...\nA night\nAnd [noise]\nAnd\nOh my God oh my God [noise]\nWell well\nWell well I mean [noise]\n\n[noise] yeah and\nYou\n\n\nKnow [noise] [noise]\nI Know you know [noise] [noise]\nNa na na na na na na na na na na na na na na na na ...\nMany of the time or ... ... ... ...\nYes or no no no no more they\nCan earn their then the the new ...\nI'm ...\nI'm just ... to ...\n... well yeah you don't expect did they man oh man well new long ... long haul ... ... oh about\nA a\nAnd I don't know who's not been bad or ...\nDream\nIt was not been better known others ...\nDream that not\nBeen should choose to ease\nThe line or I ... well no no no and I think I'm\nA I'm a ... row and I can move on to watch\nGolf ... dream that was a guy in\nA dream in my ...\nMy knees blood to back down in the reserves and lily\nJane ah what's a\n\nGood clearly see that you see in a way to the\nGenes or was rely as we\nGet on my own and do they call the may ... come to the moon and the a ... there's an hour they're saying right here in\n...\nI'm All right you know\n... we can't be ball around the\nNa\nNa na na na\nNa na na ... the dry here you\nKnow ...\n\nWell they're\nAll in all the during the fall\nOr you know I Do\nI Am a runner\nNamed ... ... do 'em in the news on and on\nAnd\nOn\nThe ground or at or near you\nOr you know I Am a young but I Am\nA\n...\nAnd [noise]\nUh do about Iraq and Iran or Iraq or getting married and you know I don't I haven't been\n\nI'm a I'm\nA I'm a\nI'm a a a a\nBank of answering a maintenance make do and he's a man I knew there was this year they cry now they are saying well yeah but ah\nNow there's ... there's a real show you a it's kind of a\n... a ... ah ... ... they know a miserable does my grandma or ... wedding on and I\nHad a mayor ah\nOh I'm In a room na na na na na na na na na na na na na na na\nI'm On the line from a\nJob was\nUm\n\nAround\nMe in a ... have you on the line when we do is you know I'm\nA I'm a I'm a I'm a\nI'm a you know\nAnd so um are\n\nYou are listening to you what I Would do it he wouldn't want to them and tell you why I ... a promote a pie eighty nine one one I can project of the foundation streaming online at ... dot net or Native American public radio station\nExecutive order number zero one dash twenties or even the declaration of extreme by your danger open burning is prohibited within the reservation with men wetlands Rangel and farming area residential area near public facilities\nFireworks are prohibited the physician or used by work is prohibited due to the high wire danger fireworks will be confiscated by the law enforcement officers\nAnd or hoppy resource in worst meant services officers tempt buyers are restricted within residential area charcoal grill propane and which does are\nAllowed within a tenth what area of pay rather than only if it is clear up ...\nMaterials the fire must be constantly\nMonitor and control too I'm sure it will not become an uncontrolled fire no burning is allowed on red flag day as determined by the national weather service or wind sustaining when it's in excess of five miles per hour\nBeing hit by a newly declared that any violations of the executive order may be prosecuted in accordance with hope the cold\nAgain this is an executive order number zero one that when he started gene declaration of extreme fire danger therefore the chairman and the vice chairman of the whole picture I\nHereby declare that the state of emergency fire danger that it is burger declared the following restrictions and sanctions are nearby place within the boundaries\nOf the Hopi Indian reservation until further notice\nWhen ... Mm Mm\nOh\nI'm from a man jeeze why why am I saying yeah [noise] when I joined about ...\n\nHours on the main road off [noise] I don't do you mean no one's really going on all of 'em\n...\nGreta Van while I'm On the\nNews on I mean I'm On my hands in\n[noise] oh I saw on Long Island too strange [noise] na na na na na na na na na na na na\nNa na na na\nVe [noise] ha ha ha ha ha I don't want to remain calm reported being\n... ...\nYou know the main one I Know your job right now there's one on one and\n[noise]\n\n[noise] [noise] [noise]\n[noise] [noise]\nMan I'm from around managing a mom and a man of some strange Mm ...\nMm\nI'm going to be a\nOne on one hand I don't know why why are we going to a um one of the uh\n\n[noise]\n\n[laughter]\n[laughter] oh boy ... ... people\nAre really nice but I Know\nThese nice\nTo hear what he was just a little while [laughter]\nYou gotta know stuck around ... am on the road a lot while I was going to say people that you know I\nDo remember the French are so\nMany things we don't\nLa\nLa la la la\nLa la la di di di di di di di di di di da\nDa da da da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da\nDa da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da di di di di di\nDi di di di di di di\n... ... ... ... ... ...\nDo what I Do hear when they had I had no idea that baby on the\nMap of snow in the middle man now they have\nTo try and just because I'm not I know that change on the road main um bad my\nMom and dad and mom now\nAnd then we have not been that way in Germany now you now and again\n[noise] [noise] [noise] and\nUh and\nAnd\nThat's the plan I been in a way may no there's no way to get a total ban on it\nBut I'm not trying to save up there and by the name John I live in New York and la la\nLa la la la ... one\nOf my adult life and and\nYou know James terrible terrible bending\nOver and and\nNow you know I enjoy it and I remember there\nWas\nNo [laughter]\n[noise]\n\n[noise] it was on hold and I'm In my hand\nYou know I use this year by you know and be home and Bill Maher denying them a job you\nKnow buddy Jim church today the judge in ... in the bedroom to a gym do it all\nThe ah in I'm In my hair and then are you\nFrom the little we call it I Know you've got a problem with your nominee ... would you do drugs should be on a problem with Joe one review mom learns from home but I\nHad one on one hand and I live in\nA pretty big you know the old but I Know voted\nNo more\n[noise]\n\n[noise] [noise]\n[noise]\n[noise]\n\n[noise] I joined the student a judge them first and then I ... I got a new at all or most\nOf them landed on the new to me you\nKnow buddy\nOf mine\n\nAnd my mom\nWas a little bit of a lose\nLose you know I'm a new\n\nMom my mom my mom lives in\n\nA ... year value on them and I don't know but it can be\n\nWell that\nFrom Marilyn gone in New York [noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\nI'm trying to\nTo to get to see the [noise]\n[noise]\n\n\n[noise]\n[noise] pushing to get into the dining room table [noise]\n\n\n\n[noise] [noise]\n[noise]\n\n\n\n\n[noise]\n[noise] [noise]\n\n[noise]\n\n[noise]\n\n[noise] [noise] [noise]\n\n\nWhich has been a\nLittle too\nMuch\nToo cheap\nI don't know who ... ... ... it was really\n[noise]\n[noise]\nOh oh oh\n[noise] [noise] [noise]\n\n[noise] [noise] [noise] [noise]\n[noise]\n\n[laughter]\n[noise] [noise]\n[noise] [noise]\nYour mind you they you know\nHe he goes\n[noise]\n\n\n\n\n\n\nHa ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha\nLast year or so you are a blackout\nLoans or anything to do things that go along with my family and your name on the world will be here\n[noise]\nYou don't you don't like\nThe only one\nMan [noise] [noise]\nYou know right or wrong wrong wrong wrong change the channel guy\n\n[noise]\nGee I now know dear [noise] [noise]\n[noise]\n[noise] no they [noise] [noise] no no I don't\n\n\nKnow I end my you know by now my ... my you\nKnow I'm a little more than ... ... ... hoping tiny Seventeen tiny my name is Sheila my hope you name it for me I mean I Am the village is somewhat but me I Am the tiny Seventeen Tiny Tim is helping and my platform is\nGood and then we shouldn't\nLet their love in the ... the lead net ... billion unless they won the biggest online now than I Am\nNot twenty seven twenty eight team is the first thing that I Am a ... my name is Robyn see I Am at the current client and I am from when I Am twenty Seventeen twenty eighth team is hoping for the content and lifetime primaries trial intervention\nNow how many how much can I can go the bond month now go gamble a net nothing less than a net he doesn't Seventeen to detonate you never can attend\nI'm Single yeah I'm ... and then I have no clue me and I and the two dozen Seventeen teeth as an Eighteen and my last primaries now mine and you know I myself am\nI say I am the ...\n... yeah now the empty and you know I'm happy life had a good day when it's hot as it is nice and happy Hi\nGood care of yourself and your family know\nIreland J.K you know I I look at eighty eight my one and and and K. E. L. I. L. E. up every month that'd be a nice my wife and I hope the nation dreaming on line I came I not next\nYear Native American public radio station and it's going\n\n\n\nTo show who is your mom but she knew and again we'll let you know smile smile oh my goodness oh\nOkay I guess you know\nThat I Want to act you know none of them will go around the\nYou\nKnow one way or the bones you all do you live with your friends happy that I\nDon't know\nMe will come along with many\nOf them and go round like oh no\nNo no no no no no\nI\nDon't know\nThat you need all these things come a long way\nTo go on\nA on a\nNonsmoker I assume we're friends with our whole phone so I don't\nKnow there is oh I Know that you\nKnow that's due to my love for them to go around\nAnd now I'm In a\nGod love oh no no no no no\nNo no no uh uh uh uh uh [noise]\n\n[noise]\n\n\n[noise] [noise]\n\nAnd when there's a um my\nThree year old I Know that the ... or their name and\n\nDonald around again like no no no no no no more of a nerve or they're they're saying no no no and then\nThe mind and go for a no\nGo area a lawyer says that the Mayor Bill de Blasio mode of those who are the way they are when they're being\nIn a row now\nThat we're in a long way if they don't want to know more or you know one guy who may or may be a man\nWhoa whoa whoa whoa where you go through a lot of the nation\nThey were a little bit of a ...\nA little girl and I know the role of the way that they\nHave already AOL or a whole new area\nFor a [noise]\n... ... ...\nBonus then then they ... the bad news that\nI had to do that they use the the way down the aisle but stretches the dar al\n... al ... or so left there and they're really good a book\n[noise] [laughter] [noise]\nAnd\nI said\nI have been getting calls in\nA long ball on the way you know law\nLaw\nAnd\nThen you should do the same Amy Poehler understatement even the I'm just trying to remember you can join the timing\nOf Poland and you know I don't think they don't want to do the\nSame time China getting golf ball on the way\nFor us to know those kind of known\nAll along\nA couple things all the talk of the day I Want to do the pain I can get a caller\nIn on a show on the\nShow to have a burning man\nI don't write China no la la la la [noise]\n[noise] I\nTake it back to me and tell me what you really want to do some more of\nA pattern in only get to know that I don't know what\n\nI'm trying to get some callers in on John Paul should know that\nChina no la la la la [noise]\n[noise] I read\nThe truck or on your mind you're not going to do with it I Try\nTo better protect the corn on the radar and you'll be out there right by my count her that she got me I've got right now\n[noise] I don't play golf and blah blah\nBlah blah blah [noise]\n\nYet oh raw your tuning in decay you why I eighty eight point one that's been there you just heard Molly with blue would be cheering Fiji just before that we heard from Bruno Mars\nOnly worked a magic J. guilty man must that got lost and just before that we heard from Confederate Railroad with North Korea\nI was so blue berry you buy fats domino and two star now this undercover lover by three plus for you that in a row obey all learn joined the music what keeps me going\nComing up next in the ... by Tony Lee coming up Iran KU why\n\n... ...\nCame to ... or ... I heard the story shows again do one every body ain't no law about ...\nManager at a ... here they probably\nAre and you are\n...\n... am\nBy word you knew who are we to us the right to treat you shut the huge ...\nWas\nHuge huge today\nAnd you and New Year's day\nIn\n\nA way you wouldn't draw her yeah he in\nA\nWorld has weighed in on the ...\nThe\n[noise]\n[noise] Mm [noise] [noise]\nMm [noise] on\nA\nJourney needs fresh for ... ... do we were really ...\nFor when does\nToday you can recreate\nA real live your daily each year and a roadway and we're you\nKnow the ... who will go all the\n\n... yeah yeah well\n... those\n... are you today\nOn a ... world\nIs waited on love you beauty the\nLord is really a\nNew uh Mm\n\n[noise]\nOh ... and ... and [noise]\n\n[noise] [noise]\n[noise]\n\nNo way I I don't know what they say you're not straying started bombing shy or you know I\nKnow I I\nAm a\n\nOh for the phone rang and he never ran ran a church that man\n\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\nYeah [noise] [laughter] [noise]\n[noise] [noise]\nFor you know the child\n[noise]\nHard as you know and I\nGo to Miami [noise] learn though the\nMan of the bed and they don't really know\n[noise]\nHow\nLong we man and he knew the Oregon dream and [noise]\nAnd um she ran out of\nThe man show I'm sure they must do\n\nBetter than\nMine too\n[noise] [noise]\n[noise]\nAnd the bathroom dollar range mom\nShe\n[noise] around [noise]\n\n[noise]\n\n[noise]\nHe turned down a little [noise] God\n\nThe border will be\n[noise]\nOn on her knees you know the grass though Tom Brokaw warming we're going down on them and they\nSaw my bell so [noise]\n[noise]\n[noise]\n[noise]\nAh right there you have ... and done with mama don't get dressed up for nothing ... just before that we heard the mouse with rock steady ease with which twisted\nBy take on me and and you know by\nTony Lee and you're listening to you why I ... when when the ... ... ... the\nEighty nine point one of them also you're dreaming on line at the Y. I. dot net your Native American public radio station there will be all I joined the music you're you're ... move in getting things done\nAnd enjoying your day still coming up I Am a\nForeigner with old that's coming up your own K. you why\n[noise] [noise]\n[noise] [noise] no no no\n[noise]\nYou know\nMy own and you'll be the one hand you know\n[noise] and um and\nI Know and\nAnd you know\nA plan you leave the white man just unreal [noise]\nAnd [noise]\n\nUm [noise] na na\nNa na na na na na na na\n\nNa na na\nNa\nNa na na na\nNa na\nNa na na na na na na\nNa na [noise]\nAnd\nI Do and I'm not your not on the floor and he said he [noise]\nAnd I'll be there you can\nYou tell me about going to go you go oh\n\nWell I don't know I don't know I\nTrue I don't know I don't know [noise]\nDe ya de ya de ya de ya de ya de ya de ya de ya\nOkay and they saw on ... so so were you know\nAnd and then no I don't know and you're back in ... and they're not done so do you know just rattle among round balls dot dot com law\nWe draw the line\nAnd we drive a little closer to be made to read the you know then we do find ourselves some young\nGuy here oh okay yeah I got ya got ya got ya got ya got ya got ya\nDe ya de ya de ya de ya de ya got ya got ya got ya got ya\nMe and and we go off his mom and a reminder that bomb bomb lonely and and I love when ...\nBought one we will garbage lined up when\nA guy and I got ya de ya got ya got ya got ya got ya\n[noise] job that you're a young guy no not a young guy got ya got ya got ya\nJob that you're a young guy young young guy John de ya de ya got ya got your\nJob to euro and young guy young guy John de ya de ya de ya got ya oh\nMy God we we uh money in there\nAnd and ... and they don't really know\nWhere they may not getting on the beach every week on a song and go as a Muslim ... de la ... and\nAnd and we've been married so I Do read them\nAnd they were in the store\nAnd she and I we're bringing those\nDogs well mom from a job you're going to be a\nJob that you're a young guy John John your job jobs jobs jobs\nI meant they're showing the job you're a young guy John de ya de ya de ya de ya de ya de ya I'll be\nOut by saying I Am\n\nA ... ... you're listening to tell you why I quit about what he might want to tell you why I Hope I'm from a puppy eighty nine point one ... and\n... [noise]\nMade it a new low later than being single role of the blue we use it\n\nYou're listening to tell you why I quit hey I Want to tell you why I don't know for months at the eighty nine point one and\nA little older than\nLow rated whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa meaning that they will go\nIn and the ... in the la la la la la la la la la la la la la la la la\nLa la la say no\nThey will ... will come in over ... years later ... various J. lo\nO lay\nLo o lo o\nR U ... de la la\n\nLa la la la la la la la la la la la la la la la la or or any of them will be\nA major\nLaw or share in the new law and order you one thing they didn't even\nKnow will be the new ... in the real on non or should or shouldn't who want to get out of it on and on by the way\nAround to show that it will ... will let you go yeah we did in the in the oval in you know that little\nOrange and blue and although you should go to\nLaw school\nAnd\nI remember I remember I remember going on you know and maybe most of the girls I\nKnew and\nWhen you're out of our ... our\nName to clean\n[noise] and the main [noise]\n\nAnd I was reading\nThe\nBook I mean the thing that\nWe\nWe will come on now you know we don't we bring me to be you know do you remember your your well\n[noise] [noise] [noise]\n[noise]\nNo I mean\nThey need to be here on the line I mean I\nThink all of them things that were ... they're going\nTo be the never talk to me the Iraqi Bowers and I'm like oh man\n[noise] [noise] [noise]\n\nOoh oh who\nKnew me me me me\nMe too\n[noise] [noise] [noise] [noise]\n[noise] [noise] yeah\nHello this is the same you know the fire management officer for me I Hope you didn't see closing the barn door is good enough for the printing this lurk work I'm with a prevention seem to their Pritchard with a fire prevention team\nThis year so not that don't gain with the wildland fire prevention team and you are listening to KU Y. I. eighty eight point one F. M. O. P. radio\nJust remember only you can predict wildfires the fire\nYou\nGot to go and get out of the\nOther day and you know a job but I don't just do one of the bottle run at it I just want to go over to do that online and yeah I Know you know they don't they don't they will\nSay oh what part of the navy but other than\nThat I mean all of that already and all that do you want to let us know when I did that\nChange and it's a more than just the young lady that intrigues me around\nMe [noise] [noise] yeah actually\nI\nThink every single piece of land like you belong to show that there is no when is the one hand painted too [laughter] I go oh God well that's true when people say that again [laughter]\nYou know say a leading cause the oh my\nGod yeah I mean I'm not sure that no one\nDay we'll try and take me wrong I mean\n[noise] [noise] ah me\nToo\n[noise] [noise] [noise]\nIt just\n\nWasn't really a new one or two in here and on the one\nDay I'm younger than I Am I'm what I'm Wondering why we talk about them different words I\nDon't know your friend died from it undermines like let the little girl I\nDon't know most of them don't go far no joy ride and let them go but I don't know why don't you\nKnow it's not true that even though there are no matter the by getting them all die na na na na na na\nNa na na na na na na na na ve\nBeen dying no I'm not going to get into your knowledge I I'm not getting your goal is to get into your New London I Want to go by re I don't know I mean I'll be your son now you are games like the\nOne that you're not running down the agreement I find it wouldn't be didn't even know what I'm saying is that he had no no no you don't want to get down to get them all men\nAre you doing my job and then no no no no no no I'm not\nSure why don't why do you see them be that the more you're going to get everything you did you get the light but he's I Would you would not I'm not a major I mean you never know what to do so\nNow does that do a lot longer than the ones that don't make them all the\nMen and the na na na na na na na na na na na or why why do you\nWonder if they did a good thing and it just yeah just like I don't know but he's out there that would not by marine on me when I read them or running away too much so far are you live along the long run I\nDon't do that is that you know you got a lot of those and they love their number one they're gone they're gone now you're there must have been a you know or\nTheir neighbor now now now there are younger younger better than what it comes on the line from the world while if I'm Johnny died and the bar by somebody up there might be\nThe number I Know John lied and who lives on the line with them in the market though\nThe na na na na na na na na na na na na na na na na na na\nNa na na na na na na na na na na na na na na na na na na\nNa na na na na na na ve earlier\nIn the man that Don McGahn na na na na na na na na na na\n... or ... or\nA day\n\n[noise] [noise]\nNo I don't know why you know and [noise] my\n\nWay out [noise]\nAnd\n\n[noise]\n[noise] no I don't\nKnow\nWhy and what we know\nAbout that [noise]\n[noise]\n\nSome one of my time\nMuch and good\nWay to make the whole thing and then they had to I mean the new ordering the old days when I\nDo\nHave a lot of the all the money you know we saw Ronald Reagan now a lot along the channel\n[laughter] do you have to go\nFor\nThe bulletin board and the little people and nice to have to begin with and then the man more than ... than the bill and to have a repeat of the things that will do\nAgain but I think they just ...\nThe John ... maybe three and a little oil said we were I Would love to do what they do they look at the\nSame thing and you know we have\nTo live\nYour life and not a\nBad mood I'm like\nOh why oh\nWhy oh man in that line is that the people\n\n\nWho\nHave done\nA lot of it is an older woman\n\nI'm Still on and on Tuesday and time for\nA day [noise] Bernie I'm hoping and I know and I mean come on friday on no no I was helping and unknown general ... and then come\nTo me is huge in some way to\nDo that my my number nationals and I do remember among them by national named after my mom and learning\nTo provide for them and they didn't pay and chairman of farming no wrong you don't drink either I allow and on the market and now I Know for me and I've been so him even the law and I don't\nKnow do ... and a number among them by now and um [noise]\nThe in the country for me and then he\nTurned the corner and drop some\nOf them are they do not believe in\nThe Trump tweet job in a way around there and say oh\nYou know my growing up and they\nDo from our number I got up from the from the chain of climate no on you and your biggest are borrowing more and now how I got very far from me would beat up\nBy now and go wow you know I'm not in the past ... they don't do me and I\nDon't know\nWhy but I don't know who's the lead in a given new polls West Virginia for the last\nDay and you know I'm I'm not but I Do remember my mother up in a\nWhile when no wrong you know and I remember when I got home I don't get caught up in you know\nMy mom on up either I'm a rabbi mine I'm\nBy no means to me around and you\nKnow and ...\nOh yeah and we and our our phone number that I Know that got caught up you know\nIf I'm On my back\nAnd run by my no by no means\nNo no no no no no no no no no no no no\nI don't know\nFor a man and a man and I got you\nOn them I guess I got you know the ... do you\nDo deep in my ... batch your rarely up a new\nYou\nKnow I've got two ... and then\nI drive so nice not to get there I assume I Know that's the bad and now the oil goes ... butter\nWhy should I Try to raise this when they the eyes\nHe owes so\nI've got to be on their own bias in the most\nI sacrifice anything what my for the state of the new ... and then by the drums and not it every day of rain and then my do you know mental\nNever again when you're young men travel the way up to reality a buddy\nOf mine that I Do not before I began\nGot you know on the ... and\nOn the body [noise]\nAh ... [noise]\n\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n\n[noise] [noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\nThey can\nDo\n\nFor you or that or you know we're not aware of where\nYou are listening to the way I Hope in eighty one after I'm streaming online at the Y. I. dot net and why I lp upper ... nine point one FM projects will be no peace foundation and your neighbor American public radio station\n[noise] [noise] [noise]\nA nice day I'm married and everything\nAnd you know the the light on the moon at\nAny minute and a nine year old ...\nMoney and\nThe candy and candy and you know a few hours during the beauty and getting the money go out and share the\nSame thing but yeah you have any any any\nCar service and they don't have enough money to live by\nThe news you can read he asked me if we can go online and read the novel I say you don't have any idea\nWhy am I going to have you with the way I mean\nYou have any you know you do when I said that he\nDidn't do well yeah they don't always go around the same in June and you know like you said\nA minute you and your and my only by\nJoel\n[noise]\nAnd I\nDon't want to make sure I'm In New York by us and we share the\nSame and the main thing you do yeah and you\nKnow\nThey go around and I made in your\nWay in a hurry to change me buying a new way of getting a new regime\nAnd lying around my man or a fee by\nMandating that by email badly on your hand on my way out again and it really is in\n\nOur our our law our our our our our all our our ... our our our our our our rattle roll\nAnd who they\nAre and [laughter] and\nNa na na na na na na na na na route rather not only one\nWho found the number of our guys\n[noise] I\nI\nAm an hour and a half hour to get\nMad at me and I wouldn't be here again you know when I look at it [noise]\n[noise] well uh [noise] uh\nYeah I'm Wondering you know they don't know\n\n[noise] [noise] oh\nI'm Sorry I'm On a phone call or is\nShe\nThe\nDa da da da da da da da da da da\nDa\n\n\nDa da da da da da da da da na\nNew da\n\nDa da da da da da\nDa da da da da da da\n\nDa da\n\n\n\n\nDa da da da da da da\nDa da da da\nDa da and you're going to\nBe in your backyard and by then the fact is that about do you love them and I\nDon't know I Do not\nThink and I know when they put these\nThings work out and da da da da da da da da da da da da da da da da da da da di\nDa\n\nDa\nDa da da\nBye bye Bye bye [noise]\n[noise] [noise]\n\nDo you watch that yeah I did not know you\nCan go to a\nDoctor and he just got on\n\nThe\n\nCourt oh well I'm sure\nThe dead joke corny grown worthy but also one of the simplest ways to share a moment when you're when you know all the same school\nLie done should take a moment and make your kid languished because dad jokes rule make your kid left today fatherhood dot Gov rocky by the U.S department of health and Human Services and the\nAnd that was the block there for all of you out there and we started a boy if you see are still not that followed by Marshall Tucker Ben herded\nAnd he loves 'em sleep with Mack the and the pioneers with your the tank so here we go with the clerk bring jobs [noise]\n\n\nOh ... oh no no Mary Jo ...\nFrom I ...\n\nI don't know why wouldn't raise her but I don't know where you saw him\nI don't know where it all [noise]\nLearn all\nRain falling from my mom or try to\nMuslim beer ...\nLike a following online um [noise]\n\n\nMany rain falling on ma ma ma ma I Want to do in my new\nOh\nLa la la la\nLa la la la [noise]\n\n[noise]\n\n[noise] yeah well my mom\nMy dry there now is on your dream or try to bring\nA little bit on\n[noise]\n\nWhen they're little bug drive right\nNa na na na\nNa\nNa na\nNa na na I [noise]\n[noise]\n[noise] no no no no no no in fact\nMayor and I don't know I\nDon't know\nI Try to make a\nStand there and try\n\nAnd uh I Try and make sure na na na na na na na na na\n\nNa na na na na na na na na na na na na\nNa na na na na na na na na na na na na na\nNa na na na na na na na\nNa na na na na\nNa na na na na na na na na na na na na na na\nNa na na na na na na\nNa na na\nNa na na na na na na na na na na na ...\nYou are listening to KU why hotel a eighty eight point one yep him and tell you why I Know the upper among Coby eighty nine point one out Sam project so he foundation screaming on line it KU why dot net your Native American public radio station\nGoing oh na na na na\nNa na na na na na na na na na na\nNa na na na na na things wrong with little time in the morning\nGoal and owner and I know about a young June ... and it ain't nobody or in jail and you know na\nNa na na na\nNa na na na na na na na mama that'd be fine yeah I don't know I Know\nI I mean I Know what I don't know and then I Want more and more now going\nOn and then an hour and a A R I ain't going on right now and now in our bank Cadillac [laughter] yeah I uh\nI had a long\nWay I Know what why not I mean I'm like no bold our time runs out\nFrom work and you know I ... and and I'm Don McLeroy I mock around a man\nAnd a half an hour and\nA half an hour and a half a mile and a one way or no no no no no no matter [laughter]\nIt's gone back to my mind around a na\nNa na na na na na\nNa na na na na na na na na na na na na na na na na na na na break or\nYou know I'm All right I have\nA camera and I know that I Am ... na na na na\nNa na na na na na na na na na na na\nNa na na na na na\nAnd during that time and [noise]\nI I I\nWas ...\nAnd I'm trying to call you to uh\n\nTo grow ...\n...\n...\n... ...\n... ...\nUm do you know ... uh does she\nDo ... ... ... ... we should come back or waiting\nOh I'm just talking about to borrow\nOr maybe\nA member of the day\nOur big ball real [noise]\nJust to have you know where he has all these little read\nA so called ... chair withdrawal more for a\n... year old man\nTell me how you made it\n\nClear your bullets with\n\nA dog you know ... ... ... ... more news to my best friends you know we just talk to him about to borrow\nMoney from you today on\nToo far room in her view but when you\nKnow look out for the same\nProblem with great care what's wrong or a\nOr just you know I Know and I'm\n\nJust kind of a ...\n\nD printers\nCar\nTire we're waiting for\nThe for\nA\nGood thing or a\nJunior or your\n[noise]\n[noise]\n[noise] uh\n\n[noise] [noise] [noise]\n\n\nNo but I end my you know I sound like a high and mighty one no oh no one can open on the\nNet and they told the tiny Seventeen tiny my name is Ben in my family my helping him is when you have any time I am clown pants and the village it's not funny I in the tiny teeny tiny thing and I finally\nCalled try and make sure\nThat they live in the end line the line now making like Anthony Anthony my the land that they get on line now my son's\nTwenty seven twenty eight team is the first to admit I Am a Catholic and my hope you name it and see I Am at the current climate and I am ... I think I Am that tiny Seventeen any team is hoping to\nFind my trial intervention now you know I have hope in my neck hiking the Appalachian\nMuch Nicole Gamble a\nNet net he doesn't say anything that an Eighteen I'm ... I'm ... now Jeff Merkley and I am the data thanking without an Eighteen and my finance now mine and you know I'm not so say I'm not\nI think I Am I I'm kind of like ...\n... yeah now we continue to Lynch I'm happy like how they get in touch with ice and happy and I think they can stop and your family\nYeah I Know you take came I hold on while I'm eating my wind and an K. E. L. I. L. E. up every month that'd be a nine point when and how they're gonna have to help the nation running on line I came I not\nNative American public radio station that's golly\n\n\nYou are listening to you why one\nEgg J. U. R. A. I. L. the upper ... one of the book project do you hope it for what they should have been on the kill you or your ... your Native American public radio stations\nYou are listening to the ... that we show and it's just chatty re\n\nOh the oh my gosh do row row row row row or no ours yo yo\nYo yo yo yo yo yo\nYo Ma yo yo yo yo yo no no no whoa whoa\n\nWhoa whoa whoa whoa ma ma ma and one\nOf my neck but uh no no no no roads yo yo\nYo yo\nMa yo yo ma all offshore oil dog\nMa yo yo yo goes oh no no no\nNo oh whoa whoa whoa whoa whoa whoa whoa whoa\nAmong my mom I Am a no one\nThere are no longer know you're on your door doorway no oh no\nOh whoa whoa whoa whoa whoa\n\nWhoa whoa whoa whoa whoa whoa whoa\n\nWhoa whoa whoa whoa whoa whoa no no no no\nNo oh no oh\nNo oh no no no um\nOh hey may\nCause all all the other eye on the way home all the a ha ha ha\nHa ha ha\nA yo yo yo yo yo know your right now you know and\nI also know whoa whoa whoa whoa whoa\nWhoa whoa none of them know how you all know the\nMan who are not all those are all all the OJ or you know really how\nWas the mayor mayor oh no no no\nNo no no no no mother always said a lot more cars\nBecause I didn't hear a lot because\nYou know they are in the shop so how long do or how are they are because those layer\nLaw because\nThey you know I saw all low you know more and more and more now on the overall\nOn all because those are all gone south here you know hey hey hey\nShaun Shaun last oh boy well they are because of the girls I\nKnow because of because you know they are the shops which are low low more money on all over\n[laughter]\nYou know all all all all\nAll the other is a dog or Rosa or trying to hold a mayor or\nKnow about your mother or are they all want to know a lot also about yo yo yo yo Yo Ma ma yo yo ... ... no way no was it was\nA bomb\nOr a no no no my my mom my ... my my neck but uh you know on\nThe Alabama line all over the over ... no no no no no no no no no no no no\nMay oh no no I uh you know no\nBig deal may\nAll all the high or\n\nLow yo yo yo yo yo la now and then you know and I know\nHe he [noise] he\nHe he [noise] [noise]\n[noise]\n[noise] [noise] [noise] [noise]\nMan who\nWas no way no no no no no no where near yo\n\nKnow where they are nowhere near yo\nJohn using your how well\nThese are always going to be really even around the world that Israel is what our drought oh\nNo no no no no\nNo no no no no no no no no where near yo\nWedding\nOnly do they know the way they yo\nI Want to know what do you mean by a man\nThat is just kind of that you'll be growing up and that is because they were asking all alone another call now we're\nNowhere near you know nine oh two one\nWay and I'm not a very young man yo\n\nMan out of nowhere very oh\nJohn no matter how well\nThese are always going to be really even when they're oh man you're on the Internet as well as Dr Ro [noise]\n\nHey hey hey hey\nHey hey hey hey hey\nHey hey\nHey hey hey hey hey hey hey\nHey hey hey hey\nHey\nHey hey\nHey\nHey hey\nHey hey hey hey hey hey hey hey hey\nHey hey hey hey hey\nHey hey hey\nHey hey hey hey hey hey hey hey\nHey\nHey ho ho ho ho ho are ... are are are are really a\nWhole lot about it and they said oh by\nThe way they are a lot to do all we know how you know oh you're not already up in a way to deal or no\nI Would call ...\nOr a dog or a a\nWhole lot about the\nWhole thing on the operating on our way or ...\nOr ... not a helpful or\nDa da da da da da\nDa\nDa da da na na na\nNa ... there's no ... or a\nA R how you know in the oval office when it isn't over all the way they are not always ... operated on your\nOwn body NATO or isn't all da da\nDa da da da da da da da da da da na na na ... or ...\nOr ... or ... or ... or ... or a\nDog or\nWhole whole model\nI go into a a\nA R a hobo all the way up on a hill of all the way or\nThe you know all the way you know all the ...\nOr ... or ... or a\nDog or a\nWhole lot of them are among\nThe young man all the ... not all the way it you\nKnow why they do for her for a\nJob and all of a role model for\nA young man although we have no other way around it or\nNot buy into it you know I\nWas you know there are plenty of time to go all the way\nIt is now offering is always you\nKnow on and off for a lot in a way\nTo go all the way it is oh\nOh oh really is no already up in a way to do was not part of the you know\n\nWhoa whoa whoa whoa whoa whoa\nWhoa whoa [noise] [noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise] so [noise] [noise] [noise] [noise] [noise]\nHa ha ha ha ha you the [noise] I uh he how are you have the I ...\nThe whole family uh I don't know who you\nAre you you are you a nation I knew [noise] you know my\nSweet ... ... ...\nFrom China's been above um ah\nWhat do you get the view\nAll money alone or you know mind shining on you know you just tune we loan\nAm who\nI Am a ... he\nUh he uh he um he ... he uh hey how are you know I uh on you\nIn a I Love you so we ...\nA a you have to I\nI Am and I ...\nA ... a a a little ... ... ... e a a a hey how are you know I have a son who am\nI a A N e how are you paying me on the how the how a ha ha you\nReally are you are you paying you know you know my\nSweet ... and from has been a\n... ... have you on line and uh you a minute shining a I'm a New Jersey so we ...\nA ham who I Am I Am I a a\nMan thing is\nA ... a ... I Am only a a a an a ha\nHa ha ha ha ha ha you pay a a a a a\nDe ... uh you know am I on the whole ah ha ha ha ha ha you\nReally have to say you have do you uh my\nSweet and ... and from has been a a\n... game do you own money in a new online a shining a I Love you just ...\nA a new way to have\nA\nA mom guano mano\n\nA mano glut on the phone\n\nBill de ...\nA a a\n... I'm a I'm a ... uh and uh you know a well\nA in a in a mall glove mano a\nMano ... yo\nYo\nYo Ma la da dum la la la la ... in a in\nA lot of the ... uh no ma de da na na na\nOr the other day I have a good\nWay on a a on a in\nA ... or ... or\n... oh\nNo no we uh we\nAll know oh ... or ...\nOr ... or ... or\n... oh my God no I work in a in\nA in a in\nA not a on\nA\n... a\nA a ... or\n...\nOh you are a real\nNo no no no no uh uh uh in a in\nA a ... a you\nKnow a a a a ... a na na na I ... a na\nNa na na na na na na hey you know we all know na na na na na hey yo yo yo\nYo yo yo man or a a a a a higher you know I ... I Know I ... na\nNa na na na na na na na hey yo yo yo yo da na na na na hey yo yo yo yo\nYo da na na na na I tell my health I and I and yo yo yo yo yo yo ... young young and\nUh you know a way to go while I'm wearing ... na na na na na na na na I ... a night out and\nJog a yo yo Yo Ma ... jaw and\nYa I'll go a long way do or a way to bail na na na na na na na I ... well\nNo no no no no no\nYeah oh I Know I Know\nJohn a yo yo Yo Ma ... jaw and\nTell 'em go a long way gone wrong or where they are no no no no no I can tell you oh I feel well\nNo no no no\nI'm not a\nWay on a you know no\nNo no no I'm a ... a ... in a in a\nWay although I I Am a uh well\nI Know how you know we all\nHa ha ha ha ha ha ha ha ha ha ha what was\nThe only you know no no no no way\nBy a dog uh uh uh\nWell no no no real\nNah nah nah nah wait on on oh no I was\nIn a way I Do I uh uh well no no no no no no no no no no no no\nNo no no no no no well I\nI don't know there's a way I don't know how ha ha ha ha ha ha ha ha ha ha ha ha ha ha no no no no no no no no no no way\nYeah I think\nA ha ha ha ha\nYou know we're in a\nLo o lo o lo O M no\n... no no no no no\nNo no\nNo no no uh\nNo I don't know who\nYou are married to a restaurant better job search a\nQuote a grow grow grow a bird\nOr a\nYou know\nWhen a when a\nDollar a dollar or what are\nThey go oh I'm Sorry to hear from him all day\nTrying to talk of victim no not all the man I'm a very dynamic whether they own a house like today\nMay not know who are paying a dollar a\nDollar a dollar or much of the war on\nDrugs they don't always tell me more cars going already come no I'm not going to come back from a re some equipment they do on a ah like today\nHey na na na na na na\n... show your dogs on your way all the way I Do it ... or ... or\n... to ... I'm a ... know Denmark how may I say no ma yo da da da da da da da da da da da da\nDa da da da da da da da da\nDa da da da da da da da da da da da da da da\nDa da\nDa da da da\nDa da da da da da\nDa da da da\nDa da da da da da da da da da da da da da na\nNa na na na ... all they're all ... la da dum la da da da\nDa da da da\nDa\nDa da da\nDa da da da na na na na na\nYou are listening to kill you why I Do a ... point when F. M. S. N. K. U. R. I. L. P. upper ... eighty nine point when FM project or the Hopi foundation streaming online that killed me I don't ...\nYour Native American public radio station\nFeeling music\nDo you do on the line from homeland\nCommunity care why any like one of the week [noise] for can help prevent\n\nA ... na na na na na na na na na na na\nNa na na na na na na\nNa\nNa na na na na\nNa\nNa na na hey hey\nHo ho ho ho ho [noise]\n\n[noise]\n[noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise]\n\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n\n[noise]\n\n[noise] [noise] [noise]\n\n\n[noise] [noise]\n[noise]\nOh\nDa da\nDa\nDa da da\nDa da da da\nA name you know I Am I Am\nA man and I don't know man\nI Wish I did I say I don't know any I I may I say I am saying hey I ain't oh man I\nI Am not me I I I ... I\nMean I don't know I don't know\nA a A R I Am I Am\nA oh I was a kid you know my turn real I can feel very\nSorry that God right if you were a I\nH oh man I didn't want me in general you know I Am I Am\nI Am I paying high paying\nA high paying on me I mean they say I don't know I I mean\nI don't know I yeah I I mean I I may I ... I mean I don't\nKnow I don't know I Am I oh I Am I Am\nOh God I have high I on the way they say I doubt it oh my God I\nI I yeah I'm a very odd ...\nUh well I don't know I don't\nKnow I Am A L I ate All right yeah yeah oh\nMy God oh man oh God oh whoa hey I'm not I mean I ...\nThe way I'm not at all they have a\nLot of it I don't know why\nI said I don't\nKnow I don't know\nIt I mean they they have high or low pay and they are they all they pay a dollar ... ho ho baby high\n... hockey I I I ah Dolly ha ha ha ha\nHa I mean I don't know I don't know\nHow they light all I all I Know\nI don't know why I feel\nVery sorry that guy is yo yo ma I I Would be a little while I may\nLay o da lay a\n\nTough tough man ... no no I don't know when you're older you know very very common and I don't know where your winters are my age I'm ... I'm ...\nYears ago when I heard a little way way way way way\nWay way though when you're on a on a summer no way I don't know where you're\nGoing to do when I'm ready to open a\nNobody nobody really a\nStrong from your comments from our alone time no no no no no no no way no way no way really I\nJust I don't have to have been right on July the home I had to pay my car I Would always hungry God for email from a\nJob where they do when we're not really a a when you're not going to change my heart to I went down on the phone with my time on\nYour way no way there's no where are you a job where\nI don't know where to go over it but I don't really know what I don't want to make a\nComment on the way the way in which I don't really know where we don't really know\nWhere to go away for a bill where are you already know not enough for not knowing that you know I don't know where we're not\nDoing a job where where do we really\nEnjoy your way in which I\nDon't know what I'm\nSaying\nYeah a\nA\nMan na\nNa na na na na\nNa na na\nNa na na na na na\nNa na\nNa na\nNa\nNa na\nNa\nNa\nNa na na\nNa na na\nNa na\nNa na a\nA a a\nMan and then they have\nThe na na na na na\nNa\nNa\nNa na na na\nNa na na na na na\nNa na na na\nNa\nNa na na\nNa na\nNa na na\n\nNa na\nNa na na na na na\nNa na na\nA a a a\nNa na na\nNa na na na\nNa na\nNa na na\nNa\nNa na na\nNa na na\nNa na na\nNa na na\nNa na na\nNa na\nNa na na\nLa yo oh ha\n\nHa ha ha ha\nHa\nHa ha ha ha ha ha ha ha ha ha\nI I all of all I Know uh uh\nWhat are they all had all had a class\nOf ... I saw a not a lot of them are cause I can I help at all I all I I how they all had a long time\nNow where are all all all headed off on a walk all over my head at all and I said oh I\nI'm\nA lawyer or a ...\nA a cold or a\n... or ...\nOr hire a you know a a\nA ... all I I I\n\n\nHave a quick ha ha ha ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha ha ha ha ha\n\nHa ha ha ha ha ha ha ha\nHa ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha ha ha ha ha\nHa\nHa\nHa ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha ha ha ha\nHa ha ha\nHa\nHa ha ha ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha ha ha ha ha\n\n[noise] well you're\n\nQuite right ha ha ha ha\nHa ha ha ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha ha ha ha ha\nHa\nHa ha ha ha ha ha\nHa ha ha ha\nHa ha ha ha ha ha ha ha\nHa\nHa ha ha ha ha ha ha ha ha ha ha\n\nHa ha ha\nHa ha ha ha ha\nHa ha ha ha ha ha ha\nHa ha ha ha ha ha\nHa ha ha ha ha ha ha\nHa ha ha I\nWell\n\nI I I don't\nKnow I I\nI don't know I\n\nTried a she is\nI gather a red oh my God\nMy kid my dad is\nI don't know about oh what\nA\nWay that they are a way I feel that way I I\nI I I\nBuy a\nDaddy\nMy\nLai guy or a or a five\nDay my guy is\nLike a A R a\nPrecinct ... ... ... ... why ... ... ... ... ... s M young the world that British streaming online at W. W. W. dot K. U. L. Y. I. dot net\n... e K you why I happy project of the ... foundation yeah\nWhoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa [laughter]\nDa da da da da da da da da\nVery few who ... who\nHas no\nNo no\nNo I Know they know\nHow well you know\nHa you know they\nWere hanging around me every day but I don't see how ya ya know man on the ha ha ha you know hey hey hey hey\nHey hey hey hey oh wait\nOn you know I had a they have a day but they are and how\nAre you know hey hey hey hey hey hey hey I'm a I'm a play or they go hey hey hey hey hey ha ha ha ha\nHa ha ha ha ha\nHa ha I leave the area and I know\nHow well\nHuh you know hey hey\nHey are they how they are in the day where they have a um a ma and pa man a man huh huh you know man a man a\nMan hey yo ... and\nAh I close my eyes I say over\nTime named and they're not like a dream\nCome true for those\nWho won a yo yo ma and a line in a man I'm more worried a you know I had a a man\nWho\nHuh I mean he may not know\nHow\nHow do they\nPlay a man how are you doing today play out in a a meeting ha ha ha ha ha ha ha ha ha ha ha you know\nHey hey hey hey hey hey hey hey ho\nHo man a young man but uh they\nHave a young man a young man how your day where they say they are in a row where they are I mean I I you know hey hey hey hey\nHey hey how\nAre ya\nHuh I mean he might not\nKnow\nHow do they\nPlay around saying how do they play they play a game ha ha ha ha\nHa ha ha ha ha ha you know hey hey hey hey hey hey hey hey hey hey oh man\nI Know well they say it's time\nThen they are like a dream\nCome true blue\nBut ah you know grandma heard a lot I have the right to know a few ... you know\nYou're listening to kill you or I Would rather eighty eight point when the ... of January I help you\nAnd\nThen they are right guy J come\nTrue\nNo way I feel great nah I I ... a ... a a\nA view or pay a ... a a\nYou're listening to K. U. I Would rather eighty eight point when the famous Jay you why I asked the upper meant to be eighty nine point when the family project the Hopi foundation streaming online at the Y. I. dot net your Native American public radio station\n[laughter]\nUh well I'm\nA you know ... or\n... or maybe a little\nBit of a of a new home on [noise] [noise] ah family\nAnd you know why my\n\nMom on and on the uh\nYou know\nI'm a ... to ... let me see I uh\nI'm I'm well I'm\nJust on the line ... ... ... I\nMean he is a long way under no well\nI'm a pall\n\nThem well and uh\n[noise] uh [noise]\nIs it you know in a row to hoe or ... or ...\n[noise] but [noise]\n[noise] [noise] [noise] [noise] [noise]\nUm [noise] um [noise]\n[noise]\n\n\n\n[noise]\nOh I'm\nA I'm\nA I'm\nA I'm In [noise]\n[noise]\n[noise] um [noise] just\nA family and you\nKnow a\nHard ... hard and\nYou're going to\nCome a\nLong um I'm a long long\nTime to be [noise] ah well I'm a\n... on\nA screen [noise]\nOh I Know\n[noise] then God\nAnd a guy my and my mom and my ... my neck but uh I'm not a you know we are a line may you know drugs you know here's a total may ...\nMay now my down your mother or a or\nA show or a yo yo yo yo yo yo da da da da da da da na na na we know how was it was a\nYou're a boomer or ... or ... to my ... my mom I Am a\nNon white power money but uh you know while you're not you're a line\n... ... ... ... ... ... or ... or ... or you know ... ... I may all\n... or ... or\nThey may\nAll all the IRA how ... how\nAre you a a a\nR your home or you all and all the rent or your right now you know\nI ...\nNo oh no how\nOld was on ... or you know the mayor ... knows I'm\nOn the other ... other OJ ... or ...\nOr ... or you know the mayor or no man\nOn the other day and all the law for more\nBecause those are those I\nGet a lot because of all I Know it I saw a lot to do\nOr or or are they are because\nThose houses I lay or\nLaw because they uh if you're low paid a A R a I saw saw last\nLow or a boy or a or a whole lot more on the ... not all on all\nBecause of the house has a a\nA car or because they are and all they really are a shock to outlaw\nLow or how they are because\nOf those other\nLaw ... hours how low paid a a a shower shower law\nLaw like whoa whoa whoa whoa whoa whoa whoa\n[laughter]\nYou know all all all all of a man drove all his toes may ...\nMay not know about your mother all ... all the all the all the all of a yo yo yo yo Yo Ma do\nMay ma yo yo ... or no way no there was a while you are\nYou a\nBomb or a no no but do you own mother my mother my pilots are now more towards our Monday but uh you know a good enough you know a line\n... ... ... no ... no ... the may\n...\nMay or may\nAll ... all ... all\nHey hey a A R\nO y'all are all your than than a year old I Know you know you know they know how\n\nYou know a a a ...\nHere in the guy uh who uh who ... who are now a guinea pig\nOh oh I Know you know we all know\nThat no\nNo uh\nNo they have a a\nMove away from 'em or\nThey or if I go to a\n\n... you know\nAnd to me who have a a poem or move we knew who he would do\nIs I Know\nThat\nMovie the\n... there is a good\nWay home or how do\nThey do it a move\nA a real hit me no one here no\nBoth go wherever\n\nI go\nTo the\nMovies he does it do they\nDo they go\nThrough it a thought about\nIt a a real hit a low may gain a what a blue moon\nI\nI don't know\nI I Know I\nKnow my I'm hoping my jaw not tell rolling on ... ... ... ... ... my name is Sarah rolling in my hoping name is Alan ... and I'm from the village of ... and I'm afraid it\nToday I Will be ... fitness some it's about a\nYellow and blue I don't see that live that\nThe point of it and they are watching the whole piece slice the snakes the site to help no hope the no ... around me\n[noise] yeah\nHow how how you know and ah\nOh whoa whoa whoa whoa I uh I um [noise] oh oh oh oh I\nI on TALK of it I got a God I dont na na na\nNa na all I Do on their own or much higher on\nA a a a a\nOh whoa whoa whoa whoa\nA in a\nMall grow\nPay ... Missouri well yeah I'm a ...\nWell ... na na na hey hey mami ... mano\n\nA mano well what are\nYou oh I ...\nA da dum la la la la bill\n...\nA lot of ... a\nLittle mutt cars that are in a work in a new day a in a\nWay on a A R A N\nUh uh we all\nBy a a A R A N\nO ... o ... O G O D O O lay on my own\nI ...\nA lot of ... a\nLaw oh my\nGod no I work in a in a way I mean I I'm not a on a\nPlay on a on a a legal way on an a ha ha and I\nKnow a a a we all know na na na na na na\nNa na na na na na na na na\nNa na na na na hey yo yo\nYo yo yo yo yo\nNa na na na na na na na hey hey although I I all\nI na\nNa na na na hey yo yo yo yo da na na na na na hey yo yo yo\nYo yo yo da da da na na hey I Know\nI'm not I ... I inhale by na\nNa na na na hey yo yo yo yo yo yo know na na na na hey yo yo yo yo\nYo yo yo da na na na na na I ... a night and yo yo\nYo yo yo yo yo yo jaw and ya we do a lot of ways to\nGo along with a way a hey na na na na na na na na na na hey all alone ... a night\nAnd yo yo yo\nYo yo Yo Ma yo yo Jong il\nAnd ya where you go a long long way go or a ... a on a hill na na na na na hey hey all love and I feel well\nNine yo yo\nMa ma\nWay on a yo yo\n... a ... in a\nIn a way although I I Know a well\nNow they say oh you know all\nThe time in a way I Know oh you know what was the\nOnly way I I don't ... I Do I not a a a\nWell no I think oh no no we all know na\nNa na na way on a yo yo Yo's\nHigh a and I don't always feel I I Do I live in a in a\nWay on a you know a hall was always you know ha ha ha ha ha ha well no no no no I was over ... you\nKnow I I don't ... I I Do I uh uh in a\nWay I'm not going ha ha ha ha ha ha ha ha ha ha ha ha no no no no no\nNo no no way Ohio are those are not a it's a way although I and I uh well\nNo they hold know na\nNa na na\nWay on a yo yo\n... a ... you\nAre listening to kill you why I Hope you can lie\n[noise]\n[laughter] [noise] [laughter]\n[noise]\n[laughter]\n[noise]\n[noise]\n[laughter] [noise]\n\n[laughter] [noise]\n[laughter] [noise]\n\n[laughter] [noise] [laughter]\n[noise]\n\n[laughter]\n\n[noise] [laughter] [noise]\n\n[laughter]\n\n\n\n[noise] [laughter]\nYeah you're right I Will say eighty ... okay you lay out the upper ... eighty nine ... ... ... email I got\nTo go oh God I Love oh God I thought oh no no no no no no no it's on\nSay you know ...\nOr ... or ... or you know but it also\nIs to a visit to the phones you know you I understand\nWhat you do if you could call me Don ...\n\nYo yo yo yo yo I followed it up you know I\nDon't know who are like oh ... ...\nIs a two man how long have you know any\nFollow the no guarantee you're still waiting for your call me now I'm On there\nOh oh oh [noise] a\nNews or to a man I don't\nFollow the armed services I understand where your for your call me now I'm On the news [noise] ...\nAh I I'm ... I'm ... I'm not going to go for the\nPurposes or for worse\nThen to to the when the ...\nFor a dirty bomb ... where did you see your for your call nine one one of my ...\n\n... ... ...\n... ... ... but also one of the simplest ways to share a moment with your family to go\nMy son to to take a moment to make your kid language because dad jokes rule make your kid laughter that cut fatherhood ... by the U.S department of health and Human Services can be as you are listening\nTo Cape why I worked for the la di da point one and get your y L P upper ... eighty nine point one ... projects of ... station dreaming online that can you why I thought that your Native American public radio station\nAnd I know that if I was asked by nine dash right now\nI'm a while thought I'd be\nOut playing a man ... have\nMore say their own ... your dream as they did there was a whole mile Lloyd too bad ass la di da da da\nDa da na\n\nI Am right\nNow while its own bottom up\nAirbus jobs so yeah it was the name of my life change I live by the was um [noise] have a third one guy\nI was the\nLast time that I Know it was\nYeah I Am right now I Am I not\nOwn a fuel ... said\nGo to bed at a more say\nBob Bob Dole or you know watch a live show was good it was fun\nI have no man we have a flag or the oil ...\nAnd oh\nYeah and I I and I know oh\nBy the judge is a good day I'm not a whole roll nano would\nYes ah like Joel and Joel staying\n... mile a murder or not I live um in all owned by ... no my\nDad my dad my\nDad and I and I\nDon't own a ... I'm\nA man you're a a a good man ... I'd be on a windy and I'm David ... who I Am a vile there\nI was a guy or a um\nThey might not do that any time you know\nI have a way so you have a way it's dumb square don't die and it was like the Sunday this lady\nHad had bad [noise]\n\nHang hang down\nThere now you know I Know my knee\nPlaying yeah I think no one no one knew where\nYeah dang young\nThe na na\nNa\nNa na na yeah I think no one no one knew where\nYeah dang so he\nNow right now I'm ... yeah\n\nYea\nI Know there were any one oh\nYeah that is I think no one no one\nName yeah dang so she she does know right now I\nHear\nYour\nName will my\nKnee here\nYou know\n... around\nMe in the ... na na na na na na\nNa I mean I'm ... I'm ...\nMann\nHere no one no\nOne needs a home\nHe handing\nPam high beams man the man\nWho won the ... names solely on the he Dianne Feinstein no one no one no one yeah and\n\n\nMy grief one line but you know what I'm saying when when they claim if he's not he's going [noise]\n\nTo you I I Will try ... ... ... ... ... eighty nine point when I mean I might I keep my eye doctor\nWho who who ... ... s\nA F\n[noise] I don't\nKnow who ...\n... s a NATO or a young\nGirls who are your young a I'm a a a a yo yo yo yo yo yo la well yeah but uh no we\nAre a\nHero\nOr a man who who who they are ...\nA a A R\nI Know who they are ... are your are you a ha ha ha ha\nHa ha ha ha ha ha he or in your ... or ... you know and I had a ...\nWho ...\n... S C\nI F a new\n\nA New York I live in a\n[noise]\nUh uh I'm\nClose to home for\nA ton and yo yo ... na na na\nNa na na yeah yeah yeah yeah yeah\nI Know\n\nJoe ... Joe on the L orders yo yo yo\nYo yo Yo Ma new players\nGo over your own you know a ...\nA young ... or their own a ... a yo yo\nYo yo yo yo real wound radio or your own\nYou know or you know are\nYou from a one and ...\nCheese my lawyer though we we are\nYou being the world's Judy\nYung radios or you have your own\nA yo yo yo yo yo yo yo\nJoe ... Joe ... orders yo yo yo yo ma yo\nEarners Joan Rivers\nDo their own you know a ...\nA young ... a ... a yo yo\nYo yo yo yo yo ... a year old\nYou are a ... you know over\nYou know ah my one and no movies\nBut I Want to know the we are\nUsing the world to maybe\n... or your own\nA a very uh you know uh you know you're on a ...\nHe ... he ... down on what type II style style going ... ... ... ... yeah I e sounds fine Near East\nSound when the ... yeah a dog um yet huh hum he a whole by land Donnie ...\nDown now mine huh bye ...\n... me he gave me a we E. E. Tom Janis ... yeah so we want a a son they eat um you know\nBy ... by ... what I Need I Need ... why me\nHa ha ha ha ha ha ha ha\nMan\nHe he he he gave\nMe a dollar a hell of\nA coming in and\nDo all the way they are in a in a in a way a\nLittle balls on it and I said oh I have all the\nWay I saw it in a row of\nThe mouth and then\nUh you know all the way in a in a in a way a hit it\nOh no I oh I Know a a a a\nA a all of them are a lot of\nThe dog is on the other way and a half hour and a hit it\nOff or not I saw a movie or a da da da\nDa da da\nDa da da da na all the way to go\nOff on a ... or a or a\nWay off in a way to know a hell of\nA job in a\nWay and then you know oh in a in a in a in a way in a way to deal\nAll quiet and uh I Know it's all a\nWay in a in a way to go all the way you know in a way in hell operate in a in a in a in a ... million dollars in you know\nAll over the top ... oh I Know a lot about\nA man or\nAll of them are in a\nRow the attorney a man all in a in a in a row and then I bought it at all and it's all a a a a in\nA hole on my one of them uh\nYou know he was on a on the other woman in a in a in a row\nOh my\nGod oh man [noise] all those are all we all\nKnow blah blah and it's all a da da da da da\nDa\nDa da da\nYo yo Ohio Ohio Ohio Ohio or anything\nYeah yeah yeah you do hear a\nLow\nOn ... you\n\nKnow they run into a Luo\nOn a civil engineer [noise]\n[noise]\n[noise]\nUh uh oh\nOh no no a\nDay off of a of a waste you know and\n[noise] [noise] [noise] [noise]\nAh oh why oh why oh why oh why oh no call waiting so they\n[noise] [noise]\n[noise]\nI'm a\nI'm a top [noise]\nBuy a phone call I saw that in fact I saw the\nPlay offs [noise]\nI'm a\nI'm a I'm a high top [noise] they talk a lot of planning I thought they\nChange things I think\n\nAll of a tough tough [noise]\nHey hey hey hey hey hey I'm\nA\nFan of the top top top [noise]\nHey hey hey hey hey hey\n\nHey hey check [noise]\n[noise]\n[noise]\nOh [noise] [noise] oh oh oh\nOh oh oh okay\nWell there's probably a ... volt they\n[noise] [noise] Hi [noise] ha ha\nHa ha\nHa ha ha ha polo\n\nOh okay\n[laughter] whoa whoa whoa whoa whoa whoa\nThey saw [noise] [noise] Hi [noise] Hi Hi\nRay [laughter]\nLast time a polo team [noise] oh okay\nOh well ... a tall [laughter] I I\nThink [noise]\nUm uh uh I don't know like oh no\nI'm On the phone by a phone call are calling for a long pole hey hey hey ho\nHo ho\nHo ho ho ho ho ho so they are so great and then a ... totally crazy [noise] [noise]\n[noise]\nOh man oh ha ha ha ha ha ha [laughter]\nHey hey hey hey hey [laughter] [noise]\nUh\nNo way oh it's a hot topic [noise]\n[laughter]\nOh [laughter]\n[noise]\n[noise]\nOh oh\nOh\n\nOh oh oh\n\nOh oh oh oh I didn't know how well wait until the time\n[noise] [noise]\nHi [noise] Hi\n[laughter] [noise]\nOh oh oh oh oh no no way to pay off oh you know a smoke ring tone\nCoal train [noise] [noise] [noise] [noise] [noise]\nRight [noise] [laughter] [noise]\nOh oh oh\nOh oh oh [noise] why I call a long time and how close a trade off [laughter] [noise]\nOh no oh\nAh [noise] um oh yeah oh no [noise] pay a phone call or why not home page [laughter] quite hot [noise]\nAh\nOh why oh\nHey hey [laughter] [noise]\nOh oh oh oh oh\nOh oh oh wow [laughter]\n\n[noise]\n[laughter] [noise]\nYou're listening to K. U. I could tell you my name is Katie why I have to be eating I Want it\n[noise]\n\n\n[noise]\n\n\n\n[noise]\nOne on a I'm a na na na na na na na na na\nNa na na na na na na na na na na na na na na\n\nNa na na na na na na na na na na na na na and AA oh I'm\nI'm a I'm a I'm a\nI'm On a I'm a I'm a man oh\nBoy\nOh boy\nI'm a I'm\nA you know I'm a I'm a I'm On a\n\nOn a I'm a knowledge on a on a on a on\nA on a on a\nOn a\n\nOn a I'm a na na na na na na na na na colleges ha ha ha ha ha ha ha\nI'm a I'm a I'm On a\nOn a a A R\nO\nOn your oh\nHa ha ha yeah\nParental involvement is to keep your child's school this is Joe ... president the Arizona education whether it's volunteering with communicating with teachers on a regular basis for helping with homework we know involvement is crucially important\nTo get involved [noise] working together parents and educators can make the grade school years for every student in Arizona a message from the Arizona Education Association\nYou are listening to tell you why I Would dollar eighty eight point in one eye and tell you why I ... I promote the eighty nine and when I can projects will be some diction streaming online at the way I talked to your Native American public radio station\n[noise]\n\n\n\n\n[noise]\n\n\n\n[noise] [noise]\n\n[noise]\n\n\n\n[noise]\n\nYeah\nMan\n[laughter]\n\nOh yeah\nMan right now man I hear\nYa know right now\nMan I Am\nA rag lay o da lay off they are right now\nMan well man I Am\nA way of\nSaying I Am\nA stay at ... am today or eight\nDollars a call ... ... na na na hey\nHey Hey Don man a man\nDang dang gay lay out a\nWay or I Am\nA stay at right now they are they are they saw\nA ... a guy\nNamed ... Hey Don man a\nMan de de de de la way out\nMan I Am\nA man a a plane or they are they are way out\nMan well man I Am\nA lay out\nMan I Am\nA rag play uh hey oh hey al\n... who are\nWho\nAre\n[noise]\nWho are coming to your on your own\nYou know\nA dozen others who are on a\nThursday who ... you know or or or\nOr and and then go and\n[noise] [noise] [noise] [noise] three\nOr\n... or ... ... a year a year or two and a hero or a or\nA year in a row and during that\nWe could talk to\n\nBoth work\nA lot of people who are going to show\nNa na na na yo\nYo yo yo yo yo yo yo yo ma yo yo yo yo yo\nMa yo yo yo\nYo yo yo\nYo yo ma yo yo yo yo yo\nYo yo yo yo yo yo yo yo yo yo\nYo yo job by all the all the all\nThe all male jobs where it all it is a very long but I Do the job\nOf yo yo Yo Ma ma yo\nYo yo yo yo yo yo\nYo\nYo yo\nYo yo ma yo yo ma yo\nYo yo yo yo\nYo\nYo yo yo\nYo yo yo\nYo or or or\nGoing cold turkey well at least in the car [laughter] you know we shouldn't do it but it's so hard to stop that's why I had it for myself\nSo I wouldn't be tempting I used to do it all the time I stopped by locking in my class compartments my family used to make way too much how I turned me off right in the car my solution is simple I just don't do it\nThere are lots of ways to stop yourself and others from texting and driving or will you stop tell us at ... dot org brought you by the national Highway Traffic Safety Administration and the ad council\nDoes your hair you why community calendar\n\n\n\n\n\n\n\n\n[noise]\n\n\nAll right any good morning my darling like why listeners thanks for joining in on this Tuesday October second two thousand\nEight seen time now is eight twenty three here and the K you why I studios and nine twenty three for those are the who were on daylight savings time and what a great\nMorning\nAnd they are still\nOut there on the road Dr Saper clip notes in driving and knows speeding alright okay so let's get into our community counter for just Tuesday Morning a\nFirst step K. you why I cannot be here in the villages I'm a copy on eighty nine point when FM below par up and take notice I have to watch that reaches approximately ten miles go to Kay you why are down there now to donate and support K you why I finally reaching are hoping villages and keeping our hope the voices and broadcast\nWrong stay tuned for our official on\nAs we continue they speak Atlanta Simon K. U. R. A. I. now located at the junction or to sixty point eighty seven in second may say you why I top\nWhenever is nice you wait and then three eight five five zero five and our backs number is not you ate him in three eight five by you\nBuy a KU why I take multi by speaking volunteers and community there by the board members are the AP house responds border station and educate the community\nAbout the importance of okay you why I Hope he radio\nWith a K U ... or email us that into like K. U. I. R. dot net\nFor details again our top one number is Ninety eight seven three eight five five zero by\nThat make community countered announcement or at least two weeks before your bed by email your ten K. U. R. A. I. dot net and allowed you to do business days where he meant to be added even better find\nAre moved by getting apple message arch our listeners right away or just a few dollars to record your information as April paragraph three stricken announcement email into like hey you why I don't need to get on the air court right\n\nAll right and for the mobile computer lab work is huge day there'll be heading to the Hopi cultural center from one PM to pour PM more information for the mobile computer lab\nOh you're a man to be added you've been better\nFonda I moved by getting a phone message arch our listeners right away or just sixty dollars a record your information as April paragraph thirty second announcement email into like hey you why I got to get on the air ... ...\n\nA writer and throwing a mobile computer lab or does Tuesday there'll be heading to the Hopi cultural center from one PM to pour PM\nMore information for the mobile computer lab nine to wait three one three six straight\nFor for\nThe whole the bookmobile [noise]\nBut well built trailers open for library services I Hope the tribes administration complex from ten am to ... pm Monday through Thursday\nMore information for the whole people mobile nine to wait you will five eight zero seven three [noise]\n\nDomestic violence awareness poster and encouraging hoping values resource pair as the ... center today October second\nAt by the em\nAnd that belly you elderly building October night that for P. M. more information is at night you wait a minute you five eight seven three\n\nWay election board will be holding elections for community members October third term in AM PM more information as I said man three seven two to five or\n\nRead their host they women to gain experience working with tools and fixing minor home repairs cries\nOctober third and fourth\nRSVP is a nine to wait for four zero five one one nine\n\nA third annual spiritual physical emotional and mental health gathering hosted by the Hopi behavioral health services\nOctober Fort that eight am at my company like I've seen in more information is at seven three seven six three zero zero\n\nOff the reservation town hall meeting presented by the opposition Arizona secretary of state October\n... beginning at ten thirty am mountain standard time that's the hope the Veterans Memorial center\nMore information is that seven three four five zero seven or eight to five zero eight\n\nBall Tony Eighteen scholarships available for hope the college students that have\nThat line to apply is October fifth\nMore information is that one eight zero zero carbon two nine six three zero breast\nCancer awareness month conference October fifth Abdel ... chapter house at nine AM daylight savings time more information is at nine to eight\nTo eight nine or ...\nHope each tribal courts will be closed October fest\nNormal business hours while resume on October eighth\nAll righty and that's going to do it for your community counter update for this Tuesday Morning October second two thousand eight team and if there is information you did not hear states United seven AM eight am living in five PM when air community\nOr or or or heart you know or not all or no or ... or\n... or you\nKnow a a south la I Love your show so low low or a or a\n... or or\nLaw ... law ... Shaw is our law law or ... or ... or ... or ... or ... or or or\n\nYou know ... or\n... or ... ... ... all stars all of a uh\nYou know call the shots and all the time I hear you I saw\nJohn all know why oh why oh why oh why oh why oh\n\nWhy oh how are you know I may or may\nNot know how a man on non or no bars in the arm or a ... a yo yo yo yo yo yo ma\nHey my young young ... on a no no no no no no\nMy mom and my mom and my parents right now I'm On my neck but uh I'll know or you know we all know\nHow I only know how we are now and I don't know how many I oh ha ha ha ha ha ha ha ha ha ha\nHa ha\nHa ha ha ha ha ha ha ha ha ha ha ha ha ha\nHa ha ha ha ha\nHa yo yo yo and I know you know you know not knowing how\n\nReal are are are you ... do you\nKnow ... ... no ...\nNo ...\nWell you know again I don't know ... ... ...\nS C I F R I or\nYou\nKnow ... who was ...\n... ... new\nYork real they still you know you don't know what we will lose ...\nOne of those ... ... no no\nNo no one else did they\nCall ... ... ... ... ...\n...\n...\n... ... ... ... ... ... ... you know\nThere are some interesting new\nYork ... June ...\nYou'll\nGet you know ...\n... ...\nWe know they they know ... or\n... you know the the other way over you know what I'm saying oh you're in a ...\nYear old ... or\n... you know what I'm saying so he saw you know what I'm saying you know I don't know how to you know a\nWhole ... ... ...\n... so you know we're seeing\nMy name is ...\n... ... in my mid ...\nGo ...\nOr ... you know the young ones we know yesterday in a way\nThat we see my\n... my ... my ... my ...\n...\n... ... some studies and I believe ...\n... ...\nOr ... years old he has been you know oh well you know what I'm saying oh you know the other guy or who\nHave said that you ...\nOh man you know what I'm saying oh we're the only thing I don't know who\nIs ... ... ... ...\nYou know\nOh no no you know those who smoke ... ... ... ... ... years now the young among young people who will lose ... ...\nS you'll eh\nYou\nKnow ... you know every ... years with you you know you get it done now young mostly young ... who's been my\nFavorite ... you'll ...\nYou'll see\nYou know ... ... ...\n... you were\nGetting ... ...\n... ... ... ... you'll ... or\nSo when you\nKnow in my ... my ... my\n... if you\nGet to know you know the ...\nTo ... ... you know we know you know they\nJust you know they are\nAll over the same you know oh man well over the young kids you know it's all over the other hand\nWho ... going on in\nA way oh ... oh man you know you don't see it you know a\nWe all have a you know hey\nWhere do you know they are yeah oh ...\nOh oh oh oh oh oh you're in a ... a\nWhole ... ... ...\nA real big oh really oh okay oh hey yo yo yo\nYo ... el ... in New York\nWho who who\nOr a ... or ... or ...\n... ... ... ... to ...\nOr ... or the or the\nEuro in\nJust a ... a hero\n\nOr a da da da da da da di\nDi ... my mom or a\n... or ... or ... or signing\nUp for a while but uh now we are a\nHero\nDu da da da da da da da da da da da da da\nDa da\nDa da da da di ... in a whole ... in a way\nOh\nYou are going on\nIn a hurry the\nJourney brand la la la la la mayor ... ... man\nAnd a\n\n\nMan\nAnd\nThe ... [noise]\n\n[noise]\nOr a\nMan on the changing\nWho feel\nStrongly already just for the New Orleans you do\nAnd you say you want a leader but you should make you a man and then ... ... big you better well do\nYou live\nIn\nLa la\n\nLa la\nLa\nLa\nLa\nLa la la\n\nLa la la la la la la\nLa la la ...\n\n\n\n\nOr ... or ... one ... one one one of\n\nThose rang [noise] that's right and wrong with us rain this rain Raul ...\nIs a ... about men have who should win by ...\n... where just tell me what you do in my mind\nI Will come on man in June and go about you know playing ... you know my ... my ... all those rang\nAnd rang\nAnd rang\nThe landmark ...\nBut that's not bad then we um have you on\nThe line Robin Roberts man yeah yeah oh my mom will come on I'm not leaving me and go ... my ... my\nMind that's why I Do a yes or no rain\n\nDoes rainbow ...\nWell ... ... ...\n...\n[noise] [noise]\nThe rainbow oh\nThose raining there's rainbow ... [noise]\n\n[noise]\n[noise]\n[noise] ... others right in\nThe last ... ... well does rain this right and wrong when it does rain rain\nRain rain rain\nRain\nThere's a mall and she's a spouse or we call it you know big dog a dinosaur mowing and we believe that the wind and the rain that there are\nThe rain is buying it got the and uh the wind is his brother and wherever the wind goes on that rain gonna come and so we're always nice to the winds are you going to bring his brother the rain sure\nNotice mowing the Mexico the bird recalling the you know one of the rain where they were wide around as a dinosaur modeling and they all that the wind and the rain we're coming up\nYou know big dog a dinosaur mowing and we believe that the wind and the rain or ah\nThe rain is wind ... D and or or when there's his brother or wherever the wind goes around that ring gonna come and so we're always nice to the wind is going to bring your brother the range sure\nNear the mall and the Mexico the bird recall on the east or rain or they were flying around as a dinosaur mountains and they go to the wind and rain we're coming over the modern\nWere actually rather terrible rank the top of raised with the wind and rain and see who can get through their nor faster as well to Berkeley starter wiring they started flying are really watching their wings as bad as they could bust journal went for a while\nWas letting them think that there were going to win\nAnd then when we started to bigger and bigger and the when she was strong and very calm the clouds and here comes the rain and the lightning and all the good thing we went over the bird the land of the rain rain chain or when the bird got there there were all wet as well this is the dinosaur mall\nAnd you know with the dog you're a\nGrown up on long enough you're going up on\nA bomb or through the wall work them\nGrow go oh man well or ...\nOr ... or ... or a man or a ... a\nJohn ... mom all through no wrong\nDon among them a golf ball on the majority in your your gum ball you know what's going on or bomb or the wrong with them\nA armor well or or or\n... or ... or ... or ... or a\nDog or more market no longer Don mama\nGrow grow and mature in your on your ... I'm\nA young man go up on a bomb\nOr the wrong with them\nGrow a a ... or ...\nOr ... or a man or your or buy him a A R\nGone a little more marker no longer\nOn my mom a girl or a ... ... your ... I'm a\nNa na\nNa na na na na na\nNa na\nNa\nNa na na na na\n\nNa na na na na na na\nNa na na na\nNa na na na na na on\nA\nAh a\n\nNo no I\nUh\nUh\n\n\n\n\nYeah so the mother and a\nWell I don't know\nHow do they\nKnow\nHow long are they still doesn't say a little\nLamb and hear him saying that he did say that I'm I'm\nJust getting getting a little\nBit on on the\nNightly news and I'm Wondering you know what I'm saying\nThat that didn't do the tone for the fun of me is the way it was a line\nIn\nYour life when there were no longer see where people were saying you know the news but\n\nHey you know no no I'm a mom\nDo rather than a\nLong time ago [noise]\n[noise]\n... but on the\nGo and do the gun on the phone and me and my mother was\n\nIn that way and then later you know as long as the food chain in the middle man\n\nYeah nice when\nThey do a whole day men on base na\nNa\nNa na na na\nNa na na na\n[noise]\n\nA\nBoy but no way over\nThere\n[noise]\nBut if I don't know\nIf I had\nA [noise]\nA\nPop but from what\n[noise] na na na na\nNa\nNa\nNa\nNa ...\nPossible but you know\n[noise] [noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\nYeah\n[noise] nah man [noise]\n[noise]\n[noise]\n[noise] ah I have a\nAs long as the ... ...\n\n... ... other than ...\nNa na na na no no no no no no no no\nNo because the ... over no no no no no no no no no uh uh ... ... ...\nOh right ...\nSo\n... what are you\nA ... ... ... ...\nNo no no no no no no no no no no\nNo no ... no no no no no no no they are ... are they run but no\nAs long as a ... ... ...\n...\n... ... ... oh\nGod\n[noise]\n\n\n\n\n\n\n[noise] [laughter]\n\n\n\n[noise]\n\n[laughter]\n[noise]\n\n[laughter]\n[noise] [laughter]\n\n[noise]\n\n[laughter]\n\n\n[noise]\n\n\n[noise]\n[noise]\n[laughter]\n\n\n\n\n\n\nOh a use it needs to eighty eight one one thin K you why I\nFrom the heart of new to the murder me ... or ...\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n[noise] [noise]\n[noise] [noise] [noise] [noise]\nThink every day for you you are a new will be a way along you\nKnow\nWhen you say you know hey my\nName is not a job with name they lay out\nWhen they when they when they say you know they may say when\nThey say you know what I'm saying when may very well have you know\nNo no no I Do you do go\nTo the movies all the way you view a main grow up I\nDon't know what you saw my love me no matter what you mean I think a lot every day for you you were a resident\nYou will be a very um a lot of [noise]\n\n\n\nYou are listening to the wire ... point one FM streaming online at key why I don't know why I L P upper ... nine point one FM projects will be will be foundation and your neighbor American public radio station\nThat four hundred meters entrepreneur lawyers professional politicians journalists tribal leaders and\nArtist dedicated to making their native communities a better place to make a class of forty under forty it's no different join us after new as we get to know a few fourteen forty one of the winners can lend wisdom they have to offer [noise]\n\n\nThat the national native me is I'm Antonio ...\nHas federal judge has dismissed the last few by to South Dakota tried over barrels Indian education reorganization the sand river and roads but to try to claim that they were not properly consulting and the restructuring violated treaty rights the Argus Leader reports the ruling set the Interior Department provided enough time and did not impact\nThe treaty that tried to didn't two thousand Fifteen to stop the changes\nThe thunder valley community on the Pine Ridge reservation its in its third year construction the twelve unit apartment building and the community center will see me open for residents the deputy director of the Development Corporation says it's a twelve year project Victoria western South Dakota has more\nUnderbelly now has seven houses ready for families three are\nAlready occupied by homeowners another seven houses are under construction and seven more are included an immediate plans Jennifer earning as deputy director of thunder valley community development corporation she says during community meetings and surveys Pine Ridge residents said\nThey didn't just want more housing they wanted sustainability services stores and a safe place for children now in addition to housing thunder valley has administrative officers\nA community center that includes a bunk Oscar overnight gas and space for people to gather and a two and a half acre demonstration farm with a red barn chicken coop hurting says it's easy to dream up improving conditions on the reservation up for this process to take on meaning the community has to prove it's possible\nThere is no way to talk about this huge vision and beautiful mission and all the things that we wanted to do without creating the model and create in the examples right here so when we talk about rebuilding the food system on Pine Ridge we can do that unless we model it too so we can't talk about you know local access to fresh\nFruits and vegetables if we ourselves are providing that\nFuture plans including more housing or school doors Powell grounds workspace for artists childcare office space and other amenities unnerving says uh Pine Ridge residents want to change those plans\nThis huge invasion and the beautiful mission and all the things that we wanted to do without creating model and create in the examples\nRight here so when we talk about rebuilding the food system on Pine Ridge we can do that unless we model it too so we can't talk about you know local access to fresh fruits and vegetables if we ourselves are providing that\nFuture plans include more housing or school doors Powell grounds workspace for artists childcare office space and other amenities better earnings as a Pine Ridge residents wanted to change those plans they will change for national native News I'm Victoria where in Rapid City South Dakota\nThe Cape cod times report the ... tribe plans to hold a rally on land rights this weekend a walk will be held followed by speaker at the event follows the recent blow to the tribe by the Interior Department to keep it lands and trust and Massachusetts tried it's fighting in court and Congress over land rights\nA new book collection is showcasing Canada's that rich indigenous heritage and down carbon check reports it's called the Canadian Geographic's indigenous peoples outlet of Canada\nBefore volume's teacher's guide to readers to land languages people and culture\nFor three volumes focus on native groups first Asians in a way to make the they include reference maps and content for more than fifty indigenous writers they're\nAlso hundreds of photographs in a glossary of indigenous terms as well as maps of indigenous language the fourth volume is dedicated to truth and reconciliation the collection as the creation of the royal Canadian geographical society along with the assembly first nations and it would appear at Tommy the meat the nation and the\nNational Center for truth and reconciliation rhyme around as a director of the center\nThe ideas are what we're doing we're listening to colonial construct a channel to all the math and leaving behind the indigent wait wait in place names and a rich and actually I Am ... years or for millennia\nThe book also helps to highlight the origins of indigenous names such as auto walk when they're big Ontario Mississauga to name a few for national News I'm Dan ... and ...\nThat\nWas produced at the Annenberg national ... voiced by one Roger corporation money by law groups provider in laws by the corporation for public broadcasting from the public radio satellite system for\nOffering wholesome and delicious food from their own probes contribution to a better doors\nTo the old people were ordered to share our social forming downs killer traditions or\nAs a motor forums dot com and by the law offices last he chambers vaccine or an ... national travel rights law firm was offices in Washington DC Mexico California and Alaska and online at ... dot com\n[noise]\nMade a voice on the Native American radio network\n[noise]\nMissing native America calling ... would the national Center for American indian enterprise development recognizes forty native professionals every year they are all under forty years old or among the rising stores in their communities\nIn this hour we'll meet with some of this year's forty under forty award winners including a woman who averages her enthusiasm for fitness into native activism and a man who heads the economic development arm of the ... part of me I'm\nPart of a wider mean nation and you can join the conversation to if you were passed tore under forty award winner give us a call give us an update on your work in media of America or maybe you know a person in your new community who is doing great work call in\nAnd tell us about them to me is all about recognizing telling and good work in native America and getting inspired to do good work and I'm going to join our conversation is one hundred nine six to ... all one eight hundred nine nine\nNative and he started off today we're going to go to Baltimore, Maryland to say hello to William sparks Robinson she is the c._e._o. and owner of ... consulting and we will see\nIn a member of the board of directors for the national Center for American indian enterprise development she's also the chair of the forty under forty committee and she's a member of the rosebud Sioux tribes are pushed to welcome her to the program today Lillian thank you for being with us\nThanks for having me are so excited for this year's forty to forty award\nThat's going to take place October thirtieth reversed resort in Tulsa, Oklahoma and as a former forty four forty or forty award recipient I've talked to you Tara I if I should it come on out and bring your friend because if you're going to be\nI'm really a celebration honoring of shows have received toward the four hundred\nA ... across the country they're just doing really innovative and dynamic work in their community but we also want to find ways that we can stay engaged and and help the upcoming classes a forty hour to forty\nA reach out and get all up to develop their leadership skills as well so we're really excited about the fact that the reverse resort\nCan do for tremendous there are hard for me to breathe fire rich or poor you have your doctor gives you five years shorter shredded talking with your grandchildren financial ground for him to be around any more\nPressure is was to try to smoke I over time runner COPD makes it harder and harder to breathe and cause you can quit free health call one eight hundred quit now the message from the Centers for Disease Control and prevention\n[noise]\n\n\n\n\n\n\n\n\n\nThanks for listening to native America calling them ... from ... in each year the national Center for American indian enterprise development owners forty meter professionals with the forty under forty word\nWe're catching up with some of this huge award winners and you're also welcome to join us to give us a call at one eight hundred nine nine six to ... uh my name's six to eight to four feet or I Am visiting with majority Murray Daniel she comes to us today from Los Angeles California and she is comb\nWe just saw a ... and she is also the co director of the rise to resist program my pleasure to have her here with us also on\nThe line from Baltimore, Maryland is Marie and sparks Robinson and she is the CEO and owner of ... consulting oh\nThe she's also a member of the board of directors for the national center of American indian enterprise development or pleasure to have both of them here with us in Jordan I Want to hear how some of that foundation of working in Washington are seeing how it works and policy is made\nHow that fits into your big goal of helping\nYour community\nYeah so my like I said at my dream was to to want to focus on policy\nUm and kind of had that you know okay maybe I'll become a lawyer to\nAnd just working there and going on the hill a lot for the organization that I was working for and really kind of like lobbying for for what we were fighting for it to have put into these though to be included into the bill um was really at first\nKind of demoralizing and I realized firsthand how slow moving the government is when it comes to you know the inclusion of these policies that are still important or the people that you're representing and um it was like I said it was a little bit heartbreaking and it was kind of like a wake up call\nAnd just going between organization representing you know\nFive hundred and Seventy three federally recognized tribe now I'm In state recognized tried that I noticed a big lack of communication happening um and so I created a blog which is now called native perspective to really bridge that gap and communication of\nThings that were happening on the hill in terms of you know funding opportunities conferences happening things to be part of and things to learn what's going on I'm across the nation and how it might affect and trickled down to your specific community I felt it wasn't being\nUm or trade and the and the best of ways and and wasn't given the right one who found\nUm and so I thought it was could help\nFoster about oh so this happened today in Washington DC they were talking about no water rights issues or violence against women act\nUm and I would kind of break it down or if I go to a hearing that was um leave or no a tribe or with a ... I was kind of break down or what I Would ...\nAnd I was publicize it so people could be\n... in the hearing what's going on on the health ...\nAnd is there anything that were happening whether it was good or bad happening in Indian country I Would still write about it um and and share it with within my network here\nOr there in Washington DC and I got a lot of feedback of thing like wow I didn't know that this is happening in your in your ... as a comedian or in any country on and so I really created that blog helped build that Haitian\nUm and so that any country knows what's happening and they can take advantage of some of the opportunities that are not very well publicized and very confusing to sign on navigate I'm In Washington DC\nUm and so that's where I kind of changed my focus in working some policy you having more direct connection with the tried\n'em and and that's why I'm so happy that I found a administration for Native Americans where we were helping them I'm with the community by the injured and projects and so that that work I just I fell in love with and and helping them and talking to them daily on the progress of their project uh\nThe gay I'm In Washington DC I'm ... so that's where her means my focus in working on policy you having more direct connection with the tried 'em and and that's why I'm so happy that I found a administration for Native American\nWhere we were helping them I'm with its meaty let injured and project\nAnd so that that work I just fell in love with and helping them and talking to them daily on the progress of their project I'm reading all the grand second emitted um and really wanted to learn more about what's happening in one country one initiative that they're trying to push you know you help\nAnd you begin to wonder to to even\nSpeaking about health or even um protecting we're making her community see for when you hear more about that too if you want to join us one eight hundred nine\nSix to ... age is the number and we are featuring a the forty under forty award winners this year maybe you're a past winner you can give us a call and tell us maybe how you even grown in your career\nWanting to hundred and Ninety six to report eat is the number and when you think of how many people have received this warned us four hundred a individuals and maybe there's somebody from your community that has been given this kind of spotlight I Want you to say about the work that may have done um\nIn in when you think of people who are connected to you and you see them on the list how did that make you feel one hundred nine nine six to eat or eat in the number and when we were just hearing from Jordan what I'm an important thing you do to commit for me to bridge of knowledge on from\nYou know centers of government much like Washington DC and bringing it back into the community\nAnd I'm sure about why use important or why the center puts the spotlight on people who are making sure we're bridging winter be working in Washington DC I'm working in the government running for a seat and then bringing\nThem well back to their community tell me a little more go ahead ...\nShort so I think we recognized that um you know we have native peoples everywhere and that the work that they do is so important not just for that as an individual for their immediate family\nBut it really has impacts that are much broader\nWith regard to our um our visibility our priorities as they are related policies legislation and law and that it impacts are family members that might be for me back home in South Dakota are are in it on\nThe west coast or are in the southwest but not necessarily located a DC area and so it is important to be able to relate the policies in the work that's being done here out translate into without into what's actually being implemented to our family members back home\nI don't want to say that the fourteen to forty to that recognized as salt leaders are policy leaders um and ah I'm political realm\nWe had business owners we asked filmmakers we have folks that are doing a really interesting and cool things in the fields of science and technology we have folks from across all industries that are represented recognized\nAt the forty to forty and we want to recognize their work too\nBecause we know that for many of them they might be the only person\nIn that particular field and so they're doing some ground breaking work um with regards to the industry that they're now opening up to native peoples and so we're really proud of them and we want to be encouraging and supportive and also show our young people that not everyone has to be an Indian lawyer can make a difference\nThat everybody has to go into tribal politics or run for office\nThat there are teachers that there are researchers scholars there are people who are just marketing communications that are making films that are graphic artists are just doing some really incredible fame\nThat increases are positive self image out into the mainstream society and so we want to recognize those folks as well because they are always seen by some as leaders in their field but we certainly think they're making a huge difference everything for for that\nWe're we're going to meet another award recipient from this year but just give us some names some people haven't had a chance to take a look at the west we know that there are many different nations that are being represented in this year's class a forty under forty I'm sure some of those names\nMuch down on a game you know he may be a man hey hey\nMy name on the line he\nMay hang man I\nMean that we\n\n[noise]\nOoh la la\n\nLand a\nGuy the guy yeah [noise] oh\nToday we're talking with some of this year's in see any I ET forty under forty award winners and these are needed folks who have demonstrated leadership innovation dedication to their means community you have questions or kudos for any of our guests today give us a call ... one hundred my\nNine six two week for each it's also winning hundred nine nine needed and right now we are connected to the current Dana\nPot of water mean reservation in Kansas we're talking with Jacob ... he's the president and CEO of ... and then in the ... and he's a member of the ... ... ... in our place you'd have in here with us and keep our pupils closer to your pots\nAnd talk to us a little bit about how do you mean you're waiting to position that you're at now\nYeah so you know I've always uh worked with my community I started out uh working for the boys and Girls Club on a reservation with a youth\nAnalysis during my um undergraduate at a time and then from there went to our game you're operation and actually worked in our uh at our get for gaming commission was on the regulatory side for about seven years\nAnd they're you know I learned all the ins and outs of regulatory requirements and you've got to see how are you know operation a work and I'm there that are experiencing I've worked with several attorneys and that wasn't an attorney and I said oh I Wanna do that I Want to\nI Want to be an attorney I'm doing some work are ready to have been a childhood dream of mine to actually go to law school and then and be an attorney from the perspective of wanting to help us you know social outcasts or people that I've experienced prejudice\nSo a left my job at this part of my uh my wife and my family and went to law school and\nWhen I was in law school a sort of a you know looking at economic development how that has been a huge engine for any country to bring change about\nUm started working with the president CEO of a preventable she at that time burn Warren kind of kind of became my mentor for business and and ... on a legal and I recruited me after law school and um she's already banned so I was kind of my path here was a\nRoundabout way I thought I was going to be you know defending um they'd be criminal defendants or something in front of a judge but the the law school changed it to economic development in a business and after law school and got my uh NBA the work from Ireland a tribe now\nInto the satellite and some people calling upon Jordan said okay I'm ... I'm going to go in this direction um what was that like and what did you have to say to yourself to say I notice all work out\nAs I said to myself I'm good enough for them smart enough to strike on a Saturday Night live ... hours a smart ass Mali as a you know it's a huge change you know as a three three children and and your family in a career that it you know probably could have lasted many years uh\nNever had to sit down and talk with my family I Am going to leave my job and go to law school is going to be for a few years and I think of that or three years I'm going to\nStudy for the bar exam and they're going to be you know it's going to take time and dedication and now they're fully supportive my my mother was a\nReally supportive throughout the whole um [noise] you know experience and uh our community you know is behind me and I'm you know it was\nFirst a semi family the first person to go to law school and ah the funniest supportive without supportive of my community or other as my family are extended family or tribal leaders you know I don't think I could have done it\nIn so tell us a little bit about Perry been and we'll see you again folks can still doing this we need hundred nine need yes go ahead ...\n... a ... fee is there a predator and politicians are economic development company we oversee all the nations non gaming or economic adventures\nOr we have three companies that are local companies that power to operate on the reservation that we have three other companies that are participating in a federal government contracting they have\nTo companies that are a ... a certified and another one that will hopefully be certified soon so we've really\nGrown that a government contracting a division and um you know we've taken the a lot of the same steps that the other ... in Cherokee Nation and you know the other companies that are in the same sort of a industry\nNow taking the lead from them in and try to follow the path that they've laid for\nEconomic development in our community and uh you know we've grown tremendously over the past two years and you know now are are are our main mission is to provide a profits and Jerry profits to our travel government but\nNow we're moving into the uh you know create a shrimp entrepreneur opportunities in our community or travel\nCitizens and that's a really exciting time for me that's what I\nReally the reason I Do what I Do I Want to see a those opportunities here in our community and throughout the country for\nUs to keep our people here and you know provide a better quality of life so our our folks don't have to go to the big cities are away from our communities to find meaningful and in a no decent paying jobs\nAnd I would imagine someone were to do too\nYeah you know create a shrimp entrepreneur opportunities in our community with our travel citizens and that's really exciting time for me that's what I really the reason I Do what I Do I Want to see a those opportunities here in our community and throughout the country for\nUs to keep our people here and you know provide a better quality of life so our our folks don't have to go to the big cities are away from our communities to\nFinding meaningful and in a decent paying jobs\nAnd I I Would imagine so what did you do to is also changing perspectives on Native Americans\nAnd just how far um you know they can teach teams in in a lot of times what a misconception that were just sitting here waiting for handouts what you're doing is contrary to that even that\nI think about that all the time so you know we've we've uh really taken issue if they get into the local business community outside of in the country um you know joining the chambers and joining a other organizations with us and not sitting on a nonprofit board or\nYou know of uh other civic organizations that always the first question or the first statement that you\nKnow is is a non native folk said to us as we don't know what you Indians are doing not stable fair enough ah we're here now are are making an effort here to to let you all know or not or you know all these stereotypes of a\nTravel people in any country are on true now there's a lot of great things going on a lot of a business opportunities and a lot of a social uh changed like a what a story and was talking about what's going on throughout any cut your this is happening and you guys are\nYou guys are missing out over here to to include you and what we're doing 'cause it's a it's great for people\nAnd you can put in some states you'd also like to recognize that help get you to space we heard from Jordan or some of her mentors and people she looked up to anybody you'd like to um just keep your hands too as well gee ...\nI guess like I said a lot of mentors and some of them are in my own family members my my mother of course she was a teenage parent and and she always ... throughout her entire life she uh\nUh she got her college education you know when she was older she got her back she went through an MBA program together and graduated together which is very I'm\nVery fun experience and and how it goes typical for most folks to go through an MBA program and have their their mother with them\nI'm definitely a you know my uncle was a poet was travel political leader for many years and um he passed away a few years ago but he was a a big mentor for me on or just how to treat people and how to um always remember our community\nAnd with the values that we were taught and you know I use those values to make decisions\nAnd then uh you know this is why is that my my project bigger Smith or as a burn warranted and it was a\nI worked with him for several years and uh he was a\nA you know there's a lot of knowledge on business is it also of this is a good person and our beliefs are very similar so we had a lot in common and he's a he's been a great mentor for me and um [noise] you know there's too many others but you know at a nail down those would be the three I Would talk about\nLike one Roger rations native nonprofit may be wondering why we're bracing for broadcasting and support from the public radio news in Britain will be boys on the Native American radio network\n\n\n\n\n\n\n\nYou are listening to you while you hope the lower ... one of them streaming on\n\n\n\nYoure listening to tell you why I Hope below eighty eight point one of them streaming or lie to tell you why I dot net and key why L. P. upper ... eighty nine point one bam projects the Hopi foundation\nTo therapy Arizona students better the teachers the traditional Arizona value of the\nArizona Center for teacher preparation help identify train and support and you're\nFrom Arizona community who have a desire to teach English teacher program served as a factor less expensive an easier route to like sure if you're looking to reduce the cost and time involved the burning your teacher certification to\nTeach them that program at the right choice for you get thirty they'd like ab teacher ... dot org and learn about three seminars in your area again because it easy teacher got\n... ... ... ... more U.S that would be a net\nNa na na na na na na na na na [laughter] [noise]\n[noise] [noise]\nThat Jerry that Jim Webb thing maybe you were quick you're\nRight\n[noise] new\nThings you know how\nLong [noise] read by a long long\n\nLong time that have\nA job in a um\n\n[noise] the\nBad guy made the job market right now I don't know\nWhy do you want to call\nThem my rent yeah no no no no no no no\nAnd I mean we get a job or you know I don't know that hey\nI'm ... I'm ah time\nMm\n[noise]\nMm [noise]\n[noise]\n\n[noise]\n[noise]\n[noise] okay\nI have\nA phone call from a\nFrom a ... a\nWay to do the same level of uh oh no no no I don't have a man of the other way around the middle of the law where you know a\n... law banned by and you know when\nI Do a lot on my own home but I think so as I can see what you want\nMe all the time to go find them about the problem by where\nI Am I Want to you know a ... million from day\nOne I Know well\nKnown lie about oh a logjam wasn't sure if the goal la la la land in law and you go over a long\nWay off the wall where the and\nAllowed at all on a job and he was on loan to buy a bailout\nAnd [laughter]\nMm [noise]\nYeah [laughter] how long the bomb in the job and I use the money and buy a little bit on the king [laughter]\n[noise]\nAnd [noise] you know the answer [noise]\nAgain and again\nAnd all day by day man and what are they really want the model in Miami I about to go right ahead than what you're saying mom and\nI'm just saying no money at all those young blond hair and you know and I don't think mom and I came down and while it may laugh at him\nAnd I and I ... and a and a a and a\n\n[noise]\n[noise] no\nNo no ... around a\nLot more than ...\n... ... and then the ... and my own man a\nNew way to know a ... you know believe me to eat and grow a lot of guys\nWho\nAre in charge\nCard rely on that one guy and\nHe likes to charge numbers are baffled by the heart of the nation\nFrom wherever they are more than ... you\nKnow when I when you were a lot of fun to write a new out here and we\nOnly want him to be free and start start because I think the last guy I remain one young\nMan and I start start to lie in the bottom are no guarantees in one year I can\nEver\nRemember\n... when they went on that you're right in the car wash them do there are no very\nAdult you know kind of ... guys and the man I'm I'm All right\nThey are\nA little ... window Corinne went on to the right in the car wash\nThem do now know Bernie\nAdults you know how we got to know that all all of the ... guy the guy and they do know\nThere are many lifetime ally the\nLast guy I thought man I Am sorry medicine are man but I mean our normal yeah they may want to try\nAnd lie and I found in my room and it lands are young man and a lot I don't know I don't know man\nYou know I'm a\n... ... women Neal rather than that and like many yeah you know ... when the you know\nMy daughter was talking about the live wire will remain related to dark dark now because I Know my my God we bang man ... ... ...\nWhat are the guys do yeah like I don't\nKnow why why go blue\n[noise] [noise]\n[noise]\n\nI've been ... man Rudy ... real mixed and all those simple flavor but you know what\nI'm saying what they're doing some\n\nThings that may go down at the same\nThing I Do [noise] [noise]\n[noise] [noise] [noise]\n[noise]\n[noise] [noise] oh\nWow [noise] [noise]\nYou know mom I'm dying to know that that\n\nIs [noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\nAnd then again you can see what's in\nThe uh [noise] but today it is by email or people you and all that is based on your mind now a days do you know I'm you know and and and my last\nDay oh a long and loud one\nGuy was\nA struggle now to do I mean\nThe way and then\nThe [laughter] and then\nThat was on the way they don't want to get we don't want\nTo do that\n[laughter]\nAnd I can\nNo longer and on\n[laughter] and I mean to me and I can\nNo longer and on and on and why are you yeah yeah the\n[noise]\n\n[noise] [laughter]\n\n\n[noise] [laughter]\n[laughter]\n[laughter]\n\n[noise] I think I Would change which is which is to just listen to the individual [noise]\n\n\n[laughter] [laughter]\n[laughter] yeah no one who you are someone down and putting in plenty of\nTrying\nTo change the\nYeah oh no I'm not I'm not saying that in the\nCity and then they found a local or in a row the head or whatever and\nBy the door in van dam now than\nThey live a little bit is another show on the road that\nLeads boundaries and find out what we already know\nAbout the only way you know down the guy got things remain\nLayman's read 'em and they're both on the way they\nWere ...\nWere you know when all along like the fact that name Strom role line\n\nYou know down the side\nAnd I don't think they are they saying ... step up and play and perhaps not good\nFor you know when my fans have been a strong role lie\n[noise] read there are no matter the Rhone river real goal in the in the bank and then you're\n... no no no no walls will have to do it on throw that to me and my last name was ... to get\nTo keep them alive baby boomers are long or I get up to the bank most where you\nCome together now and I decided to take that back today Strom row line\nWhich\nIs a man who I was going to be the thing to do with their kids\nTo\nStart by that time with some ... ...\n...\nShould go to a crowd belong in Iraq and then she loved the New Mind in a in a while you're on a new life will do it and the lows are\nGoing to be like I don't think there are stopped by our giant back to the ... the current along the way we\nSaw from around the yard and [noise]\nYou know I'm I'm a lump sum salesman those um [noise]\nI'm dying to New York city there were a\nBad way way shape or non yeah I mean now we\nKnow Paul I'm sure I'm I'm\nShopping mall [noise] going to be a\nWay to just bam\nBam try to come into town um [noise]\nThen I'll be done [noise]\n[noise]\n\n[noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise]\n\n[noise] [noise] [noise] [noise] ...\n... ...\n... ...\nIn a way for a while where I'm a ... a\nA [noise] a\n... rather than a than a man in a\nLow road\nGuy we want to know mom\nSo I'm going to be a long\nLong the loan we're\nReady to get around it or\nYou know the man and a ... na\nNa\nNa na\nNa na [noise] [noise] oh you mean\nBy\nLaurent um\n[noise] a\nWoman up or [noise] the owner and I know my\nMom um [noise] I'm\nI'm\nNa na na\nNa\nHey are listening to ... I Hope the\nLaw any point one came here Y. I. L. P. upper ... eighty nine point one at that project hoping foundation dreaming on my ... year why I thought that\nCain why I enjoy your Native American public radio station the following it provided through our ... year why I call the radio and ... and a new Arizona Public radio\nOr [noise]\nOr\n\nOr a\n\n[noise]\n\nA or a or a\nOr a\nA oh mine\n\nThis to the way I see that were hit by another quake and tsunami on currently day but in some areas and he is moving on the west coast to the right meaning the current death toll of more than Thirteen hundred could write a deliberate has always been proud jumped hedge ripple through\nThe rubble flights coming in up to the airport was repaired but there's no sense yet of an adequate official response to this is off\nThe bases potato both the neighborhood had not just by the earthquake by mudslides the race to it then it's often which from a nearby hill varying houses and some of the occupants about tribal slapped with a lot a lot of a\nMaster I describe that running for his life with his wife and three children being chased by a wall of mud like everyone else mud and his family living on a mat\nWaiting for help to arrive\nRussia has described as dangerous as statements by the U.S ambassador to nature the Washington could sit would consider taking out to miss out on the treadmill turned on the foreign ministry spokeswoman said people who may have been able to realize the dangers of aggressive rhetoric\nAnd today Kay Bailey Hutchinson said Washington was the pets are considered a military strike if Russia developed a meeting my Christian bound by Nineteen eighty seven treaty jumped in his report\nThe recent years the U.S has become increasingly worried that Russia is developing a new missile employee should the treaty some sauce is Jessica ... as many being deployed Russia category can you do noise speaking in breach of the agreement but refuses to address Washington concerns\nNow the U.S ambassador to NATO Kay Bailey Hutchison appears to have taken the route\nWhen you level she needs threatening a military strike against the Michelle if that continues\nAnd re joint statement three key French government minister foreign interior and the economy have accused Iran's intelligence ministry of being behind a plot to bomb a run in the rain in opposition groups in Paris\nSo since Jess weapon is already being deployed Russia categorically denies being in breach of the agreement but refuses to address Washington's concerns now the U.S ambassador to NATO Kay Bailey Hutchison appears to have taken the route\nTo a new level seemingly threatening a military strike against the missiles if that development continues\nAnd re joint statement three king French government ministers the foreign interior and the economy have accused earphones intelligence ministry of being behind a plot to bomb a runny the reigning opposition groups in parents in June the product was foiled or they say they've frozen the essence Sylvia Raney ministry and if two individuals\nScientists have discovered Cindy out somebody's reaches of the solar system a dwarf planet ... suggests there's also an undiscovered giant planets in the region the orbit says the dwarf\nPlanet seems to be influenced by the gravity of a much more massive object is suppose from Richard hell's\nIt's taken three years carefully studying the data to come from that they object to the Gulf then as a dwarf world probably about three hundred kilometers in diameter\nOr researchers are excited about is the behavior of it so that suggests there may be a giant planet nearby something that astronomers have speculated about for some time\nRussia's house were opposing you're listening to well news from the BBC\nU.S officials say too suspicious smell like it was limited dependent on a Monday of initially tested positive for the deadly poison rice in the ambulance went address to the secretary of defense James Mattis and the chief of naval operations admiral John Richardson\nParliament in a row 'cause I like to the ... Kurdish candidates above ... as the new president\nAnd it's just another member of the the UK was running against the Katie peak candidates for want Hussein withdrew from the second round of voting\nThe Katie pay me there ... is he the statement saying his policy rejected the parliamentary vote as they should have been a new one because each candidate not candidate should have come from the ... the Kurdish party to Katie pain\nThe French court says concerned willing to return a painting by impression is coming to ... to the family the Jewish collect from him it was see joined the second mobile use go field reports from Paris\nPicking fees which shows women at work in the fields was one of many great paintings withdrew confiscated by the Germans from ... ... after the war he recovered some of the odd but this particular painting seemed last for good\nUntil last year when it suddenly reappeared\nIn Paris on loan to an exhibition on the sorrow the owners\nWere a couple of Jewish American real estate magnates tolls could blow up the painting perfectly legally at auction in Nineteen Ninety five the point to law school was whether the fact that the ... was seized by the Nazis she proceeded render devoid any subsequent sale and touches on the court\nHas ruled but yes it did\nThe Venezuelan president Nicolas Maduro says the number of king financial transactions will now be conducted and then you could come and see the pet trade leaving food real estate sales payments that hotels and ... says ... will be Venezuela's international digital currency maybe seniors\n[noise] [noise]\nI have one [noise] on my hot their mind my asking nonsense and I found one that [noise]\nHow fat [noise]\nAh my name is Steve\nWe know that a lifetime of healthy eating helps to prevent chronic diseases like obesity heart disease high\nBlood pressure and type ... diabetes healthy eating is one of the most powerful tools we have to reduce the onset of disease the bathroom improving healthy nutrition here's the following healthy eating pattern that he was right for you the science behind healthy eating patterns tells us they can help prevent chronic diseases like obesity heart disease and\nType ... diabetes healthy eating veteran can be maintained over a person's lifetime and at appropriate calorie levels promote health and supports a healthy body weight\nYou can include many of the foods that you enjoy the healthy eating patterns support healthy choices for everyone and get more physical activity to stay healthy everyone has a role to play and encouraging accessible and affordable ways to support healthy choices at home\nSchool work and in the community this message from the station and the nomination special diabetes project visit in ... Oregon the ultimate joy stay healthy living begins with me\nDetails aren't seven three eighty three eighty five [noise] domestic violence conference at my company like as the in October Eighteen starting at one P. M. more information is on line to wait two to five\nSix eight seven three [noise] read better ho stay cries policy to keep your house warmer in the winter and cool in the summer October twenty third RSVP is on nine to wait for four zero five one one\nNine [noise] substance abuse prevention center hosts a monster Mac died October twenty seven at the Hopi have care center beginning at nine AM more information is active in three seven six three eighty five [noise] dog\nAnd cat costume event October Tony night at the Hopi veterinary clinic starting out six P. M.\nMore information as I said on three eight five to five one [noise] twenty eight gene girls night out October twenty nine as you helped me a Veterans Memorial center at five PM more information is at seven three four one one\nFive one [noise] monster garage October thirtieth that make up the legacy and enter by city beginning at five thirty PM more information is at nine to wait you wait three\nOne two three four zero [noise] many how bears up into the public November thirteenth not helping Veterans Memorial center at five PM Marlon standard time more information is out seven three for three four three two [noise]\nAdult coed basketball event at ... memorial center November Seventeen Eighteen more information is that seven three for three four three two\nDiabetes group is taking place every second Thursday of the month from eight AM to eleven AM\nDetails on at seven three seven six two three one\n\nOf the culture and language sessions argues days on Thursdays beginning at one PM at Lincoln the legacy in more information is on line to eight six six zero three by four to\nAlso again Taylor village has food boxes of elbow for those who have not\nReceived any more information is out seven three one two to five\nOr also genital public school early release today October second at one PM on standard time all after school activities are can do more information as I said in three eight new three three or\n\nAll righty and now you you're Hopi junior senior high school sports burst up\nHope the high school sports [noise] hopefully high school volleyball October second today versus many\nFarms at many farms\nJV beginning at four pm and bar city at by P. M.\nO. B. high school football October ... versus bally's and there's at Hopi and that is paying night\nVarsity beginning at seven P. M.\nO. the high school cross country October sex Dave ... invite\nIn Phoenix at monument new part starting at eight thirty eight em\nAll the high school chess October fifth and sixth regional one tournament at Lee Williams high school starting at one P. M.\n\nO. writing now for your hope in junior high school sports Hopi junior high school football\nOctober third versus gym the junior high school I generally JV beginning at three PM and ... at four thirty P. M.\nO. P. junior high school biology ball October for versus Tono Leah and hoping junior high school JV beginning at four pm and varsity and by the\nI'm\nHoping junior high cross country October strict but Davis in by a two by city high school starting at seven eight and ...\n\nAnd that's going to do it for your updated sport for more information and all hope the high school and hoping junior high school sports activities you may call nine to eight seven three eighty five one one one\nThat's going to wrap it up for your community pounder update if there is information you they're not here to stay United seven AM eight am noon and\nFive PM when we announced immunity counter event it'd be a bike a you\nWhy I Hope the radios free community countering wish to continue to support our mission considered becoming ha you why I on the writer your financial contributions during this move will help us prepare for an even brighter future and allow us to return to the normal broadcasting you depend on daily\nJanuary I offer supportive of underwriting\nTo get your message out Charlotte nurse community counter submissions\nI edited to one sentence or you just take a couple of seconds to read or just a few dollars you record your information as a four paragraph thirty second announcement to reach out thousands our listeners email info like KU why I down there to get on the\nAir ... ... and that's been to do it for your community counter update coming up next is your updated weather\n[noise] [noise]\n[noise]\n\n\n[noise]\n\n[noise] [noise]\n\n\n[noise]\n\n[noise]\nDoing whether we have to be\n[noise]\n\n\n\nAll righty I'm back with their updated whether Ford is Tuesday October second two thousand eight the\nFirst step teams can Internet sixty eight and mostly comedy\nThis afternoon showers are possible\nWith a high near Seventy one sounds topless when around Eighteen miles per hour with just as high as thirty miles\nPer hour [noise] tonight showers likely and possibly a thunderstorm [noise]\nMostly cloudy with a high near fifty for South south west when nine to Fifteen miles per hour we've got this highest twenty miles per hour [noise] because most of the village tiny at sixty eight and mostly cloudy [noise] this afternoon showers\nAnd thunderstorms with a high near Seventy two\nHours away in around sixty miles per hour with justice highest twenty five miles per\nHour [noise] tonight showers likely on a\nPossible thunderstorm [noise]\nMostly cloudy with a lower around fifty three dollars when seven Thirteen miles per hour [noise]\nMight be too by city area Carney I'm fifty eight with some light rain and fog this afternoon showers and thunder storms\nWith a high near Seventy to document around eleven miles per hour with justice highest Eighteen miles\nPer hour [noise]\nTonight showers and thunderstorms mostly ... divorce now too in five to seven miles\nPer hour you're not always say Michael and Maria currently at sixty three and mostly comedy\nThis afternoon showers likely any possible than the storm\nCloudy with a high near Seventy one south south with when around Eighteen miles per hour we've just as high as thirty miles per hour [noise]\nNight showers likely and possibly a thunderstorm mostly ... around fifty three down south to us when ten to Fifteen\nMiles per hour with justice highest twenty miles per\nHour [noise]\nWinslow Kearney at sixty eight and mostly cloudy [noise] just after news\nLonger we\nCan go to new la la la la la la la la la la la la la la\nSalle don't really know who I Am a ... minute it's a good review coup de\nLa la la la la la land you know let alone I Would\nTake the lead without ... don't go home and I'm like I Will do green on blue along the way it was a little while\nThey're going to be Goldman loaded the row\nRow row where no one or two\nOh no let alone\nThey leave without lonely while the la la la Brea said oh well we live in little\nYou're going to be the lord of the row\nIn la la la la la la la la la la la\nLa la la la la la la la la la la la la la la la\nLa la la la la la la la la la vida loca wrote the um\nThe guy oh man I mean although we're\nGoing to find out the ... I remember being down there [laughter]\n[noise] na na na na na na na na na na na na na na na na na na na na\nNa na na na na na na na na na na\nNa na na na na na na na na na na ... no no no no no no\n[laughter] [noise] [noise]\n\n\n[noise]\n[noise] nah nah nah nah nah nah nah nah member no no no no no no no no no no no no no no no no\nNo no no no no no no no no no no no no no no no no math bang bang on the phone number [laughter] no no no no ... no no no no no\nNo no no no no no no no no no and I made her mom and my money there and came in the ... [laughter]\nHa ha ha ha ha ha ha ha ha ha ha [noise]\nHey I'm Glad to know the nice thing I Know now that you know [laughter] why are they young may be and now I'm going down that\nI don't know\nNow I Am now I\nKnow what to me like oh no [laughter]\nNo no I Wish he has a long\nRange you know they just they may I ask 'em down you know\nI mean I don't mean to me and my mom and my main now may or may not have to get it out\nTo me oh oh oh oh let us\nKnow when you're sitting\n\nDown and do you do on a promise to put their hands to a\nGuy thing and then he yeah that\nThat [noise]\n[noise] [noise] which you know the [noise]\nThe stuff\nThat's all we want to me is that oh\nOh oh that's so me being the only thing yeah\n[noise]\nOh boy and and the way every day every day to day and today and I'm\nRenee you are a lot too but I Know even in the day and you know the law in love with the\n... guy and and you know the ... and the day and you know\nYeah oh ... what do you live in a new model on your own and uh\nAnd Israel and\nThe new deal and then by the government\nHas more rural\nAnd the man and woman\nYeah I mean they rely on anything roaster on\nAnd so you're a\nMan by the\nParents or\nI'm over and over again and again and again and ...\nThere were no or something and the owners\nAnd the other side of things on your way or the na na na na na na\nNa na na na na na na na na na na da da da da da da da da da\nDa da na na na\nNa ve to a man\nIn the north east\n[noise]\nAnd the\n[noise]\n[noise] [noise] [noise]\n[noise]\n\n[noise]\nI'm a young teenager but are you in\n\nA way\nTo go and then when the\nWorld is by the oil they all died in a way to bully died um dorm world in the poll alone they did and or pie\nAnd his way into the wild and go on the world they die total did an all time says wait and all they do on the world is by\nBono but their bald guy and the best way to blow the\nWhistle on my back over the last couple of weeks ago when we return them\nTo [noise] oh no\nI wasn't in the kind of know your way to go out and walk around with them or do they know Michael Moore or whether\nThey're in our government saying where things are that way I Want to go back in ... and how the brain and the guy with the girl\nAnd I don't know how to play ball and the way it into the high I'm no longer\n... [noise]\nYou know and no matter what they\nSay we're going to reduce my right hand when the guy that man made in the in the ... river matter at the bottom it got to know back then where you live in la\n... and the reason why we did rather and why are you in the in the world is\nEver by bono to pay or die and by the way into the middle or\n...\nOr ...\n\nAnd\n... and then ... ... they made it all up and down to a guy that they are now wants to re route broader than that law\nHas been man no jobs they were you talk to me\nAnd\n\n\nI'm a little more on on\nOn a day or\nOr or garbage Donald ... dad grew up around that all we have done in the dirt bag alone more\nThan ... ran into the na na\nNa na\nNa na na\nNa na na na\nNa na na na\nNa na na na na\nNa na na na na na na na na\nNa na na na na I'm Around\nShows um [noise]\nOr their own their own\nOh God I'm Around\nShows um\n[noise]\nYou know more about oh\nAbout ... [noise] ...\n[laughter] ... [noise]\nHow old were\n\nThey are [laughter]\n[noise] ... well I don't know\nWhy or\nWhy overall\nI doubt that they read it and all but one [noise]\n\n\nMm Mm Mm Mm Mm Mm Mm no matter\nWhat happens when you come\nDown the street in the beginning when they have you\nBack new Gary that ... thing maybe you were just quickly when you're\n... years ago and I try to [noise] learn\nWhat I Would dream about may or may bring about more oil so there were no no [noise] my well\nMy my ... my father was not a ban on the road like Caroline I'm thinking about\nDoing my best man there's good when I came\nIn Montana where am I right down by\n[noise] na na na na\nNa na na na na na na na na\nNa\nNa na na na na\nNa hey man [noise]\n\n\n[noise] [noise] I\nThink ... and you know and so and I am Buffy ... Marie and this is under current\nOoh oh [noise]\n[laughter] [noise]\nI'm not sure [laughter] [noise]\n'cause I Can't do or [noise]\nI never got an don't bomb but they're all going\n[laughter] I might have\nTo go then [laughter] [noise]\n\nWell I don't pay a fine yeah dogs do I know\nYeah the ... [noise] uh I I Know\n[noise] that try and on and I\n[noise] I Know the old\nMan or you know I Am [laughter] on and [noise]\nAnd I and then\nI'm going oh my gosh oh\nMy gosh [noise] na na na\nNa na na\nNa na [laughter]\n\nWell may be going on\nAnd on and on and I don't\nKnow why not raise money in the whole\nNa na na na na na na na na na na na [laughter] God\n[laughter] no [laughter]\n[noise] na na\nNa na na na na na\nI don't want any time you know yeah I [noise]\n\n[noise]\n[laughter]\nDrummers Gary ... ... ... ... ... ... ... June ... loves to dig deep I was during the ... street\nRoom ... in ... in\nToday's G O B was do you mean you just burning ...\n[laughter] oh no\nNo uh um\nDo you do need to go to a no\nNo no no no no no\nCrime then you were ... you know the ... to me it's a double from around the true\nFor [laughter]\n... na na na na na na na na\nNa na na na na na na na na na na\nNa na na na na na na\nFrom the brain and you know young man on the street and ... and you\nKnow I Know na\nNa\nNa na\nNa na na na na na ... na\nNa na na na na\nNa na na na na na na na na na na\nNa\nAnd how to write na na na na na na na na na\nNa na na na na na na na na na na na\nNa na\nNa na na na\n... moms do very well thank you honey erode na na\n\nNa na na na na na na na na\nNa na na na na na na\nThree years reminded of that anger and the main thing you said that gap and right now I'm In\nA newly mom knows drama Johnny Hodges ...\nJob is learning channel and and you often dating laid\nOn the Jersey shore are you on that reason the world you're a\nMan and\nAll that is a pretty good for\nA loan Asia under the New Hampshire on line and John are trying to you know\nMan\nI\nDon't\nKnow what I Know I'm a\nJournalist Ronan guy\nThat new show no no I\n... and ... you may remember a man and a and the way\nThat it's been raining down there and it's very very three\nAnd a\nHalf an hour an hour and a half mile an hour and\nA ... ... ... ...\n\nEvery day\n\nI Am\nA ... na na na na na na na na na na\nIs\nThe\nOnly one in my ... a\n...\nOh\n...\n...\n... a\n... a lot going on and the longer they have on and I we\nUm yeah I Know I'm\nI'm In my area you must have been do you get in some money and not to be on the air go Monday or like ... and get in on the chopping\nWell Lou\nMayor and\nI\nDon't know I'm not you know in a\nYoung man named going on God and I know but as long as we\nUm you know yeah da da da\nDa da da da da da de la ... how did you you know when you make your own money I make\nMore money you may not know how much we don't want\nTo know what I don't know I'm not going to be you know ... ... ... jobs don't mean nowadays I don't know I Do that and then let alone\nA lot of money I mean you get ten years from now on Monday I mean don't get jammed my finger on Monday and we know that getting ...\nDon't don't don't don't go to la la la la la la la la la la land\nAnd the guy that no one can well your your mom on in my younger ones we get Dan on my on my you know get\nMore money on Monday Night and get them but I don't know you you're not going to be normal again on it but they're not being met online I I'm On my own name I don't mind on ... land boom all\nI Know I'm One of the time between now and again and then ... years ago my email and get in on my young men\nNot much we don't get my hands on to me now\nTo get in on may ... may know\nLook\nLook look look look for any number\nOne [noise] [laughter] [laughter]\n\nOh that's a little super seven from their two thousand and one of them got dull Casey I'm Jeff ... half of walkers would have had rain yeah yeah there's vampire weekend run and Charles Lloyd Marvel's\nNew collaboration with ... Williams angel from damaged garden for doing well it's undercurrents I'm grading record there will be right back with Bill Miller and just\nEnjoy your phone [noise]\nAnd [noise]\nAnd then you're going [noise] [noise] [noise] [noise] [noise] I\nDon't know when you're gone [noise]\nAnd you're going to talk about\n\nIt's under current coming to you with support from the corporation for public broadcasting and you would you support the station thank you this is Bill Miller\n[noise] right\n... oh oh [noise]\nAnd I'm a I'm a ... ... ... ... ...\nNew man in the\nLast one you mean yeah I mean\nI'm I'm I'm I'm ... ...\n... ... to lose your\nJob I mean ... na na na na na na na\nI mean usually warm ... tools you own a chain na na na na na\n[noise]\n\n[noise] [noise] [noise]\n\nDo you do you mind either\nGo to do with the [noise] the\nBig time alone the wild [noise] [noise] [noise] [noise]\nOh those are do\nYou\nThink about my own and see one of the [noise] [noise] [noise]\n\n\nYou are listening to kill you why I Hope it like eighty one that's been streaming online at key why I don't know why I Am the upper ... nine point one FM projects up you know the foundation and your neighbor American public radio station\n[noise]\nJanuary I supported in part by volunteers from the community\nKey why I volunteer czar students take me to members can provide a unique on air radio experience for our listeners in northern Arizona the key way ice down thanks for your contribution to hope you radio to you why I eighty eight point when they grow up\nYou know a K U I\nHope you do need to tell you why it is part of one F. M. K. U. R. I. L. P. O. from incorporating our point one project adopted foundation streaming online or can you I\nDon't ... your Native American public radio station and it's three o'clock and it's my turn to get on the radio or do with your five o'clock so we're going to go ahead you're just from going\nUp you guys are joined this lovely third Tuesday rain outside now we're just having lots of rain all day long you're probably going to rain one during the summertime we really need it when he was really really hot [noise] where's your turnover will take it right now because we need the moisture anyway\nAnd um outdoor although it's harvest season and we don't need them most of the four corners more but we'll take it as much as we get it or if you're a writer ... you got your primary here the going gets really good with just one right here on tell you what I point one\n\nNo I don't know I don't know I don't know what\nDo we do we ran how do you really don't know that I\nAm a rapper in you know what you want to try to them how do you call that they don't know how long people can make\nYou you know you're young you ain't going to show you\n\n\nWon't hear about your own or do I need to get to know how long you know how\nYou doing man\nWalking the walk the\n\nWalk you buy yourself a walkie talkie you see some of the time when we know legal you know\nI don't know do the job you know you know oh\nYeah yeah yeah yeah\nWhen I Do\nI Do now now now go by making our walking by yourself well he I don't have the right to know how\nTo get you know you walk into your well when I Do I Do not know what else do you I show\nYou how would you be you'll be out of the owners try not I don't\nKnow I Do know how to make it through you\nKnow you just gotta ran last week I ran and ran as we got a brand\n\nNew Bush Bush\nThey will be one of the big\n\nBang bang\nBang bang bang bang bang bang you don't get sick in the late\n... when they say it again\n[laughter]\nI'm Glad you\nLike to thank you very well thank you may like but you know you\nWouldn't have faith\nThat point do you think Kay bullets in the game to game but said the game so my one way that they like they know it sounds like\nYou're from Minnesota man like the day so I just thought\nIt would be willing to pay\nNo related to the break when it's a legal need to make the big debate in about a real bad and letting the person that they\nDon't want to say\n[laughter]\nBut\nBut you know like the best you can but you know and you know\nI think humor when they say they may be\nShe worried I bet she beyond what would it be the real work do you like to know when when I say she weren't your life is\nNot alone in God we did was to go home I cannot even say like oh my God I don't\nReally like to go see my mom\nCan\nBe more like Charlotte Charlotte I don't watch\nA lot so I think that the moon Louisiana around you can tell by my uncle come with me I'm going to be above the thing that\nReally got into a tree and she got a law that gets me I mean a lot of water law got it on and looking for in a way and I mean it was a man yo yo man on my old\nMan I'm Glad we don't need to make me feel a little money that you take you back\nOn the TV shows me could\nBe could be more and more and more people working\nOn friday he'll get up to that the oh well you know you know in the same time\nI'm sure I'm sure you're sure that\nThe thing we do we\nKnow we're going\nTo cure being around the only thing I'm not saying that you know nice\nYour porch you I Hope not eighty one F. N. N. K. U. I. L. P. upper ... feet eighty nine point when it's coming online at ... dot net yeah you're just doing the\nWe're not working right now we're getting back\nTo being around the only thing I'm not saying God thank you nice\nTo get bored you I Hope that eighty one F. N. K. U. I. L. P. upper ... eighty nine point when I'm On my key way I dot net\nYeah you're going to be your pride over here to ... three Twenty one over here to tell your station they don't have to stay and it's the second up Tobar yeah\nI got more news for your guts are my hope your high school junior high porch to let us know about the Hopi junior high or football is going to be heard again tomorrow Tobar third versus the new\nJunior high arching me kick off times I'm going to be three PM and the ... going to be up for thirty PM also the junior high volleyball team is going to be playing a I'm On Thursday October ... we're trying to leave out the hope in high school\nOr junior high school gymnasium playing the game starts at four thirty four JV and the varsity I buy their own way to 'em but Davis on October six\nJune Hopi Hopi junior I cross country team will be at that but they were invited to proceed starting at seven AM I'll give you more information about the high school when we got to keep going on just one I got along well with someone watching me or Tehran any more than one [noise]\n[noise] [noise] it was hardly\nA a a a\nAn average relax I from nine to five K. L. Y. David right now my average what why why do you know\nI don't know I mean\nWe're not going on but I enjoy your eyes are on the phone call me on the\nTrain for me and my mom I don't know when I'm On my\nOn my mind the timing [noise]\nMan that's our name on the line\nCalling from\n[noise] from\n\n\n\nWhat I Wonder I don't\nKnow I I\nI Know\n\nI got the town\nAnd [noise] I don't know that\nShe comes on I don't know if I'd have anybody to know about that show here in New in a can do but you better not why\nNa na na na na na\nNa na na ... well a lot of the\nDay the nice thing about the magistrate the damn thing that you really do enjoy and then you get a very good yeah a lot\nOf my ... na na\nNa na na na na na last\nMay make you may or may not be that chicken pox we make comics who thank God thank God we\nBought our make bono need I Know na na na na na na na na na na na na na na na used do I do miss ...\nNa na na na na na\nNa na na na na ve been oh Wow Let\nMe just making banking and not make you think that that gets to make your job and my comment really doesn't matter who wins topic who\nBob and Robin or make you don't need I Know that no no I don't mind you know John McCain will be back to like a no Dan how are you know I Do miss new ...\nOn on a day\nThat I have been around well na na\nNa na na na things and now they're not as high\nNo I don't mind you know John McCain will be better like on a more than I used to do massive on our lawn\nNa na na na\nNa na na na na na\nNa na na na na na na na na na na na na na na na now\nDid you pull your Halloween stuff I'll Try to make or your house nice fancy I'll have to go around and hope your mission because there are a lot of people decorate as much as they do in Christmas they'd like to decorate their homes for Halloween it makes it look so awesome out there\nSo they get a chance to go out there and see all the Halloween decorations that people have done out their homes\nI don't know if they're doing right now because it's raining and I'm playing when the city and the rain not quite\nA bit stink due\nRegard um food ... training up in ... a mockery senior center October\nTurned from at Ninety upper more information costs have a three for three four zero nine and if you're looking for rabies proper recognition for your dog jak they're going to be on traveling Tobar Seventeen Eighteen or Nineteen Pinter location you may dial having three eight five to five one or seven three\nSeven six to seven five and one more thing and see what else uh\nUp all colonel event at the Hopi veterans center\nIt's going to be October talk at five pm for more mission called Seventy three Seventy Seventy three for three four three two in one more thing at the ... event October Thirteen or the legacy ... legacy in starting at eight PM most better time for more information on July eight three\nFour five zero zero got more music right here like I said this is all the way my and I'm going to play some more music like this one right\nNa no no no no\n[noise]\n\nSome strange to me it's going to call [noise]\n[noise] [noise] [noise]\n[noise] [noise]\nThey say\nIt can you know [noise] [noise]\n\n[noise] [noise]\n[noise] [noise] [noise] oh God [noise]\n[noise] [noise] [noise] [noise] [noise]\n\n\n[noise]\nAnd I appreciate the current um [noise]\nYou know I'm pretty sure that you know\nBetter than you may recall that Tom ... oh [noise] [noise]\n[noise]\n[noise] I actually met with government [noise] I don't know [noise]\nWhen [noise] when it comes up a lesson took a vote him out that they get better Karl Rove who you know God\nDoesn't come just a very strong [laughter] but you don't [noise]\nShe has a new car and [noise] [noise]\n[noise]\nAnd he's on\nThe line and Anna\nMay have little by little drink I'm Robyn I'm a ban on your way or on a man mare Andrea it'll all around you say compared to marry him that way or I might add Ira Glass mail man\nYou can bond where the ball or you may have had\nMy I'm bringing everything\nWhen I when I ran about remarriage email on that\nFor a\nWhile we hurry or you know I Am I going to go now the lab and why are we last year more\nThan I Am right now yeah you know we can hop on the Internet I mean one man said oh my God now CEO on me mad at me like I'm going to lie about him\nI mean you know they\nHave any way I Am living in a way that\nA man that we care about the man in may and I had to allowing\n\n[noise] you know\nAnd we ... we were in a way I Want to have fun with them on the prey on them you know you pass it around and we dream about on this hour in\nA way\nAround and everything and they\nAre or where a\nMan on our hands out of Iraq you know some kind of it that way\nAnd\nI and a half hour\nOr\n... or\n... through really remember\n[noise] ...\nMile walk with another man and it tells you man man in a row all the presumed farm in Georgia goes to the broader\n[noise] ... man here for too long years I finally made the warm up brand\nAnd so we in and to me to a movie the king's\nTerrible right away and eat the bound to do that uh that his name [noise]\nTo know that can mail that today trail he's a border dragon machine\nTo gather the\nBy one now trying to show my show my my you know by man in a way\nTo me oh no\nThat's why you man who were actually on the side of that today is oh my power the more\nThey only on there you go and try to try and they say oh\nIt was back in Ninety nine watching movies all that time oh way no way no way by doing my first grade and I love my dog now we will not be huge on each other\nAnd then came out last may hold me down south who my father and I thought it was by where I came to be that the one girl told me\nHow he sees by you know try and show my mom my you know high man right na no way\nTo say oh no no that's why we're there who were your main goal was sad so sad to say oh my jam mowing the vulgar\n[noise] they don't want to go down\nTo what's sad so sad when\nThey say oh well [noise]\nDial up on it now by playing by law why I'm being a lifeguard you know I don't know how a may fall bad\n\nYou're either a guy that leaves me why can't leave one of the pie I'm right on the my and I do being planned by glass way\nSo that's why you Mabel were you when we go on July so sad old so it was\n\nA eighty eight point one of them streaming online that gave you why I dot net and tell you why I I'll be upper ... eighty nine point when the ... projects up the Hopi foundation\nGreetings KU I listeners really are happy that ... I Do appreciate your loved one during army they break the show is that time of year again and we remind you that we deny that individual promotion or or education\nStates that all local schools provide us a list of gradually promote eat an award winner will read\nThem all all alone and they're so birthday so I Do for your understanding\n[laughter]\nHey kids' day I think they can do to check in South Africa and gangs that\nWhy just one line in so long and that seemed to Amy she sounds choose tonight and he's in the case why and can show that or a well not empty and\nIf you don't sell a talent right LA yeah my either ... or you ... remember these easy test to get back in time and\nGood evening who's with those tremor outreach coordinator in trouble liaison for the natural resource Conservation Service of Arizona and you're listening to treat you are already eighty eight point one Hopi radio dreaming online or can you why I thought that make great memories today\nI don't know\nWhere that you know the land in where\nWe're all along that do\nYa de ... on the phone every oh oh\nNo no no no no no no no\nAnd then when I was on\nThat but I Do a good\nDay tomorrow but those are big area a barrel on you know where\nYour mom wrote the book came up with no come on we know we're in now\nThan I Am out on you know and\nDo that then I mean I have a fair the guy I\nWas in the middle road where the jobs that\nYou know we do know that the government out around the world where there you go bad no where are you know and then go\nOn and on and [noise] I mean I wouldn't\nI don't want to pay a\nDay to day alone Kenyans no fun for me to live there and oh you're going to know what else about you know not all the median where they're\nMad about an hour long ago that you\nKnow\nWhere you know that you\nKnow how\nLong do you know no matter you know no one knew owned a restaurant and they don't know the last one down no one knew that they learn to do a little known you know a\nLong long ago there was no no no no I'm In the movie that was the\nMan that is that Iran and\nIraq you know we're on them or do\nWe do know rather than going on in the middle\nOf me and the bad part\nOf that\nCame and they know how to do anything I don't know when they get on our daughter and I don't know\nAbout\nSome of them might not be allowed in the bag got things going on job greens I'm just in in the ... the whole world the most need them thinking being home on a general bundled them ... you might even be the not immune such low Albert ...\nLove Mario on our only gone out on the job in ... she is sending me and they\nDon't talk because they don't have time for ... billion dollars on the front yard now why can't the\nHappy but I don't know but they don't they don't want it to be gone but in the beginning of time on the drawing down again\nWhole village by me why some Bowling Green somebody who was don't myself you'll see ... year old son ... send me a lot to talk about some of them the more Israel\nDonald though my son my community that get washed out by a large segment where we can get hold of you know one year old bull shoved in which showed him one more peaceful garbage da\nDa da da da da da da da da da da da da da da da da\nDa da da da na ... gone to the dog and then you're going to die why in the yard\nYeah you listen to tell you why it is more than one you know did you find out what your interests for Eighteen on the clock or we are to your station here some more information they give you guys are the are are you bend just want to be out in ... in October sixth and seventh for more information you calls too far far too one one to\n... the store appreciation day I was going to be held on October ... has been cancelled for more information you can call a six year old to six seven nine six or five six one nine or one seven she'd be again is six one six zero two six seven nine five six\nSeven domestic minus awareness host and encourage meant encouraging\n... valleys resource for an all go use an elderly building on October night that not brought up here for more information called two\nTo five six eight seven three human immunization and climate is going to be housed Tobar nine to sixteen\nTwenty thirty and thirty is all going to be held at the opiate health care lobbying uh during the um or more pressuring costs seven three seven six two five seven grand keep going with more music on K\nWhy why just one by one one [noise]\n\n\n[noise] [noise]\n[noise]\nI I you know [noise]\n[noise] [noise]\n[noise]\n\n[noise] [noise]\n\n\n\n[noise]\nLike they need [noise]\n\nTo maybe they'll do [noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\nAnd then a man than last big donors older than\nMe now to you know they would oh man do you still can be attained in snow me you know ... [noise]\n[noise] [noise] [noise]\n[noise] [noise]\nI got\nThat you'll see I got to have a mental thing that way but go about it after I got it up on my home town mama for me I don't want to do better\nAt going to tell them what to get out there that they're willing to [noise]\n[noise] [noise]\n[noise] [noise] [noise]\nNo not at all you got\nTo go out and then I'll tell you that he thought that you know devil in eight I [noise]\n[noise] [noise]\n[noise]\nI Know I got up dot dot dot com I got off limits the by the by the government to tell them what to get out there that ain't no doubt\n[noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\nOh my God I don't want it to me but at the bottom number to call but what I tell them what to get the emails that why are they are\nOn a man like\n[noise]\n\n[laughter]\nYou're after man you guys and Donald shark so I was like you are listening to kill you or eighty one that's been\nGoing on and on your rain all around me\nAnd\nMy\nHome in the new ... new Saudi Arabia you're out there that are not good with our modern Twain but I don't really know anybody yet on the radio on\nMay ... ... ... you know I like my wait a minute and a half hour ago in Miami and everything and you know\nOn the line na na na na na na na na na na na na\nNa na ve\nAnd no one really are going to know why because I Know I'm not going to do when I'm when I'm you know what I can find a\nWay I heard about one of our mind around\nThem I don't want me to but I don't know whenever you\nKnow on the line you know why don't\nWe know that in\nThis world where you want but I don't really know what I mean you know you in a row\n\nAround there you\nAre now [noise]\nShe found God no no no no no no\nI Know they\nDon't know but um [noise] oh no no no\nNo no no no [noise]\n[noise] um\n\nThe movie ...\nEuro na\nNa na\nNa na na na na\nNa hey\nYou know the\n\nThe new\nCarrie Underwood with forty cheat on are you are born Warner bam you're listening to your pride over here it is for forty and I'm enjoying the music I Hope you're gardening during the music is well who's been around all the reservation out during the world this need to work on\nYour on line I can you are done now hope you guys are doing all the music that I'm putting you do for putting out for you because I have plenty of more gun disorder here Stevie Wonder I mean no\n[laughter]\nI'm back and a and a\nHalf a\nMile and a very on edge by natural law back on and they\nGot a letter about a quarter\nAnd in my I don't know how to do that\nAnd I and I do that and whatever and they say\nThey're\nNot as bad as I understand\nThat I Am I not go out and rent and we go and look at you and I'm\nCurious to know I Know I don't really have a bad\nMan they\nGot a\n[noise] nurse\nAgain and again you know and they\nAre at a time that all of our way oh my\n\n\nGod I Know [laughter] [noise] no no [noise] and I am\nA shock [noise]\n[noise]\n[noise] I'm\nLike what more could be like on the net\n\nYeah which I forget Michael Jackson thriller coming on the Carolina border quarter smarter could you say everybody enjoyed or rain or who you are on the one one thing in mind\nHere ... Native American woman really\n\nOr whatever I don't know what\nTo me right now we're getting to know about the\nNumber one I don't know how long do you agree with you you may\nRemember that that would you agree with the three days\n[noise]\nOh no no no\nNo no no no no most ... do you agree but I mean if you make that would\nYou agree on three packs\nA day that I\nDon't know I\nKnow my old are you know when you know there was like oh come on\nYou know by the top of my life that would be hard to find\nSomebody\nThat you're not trying\nTo\nRe I\nMean how do you want\n", "show_name": "no_show", "year": "2018", "city": "Hotevilla", "day": "02"}