{"month": "10", "state": "AZ", "station": "KUYI", "content": "[noise]\n[noise]\nOh [noise] oh [noise]\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\nYou're\nListening to kill you or I Hope ally eighty point one F. M. S. N. K. U. R. I. L. P. upper ... eighty nine point ... projects or do you hope the foundation streaming online at ... dot net your Native American public ready oh station\n\n[noise]\nSurgery which are you the more we know now about how much are you know why do\nYou read the whole ... Halloween [noise]\n[noise]\n[noise] [noise] are you hoping to all the hello we\n[noise]\n\nYou know more than ... I'm not sure you don't have a dream imagine madam bone why the\nWhole ... Halloween [noise]\n[noise]\n\n\n\nPaid why I listeners the Arizona department of transportation states that the state highway eighty nine is closed north and south bound between ... and the two best city junction turned off due to wash out\nThe Arizona department of transportation estimate that that each or will add about a hundred and Ninety miles to motorists trip on interstate forty\nState route eighty seven state route to sixty four and us one sixty update\nKosher multiple days expected on us eighty nine north of Flagstaff\nBeer flooding has cut roadway between Cameroon and us one sixty the Arizona department of transportation is working to reopen a section of us eighty nine separate by budding about sixty miles north of Flagstaff between state route sixty four and Kamron\nAnd us one sixty\nWith us eighty nine expected to remain closed for multiple days due to the wash out between my post for sixty seven and four eighty one or the Navajo reservation\nMotorists heading to page\n... and other destinations north of camera and can take interstate forty east from Flagstaff two state route eighty seven at Winslow then head north to state route to sixty four\nNorth West to us one sixty into by city and west to us eighty nine for those traveling from points out on us eighty nine the closure doesn't affect access to the Grand Canyon national park east entrenched\nBeer efforts are sixty four director of the Hopi department of transportation said motorists using state route through the tribe's reservation\nShould watch for pedestrians and for local traffic including buses and also should be aware that I'm stretches have sharp bend and the great\nAgain this is an update of closure of multiple days expected on us eighty nine north of Flagstaff\nArizona department of transportation is working to reopen a section of us eighty nine ... by flooding about sixty miles north of Flagstaff between state route sixty four and camera in and us wants to be\nWith us eighty nine expected to remain closed for multiple days due to the wash up between my posts for sixty seven and four eighty one on the Navajo Nation\nMotorists heading to page Cuba's city\nAnd other destinations north of camera and can take interstate forty east from Flagstaff two state route eighty seven at Winslow then heading north to stay route to sixty four\nNorth West to us one sixty into by city and west to us eighty nine for those traveling from point\nUs eighty nine expected to remain closed for multiple days due to the Y. shop between my posts for sixty seven and four eighty one on the Navajo Nation motorists heading to page\nYuba City and other destinations north of camera and can take interstate forty east from Flagstaff through state route eighty seven at Winslow then heading north to stay route to sixty four\nNorth West to us one sixty into the city and west to us eighty nine for those traveling from points out on us eighty nine the closure doesn't affect access to the Grand Canyon national park east insurance via as are\nSixty four director of the Hopi department of transportation said motorists using state route through the tribe's reservation should watch for pedestrians and for local traffic including buses and also should be aware that some churches have sharp bands and steep grade\nAnd then there's your update on the closure\nOf us eighty nine north of Flagstaff once again you're tuning into ... eighty eight point when they're fair man K. U. R. A. I. L. P. upper ... coffee eighty nine point one FM also streaming online at K. U. L. I. I. dot net your Native American public radio station\nIs your cat you why I community calendar\n\nYou know [noise]\nAll right thanks for joining in decay you why I and here is your community counter update for this Thursday October for two thousand eight team first step KU why I cannot be heard debilitated among company on eighty nine point one FM the little ... you know it's a hundred yards\nAnd reaches approximately ten miles ... down a notch a doughnut and support K you why I finally reaching are hoping villages and keep on our hope the voices and broadcast strong\nStay tuned for our official on as we continue to seek airline assignment KU why eyes now located at the judge enough to sixty four and eighty seven in second Mesa K U ... telephone number is Ninety eight seven three eight five five zero five\nAnd our facts number is nine to eight seven three eight five five to five\nK. you why I six my hospital or by speaking volunteer and committed their bodies are born and members RCA it'd be helps response station and educate the community about the importance to okay you why I Hope he radio visit K. U. R. dot net or email us at ... dot net for details\n[noise] more music coming up next after this brief message\n[noise] ooh\n[noise]\n\n\nAttention K. you why I listeners the Arizona department of transportation states that the state highway eighty nine is closed north and south bond between ... and the two best city junction turn\nOff due to wash out the Arizona department of transportation estimates that the Detroit will add about a hundred and Ninety miles to motorists trip on interstate forty states route eighty seven state route to sixty four and us one sixty update\nClosure of multiple days expected on us eighty nine north of Flagstaff severe flooding has tracked roadway between Cameroon and us one sixty\nThe Arizona department of transportation is working to reopen a section of us eighty nine separate by flooding about sixty miles north of Flagstaff between state route sixty four and Cameron\nAnd us one sixty\nWish us eighty nine expected to remain closed for multiple days due to the wash out between my post for sixty seven and four eighty one or the Navajo reservation\nMotorists heading to page Cuba's city and other destinations north of camera and can take interstate forty east from Flagstaff two state route ...\nBut the patient is working to reopen a section of us eighty nine ... by flooding about sixty miles north of Flagstaff between state route sixty four and Kamron\nAnd us one sixty\nWish us eighty nine expected to remain closed for multiple days due to the wash up between my post for sixty seven and four eighty one on the Navajo reservation\nMotorists heading to page Cuba's moody and other destinations north of camera and can take interstate forty east from Flagstaff two state route eighty seven\nAt Winslow\nThen head north to state route to sixty four North West to us one sixty into by city and the west to us eighty nine\nFor those traveling from points out on us eighty nine the closure doesn't affect access to Grand Canyon national parks east insurance via s are sixty four\nDirector of the Hopi department of transportation said motorists using state route through the tribe's reservation should watch for pedestrians and for local traffic including bushes and also should be aware that damage stretches have\nSharp bend and the great\nAgain this is an update of closure a multiple days expected on us eighty nine north of Flagstaff, Arizona department of transportation is working to reopen a section of us eighty nine ... by flooding about sixty miles north of Flagstaff between state route sixty four and camera in\nAn us one sixty with us eighty nine expected to remain closed for multiple days due to the wash up between my post for sixty seven and four eighty one on the Navajo Nation\nMotorists heading to page Yuba City and other destination is north of camera intend take interstate forty east from Flagstaff do stay route eighty seven at Winslow\nThen head north to the route to sixty four\nNorth West to us one sixty into by city and west to us eighty nine for those traveling from point out on us eighty nine the closure doesn't affect access to Grand Canyon national park east insurance via s\nAre sixty four direct job they're hoping department of transportation said motorists using state route through the tribe's reservation should watch for pedestrians and for local traffic\nIncluding buses and also should be aware that some stretches have sharp bans and steep grade then that is your update on the closure\nOf us eighty nine north of Flagstaff once again you're tuning into ... eighty eight point when the ... out the upper ... eighty nine point one FM also streaming online at K. U. L. I. I. dot net your Native American public radio station [noise]\n[noise]\n\n\n\n[noise]\n\n\n\n[noise] [noise] [noise] I don't get to watch\n\n[noise] [noise] [noise] [noise]\n[noise] yeah I Am [noise] not\nNot at all [noise]\n\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise] [noise]\nDo something to take it off I mean [noise]\n\n\n\n\n\n\n\n\n\nDa da da da da da da da da da da da da da da da da da da da\nDa da da da da da da de la la la\nLa la la la\nLa la la la la\nLa la la la de da de ... de de de de ... under the new things\nAll the local ... de da da da da da da da\nDa da da\n\nDa da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da\nDa da da da da da da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da da da da da da\nDa\nDa da da da da da da da da da da da na na na na na na na na\nAnd you know in a no no no no more [laughter]\n\nNa na na na na na na na na na na na na na na na na na na na na na na na na na na na na na\nNa na na na\nNa na na na na na na na na na na na na na na na na na na na na na na na na na na\nNa na na na na na na na na na na na na na na na na na na na na na na na na\nNa na na na na na na na na na na na na na na na na na we're no no no no more\n[noise] [noise]\n... ... ...\nAnd and and and\nAll but still ... and ran over your dinner for ... and my older brother\nOr my nine year old and I'm sure they went to the river and there were\n...\nAnd and and\nJust a her over and over and over and over\nAnd over and over we're go we're better\nOr anger or your father or mother or your Burger King or are you married or do what do you remember the war or\nEleanor tire her mother and father were younger than\nMe very very low and painting or ... or ... or ... and\nAnd and [laughter] and [laughter] and\n\nUh her ... her and her her her all the time the ... or ... or\n... or ... or if you're a singer and your your wall or you're a murderer\nOr you're\nIn the spring of ... or ... years ago and you're wrong on ...\n[laughter] and and\n[laughter]\n[noise]\n\nAnd you know you're you're ...\nOr follow your own home and follow loan or fewer Americans do their own maker or do drugs and they all along or you\nMurder or you know\nVery well in\nBoulder and you're ... you're in a tiny number ... ... and very rarely get\nA gun and murders and me\nAnd [laughter] and\nYeah and and [laughter] [noise]\n\nSo [noise]\n\nAttention K. you why I listeners the Arizona department of transportation in states that the state highway eighty nine is closed north and south bound between Cameroon and that you basically junction turnoff due to wash out\nThe Arizona department of transportation estimate that each or will add about a hundred and Ninety miles to motorists trip on interstate forty state route eighty seven state route to sixty four and us one sixty\nUpdate kosher a multiple days expected on us eighty nine north of Flagstaff there'll be flooding has a roadway between Cameroon and us one sixty\nThe Arizona department of transportation is working to reopen a section of us eighty nine triggered by flooding about sixty miles north of Flagstaff between state route sixty four and Cameron\nAnd us one sixty\nWith us eighty nine expected to remain closed for multiple days due to the wash out between my post for sixty seven and four eighty one or the Navajo reservation\nMotorists heading to page Yuba City and other destinations north of camera in Tempe take interstate forty east from Flagstaff two state route eighty seven\nAt Winslow then head north to state route to sixty four\nNorth West to us one sixty into by city and the west to us eighty nine\nOr those traveling from point out on us eighty nine the closure doesn't affect access to Grand Canyon national park\nEast insurance beer as are sixty four director of the Hopi department of transportation and motorists using state route through the tribe's reservation\nShould watch for pedestrians and for local traffic including buses and also should be aware that some stretches have sharp bend and the great\nAgain this is an update of closure of multiple days expected on us eighty nine or ... the Arizona department of transportation is working to reopen a section of us eighty nine severed by flooding about sixty miles north of Flagstaff between state route sixty four and camera in\nAnd us one sixty with us eighty nine expected to remain closed for multiple days due to the wash off between my post for sixty seven and four eighty one on the Navajo Nation motorists heading to page\nYuba City and other destinations north of camera and can take interstate forty east from Flagstaff Tuesday route eighty seven at Winslow been heading north to stay route to sixty four North West to us one sixty into by city and west to us eighty nine\nOr do some traveling from points out on us eighty nine the closure doesn't affect access to Grand Canyon national park each insurance B. R. S. are sixty four director of the Hopi department of transportation said motorists using state route through the tribe's reservation\nShould watch for pedestrians and for local tropic\nIncluding buses and also should be aware that some stretches have sharp bands and the grade than that is your update on the closure\nOf us eighty nine north up like that once again you're tuning into ... eighty eight point when they're fair mentor you why I I'll be upper ... eighty nine point one FM\nAlso dreaming online at the Y. I. dot net your Native American public radio station you\nAre listening to KU why hotel uh eighty eight point one F. M. N. K. U. I. L. P. upper among Coby eighty nine point one Amsterdam projects the Hopi foundation streaming online it came why dot net your Native American public radio station\n\nI I I'll be upper money could be eighty nine point when FM also streaming online at the Y. I. dot net your Native American public radio station\nYou are listening to KU why hotel a eighty eight point one F. M. N. K. U. I. L. P. upper among Coby eighty nine point one FM projects the Hopi foundation screaming on line Nick Cave Y. dot net your Native American public radio station\n[noise] [noise] [noise]\n[noise]\n[noise]\n\nWe\nHad a great old bottle of warrior that road of girls applying the set up on a lot of only interest rates even worse for the night when I Am going to ...\nWhen he was he had a man that before the creator people whether it's\nFor for a long day for a long night on the ground a gift from the decision was\n\nSaying\nNo bullet will never hurt me who are on your way to go my son he just people you know well all of the weight of low level you will by somewhere very\nBlessed you do with it and put it on your windows and\nAll of a lightning bolt painted across from me when I bought on your body down go your way and then\nWhen you\nBecome a warrior your show where they don't give up your people and to your show we're no leader up as people who have become a man\nCamp on the banks of the river you wouldn't make is\nTwelve thousand warriors when they knew it wouldn't last long nuts but only the lead charges and breathing in the new one\n\nWhen the battles over everything would deal with every horse and every so you're going to get the woman who\nWas lighting horse read all the little to no avail and then return on this lawyer who knew someone who may\nBe drained by its own people people\nYet or what they call it went into\nThe gate and crazy or who\nAre\nNow the thing of a great warrior that go for all the planes you know a lot of owning or you would think [noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNew law school you knew how to go to the polls seem to be the last\nGo we go\n\nTo the ... walls oh whoa whoa whoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa or or\nOr or or\n[noise] [noise] [noise] [noise] [noise]\nOh we're on our children are just for\nMy ...\nAnd cherish and\nThey were launched version Johnny\nCash\nAnd\nWhy and\nAnd and yeah\nAnd I wish\nWe were on\nA Spanish\n\nMonitoring our word Josh\nAnd Josh\nAnd Josh\nNa na\nNa na na na na na na na\nNa na na na and AA\nAnd drama and I am a bar or a\nJob and ... issues\n[noise] they\nChange the shape of the nation to be\nSure the Kurdish he should be true oh\n\nMm Mm no no no no no no no no no they were going to go to the [noise]\n[noise]\n\nOh I remember the the lady and no ... ... but they broke the law and then the first ... [noise]\n\nUm I live has never been a buffer zone they uh they were all there was a long long do you\nThink those ... who\nLive\nThere and all that they know that those them well yeah and the quality of the greed and the son ran for a number of uh\nNo look bad loans to sing those zones I learned from a movie and [noise]\nThere's\nA lot and uh you know\nHe's a ... and those qualities day degree\nAnd then try to live as bad as a A R crawling in the um [noise] ... [noise]\nI don't get to move a windows\nAnd now you've got young made those ... those times you just don't realize small Jimmy I [noise]\n\nDo I go on the line and then all of them will\nBe a ghost town about two dollars a day to day he\nHad been dying man right\nAnd that lives in a\nBar called then how long the\nCall and then on the knees mall [noise]\nMhm [noise] mhm [noise]\n\n[noise]\n\n[noise]\n\n[noise] [noise] and ... [noise]\nAdopt one white and you don't get a ... why I stick or ... I got more than to watch and you'll get to unique KU why\nI member Penn I doubt five or more watch and well thank you on air\nSafety are more watch get you a date with a wet\nOh just kitty ... as the eye pie tour after radio station see everything behind the scenes will take you up to decay you why I tower and for those listeners\nOff the reservation see hope peed on which cultural preservation approved guy become a member right now\nBy going on line to KU Y. I. dot net and clicking the support button you can always shocked by the station costs seven three eight five five three zero our email in from ... K. U. I. I. dot net\nTo adopt a watt us clumsy and stay Irene\n[noise]\n\n\n[noise] [noise]\n[noise] [noise] [noise]\n\n[noise]\n\n[noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n\n[noise] [noise] [noise] [noise]\n\n[noise] [noise] and um [noise]\nOh [noise]\n[noise] and\nThen\nWe have a little\nBit and then\nThe\nJudge on ... ... ... ... or ... by ... and above the trouble that's dry heat in the shower she bringing down the door just me I mean it in my heart and oh no\nNo we struggle when they go you\nKnow we all\nKnow they go\nOn\n\nWithout running around me all over the world as rich mountains below ... surrounded by the on the ball but when it the same old story did but they've got to be a change so more\nOften than even the problem with me that the money shot Inheritance The world and you\nKnow we know\nThey\n\nAre no longer a multi million dollar burning you ain't got jungle domino James Gunn I'm bombed diamonds on your ... your wing got John John Iraqi is all about the Germans\nThem on the real the people in everyone's doing wrong John Doe man I\nDon't think they'll get you on your bones they show on bond that high remember jak man we do know guide you through a no\n\nWin and here\nWe go in\nThere you\n\nKnow ... years\nWe've\nBeen okay you\n\n\nKnow\n\nThis guy ...\nOh oh oh good\nMarry her and my little short on when they die or be\nLaying in bed and\nI'm\nGoing to be the nominee you don't share friends watching her family from the lady from ... to a wanting to go to jail and ... with a book that just does bring you used to have people with no recreating the dream while loved in the peace\nOf mind I could be\nThat bad\nYeah [noise]\nUm be extra CDs and the nominee you don't you can share friends much exchange Jewish family from the lady from ... am wanting to go down with them for that\nJust does bring him and he doesn't have to know recreate the dream while loved in the peace of mind I ...\nAnd and the man and\n[noise]\nDown here and overwhelming poll shift show who was still on top bono\nWhile I mean I'm surrounded by my brother's a dining and Margot suppliers sky encouraging and I don't know each one change what we already have known to man in her mind if we both like all along hang on for the call\n\nAnd\nWe all remember what it means the world\nAround a lot\nOf your brain in your car I don't know\nEven though don't you don't remember one overwhelming eagle while I'm On\nThe show remained angry and how they're listening now after my name is Sharon [noise]\nRight right right now I'm a guy and a day and then I got\nPretty much but just the bad guy in a new job search in ... well no matter what drives the pope's W E a good name but he gave me I\nKnew who was um [noise] then one by putting him on this day I went down on my knees and green far up in the show me or anything but mine though that you can find a multi\n... and how they're going to get my name is Shawn la\nDi di di di di ... that have\nCome in and they want to torture on getting no no no we're not getting\nAny more money you know not only\nAgree with you on that thank you job by everything you do and\nI thank you bought the mayor recalls you showing me as far as the mother returned my\nWhole yet some problem that needs to move around in a while back that can be found much truth than the truth I sit\nThere in New Orleans how draining out my dad didn't show the\nGuy and we will maintain a gang or a bad guy [noise]\n\nWhat's that sit there in New Orleans how draining out [noise] by Michelle [noise]\nGod I mean that guy [noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n\nSo [noise]\n\nAttention K. you why I listeners the Arizona department of transportation states that the state highway eighty nine is closed north and south bound between ... and that you basically junction turn off due to wash out\nThe Arizona department of transportation estimates that the Detroit will add about a hundred and Ninety miles to motorists trip on interstate forty state route eighty seven state route to sixty four and us one sixty\nUpdate closure of multiple days expected on us eighty nine north of Flagstaff there'll be flooding has cut roadway between Cameroon and us one sixty\nThe Arizona department of transportation is working to reopen a section of us eighty nine shepherd by flooding about sixty miles north of Flagstaff between state route sixty four and Cameron\nAnd us one sixty with us eighty nine expected to remain closed for multiple days due to the wash out between my posts for sixty seven and four eighty one or the Navajo reservation\nMotorists heading to page Juba city and other destinations north of camera and can take interstate forty east from Flagstaff the state route eighty seven\nAt Winslow then head north to state route to sixty four\nNorth West to us one sixty into but it's really and west to us eighty nine for those traveling from points out on us eighty nine the closure doesn't affect access to Grand Canyon national parts\nEast insurance via s are sixty four director of the Hopi department of transportation said motorists using state routes through the tribe's reservation should watch for pedestrians and for local traffic\nIncluding busters and also should be aware that some stretches have sharp bend and the great\nAgain this is an update of closure of multiple days expected an us eighty nine north of Flagstaff, Arizona department of transportation is working to reopen a section of us eighty nine separated by flooding about sixty miles north of Flagstaff between state route sixty four and camera in\nAn us one sixty with us eighty nine expected to remain closed for multiple days due to the wash off between my post for sixty seven and four eighty one on the Navajo Nation\nMotorists heading to page Cuba's city and other destinations north of camera and can take interstate forty east from Flagstaff do stay route eighty seven at Winslow then heading north to stay route to sixty four\nNorth West to us one sixty into by city and west to us eighty nine\nFor those traveling from points out on us eighty nine the closure doesn't affect access to Grand Canyon national park east insurance via s are sixty four director of the Hopi department of transportation said motorists using state route through the tribe's reservation\nShould watch for pedestrians and for local traffic\nIncluding buses and also should be aware that some stretches have sharp bands and ... grade\nThen that is your update on the closure of us eighty nine north of Flagstaff once again you're tuning into ... eighty eight point when their feminine K. E. Y. I. L. P. upper ... eighty nine point one FM\nAlso streaming online at the Y. I. dot net your Native American public radio station\nBut yet ... stop ... yeah yeah yeah\nWave the N behind my camera\nBut yet you write in the ... ... you should kill ... but he can yet bullshit that get that but the ... the ... my ... radio station KU Y. I. eighty eight point one ... and ...\nSkimming on line ... K. E. Y. I. dot net\nMy aunt ... shows said nine I'm the I'm Sorry he have like ... and it got me and she'll say ... ... ... ... ... yeah that that I only get it get it done ... that will be she'll say\nIf I only ... ... ... ... and it ... them all day and I can't ... I'm I'm you know when I ask\nYou one call in Georgia and the way you know my mom was\nA while now but it turned into a black downright mom or dad\nBomb was now but I'm a math major is run by\nDoing much you know we're all in where we're at one is the name of your time then you might you know where do we know we're all people try to go\nUp Iran may emerge in this world we know about what's wrong with everyone does traveling from emerging world where the law of everywhere\nBaldwin mama name on the journey was lied\nAbout major lie down\nIn my genome world where they blow up everywhere\nIn la la la la vida was named bond honoring mature neuron lie down and write\nA one on their body language or on the line\n[noise]\nYou're you're more than a love by your best friend ... do you got my back to the very end and even though we argue again and again that I Know you've got my\nBack the between wait the worse to get that when we don't get the worst coast okay that one way to get down to you what I Would do never like birds up that we should look at the reach of Bull Run for worse off now have programmed by ... by red ball a little about\nUs do that to me and I\nKnow you're the man who you are\nYour thoughts to me and\nYou are you today [noise] so how\nLong it'll be that I don't know about a one on me that ball or not the only one of the Nassau\nCounty [noise] uh one one\n[noise]\n\nNo news already shown rules in Asia is John John with Bob Let's see if I Want to come on\nDown the council alive and\nTangled Tony I read and write and da da da da da da da da da da da da da na\nNa na na na na na na na na na ... good I didn't dare American Pie and ah you\nKnow what do you block all wiped out whether you're you know read Dr or what you may not be to be arguing they may not be a total bro that's people got ... only what about for window\nOn on joint or they came on and on top of a job or not you know McDonalds you breed them on my top ... you'll nurture noted on digital ... up\nTo be when it comes down three I have no power\nAnd by that by the time\nI had a young man they hand out by\nA car and you know people\nEvery show you know can I be there on a golf ball your problems like Joe the long term care\nComponent that Pomona trick golf on your toes on that get the ball is only about let's say why don't you know my daughter's jaw dropping your best to what\nYou think back to your mom try to repeal like ... told me oh we love from your in laws don't worry about that man that's more than ...\nAnd I caught it\nWell people every show you on TALK to the beach unchecked gumbo your problem like Joe the long term care component in Oman unchecked golf\nOn your pool's going that get the ball is on that same point your daughter's jaw tried your best to walk through and I think back to your mom try your book to read all about like ... lab tried they told me away\nLove from your nose and don't worry about change that man that's more than ...\nAnd I thought God at a time and time\nAgain by a guy from are you married by the time by half a day\n[noise] [noise]\n\n[noise] [noise]\n\nMe out here they are going to buy a habit di di di di di\nDi di di di di di di\n\nOr a bus or a\n\n\n\n[noise]\n\n\nA lot of my ... my ... a a no ma cool not pull up who knows how to eat a may ... Koch we have a a may ... full on may help ... I'll be a\nKey yeah we uh cook on my knee Kayla aloha we are I'm native Hawaiian from the island of ... on the island of Oahu and the ... we belong to a group of twelve native design um Hawaiian\nCharter schools and we're so happy to be\nWith you and hope he led today and to really see the beauty of your land and the beauty a few people and\nTo learn to gather about our age should ways we tried to revive always you know homeland\nOf Hawaii and we're so happy to see you folks also trying to revive the weight of your ancestors we wish you much success in those at first and know that you have made his brothers and sisters and other parts of the world that are trying to do the very same thing a little her my\nMm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm\nI mean what you did you see a number on you know\nWe are bad and then they change I'm normal June mid June and I know you've played you know the rule of law known you know we live in Montana or\nArea in the meantime you know men men and women are going to get a little bit of mine at me and Vince rather than ... do you manage\nMoney man a man\nIn a life is like the major thing you've got to breathe your mind then then they may do it in\nYour genealogy new psychology unknown men can you bring that men are not strong man and you know and then they can\nManage trees all that much I can be in a written in Manhattan and all I can even these this\nMoney man when\nHe ... he\nBy using the Internet to resources like can still it stems and guide them on the way we could fix tomorrow form of direct cannot today we could give this world I Know what they have to remember what it is in a rough\nLife yeah I had I\nHad\nA\n\n[noise]\nA child\nAdrien Adrien breach out or not we used to be bothered the all time which I don't know what it's all in or not you know do you do I do I say\nRise up by your father bowed jobs dont do student I bring down all bought a ... do we do a show called ...\nCharlotte's based on worldwide go I'm Sean ... about the only way the changes they were showing and make it back up on that next January\n... was on hand to all the time at a car to get all the dogs that saw no matter who you are or where he'll probably shown as well so on and on\n\n\nAnd on and then they\nWould learn\nTo [noise] um [noise]\n[noise]\n[noise]\n[noise] [noise]\n\nOh [noise]\n\nAttention K. you why I listeners the Arizona department of transportation states that the state highway eighty nine is closed north and south bond between ... and the two but the junction turn up due to wash out\nThe Arizona department of transportation estimates that the detour will add about a hundred and Ninety miles to motorists trip on interstate forty state route eighty seven state route to sixty four and us one strokes the update\nClosure multiple days expected on us eighty nine north of Flagstaff there'll be flooding has cut roadway between Cameroon and us one sixty\nThe Arizona department of transportation is working to reopen a section of us eighty nine separate by putting about sixty miles north of Flagstaff between state route sixty four and Cameron\nAnd us one sixty with us eighty nine expected to remain closed for multiple days due to the washed out between my post for sixty seven and four eighty one\nOn the Navajo reservation motorists heading to page Juba CD and other destinations north of camera and can take interstate forty east from Flagstaff two state route eighty seven\nAt when low then head north to state route to sixty four\nNorth West to us one sixty into by Judy and west to us eighty nine for those traveling from points out on us eighty nine the closure doesn't affect access to the Grand Canyon national park east insurance\nBeer as are sixty four director of the Hopi department of transportation said murder is using state route to the tribe's reservation should watch for ... and for local traffic including busters and also should be\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\nNice to have a [noise]\nI mean let me tell you [noise] how\n... we have plenty of it you're going to come by but come front of me and my mum about Africa for them to somebody that you're going to say about them but there are enough I I don't know\n[noise]\n[laughter] [noise]\n[noise] [noise]\nUm [noise] I'm\nGood and you should [noise]\nYou know\nI\n[noise]\nI I just said his until we get a job as soon as I said that when we lived in Iran or you know the master the\nBut be soon you're the person but not sure if this is the case judge Mendez v chip you guys do what he said that's a really\nNice and I think a token M Ms fear from this last above event was read them and they gave me a while and I see myself what would you\nKnow just having a\nCoupon coming down on green street [noise] July on there among the most among the if the lion the witch solo\nOh da da da da da da da da da da da da da da\nDa da da da da da da de la ... thank you we are a lot of\nUh [noise] you know I'll be done you know\nKnew I was the other hand I show jobs even as a pope and give them a lot of event was\nSpread to pay you ... you know most of the new I ... and I said [noise]\nYou know I can still buy a nice uh [noise]\nI dunno I Know [noise] ... [noise]\n[noise] [noise] I mean obviously not you're not doing drugs or you know [noise]\n\nI raised with the uh the ... vote and that makes it a duck\nThe question what about John see I like\nTo join the average just up on the same thing will come on down the steps in a um\nA speed bump them about the New York I'm In a\n\nBlue eyes and you know then then you run a bunny rabbit was demanded of you know my my little you\nKnow I I used to have [noise]\nI mean the rights of that is I Know we can do that you know and when we set up that you know I I was just it it might not have it on\n[noise]\nMm Mm no\n\nMissing layer Austin oh the beer and you are listening to KU right I Hope the radio streaming online KU why high dot net\nAnd we're very excited to be here talking about possibilities is working with the ... people on watershed oh I just sometimes who we restoring water why don't shed restoration\nAnd registering community working with the land to restore the water ... something that you were done for generations and in the face of global\nWarming and climate change yeah just one of the most important things we can do\nAnd we can play thanks for having been inside ... K. you why\nYou try to be here talking about the possibilities of working with the Navajos people on watershed oh I just sometimes we we restoring water why don't share the restoration and\nRegistering community working with the man to restore the water ... something that you are done for generations and in the face of global\nWarming and climate change each one of the most important things we can do\nAnd we can play thanks for having been indicted ... K. you write I Hope the radio [laughter]\n\nOne and it is what was that there there are no no no they do but it's a little man\nThen log on and on on the Internet but also a lot of tennis and I was going to\nPull him on they know that could make radical Muslim there during the guy hung on them monetarily now they're going\nTo know them much of the none of them but I just wanted to do that\nWith a good look at the level of oh here's here's why does it when there's a lot of these I've done the same time all alone and I\nWas a man who was up at a young along to the gym but um I hear you man to\nMan I mean who knows\nWhat about the law\n\nAnd my boss was the last movie that I was there you want to hold on\n\nTo quit so ... is that about you know there are there do you think this woman got to do than a month you know I Know\nThat we might have played Lucille Ball game\nOr is it that to\nMy mind I let him be glad to pull those [laughter] I\nBad you know\nThe land that you won't believe this is the best job below one just about that genetic I read the army he did he do the job but\nIt's still bad blood bragging but he didn't give her\nThe best years of cooked up you know that cause I Know I Know but the guy that and then you don't have that I Know about stuff\nLike that I Am not our na na na na na na na na na na na I\nKnew John John and the minute I could just\nShow although I'm not much room ... new drugs then you show a long\nTime so I Need to know you hear from those little things that he was you know when the last three that book\nOh my God\nMan John Miller who's supposed to hold on [noise] um yeah I Love my job rules you lose a good TV show on a need to hear from\nThose people that actually was you know when the last three on board with a lot younger than that he'll pull the wool over\nThe world and I knew that joke wasn't that long [noise]\nOh I Know I don't think I can get\n\n... this is Karen from done huh can Holland and do you are listening to ... eighty eight point one FM Hopi radio streaming online at K. U. I. I. dot net your Native American public radio station I'd like to thank all of the people here at the K U I studio\n... love and does it often as I can for his wonderful job they do I love listening to pay you why I on line drink my morning coffee with the evening programs here and also to the wonderful hope the people here on all the nicest thank you for your hospitality and the warm welcome I always feel when I come and visit\nAnd you are listening to K. U. I. eighty eight point one F. M. Hopi radio thanks a lot of ... and slumped liquor\n[noise]\nDo you know we're on the far right and who's a livable jumbled up on like the when the ... ... ... my mom I have a lot\nOf money a\nLot of times my mother in law ... been up in a very long way to go down that I grew up on\nThe stand living like that no I don't know so far I relate to a\nMan by you know what\nI'm most ... most but\nI think I Will say well I think my mother is a new one up to bring those results are we going to cost to make up\nTo the dogs are bluer than most ... most when I was going to kill but I'd rather them and then you got an a ha ha ha\nHa that's I'm sure you guys live but you'll find the ... no one no ... no probably better than no object that you love me man [laughter]\n... do they mean by ... by the way that you know my father you know want to know whether that has\nNot seen you know better than my milking the opening day I Try to stir up\nMy ... my ...\nFamily members to throw the long run I don't think they might not know\nMillennium and right here by no less lonely and I will be the most magical so yeah I think I\nLearned how to build that God\nNow ha ha ha ha ha that's got to be the first I've got to know about the whole plot and no one no way that the teachers don't love and then that might not giving up the tab I Do not even\nA ... month old my mom I bet they do but I mean I was in a whole lot more money than they did\nMore than I was the most junior near the guy's long from both sides are ha ha ha ha ha ha ha ha ha ha ha\nHa and then\n[noise] I mean I Know for them\nTo know\nThe other side of the Web address was shot\nIn the really bad or you'll find\nA job and you'll get yes I Am so bad that that meant that Dr ... but then\nI Know that\nThe way that they do when\nYou're when you're in the job\nThat doesn't that mean that I think you could be that followed I bet it cause you to you when they when they're on the ... yeah there\nWas no way the guy I Know\nThere's\nNo na\nNa na na na na na na na na na ve\nIf you compare that bottle I I've been there goes your opinion when they when they are the ... yeah there's always\nThe guy I Know na\nNa na\nNa na na na\nNa na na na na na na na\nNa na na ... or like you have a good road we probably had then and there was that my wife you know or\nIt's like you have people that were so many months right God Bless the mall or\nSomething I don't know I\nLike the\nGuys na\nNa na na da di da da da da da da\nDa da da da da da da da da da da da da da da da\nDa na\nNa na na na na\nI like the home I'm not going to love the host of that than duct\nTape and then it just goes on the news and it does it does but I think he Will Smith as much as\nYou say I never got any and all\nThat that that goes along with the fact that there's a song once I got by now that you know don't like the new pants back I didn't hear that love your own you know\nI sat down on your Web you know when I hear that there's nothing that says that there is there but I knew some of\nThem are already in the\nArea and [noise] don't there's a few of them you know one that we have over here they came out that there's any\n... any of\nThose who don't know they might as well\nThat W ... just sign isn't that nice long one another and and you know all the time like that and then then they're not going to go now both of them\nAre and John and it's just not going to love your job and\nWhen the dog will get to get him on this man and woman will be a little much the same man\nI'm supposed to be well then let them learn got me he said that uh some to bundle up maybe I don't know but but I Love them to find an abalone I'm into the\n... all day and\nI did it brings back and said I Love your own thing nobody does that sound you wanted those back up in the sense that dance and so they said they built up I never know what do you get that hot now Florida and in fact\nYeah [noise]\nHa ha ha ha ha ha [noise]\nDoes end up here in the new guy who was the topic yesterday or do you think\nThat the reason that the U.S\nWhen those limits me oh I got up he'll grab them go along\n\nWith one another and in your mom your bed that I'd like you know\nI'm not going to look up to the land or [noise]\n\n[noise] [noise]\n[noise] man I\nDidn't go to the gym I Know that I noticed that do it well it does stand okay no thanks thanks to turn that and I\nHave not yet ... than a year but I doubt that that rise up and you're supposed to have a choice to make him up and not and then the best that they passed that are that nacho rather than ...\nWhen it does strike me as a threat to the ... or\n... percent like when your hands and tech support study you know then it sounds like a couple of minutes go by you know nobody's although the chance to interact and my hand on 'cause I Know that do have a boat on him and\nI take that they can adjust and I just thank God but I have a new law law I'm living in a in\nA in a row for you to be here is\n... ... oh that's a term that they will have one in China that will hold aware\nFactory jobs nobody goes on if they're not about the em I Love it bowed\nOut there and then it turns out man I don't want to have a man but\nWe'll go to Doug in ...\nThat knew him up on that I Know it's I Do I Know the bad guys were just they take that it turns on hand at that time that you had said that God is now yeah but I never got beyond your clothes off their land on and I\nTried to make the most but not in bad times and I read that take up right now and I'm not sure right I've read that picture that when you try to read I just turned ... as I said I Know they were like one of the tree and then\nI Want to do in the whole you know\nYou're not going to be put down by\nThe parents will will how\nAre you saying that\nA man is that all the laws that protect bank here has a show oh maybe a man and stuff that you\nKnow\nAre listening to K. U. I. ... eighty eight point one F. M. K. U. my eye out the upper ... eighty nine point one FM projects at the Hopi foundation seeming online at K. U. I. dot net you needed American public radio station\nOh for fans here has a show where you try to get that stuff that you\nKnow\nYou are listening to K. you I I ... eighty eight point one F. M. K. U. I. L. P. upper ... eighty nine point one FM projects at the Hopi foundation seeming online at K. U. I. dot net your Native American public radio station\nThere they say hey you know why I write about why why why are they are lying asked you why I got yeah you're right I yeah right right right\nWell I ... down the way for them died that day no nothing done show and they they um\nThe mountains or ... I took a trip ball let's say ... so what do they do make a mate as well and that\nThey were my mama way well maybe by Romania day my heart and um I had is turning around and I had to leave a liberal ... being in a\n... a ... a very well but the thing goes away and do a borough I must be ... for a man from New Mexico they\nGo they climb on my way lower the bad moment here day in my heart is now my head is nodding around but I Do believe that the girl in the middle of a\n... a down in the marketplace you can you learn is ... is that the fish sunrise the names are not ... by the time I'm here well lives that\nSay by law law way blown away by a woman in Rio de La Guardia is now my head at around ... I had to leave a little girl and king and uh\n\nThe the [noise] um he\nOne where they do the job market we got the Boeing deal the full\nBlown you hear\nThese songs um read a lot I\n... ... ... ... ... ...\n... ... Mm [noise] Mm [noise] Mm Mm Mm Mm Mm\nMan they bring us now from men have plenty of drinking one gives me a mine and\nI don't know ... na na na na na na na na na na na na na\nNa na na na na na na na na na na\nNa na na some far we've got just ... just\nFor the phone you share your ...\n... the moms them read to modernize ... days are shown and I'm a non\n... these\nGovernment raised on\nYou guys just foolish things in\nThe book the phone you can do\n... D ... read on the on line three games are shown non on how many [noise] ...\nSees some some readings on ... you know\nTurn turn turn any time you know ...\n... the way\nI Am playing\nWell\nA male\nHey hey are you a young age and play\nOn a holiday um oh well you know the thing\nIs is that ... will tell you know\nTheir way now players way\nThey are they now\nHave generators ... ...\nEmail\nSaying hey I'm now ... there's ...\nNo no no well they are now and now\nI Am who I Am I have a you know\nThey they are they ...\nA man after you know when you're\n... na go they they\nThey'll do is go on\nSaturday and is that your your salary but they\nThey are saying and then they ...\n\nAnd raining down there all day today is the\nWay they are ...\nPlayers play\nOut a ...\nAnd ... ... ...\nDown man ah the\nPlayers ... everywhere you know they they\nPlay on a scale I play I don't know now\nWhether everybody now plenty ... basically\nI don't know no radio well they are and you know\n... down there is no\nToday and then there is no laughing matter and\nDark on your own or\nThere is a day in their name and\nYour goal or\nHowever they are in the in your day and\nI heard they heard their and their users\nAs I said I have no ...\nNo matter you\nKnow\nDuring the day the na there there is an angel\nWas going on\nThere and yeah yeah yeah yeah yeah ...\nHow are you you better there is a man that they are saying and ...\n\n... ...\n... ... ... no one to land and my way or the next thing no more\nI was oh\nMan gang\nHuh oh my oh\nMy God you know he he you know now we know the lunch rush on mom\nAnd I'm now ... ...\nOh my\n\nGod oh my God Oh yes\nTime travel the world a hobby and not travel then meaning ... many when\n... no no no no no no no no no no no no well\nYou know ... some\nRuling na na na na ... I\nLove to know\nSometimes when I'm\nI Know Bob work that day you know I I Am to my weight gain and think more I think Raul\nA man man they\nThey don't know\n\nSometimes\nI'm\nI live by word cheeses dead days when I my ... my way to think more I roll\nA man named Betty\nMy you know o\n\nL O ...\n\nO ... o\n\nOver or ... or ... or ... or\n... or the\nLower\n... or ... or ... or\n... or ... or a man or\nA young girl or a your young more him a a a her or or\n...\nWhat's your made that didn't do your job\nAnd you know what was your was your major in the news and you know why the man\nWas was the very end their lives and they play in this lot to do and there's no way we learn from the go\nTo all the time oh no no not come and then in\nTurn to and from all tend to tend to be you know is Jim oh\nDid you learn and where are you in a bomb you know you just didn't really know\nWhy do you do on that one too many more you go back to what\nYour mate does this make you only have one of the matter\n\nWhen you're a man that just didn't get the job done\n[noise] would you make a history major rather than\n... than the man who ever going to do and what was the day when you got to do and then\n[noise] I'm not I'm\nNot going to come back we're above new album price and\nYou are listening to kill you or I rely on that ... are streaming online at ... dot net welcome back it up but I can\n[noise] you\nKnow or ... or a or a car or\nOn a on a song no uh um\nI ... ... ... can you ain't got no we'll come back into the places I can\n[laughter] some of the play oh you\nKnow I'm surprised to know lawyers are you\nGoing nuts enough on a cellphone oh well I'm a ... or\n... or ... yeah yeah\nWell I'm not a good son I saw you know some are still a A N O M yeah no no no John I saw a um a a show and\nI Know a a night on your hands\n[noise] ya ya know China sunshine hotdog on a ... I'm a ... show and\nI are nine or ...\nYeah yeah well not a good showing how the no drama to show them\nHow you know lord and I am a loan\nAnd yeah yeah well not a good son how strong you know I'm a man or you know lord and I am a jam [noise]\n\nAll right we're this is a social no girls are gonna be coming out to pull you guys to come down to earth and joined us um this is a blessing from us to you and we want to share a part of this through song and dance with you so don't be afraid to come out that the\nLast ... summer yeah I have been a ... a man said I'm not in your in your um\n... um I got them all watch em a I'm a bomb on a ... a\n... edge on a charge on a bond ya um oh well I Am a\nGoal or M split face some money and you're a ... a lot of faith in your ... your ... um my God damn oh Washington hey I'm\nA I'm a bar or a ...\nEdge on a charge on no there is a bond your leg I'm most well I Am a goal for him [laughter]\nYou know you're able to find a way above your binoculars\nOr go\nCollege or read about job about narco ... for jobs\nI say oh no no no no a lot like a dollar more close to ... na na na hey we have a yellow lab on a pro\nBall for\nCharles de Gaulle nah nah no no I'm a I'm a total ... na na na na hey hey hey well now a lot\nMore for [noise]\nA ... going on no here mark going out or why do I know a\nGuy no way I Know I must say they all are they a guy\nGo and you are or not ...\nNot so what do I know him a going out a way though I Know a guy yeah hey why\nNot here my gay they do or don't ya ya have to who you are or not he\nGrow ya author or what do I know a guy a yeah hey why are now I Am ...\nA year for a while you know I mean\nOh yeah so what do you know oh God yeah yeah yeah it was a now I Am on gay\nThey saw a guy or a white guy in\n\nYour yard ... no no no no no well\nI'm a non ... or ... or ... or more jaw no jam\nOr I'm a ... a yo man jaw or know damn I say God I Know I have\nMy uh ya ya saying much I'll take 'em all uh yah de yah yah I\nDon't know I don't know ah yeah\nAnd you know well we're well my God oh God I'm I'm a ... I go to a more jaw no jam\nOr I'm a walk or a well a yo man draw knock them I say oh no not\nMy job and ya know bomb much I hey I'm also a a a a\nA I'm a doctor or a yo man draw no again and they called on now I\nAm a jar saying mom my job a whole uh uh I'm\nA I'm a ... well a yo man draw no again I say caught on now I\nAm a a yard sale than much or take a whole a John Donne\nThank you\nThe last song is are going home phone and the phone just said that basically we all came here when we heard good song and we have good feelings than we're taking all these lessons that we've heard through song and dance\nAnd we'll take them back home with the the travel about everybody back to where you came from and again we thank you very rewarding about here really is during the day and we're really hoping I enjoy it down to dinner or something\nIn fact everybody back to where you came from and again we thank her wedding about here really is during the day I really hope you enjoy your doctors that are fun\nTurn around eight in a way to get on a leash\nOn their own ordering oh go out on\nA on a on a a\nOh no I'm I'm ... I'm a stranger that analog\nAll over the next ... Ali a ...\nI have another house and I don't know how to create a great great great great [noise]\nYou know why it over\nA hot on on a crate great great great [laughter] [noise]\nOh hey hey how are they in one\nWay or the oil then what do you go a long time you want to come on oh they are a lot like why are they are all big now where do you know ...\n... oh yeah yeah I Am I a wage ...\nOwn or oh tutors or go to a ...\nA and a lot of uh uh\nI Do a cartoon and do all along that oh\nThe title and raised in a way they are a\nNumber of people who are ... years ago or ...\nOr in a a lady\nOh oil a day or so and there are a a long long long long ago\nThey turn around and then I'm a I'm a ...\nI don't know what to do it\nOn on how I'm gonna pay pay even trade hey hey hey hey [noise] you know a ... on the on the on the on the great great great great great great great [noise]\nWell actually they may very\nWell known writer or are they now waging a oh hey come on I lay in a\nWay way way or anything at all there is no way ... co ah what age ... or ...\nOr ... or ... days alone or in\nA row in or out on a really\nOh well I'm a ... and ... uh well I'm only\nGoing on right now and then I'm a I'm a little bit\nOlder than I Do know nearly ... ... or ...\nOr in a lot of like\nOh no no uh I Do I Do it on to AOL along that well they\nAre here and then I had a\n...\nI mean I don't know how did they have great great great [noise]\n... do it\nOn and I have a great great great great [noise]\nHa ha ha ha ha ha ha [noise] the\nOnly way that John Deere non non boom da da da\nAnd all that rain\nOr lay down on one young woman\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAre you where do you know\n... ... ... ... ... you know the way ... Sergei none none\nShine they they are the mountaintop\nI took a trip on us and names that want to make a bomb ... dismay my mama way wrote me by phone many a day my heart just down in my head is turning around\nMy head in the little girl in the end I'm a ... a very well\nAnd the thing is going to and fro I must think well that to my heart for a man from may to\nMaybe go all the time on my way load the bad moment here day in my heart just down my head it's learning around\nMy I had to leave a little girl and ... and I'm Down in the marketplace you can hear land is ... there is that the\nFish than rice said things are nicer than the romance by the\nTime of year well lines that say well I'm On my way and blown away by phone many a day for my heart is now my head and turning around and I had to leave a little girl and came in a\nKorean American this is Karen from then huh can Holland and you are listening to ...\nEighty eight point one FM Hopi radio streaming online at ... dot net your Native American public radio station I'd like to thank all of the people here at the K U I studio right love and does\nIt often as I can print wonderful job they do I love listening to the Y. I. online drink my morning coffee with the evening programs\nHere and also to the wonderful hope the people here on all the nicest thank you for your hospitality and the warm welcome I always feel when I come and visit\nAnd do you are listening to tell you why I eighty eight point one else am hoping radio\nThanks a lot of ...\n[noise]\n[noise] [noise]\n[noise]\n[noise]\nNo the judge and you can\nAlso [noise]\n[noise]\n[noise]\n[noise] [noise]\nI\nMean I didn't think she reached out to me [noise]\n[noise] [noise] [noise] oh man oh\nMan [noise] [noise]\n\n\n[noise]\nYour mom on [noise]\n[noise] [noise] right\nDown town they don't understand the man the man they found a free mammal [noise]\n[noise]\n[noise] well my [noise] my friend [noise] bring them up for them [noise]\nE\nMail we\n\n\nBring them\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMan\nA man ... ...\nNa na na na na\nNa na na na\nNa na na na na\nNa na na\n... ...\n... ...\n... ... a\nYear die in a\nWay for me\nTo hear your mom and my mom\nOr ...\nOr ... no no no no no no\nNo no no no\nNo no I'm a mother and\nMy ...\n... ...\n\n...\n...\n... ...\n...\n... where I live in a real a foreigner and I'm\nA school in\n... ... ... ...\n... out on a\n... ...\n... or our na na\nNa\nNa\nNa na\nNa na\nNa na na with all the ...\n... ... ... ...\n\n... oh oh oh oh\nOh oh oh\nNo no no no no no he ... he ah he\nAh ... I mean that I mean I Know he came\nOn and and\nI have one way or you know I ... I was young I Know when my mom and a son and I yeah I Know my my\nSheep on the day I had no ... on the on a\n... na na na na na na na na na na\nVE Day\nI'm not a bad knee animal lover well am I Am da da\nDa da da Da Nang and\nThey are not a bad day a number of them and I and\nThe mayor I Am in\nThe navy and the guy that when he no he he ah he [noise]\n\nBig one and a ... minute Jay hang on a budget and no no my\nName on a budget that job on my name on\nThe day he he na na na na na na na\nHey I'm\nNot I am I Am on a ...\nYou know I Am saying that I'm not\nA LAN da da da da da da da da da\nDa da and and they they are and they they\nAnd\nNot have the damn I'm In San I mean\nYou may not\nHave any anger me on a new day a man\nIn the LA a nanny and to me than I Am a man yeah\n... ... [noise] [noise]\n\n[noise] we're on a Christian home and the fish will come on and on for long person\nWants to once again mother's family is being offered to pretend to\nBe here I'm really not only do our own environment and to each other as human beings\n[noise] much we can relate to rush universal\nFamily as well [noise]\nMany and that you're just making people have a rich among the stars have\nBras prescription normally when they started they wait until the right time\nTo rebuild exponential pressure can be given to spiritual minded Britain Walker\nAnd he should not be the shoe will be fine with that but my\nI'm Alone once again when they\nMake a trip to mention they read our Chinese just shake my rent\nThem chip away from the east or nothing residents and my wife\nNow only ... director says when they weren't rambling ways to another homeland [noise]\n\nOngoing relations between some indigenous people\nIn order to orange guy people has been going on out here [noise]\nMany name American money to make you a long\nTerm and like you to come to me\nAnd my mom my mom can be up there and to return home\nFor the rest of the family or or\n\nHatred of the things you can guide spiritual people if they stick\nKnow no no no I Do know\nThat that may in a way I Do what they grow up I Know what I use the top I Do love me no matter what\nYou're mad I mean I think that would have been that way for you you are a grandparent you know what I'm saying I Am on um [noise]\n\nA\nLot of people what they do this or is it ... and you're listening to the eclectic music mix on ... I bought one\nAt a\nRomney by\n...\n... ... ...\nOr\nOr ... or ... sauce jobless\nThe movie and you're listening to the eclectic music makes one key why I eighty eight point one\n... ...\n... ...\n...\n... ...\n... ... ...\n...\n...\nWhat she was ...\nSauce ... I'm\n... now where'd you go to ... and\n... ...\nBelieve in over ... ... ...\n... ...\nHow\nDo you try\nTo\nRead or hear from them on\nA barrel by you know ... ...\n... ...\n... do you love\nTo do ...\nDo well and you\nKnow what you kill\n... ...\n...\n...\n[noise] [noise] [noise]\n[noise] [noise] ...\n\nThat's ... ...\n\n\n... ... ...\n... ...\n... ... ... ... you know your\nChild will do for a\nLong way to the\nAnd all my ...\nA holy man oh\nMm Mm Mm no you\n\nKnow ...\n... ...\nAs a gift from the oh\nAnd by a\n... ...\n... but it was the new\nYou know around ...\n... ... ...\n... [noise]\n[noise] ooh [noise]\n\n\n[noise] oh um [noise]\n[noise]\n\n[noise]\nMm Mm [noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise] [noise]\n[noise]\n\nHuh ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha\nHa yeah yeah yeah I don't know whether they do they have\nA A R O E a a a no no\nNo no uh\nHey hey hey hey hey\nHey hey hey yo yo yo\nHa ha ha ha ha ha ha ha\nHa there yeah yeah yeah yeah yeah it is\nA a\nHa ha ha ha ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha\nHa ha ha ha\nHa ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha I I\nHa ha ha ha\nHa ha\nHa ha ha ha ha ha ha ha ha ha ha ha ha ha oh\nOh oh oh oh\nOh oh\nOh oh oh oh oh\nOh oh oh\nOh I heard\nAbout this is true today from Lexington, Kentucky and you are listening to KU IRA he points one FM hoping radio screaming online at K. U. R. dot net or project as a hobby foundation you're listening to kill you are I Hope to fill up the pressure on FM\nI Need or learned that you're right I\nCan you IRAs a project of ...\n\n\nWhen my joy ... like ... to ... ... I was doing\nWas\nWrong I ... I I\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou weren't listening to the ... I ... ... when you see me on my key you why I got you you might you might be\nA Yankee game again and again and again we ain't\nSeen in\nMy mind a gay\nMan and\nHe he he he\nKnew would sign me when he\nHe he he\nAway\nFrom 'em a lamb brown is doing a car or any of\nThe NBA NBA then and\nNow we're finding a young man a man man we're going broke down man\nI have a a a a a\n[noise]\nHurt for this other social the girls are gonna be coming out the where are you guys to come down through both and joined us on this is a blessing from us to you and we want to share a part of this song and dance with you so don't be afraid to come out that\nSome miners ya half and some are where they monitor your your um ... um I got them all watch em\nA a a bomb on a I'm\nA John F. da da da da da da da dum\nLa la la la ... and ... a rare commodity your your mom saw my doctor M O O M\nA I'm a bar or a scourge\nOn a charge on orders a bond you're gone most well our and our goal or you\nKnow where you're not\nDoing your\nJob about narco ball ball\nDrop our goal nah nah no no no I'm a food ... na na na na na where there are no law about ah grows\nLong oh\nThrows goal na na na na na na na\nNa na na na na airline now a novel\nOh [noise]\nOh crawl going on no here mark going out a warning on no\nGod God no white I Know my boss is all about a guy go on a on a ...\nCar not worried on no ma drawing up a word on a a guy John yeah why\nNot here to the ball I've got a young age to who they are the way I Know is going\nTo want to do I know a ... yeah and right now I last saw water\nAnd you're a guy who you are\nNot the one door no ... no it was not about\nTo go on line or a or a white guy and\nYou know I don't know I don't know I Know\nWell over a month and I saw a dollar more monitoring while I go to a ball draw no damn\nGod I'm Mark ... a yo man\nJoe and our ... our guard I I'm not much of a young you know very much and I'm also a a a\nYoung age I don't know\nNo no no no no\nI'm not a dollar more my God I'm march oh\nGod I'm like okay well uh yo man\nJoe and now I say God I Know I\nHave my yard you're saying I'm not sure um well uh yeah yeah yeah I\nDon't know I don't know ah yeah and\nYou know very well my God oh my God I'm I'm a there was a march oh no there's a I'm a doctor or a man drove a nurse and I said\nOh no I'm not in my yard but um oh my God\nGod oh my God okay well I Know a man drove\nTheir car and I now I Am I dont know what you're saying mom by John ... oh my\nGod oh my God okay well ah you\nKnow again I say God I Know I\nAm I a a a bad man my job and I'm also a a a guy\nThat you didn't last long about going home phone and that song\nJust pass that basically we all came here and we heard good gone and we have good feelings and we're taking all these lessons that we've heard through song and dance and would take them back home with the the travel back everybody back to where you came from\nAnd again we thank you for inviting the valley here really during the day and we're really hoping I enjoy our doctors and our son\n[noise] [laughter]\nOh yeah I saw a man ... yeah yeah yeah well I'm I'm so yeah I Am\nA job again oh hey guys are okay oh yeah yeah I mean I saw a story and I I Am glad 'cause yeah you know\nAs long as they are yeah I went and saw a guy so I really I saw him I\nSaid yeah yeah well I'm Sorry I I\nWas a good job good job of Jim I'm Glad they\nTold him I Am ready I saw says hey I'm Sorry I I Am so glad yeah yeah well yeah I think I\nGet a dog in a rage I said hey I'm Sorry I I Am\nGlad they do yeah I\nJust got my [laughter]\nShould have\nDone a lot\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise] [noise] Mm Mm\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n\n[noise] [noise] [noise]\nOh Mm\n[noise] [noise] [noise]\n[noise] [noise]\n[noise]\n\n[noise] [noise] [noise]\n[noise] [noise]\n\n[noise]\nOh [noise]\n[noise]\n[noise]\n[noise]\nIn a in a number one I was younger\nI I don't I don't I don't know I Am [noise]\nAnd uh hey hey\nHey na na na na na na na na\nNa na na na na the nominee will do what I Do have a\nOne liner way I have a nine or ... or\n... or\nNot I was going on now and I'm about to go in\nA in a big thing going on and\nSaying what nine months now and I\n\nWas eight and nine nine or am I what I mean\nAny of those ... ... miles an hour and I\n\nWas nine and\nA a guy you know go out to my mom was a young man\nI met\nMy wife and I [noise] I I uh I uh I I I I I\nI don't see how the a ha ha ha ha ha ha ha ha ha ha ha I live in a while\nThey will be done about it\nIn any way\nOr\nThe nine nine or a\nOr a a warrior and my young by Yale mounted on the ... are not on our young was when I when I\n\nWas eight and nine and a way I was\nA it was a young man I have a nine month and I was I was young\nSo long on a one line it was a\nYoung I I I I [noise] the man or woman or\nA a\nBlind eye to\nEye on the ground a man you\nKnow I\nWas eight nine nine and a boy or a a way I Will not\nIt's not like oh we have done a good idea I I\n... I\nWas like man I mean I I Will be a way of a a a like a you know there\nAre a lot more young I was\nA day\nTo\nDay or night or I\nCall a ... one of the while on a number of young sailors being done in a no no no more download it on\nA ... oh no no\nNo and no one was a I don't know\nI I mean I I you know hey\nI don't know a a\nA N one no words or I Am a turning a yoyo uh well I I mean\nI Know I'm a I'm not I'm working on my\nOh a good one la la la la la a wind\nUp getting a man and a half a\nMile or not yeah oh my God so you know enough about the whole game or a man named me one day to\nDay in a while\nYeah and what not and why are you today and I and yeah I\n... I was and I I ... a\nLocal guy go away and one of the law by email and I'm a little do the same uh uh no I don't know more\nWas the da da da da da\nDa da\nDa da da and a nice day coal mine was a young young because I Am\nA non amount I mean\nI was saying it's a little or no not a new one on World AIDS day or\nA or a a a a me hey you know a a a um [noise]\nUm or or or you know ... or ... or ... or ... or\n... or\n... yeah me and my ... am helping him I feel like let that go on and not let go along with the pilots ... twenty ... twenty third clean\nNow when when they end up in the last episode\nThe Italians who I Am behind my back up from one of my favorites that tend to get funding for any team dynasty unhealthy and my the one that may come on and I feel like now I'm On my family at the man met copy thinking attendance\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWe do see a stray and then they took they took me out now we're\n\n[noise]\nEvery\nDay they should just na na na na na na na na da da da da da da da da da da da da\nDe ...\nDe de\n\n\n... the guy I was I'm sure every Gene Gene alright Kuwait and got these or read a word\n[noise] [noise] [noise]\n\n\n[noise]\nWhat do the job is John\n\nAnd one man\nOr\nA guy that guy we've got to go to John [noise]\n\n[laughter]\n[noise] when you do a little bit\nAbout\nWhere was renamed me\nJoe how are you know who may still have ... you know I mean the nice\nTo watch we watch we watch me watch we watch watch we watch we watch watch me watch me watch watch me go\nBack to me oh you mean that\nWould go ... miles a day watching me read it on and I don't know what you're saying I Am going to get a job um\n\nOh you're a\n... law and I watch my bread on and I don't know what you're saying I Am now like I don't God God\nYou\nKnow Mm Mm Mm Mm\nMm Mm\nAnd there's a yeah Nineteen na na na na na na na na and AA you\nKnow Mm\nMm no I fly right up a tree ... yeah when I\n... I really didn't know ...\n... ... by the state and then like a dumb\nMm Mm\nMm no I had that I write said that the\n... ...\n... ... na ve and then ...\nAnd\n... say they say we don't know ... well I'm going to go around and\nI can go on and I'm going on and\nYou know Mm Mm no dial them cry they can then a ... ... ...\n... while we had a chance to\nGo on and\nThey and they then do down in the in the plane\nAnd\nYou can join them and you know I mean I Am na na na na na\nNa\nNa na na ... and ... and I'm ...\nAnd then\nOn the ground and then ah ... might go ... and\n... ... no no\nNo no no and then then you know ...\n... and I'm Down man to free and I was ... yeah well I\nKnow she and I need the money you know I Know yeah and then he said can you imagine the\nAthlete he he\n... and ... they they they put a guy named marina del no ... well I'm Around ...\n...\n... ... ... ...\n... have a chance to see a\nNa na na na I did see that is ... ... ... ...\n\nWhy is the story on on the\n...\nAnd ... and ... and\nA very low yeah yeah oh\nYeah yeah\nThey well then\nThe fish and\nOh oh oh oh God\nOh\nMy God I Need to know and then\nI can let me\nSee come in they\nWere like oh\nOh\nOh I'm I don't know for\nA living in the early ... oh\nYeah well when I go from there are\nA\nLittle mini London and\nI was like my ...\nAnd uh\nThank God I Know I saw\nThe\nMovie\nAnd I like my God oh\n\nMan but I\nReally you know a\nA write in\nA way that they have\n\nA long beard I na na na na na na na na\nNa\nNa na na na na na na ...\nYou know I I had to learn you know and I mean here on that I\nKnow\nYeah it was just a na na na na na na\nNa na na na na na\n\nNa na na na na na na na na na na na\n\nNa\nAnd um\n[noise] you\nKnow\nYou can\nDo no harm no cry to me you know no one will know ground beef you no longer no no\nNo\nOne no one knew\nThat when they do your job is great you know in\nThe middle man you didn't know they were ... by big on three phone number then don't bring your real who do I know\nWhere you know people who do the back yard signs saying to my no ... no crime\nOn the news you\nKnow I'm not a thing to do something\nAbout you know the you know no no no no\nNo they they bring in a way they were doing the job training\nThem many times in the late ... no no no no no ...\nThey were all the time and she knew to recharge when do they remind me buying honoring sharia\nLaw I don't know why I'm doing\nMy job I mean everything's going to lay on the radio and by by young men young men\nThat are dying on me I don't have as many um I haven't found out they all died you\nKnow one minute drive\nFrom the ... the longtime no time again you know\nOr ... you know while my non uh do\nYou know a long time you know try and no no no no no no no no and I know\nWell my young guy you know I'm a longtime downtime mom and no matter who you are done on the phone while driving down time I\nThink he\nMay have been a while [noise] [noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\nNah nah nah nah nah\nNah\n[noise] [noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n\n\n\n[noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\nNo no no no no\nNo no no no\n\n\nNo no no no no no no\n[noise]\n[noise]\n[noise]\n\n[noise] [noise] [noise] ...\nYou are listening to cure you why I Hope he didn't want to offend me online that anyway I dont know why I was a project of the obese domination you are listening to you what\nI Would do that any one of them and say you why I ... a promotion be eighty nine ... projects about the condition streaming online at the White House dot net or Native American public radio station\nI Am an old lady I never thought this will happen to me no I Am always afraid he will come back in ... me again what what people think they knew\nI feel the shape\nElder victims they increase challenges in reporting sexual violence including shame and fear\nThat message was brought to you by the okay well women's coalition though because that's violent program in conjunction with a a white eye open radio\n\n\nHall ...\n[noise]\n\n[noise] [noise] [noise] ah [noise] hard to explain and hard\nAbout truth love and loss and you know and\nThe animals show and then I have gone down but much more about this but which is you know and and ... [noise] a\nLittle bit of it right for a while\n[noise] and so when the when I'm when\nI'm On\nMy own little world [noise]\n[noise] [noise]\n[noise]\nAnd I am in\nMy little girl and being able to [noise] um [noise] [noise]\n[noise] and what\nNot [noise] and strengthen your ten minutes I Know that\nWhen I was ... and ... and ... and\n... is that we have a path that I Am I'm by no but I have\nThree live where the ball and\nI was so what do you read the article in the twin\nWho\n[noise]\nA\nLong long long time that they need to\nBe [noise]\n[noise] oh yeah [noise] [noise] [noise] Mm and\nDa da da da da da da da da da da da\nDa da\nDa\nDa da da da\nDa da\nDa\nDa\nDa da da da da da di di di ... said hey you know the value they said\nNo no no I don't know man I might not ...\nIt's a non political dog\n[noise] and then they all play you know the mother\nSaid that you don't want to go with a crane everything what they'll pay more and they said life was all play those memos and even when the film with gray ... K town was going to\nBe a child now a camera in the world and you would get so never been about a month to live in the park and when the project lousy everybody can look good to talk about how we get we thank you well\nYou into the game in these times are controlled or talking about the ... tribe will get slapped me to college out there but I I just watched a bunch of Joe ... and like the great thing to do when they did when man can pay the delegates down the trail\nWe are going to kill young hated that could come all the candy bar as far as long as it's been a good again and they can't break from the casino parking job well then I had an archaic and how\nMuch money to pay the girl that you like oh you bet it had been coated in the pay phone call my mom pay where I'm not one\nCome out and they said when I was all played all the time of the\nDay that even when the governor gray every angle and they'll pay down was on a man in the days when life was all playing those them how to make one that was great everything with the pay was telling me and\nI work in the gym again in trouble for Robert de and now they will too but that's the way it would be the grave we can make in the high plane of living is not a camera in a while to come\nUp with ... ... if you'd like to join the Knicks fan the first thing that I knew like me\nBut some people try to fight the speed it up on civil bang bang bang do breaking the dress code Jake nope and then there were a warming you read the new big open that the one hand the\nGreen wall when around with my friends\nDon't only have one for the rest of my life [noise]\nAnd they gave me when I first of all playing those remnants Greenspan usually one that's great and reading lists okay time was\nIn the days when life us all played all day and he won the graying everything was okay come on and on and\nThen we hotter but not throws a poll or what they you know they'll tell them three years now with underground grab a well traveled a lot of good away brought to the government can do to mark\nHey my question for\nMe where young bill was drawn into your bank for\nA long way of life for a long ago was that day or wind or blind or like when you work in the\nLast time when\nI met him again when I was all played oldies my mother's name either one of the ... and became one okay Pamela\nI call it a lot of ways our life for a while you go around and go with drug that day to day life or the ... like when you work and\nWhen you're done you're going out like recording\nCareer I meant that every day when I was all played all the time of the day that you know one of the crane and became one hour pay ... every day life on the plane to own\nMother's Day even with gray everything was okay ... what oh no and\nI was in a theater and then they need to have so many I mean they are just\nTurned ... and ...\nAnd you'll stay\nThe same way and a\nFemale on gas is meant they do have you been doing\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise] [noise]\n\nOn your mind John\nJohn down here they really go around the ripple through the sea breeze um history the job they're going to change my name is John John McCain\nDistrict go down to the minus five days I can think of ways of enjoying the baby came by the dance power we stay but they're no longer working hard year so I can find me if they can do that but I tell you when to break a lot in Spanish\nI wanted to ask me because it's you know what I mean I work I wake up laying the ad for it to get to do what I heard the name of the day will be recalled the wind and all the plants around on\nMy butt off line on my way to try to be laying off why are we\nGoing to be able to look at my county the crystal which isn't much at the rate changed your life about a job or a girl\nAnd trying to go to our\nSun goes down a poster big rely on the big chain you know the average actually Oregon where the whole the whole my drink county gaps no way I won't be trying to maintain later well go back to the bathroom and you know bring them and they are a\nBit of Spanish grandma used to I went up and go and go on a plane with a plan for Tom Scheck everybody go groomer to folks who are in some\nWay to allow a laugh out loud I drank among share my crawl out here and it's like I'll be glad when about about bill collector can alter you are not because\nThey are by more data milk Bob dumping rain they ... around your ... your tree\nDown the bottom\nLine and let's go down to turn down in ... I'm going to bring a dirty job goes\nDown the chain\nRestaurants around the block\nI just take three in the day\n\nReally hot\nIn this day I agree it's\nReal hard\nIn this day and he\n\nTaught me that there's been a bad thing about\nWhy the hell I Will\nReach for the uh and then they were like oh my [laughter] your way around it\nDo you make up and talk about\nThe topic and so when\nWe do know that you want to read from your book where I'm from Berlin\nAnd\nBe ready no you go to three years the thing that's what my downfall me she\nCan do your homework and you can\nGet another ... ... a long way to make sure we're calling and sharing a\nRoom for [noise] you\nKnow ... you\nKnow they don't know where they drove ... miles from where\nThey are\nNow being\nTired and I\nDon't think we ought to be a long story short\nOn them and they're going to die from Dana\nIn ... there\nWas a stray\nOff and on and on the street and when you're going\nTo\nDo\nAnd he\nFound the game this girl ran in\nThe little bit yeah\nMe and the work and now we should not be getting the want\nTo hear fan Linda ... na\nNa na na na na na na na na\nNa na na na\nNa na\nDo the job and lamb faster than I Am so\nI don't know\nThe lady\nIn marine lo and how do\n\nWe are um na na na na na\nNa na na na\nNa na na na na na na na na I'm old I'm never\nGoing to go home [noise] and now\nOf all of them may watch in the sky rolled over who they know the job longer than a I'm a\nI Love Mah jong he joins all day long\nI Am not saying like mom\nAlong the same old shop spray and the role in the way she does not phone way way is a long long long\nLong and I'm Sorry I'm home when they say and I\nRan into what they do not know what\nThe rest of my goals may all alone and just don't leave me alone I Know a lot of the shower some mild by law may still not a whole bunch\nOf lord of the job on the line with just a rule or do they all said oh\nNo I don't know what I'm saying their way into a ... [noise]\n[noise]\nMhm [noise]\nMm and and and you know when\nI'm a\nI'm not going to give me a for a while there are more we now know God\nThank God I'm On my hands from\nWork and all my dream people right here I'll take a day to buy a ... I\nRemember very no no no no no no no no no no no no no no no I'm a history that are working on\nA\nTrue well I Know\nI Know a man of the um oh\nNo no no I'm In a while ago when it comes down to the brand name\n... na na na\nNa na na na na na na na na na na\nHey go the other ... wonder why we're whatever\nYou know I'm a I'm a I'm a I don't know the the oh my God do our\nTwo boys and I'm a ...\nI I Am and I'm I'm a I'm a I'm a I'm a ... now I'm In no\n\nHurry so you see this is rose the John from the given native dance theater I Am from the great or you know they show and I'm near ... director of the native dance theater were from way far\nAway from the un Alberta, Canada and you are listening to kill you why ... why one that's a streaming online at the Y. dot net your Native American public radio station a project of the whole ... thank you\nUh\nUh\nUh\n\nNah nah nah nah nah\nPublic radio station a project of the hope he owns ... thank you oh [noise]\nA\nA\nA\n\nNa na na na na na na\nNa na na na na na na na na\nNa\nNa na na na\nNa na na a a\nA a a\nA guy [noise] yeah I'm On a job [noise] na na na\nNa na na na na na na\nNa na\nNa na\nNa na na na na na\nNa na na na na na na na na na\nNa na na na\nNa na na na na na na na na out [noise] um\nAnd round and round and round and round\nA na na na na na na na\nNa na na na\nNa na [laughter]\n[noise]\n[noise]\n\n\n[noise] [noise] yeah [noise] yeah [noise] ah [noise]\n[noise] [laughter]\n\n\nMm Mm Mm Mm\n\n\nMm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm no she didn't know why he Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm\nOh here's you\nHere with me he walk you know the the you\nKnow he he he you know and then he he milk in the ocean now loan or the or the dog will he eat\nEat and and I wish you you lose me\nOn the you know why\n\nDidn't you know the odd thing about you for a day [noise]\nDon't you know I'm In Missouri and eat and you know on your show and [noise] um on our on T. V.\nAnd while we do you really want is may [noise] on the you know why he\nWas\nA man drove up on me and\nMy or do you worry and they get the you know not not\nAt\nAll when you do you like to live\nOn the news you know why he [noise] you know why\n[noise]\n\n[noise]\nWe're on the scene and why do we really rely on\nThem to you know why he was on the news you know\n[noise]\n[noise] [noise] [noise] [noise] [noise]\nFrom ever going to be All right [noise] I don't know [noise]\nI think [noise] I'm ever gonna be All right [noise] right it's\nMore I never I I'm I'm\nA job out of order your around grand mom dad I'm\n[noise] I think [noise] um\n[noise] I think [noise] oh my God All right [noise]\nMore my the rise of the time I got some of your friends the\nMen do [noise]\nSo uh\n[noise] I think we all die on me All right well read [noise] by saying\nThey are right [noise] I Know I think people are\nSaying they are right on the phone rang\nAnd I\nSaid oh well that's a\nGood man\n\nAnd and\nNa na na na na na na\nNa na na na na na na na na na\nNa na na na na na na na na I don't know\nWhy\nAnd how much you know no one\nKnows what part of one man\n[noise] [noise] [noise]\n[noise]\n\n\n\n[noise] [noise] oh my God [laughter]\nOh\nHow nice [noise]\n[noise] no\n[noise] no [noise] [laughter]\n[laughter]\nL\nL L L ... ... ... ... ... ... ... ... ... ... ... ... ... ...\n... ... ... ... well ...\n... ... ... well\n... ... ... ... well\n...\nWell ... ... ... ... ... ... ...\n... ... ... ... ... ... ... ... well well well surety\nOh no no ...\nNo ... no\n... no longer\nThe na na na na na na no yeah I\nKnow on a ... totally\nAnd they just don't know\nWho\nWon the ... on the ... and I\nKnow on the job is not only\nFor\nA\nLong ... on ... ... ... ... ... ah the ... man a man\nA\nMonitor nearly I'm a I'm On the ... and ... and then we will\nBe no I I'm\nA\nI'm a I'm a I'm I'm a a\nA um\n[noise]\nA\n\nLot of times on why you're a name out there and then\n...\n...\n... ... ...\n... [noise] [noise] [noise]\n[noise] [noise] anything anything da da da da da da da da da da da da\nDa da da da da da de de la ... allowed us all a little bit more remote I guess they\nStill don't believe that a lot but I can say ... because of those requests for your live\nAnd I think they are just do a lot of people don't go to the bottom of the dream about I'd say we believe so because the law that name on it I Can't say they bogus at all because\nThe ... year like that then they and those kinds of stuff down there to take them and they'll do anything\nRight above betting against it I mean all the time or another thing I Know yeah lady that I heard that they don't get it goes back a little bit on the ... thing that I mean do\nThey get paid\nA little bit above everybody that means to de de la ... a political those big level that the man I Can't\nSay because of that name on it I can say like ... they got a little read what other ways I think some of the day for about a young adult allowed\nUs all those good came out I guess they don't mean so the guy's name on it I can say about ...\nOr ... or ... [laughter] now they are known as a five year old I saved\nThem in day to day\nLife out into the open now I Know yeah like that but then they don't you go back a little older than them many of them I Want to get an angel\nDa da da da da da da da\nDa na na na na na na na na na ... for\nA new ... there was a little broken the\nLaw or or nine or ...\nOr ... leave the room or Jane to what my blood began to lower the number ... ... I'm going to write a line going great minds\nTo bring my ... degree do drugs or whatever and I'm going to have a um I'm going to bring him on the go to bring a real big I\nWere a little over ... over ... over a longer time and I'm a I'm\nGold star to run burning these will learn a dinosaur gold and all of them are not allowed to the river down through water\nAnd my daughter to bring my wrote to me just run in the early ... I'm going to have a um I'm going to bring my building during a real big coming of age\nOf ... na na na na na na na na na na ...\nStarted as far I'm burning these will learn a dinosaur gold and\n\nI'll take the river zone do water and run the ... going to do is you\nKnow and I am going to say I'm going to bring my daughter break my wrist the changes in the ... I'm going to drink I Am going to break my heart just go to bring my real estate ...\nAnd ... and you know in a long time and I lose [noise] when\nI heard him on the road and [noise]\nLike God's I in my life and um [noise]\nWell you know how they're going to\nBe under the marine and I told your ... [noise] I started to rain and mind going to bring my gosh\nI'm going to bring him on roads Dick Cheney general [noise] on the line Rick my shoes and join a wrinkle I received Cheney general [noise] right [noise] I don't want to bring my\n[laughter] [laughter] [laughter] and\n[noise]\n[laughter]\n[noise] [laughter] [noise]\n[laughter] [noise]\n[laughter]\n[noise]\n[noise] [laughter]\n[noise]\n[noise]\nOh how are you kidding me oh you\nKnow I mean you know\nA little bit of a real no no no no no one really\nKnew all along the game last\nNight\nOh\nGod I've been a lot [noise] [noise]\n\n[noise]\n\n[noise]\n[noise]\nLong long haul [noise] [noise] [noise] [noise]\n[noise] [laughter] [noise]\n\nOh I don't know I don't know\nI don't know where you're going\nOh my God oh my gosh you know\n[noise]\nI\nDon't know [noise] [noise] [laughter]\n[laughter] [noise]\nAhah how ah [noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\nUh-huh\nYeah you're right I Hope that's eighty put one of the fence and K. U. I. L. P. upper ... eighty nine point when I mean on line I can see why I dot net\nLong ...\nAbout oh oh oh well you\nKnow see when I talk to our own and they do one number one ...\n... now maybe your mama de dum\nDe de ... they were lying to you know we live and you have your mom they don't get the Afghan out they they just don't do anything\n[noise] [noise] really\nWhen you when they got that celebrate but on the we're leaving may not have the stadium cedar Caitlin another did know pronounce made a wrong\nWrong and I'm David your mom does that do and I don't care if it were that you know if you have your mom and big long haired guy now they just\nDon't do anything\nAnd Mariner Mariner\nMariner Mariner Mariner and I\nDon't know how\nWell they said ten million ... behind the men but on the line and crime they know when I ran out they just don't do any oh my God maybe your mom I'm not sure that do domestic\nMice don't care if you were alive she no no no I hear your mom below here the FBI now maybe just on\nJune and July you know we live in um I'm doing here here trying out there just aren't you in a\nGame and you know\nIn the in the mid ... ...\nMy mind and no one has been no who think they just don't know when when the dog but didn't they just know that there's like no no no\nNo way around the world and and then in the weekly does it mean to me\nThan he did when the men don't pay ... ... ...\n... when I had no he said than done my job is never going to run again you know I Know that there have\nBeen you know number and then the ... has and\nIn the hands me\nBut he did win the\nMen don't pay he is not a you know the Chinese and beyond my young never mind trying to run again you know\nHe just became you know numerous then the big among the hand and the news and the and then my mother in law here in\nWhen I'm Alone and everybody knows I'm your man [noise]\n\n[noise]\n[noise] [noise]\n\n... oh well\nI'm sure that the debt ... grown worthy but also one of the simplest ways to share a moment when you're when you know all the same way that is called\nSpy done should take a moment and make your kid lunch because dad jokes rule make your kid lasted that bothered with that young Roger by the U.S department of health and Human Services and the\nSharing their data and this is you don't need to shut down the on the door you are listening to tell you why eighty eight point one ... fans hope the radio and K. you why else be upper ... eighty nine point one FM streaming online at K. U. R. dot net your Native American public radio station projects a puppy foundation\n[noise] na na\nNa na na na na na na na na na na na na na na na\nNa back again and again\nI\nDon't know why don't they may know it out I although law school and it is a little old lady she knew\nA Mac and Bowling Alone and in ... new a Mac ... bowl days you know\nAbout that my body I'm Bad at all and I feel like I'm\nIn a while and I made a bad and Mad Men Campbell I'm gone I'm On the\n... a bag and they have all of a like a\nA\nAnother number the number\n[noise] [noise]\n[noise] [noise]\nWell a lot of time you know a while but yeah I thought oh right\n[noise] [noise]\n[noise] I\nKnow a lot of money oh well that yeah well I'm\nA mom nice oh damn bowl of oh my God I'm like oh my God All right good gamble but no I'm\nIn law yeah we may\nLose your job I owe it all boils down to lower you may know the old dumb law\nMay be a no no no I don't know\nA yo and\n\nEven then and then then the\n\n[laughter]\n[laughter]\n[noise]\n\n\n[laughter]\n[laughter]\nOh my\nGod\n[laughter]\n[noise]\n\n\n\n\n[laughter] Hi\n[laughter] Hi\n[laughter]\nHi\n\n[laughter] [noise]\n\n\n\n[laughter]\n[laughter] [laughter]\nOh [laughter]\n\n[noise] [laughter]\n[noise]\n\n\n\n[laughter]\n[laughter]\nMy thought is that they can go out and they get a job when he ran in the end of the most I done been\nAnd look at why that is good you know they've done and I am in\nMy in my bed and I got a good way to screen and then they come from\nA\nFrom their own thing\nAnd then and da da da da da da\n\n\nDa\n\n\n\nDa da da na na na ve and and now the\nThing and\nAnd and the day after day and they can\nRise above it paid under the rain\nAnd and\nWhen they say you know they\nDon't get me to rain\nDown on\nThat and get all ... up to you know he came up\nAnd down the street from me up and down up and down and\nAnd yeah and I'm trying to\n\n[noise]\n\n\n\nYou know as long as you're making me do they\nDo do a little more than ... Bob Dylan and\nNo later than\nWe need to be the leader of\nThe new guy and\nOh no no\nNo no no no no no to no game you know can they can and\nCannot do no no\nNo\nNo\nNo I\nDon't know na\nNa na na na na na ...\nVery little water no more ... good how\nAre\nYou are around and around you\nKnow and uh\nMm Mm Mm Mm\n[noise] to me well you know a ... or\n...\nTo ...\nWho's doing well things more\n\nThan ... well uh you\nKnow\nA\nA whole new long\nAround things ...\n\nNo\nNo\nNo no\nI'm\nA\n\n\nMan\nThing or um [noise]\n\nNo\nNew\n... new and\n\nYoung readers may need voices and then now clear he's only been bad for me to share my\nElementary readers may need to read to Iraq ... they had been married and then you cannot remember where he left his team for parents and\nOlder children may benefit him discussing what they're reading and answering your questions about their book what do you think the main character was thinking when they are what do you think with the central\nNo matter their age help your children develop into lifelong readers this is Joe ... president of the Arizona Education Association well\nReading to your children early and often rates habits last from like encourage reading in your home by visiting the library frequently and letting your kids pick up books on subjects that interesting our feed their natural curiosity what books reading as a habit I could spark a lifetime of learning\nA message from the Arizona Education Association\nYou are listening to kill you why I Hope below eighty eight point one of them streaming online K. you why I dot net and the way I L P uh promote ... eighty nine point one fan projects the Hopi foundation\nYoung readers meet new voices and then now clears your voice sounds bad me to share my\nElementary readers may need to read to you Ron ... marriage in ... and you cannot remember where he left the parents and\nOlder children may benefit from discussing what they're reading an answering your questions about their book what do you think the main character which they were there what do you think was the central\nNo matter their age help your children develop into lifelong breeders this is Joe ...\nPresident of the Arizona Education Association all\nReading your children early an awesome rates habits again last from like encourage reading in your home visiting the library frequently and letting your kids pick up books on the subject of an interesting read their natural curiosity what's books reading as a habit I can talk a lifetime of learning\n\nNa na na na na na na\nNa na na na na na\nNa na\nNa na na na\nNa na na na na na na\nNa na na na na\nNa\nNa na na\nNa na na na na na\nNa na na na na na na na\nOh my God [laughter]\nI I don't know I I don't know\nI I don't know I don't know\n[noise]\n\n\n\n\n\n\n\nUm\n[noise]\nI don't know that guy got on my locker [laughter] [noise] I'm not talking about buying a name I think\nA lot of drama [laughter] oh God I rely\nOn and on top of my tongue on them I\nDon't know [noise] [laughter] [noise]\nSo how long they're\nGoing on [noise] [noise] I don't know man I\nGot a lot on line [noise]\n\n[noise] [noise] [laughter] [noise] I really\nDon't know [noise] I don't know [noise]\nMy name on there [noise]\nFound another compound down down down down down down here why\nDon't you I Hope that eighty ... than ... out the upper my coffee eighty nine point when I mean I might I can see why I dot net\nWhoa whoa okay I'm I'm not a mate always said no no uh oh yeah a ... ... ... I'm I'm not I'm a former said no no a oh a\nShake or thought\nGod whoa I'm like oh wait a long way God all a\nOkay they know they thought it was like a dog show a nay okay they know they know they gave me a dog show a name\nOh yeah oh Mm Mm Mm oh yeah oh ... ... ... oh hey yeah\nMore\nIt goes all uh I mean they know they have a ... show a name okay they know they know the ... the show a\nName oh yeah oh ... ... ...\n... ... ... ... ... ... ...\n... ...\n... I'm a ... ... no no oh a\n... ...\n... I'm I'm not on the poetry you know a ... a\nShake up the ...\nOr ... or ... or ... or ...\nOkay ... de da da da da da da da da da da da da da da da da\nDa da\nDa da\nDa\nNa na na\nNa ... like a ...\nA great ... great do you own a car on a nice man oh whoa whoa\nWhoa whoa road road uh go work on it a go of a bad check a oh a mother's\nDay may be looked at what am\nI here in New York or you go ... or ... or ...\nOr yeah yeah hey hey hey hey go man you\nYou know\nA great ... great great oh you're a gardener oh no no no well in\nA row up rather than rather a ... it up a goal was a great but they checked a oh a mother's\nDay they they pay\nWhat am I here in New York are you ... does love ah\nYeah yeah yeah yeah yeah yeah hey hey hey yeah\nNa na na\nNa na na na na na hey I Am or in a way I live in a way\nBy Jan Jan Charles jerk geez I ... I was okay sure oh man my mind saying hey yeah\nI Know na na na\nHey\nHey hey hey yeah uh-huh yeah I Know da de\nDa\nDe de\nDe de de de de\nDe may or\nMay come away on that show a\nDay yeah he had a big day day ah the\nDay\nWell hey hey oh\n\nNo well yeah they they and my feeling net ... billion\nWell the way a fashion a\nDay I had a day a\n\nDay well how\n\nLong have I Am I feel I Know I sound like a hundred ... no oh no one wants them up on the\nNet may pay tiny Seventeen tiny my name is Ben in my opinion so now I Am somewhat but me I Am the tiny Seventeen tiny and I I find that\nA try and make sure\nThat they live in the unlikely ally now making ... ... ... Hi my name's biggest online now my\nMid twenties Seventeen twenty Eighteen when he first and then I Am like yeah like yeah well I Hope you name it and see I Am at the core inclined and I am from when I see I Am twenty Seventeen twenty eight team is hoping to that\nAnd I find my trial intervention now you know I ... I Hope you might not ...\nOn my neck all gamble a net knock on the net he doesn't want to put that in New Mexico I can I can I can go yeah I Am ... and the village I smoke on me and I and the two thousand two thousand Eighteen and my\nLast five minutes from now mind them you know I I myself am\nI say I am I I'm Glad I'm not like ...\n... yeah now the hinting you tell a strong happy like how they get Damien positive thoughts and happy high take good care of yourself and your family\nYeah I like the KU I a lot about eighty eight white wine and and and K. E. L. I. L. P. up\nEvery month that'd be a nine point why and how they're hoping that nation\nDreaming on line I came I dot net Native American public radio station that's golly\n\n\n\n\n\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n\n[noise]\n\n[noise] [noise]\n[noise]\nMm Mm\nMm\nMm Mm Mm oh\n\nMy God we made a a a a a\n\n\nDa da\n\nDa da da da da da\nDa\n\n\n\nDa\n\nThey go through a very close to\nThe\n\nProposal modern day\nOver there we prefer to go where you are a\nLot\nOf them many times per day or you know\n\nWe may\nHave\nA minute or so yeah we do a very close\nTo\nPromote a good player but\nOne of\nThe\nDumb things more permanent do they do the\nBoth\nOf\nThem will\n\nNo no no no no no no no no no no no I I'm I'm not\n[laughter] [noise]\n\n\n\n[laughter]\n[noise]\n[laughter] [noise] [noise]\n\n\n[noise] [laughter] [noise]\n\n[noise] [laughter] [noise]\n\n\n\n[laughter] [noise]\n\n[laughter] [noise]\n\n\n[laughter] [noise]\n\n[laughter] [noise]\n\n\n\n[laughter] [noise]\n\n[noise] [noise] [laughter] [noise]\nWhat is your way oh\nWhy oh why oh why oh\nWhy oh sure oh yeah yeah yeah well you're a young how old are you know he you know\nOh well they have\nA\nNew way of ...\nWhat I don't know like you know God what a way I always felt that I I'm a I'm\nA you know I'm like yeah you have\nA a a\nWay you know\nWhen you're\nYoung you know\nWhat I don't know I don't want to make in a way a highway bill you know hey I'm Down\nHere oh God they guy mayors\nA\nDynamo like why am I\nWhat I don't know that they get in a way we are highway Andre I'm\nA you know oh you don't have\nA a\nGuy who was your years here yeah hey hey yo\nYo yo yo yo yo\nYawn oh why oh why oh\nWhy you know I'm a young boy y'all I'll whales oh hey I'm\nJohn John oh they have\nA gun\nOn a ledge right here right yeah yeah I I\nWas a gay guy in a while yeah uh we are or how well you know the\nDog oh they have\nA star Roger\nYears yeah yeah you know\nHey I have a A R Josh Amish oh they have a car I dont play I Am A L\nY\nGuy a guy in a while ya what how else that I Am a John oh come on they had\nA ... or ... years well yeah yeah you know\nShow\nA yo yo ma hey\nI got a gun in a way I well you know how I feel that hey I have yeah\nWell I got a ... a man a ha ha ha ha ... man I Know\nOne\nGuy John calling again I'll tell ya I don't know how I Am a ...\nA ... a a a home here [noise]\n\n\nBut but but it will come to look something\nThat's what's when Bush says Illinois\nAmong all with ... ... ... ... ... ... de\nLa ... [noise]\nThat's the bus him a bum bum bum you are [noise]\nRight emitted oil [noise]\nDo you fly through [noise] the da da dum la da dum la da dum da da da da da da da\nDa da da da\nDum\nLa John ... own their\nOwn but it's a real good cook but [noise] they're both in the early ... home look John ... [noise]\n[noise]\n[noise]\n\n[noise] [noise]\n[noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n\n[noise]\n[noise]\n\nWhoa whoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa\nWhoa\nWhoa\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa\nWhoa whoa whoa whoa\nWhoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa\nWhoa [noise]\nMm Mm Mm Mm Mm you\nKeep on going on in New York um I\nDon't know about ... how are you well know\nOkay I'm a lawyer you people now are you um I Know oh no no you don't uh you know I'll tell you you know they make all the\nWay it's been a ... a ... no ... no ... no you guys to know you're not there no way around China ah you're a ... or your ... you know your ... year old\nMan who man who way way\nThat you go when you're on my way there you go when they when they come through in New York when it came from when you hit by yo yo yo\nYo yo yo yo yo away ... people I have both ... and ... and take them on their own\nEconomy will make our own\nWay and then now I'm\nIn a ... a long ago when they know you're wrong you know all the way in a a no no we don't know how long ago\nPeople mad who man who do you do when you're not going to go in there you go when they're young white man who ran\nRan into what where do you mean by yo yo yo yo yo yo yo who your way more than ... people who are over ... over a dollar ...\nNumber one right way\nThen nah I'm a man I Will go away and uh uh then how do we understand all you know all the way they are you a in a while we understood how how long do you know\nThe man who may have to weigh only way that you don't go away or not your Michael Bloomberg who legal\nAnd illegal movement you know going back yo yo yo yo yo yo yo way may go on both can't go and get on cable on both big\nOn medical McDonald's where where are\nYou a dime away in a in a in a ... we don't know how are you know when there are a lot you know we didn't know how they know\nCame from a man who may go where the man or you don't go away that you'll remember what why\nAre you where you live and you come home and do you have taken away by yo yo yo yo yo yo yo your way home take off my go into a movie it was both on\nApril ... ... ... ... ... ... and then now I'm In a row and then ah you know you were you turn on your ...\nOn the way I don't know they know who you can now go or how do you know\nIn some of them at home and and you went on to your ... your own way and take them when you went and ... ... do you\nWhen you come who ran in ... ... ... ... ... ... ... the U.\nS. she told me that she says she next cut back on say hello my name is ... Duncan my ... name or yellow Bert dancing on from Mesa, Arizona my hope then sure who tend to since I was five years old flute player quarter different albums with Kenyan record and you're listening to\nYou why I have an eight point one FM streaming online at ... dot net your Native American public radio station project up to the foundation [noise]\n\nTony ... says she next cut back on say hello my name is ... Duncan my ... name a yellow dirt dancing and from Mesa, Arizona but hope then sure who sent in since I was five years old so it's a loop there quite a different albums with Kenyan record and you're listening to\nYou why I have an eight point one FM skimming on line that can you why I dot net your Native American public radio station project up the Hopi foundation [noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n\n[noise]\nHo ho ho man they call\n'em up and uh I Know where all the time and uh\nOh whoa whoa whoa whoa whoa you know\nI'm a I'm a I'm a homemaker now and go off in Oregon ha ha ha ha ha\nHa ho ho ho ho ho ho\nHo hum a job or a golf ball who man oh man I Am not a\nYo yo yo you know I'm a\nI'm a I'm a ... percent off of my way off a\nYo yo yo you know\nI'm a I'm a I'm I'm more aware of all the time and I am a\nWhole New Jersey oh whoa whoa whoa\nI'm a I'm a ... all over and over ... away on a white man\nYo yo yo yo\nYo yo what are they on their own oil yo yo yo yo yo yo\nYo yo you know\nI'm Out in a row where all the time I saw\nOh whoa whoa whoa whoa\nI'm a A N O L o seven or eight dollars on a long time now [laughter]\n\n[noise]\n[laughter]\n\n[noise]\n\n[noise] [noise]\n\n\n[noise] [noise]\n[laughter]\n\n[noise]\n[laughter]\n\nOh\nNo no [laughter] [laughter] [laughter] [laughter]\n\n\n[laughter]\n\nOh\nNo [laughter] [laughter] [laughter] [laughter]\n[noise] [noise] oh\n\nReally\n\n[laughter]\nOkay like I said be the ... the line then KU like eight of the ... you know I mean a lot from ... coffee Hyundai not open you straight must KU like I go back to the U.N Nikki by a public radio station ... [noise]\nA a hot a hot rock\nHey hey hey I have\nA house or a hot or how\nThey they have to be a day I guess [noise]\nAh ... you know we have a yogurt the a\n... a\nNew way to yo da da da da da da da\nDa da da da de ... pay ... ... they call a lot don't or they [noise] hey are you all have our\nAll the all you all have you already gao or you\nKnow we all over the next\n... ah\nOver the you know hey yeah you'd have to get why\nOh why oh three\nDay on Jay they mail you off the wall and da da da da de ... your\nPay all wrong we probably all hey ho\nHo ho ho ho ho yo yo yo hey whoa whoa whoa whoa whoa whoa whoa whoa wait\nThere's over ...\n... ... ... are already very strong McDonald yo yo probably an hour all of our law where you\nAre you know your ... O O\n... o ... O O o ...\n[noise] hey hey hey hey ho ho ho hey hey\nHey hey [noise]\nGolf a baby I based on my dollar yo yo yo wait a while\nOr are you all have our our ... our our fair day hey\nSean macdonald yo yo yo wait a while uh where are you all have you off the off the wall hey yo\nYo yo yo oh\nBoy oh boy oh look yo yo\nYo yo yo yo hey whoa\nWhoa whoa whoa whoa whoa whoa whoa\nStray oh ... oh no and all the\nTalk show or a very tall tall yo yo know where you are a yo yo yo wait oh whoa whoa whoa whoa whoa whoa wait oh\nOh my God on\n... ... a very ... much oh your or ... oh oh\nPhone yeah well the you know so I got my\nName was saying you know the the no ...\nNo\nNo no\nNo no I knew my knee\nOh\nBoy well we're on the knees\nYou know\nWhat I mean I I Know how he\n\nNa na na na na na na I mean I I mean he he\n\n\n\n[noise] [noise]\n\n[noise] [noise]\n\n\n[noise] [noise]\n\n[noise] oh\n\nNo\nNo no no\n[noise]\n\n\nAnd among those and I must\nEat them let people money away a lot of money that way\nI thought that my love\nFor memorial because I've got one more ...\nMore than ... yes I\nFeel like you know or or young one was from a ... you're\nGoing home to my\nMind about some of those ... billion\nIf we were\nOn I think\nTom am I doing it had to kind of\nHoping that the Bible but sometimes they're like no money I think the money money money can\nBuy none of that\n\n[noise]\n\nWhen we deal with\nIt and I I think\nThat might feel like it had to\nKind of hoping that the fight but sometimes there are a lot of money on the line you can\nBuy no\n\n[noise]\n[noise]\n\n[noise]\nYour ... on the on the radio my I have [noise]\n... Hi this is the word you're listening to my good friend rent Molly coming to live out in the morning show ... one hook\nGuard mining mining\n\nThe O L\n\nO\n\nO lo o lo o lo o lo o lo o ...\n\nO O\n\nSo oh they tell you the ...\n... oh\nOh oh maybe ... ...\nOh oh oh da\n\n\nDa\nDa da da\nDa da\nDa da da\n\n\nDa da\n\nDa\nDa da\n\nDa da da da da da na ... good to do is good what kind of my good morning eight six six years ... radio station\nOn do you hope you're is a big share the euro tune into the thought that program you I'm sure you why I eat when they're ... and also ... L. P. R. promote ... be\nWhat a great MORNING EDITION on hope here and you can read\nYou this one is want to know who you're into Mali are better known as we're going to be ... Native American Indian jam so good morning and I'm\nTrying to help you start to Marty always some good good music\nLike just say good morning to all you people that are truly don't lie and wherever you are hoping you know we cannot agree good morning a and I know somebody is listening to me in Tennessee\nGood morning or in the back welcome back home like you say many ... that that we know so I'll Try to bring you some good good gyms here\nAnd everybody else listening on January I send my good morning good morning\nOr try to start could be a problem with some girls who\nAre very kind of Indian native jams who carry so good morning to all of you it's six zero Seventy or were you time workers in time to get out of bed and getting ready for friday William for friday all we get a cherry picking\nThe high school ball players everybody else does go to school a where do you think tank pink gene\nOr to help support the cancer people that are working against cancer so good morning to all of us help you owe me when they came here preserved is that where everybody's so hey as all get out of bed and green friday morning\nYour son set up ... billion a little\nBit of processes morning on the windows are saying you must have been going last night I Know is go after ... my window last night\nHe knew what did you play with the non violent political by on such a bad\nThing is going to come up with it or not do an order to say I can say yes but not to blame all this winter not allowing it BlabDroid frightened to not be a machinist among those the which I have been as soon as the ... yes when a new you know ...\nOh man who ...\n\nOr ... or\n... or ... or ... or the whole\n...\nMoney is gone now a non man gun\nMan you know\n... and on and ... and I\nDon't know who they're\n\nNot getting\nAny more than I Am because I don't\n...\nMother you know and so it's very good yeah on on hand gun and I told the man a\nMan who ...\nWho are here and\nHere you go on a ... ... ...\n...\n... ... ... you know and then a\n...\n... ...\n... ... ... ...\nYou know more than\n... ... ... ... ... ...\n... all the nine ... on\nOn on you know\nHam ham a\nNote on into ...\nNa\nNa\nNa na na na na na na na na na na da da da\n... billion on\nHan ... na na na\nHey who can hear\n\nThe the ... and\n... on I saw on the cutting all\nThe ... ...\n... ... or ... or ...\n\n...\n...\n\n... ... ...\nYeah he ... on ...\n\nMother you know I said God now on and on\nOn the\n... than we do have a ... I'm\nGetting a tomboy\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\nUh I'm a\n...\nA\n... on the\nPhone he murdered and I'm a mom\nWho's a a a a on a a gym\nHere my whole thing is\nJust a small hole\nOr money or or\nOh I'm\nA a a a ... a time zone or a virus\nOr a a ... ...\nS a\nThe\nA ... not a\n...\nA\n... [noise]\n\nOh hey I'm In a a\n... a a a a a\nIt's a sin Lucille by his own man\nOr a phone or\nA or a\nWhole a fine or\nWhat it is a game show right now they have\nA mob boss\nWhat it is a day if I show today right straight out very well\nOn a dog ...\nTo ... uh but you know quite a bit of a one party all but a man with a guy\nFor a good idea you know they do or the game ... gray area called\nOn a road trip and saw it for you know clothes or\nCollege to that part of the way are quite a bit of a you know what a what a de da da da da da da da da da da da da da\n\nDa da da da da da da da da da da\nDe da de ... de do about it I mean\nAnd and ah but you know not all day all day all over ... say they are today they are very uh uh but\nUh I guess when a guy a guy on\nA\nBoat with a kid in a global scale\nDa da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da\nDa\nDa da da da da da da da da da da da da\nDa da\nDa da da da da da da da da da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da\nDa da\nDa da da da da da\nDa da da da da da da da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da\nDa da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da\nDa da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da\nDa da da da da da da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da\nDa de ... de de de la ...\nAre like yo yo ma ma I go to a lot of uh\n[noise] [noise] [noise]\n[noise]\n[noise]\n\n[noise] is that we know we're good\nCould what they'll do when I'm a\nYoung doctor about to say on ... ... ... do you\nHelp us by after I we go to the ... to lower the flavor of years when they play a beep on the U.S exporters whose job it the way of doing what you buy a friday the by\nNow seems to ... to ... all over the years with the ...\n... ... ... ...\n... ... ...\n... ... during the time where the doctor and get it goes on to the ... with all the mail the diet the or\nThe the one thing we do\nAnd the humidity here I'm a ... million number one the time when the pope will be the motor cars and on so then the the ... party unity on the ... the movie Joe Millionaire it was a tomboy you're doing what you were with up or do they\nGet the the ... we were just talking at all of it coming because I was ... or ... or the we couldn't duck ... he was the only people that are similar like you're a tribute to the program he'll tell you why\nAnd we thank you very very much for joining us you\nKnow we're getting your home and sleep listening to all these because\nRemember back when you're back home but wherever you are man I Hope you have in the morning like we are here coffee coffee coffee smells man in the bushes or looted up man I think your bus drivers ...\nGreat guys are doing a great job getting our little wants to screw in back home so be careful out there for\nYour your drivers are Bush it's already back and forth to the children so\nAre are ... young kids so you gotta be careful about their\n... go to the speed limit to how much do you want to do the cooks in the schools could grave for you to reject cooking ... springs some form or were you know\n[noise] [noise] uh uh uh\nUh [noise] [noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise] ah\nWhere do you plan B\nUh uh uh uh uh uh\n\nIs over your plan B will you know as you do now is on and on the ... a lot of low in the way you seven o clock I picked up by\nAn aquarium or by Muslim but just when\nWe get morning you're listening to you what a unique when when it then it also can you why I asked the upper among ... and I wonder if bin project itself do you feed them ... and\nWe've been on my key why I ... a net your Native American public radio station in\nThe fall of we use promoted to a partnership between you why I Hope you really key and you\nAre is a little bit of a radio station and I'll be switching you over to NPR's to\nGet the NPR died in the community kill under the weather report today and we'll see you play goes on in your uh your jury duty to start the program we want to know whether you're in a multi year better than it is it good morning he'll be circular friday off right here in the morning I'm\n\nWell go to one of those are just a few seconds but first NPR's Scott Detrow who's in our studios in who covers Congress is here and Scott what'd you just remind us what the vote tally is so far as anybody knows\nThere are four key votes here who have not said whether whether they're going to vote yes or no that's Republican Susan Collins Jeff Flake and Lisa Murkowski and Democrat Joe Manchin we know that Joe mansion either going to announce his vote until he's on the Senate floor we're hearing indications that is the case for Susan Collins as well and one key thing to keep in mind is that this is not the final vote\nThe Republican especially may evoke yesterday but not necessarily ... not necessarily yes over the weekend and final say okay\nFine I'll end debate and I'm not going to vote for this guy and\nIt sounds like it there's four key votes this has got to be close very last forty eight forty nine fifty sixty one maybe fifty two with the absolute most ah let's go back to Dianne Feinstein she is the California Democrat who was the senior members senior democratic member on the Senate Judiciary committee and she used to live in her closing argument last listener\n\n\nOkay we're going to try to get back to the Senate floor in a moment Dianne Feinstein is delivering her speech there oh she's just concluded her remarks as a matter of fact so we're now going to hear or\nIn their entirety over the next few minutes from two more key players here one is Charles Schumer of New York here's the Senate's democratic leader and he is a senator who vowed very early on the Democrats would oppose this nomination but everything that they had\nThe other senator we'll hear from is the key player in so many historic debates over the last decade and a half really Mitch McConnell the majority leader\nThe Republican leader in the United States Senate and someone who was an absolutely central to the Supreme Court battles of the last few years it was Mitch McConnell who said the President Obama's last nominated the court would not even get a vote it was Mitch McConnell who then\nSteered President Trump's first nominee Neil Gorsuch to confirmation it is Mitch McConnell who has repeatedly said during all\nThe drama of the last few weeks that he intended to guide Brett Kavanaugh through and so we'll hear from Charles Schumer and Mitch McConnell and the next few minutes later Totenberg because we're the CNN on what's on your mind\nWell Mitch McConnell is that what you would call a riveting speaker and neither is Chuck Schumer who will also be speaking they are sort of doing that final cleanup hit for their sides but don't\nBe fooled by their boring presentation Mitch McConnell is a brilliant strategist he has done amazing things for\nA marriage that he wanted to advance whether it's his agenda on the court or getting through a budget when lots of his more conservative members wanted to just block everything and this is true he negotiate with a vice president Biden during that the Obama administration and they got budgets they got\nYou know funding for the federal government true when it really for\nThe Republicans politic larger political interests very well although there were a minority of Republicans who didn't want to do that and Chuck Schumer [noise] you know he's not the majority leader so we can't see if he's a brilliant strategist yet but but but he is he's the appointment\nHe's been marshalling the Democratic troops to the extent that they can get a sense of the scene as we await their speeches because Brakkton Booker NPR's Brakkton Booker has been outside the United states Capitol today it's an area where there have been many protests over the last several days and Brakkton wants to seem like this morning\nSteve there are some crowds out here not as big as we've seen in previous save the day is still young [noise] ah there is a group of speakers that are standing off to the side of me and maybe a a fifty yards away or\nThey have had a number of people come up and share their stories a lot of people who\nHave survived a sexual assaults relational trauma image sharing the story is basically saying we cannot put a a Supreme Court you cannot elevate so much of a Supreme Court who has been accused of such crime actually happened founded what what they're saying shifts if\nOne of the central tensions one of the things is really divided the country and the last several days [noise] as well we'll talk about that a little bit of a moment apparently Charles Schumer has now gone to the Senate floor let's listen to the Senate minority leader\nSworn in chapter in a long history of the federal judiciary the well\nWas poisoning from the outset when President Trump selected judge Kavanaugh from a list of names free approved by hard right special interest groups\nFor whom the national interest is to try and concern compared to repealing romey weighed cutting people's health care and achieving a party than majority\nOn the Supreme Court Iraq worse and when the Republican majority on the Judiciary Committee shells in the fall or judge Kavanaugh's records from the public just guarding decades of bipartisan precedents\nAnd warning norms of transparency and fairness and finally the dam broke\nUnder the weight of credible allegations that judge Kavanaugh committed a sexual assault in high school in ... Eighteen\nTo Republican majority conduct at a hearing that made you Anita Hill hearings in Nineteen Ninety One looks fair by comparison\nIn this hearing there were no corroborating witnesses on either side no independent investigation of the fact to inform the questioning\nUnder the weight of credible allegations that judge Kavanaugh committed a sexual assault in high school\nIn twenty Eighteen to Republican majority conduct at a hearing that made the Anita Hill hearings and Nineteen Ninety One\nLook fair by comparison and disappearing there were no corroborating witnesses on either side no independent investigation of the fact to inform the questioning say even hired an outside counsel\nTo put a witness Dr Ford on trial [noise] only at the eleventh hour urging a breakaway members of their caucus Republicans submitted reluctantly to a one week investigation of the allegations\nAn investigation which was then severely ... scribe\nBy the White House our Republican friends blame us for this process there always finding a strongman but nothing could be further from the truth first they blame us for delay knowing full well\nThat majority leader McConnell has complete control of when nominees are brought to the floor leader McConnell credit move this nominee two weeks ago\nOr one week ago\nDemocrats had nothing no say and don't when it comes to who comes to the floor but in each case leader McConnell couldn't move the nominee forward because he was blocked by fellow Republicans not Democrats from moving forward\nWhen it comes to complaining about delaying\nTwo words never come\nAnd the whole ... book Moby oh good morning dying or a hundred members Dinah Shore on a TV show on channel two and a long time ago in a way that people would die in the street and there is down\nHowever she's still open for labor services\nAnd she is located at the ... ten o'clock in the mornings before pm Monday through Thursday so today I don't know she's going to be there but give her a call at night too late to zero five East Jerusalem green\nCoffee beans health services regular ... to ... to ... all day I guess still be there so you can call them et\nCetera et cetera is extreme zero zero encourage kids all kids corner or will be closed today a cobra fit all day in full at seven three for three four three two\nAnd the hope be tribal courts will be closed today from eight to five P. N. so if you had\n... scheduled for today you luck Dowd okay and it was close to any hope of tribal courts aid to buy and normal business or will resume on October eighth\nWhich is I Believe Monday or information you can call ... to ... to zero by one to one by\nAll the reservation town hall meeting presented by the office of Arizona's ... they use today of over ... starting at ten thirty this morning ten thirty and mountain standard time at\nThe hope you Vince memorial center and information is available at seven three four to five generals seven or seven thirty four to ... a\n...\nTo ... thousand Eighteen scholarships are available for home because they did is he ... and the devil and Joe ... days who they didn't get any today right away that four five o'clock\nInformation is available at one eight zero zero seven six to nine six zero breast cancer awareness conference today up to brew beer at Dell shipped a hose\nStarting in nine AM daylight savings time that would be\nEight am moments in time for information\nBillable for all the college students at he ...\nAnd ... days to get any today right away by a four five o'clock\nInformation is available at one eight zero zero seven six to nine and six and these are all breast cancer awareness conference today up to ... fifth at Dell shipped a hose starting in nine AM\nDaylight savings time that will be eight am most dinnertime boring information you can call up to eight night or six or six\nIt's whoever you up to ... knocked over six this tomorrow ten days Congo\nAt the cook the Veterans Memorial center and information is available at seven three for three four three two so unique runners man started getting and rainy and nothing but it's ... it's like a view ... before you are\n[laughter] the Nixon did in high school class of Ninety sixty six reunion up to ... at ... park in Phoenix, Arizona information available at six when three one two one five zero ... for use sixty six regulates that's tomorrow\nAnd the steel prices low key it where to Phoenix India and high school we used to be no mc Donald's and you know there are winners or no car\nNations that are more a member of they have this to be there to anyway to use my argument will be held at ... October sixth and seventh just going to be tomorrow\nAnd the next day\nInformation available at five five to one went to\n... see store appreciation day on October seven as being a cat and salt so don't plan on going on up to him or seven\nAnd information is available at six zero two six seven nine five six one seven so you better call Mr ... is going on and find out what's going on and what are they gonna reschedule again\nAnd do a little ... and neuter at you hope to vet services the kings can Arizona October eighth and is it ten\nAnd number to call for information is Seventy eight five to five one\n\nOkay and then we go on T. hope the high school is volleyball October fest this today and there'll be happened in New York City invite ad through subsidy or high school\nTeam being GE located oh we don't know what time is going to be okay hope the high school football October fifth that's tonight\nAt seven ... and and that will be against belt centers air hope the end he's paying night so where are you paint and I guess they got to go home and watch my bike sharing it with a red shirt or something to make you paint because\nI don't have any the pink but ice rink and I'm going to any ... I'm I'm Andrea\nWere from a sheriff's department on there in a way that's today they'll just send the pig night seven PM and hope the high school cross country October sixth that's tomorrow David ... or\n... ... in Phoenix Longview park starting at eight thirty in the morning tomorrow so have you been down in Phoenix area who support the Bruins so you know who the ... gate and hope the highest ... chess\nHoover this didn't six ranging one tournament at the wheel\nAnd the slow down at the Williams high school was already a one PM I still didn't play now where you wouldn't in high school Lee's ... K. and hope\nThe junior high school sports okay this is the junior high okay that once or that one's over okay hope at junior high school cross country October six by devious invited to boost city high school starting at seven AM\nSo you're going to be too much tomorrow go support then it ruins a junior high cross country they're doing good also so go there you out for them the largest and he's going to be done in Phoenix\nOkay and if you want more information for the Atlantic department or sports that are going on at the high school or the high school and they're hoping junior high\nYou can't call nine to eight Seventy eight five one one one\n\nOkay let me see what else I you know can't domestic violence and learn this will be hosting and\nEncouraging hope the values resource fair that hurts the youth and the elderly building on October night starting at four pm information's available eight to five five six eight seven three one\n\nImmunization and flew clinic\nOctober night team\nOctober sixteen the twenty third and the thirty it\nAll happening at the hope health care center love be starting at ten o'clock in the morning so started getting in line at nine o clock is I mean I ... information is available at seven or eight seven six two lives than\nLow cause horse vaccination clinic up to overnight and tense\nAt you hope you that's clinic\nAnd number to call it southern three eight five to buy one as little cages at the old sales corral\n... S C I ... a vacuum or one of these days and then we put their training at up from ... cook is senior center a cobra kid\nStarting at nine AM any information available at seven three for three four zero three\nAnd four current event at the ... when one of those center October twelve starting at five PM information is available at seven thirty four to four three two\nAnd reggae event of tumors their teens and ... and then it gets seen starting in eight PM moments dinnertime information that to a three four five zero zero\nEight traveling rape this vaccination clinic for dogs and cats\nOf Rome or seventeenth Eighteenth and Nineteen and four times in locations you made dial or recall\nSeven thirty eight five to five one or\nThat and these are the six to seven by James Kennedy elementary school Halloween the event of Tobar eight team gardening is expedient in information available at seven thirty eight to ... three eight\nBy whom Jay ... eagle also I going to be having a Halloween David and domestic violence has come for instance we'll go through the casino not sober\nThompson locations you made dial or recall\nSeven thirty eight by to buy one or\nSaving things or they just tease that led by James Kennedy elementary school Halloween the event of Tobar a teen starting it speaks to be in information available at seven thirty eight two to three eight by\nWhom Jay ... eagles I'd be having a Halloween David and domestic violence has come for instance ... no not\nThe courts will be in looking this sunny skies are high and you're a Seventy degrees south to solve ... about five to seven most are becoming wish\nTo North west in the afternoon and fortunate you're looking at most a clear sky for lower on the forty two degrees western ... five to seven ... coming south east they have to admit night so that's how I was looking in Cape Town area looked real area\nThere we go on down west to monk up the two people as well get their currently a valley area hidden Springs Colorado springs shouldn't read leak or ...\n... feet and called my missionary I turn on that is eternity sending it forty six degrees this morning there and they\n... the ... guide to Honduras Seventy to se ... coming calm\nAnd put them on computer looking at most of the ... guys a lower own forty seven northwest ... east ... died so it can be too bad he won't be today\nAnd we go all the way back east window rock St Michael's ... donate to a not a ... of the ... guide and killed ... lives a grease grease which screens and nominate two parents site\n... economists heading at forty one degree is there a little bit closer to that wins this morning and\nToday ... sixty seven stuck to solve was when he was about six to nine most are becoming worse than the afternoon it for tonight you're looking at most to clear skies a little running forty one degrees\n... he's the bus by to submit a ... hour after midnight so it's ... ... ... NATO area today and we go on down south past del ... area bad events and borders and training ... me I'm\nA ... along with the ... by you and me home one of them and the ... they should know the air and catching the gardens keyboard drive currently sitting at\n... degrees five zeros It's MORNING Winslow today you have science guys are high interest Seventy one degrees right in there but when you come in North to Norwich five to seven miles for an afternoon for tonight which do you look at that most of these guys are lower owner fifty degrees\nNorth West Windsor only six months are becoming light\nAnd or a ball so who is going to be a good one in which town\n[noise] then we go on in the ... Arizona pumping up in the ... kids left sunny Dorney Park area and on in tune with like ... in walnut can in the morning Erin\n... park may know king Kurdish city at forty one degree is in fact stab\nToday flash drive you're looking at most his son his graduate high near or sixty two West Wing is about three to five miles per hour in Fort tonight you'll be most ...\nThirty nine degrees the lab calm we sold case or\nActually looking good in Flagstaff a somebody was lying to Mandy Moore\nBut still I sleep and told me that the way they would just right up in the piece when they went into going around\nA a guy and then get up in a way it's a great morning here on openness seven forty two and thank you for tuning in decay you why are you an eighty one F ... upper among the it's a great great friday morning here on the hope is so let's keep it that we could be good\nWhat are your best mother's mother everybody and we've been everybody agrees each other and nothing but come once but\nRemember don't go too fast\nGoes to speed limit ... and ... go up\nAnd be happy this morning\nYou can get up in a way it's a great morning here on opening a seven forty two and thank you for too needy decay you while you're arguing\nEighty when when ... al ... upper ... be it the great great pride but what do you hear on the hope is so let's keep it that we ... what are your best mother's mother everybody we've been voted green each other and nothing but ... but members or don't go to bed\nYou'll just be the ... and ... go up and be happy this morning\nI there are few black holes can you do a good morning or good to you more music club will be coming back with your local weather and the ... the school good morning to all of you\n[noise] oh [noise]\nUm\n[noise]\n\nOh\n[noise]\n\n[noise] [noise]\n\n\nI'm\nOn the line man\nOn\nThe\nPhone line\nOkay he goes up music guy glued all but he uh\nHe was present in song I may just showing all these crazy he just eating okay this song came on the traditional woods is a Native American music and it was done by me\nSir ... cup Bush senior remain a member of a man and long gone and\nMay have been published seeing this prison so anyway this is going out to Tennessee area to ease\n... few Lawrence Lee thank you for too many learning sleep and here we go what was that they will prisons song\n[noise]\nUh no no no no no no no no no no\nI had a long\nTime or saw a guy I Know a\nA a a a I'm a I'm a ... a A R o\nO nine or ... or ...\nOr pay a I'm a I'm a I'm [noise]\nHey yo yo yo yo that enough that yo yo Yo Ma and uh you know they'll say oh hey yo ha ha ha ha ha ha ha ha you know all that and I said oh no no no you\nKnow not tell yo yo Yo Ma and uh hey yo yo yo you know they are not\nPaid already a I'm a I'm a Vietnam that yo yo Yo Ma yo\nYo ha ha ha ha ha\nHa ha ha you know I'm not saying I don't know I I'm a I'm a ... on my yo yo ma or\nA gun in a long time but no I don't know I I don't know about your mind about a time and uh open a yo yo Yo Ma na na\nNa\nNa na na na na na na na na na na na na na na na na na na na na na na na na na na na na na na na na na\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\n\n\n\nUh\nUh uh uh uh uh uh\nUh uh uh uh I I Know on a day\nOf oh\nA a a heck of a [noise]\nA a a a a it's a I saw a man\nWhoa whoa whoa whoa whoa whoa whoa\nI uh [noise]\n\nWhoa whoa\nWhoa whoa\n\nWhoa whoa whoa whoa whoa whoa whoa whoa\nI have a [noise]\nA\n\nHo ho\n\nLike what we need to kill you well you don't eat it would've been middle some key way I'll be upper among the\nUp and wouldn't have been a project so the hope you know they should have been on line a key why does your Native American public radio station and the little when he's promoting we've partnership between the way I Hope you reviewing TNT you Arizona Public Radio's\nThey should not be with you or to impede or a year\nJust this year\nMore capital of West Virginia let's give a listen under the age of fifty one the nose are forty nine\nThe motion is agreed to fifty one to forty nine as the capital goes down almost as close as it could be if it had been a fifty fifty times we presume that vice president Mike Pence would have come in and broken that talks fifty one to forty nine\nAlmost entirely along\nPartisan lines the one Democrat who voted for Kavanaugh is Joe Manchin of West Virginia one Republican who voted against Kevin off\nIt's Lisa Murkowski of Alaska and we should emphasize before we begin our discussion here\nThis is what's called a cloture vote this is not the final vote this was the vote to end the debate a kind of test but not an absolute test because senators could choose to vote differently if they feel moved to do so when the final vote comes tomorrow NPR's\nNina Totenberg has covered the United States Supreme court about as long as well as\nAnyone and she is in our studios here along with NPR's Ron Elving is covered politics for very long time as well good morning to get both in mourning mourning thanks for joining us throughout the morning here and uh\nNina I Want to start with you let's just step back away from the drama of the last couple of weeks I talk about the historic consequences of this choice presuming that capital gets through as he got through the vote today how is the U.S Supreme Court that different courts that it would have been a\nWith a different nominee or than it was before he can\nWell it was going to be a much more conservative part regardless whoever Donald Trump pick from his famous list it was going to be someone way more conservative than Anthony Kennedy the man that is being replaced and that will\nKill to court that was sort of like a balanced sport sometimes mainly going in the conservative direction but about a quarter of the time\nIn some of those very big cases going the other way I guess the liberal side now in almost every case that is a closely contested one where the voters five to four I think you can expect the conservatives to win and they may\nMove on an agenda to increase executive power to decrease actually congressional power in some ways to and to um\nTake on legal questions that have only been sort of on the wish list of hardcore conservatives for fifty to a hundred years\nIt's interesting you use the word agenda I think that if some conservatives are we're listening to you they might object to the word agenda and argue that concern\nIn fact the conservatives to win and they may\nMove on an agenda to increase executives parrot\nTo decrease actually congressional power in some ways to and to um take on legal questions that have only been sort of on the wish list of hardcore conservatives for fifty to a hundred years\nNow it's interesting you use the word agenda I think that if some conservatives ah we're listening to you they might object to the word agenda and argue that conservative judges or just applying the law as they see it but it is an agenda in the sense that it's a very different way of viewing and reading the law correct this would\nBe down there to even his term which is so far pretty dog eat them frankly we're not very compelling big hot sexy cases even this term so far with\nA half the docket agreed to in their assets to calm the three cases asking for reversal of very longstanding precedence so you can see a lot of the law changed quite dramatically and some of it would not make headlines you would only\nSee it when you went to do something and found you could no longer do that whether you're on the right or they'll ask you could be blocked or you could be suddenly find as people are now finding for example that the court in recent years has on the question if arbitration spread\nTo people you can't bring a class action challenging a clause in ... and when you were hired that says any dispute over salary or anything else has to go to arbitration you can't bring a class action suit in court challenge that I ...\nI appreciate that example because it reminds us that while Kavanaugh's nomination has been viewed through the lens\nOf roe versus Wade abortion rights there is an almost infinite variety cases in which presuming he is confirmed on the final vote tomorrow he would have an opportunity to rule and they would include abortion rights and a lot of things short of overturning\nRoe versus Wade and they would include labor rights and and and many other things let's also remember that there was a\nRelatively true statement made by Charles Schumer\nThe Democrat from New York when he gave a speech shortly before the vote and he said Democrats have been accused of delaying this nomination Democrats have not he said and what he means is Republicans have had the majority Republicans reset the Supreme Court rules so that a so that a minority\nCannot block a action and so if there's been any delay it's been been because of division and the Republican ranks there've been\nA number of Republicans who have been uncertain votes\nOne of them Lisa Murkowski who ultimately voted no on this test vote here this morning Lisa Murkowski of Alaska another one being Susan Collins of Maine who\nIssued in a sense a partial decision and let's listen to the words that she spoke to reporters a little bit earlier today we're not going to hear Susan Collins of Maine but once you set out to rip out to a scrum of reporters a group of reporters out on the floor is that I'm\nVoting yes voting yes on cloture however uh I Am not going to announce until a little\nBit later on today what I'm going to do a later when I'm going to do in that second phone which is the way it works right Ron opening\nIt is but it let's let's be Frank it's it's pretty rare for people to vote for cloture and then turn around and vote hands on why we should do that well the justification that people put forward is they say I Believe in fairness to both sides we should have some more\nFloor debate and we should hear all the arguments as though we haven't and at the end of that we should be fair enough to this candidate to give him a final vote on the floor now I plan to vote no but I think he should have that final vote on the floor she has not said that let's be sandwiched she did not say that\nAnd and I think there'd be an awful lot of folks who'd be very surprised if tomorrow she votes no but she has that option she may I don't think she's actually well who knows whether or not she's enjoying the amount of pressure that she's on her and she does not seem to be having a good\nTime but there was a time when the rules were different when that sort of thing what happened you'd get sixty votes for cloture then maybe only fifty two votes to pass some if\nYou had a principal and the principal was I don't believe we should block this person from getting a final vote ... when the majority clearly favors this person I don't favor the person but I also don't favor cutting off their chance to have\nA final vote with a filibuster okay so we've talked about Republicans who have been doubtful Lisa Murkowski of Alaska was a no vote at least on cloture Susan Collins of Maine who was a yes vote on culture but it's held out at least for a number of hours\nToday her decision on the final vote and then there is a Republican who was never expressed any doubt about that nomination and let's listen to a little bit of today's a speech on the Senate floor from Senate majority leader Mitch McConnell\nEvery effort was made to ensure that the fact three verdict of the mob and the media would wet out over the actual\n[noise]\n\nHey you why community calendar [noise]\n\nDate one night\nI didn't hear a KU a radio station on April ... ... email us okay you lay out the upper among go big money ... be able to send me back on line so I ... a St Louis screaming back on line okay so I'm Glad you guys can hear asked out there they're spending on line\nOkay the KU I cannot be hurting the ... just ... ... ... and the little ... hardly watch and reaches some products and then the ten miles go to the way I didn't know that donate is ...\n... and also you keep theloop divorces and broadcasting from and we like to also welcome the world in or sitting on the line here with her back I guess my best scrimmage creamy [laughter]\nMaybe now in line nuts\n\nAnd as we continue to ... is located at the gym you know state route to six to ... Seventeen shaking miss area ready to turn out as they\nGet they sat Arizona and can you last telephone numbers I too am Seventy eight five by ... by and our facts number nine to ... century eight by by too by\nThe way I see ... volunteers in committed ... members are CBS response was this station and they keep the community about\nK U I read you two is the key way I'd guided now or\nYou can get on in Fort ... die for more details and again the top one number nine to eight Seventy five five zero by\nEntering memory and sent me a community counters at least two weeks or even by email at ... dot net and allow by changing the business days\nOkay we go on to the mobile computer lap band their office days they're not on the road on friday so you know and again we'll call you can call them at night\nTo eight they went to ... work and we'll deal can be reached at night to eat to zero by ... and I hope you behave really health service the regular business owner resumes today\nOctober and you can call them as soon as the Seventy sixes ... Nason where where are you guys just dirty okay and keeps going to be close to me all the seventies for the port creatures in order to come and hoping to Cabo courts today is clues from eight to five PM\nAnd normal business owners will resume or October eighth at ... am information available a nine to a to easier by one two one five\n\nOpen reservation town hall meeting presented by the Zika tail or by the office of ... ...\nOkay let me see this year by the office of Arizona secretary of state\nOctober starting at ten thirty and moans dinnertime at you and then it's memorial center and number to call for information Seventy\nFour to five zeros settling in Seventy four to five zero eight and they'll be starting in about two hours for so long to towns in Eighteen scholarships available for hope because to me and said have\nAnd that led to apply used today a cobra fifth information available at one eight general general seven six to nine six three zero\n[noise] [noise]\n[noise]\n\n\n[noise]\n\nOkay continue we your command the challenger breast cancer waves come for ... two day at ... chip to house thirty nine AM so it's starting right now at eight\nAim is by the already progress and number to call police permission to eight nine for six or six and do all of a meal that what you will run up to her six set the hope that there is for most enter information is seven three foot pain\nOr three to\nAn extent yeah I can pass from Nineteen sixty six reunion will be held tomorrow luck tumors takes its\nDeal park in Phoenix the information is available it is when the when Ron Pfizer all and there is Marty ... will be held at the moon cooking I guess the nail on the tumor six and seven is tomorrow and the next day\nIs Sunday and hold on to the store appreciation day or two hundred and seven\nAs me cancel a number to call quaint permission is six to six seven nine five six one seven\n\nLow cost ... keeps getting Arizona the oil sales curtail October and he's huge tens number to call the permission Seventy eight five to five one\nAnd the hope the high school volleyball\nWill be today by Joseph city in ... ad uses city high school\nCame time to be announced I guess and I hope you Hi Stu foot ball tonight uh Tobar fifth there'll be claim Belgian centers at ...\nBut a call from issues of injury eight five to five one\nAnd hope you high school valuable\nWill be two days we are Jews so city in ... city high school\nCame time to be announced I guess and hope you have to foot ball tonight or over ...\nYou know the plane Belgian centers asking ... be a nice big night so make sure he wears some paint and the game will be starting you say they're not so\nI'm so we'll make sure you can find some ... to we're\nReally down to the sheriff's department in antiques and talk to the movies you can get a pink I'm nowhere members they wear pink underwear\nOkay hope you guys to cross country or to restrict Dave ... invite in cynics among the view park starting at eight thirty eight and that's only on tomorrow in Phoenix, Arizona and Phoenix area support to brew is now moving to new cave\nAnd then hope the high school chest\nOctober ... six region one tournament at me Williams high school studying one PM and this one news over the years thirty okay hope the junior high school cross country you have to be sex\nBut Davis anybody to proceed to high school starting at seven AM as tomorrow morning so I don't know that's daylight savings time or most standard time but\nYou can't give the Hopi high school and hopefully junior high school sports activities at night to eight Seventy three eight five one one to get more information\nTo lose support or high school teams and I feel like he's\nEh let's\nSee what else they can tell you about domestic violence awareness hosted in encouraging hopefully they'll use resource there as well I use an elderly building a super nice\nThat four pm information available it to buy six eight seven three\n[noise]\n\n[noise]\n\nOkay and him is immunization and flu clinics will be held October night the sixteenth Tony Stewart and the thirty years' all at the ... center lobby starting at ten o'clock am information is available at seven three seven is six to ...\nAdd a little ... including going to be on October ninth and tenth as the hope is that's clinic at Seventy five to five one number to call it the old sales corral\nWho the hell are straining apple among cook the senior center on up to her chair and nine AM and information available as an entity for three four zero three ball carnival event that the hoop preventive memorials federal Tobar twelve five PM so and then three for three four three two\nWe don't want it in the tub we then hey we can be or die or we don't want you to get to a winnable woody he doesn't look him on the movie or go really ... and then we could do this and this year\nSo glued to\nThe Bruins tonight at the high school will be starting at seven o'clock and it's the I the ... the way he just said it see where they can nude we're\nYou listen to what are you guys want to hear it we\n... complaint\nAccusing me it's just the weather this this into some uh uh whether strong like Judy ... H cold dead song so would this visit to the woods a song skiing but the scene when the woods or who\nYou would go with Judy Craig who would go up the ah you why you see we\nGo to\nBill\nGates ding\nDing ding ding\nDing ding ding ding\nDa da da da\nI'm a\n\nI'm\nA I'm a I'm\nA I'm a I'm an\nO\n\nO G H what time for me to get off the air here and I wanted to say I enjoy my friday morning here we use the\nFive o'clock this morning and they came on the air is sick so hopefully you guys heard all the good Native American Indian music being brought to you from ... al ... al ... the ... joy my morning here and\nCoffee here and\nThat's it I had cookies but I don't know what happened to somebody took the whole thing in early anyway it was a great morning and I hope you had to be moaning and that's when the siege friday so you got us friday here\nEach year and\nIf you're planning on going anyplace today tomorrow or the weekend be careful larger\nMember storytelling what's gonna happen Jude just be careful just like ... cheese and stay long time ago Amy Beach she\n[laughter] who is be careful Jeannie my shop teacher ray Harry ... downing\nStreet days ... memories memories in a way it's a great friday morning you and keep it that way all day long so you read each other's nothing but ... words respect one another\nAnd half by ... being the not be coming back to you here on Monday so said\nJoe alarmed at six o'clock and they joined wet here on Monday we could quite as much of a fight and how they ... the ... and then ended up putting them by\n... by how people can be a new one time ... ... ... ... me and then my my ... to ... na na ... somehow they annoy me I turn on the ... just by\nThe Monday ... looming up up and it was the way that saying that we could clearly way down 'cause he wasn't a time when he well he ... he used to go because ... is an ... and indeed\nThe tells you\nDiaa all you're going to know more meat delete the monkeys and get into the plane that went out getting demanding while they gave me an equal or do you mean like I made the cut ... than me ... me we Irma\nUp yet or put me on ... I just ... them\nThat's up ... billion yeah with my aunt\nSinger venues cinder sending it among many okay with that said he or what and only here that could be signed it all went to see ... great ... and just a random all the year better known as which in a good\n... di ...\n\n[laughter] [noise] [noise] to talk for a\nTough tough tough talk\nThey pay a price\nTo pay for staying up\nTo the top I taught for ... for\nA talk show for for profit for ... [noise]\n[noise] [noise] well\nFor\nFor for for profit for [noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise] but for for profit\nFor Ross Perot quick quick so pro pro pro cell\nCrushed blah blah blah\nBlah blah\n[noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n\n[noise] [noise] for for for [noise] for [noise] [noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise]\nThose boom boom boom boom boom boom boom boom boom [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe blue\nNote ... ... ...\n\n... ... who who knows who the\nWho who are\nOn the mood of the blue\nNote ... ... ... you know the\n\nOther ... I\nMay have to do here is a total may ...\nMay now or no actually I'm a ... a ... yard all\nOf a yo yo yo yo yo yo I'm a may\n... you are you on ... or no way no no it was a while you are you a ... or ... or ... ...\nS C I Know my and my mom and my ... my next about a year I'm no walk and we all have a male or drugs\nOr here's a total may whoa whoa whoa whoa whoa his son\nAbout eight or ... or my you know the arm or a a a a A R so I'm\nA yo yo yo yo yo yo da da da da\nDa da da da da na na na na ... why are you a boom or a non uh all\nThrough my ... my uh my my ... my name's Donna I'm no one can knock you out of a line\nYou or do we do we know a young or nay or nine or ... or I may all\nThe or I or a or\nA may\n... or I or a or\nA you know I hear\nYour home all the all out and then your right now you know\nI\nWouldn't know whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa you know some\nI Know a man or other Jose all all the OJ ... or ... or\n... or ...\nOr ... or ... or ... or a law ... law law or\nBecause they are\nA lot because I saw it here I I Know a guy I saw so how long do I have a mall or because\nThey are\nLaw because they are I Know I I actually saw a lot of low or a boy or a ... or more an hour on your or no\nOr know how do I\nBecause I I\nKnow about how they are all made a A R a shock to allow low ball why are they are because\nOf the house I I I\nKnow ... hours how they are I Know ... or the egg I saw saw law law law or ... or ... or ... or I Know a whole lot\n\nYou know all all I all I\nMay ... may or oh you know you start\nTo all of a non or know about your mother or a or a job at all\nBecause of a yo yo yo yo yo yo I'm a may\n... my young young tall or a no win no there was a while you are you a boom or a no no\nNo I ... my mom my ... my neck but uh I'm not a you know we all of a line\nYo yo I totally do we know the ... now now now or may\nAll the uh oh\nHey hey hey hey hey\nHo ho ho ho ho ho all\nMay have a young\nMother yo yo yo than than a year old I Know we all know how they know how\n\nOld are you\nIn law who\n... who's a\nNew ... new see\nOne of those Italy eh you'll they\nYou\nKnow ... ... who ... ...\nOh ... oh no\nNo ... no ... no ... you know real ... I don't know why I'm a ...\nYear old ... ... or\nYou\nKnow go you know small ... New York real they are now going on among young ... the James\nMartin a barrel ... no ... no no no no no\nThey they\nGo on my mood when James Bond ... New York or anybody\nOn a ...\nA young mother worked ... when ... ... no no\nNo no and then when they\nGo right into my new James ... who\nA ha ha you\nKnow no longer do we do ... used\nTo change it seems to me you know ... to the coach who\nKnew who\nLoses some day I'm sure there's no way to go now being huh he sees you are in trouble now landing Thompson Hi\nGood can come to the way\nWe used to go where\nThey knew me move on to\nTry to be a dream come down to the\nPolls why why ...\nHa ha ha ha ha ha a tree\nTo rain man you know just to watch the new people come\nTo me I knew when to ... to ... to ...\nLast week I have no clue when that comes to mind and brain means to me I like\nTo try and think to buy beer\nBottle one nuclear for me to go ... during the pre teen ...\nStill when faced some people pass by the strange the food and singing and how do you do do they really see I mean\nI Love New York\nTimes in the last\nTwo moms who them learn much more than we do know and\nI think too much to say that there was\nNo longer true for all\nThe ... ... ... ... pounds on mommy\nI mean the the Charles ... drums I Do like the top that's when you know we do\n\nWho was the one who who\nWho ...\nWho wish to mow the lawn we just don't know the bees huge ... drums\nI Love the team made no sense when do we do know\n\nWho do we do\nWe know between the two and a ... a\nNew\nNew\nNew\nHa ha ha ha ha ha ha\nHa yeah yeah [noise] yeah yeah yeah right\nRight\nRight right yeah\nI\nKnow what I mean God Knows you know she really they really\nOn the line\n...\nMarine right\n\nThe river\nAnd\nSaying that they're\n\nGoing to be some journals\nGrand mom I'm a I'm a man from another ... friends sharing and\nReally reading\nA\n\nMan\n\nNamed ... [noise]\n\n[noise]\n\nAnd do the job the changing who\n... ...\nFamily already just with the news when I'm name's huge ...\nAnd you say you want a leader but you can make new man\n... ...\n... you better closing\nIn\nOn the phone\n\nRang\nUm\n\n\nMan\n\n\n\n\n\n[noise]\n\n[noise]\n[noise] [laughter] [noise]\n[noise]\n[noise]\nJet engine K. you why I listen there's the Arizona department of transportation they that the state highway eighty nine is close north and south bound between ... and the two but city junction turned off due to wash out\n\nGone homo marker no longer\nOn a mom or golf or on the air ... your your gum um\nDo you like what you hear what we love playing you all these wonderful tenants and doing shout out and dedication or okay you're white listeners\nBut without your support in contribution to KU why we would not be able to stay on air and bring you all these wonderful programming so why don't you do your part and log onto your computer and go to the Y. I. dot net donate online\nToday that's why I dot net we certainly appreciate all your continued support and remember to keep your dialect eighty eight point one FM I slowly\n[noise]\n[noise]\n[noise]\n[noise]\n\nYou are listening to you why hoping lady part one FM streaming online at G. Y. I. dot net gain Y. I. L. P. upper ... nine point one FM projects of the nation and your neighbor American public radio station\nIn region is engaged in like a woman really lacking some like fish when [noise]\n[noise] [noise]\nThe only time he has he has wide eyed after national me\n\nThat says national native News I'm Antonia ... memorial walk on Monday will honor forty five children who died at the rapid city Indian boarding school in South Dakota will take place on the city's west side at least you injure has a preview\nOf the walk the rapid city Indian boarding school was open from Eighteen Ninety eight to Nineteen thirty three and part of the federal government policy a forced assimilation for native children\nThe building is down Indian Health service hospital other John Thompson is with the ... group Thompson is working on identifying\nThose who died at the school so far about forty five that identified two of which were insurance she says children who passed away to school or noted as quote no longer being enrolled\nMany family members were never notify their children and the never came back um there are a handful of grades that are\nMarked that aren't in Mountain View cemetery here in Rapid City but that's only nine on the children we know that some of the children did make it home and their families were notified on time and they are buried back at home um but there is a pretty significant portion that are\nMost likely very I'm Mark ... near the score\nThompson says more than a forty five being honored died at the school she says a frustrating part about documenting the children who died this how unimportant was to the federal government in addition to the memorial walk Rapid City mayor Steve islanders proclaimed this year's Native American day as a day of grandmothers\nTo walk takes place Monday morning at nine AM instructors to park and makes its way to the Suzanne hospital for national native news at least your picture in Rapid City South Dakota\nNumber of activities are planned Monday in Los Angeles to celebrate and kitchen is people's day this year marks the first official holiday in LA after the city council live to replace Columbus Day and instead recognize indigenous people\nCity councilmember Mitchell feral introduced a motion and led the two year process to change the day was critical below\nThere's the walk takes place Monday morning at nine AM and starts to sue park and makes its way to the Susannah hospital for national native news I ... in Rapid City South Dakota\nA number of activities are planned Monday in Los Angeles to celebrate indigenous people's day this year marks the first official holiday in LA after\nThe city council live to replace Columbus Day and instead recognize indigenous people city councilmember Mitchell feral introduced the motion and led the two year process to change the day\nWas critical for Los Angeles to act in a manner that we did with the repeal of Columbus Day and the replacement of Columbus Day with indigenous peoples stay on the second Monday of October or the largest population of any city or state to have done show\nOh Farrell says events will also include serious undertones with panel discussions looking at issues facing native people\nWe acted because the Native American population indigenous people have been you know the the atrocities committed a drink colonization um have exacted have resulted I should say\nAnd some very very sobering statistics and we need to lift up native people indigenous people who have been living with the results of five hundred years of colonization but the bottom line at all of this that this is a celebration\nIt's all going to be down day we're not going to pretend that there are issues that we have to deal with the native America but we're going to show up at the fact that we're elevating the profile of an age that that ... in native America\nThe day we'll begin with a sunrise ceremony and end with the concert featuring read them and the black eyed peas\nThe Navajo Nation has declared a state of emergency for part of its reservation in Arizona after rain from tropical storm roadside damage to road one person died in an accident Wednesday nights or a section of the highway was washed out between the cities of Flagstaff and page transportation agencies are\nRepairing the highway which is expected to be close for several days\nI'm Antonio Gonzales\n[noise]\nNational later that they had him for national voice videos\nLike wanna broadcast corporations fighting is by law group provider lost\nBy the corporation for public broadcasting\nLive support from the public radio satellite system\nFrom northern Minnesota resignation food we used to support the shows and share of about ... harvest wildlife products that oil from jams and jellies ... produced by American Indians and available at red lake nations dot com then by the law offices of slots he chambers taxing Miller and Lungren\nNational travel rights law firm was offices in Washington DC to Mexico California and Alaska and online Sasaki dot com\n[noise]\nNative voice on the Native American radio network\n[noise]\nThis is a Native American calling on your host ... would\nWe often get words of encouragement from those we love as well as others we encounter witness the obstacles before us and the ones that we have overcome and sometimes with these people's help\nToday revisit within a musician too much like our traditional phone makers and keepers or gifting listeners with the sounds in lyrics of encouragement dotted through drumming electric bass send me calling her October music\nMakers the house in what they do punk rock it can also be called an act of love and there's a lot of it emitting from their new album fight like a woman will hear more about this strong album title in this hour along with the music that rests\nWithin it and by the end of the hour tendencies will go out to ten of our listeners who jump into this line conversation with their on your comments\nAnd questions there courtesy of sea Austin and their lives here in Studio forty nine with us today so when you die on\nOne eight hundred nine nine six to eight for eight won't connect you directly to them we look forward to add in your voice to the discussion today and right now it is my pleasure to welcome in the ... who was here in Studio forty nine with us ah we have a trio of voices featured on\nThe album and it is my pleasure to welcome\nIn Jones finale as well as Juanita Ben Ali increasing Ben Ali and together they're here and it is just a treat to have them uh here in Studio especially during a special time of year and just want to give 'em the family a moment to just go ahead and green our audience and\n[noise] um anyway that you feel is fit to to just welcome in the hour\nYet a task seems now a ... I'm so happy to be here and be on air\n... or ... or ... my name is ... and I play drums and she ah ah on on each ... are not good in addition to that ... a good luck on it but he said she told me ...\nVery honored to to be easier to also kind of recognize my or father John spun Ali who is traveling with the\nGold Monet on draws minority in Syria\nPlus performances by W W when you're in the country music store Mickey dreams and so much more available now\nAt ... dot com and old ticket master locations\n\n\nFlown down down down\nDown down again [noise] [noise]\n\n[noise]\nYep Tobar music maker is the Huck Finn is now the whole for hope and they're a band\nThat likes to rock out their story there here visiting with us you can visit with them directly to recalling one eight hundred number six to ... for eight and let them know about how you feel about the songs that were about to share with you or ... two hundred Ninety\nSix to eight for eight is the number right here in Studio forty nine with us we have the but not only family a Jones Geneva in clay center here with us and\nAh their voices are what we hear on the music of the house in my ... to have all three of them here in Studio with us today and so the album is titled fight like a woman and that's the title cut that we're about to share\nIn Geneva go ahead and finish it up for us and we will share this and folks just remind\nYou it is or Tobar music maker and we're going to share ten of these CDs courtesy of the house in a while you got to do is give us a ring one eight hundred my next exterior for aid and sharing your thoughts on the air go ahead Janine\nSo if I like a woman really is it's kind of a call 'em it's to remind folks that that we are powerful beautiful beings as women and we\nWe face a lot we encounter a lot you know we hold the world on our shoulders and we try to you know make everything better for everyone you know to the best of our ability but it's it's really about confronting stereotype it's about owning who\nWe are our own identity because so many times it's bad to us we're told what to look like we're told who to be we're told what what to be what to do and you know as genetic we are matriarchal societies we've always had that\nStrong powerful feminine force and so this is kind of that call out and you know my brother explains it so well because he is eight and a man\nIn the matriarchal society and I love the way that that\nThat he really kind of resonates with you know people need to hear what it is to fight like a woman it's not with violence it's not with guns but it's about compassion it's about being open it's about listening and so we've had so many incredible\nIncredible mentor is incredible leaders as women and especially if the nasty women you know Roberta blackout Catherine's now these women that have stood you know\nFace to face with the federal government in order to to stay on our traditional homeland you know and which is which is where we grew up you know the headlines of our grandmothers skirts and so this song fight like a woman is paying homage to all of these amazing women\nThat have done so much for us and all the amazing women who are going to do so much more for us\nAnd [noise]\nHe wants to abolish atmospheric job it was kind of a woman will change [noise]\n[noise] [noise] [noise]\n[noise] wow\n[noise]\n\nOoh man [noise]\nYou\nKnow at the battle gosh God you know we've all been down there in about [noise]\n\n\nWell gosh you know [noise] [noise]\n[noise]\n[noise]\nI think you are hearing the hot here in Studio\n... today and this is the title my Muslim and joined I said when he speaks to a port St share your thoughts on what you're hearing to a game maker one eight hundred names to Chile fourteen [noise]\n\n\nOoh ooh [noise]\nMake up and down [noise] [noise]\n[noise]\n[noise]\nNow we welcome in the audience were in the high fan who is calling I tore only Mexico to being on the G L E Sam thank you for giving us a ring go ahead you're on your [noise]\nYeah I just like to say hello and thank you for this opportunity the um [noise] and then all the family you know [noise] uh be an either or being and being a farmer is does are\nA lot of work lots of a hard work\nAnd as we speak I'm asking some record and preparing for winter and so throughout the summer we've been me and my brother every band\nDuring a lot of a a a clarity shall we harvest some corn pollen and from Marilyn some squash chili and a court [noise] so I\nLove to um have\nA ... family is and I thank you guys for putting up ...\nAnd I'm looking for terrorists to buying one and help support you and so you know it's good to be a creative [noise] and I just think that\nOur ancestors did this and they caught us who's been taught well are greedy\nThey became um farmers in you know they know what to do and what to expect in either really drought you know learning how to do um [noise]\nA rain water harvesting or erosion control\nBuilding structures and I've been doing that for all my life and you know again it's a harder secured and people look up to you know she community members\n[noise] have [noise]\nWhere we live\n\nWay [noise]\n[noise]\nYeah right\nMe Nikki\nYeah I mean the whole thing in\nThe heat and he ran away I mean you know I mean right yeah yeah\n[noise]\n[noise] [noise]\n\nI'm ... thanks for tuning in today's ... here in Studio forty nine with me or Geneva Jones and Clinton but only Indian or a family of filmmakers who are sharing their album fight like a woman they call your group ... sin and they're also looking forward to hearing what you'd like to share about their\nMusic Anders tendencies that they have ready to share with you join us at morning hundred nine nine six two weeks for Eighteen oh let's go ahead and get them more music coming out of your speakers right now we're going to go to their song stronger together this is off of their album sleep like a woman\nWe we we we we we try to reach the man show\n[noise]\nNa na na na na na na\nNa na na na\nVe strong\n\n[noise]\nFashion we me and\n\n\nUm\n[noise]\nUh on on a on a\nOn a man yeah\nI mean\n\nThese are shrubbery music makers were here with us in Studio forty nine in the hot thing and we are excited\nTo have you join us in this conversation to we're going to say Hi to college who is in ... Arizona we're going to say Hi to Danica listening in on why Derek thank you for giving us a ring and go ahead you're connected to the ... [noise]\nI was played the ...\nTo me I um I play music with a glacier in a play based there are a few plays drum court and um I'd like to um [noise] uh agree with everything and what's going on you know or understand about\nThe the women and you know about as we're kind of a being a ... than a Quaker said about the girl\nI just from a a narrative of a feel for my dad or just a I have to weigh in March and I couldn't stop that are planning on a understood why because a lot of rain\nAnd ah you know the economy it might be a waste and right now with the with the rain is coming you know I kind of do I I Wish I would've done it is ... and ... and still but um yeah for the um ... or ... movement is about\nA month for you know I'm you know I understand about being a being oppressed and I kind of put that aside or your opinion for this I Am a kind of like a minority of a minority I'm ... I Hope people in my mouth real albino\nAnd uh I Know what I'm being bullied it's like I'm I'm Seventy years sober now you know and because of the law or because of a what I went through a drought on drugs but now like\nA music I like I said I grew up I'm going to climate are the better when I was fourteen\nAnd I went through the you know the um rock and roll or you know every metal and in in a in a city but um I grew up listening to that and uh you know I have friends who play their club is done and uh my cousin he\nHe's a teacher but like I said right now I'm I'm enjoying you know being a sober and um I feel like I'm a Native American uh we're kind of locked in the political I'm a mess that we're in you know last time we were when I heard of\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nI Want to broadcast rations to native non profit media organization [noise] funding is provided by the corporation for public broadcasting support the public radio satellite service by friends\nMichael days later the Native American radio network\nYou are listening to kill you why I Hope below eighty eight point one of them streaming online and why I dot net and Katie y L P uh promote coffee eighty nine point ... projects of the Hopi foundation [noise]\n\n\n\n\nAttention K. you why I listeners the Arizona department of transportation states that the state highway eighty nine\nIs closed north and south bound between Cameroon ended to basically junction turn up due to wash out\nThe Arizona department of transportation estimates that eats or will add about a hundred and Ninety miles to motorists trip on interstate forty state route eighty seven state route to sixty four and us one sixty\n[noise]\nAttention K. you why I listeners the Arizona department of transportation states that the state highway eighty nine is closed north and south bomb between ... and the two basically junction turn up due to wash out\nThe Arizona department of transportation estimates that each or will add about a hundred and Ninety miles to motorists trip\nOn interstate forty state route eighty seven state route to sixty four and us one sixty update closure a multiple days expected on us eighty nine north of Flagstaff there'd be flooding has cut roadway between Cameroon and us wants to be\nThe Arizona department of transportation is working to reopen a section of us eighty nine shepherd by flooding about sixty miles north of Flagstaff between state route sixty four\nAnd Cameron and us wants to be with us eighty nine expected to remain closed for multiple days due to the wash out between my post for sixty seven and four eighty one\nOr the Navajo reservation\nMotorists heading to page Cuba's city and other destinations north of camera in Tempe take interstate forty east from Flagstaff two state route eighty seven at Winslow then head north to state route to sixty four\nNorth West to us one sixty into by city and the west to us eighty nine for those traveling from point out on us eighty nine the closure doesn't affect access to the Grand Canyon national park\nEast insurance be a s are sixty four director of the Hopi department of transportation and motorists using state route through the tribe's reservation\nShould watch for pedestrians and for local traffic including buses and also should be aware that some stretches have sharp bend and the great\nAgain this is an update of closure of multiple days expected an us eighty nine north of Flagstaff\nArizona department of transportation is working to reopen a section of us eighty nine severed by flooding about sixty miles north of Flagstaff between state route sixty four and camera in\nAn us one sixty with us eighty nine expected to remain closed for multiple days due to the wash up between my post for sixty seven and four eighty one on the Navajo Nation\nMotorists heading to page Cuba's city and other destinations north of camera and can take interstate forty eat from Flagstaff Tuesday route eighty seven at Winslow\nThen heading north to stay route to sixty four North West to us one sixty into by city and west to us eighty nine or does traveling\nFrom point drop on us eighty nine the closure doesn't affect access to Grand Canyon national park each insurance B. R. S.\nAre sixty four director of the Hopi department of transportation said motorists using state route through the tribe's reservation should watch for pedestrians and for local traffic\nIncluding busters and also should be aware that some stretches have sharp bands and deep gray\nAnd that is your update on the closure\nOf us eighty nine north of Flagstaff once again you're tuning into ... eighty eight point when the ... out the upper ... eighty nine point one FM also streaming online at K. E. Y. I. dot net your Native American public radio station\n[noise] why ... ... [noise] I'm\nNat we we we we we we we we we um [noise]\n[noise]\n[noise] you Roger and me and\nMy you know [noise] [noise]\n[noise] we we we we we are strong [noise]\n\nLean on and on um [noise] we\n\nWe [noise] we we um [noise] um [noise]\nUm [noise]\n\nUh nah nah nah nah a in a\nTown\nWhere you know [noise] [noise] [noise] [noise]\nYeah\nI'm I'm [noise]\n\n\n\nMan man made me a long\nTime [noise]\nAnd I can do a thing on\nThe can turn\nAround and um he had been down that way many hundred getting paid by me hang out and they say that John John again\nAny better and during that catches the today as a child\nOr a three way when we asked John ... yeah actually we we should\nReally strong because we are on the brain really on a\nYearly check it out you know traditionally [laughter]\n[noise] [noise] [noise] [noise] [laughter]\n[laughter] ...\nOn a\n...\n\nNo no no no\nNo the only one\nMan I'm ashamed to kill me James Bond is done by a lot of ... how are you\nKnow no not really a great lady how and Lungren ran day in a row and train you or a black well Angela and data wedding that Laurie how are you know and I know a long time on the uh\nArea man [noise]\n\n[noise]\nA new a new new to\nGet you can make a strong men the men\nNo bread you know we\nDon't really know knew how\nTo [noise]\n[noise] [noise]\n\nDo you like what you hear\nWhat we love playing you all these wonderful students and doing shout outs and dedication score okay you're white listeners but without your support and contribution to KU why\nWe would not be able to stay on air and bring you all these wonderful programming so why don't you do your part and log on to your computer and go to Kay you why I dot net donate online today that's K. you're white\n\nDo you like what you hear\nWhat we love playing you all these wonderful students and doing shout outs and dedication for okay you're white listeners but without your support and contribution to KU why\nWe would not be able to stay on air and bring you all these wonderful programming so why don't you do your part and log onto your computer and go to Kay your Y. I. dot net donate online today that's K. your why I dot net\nWe certainly appreciate all your continued support and remember to keep your dialect eighty eight point when FM calling\n... ...\n... I don't do it right on\nThe line [noise]\nUm\n[noise] [noise]\n[noise]\nThat um the guy is a bad guy new gossip about Iran\nOr your mom and rabbi\n[noise] ... [noise] ...\n[noise]\nWe\nShare that\nYou may get the money and you know may\n[noise]\nIt's banned in my life right now don't run they know you don't want the it is about the\n[noise] yeah\n[noise] um yeah I'm a ... year\nUm [noise]\n\n[noise] [noise]\n... ... these days [noise]\n[noise] [noise] [noise]\n...\nMm\nMm Mm [noise] [noise]\nOh oh oh whoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa injure them off to war\nAnd in a while\nSo many so many people in\n... oh oh oh oh\nOh ... you're a little bit better for you know this is Ron\nRon many on and on\n\nThe landing in the last Monday when a\n... oh oh oh\nOh the whole mom were without no no\nNo no no we are\nSo many of 'em on on\nThe ground and\nYeah\nAnd and all the\nBlack man during the last two or three in the lab\nAnd so on and you really need to go around and you run yeah\nTo make and sell the\nBlack man that I mean\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAnd west to us eighty nine for those traveling from point out on us eighty nine the closure doesn't affect access to the Grand Canyon national park east in trends beer that's our sixty four\nDirector of the Hopi department of transportation that border is using state route to the tribe's reservation\nShould watch for pedestrians and for local traffic including busters and also should be aware that I'm stretches have sharp bend and deep great\nAgain this is an update of closure multiple days expected on us eighty nine or ... that the Arizona department of transportation is working to reopen a section of us eighty nine that bird by flooding about sixty miles north of Flagstaff between state route sixty four and a camera in\nAnd us one sixty with us eighty nine expected to remain closed for multiple days due to the wash up between not pose for sixty seven and four eighty one on the Navajo Nation motorists heading to page Cuba's city and other destinations north of camera and can take interstate forty\nEast from Flagstaff two state route eighty seven at Winslow\nBeen heading north to the route to sixty four\nNorth West to us one sixty into but city and west to us eighty nine\nOr does traveling from white sauce on us eighty nine the closure doesn't affect access to Grand Canyon national park each insurance the s are sixty four\nDirector of the Hopi department of transportation said motorists using state route knew the tribe's reservation should watch for pedestrians and for local traffic including buses and also should be aware that some stretches have shirt band and the great\nAnd that is your update\nOn the closure of us eighty nine north up like that once again you're tuning into ... eighty eight point when the ... out the upper ... eighty nine point one of them\nAlso streaming online at the Y. I. dot net your Native American public radio station ...\n[laughter] ... leaders lax fire\n[noise]\n\nReally [noise]\nTrying to sign a law [noise] saw this guy but where we [noise] we [noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise] you know God [noise] for\nThe [noise] the gym\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n\n[noise]\n[noise]\nRight [noise] well the scare me [noise] John we go\n[noise] [noise] [noise]\n[noise]\n\n\n[noise] Mm [noise]\n[noise]\nOperate in the world you know school so you know he can\nYou teach at the\nAmerican indian women living on the Indian reservations experience unique challenges that intensify the epidemic of violence against them\nWe're on are all in our tribe and then there's are jumps tribal and federal law to sexually assault\nOr be another person every person is recruiting valued dopey culture of John Leonardo you know\nTurning to the district\nIs also legal under federal law sexually assault or\nThe other person if you were the victim of sexual assault or feeding please\nCome forward and report it or if you know anyone who\nWas the victim of one of these crimes encourage that person to come forward working together with ... people we can start why would cry\nEvery story [noise]\nThis is probably service announcement cooperation with obey police department and kill you why I Will be radio\nUm\nNa\nNa\nYou are listening to ... I Hope the law any point one at a KU Y. I. L. P. upper ... eighty nine point on that project though the foundation dreaming online KU why I thought that\nA while I enjoy your Native American public radio station the following it provided ... I Hope you radio ... and a new Arizona Public radio\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\nOh my [noise]\nFly from NPR News in Washington I'm Elise give army and a closely watched trial a jury\nHas conducted a white Chicago police officer obstructing degree murder and the shooting a\nBlack teenager look Kwan McDonalds here in Washington the nomination of Brett Kavanaugh to the Supreme Court it now on track to a final set of those after procedural vote assist you want to forty nine this morning to continue to the final confirmation decision voting not\nTo proceed Alaska Republican Lisa Murkowski who calls Kevin ... a good man but not right for the court at this time\nI have been wrestling [noise] to really\nTry to know what is\nFair [noise] money's right now\nOn the eve of this kind of the cabinet are put through an op ed piece in the wall Street Journal to concede that his last minute appearance would quote very emotional buddy said at the end of the day he is a cold hard working an even keel judge\nThe American bar association has announced it is we visiting ... after his Senate Judiciary committee Paris last week I PR Kelsey Snell reports her final Senate vote is expected tomorrow\nEvening Senate Republican leaders are closely counting supporters after the fifty one forty nine so the margin just making minimum fifty one of those needed to approve the judicial nominee in the Senate\nOnly two senators deviated from their party Alaska Republican Lisa Murkowski joined the Democrats and voting no wild west Virginia Democrat Joe Manchin joined Republicans in voting yeah now all either in Maine Republican Susan Collins she voted to advance capital\nBut has not yet announced how she'll vote on confirmation her decision may be critical if Collins or any other moderate changes their mind vice president Mike Pence will have to break the tie Kelsey Snell NPR News the Capitol at the time of\nThe vote NPR's Brakkton Booker observed the scene outside the U.S Supreme Court across from the U.S Capitol Grounds the crows or\nSide of the U.S Supreme Court in ...\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise] my name is ... sometimes that just sounds so guy sunshine ran snow row\nYou know we have we do [noise]\n\n\nAll righty I'm back with their updated weather for this Friday [noise] October fifth two thousand eight teen [noise] first step team's Kenyan tiny at sixty eight [noise] this afternoon Sunday with a hundred and sixty nine west when around eight miles\nPer hour tonight most of the clear they lower I'm forty three west northwest when around six miles per hour becoming eat southeast after midnight [noise] because ... is currently are sixty eight this afternoon Sunday with a high near Seventy west when around six miles per hour [noise]\nTonight most clearly they lower I'm forty two west northwest when five to seven miles per hour becoming southeast after midnight [noise] mine copied by city area currently at fifty nine and mostly cloudy this afternoon Sunday with a high near Seventy two Tomlin becoming west\nAround five miles per hour [noise] tonight mostly clear with the low around forty seven North West when around six miles per hour becoming east after midnight [noise]\nThey're not old St Michael's area currently has sixty three with a few clouds this afternoon Sunday with a high near sixty seven ... seven to nine miles per hour [noise]\nTonight mostly clearly they lower I'm forty one Tomlin becoming west Dr West five to seven miles per hour after midnight\n[noise]\nWinslow currently at sixty eight this afternoon Sunday with a high near Seventy north northwest\nWhen around six miles per hour [noise] tonight most declare their lower I'm forty eight light and bearable when becoming west\nOut west around six miles per hour in the evening [noise] last but not least Flagstaff current yeah fifty seven with a few clouds this afternoon\nMostly sunny with a high near sixty two west droplets when around five miles per hour [noise] tonight mostly clearly they lower I'm thirty nine whip calm when [noise]\nAnd that's going to be your updated was up for this Friday October ... juice thousand eight teams and for more information on the weather you may go to weather dot G. O. V. [noise] and that's going to wrap it up for your update and your tuning into K. U. I.\nA Muslim or at a time when\nHe\nWas [noise] [noise]\n[noise] [noise] um\nThe the na na na na na na na na na John the\n[noise]\nThe bottom fish now you know\nAnd then\nWe will not\nLet me know about the right well I'm a man a neuron around\nAnd the non over nine John do you do\nThis to\nBe ... na na da\nDa da da\nDa da\nNa na no longer and throws a long way in a long literary well\nWe have we have\nA lot of\n'em\nDown [noise]\n[noise]\nAt home mom\nRan on long man he uh\nDoes do\nLonger than John mainly\nThe the\nLong run around and leave me alone will re\nOh already gone oh can you help\nWhile I was just a little you know Ronald Reagan as Robin ... a lot of people are telling me about her now in our group in one country not\nAt all no pulled\nA gun in a\n\nLong period of time in that town [noise]\nAnd I\nDon't do things and not trained in a town that has to do things in common to what they know the thing is\nI don't know and a dog\nTo buy a bond that range cheat a little boat come take up they were ... when when when you're in\nA\nLong long long time you know\nI Know and then on the town I don't know what I'm about to be Asian they came here is a\nWhole lot about\nThe man or a or they just go to a woman who come by and like I'm not\nA not a building that much longer you know and then\nAnd then we go\nTo Don Don King or a town and that you're a lawyer and take out playing a game and I\nDo too much time as much as they learn how to do that\nNow when I was going to you or\nOr or or\n\n\n[noise]\n\nYour ... and the animals\nAre dying there will be a new tribal people for many colors and he ... he was an by their actions and we will show make errors then once again we [noise] she'll be known as the warriors ...\nAny any [noise]\n\n\n\n... or the ocean and the people in much of the\nSame thing and and um and [noise] then\nDid they ran in the business news they wind or the next day\nThe rules\nAnd thank God thank God and and a and a man and a\nTen [noise] then\nThey did they in the ... and Dr ... they ... they they are in less than the boys are you going to\nDie on a ah a\nPain to the doctor the red rose hangs around you know there's another thing that I'm lying none of that is not happening here in\nThe in the in the class God you know if you knew and signed up for some time\nOn this weekend and I just see them but I just turned\nInto a\nI'm not a a lamb fan and uh [noise]\n[noise] [noise] [noise] I\nThink when when the time go by\n[noise]\nYeah just a matter of fact that's the way in the last job I got ... John Lithgow knock down them have been other than that I had\nA\n[noise]\n\n[noise] uh\n[noise] uh\n[noise] uh\nFor a\nLiving with the ... [noise] like buffalo wild ... buffalo start running any clothing you in the ...\nRacing against the creditors sphere if they offered progresses addictions civilized constructions wanting collide revived whatever it takes [noise] gun laws\nTruth lies in the ... the national for harvest threatened by what nature made me\nA civilized rational Russians wreaking blood has been no being of tomorrow or the age of ... business ... damage\nTalking tearing maximize orange and running any closer than an abnormal like buffalo wild horses I\nUm [noise]\nA\nSacred\nLiving on reduced to listen to escape a little while meeting a boom boom boom [noise] between earth and stars three [noise] follow your future to relocate\nAncestor prayers praying to the ... the ... and living with a fugitive inside them on feeding the partner buffalo latrines and he's a reality in all white cake with medicine which\nOne I'm a\nI'm\nA I'm a I'm a I'm\nA\n[noise]\n\n\n\n\n\n\nWhile I was out I I noticed a dark pickup truck coming in the in my driveway and I I went up there to greet them because we were walking we're getting to my house and it was the deal will they forget about\nA month and it gets bad joke aligned yards and gee uh requested permission to cry hey buffalo up my property\nWhen and I'm ... I told them about the history the started to try and get Lisa on the line about ... you know why buffalo ... to ... I've got a lot of research on national where of designing you can follow the\nIssue is garbage I mean just doubled it means it's nonsense [noise]\nHere now from five hundred thousand [noise] life you know the United states senator and everything and I think she came up and go first to\nBut I'm sure the animal blood cells in parts Jeanette here and what we call ... they're mixed with the cattle but but you can see what can I say all carry the sheriff there is some oil fight when they're not wild saying\nWhy the Yellowstone here so\nWe were never shut down the toilet and tell us your animals they're the ones that I mean that's a little\nWhile asking hairs allowed us to stick in my own they have to do with\nThe\nFirst cattle\nThe level right over from Europe has given me a little more tired yo yo I'm now brick or not ... I'm not I'm laid off the um when basically has\nTo be ... true in the horses that he\nDid to me that so they have the legendary in cow vegetarian buffalo to wash up in in New Hampshire where in the men's fashion I suppose to have obviously never happened why water is based solely on washing study that was\nEnough to have to say and then the ... when they took the lid on there\nThey have what they have these trance while never occurred kind of living here and then his going around telling us how national park has the money to deal with each other\nYou're going\nTo purchase it rather than they were allowed to\nGo for the last ... or ... or low energy glued to the whole you know\nThere's never been to the stress\nVery ironic luxurious all you have to be given the home during the national poor Idaho Montana and Wyoming maple long reverse what his status of America do we\nWatch the Syrian water at all or they retain their Saturday I mean we're living\nIn a you know so here we're having these are all our dollar's\nWorth than these in the neighborhood by million dollars you know over the period of time even happen one animal that has trained or not even in the way\n\n[noise]\nI live in a day on on knowing what you\nHave long since I've been here since she was so nice and it from that point forward when\nWhen I came here as as a senator the issue of buffalo as the light from buffalo the water all these things these are issues that that has been alive and well in these objects call that one thing that\nThat really concerns me is that the parents of the plane the plane the um\nThe right to have gone to buffalo and the\nPeople that there are some there and it didn't get lazy and we have to we have to recognize that for what it is\nBecause every time when we when we talk about life in Yellowstone and yelling no heart that part of a treaty characters that holiday that her name but one of the things that we want but the one hand we have a hundred\nThe only came in ... when they want to quickly when the dog was real or not\nAnd the ... and I'm a I'm a ... King I'm connecting America is a lot of the mysteries ... well give me change soon I'll look don't another day in ... west\n... plays against bill\nWhite is bigger than we are to blame one ... research and the way that they don't need you\nKnow the ... I set my case in point in time\nTo bring back the culture in the middle of the ... as you may not be idle ... than we think we don't get ...\nOn the not too far from the ... you must be honest and gives the guard at the same time served I remember you know and I blessed the expanding now we have to\nDo Monday evening or a ...\nA day if you do now the\nTerrorists that was used to do to San Diego and they are so few where no one is way beyond the ballgame and now they do a search on but that may be due to pay\nA lot of that I live\nIn ... ah\nNo we have taken a\nToll\nAs\n\nSome of\nThe ... ... a barrel\nBomb bomb bomb bomb bomb bomb\nBomb bomb\nBomb thrower\n... da da da\nDa da da\nDa da da\nDa da\nDa da da da da da da da\nDa da da da da\nDa da da da da da\nDa da da da\nDa\n\n\nDa da da da da da\nDa da da\nDa da\nDa da da\nDa da da\nDa\nDa da da\nDa da da da da da\nDa da da da da da\nDa da da\n\nDa da da da da\nDa\nDa da da da di\n... ... ...\n\nAnd\n...\nAnd ... and\n...\nBy the way we read about a man and ... ... ...\nYou know I ...\nThe\nWay the ... you know a lot of\nThe\nNATO man a\nMan in\nA low\nA I'm a\nBig help out and\n\nBuy a\nGun on that as a\nAnd M. and ... every day and it is and it's a day\nAnd\nAll that and uh oh and they\nAnd they asked you to a ... or maybe ... maybe\nA\n... a young\nMan and\nOne of the Trade Center on the survey\nAnd mom who married a\nMan a man thing and a\nA a a\nA a a A N and\nA half a day and\nA and a lot and uh\n\nAnd ... de de de de de de guy\nWinter long solid snake [noise] but the first question at\nAll [noise] like [noise] for me and told\nMe that was nice talking to me [noise] a recall\nOf listening to the world [noise] there's always the older people that\nThat whole [noise] thing I Would just say quickly creation and I'm also\nA a lot of the colonel was\nProbably a lot of people\nAre actually are all over the last twenty thirty ... told his address actual why why and how he told them that [noise] that this\nIs a little girl who was also a wake up and actually [noise] [noise] you\nKnow we all get along better than when times and I'm here with her mom but at the moment for a ... a man that the way he remembered the\nReagan rather than just the the line when you are\nA new\nGreen on blue\nNote a\nLoan on you know my mom around for a long time ago now I Know my mom on them and how about the next guy on on a\nDay or so and I read a lot of running out of the guys who we are\nI'm I'm a I'm a I'm a I'm a I'm On the na na na na na na na na na na na na na na na na na na na na na\nNa na na na na na na na na na na na na na na na na na na na na na na na na na na na na na na na na na na na na na na na na\nNa na na na\nNa na na\nNa na na na na na na I'm I'm a moment in time they really out there every day and that's why when you ... around in my mind I mean I don't know\nWhat it is I Am from I'm not saying\nI run around the world while I'm a\nI'm a I'm a long way or another around a long long long long time ago I was\nGoing on under a new\nA\nNew\nJersey [noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise] [noise] [noise]\n\n\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n\nYou noticed your child when they want for the first time it's easy for you to notice what their favorite foods are\nYou remember exactly when they said hello in your native language you notice when they do well in school and even what friends they hang out with yet one scene you may not have noticed is that they may have already had their first drink of alcohol\nNearly one third of use begins drinking before the age of Thirteen when children start\nDrinking early the or six times more likely to have alcohol problem when they're adults\nHave a conversation with your children about under age drinking to learn more about under age drinking prevention please call eight hundred seven\nTo nine six six eight to ... visit to speak with them dog is a a mate you say ... good luck to you by the U.S department of health and Human Services in the ad council\n\nAh na\nNa\nNa na na\nAre listening to kill you why I made a point one K. you why\nAnd\nYou are listening to K. U. I. eighty eight point one ...\nAnd and K. U. Y. I. L. P. upper ... eighty nine point one half and project of the Hopi foundation streaming online at K. U. I. I. dot net your Native American public radio station\nThat following is provided through the partnership between K. you why I Will pre radio and K n AU Arizona Public radio\n[noise]\nAh [noise]\n\nAre supposed to be above the political brain so how will this affect the Supreme Court that story this afternoon on all things considered from NPR News a\nComing up this Sunday is the Flagstaff community market\n\nA book called me a ... ... ... ... or ... ... ... ... I mean I'm ...\n\nWell three and a half your product that's twenty fourteen sandwiches include Philly cheese fried chicken ...\n\nOr ...\nYou know any point three Grand Canyon chain H U eighty nine point three Prescott screaming at ... dot org service of northern Arizona university at two o'clock\nAnd I had a broken leg religion or have they fight Myra was up for that fight though five years later she returned to the same spot called an enormous wave and wrote it all the way to a world record but first she had to convince Guinness to create a new category for women surfers\nOn his first anniversary of me to that and other stories of unbreakable women today on the world [noise]\n\n\nIt's the b._b._c. news hello I'm Jonathan eyes on the U.S Senate has decided to limit debate on\nWhether it's a concern President Trump's nominee for the U.S Supreme Court Brett Kavanaugh all\nThis means if I could now type places on the Saturday the Democratic minority prevented from extending discussions indefinitely\nSeveral key senators are still waiting for him but the Republican Susan Collins has told the Senate she does not believe the accusations against the capital a strong enough to prevent his confirmation from Washington has outcomes from those cameo Donahue\nOff the street posters of an hour on her feet Susan Collins and now she would be supporting the nomination of Brett cabinets removing one of the biggest single hospitals his confirmation\nWhich is just to be put to a vote tomorrow evening ms Collins says the allegations that must be free for standard where they were more likely to be true on Seoul's she insisted ...\nKevin us could last the thoughts on that basis she defended his record as said he was a centrist confined to many Democrats\nReceived a judge cementing a conservative majority on the phone with\nThe unemployment right in the United states has fallen to three point seven percent it's nice to have open any five decades from New York can give us some reports\nSeptember actually record eight straight year of jobs game making their the strongest us labor market and a generation\nI Know the overall number of jobs created was not that many economists had been expecting that was probably the result of hurricane flying like hit the east coast early in the night off has an chance elevated the unemployment rate and actually the jobs are probably also showed that this tight labor market hasn't translated\nInto significant have I ...\nA cold in the U.S I think in Chicago who's convicted of white police officer\nAnd lead to a black teenager and twenty fourteen Jason Van Dyke shot spike one McDonald's sixteen times in a case that sparked outrage he claimed he had feared for his life but video released by coal to show like one McDonald walking away from the police officers on the scene and Zach now faces decades including\nThe winners of this year's Nobel Peace prize has highlighted its significance to women suffering sexual violence around the world the Congolese kind of colleges and it's been quite a on the Iraqi and see the activists not here we're not we're giving the award for that fight against right as a weapon of war\nDumped the tennis ball quickie has created thousands of rape victims at his hospital in eastern Congo\nOr time doing that kind of do we ... if I was look these women who are ... who are you a question for me in war time of doing\nFriends that had been here most of them are just for like the friends that can stand up again in fact to fight for their rights for ... like I'm just testified\nAudio morass became a Rights Act out after being enslaved and like by the Islamic state group well do you use from the BBC\nThe police chief in Mozambique and ... says Ninety people are being killed and maybe Seventy injured since an Islamist groups launched an insurgency last year more than a thousand houses are being\nSet on fire the group al Shabaab operates in the north of the country close to the towns in and bought a restaurant Faile says many three hundred suspected Islamist have been detained\nPolice in France are investigating the disappearance of the president of the international police organization into how the Chinese national among whom way is concerned but the board of the flight from France to China last month he was ... reports\nIn Hong Kong the south China Morning post newspaper has reported that this man was taken away by the Chinese authorities what his plane landed and that he's the object of an unspecified investigation\nIn from the interior ministry said it was puzzles and worried by Mr bangs disappears and it was clear that his wife would complain the previous the receiving press via social media and the ... the ... became the president is that I was a very senior figure in China's public security ministry\nBut his rise to prominence came under the aegis of a now disgraced ministers huge I'm Ken\nWho and tried to Fifteen was given a life sentence for corruption the speculation that the youth faction in charge\nOf the security ministry and Beijing may want to see him humble\nThe crown prince of Saudi Arabia Mohammed bin Salman has said he's willing to allow the Turkish with artists to enter the kingdom's conflicts in Istanbul and that sets for missing Saudi journalist to mount a show me a prominent critic of the Saudi Government is not being seen since entering the building on Tuesday\nIn the middle of the mass migration crisis season is winning and government has announced an increase in hospital costs on the creation of a new migration police force\nThe vice president did not explain why a new force was needed the price of the possible it has to increase to around sixty two dollars at the black market right I've got two million people have left on his way not in recent years\nIt has to increase to around six to to do as a black market right as a two million people have left Venezuela in recent years escaping severe economic crisis BBC News more\nFor the world comes from legal zoom dot com offering a network of independent attorneys in tax professionals who can provide the advice needed to get through the daily grind of owning a business more as legal assume dot com slash world\n\nMy marker woman and you're with the world good to have\nYou here today and it's been a year now since the New York times published its first article exposing sexual assault allegations against Harvey Weinstein in a year since those and other revelations galvanized the me too movement here in the U. S. inspiring women and some men all over the globe to break their silence about sexual harassment\nAnd assault of course that also brought down a long list of powerful men but the games for me to have seen fragile Iowa\nTimes case in point the debate around Supreme Court nominee Brett Kavanaugh and the sexual assault allegations against him another case in point the\nRise of ... as a front runner in Brazil's presidential election this Sunday is a former military officer whose notorious for making sexist remarks reporter Julia\nIoffe uni is in Sao paolo\nMe too movement has come to Brazil but he has only affected part of\nThe nation so we had a huge protest on several Brazilian CDs last Saturday of women who are opposing valuables for an idle and everything that he spent four but the protests was at least in some follow where\nI attended it was made up mostly of last meeting women and upper class\nThere was some political diversity\nBut still there is no way of right we female supporters who don't care about what is going on regarding the me too movement do state that the things that he has said about women about eligibility to voters are black voters and there are still willing to support him\nHi my name is Suzanne and I listen to ... in San Francisco if I could name the opposite for the next Nobel Prize in literature as a pain in author has ... was it was on the islands of Martinique\nHis work captures the diversity of experience on the island um and I think people by the defendants have is slate people and colonizer is indentured servants and others his writing for the science and I love from our people now without it thanks bye\nHi this is happening is that I listen to the world on casing the devil you and I believe hurricane America needs to get the prize is nominated several times already and his mixture of surreal fiction and\nVery interesting cared for it and the way he leaves and the weather is amazing and so I Believe he said but thank you\nMy name is Scott Simon and Evan spring there was constantly and my wife lowers Ryman shoes as written over Fifteen novels and the wonderful writer on the voter writers in the world\nSo did you hear the Nobel Committee some great thoughts they're an Scott's nominating his wife writer lowest crime and for literature Nobel thanks to all of you for your suggestions on whom you like to see winning a Nobel Prize for literature if you miss the name or want to see more nominations you can find them at the world dot O. R. G.\n[noise]\n\n[noise] [noise]\nGo ahead we learn more about the winners of this year's Nobel Peace prize you know with the world\nYou're listening to the world on Kenyan a Jew Arizona Public radio your source for NPR News insult good afternoon it's two twenty\nFunding for a new comes from the new owners or starlight books on ... street in downtown Flagstaff featuring the Italian designed classics total a male and to the lamps from are too many lighting more product offerings listed on starlight books Facebook page\n\nFrom Arizona Public radio in Flagstaff I'm you're all just born mostly sunny and seasonally\nCool today we call a cool temperatures in the mountain regions only in the sixties I don't really warm down a lower elevations with temperatures\nIn the low mid seventies today forecast I capture sixty three for Flagstaff paid Seventy five Prescott Seventy three show a sixty seven came in Seventy eight increasing wind and clouds Saturday\nA cold and wet storm system's Saturday Night through Sunday\nI market\nHe's saying wind and clouds Saturday a cold and wet storm system's Saturday Night three Sunday\nI Marco warm and this is the world keeps the Amazon off limits agriculture or drop it down for farming and cattle that's pretty much been the stark choice for decades and little by little the Amazon and other tropical forests around the world\nHave been losing that battle but saving those bars is crucial to protecting the world's climate and that's why some activists are pushing a new approach the preservation here's reporter Sam eating with the last part of our series this week on the Amazon climate tipping point\nFor decades most of the million small farmers who migrated to the Amazon basin from other parts of Brazil knew how to do one thing clear the forests and raise cattle and Carlos and dreading moved here to monster Grosso with his family ten years ago had different plans\n... ... he says is sixty\nAcre plot ordering pristine Amazon rain forest had been cleared by the previous settling for our cattle ranch\nWhen it becomes so degraded that the top soil had oh washed into the river turning the pasture to stand on ... arrives with an approach notice agro forestry he went to work restoring soil he planted five thousand peach Palm Springs hearts of palm\nAlong with coffee tea trees and dozens of varieties of fruits and vegetables [noise] today much of his land is for us the gas and the transformation has broken the usual destructive cycle of costs plant\nGrace in a band and in the Amazon ... is proud of what he's accomplished but he says his decision to embrace this more sustainable model was purely economic\nI Will not give it to the topic ... what is a good ... he had his peach palms alone or netting him more than three times what do you make with cows and he says it's an income that will only grow as this plot matures they could have scaled down to ... an yet and the funny yeah I'm supporting my family ...\nAnd helping capture carbon or name the anti restoring that\nEnvironmental service is crucial for decades the Amazon has sucked up a huge portion of the carbon dioxide pollution that we're pumping into the atmosphere around the world without the Amazon climate change would be even worse than it\nAlready is but there's growing evidence that his development eats away at the forest is losing its ability to capture CEO to so and ... story is part of a broader new approach to preserving the Amazon\nThe third way is an attempt to see all economic alternative for the Muslim based on the biological assets of the forest\nCarlos ... is Brazil's leading climatologist he says the conservation movement is failing to save the Amazon and he says efforts to persuade industries like agriculture logging in mining to find greener ways of doing business are also failing and booming global beef and soy markets are too big an incentive for landowners\nTo resist the drive to clear new land\nIt's very difficult for police law enforcement agents to fight that\nNobody fears more than half of the Amazon could be lost by twenty fifty and that would do more than just cut into the region's ability to capture global carbon pollution he says it would turn to region into a massive source of carbon\nEssentially locking the planet onto a path of run away global warming that's why he's pushing the third way to try to save the forest by making standing trees more valuable than cleared land it's an idea that's starting to catch on\n[noise]\nOut of four hundred square mile indigenous territory in Moscow grocer the chief of the ... tribe rings a brass bound to announce a community meeting with Palestinian he's an economist who runs a project called ... of the forest it works with a ... and others to build a stronger market for the Brazil nuts that grow wild in the forest\nFires that thing in the rye for only ... ...\nIf we want to save the Amazon says we need to invest in the value chain and the work of the people who have been helping to keep this for standing up from Ole um I mean names [noise] it's a lot of ... I mean a lot in Redmond money worries one of those people he remembers tagging\nAlong with that to collect Brazil nuts without any child ... veil\nOf money and that's why I like back then he says we gathered on just to eat or get out there and that's yeah a lot of school they also have some of the south\nHe says it's not the middleman often cheated and now by selling communities project they're getting up to ten times the price they used to get money wise says that's brought big changes to the village\nVoice ...\nToday he says everyone who works with the Brazil not has managed to improve their house they also buy motorbikes stoves things like that so it's a definite advantage\nYou ... if [noise] an advantage\nPaolo newness is trying to leverage scaling up an industry that could save this for us from the encroaching agricultural\nFor fear [noise] Brazil nuts\nNunez buys from the indigenous groups end up here at a state of the art Brazil not factory called ... it's owned by a cooperative of small farmers near jury not to gross lines of women crack files my hands before machines process them into energy bars in oil for cosmetics\nAnd say hey custody it kills you stand up for last\nNunez says when you take a key low of Brazil nuts from the forest and process it into products like oil that has twenty times the value that value that states here in the local economy and that doesn't just change people's pocketbooks it changes their minds as ancient now\nKnow than some ice and they were by lose or any of those those are his property is president from\nPakistan and she says everyone involved in the project wants to plant more trees not cut them down they're seeing that this business is working at apple of course there are big challenges one is just the simple problem of raising capital backers of this third wearing\nLike Carlos Nebraska banks aren't interested in financing the sustainable use of the forest\nBecause all of your lofty goal by us against us than any force economy\nNobody says there are already big successes\nLooking ... he says the tiny purple Amazonian berry this quickly become an almost two billion dollar a year industry but even easier credit won't be enough to help the third way economy go toe to toe against the huge global forces driving rising demand for meat grain and Tambor\nThat's one reason nine major U.S foundation this fall pledged to invest nearly half a billion dollars in sustainable land use an indigenous rights programs in the world\nTo women and their stories and to be honest I was shattered a shattered and I think those we\nThere I knew that if our movement are were white moving to commit ourselves a completely and forever to what was going on in the Congo we went to the spread of that kind of violence\nIn armed conflict and in war and so that began are working and profound relationship production Maguire which was going on for twelve years\n... events where you've been to a lot of places around the world where you witnessed violence against women Ciudad Juarez Mexico or Afghanistan where women were instilled are oppressed by the Taliban um have you ever met a man like a Dr Denis ... prior to your trip to Congo\nI haven't met one prior\nAnd I have my own sense I mean I I really do believe he's almost like um the new the man who um [noise] you know he's a man of enormous grace\nIsn't that the radiant man he comes from a he's a pastor and he's also fear and he's also relentless\nI mean I remember sitting with him when he wants to talk to me about how he can't\nSleep at night ... what would happen if they can take a daughter and how the stories a woman after woman after woman the desecration of their bodies is going in and better than they are being and this has\n... can you understand that if women are destroyed if their bodies are destroyed their beings and ... we had no future as humanity\nIs there one story you can share about Dr ... and how he intervened and changed a woman's believe that she was ruined forever that her life was over\n[noise] well\nI remember on at the beginning of a city joy or sanctuary and revolutionary center in Colorado where women transform their pain power and there was a young woman who was standing talking about what she had been through and\nHe said to her um you know when we're when you're inside your mother's rural or you don't know what your future will be\nAnd ... trying to re this place will be like that to you when you enter share\nYou will be able to go through a process where you transform what is going inside you I mean will come out of it for a new woman and the woman just began to wheat and she could almost taste that future and I think you know I have witnessed Dr ... for example in Crawford and for the joy\nOf sex ed classes where he teaches women on not only to know there's a giant as and to know how ... is more the protective China's but he actually asked them to draw their China's so they are\nNot afraid of them and so they know their bodies and so they aren't embarrassed by their body so they're not in shame for that terrible things are not allowed to happen in the dark he is so great and and I have to say he's face oh much\nCriticism and often comes in and out attack for really raking when tradition and breaking with patriarchy and breaking with those values that suppress women\nUm I I Would just love to hear your thoughts finally on on this particular day about me too movement which is a today's a year to the day from the news about Harvey Weinstein and of course Brett Kavanaugh on the news and now these a Nobel Peace prize is what strikes you about me to a year on\nI think we're seeing two things going on in the world right now we're seeing a rise and sticking out and the raking Ford women telling their stories speaking their truths which we weren't many many years to make happen but what what was simultaneously thing it's an incredible pushback\nFrom the patriarch we're seeing a display of male\nMasculine toxicity and ... and I I really don't believe that women the genie is out of the bottle\nWomen are not going to go back now\nWe are too far for word on whether whether Brett Kavanaugh get in or not we're going to see when the rising now and women demanding that the time of sexual violence is over and hopefully it will be many men who take\nLead from Dr ... and ... with us and devote their lives and whole heartedly\nTo ending sexual violence as women do\n[noise] that was playwright events or who's been working with Nobel Peace prize winner Dr Denis\n... in Congo for more than a decade the other peace prize winner nudge a moron won't keep quiet either\nShe belongs to the Christian Yazidi minority in northern Iraq rod was Twenty one when she was abducted by ISIS militants in twenty fourteen they attacked her village and kill people who refuse to convert to Islam including her mother and six of her brother's mirage\nWas taken to muzzle and kept as a sex slave the first time she tried to escape she was caught she almost given up hope that she would ever get away but she did one day when her doctor left the house mirage described your escape to the BBC in twenty sixteen\nShe told me I was just going to be ... and I've been in then I called out how I'm not from family with no connection to ISIS less hair I asked him for help I told them that my brother would get some whatever they wanted in return\nThe family told them rod that they didn't support ISIS and we try to help her get away\nWith on the bottom and the guy should I Know how much lining I'm not a ... they gave me all the help they could they gave me a blackout by a and an Islamic ID and then they took me to the border\nI'm at now do you um are four years ago just the day after\nThe day and then they took me to the border I met ... four years ago just the day after she managed to skate [noise] um and ...\nThat BBC's Middle East correspondent methods that kind of odd\nEvents to as a small village to meet her and he was the first time that these are going to listen to women that was captured by ISIS and killed that we really hadn't got any idea that's what's going on\nAnd what is happening from these women and then when I met her she was located very pay I told her that we can do a decent turvy on ... but she insisted that no she wants to show her face because\nShe wants to hold board\nHere that what is happening to these women\nSo I don't want to dwell on her captivity but it seems like an important moment in her life from which a lot of her activism has them in the four years since so can you just described some of what she told you about what you went through all in ISIS captivity [noise]\nIt's awfully hard for her to describe because it was just\nThat they asked her ... she started to tell us how horrifying laws the place that they catch them ISIS quieter kept him and for days they haven't got anything to eat [noise] they had been sexually abused\nBrutally beaten some of them and she's so many of her friends and families were killed by ISIS and it was horrifying and she was crying she she cried and she'll be honest I cried behind the camera because he was very difficult to really send all these pain\nSo aside from the traumatic experience what else did you learn about Nadia in that time you spent with her and twenty fourteen\n[noise] she looked quite strong and I could see that house she won't really fight against what happened to her and I could see that because she knows the bond that insist that that she wants to show\nHer face she didn't caught the interview she bought calling but she was too strongly eating ... are very strong points out that well he's going to happen\nTo the community after these has because she must telling that these won't won't heal easily\n[noise] so what has been kind of like the main part of her fight against sexual violence in the last four years sheep all\nAs very deep hole too many other UCD women after her cocaine game and you and many other than and started to tell\nWhat has happened to them and they found that the college that they can fight because is eating community about as many close very conservative and\nTeams that as far as the topic to talk about these things but not beyond is run off those dots broke the capital city and they\nWere there you see the women who as a result of sexual violence who had children with ISIS fighters there are many on how are those children accepted by the rest of the CD community\nThat is that the dynamo many people don't want to bring it out that this is another pain that not only women for their families are going through now I met a family that this police it's completely different than\nThat I met she wanted to have\nThat choice she was telling me that it wasn't these traumas fault that he's ... ISIS fighters\nBut at the other side she had three children from her ... husband and they are refusing that child\n[noise] ... ah just to sum up when you look at ... more odd story the story of being a victim escaping and now after four years of hard work getting recognized as one of the most prestigious owners in the world what is your take away\nWorld is a co production of the b._b._c. World Service P. R. I. N. W. GBH supported by the PR right ambassador council pushed owners include marker each dude Hoffman and the role of family fun by PR\nRight twenty twenty donors including the group or Family Foundation investing in global reporting in perspective the technique Jones Family fund wind and Bruce statements John and Caroline Valentine's and fat she kind of hurt in memory of poll Connelly by the national endowment for the arts\nAnd by the Ford Foundation and by the W. GBH fund for environmental reporting for donors include the ... foundation for the protection of the virus\n... ... a W GBH fund for environmental reporting who's donors include the grandson foundation for the protection of the environment supporting a cooperative approach to solving are critical environmental problems while we still can and by the ... family fund\nOur public radio international\n\nTonight to fifth annual Flagstaff star party continues the free three days extravaganza was telescope viewing night's sky orientations\nAnd fascinating presentations to promote the communities interest in astronomy that's five to ten tonight and tomorrow night of buffalo park find more information at Flagstaff star party dot org funding\n\nYou are listening to key why ... eighty eight point one FM streaming online to kill you why I thought Mitt and key Y. L. P. upper ... eighty nine point one FM projects of the Hopi foundation [noise]\n\n\n\nOoh [noise]\n[noise]\n\n\n[noise]\n\n\nAttention K. you why I listeners the Arizona department of transportation states that the state highway eighty nine is closed north and south bond between ... and that you basically junction turned off due to wash out\nThe Arizona department of transportation estimates that that ... and about a hundred and Ninety miles to motorists trip on interstate forty state route eighty seven state route to sixty four and us one sixty update\nClosure multiple days expected on us eighty nine north of Flagstaff severe flooding has turned roadway between Cameroon and us one sixty\nThe Arizona department of transportation is working to reopen a section of us eighty nine severed by flooding about sixty miles north of Flagstaff between state route sixty four and Kamron and us one sixty\nWith us eighty nine expected to remain\nClosed for multiple days due to the wash off between my posts for sixty seven and four eighty one on the Navajo reservation\nMotorists heading to page Juba CD and other destinations north of camera and can take interstate forty east from Flagstaff two state route eighty seven\nAt Winslow then head north to state route to sixty four North West to us one sixty into by city and west to us eighty nine\nFor those traveling from points south on us eighty nine the closure doesn't affect access to Grand Canyon national parks east insurance be a s are sixty four\nDirector of the Hopi department of transportation said border is using state routes do the tribe's reservation\nShould watch for pedestrians and for a local traffic including buses and also should be aware that some stretches have sharp bend and the great\nAgain this is an update of closure of multiple days expected on us eighty nine north of Flagstaff, Arizona department of transportation is working to reopen a section of us eighty nine ... by flooding about sixty miles north of Flagstaff between state route sixty four and camera in\nAn us one sixty with us eighty nine expected to remain closed for multiple days due to the wash up between my posts for sixty seven and four eighty one on the Navajo Nation\nMotorists heading to page Juba city and other destinations north of camera and can take interstate forty east from Flagstaff two state route eighty seven at Winslow\nThen head north to stay route to sixty four North West to us one sixty into but city and west to us eighty nine\nFor those traveling from point south on us eighty nine the closure doesn't affect access to Grand Canyon national park east insurance via s are sixty four director of the Hopi department of transportation said motorists using state routes through the tribe's reservation\nShould watch for pedestrians and for local traffic\nIncluding buses and also should be aware that some stretches have ... bands and steep gray\nAnd that is your update on the closure\nOf us eighty nine north of Flagstaff once again you're tuning into ... eighty eight point one of ...\nOut the upper ... eighty nine point one FM also streaming online at the Y. I. dot net your Native American public radio station high\n... the this is rose or John from key given made of dance theater I Am from the great nation and\nI'm the artistic director of cars you made in dance theater where from way far\nAway from here in Alberta, Canada and you are listening to KU why eighty eight point one that's streaming online at KU Y. dot net even Native American public radio station a project of the whole the foundation thank you [noise]\n\n\n\n\n\n\n\n[noise]\n\n[laughter]\n[noise]\n[noise]\n\n[noise]\n\n[noise] [laughter] [noise]\n\n[noise]\n\n\n\n\n[noise] [noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise] [noise]\n[noise] [noise]\n\n\n\n[noise] [noise]\n\n\n[noise]\n[noise]\n\n\n[laughter]\n[noise] [laughter]\n[noise] [noise]\n\n\n\n[laughter] [noise]\n[laughter]\n[noise] [noise] [noise]\n\n\n\n[laughter]\n[noise]\n[laughter]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise] [noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\nOh my God whoa whoa\n\nWhoa whoa\n\nWhoa whoa whoa\n\nWhoa whoa [laughter]\n\n[noise] [noise] [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAnd then four eighty one on the Navajo Nation\nMotorists heading to page Cuba city and other destinations north of cameras can take interstate forty ... from ... to state route eighty seven at Winslow\nThen head north to state route to sixty four\nNorth West to us one sixty into the city and with us eighty nine\nOr does traveling from point a on us eighty nine the closure doesn't affect access to Grand Canyon national park each insurance be our that's our sixty or director of the Hopi department of transportation said motorists using the route through the tribe's reservation\nShould watch for pedestrians and for local tropic\nIncluding buses and also should be aware that some stretches\nOf shark band and the great and that is your update on the closure of us eighty nine north of like stop once again you're tuning into why aren't eighty eight point one of ... out the upper ... eighty nine point one of them\nAlso dreaming online at the Y. I. dot net your Native American public radio station\nIs usually seen as humongous traffic so Jesse Hardman would all that ... the wily trees back Marco hall just Perkins at least Carter\nYou're like well I Hope you're on a you know that you're never going to marry a radio station okay\nWhen I grow granted [noise]\n\n\n\n[laughter]\n\n[noise] [noise] [laughter]\n[noise] oh [noise]\n[laughter]\n[noise] [laughter]\n[noise]\n\n[laughter]\n\n[noise] [laughter]\n[noise]\n\n\n\n\n\n\n\nIs that the ... at about a hundred and Ninety miles to motorists trip on interstate forty state route eighty seven state route to sixty four and us one sixty update closure multiple days expected on us eighty nine north up Flagstaff\nThere'll be flooding has tried roadway between Cameroon and us one sixty\nThe Arizona department of transportation is working to reopen a section of us eighty nine celebrated by flooding about sixty miles north of Flagstaff between state route sixty four and Kamron and us one sixty\nWith us eighty nine expected to remain closed for multiple days due to the wash out between my post for sixty seven and four eighty one on the Navajo reservation\nMotorists heading to page Yuba City and other destinations north the camera and can take interstate forty east from Flagstaff two state route eighty seven at Winslow\nThen head north to state route to sixty four North West to us one sixty into by city and west to us eighty nine\nFor those traveling from points out on us eighty nine the closure doesn't affect\nAccess to the Grand Canyon national park east insurance be a s are sixty four director of the Hopi department of transportation that border is using state routes through the tribe's reservation\nShouldn't watch for pedestrians and for a local traffic including busters and also should be aware that some stretches have sharp bend and the great\nAgain this is an update of closure multiple days expected on us eighty nine north of Flagstaff, Arizona department of transportation is working to reopen a section of us eighty nine\nDesert by flooding about sixty miles north of Flagstaff between state route sixty four and camera in\nAn us one sixty with us eighty nine expected to remain closed for multiple days due to the wash up between my post for sixty seven and four eighty one on the Navajo Nation\nMotorists heading to page Cuba's city and other destinations north of camera and can take interstate forty east from Flagstaff do stay route eighty seven at Winslow\nThen head north to state route to sixty four North West to us one sixty into by city and west to us eighty nine\nOr those traveling from points out on us eighty nine the closure doesn't affect access to Grand Canyon national park east insurance B. R. S. are sixty four\nDirector of the Hopi department of transportation said motorists using state route through the tribe's reservation should watch for pedestrians and for local traffic\nIncluding buses and also should be aware that some stretches have sharp bans and steep gray and that is your update on the closure\nOf us eighty nine north of Flagstaff once again you're tuning into ... eighty eight point when the ...\nOut the upper ... eighty nine point one FM also streaming online at K. U. L. I. I. dot net your Native American public radio station\nThis is James ... and you are listening to change who I eighty eight point one FM Hopi radio or Native American public radio station check it out\n[noise]\n\n\n\n\n\n\n\n\n[noise] [noise]\n[noise]\n\n[noise]\n\n\n\n\nOh\n[noise] oh la la la la la la la la la la la la la la la [noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\nOh I'm\nIn a third of them were members of your long term and\nSure enough man named owned you germane mama is wrong I hear them say at the\nSame time zone where [noise]\nOh well no no\nNo not on top\nOf the long\nRun [noise]\nVia s are sixty four direct you have to hope the department of transportation said motorists using state route through the tribe's reservation should watch for pedestrians and for local traffic\nIncluding buses and also should be aware that some stretches have sharp bands and steep grades\nAnd that is your update on the closure of us eighty nine north of Flagstaff once again you're tuning into ... why I eighty eight point one man K. you why I asked the upper ... eighty nine point when FM also streaming online at K. E. Y. I.\nDot net your Native American public radio station\nFor a state\nLaw allows them to you and you're listening to KU why I Hope the radio streaming online at KU why high got no\n... than excited to be here talking about possibilities of working with her opinion Navajo people might want to shoot I just sometimes we face during water\nWhy they transmit to rate than than high strength community working with the man to restore the watersheds in some things that you've done for generations and in the face of global\nWarming climate change each one of the most important things to do\nAnd we can ... for having been invited ... K. you why high Hopi radio\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise] [noise]\n\n\n\n[noise]\nMm\n\nMm\n\n\n[noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise] ... ...\n... ...\n\n...\n...\nOh man\nThat you're right\n[noise] [noise]\nMm yeah [noise] oh man well see\nMy ... year old man\n...\n...\n...\n... ... ... all\nOf them but as I tell you\nWhen you re Mm\n\nNo sorry for 'em banned them ...\n\n...\n\n... ... ... ...\n\n...\n... loan\nYeah\nMm\nI\nHope that the flag gang law when you see when mom\nReminder of just saying to\nCall them ...\nDo not food in\nThe right way and that's very sad and I\nYou know ... years apart are the\nMore than ... going up to\n...\n...\nOh Britain left for\nThis but I didn't even\n\nTell our sons that are not ... I'm Sorry I'm\n... I'm Sorry ... ... ... ...\n... ...\nThe church mean ...\nMm\n[noise]\nMm [noise] [noise]\n[noise] for the French Jane\n\n... shut up but none of them in\nA home run up all upset by by the\nNumber one of my ... my my son\n[noise]\nNo no no no my my ... ...\n... let's see\nI'm Still pretty quick enough to know what is your son\n... ...\nThat is\nUntil\nYou began in\n... ... ...\n... then you know ... ... ...\n... in\nThat way I tell you how did you find your\nAh it may not want a\nA boy yeah well I run\nThe mom yeah God did not want a ...\nA night ah gee that I'm ... I'm going to do a good yeah me too I ah I gave up on me why I'm a little yet they are a lot\nYeah I'm not a big issue that are that again they got you good for a while you know on a day do\nThe right yeah yeah the guy here um\nI like ah jeeze God the moon as a year ... I ah gee that guy being but uh yeah well\nYou know I'm I'm a I'm not I'm Glad they do a lot of parents they do not\nWant a a well yeah well my own island the mom yet did not want a [noise] I\nAh June that you buy 'em well I'm a voter yet yeah I'm I'm a nice ah gee that's why I'm a ... yeah\nYeah I'm I'm a well yeah well my my big do\nLove the ah by\nYou know a lot of time on the ... by um [noise] I\nLike a gene that a lot on right now or in a one on one ah gee the uh um but yeah oh yeah now what\nI'm I'm\nGoing to a a a holiday mom mom yet they're also money but they um do you have a bad boy game about long and so on so long but the [noise]\nThe next song we are going to sing you know I mean I'm I'm yeah mine translated by the Reverend gene thief right\nOn\nThe line name Tom mom we know many um ...\nNot a ... line ya know\nI'm a I'm a real um you're a ...\nA than a no I'm not ... up with a well\n...\n... um yeah um but then my son a bonding umm yum\nOh I'm yeah I'm ... I'm I'm not a\nNormal a mom I'm going I'm a man a guy I'm a\nMan Don na da yeah I'm doing good and I said I'm\nA I'm a I'm mommy I'm I'm no no no no no no no I'm going to uh the\nOnly game that hung on for a\nTreat me mom mom good thing going on about a one ... to ...\nOh my God\nOh man I'm a lion you know\nI Know a tube and say I'm I'm a mom so\nI'm I'm\nA dog can ah you know a ... a young needing\nA I'm a I'm I'm yeah I'm a non ... no\n... I'm holding\nOn yeah bad on the game being I'm yeah I'm On the bank Mike ... a bonding non down\nOh I'm yeah I'm I'm a ... a night yeah I'm\n\nAn accent that we're going are saying is that the ... the message out that crime is the power of God we're Corinthian chapter one verse Eighteen\n\n... yeah chapter one verse Eighteen ...\n... ... ...\nRules\nNo mine mine said dad my dad and third grade and my dog ran a night\nWell they may go bad saying that well our man died she had\nA number on a map I better known than I Am not a bird and ...\nAnd I may I say my time and time I am a stay at home that day maybe [noise] [noise] wow\nMan crying and grabbing guy John ... on the treaty\nI'm gay and you may be buried down and not be reading\nBut I just thought that there was no such thing as a matter of time on our way\nBack in time the Miami the fine dining and now I Am at the house\nAnd then\nWell my son and I just try and show in Missouri\nAnd they laugh and cry and cry me any good or bad for men agreed chairs men has meant\nThat they're proud of the night and a better than nine hundred dollars and\n... and ... and my thing I get paid by the time and now I got that big of a sudden\nYou're getting\nA job or some green can be a fun call a ... I'm Sorry I Can't live in a long time and I can do\nAnd that meant that there is some nights and that that is now my my round them in\nThe last day by day I maintain my son now\nI Am happy ... birthday\nNext song we're going to saying yes Hi adult Christ but I always thought they provided by I told them all the time\nThe ...\n... ... ... ... ... ...", "year": "2018", "show_name": "no_show", "city": "Hotevilla", "day": "05"}