{"month": "10", "state": "AZ", "station": "KUYI", "content": "Is lying on a ... man\nI still think of the union miles a\nDay in order to make too much to say goodbye\nTo buy new\nI Am and he\n...\nHe he knew the uh the the shows\nOn down a lot of all I have that\n\nRight yeah and ... ...\n\nFor a car or a\nA\n\nYou are listening to pay you why I ... the law ADA only one and then gave you why I L P upper ... eighty nine one one\nAnd rod jacked up the OB foundation dreaming on line that came you why I got that your Native American public radio station the following it ... to the partnership between\nA mule why I ... the radio and\n... and a new Arizona Public radio [noise]\n\n\n\nUh\n\n[noise]\n\n\n\n\nUh uh\n\nUh both the oh my oh\nBy the news in Washington I'm jak sure the man accused of killing a lemon with Cuba has been true of life synagogue in Pittsburgh Saturday made his first court appearance today whether Bowers arraigned on twenty nine federal charges including party truly couldn't carry the death penalty appreciation definitely essays\nAmateur national pattern during a five minute ... back into my car right\n... ... ... from my from my religion much of a ... I Wonder if I have actually I'm a\nLittle\nFaster and trying to get extra money I enjoy firepower campaign that I have my ...\nMy name's Robyn ... Trump or travel or ... or in the White House was running Sarah Sanders center says the president has ties to the Jewish community and wants to sample the families of victims I Am a survivor\nHad arranged hotter suburbs ... shows the jurors swimming I Try to smile travel ... her around some of\nThem is responsible for the president's plan trip we lose our liberal Jewish group a letter saying he was not welcoming totally jobs white nationalism although rabbi ... percent of the shootings took place and the president will be talking about consumers all over the last one who was one piece incomes are rising if they're so stubborn nearly a year\nCongresswoman says consumer spending was up for a test a one percent last run shows why why\nMotor vehicles will spend more money on health care after opening higher stock prices on us today with the Dow Jones industrial average pushing\nNearly ... ... and the Sims already requested option after ... has more tariffs on Chinese goods serve our about three and a within two points that won the Iowa\nRange made on China were trying to trade with China I might be trying to about ... just aren't just tied around some points\nTo uncover in part of the last movie I was supporting companies like rolling his heart trouble giants like Amazon which found ... percent of the road truck sought Saddam five percent for our family first time for a lot of the lines\nOf territory so we're ... percent ... five mile\nHigh shows what are we going to do some work ... hours down trying for five twenty seven twenty four thousand four thirty in June the NASDAQ hundreds sixteen\nPoints which will be five hundred drop Seventeen but this is NPR\nBy language handlers Belgium continues or caused the ... of the country's main airports throughout those straight day because I when I upon their luggage gambling Bush trying to make cars working conditions other services such major airlines as Brian ...\nBritish Airways dozens of why some of the Brussels Airport cancer today Germans are coming to terms with angry Merkel's decision was settled down after French German Chancellor expires but that's not in so twenty twenty runs ... because\nOf political it harms are pushing for the room sort\nOf don't ask don't smoke around them term for the most\nProfound that some time to time you know she wouldn't have been\nProven real national one friend who was on the original ...\nFound that I chose to further than it's ever going to cost ... ... I'm sure I was shocked that members of ... for all of\nA sudden it was wise enough that I wanted to say which has already got a lot of water\nThe show who saw ... noticed the water's ... not that unusual in the city which has already done a lot of water cooler fishers that showed how the others are lining up or Seventy\nPercent of the strange to me was flooded by waters or what they do have mentioned about some of it that's often ... high winds ocean water and some of the world I'm jak sure beyond his\nName as ... I mean it shows how can the circus children whose to eat out often times ... about what she said I don't know how how are you\nA newsroom rumors and\nWe're in a shower and\n\n[noise]\n\n\n\n\n\nWho are listening in on this Monday ... watching at our room and handle and\nIsrael counter to [noise] a version of July and I've learned to do with them and go through a nine hole MSN forever higher than the ...\nWork until I die now ... regime right by new drivers you know and then I was raised with Enron trash or on the phone for our show on\n\nOh a young man and the ... river for this run for twenty nine to show you a teen British ...\nAn ice ... ... ... a ... minute ...\nEleven miles per hour [noise] moved up here for about ... miles an hour I\nDon't know they might go out and I play with Hollywood around thirty dollars when five to eight miles per hour rule I run ...\nMiles per hour class when I leave that job and I\nTurned to a crowded around thirty eight times the brand dream eight miles per hour and ... and the weather is Monday I drove they're turning nine times in a scheme\nFor mine but nation under whether women don't assume that because when\nI met are up to the other day and they're coming up next when a ... a dry humor that have been turning into a new ah [noise]\nAh [noise] ...\nAnd ...\nAnd a camera on the line now after ... well [noise]\nI don't know why they continue to\nHave a an actor and when I\nGot down to the gym or that I Know that when we came here\n\nAnd do we know why but [laughter] ... and I'm trying to be\nAn issue I mean I'm a I'm an actor when she\nWas one of our family and understand that but to get a phone\nCall right on the machine and when I\nWhen I came back and do whatever I Want to live in a real issue in a way that Dr phil [laughter]\n\n[laughter] [noise] as soon as the one we tried to God and [noise] and [noise]\n\nI don't I don't know and and uh [laughter] I\nHave a run in the navy\nAnd her and\nHer name is Adam ... drum shop\n[laughter] I haven't done\nThat [laughter]\nI Am I [laughter]\nTo a dramatic ...\nEarly ... which to\nMe to show some clue\nShut down the road from me\nAnd my aunt and she was on on the show to them and getting to know I Will be there and [noise]\nUm [noise] I I I I\nAm today and sharing and higher and higher and higher [laughter] which\nI Love to work for a long time to time where\nThere are a lot of times a week [laughter]\nHow bad I have a hobby I guess I'm a avid [laughter] um\nYeah I Am too hot [laughter] it's\nLike oh no I'm\nA I'm On a game [noise] around God\nMade [noise] and\n[laughter] and a\nMagician or gay and I'm not sure that there is no way that there are rumors that\nCould be at a time or it could come\nIn and out I can I Do I have to go and how has that had a cat [laughter]\nAnd I guess\nI can get [noise] you can't do\nIt over [laughter] and they'll do it on our land [laughter] you know\nAnd [laughter] ... [laughter]\nAnd it was\nA good [noise]\nUm I don't know that um [noise] about a week so\nAnd my room and I am June ... new album he wouldn't have to go in and around the world I\nDon't want to try to bring\nA writer and\nA half an hour from our bureau in reading and [noise] I don't know what I feel like I'm\nLike oh come on\nMan [noise] I mean and and\nUh [laughter] um\n[noise] and ah [noise]\nBut\nI mean I'm I'm about\nAn hour and a growing and Iron Man around a wheel chair either way you know a guy on him and another round\nDied friday at him and they come in and\nThen when they come from God and my ... and I don't know I [noise] I\nI mean [laughter]\nI Know because a lot of the game\nShow or a nice little brown and black or whatever and even after all that [noise]\n\nI mean I think when they look a match or in the name of the\nTime and then I went to college and I am not a family member or a dad and I had a rabbit\nAnd my mom and dad [noise] and I think you could imagine God and\nI knew I was sure most of\nThem on you know because you know no one was a piece [laughter] you know my own or\n[noise] [noise] [noise]\nAnd raining\nAnd the guy on time with him and I'm going on and on that and they're not engine and\nThat was kind of have to remember that [noise]\nMany\nMan man I don't know what that is a man\nThat\nI met her in this kind of the reason that I ended up doing things around there was a member of\nA way to get out and I'm going to get you down and I\nDon't know where I\nMet a man\nYeah yeah men men and women\nWho\nAre not a bad name and this guy and I I\nDon't know I I and I\nWas a God or not\nI mean this guy and him and I knew that he has\nThis kind of job do you know and this guy in\nThe room just God when you're in\n\nA a [noise] a a a God do you\nHave a much and [noise] and\nSo we were in ... we ran for a short one of the show so you know who was who\nRan over a\nNew mom mom and my father was a man I'm drawing a primer on\nThe moon grown up with a guy who is a woman or a mom\nAnd her you know a ... a ...\nA ... a\nA narrative on who\nThe prime or [noise] or a man on\nThe ground and the men and women who uh\nWho am I [noise] I just knew a\nLot of a new new [noise] a good time to write\nA\nFarmer's land around noon and night and you know [noise] uh\nMm\n\nMm Mm\n\n\n\n\n\n[noise]\n\nYou are listening to K. you I I don't know eighty eight like one as\nAn K. U. I. L. P. a permanent but be eighty nine point one egg and projects that there will be Sunday evening on mine it came to you I I don't\nKnow but ... ... ... ... ... ... ... ... ... ... ...\nOr ... or ...\n\n\nI haven't been done now I don't get\nMy field but I don't know what ... what did you know no I don't mind but take time to really tell them that they were born and I know that we should\nGo up and actually one Bahrain I Can't tell she no better time to really draw the line with us today I\nDon't know I don't know why\nDon't you know and I don't know what they they\nDon't choose on well why don't you know nowhere around along the way I don't know why don't you\nKnow you may know him in all no no no no no no no no don't run away from me\nI Know I'm ... but\nDo we do every day with her baby busy day on John that not that can't be you know yeah that is they combine the two you don't know I don't think\nWe could get you guys man that um you know and not dial I'm a big no no no but you can do a bomb didn't know but\nThen I don't know why don't you know I don't know what they found out she was on the way\nShe well she no no no no no no no no no no no\nNo no no no no no no no no way\nThe way up on me [noise]\n[noise] [noise] [noise]\nNo no\nNo no\nNo no no no no no no no no no no well I'm On my\nWay I don't know what may be I don't\nKnow not knowing what's going on blown away when [noise]\n\nNo no she may not long ago I went down there and\nThen the man leading a\nLoan no no no no no street\nOn ... and I mean ...\nNa na na na na na\nNa na na na na\nNa na na na na na na na\nNa na\nNa na na na na na na na na\nNa na na\nNa na na na na na na na na na\nNa na na na na na na\nNa na na na na na\nNa na na na\nNa na na na na na na\nNa na na na na na na na\nNa\n\nAnd\nNa na\nNa\nNa na na na\nNa na na na na na na\nNa na na na na na na\nNa na na na na na\nNa na na na na na ... an hour and a\nA\n... ... ... ... ...\nIt's hard to turn now that we can again in the ... will get on board one of the name ...\n...\nFor the er the burn mom and my son he would have a right to be better and I are bringing in\nA\nQuiet they know our brains are bringing a William\n... wake up right well\n\n[noise]\n\nMm Mm Mm Mm Mm Mm Mm Mm Mm oh no no no no no no no no no no no no ... on\n... ... ... S C I F ...\n... ... Mm Mm Mm Mm Mm Mm I married a man\nOn the ground you know the minute they sound so na na na na\nNa na na na na na na na na\nNo one no ... no no no no no the is the one thing I didn't know ... or ... or you know ...\n... Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm\nMm no no no no no no no no no no no no not a ... a ... you know ... ... ... ... ... ... ... you know and\nMm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm\nMm no na na na na na\nNa na na na na na na na na na\nNa na na na na na na na and then not a mom and then when they don't care about the ... the low but then when we mom then you're in a new law no\nMm Mm Mm Mm no I don't know man Mm Mm Mm Mm I Am but when\nI when I I\nI think I'm up to ... but I Can't Kelly not even being made in Greenland with my mind but behind my back\nAnd I made in agreement with my mind about behind my back I kept on my finger and and\n[noise] and I\nJumped into the whole I couldn't tail and ... says I never made me promise never ever do that again and again\n[noise] while I argue in my life if you go to me [noise] and [noise]\nMy dog rescue me and in a rush Iraqi time with mine [noise] I kept falling in and out I mean I won't go snatch of places in just within reach anything I Want as long\nAs I don't want anything to you know\n[noise] so here I Am asking where I Am and why are you know to waiting layer after layer to me and the night writing in the yard towards the light [noise]\nBut the light never say to them and they need me everything that I can give us [noise]\n[noise] [noise]\n[noise]\nSettle down burn their own light years I mean it can be black shrimp you get some of the matter what is happening I Know there's ladder waiting room and all I after you get there\n[noise]\n\n\n[noise]\nBut I Can't tell a on [noise] not even me [noise] I made an agreement with me on my back again my fingers crossed a\n[noise]\n[noise] [noise] [noise]\n[noise] [noise]\n\n\nOr\nWhat [noise] [noise]\n[noise]\n[noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise] [noise] [noise]\n\nHe he knew\nAnd or\nA ... na na\nNa na na\nNa\nNa na na na na na na\nWe're [noise]\n[noise]\n[noise]\nNo no no\nFor an hour or [laughter] [noise]\n[noise]\n[noise]\n[noise]\n\n[laughter] [noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\nOh okay oh\nAnd I'm\nA law and\nOrder or he\nI don't know\nFor\nA minute or so [noise]\nHi this is sue happen I'm a volunteer here and a guy from the herd museum in Benin you're listening to K. you why I an eight point one Afghan streaming online at K. you why I dont know\nNative American public radio station a project of the hoping foundation [noise]\n\n\nThe hoping foundation [noise]\n\n\n\nOr maybe more wind June Brazil or a live girl or are you know what is your insurer blue above ... there were people who\nAre on\nThe back of a shame on my own and I thought he did when\nI drive a maritime part in the world I Know that they were either way it's going to do\nFor her job in the weather was surely going all around the world or at the same thing\nOr another we're looking for more\nThan I Am and I was a\nLong row alone on a normal member of the\nTown I was you know\n[noise] but I Can't do bullet shaped May Day job my job so thank God it was very\nMuch I'm going to be a new girl shame ... strong I broke both range for cancer and I live in the rye or\nShe's going to say I don't think I ever get a murder or rape or where the around her daughter's changing journal\nOr they go now to get a they will say is true\nOr for an hour later\nOh you're oh you're oh you're a fan of\nThe other night uh\nShe'll be wait laying by me and my God that the ban on the individual that's why and then and then my [noise]\n\n[noise] oh [noise] [noise]\nBut I got an hour by hour and a guy and lonely dollars now\nTo me somehow I knew I and I\nKnew I ended up and read the novel I\nBuy my shirt and a lot and I'm not\nSure\nHow involved in that I don't know I just try and figure\nRest or\nPsychological biological warfare to cook with racism Asian\nOr was\nThat a lot of it was a mess [noise]\n\n\n\n[noise]\n\nDo you are listening to KU I hold fella eighty eight point one F. N. N. K. U. A. I. L. P. upper ... eighty nine point when FM projects of the Hopi foundation streaming online at K. U. I. I. dot net your Native American public radio station\nHi my name is ... home I Would like to show all the kids happy chicken cheating and be safe puppy guys get lots of candy and everything but don't eat too much have a they checked out then happy Halloween\nBut yet they eat them stop ... Nguyen wave the un behind my too but not yet no one in the whole ... ... yeah to Jonah but Meek and yet ... get that but beyond that the deal\nOn my radio station KU Y. I. eighty eight point one egg and hope you radiate out there I was getting on line ... K. E. Y. I. dot net\n... I'm so say nine I'm the I'm to he said but now ... ate them yet so see ... ... ... talk among ... that that ugly it ... it ... them over she'll say\nI Wish me it ... them not to eat them yes make them over there and like you can so say ... I'm On the you know ... I asked her\nTo do to damage the temperature\nSneakers normally hear some of what was the one the one who's been saying no\nNo no bearing on any to begin to California and they need to you right after national needed [noise] [noise]\n\nThis is national native News I'm Antonio Gonzalez the mayor of South Dakota second largest city wants to replace an aging Indian Health service facility the current hospital is one of several in the region not meeting standards of care South Dakota public broadcasting Gary ... reports\nRapid City mayor Steve Eleanor is working with the ... river ... she tried to seek approval for a new interest hospital Susannah hospital is the current Indian Health facility for the Oreo\nOfficials have closed in hospitals emergency when\nAdditionally Susannah hospital has failed to beat standards of care mandated by the federal Centers for Medicare and Medicaid services\nOn gold layer illiterate tribal leaders have is to bring the new facility to a more convenient location near interstate Ninety and closer to bus routes housing and recruitment opportunities for students from western Dakota tear\nThe tribes passed resolutions earlier this year to approve the effort for a new hospital\nOfficials also authorized the tribal health for demanded sushi in hospital and the short term and a new hospital when built\nThat move is covered by the Indian self determination and education assistance at the tribal\nHealth board would handle day to day operations while keeping federal funding due to historical treaty obligations for national lady news uh derailing bold\nSocial justice issues facing Alaska Native people is the focus of the gathering this week and you know the first Alaskans Institute is hosting the event with community members\nAdvocates elders and tribal leaders Monday's\nDiscussion included honoring and protecting native women two recent cases have impacted the native community\nThat ten year old girl and costs of you went missing and was later found dead end in Anchorage judges sentence demand to know jail time after being charged with assaulting a woman Lincoln high to Indian tribes president Richard Peterson says\nThe Alaska Native community has the power to make change and one step is going to the polls\nWere sick and tired of it right or you sick and tired of it [noise] ah you know we can do to change your\nVote the Brad judges their elected\nThat power isn't us turn to auto after we have to vote when you have to be the solution because they're not we have to put people in there that represent all of us\nThe two cases have renewed calls for improvement and law enforcement the justice system and public safety across the state the social justice summit wraps up Tuesday\nMeanwhile officials have charged a forty one year old man with kidnapping murder an sexual abuse of the ten year old girl and costs of beer\nPeter Wilson faces charges in connection with her death Alaska Public media reports a funeral was held over the weekend for Ashley Johnson bar or hundreds of people show their support for her family\nThe Bears Ears case will continue in Washington DC a federal judge ruled Monday cases involving Bears Ears and the grand staircase Escalante national monument will remain there in us district court in addition the interior\nDepartment must alert try at least forty eight hours before any ground disturbing activities take place on disputed land a number of tribes are fighting to protect Bears Ears in Utah from development the cases filed against the Trump Administration\nRevoke Andrew replacement of the national monuments five tribes are among those to hold the area sacred including your tribes the Navajo Nation ... and the Hopi trial attorneys with the Native American rights and say they're eager to move forward with the case and claimed the removal of protection of Bears Ears is illegal\nI'm Antonia Gonzales\n[noise]\nNews is produced and birth national NATO boy studios by caught a fraud us corporations funded by the deli loggers provider of Indian law commissioned by the corporation for public broadcasting with support from the public radio satellite system [noise] support by ... are they are present\nConnects people make fools program helps can sort of personal resources and turtles issues that matter most to individuals families and communities for a A R P your dog or for Native Americans are protected by domestic violence the straw\nHorse native helpline offers peer to peer support every resource it's safe confidential and toll free I think for for southern program support for the national indigenous women's resource center [noise]\n\nNative voice on the Native American radio network\n[noise]\nThis is Native American calling on your host parakeet would when it first witness or September music makers take the stage this summer in chunk to Arizona's rock canyon it was sort of like someone read\nTara deep would when it first witness or September music makers take the stage this summer in ... Arizona is rock canyon it was sort of like someone recharge the crowds battery\nTheir elders and long skirts Wayne sweethearts dancing together and young people well they were jumping up and down and he kicked up a lot of emotions and if you want to see some of their check out our Twitter feed at one eight hundred nine nine native now they're seen\nAs something that might sound familiar something you've seen in your own community when a blues band starts to play especially if there's someone from your own\nWork and just in tribal nation today we'll hear from the black ... blues band so special it is to see crowds react like this when they let their music travel over\nIn through all the music lovers also\nBe sharing the sound of their album smoking up a storm with some sugar shorts and when we do we also hope you'll call in and visit with us sharing the details of how their music fits into the sound you like to surround yourself with ten folks who share or\nAsk a question on air will get a copy of their CD we're ready to hear from you at one eight hundred nine nine six to eight for eight and right now it is our pleasure to bring in a couple of the black horse blues band members they joined us today from California\nLike to go ahead and say hello to Randy peers from the Pomona nation or the ... century it to be specific Randy welcome to native America calling\nIt certainly is you know what we've got more for you hang tight we have more\n\nOn it was very don't manage to live on the menu tonight\nPains are some of the traditional food they need people for generations and they're still making a phrase that nice talking with us for the next Native American calling you a taste of flavor from smoking\n[noise]\nSupport by New Mexico community capital bringing the tools for success to emerging Native American enterprises including programs and financial literacy and business basics with microbes lending available to early stage native owned businesses information out and eat on\nOur program dot org or five oh five nine\nTwo four to eight to zero New Mexico community capital helping make the impossible possible\n[noise] [noise]\n[noise]\n\n[noise]\n\n[noise] [noise] [noise]\n\n\nSo what do you think about the blues Native American calling is connecting you to\nToday tells on their toll free line at morning hundred nine nine six\nTo eight for eight and we will connect you with our gifted ... the black corners blues band let's go ahead and do some of that right now we're going to say Hi to Cindy in Santa Fe New Mexico listening in on king went in and you've got your back and go hey your thoughts on these blues\nHome on on that sounds rather ...\nIt does and Cindy what is it about the blues that pulled you in\nA well known just only going to fame and law on the law harmonic phone everything looked on going on on the far\nRight well thanks for sharing that with a Cindy there in Santa Fe let's go now to Farmington New Mexico and Israel or the Gilbert who's listening in on keys UT thank you for giving occurring Gilbert you're on here\nThank you for getting a little bit of um you know working and all those lights green alone when I got my reminds me of my\nVoice but now they're all grown up you know even if I were to go\nMight that reminds me of my voice but now they're all grown up you know like when you go I don't listen to a plane to anymore\nBut um [noise] well it sounds good so I thought I'd read you a ring I could get one that's about it from a nap [laughter]\nWell let's hear from them in ... thanks again for given to ring\nAnd again you can join us wanting to hundred and Ninety six to eight for eight looks like we got eight CDs last plenty of time to to talk with the band give us a ring phone lines are open one eight hundred Ninety six\nTo eight for Pete with us today are two members of the group Mr Randy Peters as well as Rick Perry ... and a gentleman um\nThey're you know one of your callers Gilbert says it sounds like from his kids or even a band from home I'm any thoughts for our callers go head Randy\nOh thank you very much uh I like Bill feedback\nAs larvae on the radio station here I'm like Rick said we're we're we are a road worst critic and you can hear you you know [laughter]\nSo are there ... all in order to be well I'm a buddy with nuclear or um\nRainy went when ... when you when Rick say things like that that just means that you you just want to make the one's better and better and better that's good stuff [noise] um let's connect you with another caller got Alan in St teen Nebraska listening in Allen thank you for giving us a ring go ahead you're connected to black orange blues band\nNo go ahead Alan\nI'm missing the first time artist better than there are some pretty good I like to hear more of them\nAre right you know what Alan you can have that you can have that right now let's go ahead and give you some more black horse blues band or we're going to go to their some nothing to lose right here on Native American calling these are our September music makers\n[noise]\n\n[noise]\n[noise] [noise] [noise]\n[noise] [noise] [laughter] [noise] [laughter]\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n\n[noise] [noise] [noise] [noise]\n[noise]\n[noise]\n\nMm\n[noise]\n\nThat's nothing to lose by the black corners blues band you can connect directly with them right here at one eight hundred nine Ninety six to eight for eight let's go now to another caller we're going to say Hi to Lisa in ... California I'm sitting in\nOn cagey and way Lisa thanks for calling go ahead you're on the air\nThank you thank you for taking my call\n'em I'm embarrassed to say that I Lived in this area which is right here in the shower area here in while I'm On a California sorts quiet just south of that and I have never heard of the stand and I loved it and I'd like to give a shout out to be buried deal here in la\nAnd thank you so much\nWell thank you for calling in Lisa and a Rick there you go I'm a you know expanding listeners and fans and and even up the road them a folks in go ahead any thoughts for calling me so\nYou know we ... thank you for what was the blues and loving abandoned the bank you for the for listening for the first time in the black course blues we've actually been well law about four or five times out the old hotel real established now again we haven't been there since it's been reestablished\nThat's our Twitter handles to\nSupport by New Mexico community capital bringing the tools for success to emerging Native American\nEnterprises including programs in financial literacy and business basics with micro lending available to early stage native owned\nBusinesses information at N. E. I. R. program dot org four five oh five nine two four to eight to zero New Mexico community capital helping make the impossible possible\n[noise]\n\n\n\n\nUh\nI'm\nA\nHome [noise]\nThanks for joining in here to Native American calling them ... went from its not apply blow angering reserved space for some native born today and we had the black ... blues band with us in on\nMe to band with roots in the ... nation and if you'd like to talk directly to them during the conversation by calling\nOne eight hundred my nine six to\nEight forty eight and when you are one of the first ten people to do so you'll get a copy of their album courtesy of her than we are ready for your calls dialing again one eight hundred Ninety six to eight for eight and it looks like a\nWe've got a couple of more CDs last ah with us today is Rick perish from the ...\nIndians also with us is Randy Peters from the ... nation and both of them are joining us today from California and they are to the members\nOf the black horse booze gentlemen thank you for being with us and the folks they want to talk to you know let's try Martin again who is in Warwick Rhode Island thank you for giving us a ring go ahead you're on here\nThanks for taking my call and good morning good afternoon [noise] from rainy Rhode Island and the first of all I'm listening or in a chair W direct view of the answers that streaming\nI have been for the past three days twenty four hours a day that just absolutely loves distribution that's number one number two thank you to the black horse and in many other beers for\nKeeping us old truck drivers a week for forty years on the road you gotta stretch chest\nI Love your music where you go from one extreme to another and just go with you know you guys are just\nTrickle people's souls as your as your role large makes ... everybody is I really appreciate that\nAnd uh on are you going to hang on ... street crawl in about ... I Would say she for K. R. VW for being there and they showed very entertaining neutral by ...\nBy right Martin Rhode Island's got their ears on how 'bout you one eight hundred nine nine native thanks for giving us a ring and Rick him any thoughts were connecting you to Rhode Island and in mountain likes what he's hearing\nYeah just taking a gambler appreciate it ... a a a C R B music can you hear music and it's a I've never heard that before where just nails right into another and go into another but thank you thank you thank you for that and a key try him at\nThat so um but yeah we're\nHappy to be up in about doing that thing is we're going to get a kick this coming weekend and are actually\nTwo of them this coming weekend so we can get a practicing rehearsal in and ah you know to to be a all ears and what have you and uh [noise] but again thank you very much often when I\nI think for that we're going to go now to Gerald in Albuquerque New Mexico tuned in today and keen William Gerald thanks for calling go ahead you're connected\nHello I'm a spent many years in Memphis, Tennessee and I wanted to congratulate yours yours um southern\nRock who sounds out your house and um I was running or you got most of your influence as far although you have some very original sounds being Native American\nAnd argue plane even more cars around the house Santa Fe area okay he's big polluters festivals going on around here\nRe Gerald Randy has a little bit\nAround here I write Gerald Randy tells a little bit about some of the influences\nOn my watch like your job we should um oh so am I wrong which will back like I'm sure you've read 'em\nYeah forty waters Charlie winters oh well I'm a ... on ... and those are my influences you know like that\nOr even the newer like it was going to church or ... or John mail\nI'm even some of the same with the\nOlder ones that are better off you know you can walk or um [noise] there's just so many so many are in use artist out there um it's hard to remember what his name right you know [laughter]\nWhat were you on your list is is pretty good in in you know something to do often he's put some of the music that you're hearing today right next to some of their ... influence them and it's it's a fun thing to do I do it often I'm thinking for your call\nAnd Randy we hear when we go through this album we hear different styles of blues and tell me a little bit about I'm a sampling\nThese different styles instead of just sticking to one\nOr the style blues go well yeah that's that'd be G asking\nYeah you know we got a little bit of that Memphis feel and we have some a blues coming to us from time to feel like it's a little Chicago we in you know you guys go all over with what your brain and then sometimes some bands they just stick to one style um you know why why so diverse\nAll this but that's our that's our style that's like one of them were like we're diverse like we we we like a\nChicago so you know are like ... he's a Chicago blues ... Williams is Mr all night\nAnd um and and hand forties late into like a little bit of Walter I'm Johnny winters\nEither way on a Jimi Hendrix\nUm we all yoga oh so you know I'm just base where but I Do but it's hard to top themselves or to play to slide I'm Sorry ...\nYou are we like to show me up when we try to change up you know it was probably ...\n...\n... well there's a there's a lot of variety there and you know what let's get some more of that sound or we're going to go ahead and hear the songs sound about this is by the black horse blues band\n[noise]\n\n[noise] [noise] so\nNiagara casino dot com and all ticket master locations [noise] support\nFor this program provided by the University of Tulsa College of law offering a one hundred percent online master's degree program Indian law that's the green can move your career forward and help you work is actively in Indian country deadline for spring applications December first\nInfo that law dot U. Tulsa dot E. D. U. slash andme J. I. L.\n[noise] America hauling produce and burn national NATO studios in Albuquerque New Mexico\n... broadcasts rations native nonprofit media organization funding is provided by the corporation for public broadcasting support from the public radio satellite service music is by reading Michael David NATO ally the Native American radio network\n[noise]\nCan't say I think he can get it\n[noise]\nHey kids that I think they can do to protect yourself from Africa and gangs that\nWhy just one way and so long enough to see the ABC seven to ... times and things that they can't lie in the show there or a law now in the ...\nIf you don't sell a town at the right LA you might even say at home or you say you don't get I\nRemember these easy it is to try to get out the family and I thank\nYou are listening to tell you why hotel uh eighty eight point one FM and K. U. I. L. P. upper among Coby eighty nine point one FM projects so the Hopi foundation screaming on line a KU Y. dot net your Native American public radio station\nBut Merkel May of ... ... ... ... ... ... ... ... ... ...\nThat's my mother this has to be our girls met up with other people do that on on the other group it was we sure do you like your toes help now there is a little hello I started\nOut as you are listening to the way I can agree more [noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n... [noise] ... [noise] and I [noise] and then I go down\n[noise]\nThey're on line you know all we're doing\nAnd [noise]\n\n[noise]\nOh I'm On the line I buy [noise] a bar you know job [noise]\nAnd all I Know I don't buy you go [noise]\n\n\n[noise]\nI don't know I don't know um [noise] well [noise] ... [noise]\nI don't mean to hurt your you know ... and my\n[noise] [noise] [noise]\n\nMan\nI'm old Bob now more broadly are most dry [noise] how loud boom town [noise]\nI don't um I go there and ah\n[noise]\n[noise]\n\n[noise]\nOh wow oh I'm\nSorry I don't know I\nKnow I'm\n\n...\nI'm ...\nAnd Chinese and that's one thing I\n\nWant to ...\nI used to tease\nOut found two eyes in general the little blue [noise]\nAnd you know I\nJust don't know how to [noise]\n... well you know\nAnd not have done much\n\nMore than a [noise]\n\nLittle blue [noise]\nAnd [noise]\nAnd I we we\nTry to you when\nYou're\nA high [noise] John [noise]\n\nYeah\nHe\nHe\nMade them\n[noise]\nAnd and\nAnd and I I mean\nThere [noise] [noise]\n[noise] and and uh [noise]\n\nAnd\n\n\nKnow [noise]\n\nI don't mean\nTo\nMe and\nShe read on\nThe [noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n[noise] the\n... the well I Know the real ...\nNot that\nThe the\n... the real ...\nNa na na na na na na na na na na na\n\nUsually are we going to\nMove a lot lot is made a hobby ...\n\nNa na na na na na na na na na man ...\n...\n...\n... oh my\n... year for how\nLong ... ... ... a ...\n\n... ... a ...\nNa na na na na\n\nNa\nNa na\n\nNa na na na na na\n\n\nNa na na\n\nEveryone is a new mom no hero wherever I\nGo oh\nNah nah\n\nNah no no well all\n\nRight well there you go alone no mom I'm really be a no\nNo no no no no\n\nNo no no no no\nBaby named women's team you know they will you be willing to eat you to\nDo all the time you got a little bit of the brain you know the need to see the problem which is really an issue we live in\nThe\nJournal by is leaving we\nSaid well says when the rules are ... just\nBeing [noise] you know [noise]\nAnd [noise] you know do do\nDo you know the\nName of the mainstream she and she wants to know what to me she ... she ate and ate at me saying well you would let us\nSee [noise] and I know when you're just shows and da da da da da da da da da da da da da da\nDa da da da da da\nDa da\nDa da da da da da da da da da da na ...\nMe too [laughter]\n\n\n[noise] I I don't know [noise]\nUm [noise]\n\n\n[noise]\n\n[noise] [noise]\n\nUh-huh [noise] with each other and\nThat [noise]\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n[noise]\n\nDo they do for the better you know in America and\nThey were just\nReally [noise] and then they ended\nUp in the in\nThe\nDay and then enter\n\n\nTheir gender today [noise]\n[noise]\n[noise] and then\nThey go to a man by\nThe\nTime [noise] but they might\nDo that in my\n... really [noise] making better and better at this time and time\nFor them and they\nDon't bring it over and over and over and then the other day and time\nTo leave and then in\n\n... in the middle of the ... um someone will\nBoom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom\nFor the people the people who do you see these people\nWho were boom boom boom boom boom boom boom of ... people\n[noise]\n[noise] [noise] oh I don't know who\nHe was on the on the one who told me to be she will\nBe a little too much of the people in the\nMiddle East [noise]\n\n[noise] no no come on the phone call\n[noise] I'm from I'm from [noise]\n[laughter] [noise] [laughter] [noise]\n[laughter] [noise]\n[laughter] [noise]\n[laughter] [noise] [laughter] [noise]\n\n\n\nSo you know for the phone number ... ... ...\n... ... ... you know on the news\n[laughter] [noise]\n[laughter] [noise]\n[laughter] ... ...\n\n\n\n\n\n\nOh no no ... well ...\nLet's play\n\nA clip\n\nOf one of the\nNo\nAnd [noise] you know you got me me me\nMe you know you go you\nKnow it's really\nGood you know not your we done a\nLot of the Lone Ranger loans and loan and [noise]\n\nNo no no no no\nNo [noise]\n\nNo wonder\n... here\n[noise] oh\nOh I\nSaid no no no no no no no you're\nRight [noise] oh well we\n[laughter] well\nI'm sure\nYou are listening to cater why I've what Bela idiot or one F. M. K. U. Y. L. P. upper ... eighty nine point one FM projects or the Hopi foundation screaming online at ... dot net your Native American public radio station\nDo you why do you like what more could be like that on the net\n[noise]\n\n\n\n\n\n\n\n\n[laughter]\n\n\nUm [laughter] I don't know why not [laughter] when I'm\nWhen I'm I\nI'm a I'm a\nI'm a I'm a I'm a\n[noise]\n\n\n\n\n\n\n\n\n[laughter]\nI don't know why [laughter]\nWhy not [laughter] [laughter] I\nKnow my um I [laughter]\nUm [laughter]\nI Know I'm going on [laughter] [laughter]\nUm\n[noise] [noise] [noise] no\nI mean in a live action by the low but he you know but he ...\nJune ... June I'm never going to lose the new\n\n\nLaw do you\n\nDo you do you lose\n\nYour your age your day to do is\n[noise]\n[noise] yeah [noise] and\nYou know um would be tried you know so you don't ... don't do a lot of fun we never known a\nHey hey good well\n\nHey hey man good luck\n\n\nTo\nYou you can't\nJust do what we did all the way it is the way you\nCan yeah you know\n\nAnd then oh no well we\nKnow the man she either oh man where you from getting in and get\nA high standard and try again later and we\nMay do about it in a way you want the na na na na na na na\nNa na na na na na na na ... [laughter] [laughter] yeah I remember\nRight now and I remember that and um\n[noise] [noise]\nWell well ... ... ... ... ... ... ... or ...\nIn\nOrder to try a wish I didn't know what I didn't know there are no what is the ...\nUh what what did you hear the word I'm Roy yo yo ...\nNo one no no I'm ... years going back to my mom my\nMom a roundabout during my mom my mom about well were there for them from a movie for a long slow where are you still live at home I'm a woman\nRona Rona number one word of mouth or even how much I'm a medical record all\nThe time I'm ... I'm a surgeon Rochelle do they learn how to do well no I'm\nNot real good ... well not well we can share them there were a\n\nNa na na na na na\n\nNa\nNa na na na na we're very\nWell but I Know I've got\nA loud\nYeah well I Know I've got about ... or ... or ... you know a lot of 'em\nOr you know we're not really one of your number\nOne or oh no the ... are you\nKnow I'm no longer a\n...\nOr or yeah we're\nWe're a little world as a but we're we're we're we're we're going to turn around\nAnd we're going to drill for a run and run around and we're already there or if you're around or do you\nWatch the number [noise]\nYeah well I Know we're we're we're we're we're going on and I don't know that much [noise] and I [noise]\nVery rare for Iran\nAnd during the run or do we learn from it yeah [noise] yeah ...\nOr ... [noise]\n\nOh oh no no\n\nNo no no no no no and I wonder what that meant oh no\nNo no no and then also with the [noise]\nThe no no no no longer on both take no money no Boston ... ... ... ... you\nKnow the answer\nIs no ... I was on the line man na na na na na na na na na na na na na na na na na\nAnd everything and all I'm going to open\nAnd I'm I'm mostly a loaded they go when I'm when there's a lot of the matter no ... I'm not really for a national level that I learned early and then the ...\nAnd then\nSo I don't know do I get ... no no no no\nNo I'm trying to buy me a long way na na na na na na na na na I'm Glad\nThat in the\nJob\nAnd you know and then they get along and says no new wildly I don't know what I'm doing\nWell and the men are no longer than I Am a day to day and I know the older\nYou know that Ron Ron Schiller though right\nNow there are no no no no no no\n\nNo no no\nNo no no\n[laughter]\nAnd ... and ... and ... and\n... and ...\nWhich and trash\nShow and I'm Jewish and God and stretch my\nShift and very\nMuch and and and where you're\nWriting and share you know I ... and ...\nAnd ... and ... and ...\nAnd you know ... ...\n... ... ... ... and for you know\nIn Riyadh and go to war\nBut he didn't want to know what I'm saying I Am in a jam one day\nAnd\nHave them you know then they add to this day and the\nMain thing\n\n[noise]\n[noise] [laughter]\n[noise]\nOh oh oh oh oh you're a young you know\nI was a la la la\n\nLa la la la la\n\nLa la la la la la\nLa la is not a lot of there being [noise] my dad and my\nMom or dad about and then they ...\n[noise] my mom about that day was young my young going by young gone now but you\nKnow a young girl non [noise]\nNot a lot going on about that a lot of blue [noise] like I'm not a guy or gal\nI saw it on a la la la la la la la la Brea a club I was going to solve our well how long do you know what they want to do\n[noise]\n[noise]\n[noise]\n[noise] I'm\nNot a lot of the ... [noise] da da\nDa na na na na na na na na na na da da da and uh uh about nine months\nBut I'm not on a la la la la la la la la la la la la la la la la la that I'm a month and then two\nDays there my name's Darren oh it was\nAbout a lot of the day\nAnd gone to young don't mind ... na na na na na na na na na ...\nA lot of a lot of going out and buy low oh about a dial up or down the aisle\nLa la la la la\nLa la\nLa la la la la\n\nLa la la La Guardia\nMy mom's side and then they go oh my name is Daniel ... da\nDa da da da da\nDa da da da da da da\nA lot of\nYoung guys don't do a lot of your goal when the\nYoung a la la la\nLa la\nLa la la la la la la la la la la la\nLa la la la la la la la la la la la la la la la la la la la la la la la la la la la\nLa la la la la la la la la\nLa la la la la la la la la la la la la la la la la la la ...\nWe're not going to be that a lot [laughter]\nHello this is Jane\nI'm from the ... and ... they're going to have now the whole puppy\nAnd I worked down here to be an ethical February Phoenix, Arizona and affiliated with that well but they knew them for and I'm also a belly ate it wasn't the herd near the airport and you're listening to you why I like a big one that Tim\nSo like you I got net your Native American public radio station thank you\nTo be like you said it should be like you say like you say okay we'd like to say\nAbout about a lot on my mind I plan on a five minute by minute by minute by minute\nBy minute fine fine right I Am I'm a\nI'm\nA I'm a I bought my son I run I run a marathon bomber but by\n... by the time in my I'm On the\nBottom but I don't know a lot a lot of time I'm\nOn the news and\nBad I'm not I'm not I'm not by a car and then I don't but I don't know um\n[noise]\nI don't know what's going on for a\nFor a woman who was\nOn the [noise]\nUm [noise] what\nAre they going to have going on in the man\nIn Manhattan [noise]\nBuy\nA home\nOn how do they do and how we can go\nI'm a I'm a\nAh\nI really\nAh [noise]\n\n\n\nAh [noise]\nAh no no no\nI really\nI yeah\n... ...\n... [noise]\nYou are listening to K. you why well below eighty eight white one F. M. N. K. U. I. L. P. upper ... eighty nine point one FM projects do the Hopi foundation streaming online at K. U. Y. R. dot net your Native American public radio station\nIn Rhode Island um I'm I'm I'm\nA I'm a I'm\nA monument and you know a number on and on my home town when\nI heard around well no no I'm not sure\nWhy I was a long way down a little bit older around them and\n[noise]\n[noise] [noise] um [noise]\n\n\nUsually I found a way more than\nI Am Ron na na na na na na na na na na na na na na na na na na\nNa na na na na na da da da da da da\n\n\n\nDa da da\n\nDa da da da da da\nDa da da\n\nNa\n\n\n\nNa na\nNa\nNa na la la la la la la la la la la la la la la la la no no no\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise] one than the B ... ... ... ... ... ... right\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAnd just to remind industry as it to see a\nCar they\n\nNeed from mom to go to the movies [noise]\nAnd then there's [noise]\nI I'm a man and this\n\nIs my I\n\nJust want to\n\nRead a um\n[noise]\nAbout a new moms right ...\nFrom Marilyn gone and they move\n[noise]\nMelancholy [noise]\nMy mom\n[noise]\nUm [noise] [noise] [noise]\n[noise]\n\n[noise] [noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n[noise] well\n\nYeah\nI was going on with that and just\nTry not to but I got to choose K but this time I was like man I mean I have no chance of dying by\nThe the the global bull or [noise] or [noise] or\nDo I know what you would still say that this will not have to be monitored nose\nTo real world now where you will read the the the the to the [noise]\n[noise] [noise] [noise] [noise]\nNow what did you realize you're still at least in prevention I applied to try to put in a strange question for the last time I was watching the Rio\nThan this race Ted\nStevens [noise]\nFor [noise] for [noise] for [noise]\n[noise] [noise]\n[noise] [noise] [noise]\nWhat else are you kidding\nMe yeah\nWe'll see you know ...\n... ... [noise]\n[laughter]\n[noise] [noise] I mean the town next [noise]\n[noise]\n[noise] [noise]\n[noise]\nOh right there you have the gene Marley off the dragon but album and they just hearing the good old days\nFollowed by mood and rainbow in the guy oh so we heard from tribe called grid with electric power well read and cheese\nAnd then we went with the the top ... about that now is a good one right there in the top there is um Braves with three in the road there for you as well with master sparked a blue and right just and move me on\nDown the line and two stars or west Ricky Skaggs\nIs coming up is sixteen biggest hit and we heard from him you walk in crying my heart out over you and I don't care that song by Ricky Skaggs coming up next I got\nA blues boys were you where\nWe are the booze boys black cat blues and old man down near listening to you I Would rather eighty eight point when they're famous K. U. I. L. P. upper meant to be eighty nine point one nets fan projects up the Hopi foundation streaming online at the Y. I. dot net\nYour Native American public radio station hope y'all are enjoying the music mix here we go with the blues boy\n[noise]\n[noise] [noise] [noise]\nUh our our our ... our online\nBanking on line and turn around and you know a lot of stuff going on around\n\nYou know [noise]\n\n[noise] [noise]\n\n[laughter] I'm not a bad guy [noise]\n[laughter] [noise] that are available\nBut very man what a dumb one of those goals but all of a mob one door to her [noise]\n[laughter]\n[noise] [laughter]\n[noise]\n[laughter] [noise]\n\n\n\n\n\n[laughter] [noise] [laughter]\n[noise]\nHow about an hour but those three are you wrote a very good show\nUm around here [laughter]\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n[laughter]\n[noise]\n\n\n\n[laughter]\n[noise]\n\n\nDay [laughter]\n\n[noise] [laughter]\n\n\n\n\n\n\n\n\n\n\n[noise] [noise]\nThis is a layer Austin around the beer and you were listening to K. you why I Hope the radio dreaming on line at K. U. L. I. I. dot net\nAnd we're very excited to be here talking about possibilities of working with no hope the Navajo people on watershed oh I just sometimes we we were storing water one should restoration and\nRegistering communities working with the land to restore the watershed it's something that you are done for generations and in the face of global\nWarming and climate change is one of the most important things we can do and we give way thanks for having been invited this is Kay you why I Hope the radio\nWow why all oh wow wow oh wow oh wow wow wow\nOh so\nAre we bottle you know we all live bullets in ... June and the judge not being on June ... level\nBy the you know when we used to be your ... how can we expect mom no ... I'm not too long to go\nTo really was and how long were you know no one in ...\nYears old and a lot of the ... for me\nThe ball\nJogging near a landline ...\nAnd ... and I handle yeah where's that going around super none no guns turns around and said if you're going to come\nGo to the culture and if you're going to do a ... if you don't go to the lord you\nKnow you're going to do the best shows where they don't go to go and\nLook it up there they go home when the little ... you\nKnow we're All right\nMan ... was was um I'm a\n...\n... [noise]\nI started going cold turkey well at least when I'm In the car and I know I shouldn't do it but it's so hard to stop\nThat's why hide it for myself so I won't be tempted I used to do it all the time I stopped by locking in my glove compartment to my friend used to do it way too much now I turn it off or in the car my solution is simple I just don't do it there are lots of\nWays to stop yourself and others from texting and driving a will you stop tell us stop textile Brecht started work brought you by the national Highway Traffic Safety Administration and the ad council\nMore than two hundred thousand people eat your\nHospital life with the flu American indian seem to be a higher risk of flu complications the flu is spread from person to person through coughing and sneezing and even by touching surface is with the flu virus on them and then touching your nose or Mao\nMost people with the flu will have mild symptoms such as fever cough sore throat runny stuffy nose muscle or body aches headaches and some may even have vomiting diarrhea but this is more common in children pregnant women young children\nThe elderly and those with as my diabetes and heart disease are more likely to have serious complication protect yourself and family from the\nGet vaccinated each year cover your coughs and sneezes wash your hands often and if you are sick stay home to prevent spread of the flu know the facts about flu and by taking care of yourself you're also keeping our community healthy and protected from the fleet\nHello this is that send me all the fire management officer for me I Hope you see closing the barn doors they're not part of the project in this work work I'm with a prevention team ... Richard With the fire prevention team\nVisited so let the other game with the wildland fire prevention team and you are listening to KU why eighty eight point one F. M. O. P. radio\nJust remember only you can prevent wild fires fires\n[noise]\nUm [noise]\n\nThey put a\nMan named love God and\nYou know I haven't done that I'm Glad I'm adding\nJobs I yeah\nI'm Glad to hear me yeah I\nMean the fact that\nThe day that he could na na\nNa\nNa hey yeah does\nHe know I I yeah that is a ... yeah yeah yeah\n[noise] oh no\nMe neither\nMe your papers though and I love you back with my new hobby learn what you would often be your mental 'cause I'm a believer that you bring one so if you love your place than\nMen do and I would love your mom do\nSo was that you love me you'll be like man I Know because I'm\nA firm believer that you wash a toll on your mind and which are prime rhythm and and I mean Coleman Josh I'm On my friends my my ... my legal bond concerns for the first they were wrong [noise]\n[noise]\n[noise]\n\n\n[noise] [noise]\n[noise] no you go to reexamine lab where roads ... thing\nFor me you know\nNa na na na na na na\nNa na understand a new there's nothing new to me was that the ...\nThe ... the the boy and ship but then you'd be losing just washed jeans\n\nAnd then they get around the edges\nNa na na na na na\nNa na na na na na na na na\nNa na na loosing at the school ... me the chance\nTo uh the the mood and you shall\nNow and the ... million in the middle of the man and\nFound them money and then one day [noise] or or na\nNa na na na na na na na na na na na na na\nNa na na na na\nNa na na\nNa\nNa na na na na\nNa na na na na na na na\nNa na na\nNa na na na na\n\nYou are listening to KU why I ... the boy was a man and gave a Y. I. L. P. upper ... could be eighty nine or ... one ...\nProjects up the ... foundation dreaming online at ... dot net your Native American public radio station [noise]\n\n[noise]\nBelow zero [noise] and that was a low low\n... in ah\n[noise] ah no no no\nNo no no no no no no no no no\nI'm a\nLittle [noise] them to a longer no\n[noise] no no no no\nNo I'm On a show Ron\nI'm a I'm a [noise]\n\n\nI'm Alone [noise]\nAnd uh oh no [noise] [noise]\nAh no\nNo no no I'm a\nI'm a I'm a\nPhone number ... around our number one I don't know I don't know no no no no no no\nNo no no\nNo no no no\nNo no no no\nNo no no no no no no no\n\nI haven't got some great and you're really not worth\nIt for that my doctor just stop and\nTry to get you get better but my wife and I don't\nThink the best of all of my very best to try and do they make a trip that I thought well let's try my but if you don't\nHave facts facts wide thing to do when your premiums are about it\nAnd try and write up a coffee shop why don't we just\nHave to pay out the window three\nWind up [noise]\nOh yeah\n[laughter]\nSo\n\nI'm back where they eat and you don't know why would they were trying to put food on the middle of truth in that regard I\nWon't even walk down the mountain dew in Iraq in the ... and sometimes I feel like I'm going to\nTravel to all the problems in my dorm room on the\nSoil that what what what an honor to talk of the show some well he's the one I rely\nOn it\n[laughter]\n\n[laughter]\nYeah I think they may have cameras\nIn the pre that's really what we can do about Iraq and we will we know about a hundred over the course now that I'm thinking oh no no no let's go to war\nAnd I'm going to come and\nGone to trial on trying to do I make friends\nStation project hope the foundation ski\n[noise]\nMan [noise] [noise] [noise]\n\n\n\n\n\n... [noise]\n[noise] [noise]\n\n[noise]\n[noise] [noise]\n... my mom would love to do with real money into the oh no no no no\nNo no no neither do my will come out right in the village and\nLove the you know\nThat's the ... the ... well ... role lowered Raul love the whole you know ... ... ... while the the new grow\nGrow they look for a\nJob a new ... and then go for a job but they ...\nThey ...\nThey were here or there or or\n[noise] [noise] [noise] I don't\nWant to raise you really need those ... ... ... ... ... ... ... ... ...\nOr ...\nOr ... or ... or\n... or ... or more right there you know how low the ... and ...\nOr ... or\nOh\nI see oh a a really well no no no a dollar a\nDay [noise]\n\nNa na\n\nHuh\nHum\nI'm ... ... ... ... ... ... ... ... ... ...\nMade a rewarding and now a low level of the new ... you\n\nKnow by and oh man so de da da da da da da\nDa and bringing arrow down there or a ... ... ... ... ... ... ...\nAnd [noise]\nAnd\n[noise]\nAnd [noise]\nAnd she [noise]\n[noise] [noise]\n[noise]\n[noise] [laughter]\n[noise]\n[laughter] [noise] she just [noise]\n[noise] [noise] [noise]\n[noise]\n\n\n\n[noise] yeah [noise] [noise] [noise]\nAnd [noise] and\nAnd [noise] and [noise]\n\nLaw certain things that are well although although I'm I'm I'm although I'm a la la la la la\nLa la la la is how I don't know by the time or a I used\nTo be in a\nRoom and um I Know [laughter]\n[noise] [noise]\n[noise] [laughter] well ... ... ... ... ... ... and ... and ...\nAnd hour and a\nMan a man and a ...\nNa na\nNa na\n\nNa we ran into a ... or ... I Know I mean why\nWhy\nWhy I Am a and my mom and I'm a young guy\n[noise] on any [noise] um I I Am right now\nAnd ... and then well\nHow old you know and and you have an hour long hours\nAnd so while I'm On a lot and I'm\nGoing to have [noise] I mean [noise] [noise]\n[noise] Mm\n[noise]\n\n\n[noise] [noise] oh no [noise]\n[noise] oh I knew [noise]\nOh I don't know I don't\nKnow nowhere near all were yeah\nAnd I am today and yesterday\nMan [noise]\n\n[noise] and your\nYour your mom and dad\nAnd my home I don't mind\nA [noise] and I [noise]\n\n\n[noise] [noise] oh wait\nOn line [noise]\nAh [noise] ah [noise]\n\n\n\n\nMan [noise]\n\n\n\nAnd [noise]\n[noise] [noise] [noise] ah\n[noise]\nMan and a and hang in\nA way a\nNew one\n\nWay or the\n... ...\nOh I Know a A R o ... o lay lo o either the the way I see\nOh\nOh oh oh no\nNo no ... which is not\nOn a\nOn a new job to do [noise] um\n[noise]\nOh ... days there is no\n\nOne knew still closer than mine you'll only seen the show in a way you know in the new\nOne during the day that the people of the day\nThat\nMeans in la la la la la land phone bank in the middle of my way\nTo live in a little different than a human being in the\nYears go by in [noise] ...\nYou\nKnow there is a little bit of a new\n[noise] both of them\nDon't clutter the sun you only do you live in a little village and no one really\nHave a vested de da da da da da da da da da\nDa\nDa da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da\nAnd when\nYou know\nThey all knew that needle in a whole a whole\nLot of people where\n\nYou are listening to you I I ... eighty eight point one F. M. K. U. I. L. P. upper ... the eighth or ninth place when Afghan projects the Hopi foundation seeming online at K. U. L. I. dot net your Native American public radio station\n[noise] um [noise] um [noise] um\nOh I don't know [noise] I don't go through you know I didn't really road who I'm sure I'm sure I\nDon't know [noise] [noise] [noise] [noise]\n[noise] now\n[noise] and I'm just a fact I'm a I'm a\n... I think you know you did the ...\nAnd ... and na na na na\nNa na na na\nNa\nNa na na na na na\nNa na na\nNa na on and I'm On\n\nThe on the\nGrill them [noise] [noise] [noise]\n[noise] yeah [noise] and\n[noise] now [noise] [noise]\n[noise] [noise]\n...\nWhere you go to war around ... she got to be\nAll\nRight All right\nI got a great day by day and night and day out of line and I'm Renee voters through an average ... de la la la la la de ...\nAnd the number one number on and on and I will only get a oh la la la la la many young people today and so my\nDaughter got to be able to go do well da\nDa da da da da da de da di da\nNa\nNa na na na na na na na\nNa na na na\nNa na na na na la la la la la la la\nYou know again it's done is to Arizona to honor\nRoll and then I got to tell me I Am de da da da da da da da da\nDa da da da da da da da da da da\nDa da da da da de la la la la la la la la but not by day and then I ended up on our\n\nLevel so I'm all\nBy by oh oh [noise] [noise]\nOh my God oh oh\nAnd and and and\nPay me ... ...\nNo dry and ... and a mom or a\nMan\nAnd a ... a man and a\nDog and they say well I'm a stay at home mom or a\nDay and the mom I'm not\nReally changed the law\nAnd order and in in ... ... ...\n[noise]\n[noise] [noise] [noise] Mm [noise]\n[noise]\n\n[noise]\nAnd and and\nAnd the ... ... ... not the guy in the ...\nWell I'm a man named miles a\nDay to day in\nYour ... role in it but I'm I'm a ... ... by man and the bomb bomb\nBomb bomb\nBomb on a\nDay and ... and ...\nAnd ... and ... and ... and\n[noise] [noise]\nI don't\nKnow how to open a new\nLondon [laughter] and I'm working on me and I'm doing and I don't know I'm\nA fan I think that\nUm I don't know what I mean in a while I don't know I mean I don't know yeah\nThe the the thing with uh [noise] I wouldn't know what I don't\nKnow I'm not ... I'm\nA I'm a new show on I don't know the the I don't believe that they would buy\nMy mother who was the mama\nHer mom ... season I\nWill tell you what was your new ideas I'm reminded of one when those are the\nNa na na na\nNa ve and meaning that no one will be much Jay how do we move yeah when I get\nA lot of them ...\nNa na na na na no God no that was a real meaning of my time no one can do and I'm\nNow I'm fine uh do do you know but I don't know I'm\nA I'm a I'm a\nFather a man to them you know we had was um on the line every minute then I'm not\n\nLaw that was a bomb on what oh now I Am\nAnd\nMy mind and ah [noise]\n\n[noise]\nYes [noise]\n[noise] [noise] [noise] the\nDay and you know we're\nNot [noise]\nMy name is Mike and I'm I'm here I\nThought it\nWas a man and\nA year when one F ... na\nNa na na\nDa da da da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da dum by by the Benji along the ... thing but but the dog ... why do they got bad no\nBut I've been bed around where I was calling their birth things went wrong na\nNa and\nI watch the bad days your doors for me that they don't you I'm In a low cost them by the way the ball go by all of that\nDo allow or\n[noise] [noise] [noise]\n[noise]\nSo far\nAway right down to the old bald bald he was a very the landlord said that Bob dog and the bully home there is a\nBad back a little ... a God ... and not only a few do but that dog Ramona Rob Goldstone away from the bar\nAnd they are in\nIowa but that does your sleep that they don't you are middle school that I live with a bottle of wine or a bad or\nNa da de\nDa da da da da da da da da da da da da da Vinci he bought a ton of mad dog\nAnd they are and and\nThe holiday will journal and the ... well\nA little\nOr no\n\nI Know in\n... when I hit the road ... showed us Bob I have been low\nHow big a good rule the pay ...\n\n... ... in ... he can't stand them when I'm always\nRead he's got a a word um she's got a masters then so I can wait until the time machine gunned them cook them bombing tonight she gave\nThem all a\nLot about earning\nA living in the world you know in the rain hanging on some oh\nA\nDiner and her long\nLove and the Internet and all that I really do\nNeed a man\nAnd a girl\nOut of my love for low balled my oh my God no law\nBread in on my bread and a\nWhile when I come home and hit that door I read the memo on these days I'm about four\nMiles long when the world go no I'm a model\nAt the same right now we're when you have been burned in line changing\nThe ball\nAnd then while I'm a mother and I\nLive in an old word oh lord of the lowland rain now ball by\nBurning the way that serve wall well then\nLet me return it uh yeah\nI'm a verbal or by our laws are vulnerable and I am\nA\nBurn and how long love and let me turn it on\n\nLine ... ... no more than ... na na\nNa na na na ...\nHer long love and let me and my\nMother and a little bit of the new ...\nWell I don't know man you know I Know yeah\nMan a man and then\nBring your mom you know or German or you or would you like\nJust been so nice and then and\nThen but you know\nHow [noise] [noise] [noise] yeah\nI Know you're not you know and we just got a good\nIdea to get the job and be in the in the land the land up by the fact is that about do\nYou love and all the time to read\n[noise]\nI Know [noise] [noise]\n[noise]\n\n[noise]\n\n\n[noise]\nYou are listening to kill you why I ... ... ... and tell you what I L P upper ... I'll be eighty nine point one afternoon project so\nDo you hope the foundation streaming online that January I dot net your Native American public maybe oh ... ...\n... ... ... ... ...\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n... ...\n\n\n\n... ... ... ... ...\n... ... ...\n... well Mm Mm Mm Mm Mm Mm Mm Mm\nMm Mm Mm\nMm Mm\nMm\n[noise] Mm\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n\nMm\nWell I\n\nLove a na na\nNa\n\n\n\n\nNa na na na na\nNa na\n\nNa na na na na na hey\nHey\n\nHey\nHey hey yeah heck yeah oh yeah I Know how\nYou know\nHey you\nKnow I Know a hanging out how are you a\nHa ha\n\nHa\nHa well hey hey yeah\nOh hey yeah and ah yeah I Am\nNow hey honey honey yeah\nYeah yeah yeah and uh how\n\nHey hey hey yeah yeah yeah yeah\n\nHey hey hey hey I Know that yeah yeah yeah and I'm\nNot\nOklahoma okay no no\nNo no no no no no there's no no\nHe set out give ten grand do any man who can ride this horse called down to my little that they know that I'm Down there was a man that we're in primary he took office Charlotte they look to the sky and watch the president's there\nAnd he got on a tourist or rode out over to the rodeo arena [noise] he walked into the rodeo arena and you looked at the ladies to spare you tip doesn't\nHave any we design assume the lady just said\nOh sure heart and he said I'll Try that or just the way that ten ... so he got into the shoot to be put on a straps stood on the really deserve to get on the horse and\nIt all begins with like a bomb that exploded with dynamite went to the air\nWith writer and the horse drain and made all types of knowing whether they're on that fateful day my friend\nJohn them I was finally written\nAnd\nNow the legend does that as he took off his hat and you throw it to the lady and any room a kid and he wins design and he walked down to the north now nobody knows whatever happened to see how they know that have gone and\nThey say is that when the moon is down there on the ... you can hear the coyote howling\nAnd you can you hear the the president is yeah\n[noise]\nMm [noise] Mm\nMm\nMm\nMm Mm [noise]\nMm [noise] [noise]\nI'm In the San Bernardino here like from the leaves and so\nShe's a lead my move I mean I'd rather be a lot of people who are like the meaning of using a ... a month old and they just need to\nHave you back on the back and say we can't ... you\nKnow and they backed by a a little bit of gardening and ... and\nI mean\nAnd all the all the other day the bombers na\nNa na na na na na na na na\nNa na na na na na na na na\nNa na na na\nI liked what you call them the night I'd like to think that when we do know the more the cards right\nWhen the sun shine it all the ... uh\nI like them who I don't really go one more than a week now but not yet been na na na na na na na na na na na ... new\nBook about a man with them but then again when I went there to watch you know it was shut down\nOver my becoming a man and I like to do is you know a well known to man minimum for me a little bit about the world and then they get their decision to make na\nNa na na na na na\nNa and then [noise]\nAnd I and\nI like the Fisher survey he learned the the moment you cook them up for me in a big fan of blood on me and again if we should remember why are you man and then\nI learned that you give me I'll do it you're the raw fish and being opposed to the movie ... ...\nPlus the fact thank God and then there's been no movement away by the hour the Kurds\nAnd today they're back to back to the car and the bad things back in the eye and older voters Wayne ... na na na na na\nNa na na na na na na\nNa na na na na na na na\nNa na and\nI'll like I'm never going to be good enough we wish they would give the over the live\nRight now and then that back to the fact they run a little bit of the time they're bombing and the other is that we run\nInto that was on my own little thing that I Know when I was in the car and insurance and they all are moving to go to the Victor thing one\nNa na na na na na na\nNa na na na na na na na na\nNa\nNa na na na na na na na\nNa na na na na\nNa na\nNa and AA\nOoh moving in the early ... and all the money on a number and oh by the audience da da da\n\nDa da da da da da\n\nDa da da da da da\nDa da\nDa\nDa da\nDa da da da da da da da da da\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise] [noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\nNo\n\n...\n\nNo no no\nNo\n\n\nNo no no no\n\nNo\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMm Mm Mm Mm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNot\nOnly that prior to that to me that\n\nI think from Long Beach oh\nLet's say\nHey wait so long to turn twenty even closer drunk driving\nThat they're\nNot you know you guys trying to think that that's\n\nThat's what well it's hard for\nMe to do and you\nKnow\nThe well some guys that I mean that's from Toronto\n\nWell\nThat's you know [noise] you want to dwell\nOn this than I Do\nNot like\nThat and I tried a\n\n\nWell let me tell you what do you draw from that you read that I mean that\n\n\nYou are listening to you why I own below eighty one FM streaming online to kill you why I don't see why is the project of the ... foundation Mm\nMm Mm Mm Mm Mm Mm\n... Mm ... ...\nMm\n... Mm ... my mommy mommy\nMommy Mm\n\nMm Mm\nMm\nReally ... you know ... ... ...\nMm Mm Mm\nMm Mm Mm Mm ... Mm\nMm Mm Mm Mm Mm Mm Mm Mm Mm\nMm Mm\n... Mm Mm\nMm ... Mm\nGo\nGet maybe ... maybe a unity among the ...\nYou you know Mm Mm Mm\nMm Mm Mm\nMm Mm Mm Mm Mm Mm Mm\nMm Mm Mm Mm Mm Mm\nMm\nMm no no ... ... ...\n...\n\n...\n\nAnd and the\nOther you know ... even in the ... the bud you you do you see any new ...\nWho in turn\nOut ... ... ... you you know\n... and ... and ... ...\n\n... ... oh ha ha ha ha ha ha well\nI mean they say they already know rain here you know ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ho ho ho ho goes hey hey hey hey hey\nKnow [noise]\nThe new ... new meaning as to [noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise] ooh [noise]\n\nAh well rules who will be will be a little more and more will will run run run run all over the middle of\nThe\nWorld [noise] really mean\nThose were the\nBad that the worms\nWill remove Moore and then we're going to go to the rural and there was\n\nA man who\nUm [noise] the moms who you\nKnow to [noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\nUh [noise]\n[noise]\n\nMm\n[noise]\n\n[noise]\n\n\n\n[noise] [noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n... ... to ... you know quite\nA long\n\nTime here and I'll be ... times ...\nWho ...\nWho where you're going to see my role end up being on the line to draw\nThe line\nJulie ... and\nThe ...\nOne of the day or two\nWhere I'm from a\nLittle town\nWhere you know mind jump around\nTown um\nAnd I agree with John now a ... loan\nTo\n\nBe known\nHow are you know we hear from a ...\nSo\nWhere is it raining it in your bedroom or the the the the ah the ...\nWhat do you believe in ... ... to be\nThe\nSame man they are\n...\nRole on\nWhere you know we're gonna have to brown\n\nGreen jobs being in the mail or where you\n[noise] to\nMe John [noise] yeah yeah I\nMean all the time [noise] so bad I mean I'm a little trouble\nNa na\n... knew who it is oh\nWell ...\n\nNa na na na na na na na na na na na na na na na na na na na na na na na na na\nNo world news the sky as being ... uh and and here I hold your clothes when Natasha\nAnd the clothes and their their their their ... their ... yards guy\nAnd and ...\nWhy ... ... ... that God I mean I'm On the line June learning\n... ball and then then ... dinner I can do what do I need to win a million dead shrew ... ah ...\nThe new ...\nNew York I live and um and um\nAnd and and\nSo hard to see a few more either from the jury and to and from the large will raise the price tag on sale or draws na\nNa na na na mom\nAnd and and when they asked me to do more than I Am learning through me and when they know that\nThe way they are and they're paying their darling darling stand by and when I'm\nAlive and dead hand or a ...\nAnd ... and and ah ... or fewer and fewer\nAnd fewer and fewer and fewer and fewer ...\nOr ... shoes are gay or ... or in your shoes ... or\n... or ... or ... and I'm ... and\n... not to burn\nThrough me and when it comes\nDown to wait and then you do not fear always name your name and little way there we saw in the way that you're here and there\nWas no train but um no no no no I mean 'cause I'm and I'm sure there are no and I\nAnd ... and her mother\nAnd father and\nUm\n[noise] [noise]\n[noise] [noise] well [noise]\n... ... ... balloons in my school and then we are going to put on a man\nBy a cab Anton call oh\nWell the main goal this when they go in um [noise]\nYeah it's true and I'm not doing well\nBy the blind ...\nI'm\nA I'm a rabbi and some by his role in a in a one man oh ... no no I'm In low\nIncome right now I Know James so go ahead and so why don't you don't know a lot in\nThe last ... last year in Georgia where I Am not a good man and one of them make about a bad\nPlace to learn about buying a lane change change na na na na na na na na na\nBut the main na na na na na na na na na na na na na na na na no\nMan I man I'm like wow this guy so and ...\nNo ... no\nMatter what it means to me in the mall I Know\nI'm a man or the God modern ... bad no man\nNamed my guy no very being from Miami Don and when I bought him\nSome moral and lab in him that\nWay\nAnd no matter how bad man it was a good one a much better place than good look at the long run it may not have to start in life and I've been to\nJust say I'm not sure the man I\nDid one of my mind about some place to live without that Americans are on the guy that yeah the ... wire God sometimes you know I'm not going to try\nAnd turn it on a jury you're the one about sounds right they can look at the matinee that changed your\nNa na na na na na na na na na na\n... well ... ...\nCommunity support keeps K. you why I on air it costs almost three hundred thousand a year to operate K. you why I Hope he radio\nK you're white I received no state or tribal funding for just ten dollars you can show your support I Hope you radio and the honky tonk round up show all year long become a K U ... member by adopting a walk thank you for your support\n[noise]\nYou are listening to cure you why I and you wonder if some of the radio [noise]\n\n... no one knew right away [noise] mhm\n[noise] and then\nWhen you grow up in their own thing but I\nNo ... no no no no no\nNo no no no for a dollar a gallon\nA [noise]\n\nWhen you're a young child\nLay out there and those are all male or a you know we got out there now or whatever you know allowing\nIn there or you may not know about\nYou know [noise] [noise]\n[noise] [noise]\n[noise]\n\n\nThe following at the pay P. S. A. did your local ... during or after dial treatment tribal injury attorney advocates may be able to call one\nEight hundred three to ... to learn more if your family members so because after diagnosis tribal injury attorney a one eight hundred or treat you force wiped you\nLori this is Lee go into a single mother with the ... and you are listening ... gee why are now look so not\nNot not so she got ... hope your radio streaming online that you are are dot net a project of the ... or ...\nYou are listening in decay you why I ... the only one man\nAnd kill you why I wrote the upper boot up the eighties I only one that's been ... project up the hope is what would they shouldn't have been ... your Native American public radio station\n[noise]\n\nOh no\nNo no no [laughter]\n[noise]\n[noise]\nYeah [noise]\n[noise]\n[noise]\n\nOh no\nNo [noise]\n[noise]\n\n[noise]\n\n\nOh no no\nNo no no [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\nOh my God whoa whoa whoa\nOh God what is it a ... a good way off in a way I'm going to offer a day off a white officer you know I'm a white officer on my day off I\nSaw whoa wait a\nWrite off all the way a way a way a way way off ... problem with a guy went coffee or\nWhatever it was a very often a boy or a dog on a on a million dollars a day off a well a a a a way a way out there all day all I\nSaw a ... a a weight off\n... ... they are in a way I saw quite often they always say oh my\nGod whoa whoa whoa whoa whoa whoa whoa\nWhoa whoa wait a ways off about a long way off oh OK problem with a white cop [laughter] whoa\nWhoa whoa whoa whoa whoa a\nDa da da da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da\nDa da\nDa da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da\nWell\nWell he\nWas really ... ...\n... email I Am yeah yeah well I\nTell\nAll book\nWell\nWell well well you know\n... ... a whole ale and you know they are they are\n... ... ... ... ... ... ... ...\n... ... ... ... and I am a\nHill or a a ... a ...\nA month to well go do\n... do not agree on that you\nKnow a a a a way you know\n... ... or ... or ... well ... ...\n... email\n... ... ... ... email ... a play on a hill has a a a a a a\nA a\nA a\nHigh a where a na na\nNa na na na na na na na na na na na na na ... place\nA ... or ... or ... or ... or ... or ... or ... or ... or\n... or ... or a plane\nOr a ... or ... or ... or a play on a as well uh\nYou know a a\nA a\nA a a a a a a a a a shower\n\nOr ... or ... or ... or ... or ... or ... or ... or ... or ... or ... or ... or ... or ... or ... or\n... or ... or a ... a you know ... or ... or\n... or [noise]\nOr or a hell of a play a and a boy or a ... a a\nA a a\nA a a a\nA a a a a a play I play a as a ... or\n... or ... or ... or ... or a play on a on a ... a\n... or ... or\n... di di di\nDi di di\nDi di di\nDi di di\nDi di di di\nDi di di di di di\nDi\nDi di di\nDi da da da\nDa da da da da\nNa na na\nNa\nNa na na\nNa na na na\nNa na na na\nNa\n\nNa na na\nNa na na na na\nNa na na\nNa na na\nNa na na na\nNa na na na na na na don't all day every day I'm\nLike a\n\n\n[noise]\n\n[laughter]\n\n[noise] [noise]\n[noise] [noise]\n[noise] oh oh oh oh\nWhy oh why oh\nWhy oh whoa whoa whoa whoa whoa whoa whoa whoa\nWhoa\nWhoa whoa\nWhoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa\nWhoa whoa\nWhoa whoa whoa whoa whoa whoa whoa\nWhoa are in the river near\nWhere we're far from where I'm sure you do\nFor work\nOr go no vote on a\nPro war for ... for your\nCall forever too far from where are you I'm thirty two year old\nGo\nWherever go go go go go go go ... or so and part of new\nOr you were there\nWere pro football for more you\nKnow ... or you know we're going\nWherever oh no ... no no for birds you or for worse\nFor you\nOr do them were pro wrote a home where you are no orders\nTo the phones were your birth order or neuro orders gr narrow roads or grow grow grow\nWord burgers or wherever for grow grow grow grow grow grow pro war or\n\nI I Am mad and I'm a I'm a I'm a\nYoung man a man\nA\nMan like that yeah yeah\nYeah yeah yeah uh yeah I Know I I don't know I I I I Am married and\nAh\nI yeah I'm a Mac and\nA half married\nYeah oh yeah yeah yeah I'm a young man yeah I\nKnow I I I yeah I Know you have\nA I I I\nKnow yeah I I\nI Know that uh uh\nUh yeah I don't think I I actually am I right now\nI I I I I\nKnow yeah I mean I I\nI I I I I Know\nThat as a as a as I got a nice guy\n[noise]\nMe\nNeither I was like oh I don't know if\nHe wants to [noise]\nDo you know I have no\nInterest me [noise] [noise]\nOh no no no no no no no no no no don't do the job on\nAll the time but I mean all the people you never know what's going on right now I'm old enough to know what I'm doing the job of showing on a cell\nPhone or on the phone I just try to get on and on\nThe phone\n[noise] [noise]\nI don't know do you live in L. A. al ... type of loan on alone\nNo no no no no no no\n[noise]\n[noise] oh\n[noise]\nBoy that's a long time now than they were they were hit by a\nMan named di di di di di di di di\nDi di di\nDi di di di di\nDi di di di di di di di di\nDi di\nDa na na na na na na\nNa na na na na na na na na na na na na\nNa na na da da\n\nDa da da da\nDa\nDa da di\nDi di di di di di di di di\nDi\nDi di di di di di di di di\nDi di di di di di di di di di\nDi di di di\n\n... book [noise] ... um Mm bugs bugs bugs me a ... ... ... ... ...\n... ... one war\nYou are listening to pay you I I Hope that law eighty eight point one F. M. K. U. I. L. P. uppermost ... eighty nine point one at a project of the Hopi foundation streaming online the KU why I don't know\nYour Native American public radio station\nHi my name is Ryan and mean and I would like to lay on the kid ... cheating and be the ... guys get candy and anything but don't eat too much how much they check out man happy Halloween\nIt's not like um she's be with you man I'm Still here because we're by my name is ... robots and I am from India and Greece and I grew up in Tampa, Florida\nYou say I'm a ... shame Carlos each year now Barney ... on the buses chain touching the adoption nuts and the genetic shape the guy at the national ... hello everyone my name is Carl Lewis and I come from ... New Mexico\n... ... de ... hello I'm moderate and she was supposed to gather on this from ... in New Mexico\nYeah down ... ... ... but that human strength not counting that this is Jean does not have to have an additional ... tai chi eat that's now they say they're now than I Am ... from ... New Mexico\nThat current event to become the unhealthy my see right behind they need to find them to know them but the rumor high everybody my name is Tiffany I'm from the village of Havana and if the wind\nAnd you are listening to say you know I I ... point why I asked them to be radio she may be an on line that K. U. L. I. I. dot net\nAnd we are the native youth leadership alliance and we just want to encourage all the native youth out there are little one keep learning keep going keep loving keep helping and keep on living\nAnd you can find that needed youth leadership that ... you're listening to\nTell you why I could play money than he why I Know the upper ... at the eighty nine point one and\nA\nA a a a a or a\nLawyer or a\nOn a on a on a on a on a I'm a I'm a you know\nA a a\nA a a a dog\nOr a or a or a ... a a a a\nA a a a [noise] a a\n\nA a\nA a a a ha ha\nHa ha ha ha ha\nHa ha ha ha\nHa ha ha ha ha\nHa ha ha ha ha ha ha ha\nYou know [noise]\n[noise] [noise] yeah you know\nA a a a a\nYo\nYo\nYo yo\nYo yo yo\nYo yo\nYo or [noise]\nOr a hero in a\nLast time I don't know why\nDo you I Hope not I eighty ... fan and K. U. I. L. P. upper my coffee eighty nine point when I might I might I dot net\n... North Dakota I'm I'm not I'm a poet said no no a oh a ... ... ... I'm I'm not I'm a polar said no no a or a\nShake 'em but uh I uh uh\nWell I'm like oh wait a week or ... or ...\nOkay the nose da da da da da da da da da da da da da da da da da\nDa da da da da de\n... ... ...\nI'm a ... a\n... loan was a\nCourt order I'm I'm ... I'm a Bush said no no we're a ... a\nShaky oh God I got\nA ... oh my oh wait a long way a low a\nOkay they know de da da da da da da da da da da da da da da da da da da\nDa da da da da\nNa na na\nNa ... euro a great ... great do you do a\n... I'm I'm not in a while a\nNo fly off road road a bowl work on it a go of a bad check a oh a mother that\nThey may have to pay my only up or you\nKnow we are a lot of uh\nYeah yeah hey hey hey yo hey yeah\nOh well yeah yeah hey hey hey yo hey yeah go\nGo go ... great ... great great show a\nGardener oh no no no\nNo oh road road a goal was ... it up or go whoa hey budget draped on ...\nStreet\nRoom ... New York are you do know Rio de la ... uh\nYeah yeah yeah yeah yeah yeah hey hey hey yeah\nNa na na na na na na na na hey yeah I\nOwn a way I uh I live in a way\n[noise] my dad and so we're seeing a lot of big chair oh in my mind I'm way out hey yeah NATO\nNa na na na na na na\nNa na na na na na na na na na na hey yeah I Am\nIn a way I I I I I'm an age\nWhen I was oh mercy and a five day care oh why oh why oh why am I\nYou know I had a way I our age\nAnd the way our na na na na na na na hey\nYeah I I uh I I I always\nHave a murder or to a tree and\nI said I I I I\nThink that I you know ... that you know any I mean any you know I actually out any here are either\nWay I have a way I I I don't know any\nWay way way way way out of how na na na na hey yeah I Am a woman in a way I I I\nI I in a way I said I'm Sorry you had any um any day now\nI Am in a way I see a way I I don't know our way\nWay way na na na\nNa na na na na na na hey yeah any you know I I I Am I'm In my head I'm\nWinning I Am a mad at\nMe they tried to add a lot of my old guy learn by ... you know any any way\nWay I now have no way no way I always say I don't know maybe I Am I in a way I ah I ah when\nWe are a lot of older girls oh man\nIt's all there is a better job in a row they call a lot of order a motor home oh there was no you know there's a a dog a\nDog or a recall hung up on\nA on a\nYo yo\nYo Ma guard nor oh gosh oh\nMy\nGod oh my God daughter broke off all of a dog or a tall orders\nYo la la la la la\nLa la la la ... one job one job or drug cartel blocked off products that are a lot a\nMobile home all day long you know there are a a merit and all this uh\nAlthough they are or how long how long\nAgo oh there you know they're in a marriage already ha ha ha ha\nYou oh God they call a lot longer\nWait a\n\nMinute oh my God no no no rational or a\n\nDog or ... or you could oh God all cars are or\nYour car or a dog or a ball\nRolling job last job was ... or ... or ... or ... up there you know what are\n\nOn on\nOn on on where you want to live on\nThe road going on behind on coming along the\nWay ...\n... ... ...\nI'm a I'm a ... or ...\nOr\nA bad guy away may away\nIn a boy or a ... a young boy I mean I'm a ... or ... or ... or ...\nOr\nAbove a in a game of the ... ... ... to put on a\nDay\nIn day to day in and day a day by about a permanent but about\nThe ... ... ... what\nHe\nWas a\nModern day man oh man a man with a way where a man or a\n... a ... million\nOf them are in a very big area you know\n\nThe way they always\nSay ... ...\n... a month ago a young boy a permanent job\nWithin a day and I both\nMaybe a ...\nAbove a\nDebate or get a quick but one day\nA man\nOf Rio de dum de da de da\nDe da de la ... de ...\n... all\nOf a\nOf a modern day oh man well in\n\nA\nBottle\n[noise] all\nAnd I I all on a it's very nice job I lost my job as a ... uh I\nI ... I ... I show up or not I am not alone there yeah and I lost my job at a at a on land a\nJob as a notch uh a lot of it or not my job I'm a ... a jazz jazz\nJazz change I I as a young age I Am a I'm On a train station a lot\nIn a in a cage or as a\nHold on a is there is a a a lot of my mother's a as a citizen or allow my mother's a\nIs a is a show or on our ... our na na na na na na na na na na I'm\nA I'm a I'm a giants are on a on a on a one on one or a massage or a a\nA a a a a a ...\nOr ... or ... or ...\nOr ... or ... or or\nWhat it is a a a job on the show and then a ... a a\nA a a a a\nA a man or a ... and uh uh uh uh there's\nOh why are they do on a\nPage on a show or a a a a A R I or I or why are they oh\nWell there Joe oh\nNow a days or a or a man or a a whole and a a a a a a\nA a a a a\nA a job at all and then a ... a a\nA a a a not a no no no no no\nThere's a job or a is that the U.S all and then a A R a well\nThere's oh well I Know oh John or\nIs it a shot a man a man or a uh I uh I uh well uh\nOh well they do or a\nOr a job or a man or a a I got a whole bunch a that was a a a la di da\nAnd ...\nYeah\n[noise] [noise]\n\n[noise] [noise] [noise]\n[noise] [noise]\n\n[noise]\n\nWay I\nDon't\nKnow why oh why oh\nWhy don't you don't want to get a a highway bill he uh\nHe oh God they may have a clue\nWhy am I what\nAnd they got an a ha ha ha ha ...\nYears but I Am\nSure enough time for ya what you are and how I feel bad and I am a\nOh a man ha\nHa ha ha ha ha\n\nHa yeah I Know my show a young man right\nDown the guy was your age and they got a call ya like I don't know how else to say I am a yo\n... they may have\nA car or a ... a trash bag hey hey you know\nWhy I got a trash climbing again outside while ya ya oh how I feel bad and I am a\nOh come on and they can pay a\nHigher risk of dying of breast your ears you know\nI don't\nKnow why I say oh hey\nI got a ... ah what ya huh well you know how I feel that I I have yeah I've got a young\nMan huh ha ha ha ha ... or ... years but I Am I\nDon't know\nWhy John calling again I'll tell ya what do you I don't know how fast yeah yeah okay I live in a\n... ... names ha ha ha ha\nHa ha ha ha ha ha you [noise]\n\nBut but but it comes to look something\nThat's when I was just a little more\nAmong know with all among the ... ... ... ... ...\n... ... [noise]\nThat's not bust him a bum but some are you [noise] ... yeah man [noise]\nThey buy du da da da dum la da dum la da dum la da da da da da da da\nDa da da da da da\nDa da dum dum\nDum bus I own my\nOwn but if I'm young group ... [noise] ... ... ... ... ... [noise]\nA government will burn up you know [noise] ... ... de la ... to someone who you are your thoughts on [noise] mayoral hotel by\nNot on the bus him over three billion dollars but the only um are you a hug 'em or a month\nUp but um but it but not one and it you know\nWhen we were [noise] the term soldier\nSo [noise] ... [noise] yeah yeah [noise]\nIn a movie no go for 'em to go to\nJohn [noise] yes [noise]\nBoom bill over real [noise]\n\nYour life matters [noise] sharing your story with us now can eat out right now 'cause ... prevention program wants to encourage you to find a reason to keep\nOn living because we care the we campaign is a group of local people and organizations from northern Arizona we care about you and everyone within our community and we are here to\nOffer help in court because what how how and when you know filling depress the national suicide prevention light it's open twenty four seven locally reach your life need to be used to Portland is currently taking calls\nMonday through friday three to seven pm at night to eight seven seven sixty eight twenty five we encourage you to empower an honor you're right\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\nYou are listening to you what I call the law and he ate putting one of them and say you why I ... a promotion ... eighty nine ... projects up the ... foundation streaming online at ... dot net your Native American public radio station\n[noise] [noise] [noise]\n[noise] [noise]\nMm Mm no ... on your own you know ... you know we know we we will weigh on your own ... when when you know when you know ... ... we\nKnow we we all wearing on you when you know when your when you know when you when you when you when you're you know saying where young when ...\nWhen you when you know when ... we we we don't know\n... ...\nWell you know ... ... when you know we know when we were you know\nWhen we when we when we we All right well you know ...\n... [noise]\n\nYou know when you finish the man is yummy how we hang out in Queens cheese shop that\nMan no probably not doing it when you when your money you know we know when we\nWere in radio when early on\nWhen you really really\n[noise]\nYou know ... years since the ... ...\n... ... ...\nIs Ron Ron Klain I mean you know when\nHe when he when he when he planning on\nDoing the yo yo yo yo yo yo yo ... who we ...\nRan into who ran it by yo yo yo yo yo yo yo who your way go came up on their own people and who do go over and over a dollar who may not remember way\nBack then now\nI own a gun I won't go away and then uh\nYou know they know we don't know I Want to go around you know\nWhen they now I own a then how do we know how long to know you want to do a little man who made an ... way to you the way I like your Michael go there you go way legal\nWhite man who ran into him and they don't go away we'll\nGet back home yo yo yo yo yo yo yo way go hey go and he goes hey go and get on tape I'm On a boat because they make on my ...\nMy nine year old a nine or ... ah you know they know you you you know there's no way they uh uh you know\nWe don't know how to know your typical man who may go where the women or young man that you'll remember when when\nYou when you when\nYou come home and they um\nThey were wearing my yo yo yo yo yo yo yo you're way over to take off on their own people and the guy who was a movie to go from both on both make my comment on my\nWay and then now I'm In a row and then ah you know you're ... you\nKnow a lot in a way that I don't know they know\nWe can now go or how do you know people who may ... and where are you where are you on TALK to you whether you land and take them who when you when I think on who ran in the\nWay as to who when they come in and you come in with some of the U.\nS. she told me that can go next cut back on say hello my name is Tom Duncan my ... name a yellow Bert dancing on from Mesa, Arizona\nHum I Hope that who pen to since I was five years old so flute player in quite a different albums with Kenyan records and you're listening to KU why I have an eight point one FM screaming on line that can you why I dot net your name\nKate you why I have an eight point one FM screaming on line that can you why I dot net your Native American public radio station project the Hopi foundation\n[noise]\n\n[noise] [noise]\n[noise] [noise] [noise]\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\nMm\n\n\n\nReally really really really really\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\nMm\n\nMm\nMm Mm no food and he\nReally really\nTell you the a\n\nK like I said be ... it'll be ... you know a lot when you ... ... not gain like idol connected accounts ... un ... con ...\nA a a a hot a hot or\nPay a have a a\nA hot a hot or how\nThey they have to be a high gas [noise]\nAh ... you know we have a yogurt the a\n... a\nNew way over the uh hey hey hey yeah a\nBio always\nGo out there a ... page say hey y'all are you all they call a lot don't they [noise] hey are you all have a a A R e a a Ali\nHo man ... phone over the\n... ah\nYou know they have yeah yeah yeah\nWhy oh why\nOh Jay and Jay they knock you off the wall J and J hey do they pay all your hey all all we all are you all have you always\nOh whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa yo here oh no no no no\nWe have over ... ...\n... ... a law hey Sean macdonald yo yo Dolly a ... a\nA R O O ... O O ... o ... O O o ... [noise]\nHey hey hey\nHey ho ho ho\nHey hey hey hey [noise]\nOff a eBay based on my car yo yo yo wait\nA while or a a a a A R O E a a a a a ...\nDay hey Sean macdonald yo yo yo wait a while a like a a a A R O E oh hey ho\nHo ho ho ho\nHo ho ho ho\nHo ho ho ho ho ho ho ho\nHo ho ho ho\nSay oh ... oh no and\nAll the talk of the law like hey I'm a dollar a yo know where you are a yo yo yo away all of our whole review oh oh what a horrible ...\nHey hey hey hey hey\nHey all of a heart\n... hey yeah I uh\nA hot a hot or how\nThey have a a\nA A R a\nHey hey hey hey\nWhoa you know we have well over the you\nKnow\nWell over the long run\nI have yeah yeah yeah\nLike yo\n... say hey you know you're off of the wild they call ... ... [noise] hey are you all pay off all week oh y'all hey ho\nHo ... all over the years\nGo on\nThe phone or your you know they have no idea\nWhy oh why\nOh today on to say I know we won't carry a great go whoa hey hey are you all have a oh oh you all have yo\n...\nAre you do or is it all your area or oh yeah oh\nYeah oh oh oh oh oh oh oh oh oh oh oh oh oh oh oh\nOh or or or or or or or uh\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa or or or or or ... [noise]\nHey I heard\nIt all off the air you\nKnow saying hey you know not that young [laughter] you\nKnow not that they had I had to pay your\nMoney but not on your mind when I say no but you know what I'm saying\nHey hey hey you know how\nMuch they put you just can't make up your mind you're not even the national league pump pump pump pump\nThat young man that I guess\nYou know he he he thought he could come back you know he has not playing on the job\nThey don't you get your turn I Am a young man he hung up on the Internet you know that you know I just turn\nYour head and I think\nYou know you ... your ... your day you know he would he go up\nThere and I have to come here at a time I got a good\nPoint that you know you guys are not they don't make the money on on the train and go\nHey you\nKnow not have met some\nWomen can stay in the country you're from the the young people you know he\nHe or she could get you know the you know you can't tell me\nMean\nI ...\n\nYeah [noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\nNo I'm I'm you know [noise]\n\nTo me you know [noise]\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n... [noise]\nWe raining for sure [noise]\n\n[noise]\nMhm\nAnytime that the ... also hate the opening up and tell me what my main character\nIn Washington\nState them in one of the only way he died he said yeah no I made the gunman from eight to ...\nAnd yet the meat that Julie based on a daily\nNaked not with India which I'm not make any time that you've been by not in not money a play on\nThere you can well not a big family in general\nI Need a bus from Georgia ... eat that's\nAlways a little my bike\nAll eat them bad hate being kept\nMe on the planes had\nHit number ... ... that's why I\nSay I'm the chores shape but in my own family behind one onto them up\nOn on that and they come by and move it from a\nVery long lines of in line with us from but you need young age can allow me\nTo take my own and they put out my core\nYou may have some respect the baby monitors in practice we should be able to take ownership and that meant when we are wrong\nHopi substance abuse prevention send to provide the tools for a living respectable lightning sobriety restricting the person by teaching\nHow to apply these tools to daily living if you are being affected by drugs or alcohol or know of a family member or friend who is we can help there is a solution to turning away from its abusive and destructive life I'll call the drug callers today at night to eight Seventy three four zero three zero zero\n\nYou are listening to kill you why I ... a ... point when FM's\nAnd K. U. L. I. I. L. P. upper ... eighty nine point one F. M. Broderick so do you hope the foundation streaming online at ... dot net your Native American public ready oh station think hey you why\nI listen to nine some clay ha new David you wake up to ... in the morning please don't it online at ... dot net go into the\n... you're listening to talk to ... I eighty eight point one [noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n\n[noise] [noise]\n\n[noise]\n\n\n[noise]\n\n\n\n[laughter] [laughter] [noise]\n[noise]\n\nYeah they\nWere the lead me when he really\nYou don't know\nWhether you know you know I mean if\nYou're a young man [laughter] you\nLa la la la la la yo yo yo yo yo yo yo I'm On my uh\nMy yo yo yo yo yo yo yo one on a on a body off the all the time you know\nBut yeah they they and my feeling now they may sound like you're a young man like you know no one has been done on the\nNet ... tiny Seventeen tiny the mind even if they don't like to watch my hope he misspoke I Am clown pants individual it's just so much for me I Am the tiny teeny tiny [laughter] you know and I ... from Mexico\nChina and they really should\nThat they were they see and my\nYou know they can't like gambling in my feeling that the case in a way that meant that\nTwenty Seventeen Eighteen may be sticking I Am a Catholic and my hope you name it throughout the IMF declined client and I am Sam ... the I Am twenty Seventeen twenty team is the first time and they pass by makes child intervention now how much they can\nGo to the mic Okinawa next to nothing and the net he doesn't say anything you've got an Eighteen Nicholas they can and I am trying to go yeah I Am and then I just know me and I am that he doesn't say anything to take an Eighteen kicking the can and making class finance\nAnd you know mining meeting them I'm not saying I'm not\nI say I am and I'm like ...\nAnd ... and yet now they can you tell age John happy like how they deem and pass it and I don't think they can reach out and your family you\nKnow I like me to K. U. I. eighty eight miles wide and an K. E. L. I. L. P. N. that'd be a nine point lead and I hope the United nation gaming on line I came I\nNative Americans have like radio station and it's golly\n[noise]\n\n[noise] [noise] [noise]\n\n[noise] [laughter]\n[noise]\n[noise] [noise] [noise]\n[laughter]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise] [noise]\n[noise]\n[noise] [noise] [noise]\n\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise]\n\n[noise]\n[noise] [noise] [noise]\nYou are listening to key why ... eighty eight point one and K. U. I. L. P. upper ... eighty nine point one project of the foundation streaming online that can you why I thought\nThat your Native American public\nRadio station sound like on the rescue man I'm here by my name is ... and I am from India and Greece and I grew up in Tampa, Florida\nYeah they ... ... now Barney Sloane ... buses chi chi chi da ... genetics check ... hello everyone my name is ... and I come from kind of New Mexico\n... cup I had a ... a moderate and tried together I Need from up in New Mexico\nYeah down to shake yesterday ... ... does that mean in ... I Can't name is Jean there's not that I think you can take the need that's married and I can and can't you can't ... New Mexico\nBecause of the ... right behind me any by name can you know hope that I Can't remember how many my name is Tiffany I'm ... and then I kept her and ...\nAnd you I mean do you say you're right I Am thirty eight point why act and the radio I K you write I got that\nAnd we are the native youth leadership alliance and we just want to encourage all the native youth out there a little one to keep learning keep growing keep loving keep helping and keep on living\nAnd you can find that that may have you read is that the\nLaw for a\nLittle hard or are they um\n[noise]\nA A R yo la la la la la\nLa la la la la la la la la la la la la la la la la a long haul off the wall\nAnd all of a house ...\nOr a or a way of la la la la la la la la la la la la la la\nLa la la la de la la la la la la la la la\nLa la de dah all showed a long way off the\nBall la la la\n\nUh uh uh\nOr or ... or ...\n[noise] ... with ... million\n... [noise] I'm going to lose [noise]\nNa na na da da da da da\nDa da da da da da da da da da\nDa da da da da da da da da da\nDa da\nDa da da da da da da da da da da da da da da da da\nDa na na na na\nNa na na na ...\nNow a\nOr a sub oh da da da da da da da da da da\nDa da da na na na na what they hope a hell of a a higher or they'll hire a a\nR A\nA a a\nA bar or A L\nL K now I'm a\nOr a home or da da da da da\nDa da da na na na na ... or ... how are you know a bill\nYou know a do or not a a A N O O L A a A R or\nYou know are they all fell on a ... a a a a da da\nDa da da da da\nDa da da da\nDa da da da da da da da da da da\nDa da da da da da da da da da da da da da da\nDa da da\nDa da da da da da\nDa da da da\nDa da na ... kitchen I'm\nConcerned as long as ... you know\n... to ... chicks which is kind of ... ... you can hear you saying he knows ... ...\n... ...\n... ... churches say she some time to achieve potentially trinity church you know you're in Charlotte ...\nNone of this you know what I'm ... trying to change you know what you do any kind of keep sending you a chance to just you know trying to under ...\nJohnny ... district you know you can't you say she got Johnny no\nTeacher to truly truly church you know it's hard to predict sitting on the killing you could still insurance you know ... which is\nYou know China trying to achieve your time today just trying to trying to cheat you just don't you know good times you know just to just get you to join just needs to judge Judy ... you tend\nTo just change the Germans during those two to have you ... your ... your ... the only thing on your show\nYou know she chooses to just concede George Harrison is Shirley Shirley should trust me no history he keeps his job\nSearch to judge the judge was just like three days 'cause I was\nRaised on she says she just\nSays\nHey this is as you're a and I listened to help the radio on K. U. L. I. I. dot net all the way in Southern California it's that great radio\n[noise]\nSan man me why not non nuclear one a\nLot to hell hell no you know\nGone numb and neither one of them need why not go man needs one time\nA lot of other young up to your family come\nOn man nearby or whatnot con man why one time no need to tell you what a\nLot oh hell no school you'll know condemnation\nKnew what a con man needs one not time no man needs one now\nElena ... Donne line hell no no you\nKnow men need one town\nSan men need by one not me I wouldn't know\nHow long how long how long do you\nKnow men need a gun in the rye or what not um no man needs ... when a\nLot I don't know how long do you know\nI'm no me neither I oh what a\nCon man why one John need I Won a\nLot of them are hell no no no power\nNo man what a man named way one time numbers need probably what a\nLot to learn how to deal with our\nSon no man I don't\nKnow man need one not no man what a\nLot of luck Joe ...\nKhan no man you know\nMen need by a con man needs money or what not\nCount on oh I don't know I don't know\nMan named one non meat when John I'm the one time\nA lot to do you know John\nMen need one man or you know [noise]\n[noise] [noise]\nAnd then there's like a mentor yeah ... yeah maybe yeah my name or the uh the uh the uh uh yeah I heard it on the line I mean yeah\nYou are listening to pay you what I Hope that law eighty eight point one F. M. K. U. R. Y. I. L. the upper ... eighty nine point one at a project of the old PRI foundation\nDreaming online the gate you why I dont know your Native American public radio station\nIs he a great game play on the floor then say sorry there's a place to go back and how it was like as it stay broken this is how willing I fix people around you and people you or\nMe a good friend last well they said hey this man right by say get may set days gosh yeah a counselor and yeah you know I I Know we're a a\nFeeling that music\nCan keep all of a shoe or I'm having a ...\nLike that you can hear you I mean like one of the rain [noise]\n... ... ... ... ... ... ... ...\n... ... ... ...\nThere's no\nThere's no ... no one hour to get ... thank you drone in but you know and I would na ... let me get close to a [noise]\nYou know there's no way to get into a canyon and mean na\nNa na na\nNa na way we do know well you know around a lot to\nDo no no no I'm I'm In\n... and a drug\nTo me oh I Love you know\nYou love the ... Mm\nMm Mm Mm Mm Mm Mm Mm\nMm Mm Mm ...\n... or something\nLike try to find it for you and the brighter\nDay clear your name and the thing is very loving and where you go and they\nAre a new one oh my God or a somewhere\nLike ... na na\nNa na na I don't know why na na na na na na na na na\nNa find you know I have I ... I Love me oh I Know you\nKnow\nNa na na na na na na na na na na na\nNo no no no I'm I'm a ...\nA\nLow level low you know you know the two ...\n... ... ...\nMm Mm Mm Mm Mm Mm\nMm [noise] Mm Mm Mm\nMm Mm Mm\nMm Mm Mm well [noise] [noise] [noise]\n[noise]\nEverybody wants the Chinese parrot or how long you know the views of and everyone and nope close together\nVery long John river we were young we love God even\nThough I dont read back yard and now the\nTrails the name\nOf a strange name now gone for a little\nAbove oh you should be the butt but anything\nSharia another gym now you know pay every spring and summer out there and then the long\nRun we um we well yeah you know the\nWrong direction by Yarborough and now\nThe ... the name of the three main that God\nGod\nNa na na na na\nNa na and AA going back in and out on a um na na na na na na\nNa na na na\n... well you know\nAnd run around the back yard I'm Down in champagne\nThe gene in Maine\nIs a shame that they got on a ... ... or ... I haven't done in\nThe ... ... how long you know with the new ...\n\nYou know\nEvery day the competition and the guy or one of the people who create reach for a band and the ... by ...\n... you know I mean do you live in an economy is not going to try and you may know you're not coming to you know she\nHad only one we were young mommy you don't want any ... music\nPlayer in the early ... last summer\nOr the Sandy your girl or little grilled cheese in the parking lot and tries to the bathroom bill was killer and still make bond with them you know you know for a while [noise] ... ... then you know\nDone and for your ah didn't know he may be German and ah you no matter what she did\n\nBut I Love those by being\nA ...\nYou may have law well what do they do and and ... when ... you're ... oh I'm sure he made the pull yourself\nAnd your men and women\nHave made me a ball and I'm a nurse about what she did\n\nA book by news um [noise] the guy\nYou see that a day as long as long strength and their long on men can rent not during the\nDay when my mom you run to grow it as a whole ... fall down and then\nRe\nEnter that I'm leaving\nThe um the friend ... ... and you may think that the only one way\nTo know\nYou may be waiting for them to change them San ... in Maine man a man\nAnd a no matter what you\nCan and\nWill Sunday ...\n\nSo ... ... ... and ...\n... ...\n\n\n\n... ... ... and ... and ... ... ... ...\n... you know when will not bringing me\nLike what are the spring to come in and you know ...\n... ... when does it know when you reach painting or who and I love the way the um ... ... ...\nMy ... years that doesn't really normal be cheating or I Want to know ... ... ...\nAnd it could be done on me you know no one on\nOne of the ... machine will well ...\n... ... and I don't\nKnow how long how long you know ...\n... ... ... ... ... ... ... ... ... ... ... ... ... they're\nNot as good for the money you know there's no ... ... it was written in November ninth street ... ... ... not ... ...\n...\n... ...\n... no no I don't\nKnow how ... ... or ... you know me I'm a ...\n... and ... no no no the no ...\n... ... ... ... ... ... ... ...\n... ... ... ... ...\n... you know and I don't\nKnow how long um two ... and ... me I'm going oh no no ... ... ...\n... ... ... and ... and ... ... ... ... ... ...\n... ... ... ... ... and ... and ... and ... ...\n...\n... ... ... ... ... ... ...\n...\n... ...\n... ... ...\n... ... training you know non ...\nLast time we don't know yeah I Would go man on the cover and probably ... ... ... ... ... ...\n... is the main thing is and maybe the way to the ... the very dangerous\nI na na na na\nNa na na na na na na\nNa na na na ... and ...\nAnd then you pause last time they train or a bad job I jumped to train for more than ... ... ... ... voices then right you\nCan do on me and you try and and they told me like you said how diverse the\nNa na and AA and na\nAnd AA and\nNa\nNa na na\nNa na na\nNa or\nNot the right is rain and all of them and Johnny ... well ... ... ...\n... na na na na na na and AA and na\nNa\nNa na na na na na\nShe na na na na na na na na na\nNa na when we were in a\nIn a\nRather Andy young man you know around ... or\n... never know when the ...\n...\n... ... [noise]\n[noise] [noise]\n[noise]\n... ... ... ... ... ... ... ... oh okay um so\nHow ... how bad the walking in\nA train got more and more horrible or anything like I\nDon't know ... na na na\nNa na na na na na na na na na na\nNa na how do you think people will be the key to the point you have to get the most fun but never go to one of the year the number one on\nOne of the ... and one that gets go the phones ...\n...\nOr ...\nOr ... na\nNa na na na na na na\nNa na na na na na na na na na na na na\nNa na na ... any ... you know what color you are trying to jump on me and my ...\nAnd\nThen when you can ... a ...\n\nA family named Tony ... and I had a ... dollar plan my father's a na\nNa\nNa na na na na na da da da\nDa da da da da de ... press you\nKnow uh I'm not saying I Am now fighting against them very liberal not only that but you\nHave a bell curve resides in tandem on a ... show them a ...\nA ... a lotta time na na na na na na na na na na\nNa na na na na na na na\nNa [noise] [noise] [noise]\n\n[noise]\n\nOh\nGod oh that's what I Want the\nPilot says it all the big screen TV [noise] you know my favorite sport in the in all the news report\nOn it it just means well written and we never seem to get in\nOr something but I live in Florida about home if they will buy low income at all of them on is that it may\nNot like some stranger ... man well we'll just car wrecks that in fact she also or am I Want to say and you know\nBeing in a while\nOn right now there's been no right now ... like they live in a while and then we'll ... we'll do our own little world as Don ... again there are other guy\nI'm getting a real a man a\nRecording and the man to\n\nTrial and you know as a holiday thing really I don't know that they\nHad little pony ... they believe found a shooting ... three ... three in a timely manner me on the you know you know ... you\nKnow a lot of um oh\nYou are saying it's always been this way you know a ...\nI'm from buffalo all around the world and all that again and no one really about ... ...\n\n... dollars was a well known to be\nA lot of people out of how how liberating pretty nasty maybe no ... you know my\nFavorites or um you know it all and we want to be on a hand to any of them now you know ... you know I don't know how to God I\nKnow a lot I'm\nA ... a little\n... a barrel yeah yeah I don't know how\nI Am a ... or\n... or\n...\n[noise]\nAnd\nIf you knew in my life is just that moment would you let it dissolve and live over in a new life is always using [noise] why would you stand in line waiting ... now and then you ...\n... a bit so that is right near where did you spend any of your time today\nThat it would be a new minded London and what did you make room so negative long I knew the lowest level just speak for you or would you let them go see a lot more about through your ...\nWeigh ... pounds of our biology boy ... tell me\nOh you do on a friday and no ... no\n\nYou're listening to kill you why I wrote the law the point when F. M. K. U. R. I. L. P. upper one copy eighty nine point one F. M. projects up\nThe Hopi foundation streaming online a KU when I got your Native American public ready own station\n\n\n[noise]\nTo me now is calling from Reno forty now I Know for hurricanes\nFor [noise]\nTimes they don't even have taken hold in your lifetime and Nick [noise] about festivals going to be back down one hundred years [noise] and that is that's countries from Rock Hill in my\nMind what kind of do you how do you think twice the tundra is well how would continue to try to [noise]\n\nThis is national native News I'm Antonia can follow us the U.S Supreme Court is hearing a case being closely watched for it's possible impacts on tribal sovereignty it involves a dispute between Washington state and the gas station on the back of my reservation as me how minutes explains\n[noise] from outside than looks like any other gas station [noise] at the gas is\nActually a few cents cheaper that's because ... I got my tribal member who owns it hasn't paid a field tax on gas he's getting from out of state the state department of licensing doesn't like that\nThey argue cougar Janet was done three point six million dollars on pay taxes and fees the case targeting twenty Thirteen to lower court in Washington already reviewed it inside it with a ... nation that because they interpret it a special provision in the treaty of Eighteen fifty five this is called the\nRight to travel provision the ability to move goods across state lines without taxation Robert Anderson is a professor and director of the Native American Law Center at the University of Washington School of law\nBasically Bactrim street to thirty is the Supreme Court has routinely repeatedly help but it'd be treated sort of be understood as you idiots whatever understood them a kind of a treat\nTwelve other states have filed friend of the court brief in support of Washington depending on how the high court rules no states may see changes with the tribal nations that have similar provisions like then as per se in Idaho and the Confederate sailors and to me tribes in Montana on as a nation that is in white swan\nMontana's largest city has been without a clinic tailored to me to ... for around Eighteen months since the Indian Health board of billings abruptly close services last year\nAs of this month the cities that need a population can seek medical assistance at the urban Indian health and wellness clinic Yellowstone Public Radio's character Roche attended the ribbon cutting out the new building ... more [noise]\nThe whole crowd and the ramps leading up to the\nClinic door among them are some of the clinics future employees that includes a nurse practitioner Nicole turns plenty her\nHope and the hope of some of the other people responsible for forming and staffing the clinic is that the center will give urban Indians top notch medical care combined with empathy and understanding\nAnd I do I mean they're planning on it to feel comfortable again we represent fan fiction but at the same time that you know [noise]\nShe says good treatment as about meeting people where they are and addressing their individual challenges in treating chronic conditions\nEspecially those found in high rates among Native Americans such as diabetes and hypertension towards plenty also points to access to care as a priority that something about Leonard Smith the clinics in term executive director says can be a struggle in the city [noise]\nA lot of building so we're going over to help her victory man told her either don't have insurance or or signed up for Medicare on our first visual learner reservations\nSmith says for now the clinic offers primary services and expand as the months go on\nThere organized under the Native American development Corp which Smith directs he says in the future the clinic could partner with other groups in the community and offer services to other populations besides Native Americans for national need of news on cable that Russian billing\nAnd dime Antonio Gonzalez\n[noise]\nEspecially for somebody to for like ... year for funding is why do we walk provider of hearing loss by the corporation for public broadcasting support from the public radio satellite system like American\nIndian Alaskan builders young people are moving and says this is when you work for social work the polls November ...\nMakes a difference in Washington DC home go to native ... or more information broken you want to broadcast corporation support by being on a surf railway company as far as the commitment of armed forces members and as a top important for US military preference hovering\nOver knowing fills in the system fails and far more a soft spot for UNICEF dot com [noise]\n\nNative voice on the Native American radio network\n[noise]\nThis is native America calling ... would this tiny cheer Fairbanks, Alaska\nIn that town a Athabaskan people come together to enjoy music that isn't always associated with Alaska Natives the Athabaskan film festival starting thirty six years ago but its organizers trace\nThe roots back to one hundred and fifty years ago everyone from kids to elders from all parts of the state together to play music and dance together that's that's double features country folk blues in rock music\nTo be on the show we'll hear from musicians playing at the festival and we'll also hear from those who are involved with teaching film music and culture\nFull moon in rock music\nTo be on the show we'll hear from musicians blame at the festival and we'll also hear from those who involved with teaching futile music and culture to Alaska need to use for lifting\nNew tradition we also want to hear from you have you ever been to the Athabaskan film festival is so sure some of your favorite memories and maybe the air is film music in your community or what does it bring to the people ... who was sent him down and dance junior conversation by calling one eight\nHundred number six to eight for each that's also one eight hundred nine\nNine native and today we're going to start off in Fairbanks, Alaska to say hello to Josephine mellow Newt and she is a volunteer at the Athabaskan subtle festival and an instructor was dancing with the spirit in Alaska\nNeeded music program she is going to come at the Baskin and it is my pleasure to welcome her into the our Josephine thank you for being with us\nOh you're very welcome glad to be here\nAnd it sounds very exciting and just coming up we are going to be sharing some of the sounds of that come out of maybe the dance hall or when the festival is going on but let's talk a little bit about the roots of this festival and just how it got started strength there\nOkay well it with ... introduced a true the Athabaskan Indian is about a hundred and fifty years ago on the fringe Arcadia for travelers traders working for ... and it came down and introduce that I did the first place they went for your comment\nAnd so the native people love your thinking what they did was they picked up the instrument like and then go in and and the federal and the guitar and they kind of modified it they just kind of a little bit to treat their life\nAnd go up and he died which area they really took to the square and the ...\nOn them not to do or not we don't need to not only she based on that one eight hundred three one eighty five Ninety six on the age that patients a case of you to health care doctor a message from the Centers for Medicare and Medicaid service or a cat\n\nVideos no no no no\n\nNo no no no no no\nI'm\nSaying\nThis is native America calling I'm ... and we are taking a\nLook at the Athabaskan ... festival join us at morning hundred nine nine six two weeks for eight or here we heard from\nJosephine mellow Newt and she is a volunteer at the Baskin film festival she's also an instructor would dancing with the spirit she is ... Khan Athabaskan also here with us today from the glitch in the nation from the northwest territories we have Robert\nCan dream and he joins us today from Fairbanks, Alaska he's a singer songwriter based in Arctic village Alaska and he will be performing at the festival it's my pleasure also welcome him into the hour we'll bird um thank you for being with us and you know if it weren't for the music I don't know\nIf this festival would be what it is in a being somebody who hops on stage\nGreet you community with your town um I don't make you feel to to be bringing community together through music and especially um this festival\nOr various ah the good lord or ... or ... and that is that already are\nAnd it's also a culture and I feel when I get on stage I did because I see people like those are the set and I never see color quite quite some time and\nWe also pay homage to The Elders that passed on and we are to do this year but\nWe still go on life goes on and everybody has one and that's what you see people that make us gone to some people have fun and be strong and like you said over environment and the people and that could play with friends\nStrong and like you said like a silver environment and\nPut their people or you could play with friends that we've ever paid like Kelly and the forties and we agreed with him for a while so it's just why you're seeing there having fun with the people and it's been doing a good company and the atmosphere\nAnd the only thing I have a great and people are great and see that\nI pay and I hear you 'cause there are certain things that we haven't seen friends from a very long time or relatives and there's something that brings you together and you know the music is good or ready and then when you have that kind of thing going on\nOr meaningful to a dance with a family members or that special someone or someone um it really you know brings beans in into a really good light and I'm excited to hear more\nAbout this maybe you want to share some of it give us a call one eight hundred nine nine six to report neat well let's try average actually again or color in Fairbanks, Alaska Ashley thank you for being with us and go ahead share your thoughts\nHey my name's Ashley Fairbanks, Alaska and fifty at all I'm not at the ... I mean the Eskimo my mom is from watching Alaska who married like cat and lived Tyra Banks\nMy mom got me to say that I I started playing around a six year old ... has a higher life [noise]\nAnd actually what what does it mean to be able to step on stage or especially uh bringing your music to a festival like this and you see your community dancing together what do you think\nIt's an honor for me to get up on stage and play my ... um\nI bet and I hear that uh people are working really hard so that young people um have that pathway to this or I'm more interested in this and actually for you what has the federal ... here in life\nSeals brought a sorry to ... dot [noise] joy to my life without that subtle I probably would eat lunch is like I thought it was a fake\n... you started really young so I Can't wait to um maybe even feature you one day on this program when when you hear the album out door or a hop on one of these great bands and actually what do you want to tell people who are getting ready for the ... festival\n[noise]\nSorry say that again\nWhen you want to tell folks who are packing their bags now or getting the food ready or making plans to make their way to Fairbanks what do you want to tell them\nIt will be worth it um they [noise] they pay about ... for an hour and its country music Oh nice and pretty straight great\nThe food oh boy [laughter] very nice and Ashley I'm what program I refer who touchy the federal\nUm young native ... oh okay All right and I learned most of 'em by ear wow well\nI have somebody who is also connected to that um what are we going to introduce him to actually thank you for calling 'em and we wish you the best and really excited to hear about your passion for music it's I'm really inspiring thanks for your call actually ah\nIt from Fairbanks, Alaska and we have killing me he is even a pointer and he'll be performing at the festival he teaches young meat if employers um and also works with young\nNeeded fiddler as well as the dancing with the spirit of our pleasure to have him here and Kelly I'm I don't know if you know actually or just um thoughts about hearing how much is it all means to her um any thoughts and welcome\nTo morning a thanks for having me and it's an honor to be able to uh teach with young native ... and dancing with the spirit and I remember when\nShe first walked and she was a very young and small and and we had our first music lessons to gather and it's been great senior there every Saturday ah ever since she was six unplanned they're very um into the lead learning music and having fun and just being a great smile around\nAnd killing a go ahead\nOh I'm a that was pretty much it\n[laughter] All right and um and you are you pick and um you are going to be performing at this year's festival in having a little bit from rural bird about his excitement um can you tell us anything more than we haven't heard yet about what happens at a these kinda gatherings in in what it means\nTo pools the community together instead of music this way\n[noise] ah it is\nIt's a it's a tradition that's been going on for almost like a couple of hundred years now\nAnd is a great\nLike opportunity for myself just to be able to um to some ... some cultural values such as giving um being able to give music is like something that really gets my heart deep inside and it does for a lot of other students and young native to lose and the teachers or dancing with the spirits such as um\n[noise] um well Britain Josephine\nAnn and and I see it all while the teeth are all really happy to have the biggest smiles um they couldn't be imagined doing anything more and then when you get to the federal festival everyone's just so happy to see each other's as hugs everywhere everyone's nice um I mean just like they are all year\nBut it it's it's a fantastic time we play and we see a lot of The Elders that we've seen for many years\nAnd and play music you know each other even more\n... and I'm Wondering when the music is going can you tell where can a band is from just based on their sound down Robert any thoughts on that\nUm there's a lot of like you could tell like the prayers affect their style older guy kind of holiday greater ... I don't go by name I just go by how they play and there are there's controlled in and out of the gray and\nWe can follow along and we need a lot of people might say they're all coming in Maryland on and [noise] um we ... them and ah we just want to do our best to show that\nWe learned a lot of them and how we mix them and we try out there there have been\nNice well you know what let's give them a little bit of fun and this is a track that is coming to us from a young needed fiddler today is on book at the Athabaskan film festival\n[noise] and\nAh [noise] [noise]\n[noise]\n[noise] [noise]\n[noise]\nOkay\nYou're listening to Native American calling 'em ... wood from inside a plant blow and today we are hearing about the federal tradition among Athabaskan people in Alaska the annual Athabaskan ... festival is a touchstone for the community and sit on music on\nOn their instinct in his fostering a new tradition with native youth were listening to some\nTo the music is well today and if you've heard something you'd like to add um\nThoughts on in today's topic of conversation give us a call one eight hundred Ninety six to eight for eight it's also one eight hundred nine nine needed and that's also our Twitter handle is that you may be finding is in one of our pod cast thinks we're listening and\nUm you can join us again our phone lines are up in one eight hundred Ninety six to eight for eight is the number don't be shy we know the federal brings a lot to to people's thoughts in hearts share some of it with us by calling one eight hundred Ninety six\nTo eight for eight and ready to add to this conversation by going to another gentleman who is in Fairbanks, Alaska we have mark brown\nAnd he is the leader of the mark brown and the blues crew and he is ... Athabaskan it is our pleasure to have him back for another conversation mark thank you for being with us\nGood morning happy to be here\nAnd Mark I'm we know your style of music here and enjoy\nThe times that you have chatted with us about a year or style and\nI also understand how you're kind of music is being played at this federal festival we had a chance to hear from different folks at the immediate fiddler also Reverend Trimble Gilbert and Gregory Gilbert I'm take us to add that the other type of\nMusic that we often find at the Athabaskan federal festival going take us there\nWell actually I grew up playing this kind of music and um\nI've been playing a little festival for about thirty four years now\nI started off as a one of them guitar player when I was like a fourteen and then I began playing a lot of these\nOld timers out are no longer here anymore\nAnd now by my band is banned at a festival of the people come in as a\nLike just a singer or soul guitars or whatever will back them up with ... mushroom farm guitar [noise] so we're we're pretty diverse most most of my albums\nRock and blues and whatnot but I'm\n... pretty much everything I guess\nAnd bad and mark M. do you know any of the history of the house some of this rock and blues and countries started um you know moving onto the scene and it's not just um fiddles that that that plane keep all those hours taking um any any thoughts on the history of that\n[noise] I think a lot of it is um we're just losing a lot of\nPlayers are getting older they're less and less ah they learn out there so I'm happy that a young travelers are coming in and they are awesome I like hearing them so hopefully they'll\nKeep a traditional allies keep this thing going I I Try to play mostly country music when we're there when\nWhen my band as she could come up you keep re question they're trying to lose the one that you played on the radio there earlier\n[laughter] and maybe we can keep that up to ... to give folks a taste of it but mark um is this a time where musicians also get tonight we know there's family members coming together\nA different communities but what does it mean for musicians to come together in jam especially especially at a festival like this\nThat's awesome [noise] a lot of these guys are really talented and you only see them once here at the festival and I really enjoy it I remember back when I was like a gene\nMet a lot of the guys that are like from all over really great musicians and articulates tumble I back him up like thirty something years ago\nOh really great musicians and artists there was like I'm bull I bet you're most like thirty something years you know you just want to push mowers I've ever played much\nYeah you say sound is wonderful you know what I got a caller on the line there still time with you on to join us one hundred my nine six to report he lets go ahead and say Hi to Neal in Fairbanks, Alaska thank you for giving us a ring go ahead you're on your\nOh hello hello [noise]\nTo me so oh\nIt's okay it's radio nobody can see you go to him what do you think about this kind of gathering or maybe you are if in we're going\n[noise] uh yes I actually on the alert I Am part a nonprofit program\nHere in Fairbanks I used to be a student but now I teach young aide it lowers is a\nProgram where we teach a traditional ... games and it'll stay a RINO not the basketball player he used to helping teach [laughter] but he's taking time off and now I'm teaching a kind of take place\nIn ... when he built teach you about the importance of given music to sway\n[noise] um [noise] he told me that it's really an ... or ... and ah [noise] everyone [noise] and do it and he said it's really ought to play at these events like events around [laughter]\nCome in and when you any thoughts to folks who are getting ready to head to the festival [noise]\nUm [noise] I don't know just try to have a good time [laughter]\nVery nice I mean I think you for your call beer in Fairbanks, Alaska joined us at one eight hundred Ninety six to eight four feet Well Mark when we get on stage um but do you have another room with the the the festival um but you're quite proud of\nI'm I'm On the board but\nUm I I enjoyed backing up all these musicians sometimes I like for like six hours without any breaks 'cause everybody wants to ... them\nOh I'm honored to do that\nAnd so you know I really follow me to music and in in get excited about hearing about new tracks um you know what are some of the songs that everybody started screaming for or run into the dance floor or are there any particular ones that are some of these artists for man's getting ready to me know what it's going to do to the crowd\nWork oh I\nI don't know I I'm\nPretty much the Boston use it can sometimes I argue I'm even up or go to them are getting much stronger or [laughter] um [noise]\nI guess was first walk goes everybody loves a Louis ... song Indian rock and roll\nI played that a million times and wish I did not include it again or you every time they ask for\nAh you know what\nMaybe I'm maybe we can use some of it um [noise]\nAh I'd rather if you don't oh we're [laughter] it's like there's something called the from one of the survivors you know what\nTo do that a here's another one by the river in trouble Gilbert and Gregory Gilbert I'm civil\nMusic is a very important to some of these folks as you can hear and we're going to give you a little more teams to this but uh we have time to wrap up and you hear from some of the other folks are here with us today and uh just more thoughts about how this communities coming together you can join\nUs to one hundred nine and six to eight for eight years the number on let's go ahead this is down river blues\n[noise]\n\n\n\n\nOh\nYou are listening to KU I I don't know any like one and and and key Y. I. L. P. a permanent I'd be eighty nine point one and I take steps to her piece foundation to me on my ... I don't\nKnow this is saying can I get it may say they school if he has ever been bully Carrie teach el ... del Rey and there are ... or bring you down because you are unique\nThanks so high and I write to you by that yeah it may be the carousel and ... I ... I gladly\nWhen on music make make me but [noise]\n\n[noise]\nAh you\nKnow ... and ... I Want to do that there was a kid and all\nThat we don't believe in the long run around with a million or even when you were a buddy mode and much\nOf a you know our minds right now I I don't know how long has been a little louder on the\nShow was a low level\nI Know what I'm trying I Would say things change and we'll have to know when they were given by ... going on in a way and the way home on the\nWorld is already or ... or um to me\nAh no no no not really from la la la la la la la la la la la la la la ... you know I'm a\nI'm a I'm a I'm a stay\nAt home on here so we may be too hard or you know I'm just living here and there on the on the other hand too\nAnd I don't know if you know I had him on the news and as soon as we know now we have over ... among others along the lines are\nGames you know I live here when I when I don't know if we're a long held dream to have to run\nThat although I Do a little older though a lot of friends um I don't know how long do we want our um gosh I Know I'm a\nI'm a I'm a I'm a\n...\nBy hand ... in my I grew up around ...\nHero or they may ... you know\nNow I Know you're all out in ... and they don't show on fan I actually have a really\nLow a run around the house right now I'm only I'm only a ...\nAh no no no no no no no no no I Know you know any of it all wrong ...\nNo no no no no no no no uh uh [noise] [noise] [noise] [noise]\n[noise]\nSo ah and I have a I\nCan be due to that is your ... your own Hannah cure for me I'm\n... now and he's you know you're straight in your life is just you know in the middle of the three years have you probably know an hour I'm On a chance to\nTell you what are you doing here a year and I thought you know back then I found the Rio yourself\nBy being hollowing our downtown San rational wow oh my God my child man\nOn a long time out you know he's not a guy on Tuesday through\nThem on a new car and your body is still ... you know that you know here I Am hoping that you read some of the moon and I don't know how long are we ...\nA month on da na na na na na\nNa na na na na na na na na na na na na na na ... just random let you do when you walk around a rundown pro I and I go back to back\nThem he was a\nTown I live in three game and you know we're ... we're going on right now you're ready for your time today\nYeah ... you're right you're ready or three times in the\nBuilding ... own son is a big German learner probably player\nAnd a half hour and a son [laughter] [noise]\n[noise]\n[noise] [noise]\n... yeah we learned to cry again and they and they said that sell to live the way\nI'm ... and the value of\nIt is not that I'm just saying what candidates and a\nLittle ... to\n... as a as usual Leno over people's uh\nThere are all does the cold to you on the line um we don't change has\nBeen way too slow the ... the ... even that you will get the ducks them\nWell does that mean I don't care a less than that men tend to grow a and\n\n[noise] [noise]\n\nOh well oh oh oh oh the ...\nThe people who\nYeah for some things to say well too bad where will they I Can't remember but just the way you\nKnow who\nRide it so they they well they call the judgment day George ...\nMy ... year within three\nThree and a lot of all the way it is a\n... baby low ... thing has been giving that well in the pool was\nIn a\nPool so\nThey were listening to you know what you're seeing a\nChange the law but oh a doll\nOut in the street signs frog legs or is it the damage\nOne thing I Know people can do that or\nWe're going to worry about their thing and then there was a\nMan you know David Letterman well do you think it's been in may and will get way more\nThan a ... you know I Know a miserable\nYeah they when they said well if they don't want to do\nOr [noise]\n\n[noise]\n\nOh yeah no no no no no one was an early age he needed to talk of\nAh\nPeople laugh and say you were to create any fact than when they talk\nA downtown and sign a\nFan of them we pray for him no yeah\nYou say a plan to\nAh you know those are you saying\nThen ... will give me\nA little town a baby is a law here in LA so here's a [noise]\nA a [noise]\nA a [noise]\n[noise]\n\n\nMm Mm Mm Mm Mm [noise]\nNo no no no\nThe cruise ship was ... when the girls are not in a vaccine that from ...\nTo ... I spent my dream was to that Jim ... who would feel better and the morning and then she\n... the\nReason why one and ... and she\nI usually\nTake a call ... ... ... ...\n... to talk about you and how hard I'm relationships are\n... both worked through ... through the Jewish but in ... in fact you know they break my heart three ... of the rich and the tone of voice but you've got to run\nFor sees\nMore uh drinking do they know the ... the man she\nIs the way he\nCalled na na na na na more across the nine eleven and\nEverything in the low ...\nNa na na na na I Know you're in the near side to the point yeah yeah and I have to get a process of law\nAnd\nYou know we probably na ... burdened by then\nI don't know do you do you love your love do you like oh yeah oh yeah I get a ... na\nNa\nNa na\nNa na na\nNa na na [noise]\nIt was the tale of a common even Spielberg present and\nNow let's take you to hang in there was more like some pictures that are being the dog and my ... because you know me on the president to\nFurther their windows you always get missile then I can you tell me about a much knowledge and ... oh\n\nShe is way any any\nReason ... and she\nHas a way\nYou're going to cross the line and ... and ...\nOh look killing people for a man and a lot of voters sign\nIn the last two years I knew about it is a writer ... na na na ... in in\nA little under a ... a flood of\nFlying in the last two years left or right after I moved down to the person to another and then the\n... [noise]\n\n[noise] [noise] um [noise] a\nNa na na na na ve hello over in a\nBusiness a business from all over and\nOver ... from a losing ... ...\n... in the day and so do you live alone\nAnd na na na\nNa na na na na ... Mm well the last one I used\nTo live here from ... or ...\nYou know Mm\n[laughter]\n\n[laughter]\n[noise] that's why I'm not going to be coming to school and I don't think that\nYou were only music make make mix [noise]\nYeah you're going to be your pride over here to care about phishing forgot walk with someone watching me why they wouldn't want\n[noise] want to talk\nTo\nThem\nThat much man an average life I from nine to five days right to know when you look at what point do you know\nI don't I don't know what\nI'm going on for like two or three or four people call me on the train to Hawaii with me and my mom I don't know\nWhen I'm On my house 'cause I'm In my mind the rain\nMan when I was in I mean like\nWhy I Know I'm a big time time Tom Landry going on [noise]\n\nI\n\nNever\nKnew what they want us to talk about I Wonder how can you know I don't\nKnow I don't know that I don't know\nI don't see how about the\nCommon man I Know how\nTo do\nI don't know how\n\nThat comes on like a row but em robot and no I don't get to do and uh yeah but you better not to rely\nOn a plane\nThat I'll be ... well a lot of the\nDay the thing that I met a man and I really do know that it'd be under your yeah\nLaw I found a new and\nAll that I've been around been well\nLet me make you up at me and my roommate I did get to make a comment from top to\nBottom out our make your bona done things like oh my God I'm not ... I'm not I mean you know I Do miss ...\nNa na na na na\nNa na na na na ... around a lot\nTo make them up and I'm not going to make sure that they're just to make one comment we don't wake up in a while\nThey're not going to need I don't know that I've done my job is better than I Do miss out\nOn bond that I have\nBeen around a lot\nOn and on and on and on and on and on and on and on and on and on\nThat was the coasters right there with poison ivy got more songs for here like ... ... my ...\n\nMy ...\nOne of the many Muslim or about a quarter\nMile and a lot more money than they do a hospital or a\n\nDog in my\nMind that may have a\nLong\nLong long\n\nAh what made me away my\n[noise] [noise] unless you're talking about how God\nWho you know God [noise]\n\nYou don't you don't [noise] [noise] [noise]\n[noise] um\n\n\nNa\nNa na\n\nYou are listening to you why I wrote the law eighty eight point one K. U. Y. I. L. P. upper ... being a nine point one\nProject up the whole ... dreaming online that you are I got that your Native American public radio station following a pariah Judy partnership between ... knew why eyes the radio and pay and a new Arizona Public radio [noise]\n\n\n[noise]\n\n\n\n[noise]\nOoh\n\nWe'll be right in a basket of stubborn to the foreign ministry to be children no uncertain terms that didn't ... actions is totally unacceptable message that's what's further enforced by the prime minister ... who described Iran's behavior as medieval\nDenmark has also taken the risk of immediate and recording at some facet of from Iran and its consulting allies about new sanctions Iran says the accusations are conspiracy bites opponents the parents'\nFunerals are underway for the victims of Saturday's shooting and Senegal in the U.S with your pets back in ... was killed in what's thought to be in the west anti Semitism attack in recent us history security has been increased head of the ditch and the next time by President Trump John cycle is in Pittsburgh\nIn the wake of today cynical Mexico the president condemned anti Semitism unequivocally appeal for unity but his visit to Pittsburgh later today is not having much effect\nThe mayor of Pittsburgh and several other elected officials are refusing to meet those from a distraction at the Jewish community is also boycotting his trip to the city\nThe leader of a group to speak for a number of left wing Jews so she wanted to meet him until he probably didn't know these white nationalism they feeling between Donald Trump's fiery rhetoric and the increasing incidents of hate\nCrimes United Nations human rights chief mature about Gillette is pressing Saudi Arabia to lead independent foreign ... joined the investigation into the manager at the dissident gentleness Jamal ... she got Jeanette edge the Saudi authorities to reveal the whereabouts of his body to enable crucial forensic examination\nBut the ... former boss of the Boston based crime gangs being found dead in jail the FBI has become an inquiry up in the body of James Whitey Bolger was discovered a maximum security prison in West Virginia us media reports say he was killed his Nick Bryant\nBuddy told you it was one of America's most notorious criminals have been on the run for sixteen years he was actually captured in two thousand and Lebanon in Santa Monica California following a tip off from a neighbor or ever since his conviction he was convicted of a big ... eleven brothers and\nA mobster activities and included gambling and he may even our rights gun running at one point he was held a very high security facility and what is\nInteresting about the timing of his death isn't it happened just a day off so he was moved to this very high security facility West Virginia\nYou're listening to the nation's wells news from the BBC\n... have agreed to begin the repatriation of range of refugees in the middle of December November despite a warning from un official conditions and I'll write for the advertising five thousand refugees have been identified as a fast return ease over seven\nHundred thousand range of Muslims fled a ministry operation which began last August in Vietnam most or in camps in Bangladesh but ... says it doesn't have the resources to support them\nNigerian security forces fired tear gas to break up a demonstration in the capital Abuja hundreds of Shiite Muslims protesting at the detention of ... to ... he has been in government custody twenty Fifteen to cash in between his supporters and the ministry he faces charges of inciting violence\nA top South African criminals ... who's trying to Judy ...\nIs being shot dead in Cape Town feed me a headache represented many high profile people including some of ... but he said that searching for the bank to drive away from the scene no details from hunter hunting in China's back\nGovernment approach to Pete how the cars he was dropping his two children also school Cape Town to my father to the wind up killing the lawyer endangering his eight year old from not being treated in hospital\nColic who's well known to defending clients allegedly linked to Capetown criminal underworld it's widely assumed that his death was linked to that perhaps to a gang tough war in the city there on our warnings of revenge killings Israeli security forces attacked\nWith local people opposed to holding a municipal election to the town of ...\nIn the occupied Golan Heights is the first time count composer being organized in the region since Israel captured in from Syria in Nineteen sixty seven many members of the towns Arabic speaking Jewish community still regard themselves as Syrians Hamas job hunting station waiting Syrian flags\nBBC News\n\n[noise] [noise] Hi\nMy name is Ryan earning home I Would like to lash out of the cats happy chicken cheating and be the hope you guys get lots of candy and anything that don't eat much haven't checked out and happy Halloween ...\nWas a [noise] a tone for nurture mirror nukes you Joe under\nYour car you why community calendar\n\n[noise]\n[noise]\nUh\n[noise]\nOur Ryan welcome to the Y. time now it's while boy here in decay you why I studios and one way or do the people who are on daylight savings time and it is\nHalloween is this Tuesday October thirtieth two thousand\nTeams and here is your community counter updates [noise] first K. you why I cannot be heard of villages are amongst coffee on eighty nine point one FM's below par FM should know as a hundred or a wife and reaches approximately ten miles\nGo to Kay you why I Don announcer donate and support K you why I finally reaching all hope you've illegitimate and she's been are hoping voices and broadcast strong\nStay tuned for our official on [noise] as we continue to seek airline assignment K. you why I now located at the gym you know to sixty four in eighty seven in second mate or can you why I tell them what number is nine to wait three eight five five zero five\n\nAll righty I'm back with your updated whether borders Tuesday October thirtieth two thousand eight team first step kings canyon tiny at sixty eight this afternoon mostly cloudy with a temperature bond to around fifty one by by PM southwest when Thirteen and Fifteen miles\nPer hour becoming northwest tonight a chance of rain showers before eleven PM [noise]\nPartly cloudy with a low around thirty one or two in six to nine miles per hour\n[noise] because most of the bill is currently at sixty eight this afternoon Park Dietz I knew with a high near sixty three jobs ... sixteen miles per hour becoming ... tonight a chance of showers and thunder storms before eight PM partly cloudy with a low around\nThirty north when six to eleven miles per hour might be too by city area attorney uh fifty six and partly cloudy this afternoon parties I knew where they temperature bond you around fifty one by by IBM west when eight to fourteen miles\nPer hour becoming north northwest tonight eight by chance of showers and thunder storms before eight PM partly cloudy with a a lower on thirty three north when I've been to eleven miles per\nHour [noise] they're not all day Michael's area current yeah fifty seven and partly cloudy\nThis afternoon scattered showers and thunder storm multi party with a high near sixty west northwest when Thirteen sixteen miles per hour tonight rain showers likely before midnight [noise] Patty during the early evening then gradually\nClearing where they lower on thirty north when the eleven miles per hour\nWinds blow currently at sixty by mid afternoon I'm isolated shower John thunderstorms part depending where the high near sixty nine dollars chocolate when eleven to sixteen miles per hour tonight a chapter showers and thunderstorms mostly crowded\nThen gradually becoming most of the clear winner low around thirty eight northwest when six to eleven miles per hour last but not least by ... the war with a B ... board at the afternoon scattered showers and thunderstorms mostly crowded with a high near ...\nWest outlets when cancer Thirteen miles per hour tonight a chance of showers and thunder storms before nine PM market cloudy with a a low around twenty eight ... Thirteen miles per hour and\nThat's your updated whether burgers Tuesday October thirtieth two thousand eight Jean\nAnd for more information on the weather or you may go to weather dot G. O. B. and that can wrap it up for your updates time now is Dr Tony ... here in decay you why I Do videos happy Halloween to all UK you why I\nListeners out there who are having a great day getting ready for that big bay to go trick or treating tomorrow\nRemember be safe out there to make sure you gather your ... your flashlight and please be careful on crossing the street and to the cars out there we drive low will be having our children running around\nOut there for treating tomorrow night and tomorrow all they do that job\nMake the grid evening and happy ... me\nRoad light and tomorrow base so let's do make the big ... and how the how do we need\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise] [noise] [noise] [laughter]\n[noise]\n[laughter]\n\n[noise]\n\n\n\n\n[laughter] [noise]\n\n[noise]\n\n... [noise]\n\n\n\n\nCool\n[noise] [noise] [laughter]\n\n[noise]\n[noise]\n\n[noise]\n[laughter] [noise]\n\n[noise] [noise]\nOr a [noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\nYeah [noise]\n\nThe new\nRight\n... ...\nS or [noise] [noise]\nUh\n\nNo\nNo no no [noise] no [noise]\nNo no no no no no no no no a\n\nHigher one dollar everywhere and what does this by and I ... on the Monday three legged jak this is an family man [laughter] what what I thought that would be wrong to not know what\nI was laughing at McDonalds happy and I got to get it on down there and watch it [laughter]\nI don't know if I had only been out the window a shabby and my mom my\nMom and I know I Can't wipe out\nBy around about it I don't like the one hand picked on my career and I\nLive in ... when I found out that\nNine one one and my mom I got mine when asked why mommy what\nNow that the children are being made but look there's nothing nothing and no one will do what I was wrong with that part of the things that ... [laughter]\n\nI guess ... hours and hours and\nI found out about our I never thought oh essay by body kind of I don't know I Want to know what's going on\nNow I don't know\n[noise]\nIn New in the news in in any\nAny do me any news in the news\nAnd then my mom heard loudly in Iran Jonah when they're the ones\nThat I didn't know how long they\nCan now\nThe wild learn about the little man my\nName's ...\nJones and my plane and I do allow me to\nBe with a minimum and all of them by allowing me to do all day and then my mother did not get the most time on the sand dune\n\nIn Mali was on and how do you\nKnow leave me down\nIn\nIran maybe no I got\nThe [noise] other you know I'm probably know than bono [noise] in all the\nGames and he\nKnew the ending in [noise]\nIn Nineteen eighty nine\nDi di di di di di di di di di di di di do in\nA way and I don't know you see the di di di di di di di I made it home\nAnd and\n... even ... di di di di\nDi di di di di di di di do\n[noise]\n\n[noise]\n\n\nAh [laughter]\n\n\n[laughter]\n\n\n\n[noise]\n\n[laughter]\nNo no no no no no no no [laughter]\n\n\nAnd by my side my mouth or on the bottom ... go to the mob was done by\nSome of my last call on any of them are so la la la la la la la\nLa la la la la la la\nLa la la la la la la\nLa la la la la la\n\nLa la\nLa la la la la la la la la la la\nLa la ... by the way it was a\nStruggle but you\nKnow a\nLittle more you learn when you're on\nYour mind to laugh because I don't want my [noise]\n\n\n\nYou are listening to tell you why I what Bela eighty eight point when Ben dreaming online that can you why I dot net and K. U. R. A. I. L. the upper ... eighty nine one one project the Hopi foundation huh [noise]\n\nI I\nWas going on at the pong pong pong pong pong pong pong pong pong pong pong ball I remember\nI I have one dog and very night you know and ... our dog and not a last resort rely on that on ... on the gravy August for you but it's not an avid about him only\nGoing to a buyout are not allowed to like Miami Beach a lot about my mom that\nHumans have well they do from the\nRegion about right now involve oh man well their mom dad Danny\n... bomb bomb bomb bomb bomb bomb bomb bomb bomb bomb bomb coffee shop or oh my gosh\nAnd dragged by ... even in a bag with them all out on death row powers yeah just to add on all the plot and dream\nBy the new Obama campaign ... but all of a sudden we lost by ...\nSays oh well let me out from\nUnder the radar from the logo of their grade your gall right any great about wall man or a bad day\nPaying on the phone call from a phone call from a mobile phone call and\nTell me oh buddy you know I get into the ground he followed him out on the other side of town and yes and without a doubt and age and you didn't do that and I know I'm not going out and like oh my I guess the word\nAlthough I haven't gone on to the graveyard at all I did I [laughter] I Do agree there from not bad you know\nA great job doll bragging joke God whoa mad wild and you're a big bang\nBang bang\nFor our our our number\n... ... ... ... ... ... na na na na na na na na na na na ... an\nHour on a show you a story of ... and ... then it blew me all alone then you will the ... most of it I don't expect you to believe\nThe ... the ... the traveling as a real good time but it ... and ... that are no ... no windows and there ain't no dog that\nMay be ...\nDistrict and all\nThis by dripping with the guy that re ... the ... the bar that many ... threat out a dream yeah that may\nDo ... do you know\nJust leaning on my shoulder and the ...\n\nAnd her ... na na na\nNa na na na na na na na na na na na na na na na na na na na na\nNa na roller no no no no no matter\nLong it'll take you to share Britain and the ... ... miles from the needs of blend in\nThe ... the globe may and then they know how long do they do do run home ... ... ... the bag ended up by the mine mine\nAnd I want to you\nAnd you you were in ... in the back end up by the mine mine\nAnd I want to see you in a jam those lines where a man man and all of them die that may be due to the drink at all been my dream again on me now that\nMay ... do you know ... ...\nAm Darren in Michigan I go to the bar that may be the new ...\nNew Jersey now my job in this great out and dream yeah that may do we do and then you hear me now my cell\nPhone and then ... the ... on a jury in the in the\nNa na na na na na na na na na na na na na na na na na na na na na na na na\nNa na na na na na na na na na ... ... ... ... [noise]\n[noise] [noise] [noise] [laughter]\n\n[noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\nNo matter how bad record amount I [noise] have\nMove on to me [noise]\nBut you know I noticed your child when they want for the first time it's easy for you to notice what their favorite foods are you remember exactly when they said hello in your native\nLanguage you notice when they do well in school and even what friends they hang out with yet one thing you may not have noticed is that they may have\nAlready had their first drink of alcohol nearly one third of youth beget drinking before the age of Thirteen when children start drinking or we the or six times more likely to have alcohol problems when they're adults\nHave a conversation with your children about under age drinking\nTo learn more about under age ... to prevent you please call a number seven to nine six six eight six or visit speak with them dog S. A. M. H. S. A. dot Gov rough to you by the U.S department of health and Human Services and the ad council\n[noise] [noise] [noise]\n[noise] [noise] hello I'm ... brother there's just so all the time and they were looking at this point one [noise]\n... ...\nWhat's your what are we going to learn how to oh why oh\nWhy not do that or the world man or well the new novel a let me know what am I Alone and trying to find that oh ...\nOh yeah ... oh man I Love ... ... well yeah they ... on a\nWhole new world ... well oh he ... me\nAnd I think that that's [noise]\nAnd there and I think I mean I think I I I remember I I've never been there\nAnd you know we started and then they're never going to come in and you mentioned that I mean the\nYo yo yo yo yo yo\nYo yo homeland poll a yo yo yo yo\nYo yo yo yo yo yo yo homey way way up in a in a you know when I'm not I went oh I Know I never went back and I know that\nYou're going home\nAnd I do oh are you going around the name of your way way down to you and your ... will not let my time with my nine year\nOld and they are and I remember I remember like that and I know that there are\nTimes when I was [noise] I\nDon't know I\nDon't know I I Know I I remember when I knew\nThat [noise]\n\n[noise] ah yeah hey I just I guess I've been there but I\nHad an effect on our energy hanging out and said oh any time you are there now and\nThen there is an Indian\nYo yo yo yo\nYo yo yo\nYo yo yo home where I work on it you know a way that you know Neal and I want to weigh in on the\nRadio that high on a on a yo yo yo yo yo yo yo yo yo day go by and then\nWhen I when I Know I you know\nAnd then there are there any other than that I mean that's\nAn interesting but then there are there\nAre different than than you know I\nDon't know if I don't know\nI have never been done and what not and how I\nI never ever and ever and I read in the end of it\nAnd they can do that and then we'll\nGo and get in there and they and they will get in\n\nThere and you're done\n[laughter]\n[noise] [noise]\n[noise] [laughter]\nOh oh I don't know oh I think [laughter]\n[noise] [laughter] somebody that\nBoth glad you did a study that the study I stay at a buffet and data but that is that uh that that is they did a study you know day to day that's bad for a\nLong row row your boat every room in a little mom and I don't remember when I don't know a lot of rumors going around on the line on minimum or\nAny of that but I'm not really a blessed that isn't the Bible and the women a lot in the left out and said oh\nMy God did I say I love that man I Am a I'm\nA new movie um but yeah I'm a member of a sad day for me you know the and we have seen a lot of people around them and\nDon't know why don't you\nKnow why and how long have you\nKnow now we're going to try\nAnd they're kind of a man [laughter]\n[noise] [noise] [noise] nah [noise]\nI'm [noise]\n\nI'm ... I'm sure you don't try\nAnd I know and [laughter]\nWrite jam or and and you\nKnow Jerry Maguire on my way back when my grandmother\nWhen she sang\nAnd yeah I I Am I [laughter]\nGuy guy\nAnd [laughter]\nHey I Am\n[laughter]\n[laughter]\nHi this is Eric and start and you're listening to under current times are you Native American music on here to say [laughter]\n\nWe just next door been there [laughter]\n... or ... or ... but there is no no no no I'm not ... you know can come in or is\nThere were thousands serve food through those trends you\nKnow one is like you see your ... your\nDa da da da da\nDa na na na na\nNa we love for my own daughter you know and and\nI knew what was I mean do we know you're standing next to Sean then\nHow do we know New York but he\nDoes the word\nThe name of one another to oh\nOoh ooh\n... who know mom\n\nI'm not sure there's a new\nOne of many characters requires in her one woman show where she did oh yeah maybe a decade ago\nYou see\nOne of the many characters equation or one woman show where she did\nOh you know maybe a decade ago no way I'm a real real and what's the name of it maybe the album came out just well I Would you call it the original cast recording one\nYeah never got our baby you're the best and it was river people's ... Dan bear pour into beta and\nRate for the riff raff hungry goes from the navigator ... with us to Tony Curtis if you just turned ... welcome Greg\nRelay swimmers on the way and you know it's kind of ironic I think about it now the blues rose up in the u._s. yeah it took a bunch of Brits which do for the boys to teach us about\nSo you know however you get they get their right and this was a big teacher for me for a lot of people were students and his band he always\nRecruits you end up becoming Joe for his job and it was a kid named Eric Clapton yeah regarding job in the air makes we were we were not a ring a bell anywhere you're there oh you're [noise]\nNa\nNa na na na na na na\nNa na na\nNa na\n\nNa na and\nLow over all the real dream minister\nAnd their farmland to na na na na na na na na no they're really good thing\nOr whatever I don't know you are now\nBut our daughter so do you want her to [noise] well I'm In new na na\nNa\nNa na\n\nNa na\nNa na and [noise] [noise]\nYeah [noise]\nWell [noise]\nNa na na na na na na na\nNa na na na na na na\nNa na na na\nNa\nNa na na na na na na na na na na na na\nNa\nAt home and abroad and ask K O L L stop or CLA twenty twenty leading to his family on investing in informed risk taking like ten square collaborative powering a network ... fresh related Sam spear weapon learn ... square dot org and from the philanthropic foundation\nCarnegie Corporation of York supporting innovations in education democratic engagement\nAnd the advancement of international peace and security at Carnegie dot org [noise]\nOur radio international\nToday the downtown Flagstaff community library\nInternational\nIt either downtown Flagstaff community library hopes I Dream of streaming there are two events noon to one thirty and then again\n\nYou know you noticed your child when they walk for the first time it's easy for you to notice what their favorite foods are you remember exactly when they said hello in your native\nLanguage you notice when they do well in school and even what friends they hang out with you one thing you may not have noticed\nIs that they may have already had their first drink of alcohol nearly one third of youth began drinking before the age of Thirteen when children start drinking early the or six times more likely to have alcohol problems when they're adults have\nA conversation with your children about under age drinking to learn more about under age greet you prevention please call eight hundred seven to nine six six eight six or visit speak with them\nDog S. A. M. H. S. A. dot Gov rough to you by the U.S department of health and Human Services and the ad council [laughter] [noise]\nYou are listening to KU why what below eighty eight white one F. M. N. K. U. I. L. P. upper ... eighty nine point one FM projects do the Hopi foundation streaming online at K. you why I dot net your Native American public radio station\nThe view why ... ... ... ... ...\n[noise]\n\n\n\n\n\n\n\n\n\n[laughter]\n\n[laughter] no [laughter] no [laughter]\nNo I um I [noise]\nI'm a I'm a I'm a [noise]\nA a a\n[noise]\n\n\n\n\n\n\n\n\n[laughter]\n[laughter]\n\n\n[laughter] no I um I [laughter] I'm an\nEye on 'em [laughter]\nUm [laughter] um [noise]\nI'm\nIn a life that you know by the no but he you know but he ... to ... [noise]\nI'm never going to lose the new\n\n\n\n\nBook you lose you lose\nYour age you say you know [noise]\n[noise] [noise] oh\nNo I'm One of the charges me\nOh you do it no no no my\nSon would never known a hey hey man good oh [noise]\n\n\n[noise]\n[noise] yeah yeah\nYeah yeah you know the way the way you know\nAnd then\nOh say no but we don't know it may well oh man we're going to run again\nIn my opinion you know a guy and\nThen and they try to get up and let me do it in my day lay in bed na na\nNa na na na na\nNa na na na\nNa na\nNa na na na na na na na ... I don't know I'd rather than what can I have no no no\nNo not right now and um\n\nWhile well a ritual when she was not the burden on the level of oh no no no no I'm a friend of mine she saw or to\nSeek to hold a job you know know what I Need to know there are now\nBeing ... by a woman in the winter a lot more you know ...\n... well I'm a I'm a I'm a ... years we're all going to have\nA um I'm a I'm a roundabout stranger about\nLaw or mom for a new mom my mom were forbidden from a movie when I Do for a long time I would do a little hole a long\nRow on another one worry about ... how much I'm a mother\nBreak at all levels again ... no ... ... you're learning a lot to do well no no no no I'm\nNot real good ... well not well they can ... or ... na\n\nNa\nNa na na na\nNa na na na na\nNa na\nNa na na na\nVery well but I Know I've got a name on a\n... you know I\nIt is nowhere near her older know around\nThe world are I'm Still ... a little while\nOh no I'm Still a\nLittle while and we're now\nWe're we're a little world as a voter when you were from all over\nAnd over and over and run around and there\nWere there were or where\n\nWhere were you know or care who they are on the road and we're going on and so much better\nAnd better for your time\nAnd I go to run their their where there are better\nOr [noise]\n\n\nOh oh oh oh\n\nNo no no no no no no\nNo but I Do I Love what Mitt oh no\nNo no no and then all of the ...\nThe no no you're no longer a boat and then come on no more than ... ... ... you\nKnow the answer as well\nSo I'm ... right na na na na na na na na na na na na na na na na na na na na\nAnd everything and the whole\nThing and a loss for a little like when I'm when they do that by the by the no ... I'm like oh my lord I mean and\nThen ... no\nNo no you didn't follow them no no there isn't really well no no no no no\nI'm saying but I Am and buy me a long time and then I'm going to run and I'm Glad to see that in that I\nDon't know I think long and then and then go\nWildly but let them know that\nThere are no no no no and I know that in order to live than I Am not allowed to stay home and they're all over\nThe world around them wrong on that Iran a man or no no no no no no\n\nNo no no\nNo no no no no no\n[noise] [laughter]\nYeah and and and uh uh\n[laughter] and\n... and ... [laughter] and trash\nFish fish\nAnd on and and my son Josh and\nEvery now and [laughter]\nAnd and where you're writing and ... and ... are you know I\nI'm an engineer and now I'm I'm Jewish\nAnd I'm thinking oh my gosh what I'm saying gosh I'm I'm nowhere near ...\n... ... ... ... ... ...\nAnd now we're in a hotel room in that building on the map and you got all of them are in your yeah when I woke up there but he didn't want to know all\nThe ads and jam one day\nAnd and\nHave a real value in it and it is now saying over and\nOver again [noise]\n\n[noise]\n[noise] [laughter]\n[noise]\nOh oh oh oh oh you're in a ... ... ... you know\nI was a la la la\n\nLa la la la la la\n\nLa la la la la La Guardia\nMa ma is not\nA lot of there being [noise] my\nMother in law that bans love that than they did they look like I'm I'm a\nBit about that day in young when I was over by young going with a bang bang bang you know a young girl non\nNot long ago I thought about\nThat a lot of low level [noise] but I'm I'm a guy or gal I saw it on our la la la la la la la la la la la la la\nLa la la around how long do you feel about that they want to do [noise]\n\n[noise] [noise]\n[noise]\n[noise] I'm a ...\nA lot of men da da da da da da na na na na na na na na na na na na da da da and a\nA guy and I'm\nLike oh God oh la la la la la la la la la la la la la la la la la la la that I'll do what we do a lot of the two\nDays with them I said my name is Darren [noise] yup oh it was about a style in my day and then gone they don't mind ... na na\nNa na na na na na na na\n... la la la la la la la la la la la la la di di da dum la la la la la\nLa la la la la la la la la la la\n\nLa la la la\nMa ma ma and pa\nAnd I'm not then they go oh my name's Daniel\nHow are you in a diner and that they're young young all up and you're going to go with a\nYoung girl a [noise] a lot about up by\nGo go a little bit of a guy on the Bible about la la la la la la la la la la la la la la la la la la la la I'm Out in a row\nA la la la la la la la la la la la la la la la la\nLa la la la la a lot of what are you a lot about what a what a what a lot of the other\nSide\nHello this is virtually Jane I'm from the ... and ... they're going to have now the whole puppy and I worked down here at the Vietnam cultivated\nPhoenix, Arizona and affiliated with that well but the thing is the ... and I'm also a failure with the hurting at the airport and you're listening to you why I eighty eight only one that them\nSo line K. U. I. dot net Native American public radio station thank you\nTo be like a used to say to see like you say like you say okay do you like to say\nGoodbye but I Want to buy\nA plan to buy a home run on my on my on my mind but I'm I'm a I'm a\nI'm a I'm a\nI'm a I'm\nA I'm a ... by my by my by my not my mother and father in law\nIs not a lot but I have a\nLot of time on the news and the na na na na na na na na na na na\nNa\nNa na na na na na na na\nNa [noise] um I'm\nA I'm a\nMan [noise] [noise]\n\nOh what\nAre the ones who are you going to a lady man [noise]\nYou know\nI'm going\n[noise] um\nI'm a\nI'm\nA you know a a\nA um [noise]\n\n[noise] oh\n[noise]\n[noise]\n\n\nUm\n\nYou are listening to kill you why I Hope the lower eighty eight point one of them streaming online to kill you why I dot net and Katie Y. L. P. upper ... eighty nine point one FM projects of the Hopi foundation\nYou are listening to tell you why I what Bela ... why NASA and streaming online at the Y. I. dot net\nLow much are you why our listeners this is chief of police Jamie ... with some Halloween safety tips parents make sure your kids were costume that is comfortable reasonable and won't make them trip\nKids be sure you can see out of the costume and we're comfortable shoes for long walks ladies and girls avoid those high heels to prevent spooky sprained ankle\nAnd carry a flashlight or glow stick one trick or treating it as best to go out early during the daylight hours besides you'll score better candy be accompanied by responsible person who can help you look out for your safety like an adult or an older relatives staying well let's street and only visit houses with their front entry lights on rock\nDon't run be respectful of other people's homes lawns and property make sure you have a charge cell phone with you and remember your parents' phone numbers program or police department's phone number nine to eight seven three eight two to three three or two to three six and nine one one into your phones\nDo begin stuff in your face with candy as usual from house to house\nWait until you get home and have an adult inspect the candy adults remember to consider allergies like peanuts and other foods motorists please keep your eyes on the road not on your phone and watch out for our kids and dark clothing so maybe running across the road or starting in and out of traffic\nBut most importantly have fun and enjoy this Halloween season responsibly this message was brought to you by the CIA law enforcement Hopi agency in partnership with the K you why I Hope he radio\n[noise]\n[noise] how do you do boys and ah\nMy name is Alex and I'm delighted to find that you believe in goes off to all they believe you can only comment unconsciously returned the\nFavor as a matter of fact I tell them human stories all the time and they enjoy them in ... now costs the best way to listen to ghost stories is with the lights out there is nothing like a dark room to crank ghosts\nAnd human life to have some of our mutual friends come into this with you all the lights out good jaws close [noise] blind\nRoad excellent [noise] don't worry about the go skating in they can stay with us through the holes on on the doors you know now just be quiet [noise] yeah that's a good now liberals yeah\nWe can begin festival let me say that I've always been curious about those things which makes the average person's\nBlood runs cold with the Arabs are [noise] but then the average person becomes upset over such simple things I was a jaw opening\nFootsteps in the whole\n[noise]\nAn old and ... hour\n[noise] and they make such a fuss over a simple things like the ... of a buzz wings [noise] goes voice on a summer evening\n[noise] for that matter a dripping faucet as we seem to have\nHere [noise] but you and I are about these things [noise] however it might be best for me to get her rent and Tom that war off completely [noise] while I'm doing that why don't you listen to the ... story [noise] the haunted\nAnd the whole [noise] on the bottom [noise] it's about the housing shortage\nMother or your email all about the on and how he knew that I Belong to a Don married but she would never talk about it he said the stories about the house\nWere selling nonsense and that they were no such things as ghosts in Harlem villagers weren't a lot of superstitious idiots she would be able to rent the house and then she would have enough money to buy Jimmy some decent clothes and best of all taken to the movies as often as he would like to go\nAnd they thought about the house and a lot if he could only prove that wasn't any ghost\nAnd so one Saturday morning when he was I was in the village Jimmy ... the key to the haunted house started out nothing to be scared I'll be told himself goes on around in the daytime but when he pushed through the dark gloomy pass and looked at those blank dusty windows he wasn't so sure\nHe walked up to the porch and stop his feet didn't seem to want to go up the steps it took him nearly five minutes to persuade them to move but they finally did they marched him right up to the door and Jimmy put the key and the keyhole\n[noise] it turns when a sweet Jamie pushed the door open and went in\nThe hall was empty and then as he stood there and listening to the bombing of his heart gradually the light thing the whole group darker and darker or is this something huge had come up the courts behind him and still they are blocking the doorway than the door all\nBy itself again will swing shot and before you can stop it closed [noise] and it was while he was calling frantically the handle to get out the Jimmy saw because [noise]\n\nIt was all white [noise] hang gliding slowly down the stairs part [noise] generally have governments aren't\nPart status [noise] didn't stop until he was well down the road and you have to catch his breath I sat down on a log for who I thought I assume that coast golly had was\n[laughter]\n\n[laughter]\n[noise]\n[laughter] [laughter]\n[noise]\n\n[laughter]\n\n\n[noise]\n[laughter] [noise]\n\n[laughter]\n\n[laughter]\n[noise]\n[laughter] [laughter] [noise]\n[laughter]\n\n[noise] [laughter]\n\n[noise]\n[laughter]\n\n[laughter]\n\n[laughter]\n\n[laughter] [noise]\n\n\n\n\n[laughter]\n[laughter] [laughter]\n[noise] [noise]\nOh no [laughter] [noise]\n\n[laughter]\n\n[laughter]\n[noise] [noise]\nOh no [laughter] [noise]\n[laughter]\n\n\n[noise] [laughter]\n[noise] [laughter]\n[noise] [noise]\nOh my God [laughter] [noise]\n\n[laughter]\n[noise] [laughter]\n[laughter] [noise]\n[laughter] [noise]\n[laughter] [noise]\n[laughter]\n\n[noise]\n[laughter]\n[noise] [noise]\nOh God [laughter]\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\nOh my chief William ... agency if you've been in the office of just the surface to\nDemolish the opiate and the you know school so it's you know he kept him healthy\nAmerican indian women living on the Indian reservations experience unique challenges that intensify the epidemic of violence against them we're\nOn are all in our tribe and it is against tribal federal law to sexually assault\nWill be another person every person is sacred and valued and the Hopi culture and John Leonardo United\nStates attorney to the district\nIs also a legal under federal law actually assault or be\nAnother person if you are the victims of sexual assault or beating please come forward and report it or you know anyone who is the victim of one of these crimes encourage that person to come forward\nWorking together with openly and see what people we can stop violent crime and restore respect\nThat there's been a public service announcement\nCooperation with obey police department and K. you why obey radio [noise]\n[noise]\nSees that too but he was on\nA movie one time that that is that the team that they will\nCome back on and on Johnny by nine to rely\nOn\nSome list that tiny tiny by not right\nOn the one who\nMy\nGirl my mom who\nIs\nA grown man who\n[noise]\n[noise]\nThat's\nWhat people say you were riding high known him a\nJob back on and\nOn the same\nMan on every man and let me know mine\nMessed up up up up up and on and on and on and\nOn on the way he saw him on the line on my face my hair\nThat's on my face I myself am black hair man that's why it\nWas like camp and I as\nI Know that were written baby my mom on your day going up\nBy air them on saying what were those try I jump right on a big bird and then I bought a friend of mine and I'm going on and\nOn and now and then over and and I know one thing I'm On my mind that I Am right now and I think I might have you ever do rent\nAnd I don't know I read a lot I I don't I Know my on my heart in New York yeah you're right\nI'm going to do my style you know big ball and\nGod and\nMy mom my\n...\nYear olds and ... and she says\nShe wants to grand a year and three and I knew she was my no well yeah ran out and like a shooting and not to man in the ... and even then\nSome uh\nNo no no no no no ... no ...\nThat guy and I'm ... I'm ...\nAnd straight out right now I'm making during one of them are and how we can get you know na mean sheet or marry me\n\nBut I remember when a when a A R most and then the other hand a very deep down there and we lose friends going for it are the same no ...\nNo I mean bill but then again when I go and buy a new one that I've ever known now know\nDaddy manager in this day and all but you know I'm\nGiving away our ... and a man hours I Am too I'm sure\nThe ... um ... no man I mean and you know\nNah mean Mary and I'm a I'm a\n... a man named yeah math and science drowned and on and on and on and on and the man\nAnd a and then I'm\nSwell man my last two black uh now than they do and strong shot when gang street and that\nType of man and and I am known my name is your home in Miami you only na ve and on ...\nWell I don't want to marry me oh ... well\n[noise]\nI knew what the around me you know\nPart should show up and not be what would you run\nAcross some ... ... how are you a girl she realized that means that wimax move around the back of\nThat either so we will thing from Dubai\nDown saying ... run around the same crowd at the time with her life you know when mine were Jewish but maybe not you know I Know she found a way you know but I never saw\nIt with your own body and the guy with a new way to know what I'm trying to win it almost you know do they mean or are the only\nGuy Shane we really know what I mean you can you bring up a\n\nFor a while I guess they were keeping a low key now part of the shows are closing in on the um everywhere to get in trouble and then we didn't have to close to home was so far no she didn't go far you're trying to do with me before the grass for bankruptcy departure cars\nTo even know lame on someone else they charge more now on right now and\nI never knew you would just tell somebody I Know your new ideas I'm trying to feed off and on the show when they need to know do they mean for a look at some point during the blackout\nChampagne below the student and then\nYou also\n[noise] [noise]\nAnd sometimes the gym you know by saying gosh my and I live in one minute\nYeah well sometimes I think when she goes", "year": "2018", "show_name": "no_show", "city": "Hotevilla", "day": "30"}