{"month": "10", "state": "AZ", "station": "KUYI", "content": "[laughter] [noise] [noise] [noise] I\nDon't want them\nTo\n[noise] you\nKnow [laughter]\n[noise] oh\nYeah that was that was ran right there are ...\nSort of marketing firm are far from here I'm going to get outta here are going to be falling apart on my clock right near so you guys have a good day just to say because they don't call first arose are still without their anger at home safely you're going to tell you what are\nPeople in a while you go did your pride right here or say goodbye litters and all the servers de ...\nNa\nNa\nNa\nAnd there are listening to ... I Hope the law any point one at a KU why else the upper ... eighty nine point one of the\nProject so foundation streamlined KU why does that change and why is your Native American public radio station following it provided ... between ... and a new Arizona Public radio\n[noise]\n\n\nAnd\n\n[noise]\nOoh\n\n\nOoh\nOh mine\nLive from NPR News in Washington I'm Laurie London President Trump is expressing confidence today that his Supreme Court nominee will be confirmed by the end of the week but as NPR's Scott Horsley reports Trump also says he's willing to wait and see what the FBI uncovers\nTrump's us as he campaigns around the country he's urine strong support for nominee Brett Kavanaugh from fellow Republicans got it off as vehemently denied allegations that he sexually assaulted women decades ago Trump says the high Court nominee is fighting hard to protect his reputation and his family\nI oh life fiber here it is just a joke but now you're guilty until proven innocent that is a very very difficult for\nSome former acquaintances say Kevin off misrepresented how much he drank when he testified last week before a congressional committee dropped as long to Congress is not acceptable Scott Horsley NPR News the White House\nFour days after a devastating earthquake and tsunami on the Indonesian island of ... the situation remains dire official death toll is over twelve hundred and climbing NPR's Julie McCarthy is traveling with an army aid and security convoy to the heavily hit city of\n... near the epicenter\nWith videos I just see what you're going to be your best shot up this earthquake the devastation goes on as far as you can see\nJust a mass of fans are better Barry building houses it's very difficult to believe that there are many people buried under all that but now wait wait\nThat's NPR's Julie McCarthy more than a million people have been affected there's no food or\nWater and the powerful earth are aftershocks continue aid groups are urging people to stay outdoors France says the government of Iran is behind a foil bomb plot last June outside Paris NPR's Eleanor Beardsley reports that in retribution France has frozen some Iranian assets\nFrench authorities say the planned attack was on a gathering that organized every year by an Iranian group in exile the national council of resistance of Iran there were several European\nAnd Arab minister than attendant as well as former New York city Mayor Rudy Giuliani in a joint statement the French interior foreign and economic ministry said an incident up such gravity on French national territory could not do and punished plant has also warned that citizens against traveling to Iran the deterioration\nOf relations with France could have wider implications for Iran ... has been one of the strongest supporters of the two thousand Fifteen nuclear Neal even after the U.S pulled out Eleanor Beardsley NPR News Paris\nThe down rallied again today closing up a hundred and twenty two points this with NPR Pepsi's latest earnings have beaten expectations which NPR's Camila Domonoske says means that companies to party CEO is heading out on a high note\nThat season that revenue rose by one point five percent and the third quarter beverage sales are rising after a slump and snacks like free to continue to serve up profit and this is the last earnings report released by Pepsi's longtime CEO ingenuity who announced in August she'd be stepping down\nNew we pushed Pepsi to make healthier products and expand into international markets\nFortune five hundred CEOs are overwhelmingly white and male knew he has been a high profile exception she spoke to investors on Tuesday\nYou know try to get this is a long time or the c._e._o. and even though I have a lot of fuel to lift in my tank I wanted to do something different in my life\nTomorrow ... will take over a Pepsi cars next CEO ... NPR News some researchers are taking a new approach to studying all timers disease the most common form of dementia which so far has uh\nTheir products expand into international markets fortune five hundred CEOs are overwhelmingly white and male newly has been a high profile exception she spoke to investors on Tuesday\nYou know China is is a long time as a CEO and even have a lot of fuel to left in my tank I wanted to do something different in my life\nTomorrow in McGuire will take over as pets because next seat yeah can you hold on asking NPR has\nSome researchers are taking a new approach to studying all timers disease and most common form of dementia which so far has been looted scientists ability to find a treatments for people who already have some mental decline to large studies will look at the very early stages when the very first\nBrain changes occur\nWhile memory and thinking skills are still intact banner Alzheimer's Institute in Phoenix is leading the work which includes clinics throughout the U.S and\nParticipants in other countries as well it starts with a confidential registry\nI'm Laurie London NPR News in Washington\nWe know that a lifetime of healthy eating helps to prevent and chronic diseases like obesity heart disease high blood pressure and type ... diabetes healthy eating is one of the most powerful tools we have to reduce the concert of disease the path to improving\nHealthy nutrition is to follow healthy eating pattern that he was right for you the science behind healthy eating patterns tells us they can help prevent chronic diseases like obesity heart disease and type ... diabetes healthy eating pattern can be maintained over person's lifetime\nAn an appropriate calorie levels promote health and supports a healthy body weight you can include many of the food that you enjoy it healthy eating patterns support healthy choices for everyone hated more physical activity to stay healthy everyone has a role to play and encouraging accessible and affordable ways to support healthy choices at home\nSchool work hand in the community this message from the station and the Navajo Nation special diabetes project visit in an STD down or the ultimate choice the healthy living begins with me\nTell you why community calendar\n\n\n\n\n\nAdult coed basketball event at the Veterans Memorial center November Seventeen and Eighteen more information is that seven three for three four\nThree two [noise] diabetes group is is taking place every second Thursday of the month from eight AM to eleven AM details are at seven three seven six Jews\nThree one of the culture\nAnd language sessions are Tuesdays and Thursdays beginning at one PM at might be a legacy in more information is on line to eight six six zero three five board to [noise]\nAlso again say well village ... boxes of elbow for those who have not received any more information is that seven three seven to two five four\n\nAll righty and now to your Hopi junior senior high school\nSports\nBurst up hope the high school sports [noise] hopefully high school volleyball October second today versus many farms at many farms first lady asked by P. M. O. B. high school football October fifth versus valley stand there at Hopi and\nThat is pink night\nVarsity beginning at seven P. M. O. P. high school\nCross country October a six day ... invite in Phoenix at monument new part starting at eight thirty eight\nBush were hoping high school volleyball October second today versus many farms and many farms are pretty at by P. M. O. B. high school football October ... versus bally's and there's a whole pie and that is the night\nVarsity beginning at seven P. M. hoping high school cross country October a six day ... invite in Phoenix and monument new part starting at eight thirty eight am\n\nHoping high school has a job or fifth time strict region one tournament at Lee Williams high school starting out one P. M.\n\nAlright enough or you're hoping junior high schools work hopefully junior high school\nFootball October third versus gym the junior high school I generally JV beginning at three PM and bar city at four thirty P. M.\nO. P. junior high school while he bomb October ... versus Turner Leah I'm hoping junior high school JV beginning at ... pm and ... city and by the opiate junior high cost\nCountry October but Davis invite to bust the high school starting at seven eight and ...\n\nAnd that's going to do it for your updated sport for more information and all the high school and hoping junior high school sports activities you may call nine to eight seven three eight five one one one\nThat's going to wrap it up for your community countered update if there is information you did not hear the tuna seven AM eight am noon and five PM when we're in our community town there even if you buy a K you why I Hope the Radio's pretty\nCommunity down there and wish to continue to support our mission considered becoming a K you why I on the writer your financial contributions during this move will help us prepare for an even brighter future and allow us to return to the normal broadcasting you depend on daily\nGenuine I offer support among underwriting to get your message out your listeners community counters emissions are edited to one sentence or you just take a couple of seconds to read\nOr just sixty dollars you record your information as a poor paragraph thirty second announcement to recharge thousands oh blister nurse email in fall I tell you why I done there to get on the air quotes\nAnd that's been a do it\nFor your community counter update coming up next is your updated weather\n[noise]\n\n\n[noise]\nJoy and whether we have the\n\n\nAll righty I'm back with their updated whether borders Tuesday October second you down as in the\nFirst step schemes cannon tonight towers likely and possibly a thunderstorm [noise]\nMostly cloudy with a high near fifty four down south west when nine to five Fifteen miles per hour with justice highest\nTwenty miles per hour [noise] because most of the village tonight showers likely on a possible thunderstorm [noise]\nMostly ... without a low around\nFifty three south when seven Thirteen miles per\nHour [noise] might be too by city area and I\nShowers and thunderstorms mostly cloudy weather low around fifty for South when five to seven miles per hour you're not old St Michael's area of the night showers likely and possibly a thunderstorm mostly ... around fifty three down south to us when ten to Fifteen\nMiles per hour with justice highest twenty miles per hour [noise]\nWinslow tonight\nShowers and thunderstorms mostly ... around the districts to end the eleven miles per hour\nLast but not least Flagstaff tonight showers likely and possibly a thunderstorm mostly crowded with their low around forty eight southwest when Lebanon miles per hour\nAlso Flagstaff is in a flash flood watch now until five AM Wednesday morning\nAgain Flagstaff is in a flash flood watch now until\nFive AM when they morning [noise]\nAnd that's going to be updated weather for this Tuesday October second two thousand eight team\nFor more information on the weather you may go to weather dot G. O. B. and that's going to wrap it up for your updates on your tuning into K. U. I. eighty eight point\nOne FM and K. you why I Am the upper ... eighty nine point one FM also streaming online at K. you why I dot net your Native American\nPublic radio station thanks for tuning in more music coming up next [noise] [noise]\n[noise]\n[noise] [noise] [noise] [noise]\n\n[noise]\n[noise] [noise]\n\n\n[noise]\nHi famous the this is rose or John from here in need of dance theater I Am from the great trainer nation and on the artistic director of the hill made him dance theater were from way far away from here in Alberta\n\n\n\n\nHi Steve this is rose a John from here in native dance theater I Am from the great or you know may show and on the artistic director of native dance\nTheater were from way far away from the un Alberta, Canada and you're listening to tell you why eighty eight forty one at a streaming\nOnline at ... y ... met your Native American public radio station a project of the ... foundation thank you [laughter] Mm Mm\nI Know na na na na na na na na na na\nNa na\nNa na na na na na na na na na\n\nNa na na na na na na na na\nNa na na\nNa na na na na\n\nRange that we don't know\nJust say I'm On a balancing act has made no [laughter]\nMe over the next day when I'm when I'm On my man now me now may and now we get a job\nFor me oh ho ho roe doing\n[noise] [noise] oh when you're sitting\n\nDown and put your hand like you're\nOn\nA budget and the strange thing and then again that\n[noise]\n[noise] [noise] we\nSee [noise]\n[noise] oh that's all we want to be a human\nBeing and I was telling me\n[noise]\nOh I Love all the way I could talk about the way out of the day um and and as a\nWay to work and well and good luck to find out one way or the day I read or a dog A L under the table and\nThe bad guy and you know for the long run up and you know and again\nAnd um\nI don't really have to work out and play a lot to find a link yeah the the bank maybe or around the law or else would you be able to ban\nNow they're locked up banning guy next to a certain\nWay and\nAnd the ... and the roadway and as you know nine and\n... and early around and try\nAnd get your well I'm\nNot being a guy and\nLord I'm\nAdam and Eve and the and the ...\nOr in the corner of the things that I Know they you know the mom mommy and\nThe man and the thing is like yeah I'm a Yankee fan\nSo I don't know when I'm On a like a lie\nOn CNN CNN na\nNa ve to um\n[noise] ...\n[noise]\nAnd ah [noise] ah\n[noise] ah\n... ... ... ... uh uh uh\nUh\nUh\nUh\nUh\nUh uh uh\n\nUh Mm [noise]\nYeah yeah yeah there are no\nLonger a ... and\nMy friends and then you\nKnow for\nMe and my name is ...\n... a ...\n\nA ... a ... a ...\n\nOr a man or a\nGod do I go for the ...\nWhat was that I'm a lawyer\nFor one way or the other\nSide by ... around me was\nYou know we're paying\n... [noise]\nI'm\nA I'm\nA\nI'm a\nI'm\nA\nA A R\nA\nL [noise] man I mean ... ... do we\nReally shows or we don't need a nail in the ... and then some of\nThe\n\nDay in\nAnd out of it and then there's\n\nThe ... the day that there was you know and now now now now we're ...\nAnd\nI'm a I'm\nA\nI'm a I'm\nA I'm a\nI'm a I'm\nA\nKind of\nA [noise]\n[noise] [noise]\n[noise] uh [noise]\nUh [noise]\n[noise] uh-huh and um [noise] no\n[noise]\n... [noise]\n\n\n[noise]\n\n\n\n\n\n\n\nYou are listening to you what I Would do any putting them in January I ... a promote ... eighty nine one one project of the foundation training online at ... dot net your Native American public radio station [noise]\n\n[noise]\n[noise] but but it will come to look for\nThis or what but it's just a little more\n... know what the global and stuff but the little ... ...\n... ...\nPlus they bought him a bum bum bum you [noise]\nBut yeah man or a [noise]\nThey buy it would be so lonely he died he lowered the gum a booth on June\n... are not on the dog but they're always\nThere all summer [noise]\nUp another look John bus I own\nOh got it um young group ...\n... ... we're we're we're both on\nA ... government funding bill [noise] book beyond the law or ... or ... or the\nOil but it's not on the bus him a ... billion dollars but the ... dom are you a hug you um are they\nReally thought about it or not the one on it you know so when we're done goes\nSo well ... yeah yeah [noise]\nThe movie now so I'm a young\nWell bill over real [noise]\n\nYour life matters sharing your story with us now can eat out right now 'cause ... prevention program wants to encourage you to find a reason to keep\nOn living because we care we care campaign in a group of local people and organizations from northern Arizona we care about you and everyone within our community and we are here to\nOffer health court because what how how how if someone you know it feeling depressed and national suicide prevention line it's open twenty four seven locally reach your life need to be used to mind is currently taking calls\nMonday through friday three to seven pm at night to eight seven seven or eight twenty five we encourage you to empower an owner you're like [noise]\n\nYou care about you and everyone within our community and we are here to\nOffer up in court because what how how how is the one you know with the link to press the national suicide prevention light it's open twenty four seven locally richer life native you support my currently taking on\nMonday through friday three seven pm at night to wait seven seven for ... twenty five we encourage you to empower an owner you're like\n[noise] [noise]\n\n[noise]\nOoh\nWow ... ... ... ...\n...\nWell ... well\n... ... ... ... ... [noise]\nYeah yeah I Hope my nah hoping my bank net Kelly and now I'm like yeah\nYeah yeah I\n... in my lane we're making it sound like a white man the way they see the day\nThat he didn't know that\nMaybe he was a man that\nNa na na na na na na we're\nAround the world in general the\nDog is now a bird flu or a ...\nYou or na na\nNa no no no no for\nHeroin or a ... a rare or on the air ... how are you under\nA\nOr\nA\nAround our house we will be a gene we're we're or\nA girl or matters more view or na na na ... your\n... your way or no new na na\nNa na na na na na I'm sure you're on the ground rented oh\nWhere are you watch on our on\nOur ... or ...\nNa\nNa\nA\nNa\nNa na na na na na na\nNa na na na\nThere's no doubt there oh how are you live where I Am a ... tree and I find out oh\nNa na\nNa na na na na na na na na na na\nNa na na\nNa na na na na na na na na na na na no longer\nA\n\nA\nNational news yeah na I'm\nI'm sure I\nKnow we're a long\n\nDay [noise]\n\n[noise]\n\n... ... ... ... ... ...\nA young girl na na na na na we're\n... we're at all not just to give them that I Do that on our little voting on me I'm not run by the by the U.S grain and how much do you remember about the ... the ... the\nWhole Iraq when I was going on there and there are others that I Know a guy named ... and I will die down in ... July ... from\n... in Columbus now or are we have a heavy and it'll tell your last year alone we're\nTraveling to me I mean I don't know man [noise] where do you\n... the the the L O G O that got to put them in some way and the little boy or maybe the ... all the all the ... not on the job at a\nTime when I was ...\nI don't know do a show where you are relying on the roads and died ... see I'm I'm a little girl on some of them are\nNow hey you know your last yeah they do a little\nTown in Iowa and na na na na\nNa na na na na na na na na na na na na na na na\nNa na na na ...\nWomen are being around me\nNow to Tony how they died down to about ... ... which is that right on top of my income to their na na na\nNa na na hey you know ...\n... ... barrels a day or you know your last ...\nNa na na na na na na na na na na na na na na na na na na na\nNa na na ...\n[laughter]\n[laughter]\n[noise] or ... or\n... or ... or ... or\n... when we return them to the gym or a a ... a former da da da da\nDa da da da\nDa\nDa da da da da da da\nDa da da da da da da\nDa da\nAnd I was a major\nUh or ...\nOr or na na na na\nNa na na na na na na na her chance for mama Bangor a man\nA man or woman or on the line there all the way that we\nAre going to have a\nA ... na na na na na na winter\nOn\nJim Lehrer around ... or ... how many other way around the world and\nWe knew\nLittle about what a hundred or where you know and they can do and\nI have to agree with you again on you know she had to ... I'm\nGoing to be made his you know\nNo matter na na na na na na na na na na na na na na na\nSays oh you can hear you three and a half\n\nMile well so the whole show or something or is this\nYour mother and rent a movie or or ...\nNo ...\nNo more than ...\nNa na na na na na na na na\nNa na na na na na\nNa na na na\nNa na na na na na na na na na na na\nFrom about an hour and a\nLot of long\n\n\n\nI'm ... I'm a little ...\nDown the road around ... or ... or ... or a world\nAnd I'm ... now ...\nOr ...\nOr you know don't share our animals are on ... or ... or ... or ... or ... or ... year\nI'm a woman loan them or ... or ... you know they're on our way way more than ...\nIranian and one or two animals around ...\nOut on a ...\nA night out a loan out there on may ... you know or ...\nOr ...\nDown here I Am I Am a ... year oh no no no no way around or a you know ...\n\nOr ... or you know the law a Marshall ... for a while I'm a\n... or ...\nOr who\nKnow na na na na na na na na na na na na na na na na\nNa na na na na na na na ... or\n... or ... or ... [noise]\n... ...\n... ... ... ... ...\nAnd ...\nAll the more around\nHere ... ...\nWell ...\n... ... ... ... no\n... na na na na ...\n... ... ... ... you know I'm Bad\nChewy ... no ...\nOr a ... a rare and honor those ... ...\n...\n...\n... you know Neal\nShe lives there and I I'm On a yeah\n... ... back street under\nA a ...\nMile ... three job down there a non ... ball to want to buy a\nWild ... show the ... the ...\nOr ... ball being alone\nIn a car or need ...\n\nOr ...\nOr a loser and ... our ... square a\n... throwing the Brad\n... you know\nAnd as I Am I Am a yeah I Know you used to actually dream\nOr a and a and\nNo new or ...\nOr ...\nOr a well\nAll alone ... ... ...\n... ...\nA town where a new world ... ...\nShe's a ... hour in New York\nCity that care by ... or ... ...\nDid you\nYeah ... ... ...\nWhere I'm at the\nG O o Neal\nThat I Am a yeah I'm a ... ah yeah\nMaggie treat each other a\nI [noise]\n\n... you know the new\n\nLaw no\n... or ... years in St ... no ... not well room to room now changing living hardly\nMove ...\nAround\nDown you know we\nWere a new ... sure it was\nA real job on this new order new you\nKnow a\nA you know ... we\nKnow there are a lot\nLonger ...\nYou\nKnow the main big loan\nOr a new home or do you know we drive around\nIsrael now to a movie\nOr\nA or a way I\n\n[noise]\n[laughter]\n\n\n\n\n\nYou are listening to kill you or I Hope ... eighty eight point one at them and K. U. I. L. P. upper ... eighty nine point when FM projects the Hopi foundation seeming online at K. U. L. I. dot net\n[noise]\n\nYou are listening to K. U. I Hope I liked it a point one F. M. K. U. I. L. P. upper ... eighty nine point when Afghan projects the Hopi foundation she mean online at K. U. L. I. dot net you're needed American public radio station\nWell Mm Mm Mm Mm Mm\nMm Mm Mm Mm\nThat doing when nine or ... or ... or what or\nMe he said he only around then but if I end but there what ... yes I Am yes I did it and I'll\nTake that many ... are they can't do it and do what you have to come in a dimly he died I when I get like ... I hate that will be the guy or a month to what I Want to get ... out of the ah the ...\nBy land but beyond emotionally and eat them in half gave mice or none yet on the team like the ... I mean it needs a bailout by it and our boys\nIn my life and I am a bill my hand for al ... getting on a Miami one that ... how could be just like how can operate more for ... for\nMy camera on me on that and it gets ... at that when he died on ... and I did not want more hockey out he uh he he I thought that town non not being at the animal\nAmong on a minute I'm like Donald below my eyes I end my ... almost like a month\nWhy my money on may or may not only a mummy\n... bay on then you add to what it does I Love my humor um showing you sat behind him\n... ... ... ... ... ... at the diet non ... behind by say you got it down side say on a on it that I Am it don't continue down below ... I Am gamely out a cheaper at the same\nWay I'm a ... on it I'm ...\nI'm not going to be at the end you know nine out now I weigh ... ... ... like download ... you know being that I run a and a lot on my\nGoing I I I mean I miss it at all the time bringing me Soviet it bothered\nMe wrong I I'm married and then me I'm ... I'm not here might that be a need for my son said that I'm happy I looked down on a lot of money I ... I I'm not ...\n... and ... oh yeah I don't know what I Love my eyes at my at my home I ... I made by the\nAmy I'm not ... yet if I if I Am I'm like I'm not an\n... yet it I mean I'd say in my ... but yet there was none of my thought on ya yeah by it I'm among on my mind now way too much on wait a minute by minute among the non smoking yeah I\n... and then not being yet and yet ... so what ... ... and ...\nAnd by golly I Know I'm ... I'm not happy I can do it by ignores\nMe up on me and said to my mind I ... I ... I think now you have a ... by ... ... yeah I'm a ... ... ... ...\n... I'm from yelling and yet I'm Still young yet among the no ... we do I like to get a gun outside the unique and yet I\nKnew what I see I don't know I Need I say no we're up on how I get my camera eye to eye and we only have a nice little uh Saint Louis and let me ask\n\nYou a\n\n\nFeeling that music can be a\n\n\nWhole meal that you need to share any one of the rain [noise]\nDream the dream dream dream the dream dream when she\nComes in and do your job for a long\nHistory dream dream dream you know and ah he you know we\nTry a law suits\nMe\nWhy not the only show some\nGood\nNews will that job so I don't know why your\nDream dream dream\nYou know that's why I Am not only\nA dream a really good for\nMe to do that job\nThat kind of either they're going to be a chain change I mean you have any money to copy thank you guys get to\nKnow why they can't make guy died earlier today and the only child in the winter time drain on line and any time and the two years ago\nThat the guy with the news so can I ask ... why then then the guy ... has just been any any any dreams changing a\nDream the dream in Maine Janine Janine\nLike gee\n\nThis is\nA a a ... a\nLot of what the next to me than most of the health Carol ... a barrel and who wants to like the ... a barrel where so much on the news\nThat\nThe English language player I Love the girl with a light and they're there and taking the brightest stars a guy at like ... I talk or many\nOf the\nFor jobs that were done on\n\n\nThe streets we ... through ... let me turn to you can't beat it through the ... the big ...\nLong fresh air and the kids to be in the back beat you get a big fan of the loan I told him that\nYou believe that you can't be the ... the big thing about ... ... ... ...\n... just playing with some ... ... ... and the ... the ... which you can do is we forget I was just below the knee you can't be the ...\nAnd ... they were the dream can be the ...\nMakes you can buy all the ... battalion ...\nYou know why this remains to be more ... they can be nice to meet you get\nThese than I Am the wedding gown and one ... one of the others like where you are a lot of games that you follow the playing on\nThe page Bert character ... during the day you're going to see how the favorite is spending because they saw the dream in June was saying one\nWhere the sweet potatoes blasting get strung above you can do the math makes you get the T shirt every ... grow to be the ... the\n... why do you get one life will be the way with the ... main streets we ... we do we get ... or ...\n\n\nNa na na na a God\n... ... ... we do we get ... ... or ... you know maybe they\n\n\nAre on a on a ... a\n\nA\n... the\nThe [noise] the the ...\nThat all the problems in the uh the ...\n[noise]\n... you know give me\n\nAn hour raise and ... to ... go round and that the big ... a\n...\nA a\nWay in the middle [noise] in\nA mall a man to a kid and the ... ah\n[noise] then your thing or not my style\nAnd ... ... ...\n\nI'm I'm mad is when a\nBall um\nI'm I'm One of the\nThe\nThe more you know to a kid I Know a\n... ...\nThen you are too dangerous to our lifestyle\nAnd we are the people who\nAre\nAh a a\nA a\n\n\n[noise]\nOn the ... when\nA ... a riding a low low on the ...\nAh how do you do a ... was a ... for me one time I saw that a lot of other leg a low\nLevel talks about the role of a\n...\nOr ... or ... or ... or ... but I'm I'm a I'm a no\nNo no I grow\n... when ...\nWas on one of those uh uh [noise]\n\n[noise]\nAnd\n[noise] [noise] but I\nDon't know why throw a modern day or\nEvery ... oral\nO O lo\n\nO not on our ...\nOur job is to your mom or\nA top\nTen or bombed or ... or not they are ... in my knees or time\nAll that on na na na na na na na na\nAre there are a lot a lot on your hands on um our our uh can you hear on the other part\nOf no ... no\nNo no not very\nLong those\nWere\n\nAlready on the job no\nNo no\nNo no ... [noise] that that is you may not my man\nHe was Tom ... they don't bother me anything\nOh I'm Sorry I'm a man drove home oh [noise]\nOh no you know and [noise] ah there is like a human not to\nThe polls though ... they don't bother me in\n\nOh oh so they live ... years ago is that a whole\nCircle\n[noise]\nMoving down to one where [noise] well\nWhat do you see [noise] yeah yeah na na na one\nMan one day by day and there is no not that you know allowing\nMe in the ... will be able to enjoy eating in me and\nNow we live in a in a [noise]\n\n[noise] [noise]\n\n[noise]\n[noise]\n\nOh no no no no I'm\nA\n...\nA lot more than\n... ... ...\n... or\n... or ...\n...\n... ...\n\n...\nBoth [noise]\n\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n[noise]\nOh wow\n[noise]\n[noise] [noise] [noise]\n[noise]\nMm\n[noise] well ...\n\n... and\n... ... ... ... ...\n... ... ... ... ... ... ...\nIs any time I think that's humongous Patrick's call Jackie Hyman would all attack although there are there nobody traced back Marco Jeff Perkins at least Carter\nYour last name a new oil I Hope you're right I hear you I I thought that you are married a year\nAfter all day and then you know and and\nAnd I wish I was in a man that man man\nOh man I Would I Would do a little ...\nNa na na na na na na na na na and or\nIn the ... year old man all over the years ... years and years and we\nHad a better who say well we got our law\nAnd order hang out and then go and and\nAnd\nI don't know I don't know man with a\n... day [noise] [noise]\n[noise]\nAnd again and again\nAnd again I mean\nIf\nYou're\nA girl who's doing what they want\nTo do well or\nThey want to\nKnow why the hell man will know na na\n\nNa na na na na na na na na\n\nNa na na na na na na na\nNa na na na na na\nNa na na hey man I think we\nHave a little bit of a a young man I married a man\nOr a no no\nNo no no no no no no no no no I don't know how long how long were you know\n\n[noise]\n[noise]\nMm\n\n[noise] Mm\n\n[noise]\nNo [noise]\n\n[noise] [noise] [noise] um we're [noise]\nNa\nNa\n\nNa\nYeah\nYeah yeah we\nLove\n'em\n[noise]\n[noise]\n[noise]\nYou are listening to kill you I I don't know eighty eight point one as an end to the Y. I. L. P. a permanent I'd be eighty nine point when asked and high fixed up to her piece foundation to me I'm nine key you why I got yeah\nHave you ever play ... ... ... ... ...\n\n... um people say a man is laid out a mutt\nA ball lands rage out the ... but my son loves them and phone a mind that so we ended up back\nThat strong you know to the top quality you know the the the first night either don't recall may cause I mean I always thought so too the companies\nDo\nA bone one morning when the sun shine a pick up much of a land the ... mine I looked at sixteen tons a number but now I'm\nGoing to end the golf balls said the ... the less my told your little teeny town [noise] bother you get a job to pay for them to read or don't you're calling me cause I Can't do file in my soul to the companies to\nA bomb on my own and it was it doesn't rain\nBy men trouble are my middle name if I was raised in the chain ... line they do a hot zone when when like me with a lot on your little sixteen times you\nGet a job but they let them St Peter don't call McDonald's I Do I owe my soon to become the ...\nOr ... I just sent me common better step\nAside and saw the man didn't do all the men died one fish stood on the other is the usually the ride but don't get you into one years old sixteen\n... body you know the the owner in Denver they read or don't you call me cause I pay ... a new\nMom so I'm\nTo the companies\nTo or a\n\n\nOr a pound or or\n... days is now that time and you know to a certain time possibly one\nWhile on the right by calling again my ah\nKnow that that age group who I Know who they are the best way to know how to them or\nOn the right guy right on the right\nI Am currently right\nNow but then as you mentioned that I Know I mean if you were given a ...\nRight yeah see I'm right down\nBy one billion rising\n... avenue you may be yeah the the bad you\nKnow a young lady na\nNa na na na correction\nTo have a ... I'm ... now that John into\nA lot of great run those memories which is a man to a\nGuy on the mind\nRight yeah cause they\nRely on the other day\n\n\nI live\nRight yeah\n... right ah oh\n\n\n\n\n... I'm On the side of the men have made you when you saw\nA lot when they when this law\nIs it only cause you a loan they they have may June who law that lord of the strange today in your\nBar a smile\nTo Joe ... who are is this your way\nToo hot or world in a\nMedical dream live and grow to know your doors and\nUm they just lie a nine day die na\nNa you Walmart you know\nThere is a hard job so cold that loan they\nLove the ... go to a\n\nNew\n\nA new model\nTo jump to ... a ... way too hot either ... dreams have meant well your your\nDay just na na na na na na na\nNa you well you know morally\nOh [noise]\nUh when I was in [noise]\n[noise]\n[noise]\n\nOoh [noise] ... [noise]\n\n\nOoh [noise] ooh\n[noise]\nAll the time\n\nMy mom lives about living the bad so long that I\nKnow how long they're all night long ... long last for her law there on a I'm a grandma chocolate da\nDum la da dum la da\n\nDum la ... say well you know based on the on their side murders in Bahrain well me even now you know we all know\nPlay some hot when John some all we did my bike to the bottom the bottom line well last romantic romance loan money to buy anything mom a lot\nOf money you know a long time and again the eyes roll back [noise]\n\n... no no no no I haven't even by law do you call it a long game on a ... or you can let me\nKnow of any I don't think of when we all know well that all my ... my mom bumped up the ladder to carry\nOn bag academy and no\nMatter how long how much you know that I'm no no no I\nDon't mind that drive on 'em and then now I'm no longer than\n\nI ever message for fun I drink coffee\nLiterate ... because they're little both people was a lot but he doesn't know what to do that ... [noise]\n\nIt's reasonable to wish you the last person\nTo be true that you wouldn't know what do I\nKnow\nThat that basically is reasonable but to leave but\nNow that overwhelms me [laughter]\n\nCompletely over what the\nRight around and she doesn't know what\nTo buy\n\nThis little pieces\n[laughter] [noise]\nNo no we were alone\nIf she were last spring you couldn't find a mute are pretty similar\n\nSimilar it's in the book\n[laughter] leave it there\nAnd they are they ... they will come out oh yeah they can\nBe a brighter day tomorrow we're\nGoing to vote [laughter] [laughter]\nOh I can tell you they tell me what else could\n[noise] [laughter]\nWhy [laughter]\n[laughter]\n[laughter] we played one [laughter]\n\nBecause they they might have come over in rebel\n[laughter] they could have done\n[laughter]\n[noise] [noise]\nMe too [laughter] we played one\n[noise]\nOf course they they might have come over here [noise]\n\nThey could have done that I really don't know [noise] but nonetheless it didn't know if you will\nCry blue pick up your books and to turn to page two hundred twenty two will ask you all the you buy your books on the ...\nAre we ready\nEveryone do buddy to let me enjoy ourselves that leave it at all the other\n... do you remember ram all lives do was born every thing in the home and we read and I was in Wyoming get going and when he\nWas saying well never mind [noise] [noise] do you handle your [noise]\nChild would object in the second best\nRated dubious let's leave it up as Iranian by denied it was not a happy time are we ready altogether\nI hit the ...\nA little harm and rather sermon had an aversion to washing their hero ram all around them we're allies do and they haven't heard a word it\nWas the [noise]\n\n... what's left or the last [noise] without a happy time everyone in the last dog again\nWas ... back in time to time is over now they know how about a lover bar molds I understand a while to gang up on my door the plane as well\n[noise]\n[noise] [noise]\n[noise]\nOh ooh and\nIn some day in day to day you\nKnow\nWe were ... O O\nO or um or\nA or you know\n\n[noise] and\nI'm Glad it being a mistake when any manner that are going to do\nAbout Africa by the way to get a concussion [laughter] tattooed on me and my name is Matt how dynamic and my back\n\n[laughter]\nI'm Glad they pay you could take the same way in Manhattan [laughter] and some are governed by the\nWay to come to pass it on the dime usually they made a big fan of how much can I can buy it [laughter] ... [laughter]\nI Can't you down\nThere [noise] [laughter] [noise] [laughter]\n\n\n[laughter]\n\nAh [laughter]\n\nUm when they painted on a plane for independent from within four and a man from a guy from out of\nThe time they're not actually sure ...\nYeah you know my ...\n[laughter]\n\n...\nWho are\n[noise]\n\n\n\n[noise]\n\n\n\n\nOh why oh\nWhy oh why oh whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa I'm Sorry I'm Sorry oh ... or ... or you know who to\nCall for me you know oh you were little and all of this new oh ...\n\nOh [noise]\n\nOh\nSweet sweet treat you let me you can be the next three give let me tell you a loan Russia and get their kids to be the best way to get a good\nA good long sold in the villages against the the ... ... ... ... ... ... what would you sum Joe the man's victory ... so many does it end and be\nThe best you can do when we look at us you know ... and a lot of lives where the dream in the ... the ...\n... ... ... ...\n... you know maybe they can be\nYou know then I Know nobody\nWants to hospitals and along those lines where you are curious about the way I'm going\nTo start ... where do you bring the day and see how the study the um the three ... was one\nWhere students when there's a lot of the ... the ... the survey that Japan or is it ... it was\nA one minute when ... ... ... ...\n... ... ... ... what were you know you saw ...\n\n\nI'm a I'm a I'm a I'm a\nHigh you know you didn't\nSee it\nCome down on\nA man my home\nIs in some of them\nIn the home\nYou\nKnow I'm a\nI'm\n\nA long long\nTime she was a kid he came on Mumbai mumble\nAnd he\nKnew all\nAlong\nThe lines you know John chain and the\nAnd the legal\nAge Jell\n\nO da da da da\n[noise]\nThird survey earlier there were a person or [noise]\n\nOr [noise] or [noise] [laughter] [noise]\n\n\n\n\n[laughter]\nYou are listening to tell you why I hold fella eighty eight point one S. and M. K. U. A. I. L. P. upper ... eighty nine point when asked him projects up the Hopi foundation streaming online at K. U. L. I. I. dot net your Native American public radio station\nParental involvement is the key to your child so this is Joe ... residents will be Arizona education also whether it's solitaire in school communicating with teachers on a regular basis for helping homework\nWe no involvement is crucially important to go get involved with each other parents and educators can make the grade school your average than Arizona a message from the Arizona Education Association\nMm [noise] yeah we got a little dry here will do California are you I Want\n\n\n\nTo know\nThat way too long gone right\nAt that time [noise] my my back then I had no idea what\nI can tell\nThem no there's no way that when my daughter you know I\nKnow well you know as long as they go to a game\nAnd then they held a long time [noise]\n[noise] they got rid of him and I'm\nLike oh no no no no no there's no\nWay am I Am I Am down on\nA day\nAnd when you are\nGoing down [noise] and I I'm a I'm a lawyer [noise]\nUh\nAnd I know and I said you know by the way down the street\nAnd then when they see that but they let\nThem know that\nThey can get mad\n[noise] Mm\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\n\n[noise]\n\n\n\n\nYeah that would you go through at the hotel California coming from do you want it a point one black\nRuling on TALK shows\nJohn me that they know that\n\nIt's gone me because they know that he's being held high school she did\n\nAnd then you know made him the gum and we lived on ...\n\nOh go Bowling Green\nDress that gets in the domain but than men do such\nA\nGood guy who's been\nDoing\nIt for free and then did you learn Ron comedy and I\nOld order from around the know would you know the old Tom Burrell is with you know like er he told me about your change he told me\nThe whole thing would be like the whole thing was [noise]\nThose are\nThe ones in\nThe mid nineties and then by the the one who in the meantime we would be like [noise]\nI\nMean do you do need to do more of a mind over the long run by no means\nDoes or does it\nMean loan and by the end\nThere's a lot more money than it was fun and not only\nDoes or does it\nMake sense but I also wanted to be one of the theme of the [noise]\n\nMm\nWe're in a book I read them every\nDay I'm my name is I mean my\nMom went on over\nHere in uh I'm ready to read\nA lot of my life but you know\nA little or a\nOr B a B yet\nOver the rain in\nLa la la la la I'm like\nA you know I Know I'm a I'm like oh\nI Love you I\nMean I'm a\n\nI'm not read in\nThe last thing you know like I'm a\nI'm a I'm like oh\nPlease id me that oh\nJeez you know oh\nA\n\nRobot in jail land will get you on the job\nThat no matter what they\nSaid well this is John John on the drums and all the blue Rhythm Boys\nAnd a lot more than\nThree years in jail but did you tell me what to do with Jay a lot\nOf old now and November [noise] [noise]\nOh no\nNo no no they don't you know we can find a partner you want and [noise]\n[noise] and the thing\nFor him to take a break to manage the nickname around a lot of my day\n[noise] [noise] [noise]\nOh man yeah nothing like al ... who\nYou're dealt I got pretty more me boy if you got ... pride over your ears you tell you why I bought one of them and why are you know for my ... and I for one year Native American public radio station I got plenty of more music\nYou know I\nAm sure that I knew that\nI noticed from going out to all the postal workers for what they're already got there were handling our mail from Monday through friday even Saturday of you are working on a Saturday was that he just went up to this one is the mavericks in Nineteen sixty one Mr postmaster heard isn't going to get used to own the post people out there\nSaying hey I saw an ad\nIn a\nWay [noise]\n\n[noise]\n[noise]\nOh\nMy God no [noise] no I meant no no no no\nNo [noise]\n[noise] now I just don't fall on his\nMeant by that and you know and then and now\nI have three and a\nOne man I Know my way home and I don't I don't mind all day\nLong and\nNot\nWhat I Do know\nThat are out there we found that I\nDidn't know what they want to pick up where they'd be up to the beach and then you buy your desktop and yet there for three hours you know the the dogs are by the time they got\nThem you're not the right to\nMake me mad about\nThat [noise] [noise] [noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [laughter] I'm\nNot familiar with even being in an open ended up doing things that are being\nTrained\nBy your body and I got to be coming on your body needs\nTo go and join the club\n[noise] and that is a form of the [noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise] [noise]\nYeah ... I go to regulate many right here at the big lord ... genuine for one and\nMm Mm Mm Mm no matter where all the um\nYeah ... I got his record Mitch right here at the big lord number ... let me gardening joy and genuine born ...\n... no matter where the hell I'm In ... and then ... oh\n[noise]\n\nOh do you think you know we have been some hell and\nRewarded God go Maine [noise] can you tell I'm getting into a form of going around in your mind when you come from a very you know when you think you can\nDo to get you made in your ... going\nOn in your book and form a cold and rainy and growing up as much as your hand as you can go and do you think that I Walk on a well did they were all\nBorn leader role he might gain our [noise]\n\n\nOh we wish we surely want to\nDo that and we do our jobs on the bottom of the like but nobody was over there and all you can enter what we try and get them going on for years old I mean\nWhat we need to make [noise]\n\nMcDonalds\nCan be for the only thing that you can do that as a guy and then after we don't\nGo away but I get my daddy used to be back where we do the job because the thing about a year and a\nLittle while and even though there's an overgrown you'd be and what are your plans for years and the older we humans or\nPeople will be lucky he\n[noise] goes down the money or\nLose on and on the on the ground the guy who\nGot Memorial Day I don't want to hear you I Want [noise]\n\n\n[noise] oh and I'm sure there are and and don't be a\n... or ... or\n... or so and they should\nGo to the older one and and all the way\nIn the early ... [noise]\nIs there an urban fish grilled burger or better than the bottom where wall around the corner office\nAnd\nYou know there are a ... a man named\nAfter\nA while and then when the shah can no longer\nTerm tests on Easter you will not run on a show you all we're well\n[noise] I Do go away from the tree\nOr we do to my knowledge\nOf the human being but no\nNo no ... or\n\n... or or or\n[noise] um so [noise] so [noise] so\nThursday night di di di di di di di di di di\nDi di di di di di di di mind on by that keep them or you know they're not in not giving you a\nNice to know and do it than we did I Know one of them are now more than ... yeah and\nI'm Glad to get into a nice cat on a law that I don't\nKnow how do we do we know one of them all up and say hey I'm probably\nOne night and not being all of them\n\nAre on a new\nKing why I support it in part by volunteers from the community ... volunteers are students take many members can provide a unique on air radio experience for our listeners in northern\nArizona the key way ice down thanks for your contribution to hoping radio key why I eighty eight point when they grow up\nYou know I remember when I\nYeah I've been to volunteer for the past seven years now over here to tell you what station jamming out with me that that I can plan for all those years walked away for a while ago five years and got back to tell you I missed it so I came back to John John Kerry why stop again it's a volunteer so if you come down\nHere and Philip application to\nJoin us as a volunteer and help us because a lot of things to do around here to we can use your help and I volunteer but I Want to say a special thank you for our newest volunteer and she's been helping us She's been doing real good job her name is Joyce you've been here for what two weeks no\nReally no I guess I'm wrong three weeks so I got to sign up to her she's a\nShe's a she's over here helping us up we appreciate her her help that she's been doing over here to tell you why station so I'm a nurse and just went up to her I really thank you very much from the ... station staff and everybody out there to appreciate church to help you I get no better\nThan um na\nNa\nNa na na na na\nNa na na na\nNa na na na na na\nNa na na na\nNa on a on\nA on\n\nA on a on a long\nTime\n\nOn a on a\nOn a on a on a on a\nLimited number of them turned\nAround and I do know about him\nI'm I'm a I'm a\nLittle bit but\nI'm not I\nHope you land ... nice to meet you back Hi I'm Janet Hi this is Eric and start the whole uh my name is Jim Jim boy and you\nSay\n... na na na na na na na bought it on a\nOn a on\nA no no no\nNo\nNo no\nNo no\n\nNo no\n[noise] [noise]\n[noise] [noise]\n\n\n[noise] [noise] [noise]\n[noise]\n[noise] [noise]\n[noise] oh\nYeah that was back to back NATO Krieger I dare I Would like to go to I haven't seen her do for music for a while I thought a preamble over there\n[laughter] I write off you are too good for you guys are you [laughter]\n\n[laughter] I\nUh do ready for it as fast as bad as bad as that\nDon't have any day\nNow [laughter]\n\n[noise] [noise] [noise] 'cause I\nDon't mean to me how long\nYou're\nGoing to do and you know there were [noise] um [noise]\nYou\nKnow I I'm getting in the dining room doing\n\nOdd jobs not being\n\nNo no I don't know\nWhy\nDo\nWhy didn't I didn't know what\nI Would want my child ... away\nFrom our\nWay someone ... you know the guy who won the\nWay\nYou're\nNot going to wind\nDown\nYou're going to die you know hey you\nI Hope you\nWhy are beautiful down and hope you land\nYesterday was a beautiful day outside lots of fun lots of cool air near getting both time go don't forget to get those jackets out and get him ready to start putting in your stove inside your house because I Know you owe to come out are ready for the summer time\nIt's your cold start shopping as we're getting ready to go home from coal and from work to your house yup it is going to be that time of year again we're going to be all shoveling and everything I say I wish summer well here it's too cold yeah I Know that everybody will say if you are worried about anything out there or not the soccer\nBall\nBearing right there will be happy being happy July ... one\nNew reliably has dropped but when you may get a little dog we're already knew who may have been worried about getting I\nDon't really have to worry\nAbout\nOh oh\nOh oh oh oh blah blah blah [noise]\n\n\nYeah\nI don't know whether a little bit of the pie and we go to a new one you will\nBlah blah blah [noise]\n\n\nJewish smile\nOr don't re ... the pie and we put a new word you we will from that will bring everybody was so don't worry it could be having be no other way may have\nBeen trying to do is be happy\n\n\nFor the bomb bomb bomb bomb [noise]\n\n\nYeah tell me oh I bet they\nAre now I Am [noise]\n[noise]\n[noise] [noise] that I can\nBring it back like you I bring him back in the coming county that Joe wait wait wait wait wait wait where would you\nGive me your phone and they said she wouldn't give me [noise] I think I just think how you how\nProud I Am not a nice name how\nThird certainly [noise]\n[noise]\n[noise]\n[noise]\n\nRight and I talked to\nA balance you know you want to do it I don't know what I what I Do not need to\nGet out when I talk\nTo me [noise]\n[noise]\n[noise]\n[noise]\n[noise]\nBoth above ground you've done do you get like another for you to show how did you over the banks you brought it down to ... do you still don't know what my the bomb go buy them in the window of\nTime [noise] [noise] [noise]\nA widow\n[noise] wedded [noise] did you when you when you [noise]\nAt the end they don't let the kid\nIn the Muslim but then like they'll get better but the one that women need to get behind me now like the navy base you know like it was all that we should bring back the law but the you know what you liked about with the president tried to know that would be weird like that they know\nRandomly but no ... no ... on a bigger so but I think what the lady I'm Alive and you know where to drop drop it depending on where the bomb on a book you want to know me don't be really big wedding\n[noise] it could\nBe waited on [noise] ... if you went in and you can you be\nIn the mid ... when\nWe when we\nDidn't we didn't know when you do\nWhen you [noise]\n[noise]\n[noise] [noise] yeah that was a real good for a\nDay or did you get what they don't tell you why one I got to do is we're coming up on next shake it off on Telluride for one\n[noise] [noise] yeah not that people\nHave to tell people to to find the right\nTo to try to get paid [noise] [noise]\nThey pay I pay my main thing I have a\nGreat great great again a bad day they said perjury [noise]\n\nBut they\nDon't they don't do man [noise]\n[noise]\n[noise] [noise]\nRight and I think that [noise] [noise]\n\nHey I just think well you down and out about the law isn't the dirty dirty says well\nYou could have been getting down to the man you know God it was like oh my God I'm shaking I like to have to come on baby will just shake shake shake\n[noise] [noise] [noise]\n[noise]\n\n\n\n[noise]\n\nYeah I Know for slipper there which they could all listen to tell you where are you there for the one\nYou're Native American public radio station a project off the hope is foundation hope you guys are joined a bond that I've been playing are you guys so keep your radio during then because they have lots of I'm used to play again that's going to get it from going I got some hits the road jak right here that\nThat the wire haired\nGuy and you come back role model with the day don't come back no three day don't come back role model my window oh dang comeback low\nOn a diet and don't go not only brought on by the phone call nut Romo day will come back home loan on my window mode that you know go not no no no\nNo no no no no more no more no more no more a little more normal middle whoa whoa whoa whoa whoa whoa whoa whoa whoa\n[noise]\n[noise] [noise] [noise]\nI'm more normal [noise] [noise]\n[noise]\n[noise]\n\n\n\n[noise] [laughter] [laughter]\nGuy again don't go along with the phone I don't go low low don't come role models with the ... I don't know more and\nMore and\nMore money at all no no no no no no no no no no [noise]\n[noise] [noise]\n[noise]\n\n[noise]\n\nNo well yeah then I end my you know right now my sound like you I Am on my\nYou know I'm a little more than ... ... make all the tiny teeny tiny the my name is Ben in sound like my ... well yeah I Am the religious somewhat but me I Am the tiny teeny tiny helping him I\nOh wait a minute or ... I talk to you and I taught you move on dot\nDot dot dot the ups guy the opening about out on\nTop of the\nYoung readers may need voices and the mouse cleared his voice and sad for me to share my\nElementary readers may need to be to you Ron ... they had no luck marriage and the and you cannot remember where he left St Bernard parish and\nOlder children may benefit from discussing what they're reading an answering your questions about their book what do you think the main character which they were there what do you think what the central no Mediterranean help your children develop into lifelong breeders oh this is Joe ... president of the Arizona Education Association will\nReading to your children early an awesome race habit that can last for my\nEncourage reading in your home by listening to the library and letting your kids pick up books on subject to feed their natural curiosity what's books reading as a habit looking for a lifetime of learning a message from the Arizona Education Association\nYou are listening to KU why hotel a eighty eight point one F. M. N. K. U. I. L. P. upper among Kofi eighty nine point one FM projects the Hopi foundation aiming on line at K. U. I. dot net your Native American public radio station\nI this is arrogant star you're the ...\nYou think the library Britain and letting your kids pick up books or subject but the truth either natural curiosity with books reading as a habit when a lifetime of learning a message from in Arizona Education Association\nYou are listening to KU why hotel uh eighty eight point one F. M. N. K. U. I. L. P. upper among Kofi eighty nine point one FM projects on the Hopi foundation aiming on line Nick Cave why dot net your Native American public radio station I\nThis is arrogant star you're listening to the edge collecting mix where you're not likely to see fifty cents out having a burger would be or on T. V. Y. I. eighty eight when one at\nA ... a well ... ...\n... ... or\n...\nOr maybe even\n[noise] [noise] [noise] what [laughter]\nFrom then on July when decisions and the laws that Rick ... won't buy we're going to be up on your dawned on me nice being with my\nMum restricted to what I Would never ... they're not in not being down ...\n... you weren't that good money beating the turnover that my child when they're older I get back on the town took a trip to San Diego ... that's the message and the liberty ... people in my view on my mind on China because no\nOne industry lab that I learned that you know\nI never thought the on or by the\nTime you ask me I'm In the ... what are some that were on the street and it was just not me\n[noise] [laughter] [noise] but now [noise] [noise]\n[noise] [noise] so now you know I'll get\nMy money being such a well known for\nBeing with somebody with me that this year ... some inside the mind the project where you're ... you're going to be independent\nShops I read it should've been done the where the ban is she in known but at the back room to eat at home and getting them with the ... the focus of and the job you know I don't\nStop Benjamin was the lead you to put the German censorship put the two or the ending the dotted you didn't need to be the one with\nThe family at the Showtime reject them on the whole community or from the get the get the button made page on the way I mean I don't want you to play that much I mean do you bring their population but not with him he hadn't done you know\nOn the ... when I Want to weigh in and says you want to know that you're bringing on Venus I Would probably put the brakes to get kids do you like to make him getting the germs are mimicking military yeah\nJohnny Was about me in the ... that showed no word on the street and I mean\nOn a show on\nThat but now I got out of that but now they\nGot rid of the hard way you're not going to work and not have been ... you really got me ... ... or when we're talking then ...\nThen they get to catch up by ... was trying to get them and then the guy that me about Jean ... D on the Web and the only one issue in Tempe and then I Would probably be\nOne of those kids in the middle of a ... year run nipping I Can't they can't\nSmell we ended up without my ... been a lot of concern right from the time and your job man you know when I Know people in the game is never pay to play\n\nAnymore around you and I like she and chatting and fat area and then I may comment Diane how are you in the air and then there\nAre bad but now you know [noise]\n[noise] [noise] but now I got out there [noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise] ... ... ... ...\n\n... you\n\nKnow\nThey\nMay or may although more money in that world would be you\nKnow when I met a\nYoung man\nMhm and I never think that you were with me\nYou know when a man\nA\nYoung man who gave me a little bit on the news and how can we tell them what's wrong with that and when I look down\nOn the time\n\n\n\nAnd I know when I get this will not bad then you're you're\n\nJust a little\nBit you know he was on and on Monday and will say oh\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise] [noise]\nMhm and open the law and and you want to remind the\nLine but no single little thing and and you know we think\nThe\nMan's name or not the veto any anger\nAnd and then you know I knew that you know\nAnd and the men and women sunshine and ... and ... she and I [noise] but no way you can learn sign\nIt'd be pulling\nBack in the national news at night and [noise] you know\nAnd and and the Lanny Davis sunshine and he just keeps daily ... she came and lived in a way you can shine\nA light at the beach in\nFlorida and then\nAnd now they have been banned during the day\nAnd\nAge and then you know they knew that I don't\nI don't mean [noise]\n[noise] or a bone and [noise]\nAnd it lands don't want to and\nYou know what you might see in the ... but you also look at the same thing and she wants to leave because they\nMay or may not be bold and [noise]\nMan you know what I Do think that the American idol and you know not only the na na\nNa na\nNa hey you know the you know the parents at the end [laughter]\n[noise] [noise]\n[noise] [noise]\n\nThis is from ... to deal with\nIran is oh let's let's take a call\n... this is getting to know\nThat we will be more\nThan just a total sense to me to be one of\nThe day that you\nKnow no no no\nNo [noise] oh really\nWhat does your mind and\nThen um I don't\nKnow a lot of the\n\nDay you\nKnow you don't know whether that's been rather than oh man\nOh man I [noise]\nI don't know if I'm not saying it\nYou know I'm not a big\nProblem\nYou know [noise]\nUh no no no no the\nBall the ... for your show\nSweet oh train [noise] ten [noise] no [noise] God man from me\nOn it and it over to\nHer but you got to do that oh my God\nBless me too oh no here we go from McCain into [noise] now\nDo they come from [noise] we don't know man it's a little moment you know one of the kids come\nAnd we go from the ... [noise]\nNow do they come from a legal term in\nDa and all the\nWay the way [laughter]\n[noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise]\nOh man I don't know I thought you know what I mean they just said you got to feel the motivation I meant\nTo drag it into law [noise]\n\nCome to be able to be able to do with [noise]\nNa na na na na na na na na na na na\nNa na na na na na na na na na na\nNa na na na na\nNa na na\nNa they do to you know\n[noise]\nUh no no I don't know [noise]\n\nUh [noise]\n\n\nAnd John du da da da da da da da da da da da\nDa da da da da da da da da da da da da da da\nDa da da\nDa da da da da da da\nDa da da\nDa da da da da da da da da da da da\nIt's been at the moment and not and then one day they'll learn to\nMaintain a been a little bit you know\nI Love the book then don't let them be bought out what I've\nDone the same with me so I'm In I'm In\nA long time John John Donne then but I Want I don't know and I'm going to go\nTo\nThe man\n\nTo\nTo do that\nAnd [noise] [noise]\n[noise] [noise] [noise]\nAnd and the\n\n\nThing to\nDo\n\n\n[noise] [noise]\n\n[noise] [noise]\n[noise] and I do\n\nThink the main low when did\nYou they wanted to bring them to do only did not that it made me wonder you don't see a man but but I Love\nThat\nLow Lamont dishes cast iron lie on sounds and you're enjoying the goalie eighty eight point one at ... am hope the radio\nOn my\nOwn now hey hey hey how are you know a\nLong long long ah hey mounted on top of your mom okay I'm a gay and I don't know how to make\nAnd try to you and then our\nName on a long time outside and I'm sure on the side and on and on and off Iran cold as long as I can ask our\nAn energetic ... ever present on Sunday and I remember in Nineteen fifty six women earn as rain and become a state of that rule changes you see is jumping on\nWho wind works all dogs is John's ... with a capital capital to get a mom or just grab all over\n\nKnow\n\n\n\n\nI\nDon't\n\n\nKnow um\n\n[noise]\n\n\n\n\nYou are listening to K. U. I. ... eighty eight point one F. M. K. U. I. L. P. upper ... eighty nine point one FM projects the Hopi foundation streaming online at K. U. A. I. dot net your Native American public radio station\n[noise] [laughter] [noise]\n[noise] [noise] [noise] [noise]\n[noise]\n\n[noise]\n[noise] [noise] [noise] [noise] [noise]\n\n[noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise] [noise]\n\n[noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n[noise]\n[noise] [noise]\n\n\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise] [noise]\n[noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n\n[noise] [noise]\n[noise]\n[noise] I Do think that\nThe market [noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise]\n\nAnd and and and and I\nDid I Do anyway when she cut into the new blue in the middle I'm painting ...\nMillion but I don't know why I Want to live no no no no no no\nI'm I'm a cheese is a no fly zone\nAnd\n\nLive their lives knew when they go to Canada gambling listening you belong to them and on an album and I was doing laundry and John Nagl is the dollar\nBill and then you don't need to move around a lot in\nThe future so that it is a guy named\nA cheese a new\nJob in\nBlame the\n\nTo\nThe right road blaming the\nThin Man oh wow you really only oh\n... oh must be laundry ... are you oh\nI'm I'm a new name on the\n... or ... must be one reason why are you I'm ... [laughter]\n[noise] oh oh oh\nOh oh oh oh oh oh oh\nNo [noise] no no no no no no\nNot really let 'em on and they know your name in ... I'm going to talk about it and then all of their online and on and on there\n[noise] [noise] [noise]\n[noise] so following a flash flood warnings to the national weather service in Flagstaff was issued a flash flood warnings for\nPike county in West central Arizona Coconino county in North central Arizona go free Fifteen emergency entered into the fold eastern\nStandard time I'm from the arena indigenous owners stones producing heavy rain a cool one area once you once and a half inches of rain has already fully flash flooding is expected to become surely\nLocations they will experience flooding in Sedona and there's really a campground includes the following streams between as you as\nA drawing for each creek in spring creek moved to higher ground now actually to protect your wife\nCan be especially when it is harder to recognize the dangers of flooding repeating when I was born in this country should until free have seen\nA mountain standard time for the following county in Arizona you know any of them I\n\n\nDon't know John that will find a job and everybody we argued that day and I know a guy named Robin and thought about it on a ... and I bought it and I know I Do\nI yeah I got that are going to\nStop trying to do that oh my God what did you start [laughter] [laughter]\n\nOh oh oh oh oh\nAll right now I Wonder\nI Wonder if that's all about what about soccer\nBall that don't know when you're not going to\nLearn that do for a job but I\nDon't know I don't know [laughter]\n[noise] [laughter]\n[laughter] Oh nice to see to it then [laughter]\n\nYou\nKnow it made the comment I closed my ... my father does tend to\nBe that would be the highest those guys said to me\nThat the only one in mind [laughter]\n\nYou know and I used to uh to me along the way many\nNa na na na na na na\n\nNa na I ran into a really bad [laughter]\n[laughter] yeah [laughter]\n\n\nAnd that Iran to limit the\nAmount of time and I don't know [laughter] [laughter]\n\n\nI\nCan't find that hey may ... you could\nStand that long which does make me on the\nJob and\nThen they\nSay he has to be a\nGood\nCompany friday everyone should be able to shop for today's show\nAnd I\n\nThought that was true\nLove God and then run around in\nA\nRow and I was oh my God oh\n[noise] [noise]\n[noise] [noise]\n... and ... and ... [noise]\n\n[noise]\n[noise]\n[noise] and you know\nI'm ... I'm not on July John John nice to know [noise]\n\nAnd I don't mean to me um [noise]\n\n\n[noise] oh no no no no no no well me I don't know he told me I I'm an [noise]\n\nNa na na na na na na na I Am I'm na na na na na na na\nNa na na na na na na na na na na na na na na na na\nNa na na\nNa na na na na na\nNa na na na na na na oh they're on line as well as much to do a lot of land but oh well\nI'm On I'm On the ... [laughter] no I'm In a day [laughter] child [laughter] no\n[laughter] I Am\nNa na na na na na na na na na na na na na na na na na na na na Joanna\nI'm a I'm a ... year [noise] a train or not [laughter]\nI'm not sure\nI'm I'm a\n\n[noise]\nA man or a vein but not by a man do you uh the vision\nYou just don't want to do and the news stories on the and I'm sure man and a\nLittle man that I'm sure the greater and um and they were a\nMan or a you know and I'm not going to be going through a guy\nThere is no no I Am in the June ...\nNa na na na na na na na na\nNa na\nNa na na na na na na your hand or as you looked at me and then uh yeah well you know I had a\nVision and you know when do you know the you know the rangers ... you know and and you know ...\nAnd I think you know and I'm the\nOnly game though you know what am I going to be\nThere and no no no no you can't ... na na\nNa na na na na na\nNa na\nNa na na na na reaping\nThe may ... ... ... ... going to try to be here and I'm not you know ... ... ... ...\nYou\nKnow during the day and I live in a way around the news and and that and the new ... down there is no no I mean I knew they knew the navy\nAnd the main man na na na na\nNa na na na na\nNa\nVe\nDone thank me they got some guy ask ... square hello this is by the donkey from human cremation you're listening to pay you why I eighty eight point one FM streaming online that Kay you why I don't know your Native American public radio station a project of the Hopi foundation ... ... ... na\nNa na na na\nNa na na na na na\nNa na ... by the river but no I'm the wrong dirty and I'm In Oregon where yeah\n\nEighty eight point one FM streaming online at K. you why I don't let your Native American public radio station a project of the Hopi foundation ... ...\nNa na\nNa na na na na\nNa bother reading or ... you know the drunken dirty bombs do we do will na na\nOut on later married ... ever and I haven't\nGot loose and I've\nBeen a John John Kerry and saw oh every ... every man and a five year old\nDaughter way on [noise] and if the UN knees\nWe right\nMan show me a a [noise] um\nYeah oh yeah\n[noise] uh [noise] [noise] [noise] [noise]\n[noise]\nMm\nMm\nMm [noise]\nUh I'm I'm a\nLittle girl\n\nOh\n... oh oh oh well\n\nYou are listening to tell you why what Bela idiot when one F. M. M. K. U. Y. L. P. upper ... eighty nine point one FM projects up the whole foundation streaming online at ... dot net your Native American public radio station\nIn a way I mean he used to make big mix but [noise]\nHuh oh my God\nOh I'm a I'm a I don't know it's hard to do you hear the young man and do they\nDon't know I watch you know all the soldiers and stuff\nAnd ...\nAnd ... and then get land up in my\nCar but not all look around you know I don't know how people come in all\nBad I mean you know like they don't even you know man and one day than bad way\nAnd we hope was training no progress you may have seen like oh no no we're\nIn a long way in a way I see I Want to watch on the one\nI Know you went out on the right to get real about those people don't matter you\nKnow they don't know what they are the shows than what they can ban it I\nDon't know man my accent you laying around\nAnd when you need to know who you are [laughter]\n[noise] back then\n[noise] you\nKnow you're not around no matter who you know you\nKnow they didn't do all they do then show them that Hey Joe Queenan man\nBang bang bang\nBang bang bang bang bang\nBang you\nKnow an issue now I'm In no oh man oh we don't know\nI hear you I hear you know you don't know me I Know I don't know what I Want you to know me wanting me to do you but they don't get it get to know what to do that you know when you\nTell me what the hell's going on the story you tell me what's wrong with that but boy the Milan feel like you know that I had to be gone\nA little more like a broken up up for not sure whether it be the perfect meal would be on the part I don't want us to use but I don't want to be kept up with a way that will weigh that news but\nI don't want to you want to see you\nKnow I don't want to see you don't want to me and you know they give you\nThat pain and we're still both spending as\nWell as big a dream which was a\nNice you know they're all three times a week no one to\nBut no I don't want to see you know but I don't want to be kept up his little way that you don't want to put on weight at news but I don't want to meet you want to see you\nKnow I don't want to see what I'm seeing you know they get to\nThat pain and we're supposed to smell the dream well would you\nLike about it they're all parts of the ... ...\nUm [noise] oh my\nGod I Hope I'm a yeah oh\nThat song on and they don't care I'm a\nMan who got strong man I'm no longer a non Muslim man ...\nNo you don't know me no I don't know you\nDon't want you to know me\nAnd I want me to know you watch the world which he just wanted to be lower the mound about pools or didn't watch much t._v. shows now what's hard is it is no smoking and you can\nMake it harder to do you what was what they put the ... when you run on human nature to the pain but\nI don't want to thank you I just want to see you lead the way that Glenn what ... what is the director of the new pressure not one of the Spanish one of the new clashes in\nYour view that pain and we're still going\nTo get more bone was making your own well what do you feel like the it was like ... ... ... ... well\nYeah\nBut um yeah\nYou know as long as ... don't care about the long run and then um oh\nMy my my one of them I don't know\nI don't know if I don't\nKnow why she didn't know what I\nDo I don't see why that's why she\nDon't know why don't you don't know why don't you tell me they told me that I could be you know get to know to to\nMake you wonder why don't I don't know how do you want to\nKnow what to do my job but then when you don't just want to know when I got to\nUnderstand that when you're when\nYou're when you're not that I'm In the\n... million by going to get my million new to me I have to tell you the\nBest way to make\nYou\nMan\nThere's no she's not going to make your your\n\nMom\nOr\nA Lone Ranger\n[noise]\nLa\nLa\nLa la\nLa la la la la\n\nLa\n\n\nLa\nLa la la la\nLa la\n\n[noise]\n\n\n\n[noise]\n\n[noise]\nYeah [noise]\nWell you know I don't want to know I don't know I don't really know the long term solution to\nYour your men from me for my sold them to change my mom's like we should kind of that now you don't see much more or less the let me let me tell me\nWhat my turn to when I'm On the pornography and he's from Brooklyn ...\nI don't know who I'm with you Lynn\nWhen I should be ... now do you put them on coming out you can hold\nHim on top of my deadline looks like it or not we should debate tripling it's been hard to read the book because they'll be making more than just brings you\nDown a new one in the street ... leader with the local you know\nIf we can get back on the big movie don't ... I'm\nSure man when you have got like ... like they may do something and then the\nWhite like the man you have to pay you might be your friend like three they may do this and there's no big wide life is\nWhat I Love to get you caught oh look at my mom Glen and Glen that and that's what I Would be longer\nDumped on your back and then we found that you can ... you know what that means you're not working them\nWhat do you see me ask you about a minister and smoke so\nThen I was lucky\nBecause I'm looking to coach a talk show in when you're ... ... ... ... it's like you know like you know so little company on my one of them do what the shoot down\nWith them now you may have gone you might be it should be addressed to the guy like they made it clear to me is not quite like man\nYou got you might lose your job to dress like we need to do this you may have\nBeen no big white flight\nWill be more like what the reason why you like to remind you to like ... ... ... ... did you get this when I Won\nThey should be made to me the name is not quite like the man\nAnd he got you might need you to interview trashed two guys like he may be here this is not white light\nUp when they went through smack slanted Randy I'm reminded from like these should lead this country in the street when I'm On a new jumping up will be an\nAddiction to be able to find something to be clean walk to the bottom of\nThe most from and how much mountain most for you\nAnd your brief brief from\nWho's trying to bring you must be like what's happening with what you want to use the street for me to put man on trial\nFor me what Clinton much when I went to see if I'm willing to I mean that's what I'm so close to you know you wish you to listen to some slanted but I'm sure you know just just come from poor little [noise]\n\n[noise] [noise]\n[noise]\nUm the thing is that I can say okay you got to know and\nYour mom and rabbi [noise]\nUm the\nEnergy [noise] Mm [noise] yeah I'm\nI'm just\nSaying that you can\nMake me get bang bang\nBang bang in [noise]\nIn my life you know don't run down the drain your mom beat in band live\nBetter than the em Ali ...\nI'm ... and and you know\nThey [noise]\n\n\nAnd you're very [noise]\n[noise] [noise]\n[noise] [noise]\n...\nMm [noise] [noise] [noise] [noise]\n[noise] [noise] and those of us are in New York or here in Oregon too on the bed\n[noise] man\n... Mm\nAnd those of us are in there and\nA half of\nThe it's just me or you can go to on the bad part of a\nHeating and he then he\nTook out in a row based on what they believe they're what made you go oh what\nDo we ... we got them now we know now I'm going to do\nAnd he knew he was a\n\nFull moon and they were born there and then on\nThe uprising Shay yeah it would be a millionaire I made the mistake was more than ... ... for the day will then they were in the summer\nYeah yeah yeah\nYeah yeah yeah yeah yeah yeah a bone loss we have no way and\nWe got enough good deeds training he may be coming up on a machine\nHere at the\nTime when\nHe came to\nPass a new thing you can also join me all\nThe man the one that the other day he\nComes to mind is going to get enough money you know he\n\nWas on this because we did a study will\nCome in and I talked to in the\n\nLast nine of them will not last July ... to me the on the\nMedal a reflex John\n... y and Z on science uh why you're all weekend long ironically I I\nDon't plan to just not going to mess up all of these ... these shows ... or ...\nYou\nCan and must\nDo more than they were there and they will be in this in in\n\n... and ...\n[noise] [noise]\nOh people this is Sam you'll see what they were from the public library program one such a case where you are listening to K. U. I. eighty eight point one hope your radio streaming online at ... dot net your Native American public radio station\n[noise] [noise] [noise] Mm well\nI'm In my\nView\nOn\nOne side of me now to leave leave me thing in my life is going down now to one of my never come back come around a lot they don't even my house now what do I go what do I do know and it's only her to know you only thing that's the way\nThe way I Want to let you lead in a way to pay you have you with that she was there when you think about my life the way we do\nEverything they call them like the one hand while saying why don't you believe I was so when it's all of them I\nWant to see a lot of ... I Wonder if I were more than anything wrong but I don't care they actually are well you know I'm not going to be paying any more so I guess I like to move on now\nOh I'm Glad I don't care for all we had to lie in Bonn not what we're going to rain any more so I guess I got to move on and I guess I got to move on an hour\nYour rent\nYou know like the man\nWe'll probably have been in line\nFor land and tell us a lot of times that down\nOh God I Love most about it when it\nComes down to the\nWay that will come to read that book\n[noise] [noise] [noise] [noise]\n[noise]\nYou are listening to K. you why what below eighty eight point one essay M. N. K. U. I. L. P. upper one Kobe eighty nine point one FM project felt the Opie foundation streaming online at K. you why I dot net your Native American public radio station\n[noise] [noise] [noise] [noise] [noise]\nOr ten or they knew that he had made to attend\nA new way to the wrong side down\nAny new man in the entire neighborhood they sit down with the Bronx\nOutline behind the main topic even if it's not in the you know let me tell you I called the neighborhood music at home where you have read that at the age of keeping share with you on bearable below some terrible to draw the\nTwo the two are a lot to deal with the ... new rules that gets\nMore than likely they knew like loses I'm killing you do ... being a childhood dream about what is being abused when they come up with good intentions widely bad impression to\nSit back and saying they don't have too many questions if you read the Internet was my light in the bed and I'm getting may never nobody like when there's so many people like a neighborhood and it's not the hair may near the entire neighborhood\nA new way to the Bronx I\nMade the news magazine but they were they knew that but that runs down a new man [laughter] manner to jump in my back I'll be back here just before when\nThe law but no the last week I mine are being bought we bought it Pete Dye may be yeah ten pac to the pre school defend the backdrop to branch off the street from the ground in the bank shop and I can't stop when not to\nBut I don't know about the coup that to neighborhood the laundry smoke emerging it's got to be the spoiler came over to the store to get some ... some time and change a thing to me that was really only that but I bring one of the coal mine and they were ... people\nBut no the ... mine are being bought we bought it beat it I\nWill make them the chance to yeah just the getting the backdrop to bring\nSome grounded on camera up in the bank shopping I Can't stop would like to know what I'm most I don't know about the coup that to neighborhood movie laundry smoked gene got to be that these people are when I came over to the store to get some ... on the right time and change a thing\nTo me is that where we live for me that's what I bring it to like pull my neighborhood people you're not going to be you know people may you may\nHave been made into a new way to the wrong side may you may have been able to stand\nUp and\nDown the wrong side\nI'm On the benches neighborhood cash in on the question is whether they potentially whenever you want me to answer\nThe heat of the needle needle in changing like eight or ten years and maybe have the tensions and the town that was the only game down Florida yet the part of the door and you know talked to last for them to try them on a pension\nIn English in mind that sell the bars we had a lower ... minutes there's always had a car and all I had\nWas handlebars and the birds that I spoke to entertain the man that I wrote about one neighbor who they may be your entire neighborhood news\nA new way to the wrong time may you may entire neighborhood and they\nKnew he was down but the wrong side of town day the new man\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise]\n\n\nSo so you\nKnow and and do it and then they can do and [laughter]\n[noise] [noise] can\nDi di di di di di\nTurned around and looked at by name John Ritter died and\nMe I can be bothered\nBy British out there that you're talking about five days childish dry me I thought that by train between like Mary Tyler plan\nAnd we do not know that I shot back you know try to really\nReally\nBad back in the\nSouth firefighters who's a member of our me three I natural caused by ... percent go buy a yacht shy man man turns me off guard by British John treaty I'm not sure go try to\nFind a job and then try and to me I Can't buy bread and go\nTo John\nIn your ball and you start your own job to try to [noise]\n\nGo home in la [noise] [laughter] I don't fly in the north\nKorea is going to lose in the\nBack during the Iran blind my insurance company that caused by the by the age out on their di di\nDi di di di di di di di di di\n\nA horrible horrible horrible verbal\nBombs are and no one in my ... are you um are they going right now I'm In my mind when I was around now I you know and I'm ... now and then\nThe bombs so much but I'm trying to make their own time\nNow and I know I don't mind and then it turned out I mean\n[noise]\nThe one who is who is in the next\nTo bomb buying our song el Rey non than our sun will re ... and I want to solve their own brain man on the phone with me when I'm trying\nTo find common ground\nBy ... by the way they talk about race\nAnd [noise]\n[noise]\nMm [noise] um\n[noise] a little\nBit more you know the\nBottom line and and I want to remind fire now I'm going to turn around and now I'm ... I'm a very non I saw my\nMom turned to return them\nAnd you know it's great\nMy mom my mom my mom around in there you'd already learned early on\nIn their in their own\nPeople who is not there to ... ... ...\n\n...\n... a ...\nThere was no ... no those two lane and throw read 'em\nBut they know the Mac newly I'm new to the man or woman told that they like to know ... hour news all the time then and then the long yeah like when you're\nTelling them na na na na na na Lansing\nBureau or in a way I'm a\nMan [noise] we back into the cancer bill really mean any big band in ... than we are that were\nDying so na na na na na na na na\n... yeah we uh\nWe uh\nYou know I don't know what you're saying and\nHow do they have an animal and\nWe ah we ah nah nah nah nah\nNah nah nah die dream that big of a man that God do one thing I Would do a ...\n... is the founder of it and ran and we\nWere to\nBe a guy I think\nA lot of a ...\nA a a a A R and\nD yeah na na\nNa\n\n\nNa na na na na na na na na na na\nNa stop writing a bothered by the shark God Forbid no in the car board and everything and all the ones who love them in the towers broke and also a field but\nI Am God reach out to dinner as I'm sure there\nAre\nThings that came in um ... do they know you can tell the truth about Adam ... their grandchildren are preparing machine guns and na\nNa na na na na na\nNa da da da\nDa da da da da da da da da da da di\n... which she says they can be in the ... the ... the other three seasons but I mean [noise] as\nThe ... [noise]\nA friend McCain never shown every I don't\nKnow but then on your show every week right next to you know I'm In New York oh no no\nNo you do it in the world or in the ... through ... you know the guy but a million dollars in the world through one of them though the euro\nNa na na na na na\n... for every million years ago but now you're on the last time they ran out no no\nDa da da da da\nJosh I'm On the Sean Sean's or on a job\nAt all and they're all on ... on the show no true southerner da da da da da da da da da da da da da da da\nDa da da da da da da da\nDa da da da da da na ... you're right you're on a ship owners on that show that I saw a ... a guy on any age are you old\nEnough you know hey Josh Potter yeah ah and\nAh [noise]\nA\nGolf cart and I'm not sure I understand\nWhy ... ... ... ... and Andre Andre\nBy any means but I Am I a\nDollar five dollar a day off ... ... s I sure don't ask don't they don't get a job you know a a ... a year and a a\nA A R T H ... joy ... body out or\nUm [noise]\nAnd um [noise]\n[noise]\n[noise] well oh whoa whoa whoa whoa whoa\nWhoa ... or ... oh no no ... well ...\n... ... no ... yeah oh I Know yeah yeah you know thank you and I'm Renee yo I'm no ... no ...\nAnd then now feel they're you know my dad and my readers land is your essay on ... on your way to a ...\nNa na na na na na na na na na na na\n... on them all and I'm going to do while while I was a guy went down I ... no ... no no no no I'm a\nI'm a when a man named ... and ... rather than the ... [laughter] no I hear your on your town man you know no more than what\nThe ... and that raises the ...\nThen you know I'm ... and ... and the surveyor ... that one was in a while you\nKnow and I am a ... mile walk\nAround on ... on their bottom line right guy when they're when they're on and like not a bad out here we are on the oh ...\n... ...\n... ... s a um [noise]\nAnd then we can\nShare with Neil ... my ... my ... never in a bad way I don't know when we were very na\nNa na na na na na na na na na na na\nNa na na na na na na na na na na na na na na na na ... I'm a black guy\nNow and now I Know I'm like nah nah nah nah a year ago when I have a job or um or well you\nKnow a dollar a man or whatever you know a lot out around the world that\nAre on our you know like the odd jobs that are around ... ...\n... ...\n... dream of dreams regarding the crew Maine or we always ...\n\nMhm Mm\nMm\nRisen dream of dreams will agree on the remain and we always listening to you why I Know\nMarathon near the lake we may be like hey\nDo you like the Yankees play ends up day to make the world man hey you do your book about the things you know let your body\nWeight on your Wall Street all the way you know the\nThing that\nI'm back in the grand out that there is a bit you know all grown just just to let me up because I work my way to do that that was going to\nMake sure you don't even know where you're writing from and we both can we be more liberal\n... by the by the you know another thing and now the now now that the people bring out on me to be at the ready or not they\nShould go either way you know read all about the same time and we both really going to the plate\nObject in the coming days McCain butter burn it well then the MVP had no to that and I'll go with their big but I never do that but we know bomb like Pamela and up there on the first thing I Do I got lost and if you come and get a girl I had to\nSell the where did you read the\nBook and we were we waiting and waiting and waiting and waiting for you know [noise]\nNothing when I'm In love with a lot when I was one of my ... no no I won't go lower and lower lower\nNa na na and [noise]\nUh I don't know I'm not sure how\nThe how about you know the ... and ... it's better to do with it on\nAnd on and to\nDo the same page and ... and\n[noise]\nI don't know I don't know I don't know when or\nHow do we know there are a lot more than that\n[noise]\nNo no no no no one or\n\n[noise]\nYou are listening in the ... foot below eighty one one man and kill you why I asked the upper ... gonna be eighty nine one one that's been\nWell project the hope is all they shouldn't have been ... your Native American public radio station\n[noise] [noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\nYou are listening to KU why what below eighty eight point one essay M. N. K. U. I. L. P. upper ... eighty nine point one after him project felt the Hopi foundation screaming on\nLine at K. you why I dot net your Native American public radio station ...\nClose well I say you're\nStanding man man like a dream come true ... well what\nI have been my uh my uh they had these man no worry a lot of\n\n\nUh you know hey you know I\nDon't know\nI Know they they said\nWell I mean I Know the day when\nA man on the on Monday and you know they say oh\n\nWell we you know hey man I Know a a day where they are in\nA while so many re by a man or\n\nA lazy and not know\nHow well\n[noise] [noise] [noise]\n[noise] oh you're a flash flood warnings for national\nWeather service implying issued a flash flood warnings for fear by county in West central Arizona Coconino county north central Arizona central mountain scanned them time as we are free to standard time the public was totally\nForeign Pompeo slush and this is going to Greece Kenya expect plenty for will continue over the next few hours like forty years already occurring location will experience flooding and flus dream of mine was charming old freak launched soy\nMilk states have springs Kim fled campground\nSterling fishery and went for job creation\nConclusive following stream I'm dreaming of just throwing Greek west forego priest in Oak Creek moved to higher ground now we're going to protect your wife\nEspecially cautious as like Wendy's is harder to recognize Thirteen Years are flooding repeating oh flash flood warnings issued until the ...\nMountain standard and time for the following ... was on a program here on the other by [noise] [noise]\n[noise] [noise]\nYeah a long way\nAway the\nMan in a way I mean ah you know hey you know I mean\nI you know they are and\n\nI mean he\nThe day they have a a way I'm a ... day but they say they are gay I I'm a ... I mean\nI you know they have a a a vast array\nOf\nHa ha ha ha\n\nHa you're a\nPlayer a man I Am a player saying hey I hear ya know but I Am a ha ha ha you know hey hey hey hey hey are they are the\nWay\nI Would\nSay that I mean they are right guy dream come true\nNo way I feel like I I ... a ...\nA year but a a ... a a\nLittle time\nOh oh oh\nNa na na na na na na na da da da da da da da da da da da da da\nDa\nDa na na na na na na na na na na\nNa na na na na na na na na na na bomb on a on a on a on a\nA R a I'm a I'm a\n[noise]\nA\nA a a\n\nA a a\n\nA a a a\nA a a a a\nA a a a a a [noise]\n\nShow uh\nEh eh\nLa la la\nLa la la\nLa la\n\nLa la la la la la la la la\nLa la la la la la la la\nLa la\nLa la la\n\nLa la la la la la la\nLa la la la\nLa\nLa or or or\nOr or or you\n\nKnow the whole ...\n... is a total may ... may not actually all ... all the ...\nYour ... your your your your your your mom was a\nVery much you or your own ... or or no way no was it was a he or you're a boomer are not all but where are they are Muslim or gay and\nMy mom and my ... is our money but uh I don't know who are not your a\nLine may grow here is a total may ... here is not about eight or nine my non your mother\nOr a mother or your show or your your your your your dog more\n... and ... or ... or no way no how was it was a you're a boomer or ... or\n... or a mind game my mom I Am a non ... my name but I don't know why you know you're on the line all those\nAll the others or do we do we know the young or nay or nine or ... or I may all\nAll the high or\nThey may\nAll the IRA her ... her\nHey hey\nHo ho you're old enough to know your right now you know and\nI you\nKnow oh no oh\nA mole was or ... or you know the whole world knows\nAll are now the other day and all other OJ or or a ...\nOn the other guy or you know\nOn the\nOther day and all other say a lot more\nBecause they are\nYou know because they are low paid a show trial\nAll those for a more because\nOf the house has already layer\nAnd all because it was a ... year low they are\nSo low low or a boy or a whole lot more on the ... or ... or ... or\n... you\nKnow because they you know here\nAre low low ball or a or\nGo to the house I hear your\nLittle brother Charles ... low wage around here are a shower\nShower low low more and more of a holiday\n[laughter]\nYou know all all all all ...\nMay all drugs is a total may all roads are really thought of\nA may not know about your mother and father are a lot of talk about your your your your your um or\nMaybe a month or young ... ... dollars you know was was he a boom or knows all\nToo much and my mom my mom does our money but uh I'm not a you know we all the time\nAll over the over ... now now now now the may ...\nNo more money but uh um no no no no oh boy\nOh boy no your honor your New Yorker oh no no no no may oh whoa whoa whoa whoa\nIs turning on and off we didn't know all we\nKnow why you know or or a\nWay to yo yo yo yo yo yo yo yo yo yo yo yo yo ... done all the way or the oh\nWhy not why NATO or there's an all or\nPut it off you know they go oh oh oh oh I didn't know I didn't know all of your\nOwn ... no no no or a or\nA man and a\nWhole other mood\nOh anytime a man all we are now all we do\nNot apply they go for a bill or a\nDa da da da\nDa da da da\nDa\nDa da da da da da\nDa\nDa da da da\nDa da da da da da da da da da da\nDa da da da da\nDa da\nDa da da da da da da da da na party or\nThe ... mano\n\nA mano guano do\nMm\nOh lord ...\nAh\n... ...\n...\n... ... ... ... the yo\n\nYo yo\nLa da dum la la\nLa\nLa la ... ... ... ... ... work you know a lot of the way\nYou\nKnow oh no ... or\n... no no\nNo no no no\nNo no no no ... or ...\nA new way\nOn a a\nA a little way\nOn a on a no no\nNo no we uh we all know oh my God I Know when I\n... a lot of ... a law ma I don't know I work in a in a\nA a note on a new day in a way\nA\nA a little\n... oh no no no\nNo we uh we all know na na na na na na na na na na na na na na na\nNa na na hey\nYo yo yo yo yo yo yo yo\n... or ... or na na na I ...\nA na na na na na na na hey yo yo yo yo na na na na na na hey hey yo yo\nYo yo yo yo up a a a a a no ... no I ... I feel I na na\nNa na na na na na hey yo yo yo yo yo ... na na na na hey yo\nYo yo yo yo hey nah nah nah I still love hail a night and yo yo yo yo yo yo yo yo y'all and\nA lot of ways to go along with a way\nA ... na na na na na na na I have a ... a night and yo yo yo yo yo yo yo yo jaw and\nYa I'll go long way off in a way a day on a ... na na na na na I ... well\nA yo yo\nDa na na\nWay on a yo yo\n... a ... a ... in a in a way a night uh yeah uh well\nNo they call all the yo yo\nMa and uh yeah uh where are you on a yo yo ...\nUh no no no way I Do uh uh uh\nWell no I think oh no no real\nGuy or in a way I'm not a yo yo\nMa and a low wage although I Do a way on a yo yo yo\nMa and uh yeah uh well no no no no ...\nNo ...\nAt a ... a in a way I'm not going ha ha ha ha ha ha ha ha ha ha ha ha no no no no it was always a a ...\nI I Know a a a ... a\nWell known my whole know na\nNa na na na\nWe're on a yo yo\nLower ... no ... or ...\nYou are listening to you why I grew up in la\n[noise] [noise] [noise]\n[laughter] [noise]\n\nYo yo yo yo\nYo yo\nYo yo\nYo going\nUp in bed by ...\nWell being asked to bring up a\nDumb act young\nYoung leaders may need voices and and now clears your voice sounds bad\nElementary readers may need to read to you ... how can they can and cannot read like that where you can have their parents and\nOlder children may benefit from discussing what they're reading an answering your questions about their book what do you think the main character which will now what do you think what the central\nNo Mediterranean help your children develop into lifelong readers this is Joe ... president of the Arizona Education Association\nReading to your children early and often rates habits became laughs from my courage reading in your home by listening to the library frequently and letting your kids pick out books on the subject of interest and feed their natural curiosity what's books reading as a habit I could spark a lifetime of learning a message from Arizona\nEducation Association\nYou're listening to tell you why what eighty eight point one F. M. K. U. I. out the upper meant to be eighty nine point on that project the Hopi foundation streaming online at K. E. Y. I. dot net your Native American public radio station\n[noise]\nI Know I I just say oh\nYou know ... or ... or do they do though is you know I remember I\nSaid to me the other in the fall of ... a deadly you this way\nIf you call me now I'm a ...\n\nA ... a yo yo\nYo though is you know oh no no go go go whoa whoa whoa though I\nKnow [noise]\nThey can read it and I was in a New Jersey new I was\nWaiting for you call me ...\nHe was\nLike yo yo yo la Tengo or\nA or a little bit about it you know do do a job or you know ... ... do\nThey tend to read in the\nFall of the chair of the new I use it for your call me now I'm a\nLittle\nBit yo yo yo yo you know I Am a ... or\n... or ... or ... or a ... a law\nIs a ... a man and how many follow the non\nNuclear states are waiting for your call me now in one\nOf the Wii is ...\nOr ... or ... or ... or ... or do you go above the law\nIs a man of the ...\nThere are still waiting for your call me now I'm On the ...\nAre ... are going to do or die a day\nOr a boy or a ... vote\n... to ... ...\n... your ... your car or the ... ... ... ... ... ... ...\n\n... you're listening to get you what I what ... what happened and K. U. R. I. L. P. upper ... eighty nine point one afternoon projects up\nThe Hopi foundation screaming online at ... dot net your Native American public radio station [noise]\n\n[noise]\n\n\n[noise]\n[noise] [noise]\nYeah not a\nBad man [noise] [noise] [noise]\n\n\n[noise]\n\n\n[noise]\n\n\nOh\nLa la la la la la\n[noise] [noise]\n\n[noise]\n[noise] [noise] [noise]\n[noise]\nHey there's a\nA a little ...\nHere I Am I Am one of the day all of these laws now or that you can you know in a log on and on and [noise]\nThey said yeah yeah I mean I don't know\nOh by a ... a year and a half a year [noise]\n\nI'll pay a ...\nKind of lay out a whole and not in the dollars in a while well a lot on the phone rang and how long have you called them on the on the air\nOn and off last year at\nCollege and you know say all that all while I'm a non on yang come on stage in a new oh maybe on a great\nIdea I\nI I'm I'm very not all of them\nAre are really a shame that you know I talk to you know and obviously have a home or in the last poll while I'm On the train\n\nOr a close and I called them all\nThree of you know in that area and oh my God it's a reading of on faith in the in laws and our laws and chatting you know no comment on [noise] and they can\nTake a train or\nA ... a year I have to have the uh [noise] they always or changing [noise]\n\nI'll say oh you know obviously in a way yeah in a close eye on what he said you know I'm pulling off a bomb on the Internet\nAnd all the time when a guy in a while to Miami and he\nSaid oh no oh no I'm On it [noise]\n[noise]\n[noise] [noise]\nI\n... really he'll\nHe'll say\nWell I'll tell\nYou who knew\nWhere he well he\n... really ... a\nMale and they are well I\nTell you well know all all ...\nReally ...\n... ... ...\nA player and he'll say oh\nMy God oh well good luck to\nYou know he got a call ... ... you know they are they are\nAmong those who are going to do\n... do not agree on\nAll of a a a a A R\nA L you'll\nReally knew\nWell we'll ...\nWe'll you know ... ... ... ... ... ... ... email ...\nA player or a you know hey are you a a a\nA [laughter] a\n\nA a a word yeah oh I\nKnow I Know I Would\nSay oh my gosh oh my gosh I I saw a how shall I say I have a\nHigh a high a ... or ... why I I uh I I play I um I mean I Know I\nI ... oh my gosh I I I I shall I play I uh I\nOr ... or ... or ... or ... or ... or ... or ... or ... or a boy a\nIt's a play on a on\nA ... a a a a ... a a ... a a a\nA a a a a a a hell of a\n... a a a a a a\nA a a a well a\nA shower or a or a ... a a a ... a a\nA a a ... a you know ... or\n... or ... or a ... a\nA hell of a play a a a a a\nA a a\nA show or ... or ... or ... or ...\nOr ... or ... or ... or a way I I play a a hell of\nA lie or a boy or a boy a yellow ... or ... or\n... or ... or ...\nOh no no\nNo no no no no no I don't know maybe a\nDe ya de ya de ya de ya\nDe ya de ya de ya de maybe\nOr or\nOr or\nWhen [noise] when we use now\n[laughter] [noise]\n[laughter] [noise]\nYou go to a lot worse\n\n\n[noise] um [noise]\nWhoa whoa whoa whoa whoa whoa whoa\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\n[noise]\n\n[noise]\n[noise] [noise]\n\n\n[noise]\n[noise]\n\n[laughter] [noise] [noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise] uh\nUh uh uh uh ...\nAll of a ... a a a a\nA R o\nS a F o\nAnd all that all of a oh oh oh oh oh oh\nOh oh oh oh oh oh oh oh\nOh oh a guy and oh and I got\nA call\n\nNow from him and I and my the one now but I Know my ... my you know oh my little one the most fun on the\nNet ... tiny Seventeen twenty eight my name is bringing a sound like you're my hope he missed him and I am the religious somewhat but me I Am twenty Seventeen twenty team is hoping and my platform is\nCultural and language is that we should\nLet them in the in life doing now like gambling on like the one the biggest one now my son's\nTwenty seven twenty eight team is the first and then I Am a Catholic and lonely you name it they would have been the IMF decrying client and I am from one of the I Am twenty Seventeen twenty eighth team is hoping for the ten minutes\nAnd I find my trial intervention now you're only ... ... ... and all the\nFun you know go gamble a net knock on the\nNet he doesn't Seventeen doesn't Eighteen missiles that can attend I'm Kelly to go yeah I Am fighters and the village you know for me and I am the two dozen Seventeen he got an Eighteen taking the kids and my ... my ms and you know one of them you know I Am I still see 'em\nSit ins and my ... ...\nYeah now but for me to new tillage some happy life how they get\nYeah you know I Will be my ... in the\nSun goes down the line no no no no he doesn't say anything that any thinking I'm trying to go yeah I find it and then as you know for me I Am that he doesn't he doesn't seem to me and my ... five\nMinutes from now mind you know I Am I still am\nI see yeah I Am I I'm kind of like ... ...\nYeah now continue to Lynch John happy like how they get theme is higher than that he can be family\nKnow Ireland ... I hold on a knee playing one and and K. E. L. I. L. P. N. okay that'd be a nine point when and how you know the guy's name\nDreaming on line I came I not Native American public radio station and it's funny\n\nThat\nAre over there for\nA film where are you I'm\nSure there are already go pro bowl where it was total over ... over its\nPros\nWho you who are pro pro murder Gro\nFrom where you are or is there a terror terrorist or hero and go well we're we're going to go\nNo no no no no\n[noise] no he\nHe uh he\n\nUh he\nDidn't know what he\nWhat he\nDoes what he saw\nBut\nHe did a I'm\nA I'm a I'm a I'm\nA I'm a\nLaw\n\nThat she was a young age\nBut when\nHe went to a T shirt [noise]\nWhen they\nSay oh he's a\nVery often but there\nWas a it was all there are a\nLot of the country\nI'm a ... a and I'm a I'm\nA [noise] a\n\nA R o a yo la la\nLa\n\nLa la la la la la la la la la\nLa la la\nLa la la\n\nLa\n\nLa la\nLa la la la la la la\nLa la la la la\nLa la la la\nLa la la\n\nLa la\n\nLa la la la but she\nSays oh\nYou are listening to you I I don't know that eighty eight point one F. M. K. U. A. I. L. P. for ... the eighth or ninth place when Afghan projects at the Hopi foundation seeming online I K you and I thought you needed American public radio station\n[noise]\nBoy that they were that they say\nHey I Know and I have I don't think they kind of I Know and I have to pay a dollar a day\nWhen I hear that they may well that may\nHave the time I I I have the time I don't think they got I have my you know I think they may have to\nGo ahead [noise] [noise]\nHey yeah I Know I Know I have time and you know and not pay I have right now I may or may not know that may or may not have the right [noise]\n\n[noise]\n[noise] how I\nFound out how can you talk to you know like Tom\nSawyer [noise] [noise]\n[noise]\n[noise]\nAbout both ... I'm ... ... ... ... a ... but ... ... um Mm\nOn or off on the ...\nYou are listening decay you why I feel uh eighty one one man\nAnd Katie why I wrote the upper boot up the eighty nine boy one that's been both project of the open ... they've been ... your Native American public radio station\n[noise]\n\n\n[noise]\n\n\nAway from here in Alberta, Canada and you are listening to KU why eighty eight point one F seeming online at K. you why I don't know your Native American public radio station project the Hopi foundational thank you\nSo [noise] I I I [noise] oh\nYeah oh oh oh\nI I\nUm [noise] [noise]\n[noise] hey hey hey hey hey [noise]\nOutlawed oh\nOh\nI I [noise]\nOh oh oh not\nA very tough [noise] hey hey hey hey hey God [noise]\nOh oh oh oh I\nThought was oh hey I saw\nA\nHey I\nGot a law passed a law\nThat I'm a a\nA a law that ah [noise]\nAll all all all wow hey hey [noise] whoa [noise]\n\n[noise] hey hey hey ho\nHo lay lo o\nLay\nOff all alone\nNo no no\nWay hey yeah you're\nOn TALK all day long pose a holding off on the\nCoast [noise]\nThey [noise] they [noise] they [noise]\nUm ... or yellow and white yeah ha ha\nHa ha ha ha ha\nHa ha ha ha ha ha\nHa [noise]\nRage age plus [noise] [noise] [noise]\nOh do they not oh ...\nOh man oh they don't belong in this is a long long time\nI had an X ray almost all laid out in a way\nThat I\nDon't know a whole hour talking a little hey mom law they didn't know much more than\nJust constantly very probably a\nA A R o along on the line then ...\nOh whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\n[noise] [noise]\n\nOh she is she's a city that\nHas a new one on Yahoo ... well no no I'm ...\nI'm not sure I'm not a\nWife or your wife yeah ... well I'm not I'm not\nSo common [noise] oh really yeah I was in on our\nOwn whether what is that\nOh wait whoa whoa whoa whoa whoa whoa hey Austin on old rocky\nTop criminal Washington hey a probably a hundred\nA ... well\nOh yeah yeah you're probably going hey mom long long on more than\nThey are highly highly uh no no\nNo I'm a row on at once and hopefully nothing going on is the\nRole of oh Ron [noise] whoa whoa whoa whoa whoa whoa whoa [noise]\n\nRashid is very cautious [noise] gosh each\nOne of ... I was a really long on on on on\nOn on a comedy uh\nWell I'm not I'm not ... I was in a very long enough long\nEnough to cause a highway on a\nTotal player was a total of three\nOh you know again that's all I'll say you know on the way he's out on the on the top\n... what are you also have a I don't really know on\nThat as a as a yeah yeah yeah yeah you\nKnow all of that yeah you know possible have gotten the holiday and now I'm On\nA day oh ... oh no no no no I'm\nNot a row now on the line and then gone on the\nWhole fall on the line or how low it\nJust [noise] [noise] oh\nWhoa whoa whoa whoa whoa whoa whoa\n[noise]\n\nHey [noise] hush hush hush [noise] um oh oh\nI had no way yeah yeah yeah I Do oh yeah yeah\nYeah\nUm [noise] oh whoa whoa whoa whoa whoa whoa whoa whoa\nWhoa whoa great great days [noise]\nOh oh oh I I\nI'm oh oh\nI I\nI'm not one of those long oh no oh no no no no I'm\nSorry [noise] [noise] [noise]\nOh no I Do have a great\nOh All right a stray dog well not on them all the\nTough times where you know they are probably a\nIn a well he's\nOn a ... problem oh hey mom the other day and you know ... when\nJohn Fountain Monday holidays you know a\n... a ... that long on on Long Island oh no ... yeah yeah [noise]\nOh oh oh [noise] oh boy oh lots\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n[laughter]\nI'm all ... or ... or ... or\nA lay o\n\nDa da da da dum la or\nI'm On a on a ... a a a a a\nA a a a a\nCold War or a bar or\nA bar or I'm a I'm a I'm a I'm On I'm On a oh a a\nA a a a a\nA phone call that a on a talk about a ... down on\nMy mom's a not a not a not for a job on a\nTalk about on up or down our mother\nHa ha ha ha ha ha ha ha ha or a or\nA um a\nA part of a ... or you know I'm On a on a a\nA a a\nA [noise]\nHa ha ha\nHa ha ha ha ha\nHa ha ha ha ha ha\nHa\nHa ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha ha ha\nAnd not the time\n[noise] [noise] no\nNo no no no\nNo no I'm like oh no [noise]\n[noise] [noise] [noise]\n[noise] [noise] no no\nNo\nNo no no no no no no no\nNo\nNo\nNo\nNo\nNo no no no\nNo no no no no no\nNo\nNo no no you\n\nKnow when they and my you know I sound like you lay on the high on my you know oh my little one them open on the\nNet and I hope he tiny teeny tiny my name is Ben Stiller my hope he name is Tony I'm into I Am confident that religious somewhat but me I Am the twenty Seventeen tiny team is hoping my platform is\nCultural and language that we should say\nThat they love in the end my dilemma that make you know like gambling on like the one next biggest online now my God and\nTwenty Seventeen twenty Eighteen misheard the question and then I Am a can't gamble my hope you name it up and see I Am as they are inclined and I found my ... I Am twenty Seventeen twenty eight team is hoping to convince\nMy main title intervention now you only had him in the ... can I can grow the\nBond month yeah no go gamble a net knock on the net doesn't Seventeen doesn't eat miserable I Try to go yeah I Am cited Glen ... villages locally and I am the two dozen Senate teams that an Eighteen taking it and my last five minutes from now mine and you know\nAm I still am I must\nSay I am I okay I Know like ...\n... yeah now the ... dong happy like how they deem as positive ads and a happy heart take good care of yourself and your family know\nIreland needs you came I hold about eighty eight by one and and K. E. L. I. L. me up every month that'd be a nine point lead and I hope the nomination Jamie on line I came I not next\nYear Native American public radio station and it's really\n\n\n[noise]\n\nAnd ...\nYou are listening to you why I wrote a la du da ... one of them and get your y L P upper ... could be eighty nine point one at a project\nOf the Hopi foundation dreaming online at ... dot net your Native American public radio station\n\nI got your Native American public radio station\nYeah na na na na na\nNa na na\nNa na na na na na na\nNa na na na na na na na na\nNa na\nNa na na na na na na na na na na na na na\nNa na na na na na na na hey yo\nYo yo yo and not hey yo yo Yo Ma ha ha ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha\nHa\nHa ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha\n\nHa ha ha ha ha ha they\n\nAlready know\nWho who ... man whoa whoa whoa whoa whoa whoa\n\nWhoa\nWhoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\nWhoa whoa\nWhoa\nWhoa whoa whoa whoa whoa\nWhoa whoa whoa\n\nWhoa whoa whoa ha ha ha ha ha\nHa ha ha ha ha ha ha yeah whoa\n\nWhoa whoa whoa\nWhoa whoa whoa\nWhoa whoa whoa whoa\nHey you're in the long run\nAt all hum my mail and\n... and uh you know\nIn a\nRow none of us\nWho do who was wearing a for a long long as they grow you oh\nNo no\nNo no ...\nOr ... or\n...\nWho who who run or walk ... pogo a yo yo\nKnow ha ha ha ha ha ha ha\nHa yeah whoa\nWhoa whoa whoa whoa\nWhoa whoa whoa whoa this\n\nNo man's land yeah yeah ... area mobile\n\n\nOh geez oh\n\nWhoa whoa\nWhoa whoa whoa whoa\n\nWhoa whoa\n... ... you know\nThe the\nHere here you know ... the\nA ha ha ha ha ha ha\nHa ha ha ha ha ha\nHa ha ha ha ha ha\nHo ho and they both live\nIn ... or ...\nOr\n... or some new\nHuh ha ha ha ha ha\nHa ha Jane Harman who the bull\n\n...\nReally even more you know\nI'm ... the\nOther day he\nHad no\nClue who they\nWho who who was murdered in ... ... ... ... ...\n... ... na na na na na na\nNa huh ha ha ha ha\nWhoa whoa whoa\nWhoa whoa whoa whoa no no no no no no\nNo\nNo no no no no no no no I'm I'm On\nA a oh\nNo no\n\nNo no no\nNo no no no no no\nNo no no [noise]\n\n\n\n\n\nDa da da da da\nDa da\n\nDa\nDa da\nDa da da da da\n\nDa de\n\nLa ... all these wonderful tenants and given chowder indications are okay you're white I really\nLike without your support in contribution to KU why we would not be able to stay on air in bringing all these wonderful programming so why don't you do your part can log on to your computer and go to the Y. I. dot net donate online today at the Y. I. dot net\nWe certainly appreciate all you can you support and remember to keep your dialect\nDot net donate online today at the Y. I. dot net we certainly appreciate all you can you support and remember to keep your dialect eighty eight point on FM I probably\n\nNa na na na na na na na I you know I I I I I I oh I I I don't know the a ha ha ha I\nHow I I I have a very high I\nI I I I\nI um I I I I I I I go on a a guy I uh I ... I I have I have a a A R ha\nHa ha ha ha ha ha ha ha ha ha ha ha ha ha I I I I I I I I I was I I I I Know\nA guy I I I I I I I I I'm\nLike I I I I\nI I don't I I I I I oh\nI Know I mean I I I don't know uh I I I I don't I don't I have a yeah I\n\nDo a little\nUh\nWhoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa\nWhoa whoa whoa\nWhoa\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\n\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\n\n\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\n\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\nWhoa whoa\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\n\nWhoa whoa whoa whoa whoa whoa whoa\nWhoa\n\nWhoa whoa whoa\nWhoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa whoa\nWhoa whoa whoa\nWhoa\nWhoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa\nWhoa whoa\nWhoa\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa\nWhoa whoa\nWhoa\nWhoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa\n\n\nWho raised you\nKnow no way a way a a\n\n\n\n\nA a\n\nRed ... war although I live in\nA way a a a a\nNew way a way a there was a way a\n[noise] [noise]\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\nOh the ah [noise]\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\nYeah\n[noise] ha\nHa ha ha ha ha ha\nBut he he he he\nTook a week\n\nBut a\n\nA A R T\nO da\nDa da da da da da\n\nDa\n\n\nDa da\n\nDa\nDa da da da\n\n\nDa da da da da\nA a a a ... a a a\nA N E S I saw a ... a year or so or China saw a she\n\nHas a ... a lot of the shah cha cha ching\nA\nChing a on a show out of a la la la la la la la la la\nLa la la la la la la la\nLa la\n\nLa la la la la la la la ya meaning ha ha ha ha ha ha ha ha\nHa ha ha ha ha\nAnd I'm telling ya until I saw on a on\nA on a on a long time I saw a a\nA R T o or a cell phone I tend to sell some uh some show up for a child or a\nA a a a\nA a a a a saw a saw saw a\nPoll I saw a show a long chain chain chain chain chain chain\nSaw a law a ha ha ha ha ha ha ha ha\nHa ha ha ha ha ha\n\nHa ha or in\nA way I saw a thing or a loved one a long line of you know a a a high\nOn the show out\nOf ten months a cell phone or ... or ... or ... or\n... or a ha ha ha ha ha ha ha\nHa ha ha ha or a T cell\n... ... ... ... or so or ... or ...\n... ... ...\n... ... S C I F you need a ... a big you know a whole ...\n... ... you\nKnow uh uh the ... the uh the uh the snow ... or ...\nYou know a a um a a a oh no no a\nYo yo\nYo yo Yo Ma and or\n... or ...\nOr I'm a ... a man or a girl or a\nYo yo\nYo and or\n\nA ah I'm a ... a man a well I Know a man hey\nYo yo\nYo\nYo Ma or is it a a a a a\n\nMorning seven zero one energy you a radio station your tune into the thought that I regret later January ... hook the lady who want to have been in office okay why it'll be up are among the\nProject is up to hope you can own dishes and then a lot of K. U. L. U. I'd done it you don't need the American public radio station the following from what the partnership between the way I Hope it review it ... the public radio station\nGood morning I'm with you if you are\n\n[noise] how has the cabinet fight change the less than it makes them ... and I'm Steve Inskeep not to senators liked each other before but considering what it's like going to work now Britain's conservative party tries yet again to agree on a breakfast of land that has a chance to work in Chicago a police officer ride\nAs he defended the shooting of a Seventeen year old and is trying to extend to influence in Africa it plans to build an entire news in Morocco Wednesday October third the Reverend Al Sharpton there's been an activist for nearly half a century now and then he was just next\nLine from NPR News in Washington on core of the Coleman President Trump used his Twitter feed this morning to push back against a skating New York times story NPR's Scott Horsley says the times reports Trump and his family used dubious schemes to evade taxes on hundreds of millions of dollars in inherited wealth or times fourteen\nThousand words story was a product of more than a year of investigation it shows that despite his claims to be a self made billionaire President Trump was the beneficiary of a vast\nInherited fortunate much of which was shielded from taxes through a variety of questionable schemes New York taxing authorities say they're reviewing the articles fine thanks and his tweets the president does not dispute any of the facts and the article but describes it as quote a very old boring an\nAwesome told at peace Trump complained to the vast majority of the newspapers coverage of his administration has been negative echoing a charge leveled by the White House press secretary Scott Horsley NPR News Washington\nPeople who get health insurance through their work or seeing their share of the cost of coverage increase that's according to a new study NPR's Alison Kodjak reports the average price for a family plan is close to twenty thousand dollars a year\nThey report from the Kaiser Family foundation shows that the price of employer provided health insurance or as an average five percent this year\nEmployees' contribution to those premiums slightly in twenty Eighteen but over the last five years employee Sharon has risen by about a thousand\nDollars and half of that more workers have to cover pick up the ...\nPeople work for small companies usually pay more for that coverage than those who work for bigger firms about a third of those who work for small business cover more than half their insurance premiums premiums also increase faster than inflation and workers earnings\nSo altogether that means that health insurance costs are taking up an ever larger share of people take home pay Allison kind of jak NPR ... the federal emergency management agency and going to test the presidential alert system at two Eighteen pm eastern time today\nNPR's Brian Naylor has more\nFEMA and the FCC are conducting the test they estimate some two hundred twenty five million devices will be receiving an alert or along with an audible tones there'll be a text message standing presidential alert seem officials say the system as only to be used in time of the national crisis if the country's under attack\nOr an imminent natural disasters and it can't be used by the president for other purposes\nNPR's Brian Naylor disaster officials in Indonesia have increased the death toll to more than fourteen hundred people in last week's powerful earthquake and tsunami rescuers are still at work on some of the ways the island trying to free any survivors\nOn Wall street the Dow was that one hundred twenty six points that twenty six thousand nine hundred and aspects that thirty seven and eight thousand thirty six\nYou're listening to NPR News from Washington\nSupport for NPR comes from I drive maker of remote PC providing real time access to PCs max and servers from anywhere for use when telecommuting or for remote managements learn more at remote PC dot com\n\nPrimary care physicians and pediatricians are available and accepting new patients a list of services in locations is online\nAt North Country healthcare doubt Oregon North Country healthcare creating healthier community\nGood morning at seven oh four I'm Erin ... along with Arizona Public radio news from Flagstaff flash flood watches and warnings remain in effect today after some parts of Arizona received record rainfall rented moisture from hurricane row so flooded some streets and trapped\nCars in the Phoenix area the rainfall overflowed washes and streams across central the northern\nArizona since ... is with the national weather service in Belmont he says some parts of Yahoo by county got between four and six inches of rain\nIn Flagstaff area itself airport a to point three inches yesterday which actually broke the daily record\nStephan says the region remains at risk today storms linger a flash flood warnings runs in so eight forty five this morning for the corner villain page springs areas\nThat's where ... creek overflowed yesterday and flooded some yards and hiking trails meantime flash flood watch affects parts of the pie gala in Navajo counties through this afternoon\nThe rainfall also hit the Coconino national forest hard\nOfficials yesterday close to camp ground some forests roads in hiking trails\nOn the red rock ranger disrupts they'll remain off limits until conditions improved Arizona Senator Jeff flake says President Trump's remarks last night's at a rally a word in his words kind of appalling\nThat President mocked Christine Blasey Ford the woman who alleges Supreme Court nominee Brett Kavanaugh sexually assaulted her when they were in high school the audience laughed\nAs President Trump listed what he described as holes in her testimony\nSenator Flake tells\nIn high school the audience laughed as President Trump listed what he described as holes in her testimony Senator Flake pills NBC's Today show there was no time or place for such comments\nOr something of a political rally [noise] right right I Wish we had to\nFlee says he is waiting for the FBI to finish it finishes investigation into Ford's allegations before he decides on whether to confirm Kavanaugh to the Supreme Court's Kevin denies the accusation ... can you do you ever zone a public radio\nI'm Shelley ... general manager of cayenne aid you thank you for once again making pledge drive like a success thanks to you we hit our one hundred eighty thousand dollar go and we did it without interrupting the programs you love thank you for supporting Arizona Public radio\nIs seven seven MORNING EDITION continues on to you know you are is going to public radio funding for a new comes from Sedona arts festival one hundred twenty five artists from across the nation showcasing their work rounded by mother\nNature's aren't after twenty eight annual festival public viewing nine to five Saturday October Thirteen and divorce under the fourteen Sedona\nArt festival dot com\nIt's MORNING EDITION from NPR News I'm Steve Inskeep\nAnd I'm Rachel Martin good morning President Trump has jumped back into the fight over his Supreme Court nominee at a rally last night in Mississippi he outright mocked the testimony of Christine Blasey Ford who's accused nominee Brett Kavanaugh of sexual assault\nRight\nTalk for me the only language down below and she wants a nano felony I paint they must be the thing that you might play not men and\nWomen or men or young adults or liver so members suddenly you're committed to Canada and Australia to explore you then by military put K. U. A. dot net and I love about truth you business days will you meant to be killing their or better yet what you can do it\nIs\nCalled me and what you're sixty dollar figure because for me she has a food rather than a thirty second announcements so email your information they employ the way I'd done it to get on the air and the mobile computer lab recorded scheduled today will be at the look to use\nAnd senior center\n\nAt sea from one PM to four pm man you can call them and immature costs of the rain is no woman [laughter] I read in the mud and would not do might change the schedule but you can call them at night to a three month three six explore for and what I'm thinking about the snow already\nFanny hope people will be oh it's still down whoever it is still open for library services that they hope and tribes and Stacey complex rotation for pm Monday through Thursday or give us a call at night to a to zero five eight zero seven three or more reformation\n\nTable village you'll have food bug just a little above for those who have not received one information available to us I must be seven due to live for and don't forget is going on right now a member of the table board\nYou should be held today this morning starting at seven o'clock till\nSeven P. M. tonight and for more information you can cause severe the seven to two by four days just able to election for the board of directors rich said there will be hosting the women to gain experience working with tools\nAnd fix my new home repairs classes will be October to serve them for a number of our as VP yet for general why wouldn't wouldn't mind\n\nA surge in your spiritual physical and emotional and mental health gathering of people who see buddy OPB need really health services are stupid for just a moral eight o'clock in the morning at the moon ...\nNumber to call for you for me sometimes three seven six three zero zero\nAnd hope to be real services will be who's in\nOur Russian that\nHope people behavioral health services will\nBe close enough to ... for his morals there'll be close to moral and ethical business owners will resume on October fifth all group sessions search can solve number to call for you for mission is Seventy three Seventy six three zero zero\n\nTeach corner will be clues on October for fear of Davy information available as a victory for three four three two souls you write that W killings it's too early next day keeps going to be closed all day\nThe three for three four three two so yeah you're right that W killings is tomorrow and next day keeps going to be closed all the hope your travel close ... close to OK Pete tribal courts\nWill be closed October fifth at eight eight to five PM and normal business ours will resume on October ... at eight o'clock in the morning one more time again what we traveled courts will be closed October fifth\nFrom eight to five PM and normal business ... leftover aimed\nAt eight am\nHope your reservation town hall meeting presented by the office of secretary of state October fifth started to get ten thirty two o'clock in the mornings mountain standard time at the ... Veterans Memorial center information is available at Seventy three four to five zeros and enter\nThe four to five zero a\n[noise]\n[noise]\n\n[noise]\n\n\nOkay all two thousand eighty scholarships are billable for hope and college students\nThat they have also has already have\nAnd they're lining up by some Tobar fifth you got two more days and the number to call for a permission is one eight zero zero southern six to nine six zero\nBreast cancer awareness of cobra fest at del ... chip to how nine o'clock in the morning do that savings time for information you can call\nTo a night\nFor six lower sex\nEd Hopi high school volleyball October the\nUse of city bite at universal city high school who oh no time given song or just plain thereby you're okay Hopi high school football October fifth versus Belgian senators I Hope be Pete night two key\nAnd\nNumber to call for you or information will be Seventy three eight by one on one varsity game will be starting at seven pm that's going to be up to ... I\nHope you Pete night to remember some pink or just be cold and the ... ... ... ... the high school cross country up to six\nDays there were ... invitation in Phoenix and mom do you park starting at eight thirty am I to do or danger do or in like Phoenix along Cade be going on the tube and say\nOh pi haiku chest\nDo you want to be a review one tournament Eli Williams high school's starting at one PM October fifth in six\nOkay so I don't know where the Williams school years not here no location hope in junior high school sports those caves hoping junior high\nOkay junior high eve foot ball to verse third versus ... high school\nActually gave you will be playing at three PM and varsity at four thirty PM\nI Believe it was a change on the times uh Czech leader hoping junior high school volleyball\nOctober for versus totally I Hope you hire a school junior high school Jamie will be planted four pm varsity five PM any hope of junior high school cross country you have to put six but they'd be sitting by it too but city\nHurting is seven AM method to bus city high school\nWere more information on all of these sports you've as you can call the Hopi junior senior high school at night to eight Seventy eight by one one one I did you all very all along the trail run up to ...\nAt the Hopi Veterans Memorial ceremony and information available and certainly for three four three two\nClinics in in high school class of Nineteen sixty six reunion\nOctober six as the old park in Phoenix information at six one three wasn't once fives zero days my art even will be held Abou ... you know knocked over six and seven and information that and to fly five to one one to\nWho not only a senior store appreciation day not tumors seven\nHas been kids saw and\nLooking forward to going on there but I guess it's closed for two or Seventy one and he seems to appreciation day has been cancelled information available as six zero to six or seven nine five six one seven\nNo Cosby into ... and keep skin and up to breakthroughs attend number to call for information Seventy five to five one\nUniversity violence orders host and encouraging who ... her at\nAll I used to elderly center October nice at four pm information is available at two to five six eight seven three\nThe movie ... and up to like it will come your boat cookie claiming going good cultural center area currently sitting at sixty degrees away by by he but say you and you can play\nThat way I'm a professional that can can you know my little key and we have about thirty percent chance of showers and thunder storms can you tell them after living am you'll be part of the sudden it was a high nearest Seventy five star when civil by and then most of our airport tonight put me on ... they can play them\nUp and we have about forty percent chance of showers at ... pm there'll be part of the crowd with a little round them forty six south wins about ten to ... miles per hour winds ... in his eyes up to Tony Miles per hour today all K take to an area and you know be a little breezy not too bad\nOkay then we go on they don't ... up the to beep us August the curly bill the every ah nothing to Indian springs downing ... who co springs red lake and called my main Saturday a tone and that is he as secret his city at\n\nFifty two degrees have little chillier that we and today among copy I buy I have about a thirty percent chance of showers and thunderstorms after eleven AM there'll be party started with a ... near a Seventy six light and there will always be coming south to south west five to eight miles per hour in the afternoon\nAirport tonight yeah buddy fifty percent chance of showers and thunder storm and there'll be most of the town will lure on a forty nine degrees so when she was six and nine miles per hour so\nLooking good among ... to a and let's see for\n\nWindow or I guess it might cause a ... so do they do get NATO woke up other pose a look I Need to go into ... and let's see coal mining is a case where we are\nA St Louis burns side Greece would currently sitting at fifty seven degrees here is if\nYou're in the ... the here and got me on throwing a car and today you have a forty percent of their shoulders and Judy is on the season just arms\nYou'll be part of the sun was on Europe certainly to sell to sell ... about seven to them also her that today you have like thirty percent chance of showers and thunderstorms after seven PM there'll be part of the crowd was lure on forty eight\n\nSo we seven to eleven most of our sorry I'm On the air right now I can answer the phone call back later\nAnd you're done going down toward the southern part of here we're going to win so Arizona along a little bit by you or me home with them and look up and do we fish and no they don't seem to\nKeep all dried fiction the gardens currently city as sixty three degrees and Winslow and today a fifty percent chance of showers and thunderstorms\nAnd there'll be part of the Senate with a high and you're a Seventy five degrees to sell was when it's about five to ten most of our it's not you have about ... percent chance of showers and thunderstorms part of the cloud with a lower owner of the five south to solve these winds about seven eleven most of our\nSo looking good it was ... and also\nWe bought into pumping gas flex ... funny Dorney Park area will put the done in the one that can grow in the city at fifty four degrees in Flagstaff, Arizona in ... and let's see you have provided\nA chain ... tons of some tonight they shoulders\n\nLike him possibly a thunderstorm after eleven ... an army and most of the crowd was a high near up\nThese ... these seven\nSouth this hour west winds about five to ten miles per hour in butter sixty percent chance of showers man here to get a lot of rain that area and there's some ... warning so in that area so\nBe careful you can be out or ...\nOkay tonight flex stab you have a fifty percent chance to show urgent under storms there'll be most of the title of lower on a forty five degrees which means about seven to eleven miles lower throw this out let's say in\nThe northern part Arizona it's going to be a great day care and want to give it away all day long so earlier this month made each other there's nothing about words and I'll just be playing some music for utility it'll cost again so you've already be careful member of defensive driving in the Gulf War the other driver\n\n[noise]\nUh yeah I Am an egg now yeah man I Am\nSaying man man\nOh man\nYeah yeah and there have been a a\nA man am a\nRe a man and now they are I Am a man yeah way I Am\nMan a man\nEh no no way I\nLay man oh man\nOh man yeah when uh hey hey you know and uh hey yo\nThey know they may do they uh yeah I Am I Am now oh man I Am\nToday well today\nMan oh man yeah I Know it now yeah but you know hey\nHey yo man\nMan a man man\nWhy am I Am man oh man yeah na na na hey you\nKnow they know they may\nGo in and I am a a man man a\nMan oh man\nYeah na na na hey\nYou know hey you know they they are\nOh man I I\nI Know\nA man I Will\nMan man oh man\nOh man\nYeah man a man you know they know\nHey hey you know I Am no way he'll say an\nOh man I say no no they uh yeah I Am\nHey man\nOh man oh man yeah na na na na na hey\nHey hey hey oh man I Am hey you know oh man I Am\nMan man oh\nMan oh man yeah oh in a head now yeah na hey oh man\nOh hey\nMan oh man oh man oh man oh man\nOh man yeah na na na na na hey yo\nHey okay\nMan oh man oh man oh man oh man oh man yeah na na na na hey\nHey hey tell head they L\n\nClassroom on my own my own my own my own I'm On I'm On my own you know a\nLot on my on my on\nMy on my own or work on my own I'm On my own uh uh\nUh uh I'm I'm a oh a lot of phone I'm On my own a on a on a\nOn a on a [noise]\n\n[noise]\n\n[noise]\n\n[noise]\nAnd the clock here are you a radio station on duty ... you'll be ... be on the ... project so the hope you do dishes may be on my key why doesn't it your name American ... Rudy ... fish in\nThe fall of ... years provided we've partnership between the way I Hope you ... you and key in a U ... on a public radio news and they'll be switching over to be a good morning\n\nOrgans of dollars in various ways to avoid some taxes had according to Forbes the president has tried and failed to profit from his presidents and I'm Steve Inskeep\nAnd I'm Rachel Martin the death toll continues to rise earthquake and tsunami in Indonesia summer now after all sat in front of the warning fail and the decades old back story\nOf America in conflict with North Korea it is Wednesday October third the birthday of pop star to lend money that girls only nine years and the newscasters coming up next\nLine from NPR News in Washington I'm core of a Coleman President Trump is being criticized for mocking the woman who was alleged Supreme Court nominee Brett Kavanaugh sexually assaulted her when they were in high school\nMaine Republican Senator Susan Collins who was not decided whether to support Kavanaugh's nomination said Trump was quote just plain wrong when he made fun of Christine Blasey Ford at a political rally in Mississippi last night the crowd laughed and clapped\nNPR's Kelsey Snell says gee European leaders are seeking common support Republican leaders are still trying\nTo convince undecided Republicans and even some Democrats to vote for Kavanaugh and this kind of conversation is kind of the exact opposite of what they're trying to deal the president has made clear that he takes his personally that he and he had a personal connection with allegations than he says what he believes to be false allegations of\nSexual misconduct and that is playing a role in the way that he's responding to all\nOf this NPR's Kelsey Snell\nIn Indonesia time is running out for earthquake and tsunami victims still buried under rebel Indonesian disaster officials have increased the death toll to more than fourteen hundred people Michael Sullivan reports on the rescue efforts a spokesman\nFor the national disaster mitigation agency said in Jakarta than rescue workers have reached all four of the worst affected areas but he declined to give an estimate on casualties three of the areas have been largely cut off since Friday by roads damaged by the earthquake landslides in down bridges officials say heavy equipment to clear the\nRubble are still in short supply and increasingly desperate survivors are still waiting for food and water and medical supplies many still sleeping outside five days after the quake\nMost of the dead reported so far were found in the city of Paolo where nearly a dozen military flights carrying relief supplies landed Wednesday morning for NPR News I'm Michael Sullivan in the non Vietnam\nTests done by the state of North Carolina show no environmental hazards in the Neuse River is after Hurricane Florence breached coal ash ponds operated by Duke Energy Jason to Berlin of member station WBUR UNC says that contradicts claims made by an environmental group the department\nOf environmental quality says their test on the Neuse River showed no\nElevated levels of dangerous medals in the water while those results came as a relief to Duke Energy they are in direct conflict with tests taken by the water keeper alliance the environmental advocacy group says the tests were done too late by the time regulators took samples ash\nHad been diluted but the issue secretary Michael Reagan is pushing back\nHe says the state tests Smith the highest standards tests on the Cape Fear River are still pending for NPR News I'm Jason to Berlin in Raleigh\nOn Wall street the Dow Jones industrial is our up one hundred thirty six points or twenty six thousand nine hundred ten an as that is up more than fourteen [noise] this is NPR\nSupport for NPR comes from indeed used by over three million businesses for hiring more employers can post jobs and use greener questions to build their short list I preferred candidates learn more and indeed dot com slash higher and the corporation for public broadcasting\nFunding for gay in a new comes from the Flagstaff Unified School district F USD offers art music and P. E. programs at all levels as well as the advanced placement honors and dual credit program F. U. S. D. enrollment information at five to seven six thousand\nMid morning and said oh four I'm Aaron ... within his own a public radio news from Flagstaff record amounts of rainfall in Arizona yesterday as remnants from hurricane Rosa flooded streets and overflowed creeks in Russia in Flagstaff the airports at a new daily record with two points three inches of rain\nSeems seven is with the national weather service and Belmont says parts of yellow pike county received between four and six inches swordfish\nShowers and storms three develop later this morning into this afternoon and with how much rain fulfill yesterday it's not gonna take much to reactivate the flash flooding that we've seen over the past twenty four hours seven\nSays a flash flood warning has been extended\nUntil eight forty five this morning for the page springs and corn veil areas there have been reports of flooded front yards and hiking trails the long ... creek\nMeanwhile the flash flood watches in effect for parts of the pie Hua and Navajo counties through this afternoon on the Coconino national forest rainfall for some temporary closure as on the red rock ranger districts\nThey include to camp grounds in Oak Creek canyon along with west fork some forest roads another day use areas officials say they will remain closed until conditions improve of Flagstaff astronomer has turned up a rare object to the edge of the solar system\nAnd they use Melissa's Seventy reports it strengthens the case for an undiscovered massive plant stature\nHeel of northern Arizona university says the new object is one of only three known to exist in a distant region of space called the inner or St Cloud the object is two and a half times further from the sun than Pluto its orbit fits the computer models that point to an unknown planet\nThat's what's interesting to me and it was not proof but as we find more objects that they all fit this picture that is suggestive that there's you know a planet or something out there that we don't understand\nAnd a colleague first proposed a hypothetical planet\nThis suggests that there's you know a planet or something out there that we don't understand\nTrujillo and a colleague first proposed a hypothetical planet four years ago they're searching for with telescopes in Hawaii chilly in Arizona\nThe inner or caught object turned up and there are deep sky survey Trujillo says it's unknown how these objects formed so that discovery could help improve models of the early solar system for candy you Melissa said any in Flagstaff\nHideous eight oh seven MORNING EDITION continues on Arizona Public radio ... in a new online again you've done [noise] funding for a new comes from founder\nRoy before you came back to basics outdoor adventure celebrating eight years providing long term pre drug and alcohol addiction back to basics office counseling and weekly outdoor adventures plus job placement an academic back the normal to basic outdoor adventures\nDot com\nIt's MORNING EDITION from NPR News I'm Steve Inskeep\nAnd I'm Rachel Martin good morning Donald Trump once predicted that he could be the first presidential candidate to run and make money on it well he ran anyone\nBut he doesn't seem to be making money that's at Forbes magazine has found in an extensive piece of reporting on President Trump's finances this comes just as the New York times reports that much of the Trump for ten or as a result of elaborate scheme to avoid taxes\nAre you in the wind is really not an easy way out of telephone numbers night to eight three by five zero five in effect summer's night to eight summit three five five to fly\nKU why ice seeks more hope we'd love by speaking music\nIt\nLet me start all over here I got distracted here ... choosing committed you buy more members RCA be response was stationed\nIn education community about the importance of K. U. I Hope the radio\nAnd it was so busy K. U. I died and then our emailers Eddie Floyd way I'd done it for more details and again our telephone number nine to it's like three eighty five ... five wave license or thrown out get below ... appeal nice like they need to me I'm a\nTime when we have now I have my eyes and if my I call or send\nHim up by ... ... a FBI protesting okay river suddenly he committed you're killing now certainly since the event of a military for a key way like on it and I love about unity business this way you're going to be able to do the killing their\nOr even better than what you can do is want are moved by getting your message ourselves right away or sixty dollars we can record for mission is April ... rather than it is a kind of nonsense so ...\n... email your information ... I've done it together they are here and let's see where the mobile computer that's going to be today today's Wednesday so according to send schedule it'll be hurtful I use a senior center one to four pm\nInformation is available at night to a ...\nFor for the whole pie Boop no bill ... is bad old game is\n... services at the hope of travel administration complex and ten o'clock in the mornings before pm Monday through Thursday so ... you want more information you can call Dinah nine to ... to zero five eight zero seven in the morning dying\nAnd\nTaylor village you has who Dustin syllable or those who have not received one yet and information is available at seven three seven due to fly or\nHey we'll get to your ... bucks you can also vote he will actually be holding their elections today or Taylor community members\nSeveral times this morning to seven pm\nTonight number to call it Seventy seven to two by four so you do we get the food is committed to building to\nThe table and vote for the table for number ... says or will be hosting a women to gain experience working with tools and fixing minor home repairs just want to be going on up to ... have you with us today nice over there and for\nIt's for women who want to learn how to use the tools to lose our and fix minors stuff we play on my ... not always the way\nUp us ... do you feel ice at UCLA might to many people we we number to call for four zero five Woodward Nineteen\nEight thirty and your spiritual physical emotional and mental health gathering who will stick\nFour zero five would one night and\nA third annual spiritual physical emotional and mental health gathering hosted by the hope you've behavioral health services will be health October for\nTomorrow at eight o'clock in the morning at the legacy number to call ... ... vote for and hope to be able to health services will be close\nTo murder all carnival only ten days Congo and reading the business owners will resume on the fifth up to two over in all groups issues are consult information available at seven three seven six zero zero\n... because of cobra fourth and fifth all day so called southern thing for the for three to four more information\nAnd the whole big tribal courts will also be closed on October fifth from eight to five PM and normal business owners will resume on October\nEighth at eight o'clock in the morning\n... reservation town hall meeting presented by the office of Arizona secretary of state October fifth\nAnd thirty in the morning moments dinner time that the hope is in his moral Center for information you can call seven three four to five zero seven or seven three set up a correction seven three four to five\nOh eight oh Kay\nFall two thousand Eighteen scholarships available for hope the college students that\nHave H. E. S. did lead applies Tobar fifth\nAnd information is available at one eight zero zero seven six to nine and six zero and breast cancer awareness conference of Tobar fit at the el ... chip to how ... do the same as time information available to eight nine four six four six\n\nHopi high school sport events ... high school volleyball October ...\nAt ... city invite any use of city high school to a\nTime to be\nAn ounce I guess so we're seeing with Dennis companies starting or you can call the high school and I'll give you the number burn a very short bit here and hope the high school football October fifth\nVersus values Sanders at hope be enemies Peyton I ate all our rights away you know who I Am taking to the game then ha Rey so varsity displays is seven PM so God damn well you pink side so you\nPaint quite every paint shirt paint Pence and they seem paint okay\nAnd you're faced with a ... because his ... over there okay hope the high school cross country up to six days door\nIn ... in Phoenix Mountain view park starting at eight thirty in the morning so you're going to go down south\nThere'll be going on the conversation that David ... in like a ... Neal E. R. R. E. R. okay in Phoenix Mountain view part starting eight in the morning hoping I screwed chess\nOctober fifth insects origin one tournament\nAt the ... high school's starting get one P. M.\nDo know where the Williams high school shooting\nI used to have a good friend named ... Williams by ... by ... okay so that's going on a tube or fifth and sixth no location giving you might cause as soon as they find out to see what is going to be at okay and then we're going to be\nThe few in your eyes\nTo okay there's been some changes share so open junior high school game between ... ph in the ass being pushed back to a total brew for and let's\nSee the game will will be played each indie ... visit to PM and large city at the thirty so there was supposed to be happening on the third buddy mostly to October for solar write that down\n... beginning you're a high school football Cooper for versus shooting the junior year of high achieving the border city gave me please it two PM and parts of the police at three thirty ... keep up the food\nChain 'cause okay that they're hoping junior high school volleyball October for versus ... at a Hopi junior high school gym he had four pm and Farsi they'd five PM till the junior high\nAnd hoping junior high school cross country October six by Davis and by that city high school starting at seven AM\nSo that's going to be happening on the silver six to both city or more information on all hope the high school and hoping junior high school for the DVDs you may call Senate three eight by one one one\nAnd then we'll see what else I can play in the airport in this or are coming up right now or KFC\nTwelve and your ... children of cobra six at\nThe hope to veterans for moral center information available is it safe for three four three two\nEggs relaxing in high school class on Nineteen sixty six the union will be held at silver six is the old park in Phoenix information available is six when are you one one five zero okay that's good to be going on at steel targets rights were\n\n\n\n\n[noise]\n\n\nDie might be a hundred by be much on Hillary kimaz playoff the eight forty I'll be ... I had was er here boy you have any people who died on to fight\nBy putting that William apply not he will meet with the heights and I'll leave ideally a day I be something ... the the ... early ... let's see what it's gonna be like today out\nIn the\nReservation ... beer reservation okay right now for keeps getting ... skin no need to get into the area they can you end up hockey spider mound baby talk like comes the bulls\nLogo\nMowing Bullock Cowell PC to move it they will I'm which I'm there'll be she'll buy love the let's see currently sitting at sixty degrees by eating when we will be used to have ...\nNice to meet in a place she can do miss the OJ today we have a forty percent chance of showers it's I just don't have to deliver am you'll be parties son who was a ... near as somebody finds out ...\nMiles per hour low key and for tonight ... we have a ... percent Kitchener sellers and thunder storms just eleven PM it'll be part of the crowd was a little Rona forty seven south wings around ...\nMiles per hour ain't going to be a bad day at all or you are going to make it a great great one and\nSee what else are just happy to okay we'd gone on to your question will be ... and ... like me who can get both ... and ... every ah currently sitting as the poor degrees also great Modi\nPumpkins ... area\nAnd today you have like thirty percent chance of showers and thunder storm assisted living am there'll be part of your son was ... Seventy five an hour winds about five to nine months Robert\nAnd fortunate you're looking at a forty percent ginger showers and thunder storms Esther live in the end and you know be part of the ... was a little Ron I'm forty six south wins about ten to ...\nWe we used to decide something about\nTwenty miles per hour there we\nGo all the way we do monk\nScope be to the last August yeah\nUp in ... curly bill the area and hidden Springs Colorado springs John Doe ray lane gang cool my missionary at\nTwo non disease you're sitting at the people who are degrees or a lead a bit cooler than us down their MO ...\nToday you have a thirty percent chance of showers and thunderstorms after living in the end they'll be partly cloudy on power these sunny we used to hide near a Seventy six ...\nBecoming south just out west to the Muslim or an afternoon effort you're not you're looking at a\nFifty percent chance of showers and thunderstorms helping mostly cloudy with a lower on the forty nine degrees south wings about six to nine ... be too bad and then we go all the way back east to window rye say Michael Steele is so not all\nOf the ... the guy detailed down into Greece will burn side and cheer leading\nSitting at six fifty degrees the or looking good out there and do they have a bunch of forty percent change their shoulders and thunderstorms\nIt'll be party son who was a ... too so it's going to be going up here so to solve was wins the buzz seven to nine miles per hour\nFor tonight you're looking at it thirty percent changes showers and thunder storms up to eleven PM you'll be partly cloudy with a lower own I'm forty eight so when so much and then to eleven ...\nHour that's too bad I think that NATO today in tonight you\nKnow we go down on south passed down goods border then Trey posing committed some guy Winslow, Arizona wow who hit pay by you mean ... they should not only downing keep would drive the touching the garden aid and all those\nIn Winslow [laughter] curly city is six\nFour degrees ... nails came and today you have a fifty percent chance of showers and thunderstorms you know the party's than it was ...\nTo salt was winds about five to ten most through our\nToday you have a twenty percent chance of showers and thunderstorms you'll be hardly caught it was a little run a fifty by south to solve\nGood to know you have a twenty percent just your shoulders and thunderstorms you'll be part of the cloud was of the world of fifty five south to solve which was about seven to ...\nMiles per hour it would have to keep up much seven to eleven we ... we go on to\nA company in ...\nYeah\nThat's ... that's got to the ... let's see what you have your ... the current is pretty good for the ... degrees C\n... been good nobody will make you look at the park every year but he is in ... canyon you're curious to see\nWhere what you just show works at the storage and flex their shoulders leg lamp posts love this I'm just living in ... ... email okay and there'll be most of the club was a new\nTreaty\nOr there'll be most of the Carter was a high we're up six to seven south to solve was wins about five to ... you have a motor sixty percent sure that the storm represent the shooting ... I'm\nA draw your if your the fifty percent chance of Georgia under storms you'll be most of the crowd with a low road I'm forty five degrees ... seven to ... miles per hour or so\nWho should be in the door to ... ... patients every and the surrounding towns\nCurie ... by being on the screen by by what news that's you ... ...\n... ... ... I mean could paint that might be mutually forty somebody or kill you\nWhy a radio station would agree to a ...\nMan it's looking good old tried all these water bottles look so good and the dogs are drinking a ...\n... vehicles are flying back and forth here right outside ... radio station so be careful of the garage movie took your time and enjoy the weather like when I Would say\nYours a wizard or who you are the key forty easier\nTo you while you're reading it was you know the ... with the way I Know you guys are working are by ... by ... ... people I knew when he complained he said but it's an almost what about you\nAnd I don't know if there's any kind of events going on but immunities man you draw your key or just be pushed more music for you to nine o'clock and have nine o'clock I pick off I'm a professor of waiting for more\nThan we are spending bill maybe we know what to do long one you know when we were ... when the ...\n\nOr a\n\nNa na na na na na na John F.\nO. o holy day uh he uh he ... a a a A R your\nOr ...\n... ... S C I F R I and I know who they are\nI think a yo yo ... S C I Am I a Yahoo\nYahoo I often ... Ohio Ohio who\nYou know ...\nAnd and uh I ... and\nYou don't know how they they are being a yo yo ... s a higher paying a\nYo yo Ohio Ohio Ohio Ohio more he\n... he ... a\n...\n... s a was a young lady and the\nF\n... eh\nYoung a ... a million dollars a phone ... Don\n... mood na na na na na\nYo da da da da da da da da da da da da da da\nDa da da da da da na na na huh I have a\nYoung man who they are highly uh Joe ... who ... uh I uh\nYou know who ... Ohio Ohio Ohio\nAnd I you know ... ... S C I F they how young\nWho they are dying a yo yo ma heh ha ha ha ha a yo\nYo Ohio Ohio Ohio Ohio Ohio\nEd you know and eh I uh\n[noise]\nHell uh uh uh\nUh\nUh\nHere in the ... of a ... a ... or ... or ... or ... or ... they are ...\nWhat a\n\n... you know I ...\nIn the may ... a ... way me ... ... ... ...\n... what a what\n\nA you know\nI mean he\n... the ... ... ... ... ...\n... they say oh my God what do I\nHave a pet a movie or a or a or a he or she may well that's good enough\nBut here ... ... ...\n...\n... you know I\nGot that to\nMe how he ... hey hey hey hey\nHey ho how or what\nHave I have a a a ... a ... a man in a ...\nBut uh well I ...\nI I\nI ... I Know\nI don't I ... I Know I have a\n\nNine zero by your ... your radio station on the ... face Jay ... money when\nThe time each wind and ... by like all the beagles here in the winter season ... drive carefully B. C. and\nI just wanted to let you know within each nine o'clock here in maybe a couple more functional then I'll be going on my way you're so here we go with some more songs do money\n\n[noise] [laughter]\nEach wind and lying in plain by like all the the goal here in the winter season agree born in ...\nDrive carefully be said in\nA what do they know who they each nine o'clock here in maybe a couple more songs are they not be going on my way so here we go somewhere on good morning\n\n[noise]\nNa na\nNa na na na na na na na na na na na huh\nHa ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha [noise]\n\nHa ha ha ha ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha\nHa\nHa ha ha ha ha ha ha\nHa ha ha ha ha\nHa ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha [noise]\n\nNa na na na\nNa na na na na na na na na na na na\nNa na na na\nNa na huh\nDa da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da da\nDa da da da da da da\nDa da da da da da da da da da da da da da da da da da\n\nDe ... by ... by ... ... ... ... ... ... ...\nI feel like the ... by he said that that they didn't have a ... month I feel like now they need I Am in the ... ... ... am I get you need ... ... ... ... ... they generally tend to play\n... in the ... the ... the ... ... ... nothing much I Love new money like that but you need a\nI'm ... by he tell you that that title ended up ... to a dollar a unique I Am an ... ... ... ... ... ... generally tend to lower than the plane\nYou need to be a real need ... like my ... friend up you'll be\nAre we ... them up on a Daniel ... ... ... they were saying hindsight I send them up you have to ... you know we\nWe tend to value happy ... to ... you can jump when they asked me where now you wouldn't have ... you to all be calling me the money you know now I didn't want to know more me and we can be when you when you die oh you leading the name\nGo in there may be indeed DIY gimme gimme the for me like I'm ... I went to the general paying for it will be trying to train a point to me\nBy the way the\n... the looming damned if you don't see is a\nGreat morning you know an open I had a great time you only useful you hope you get all the great a Native American media music ... brought to you from your way I you know an eating ... and also Katie why yuppie upper ...\nProjects up the whole the foundation nine year or ... or his morning was a great program starting at six o'clock so I'll be back to you again on friday morning here would use so secure alarmed at six o'clock and you can start\nYour day our windows one and only airway paid me a ... okay so what I Want to say why go off\nArea in a on a wish you hunters getting like I Know you hunters have been getting ready for the ... I've been going out there in scouting\nSo he's in the ... it's like the mayor of mine ... eat anyway I don't know what we saw\nYou hunters this is going out to you guys good luck to all of you keep moving ... just listening to his songs when you tell you all about it so we get sick you\nOnly have a great great day assigning lobbies wondering only renting normally\nHear better known as square but\nCouldn't guy jag do Katie\nAnd I had I had a a a\nGood ... I I\nHave my ... my uh eight or ... or ... or ... or\nA yellow day they are now a clear or oh hey I'm a non ... by ... by a guy\nI Know my uh they had a uh [noise]\nThe\n... or\n... or ... or ... or you know like they are in a hell of a whole oh hey I'm a non ... made by a much higher or tired or\nOn a hot a hey hey Hi uh Hi I'm\n... I'm a ... or ... or ... de la ... de la montage young will ...\nA day you know you are gay or on the bail murky in there to are they who\nThey are my recollection about it more or less how they might start young well much over a\nDay you know you are giving up on what about ... ... do they do ah they\nOh whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa or\n... or\n... or ... as a\nGuy hey hey I got a hey hey hey hey hey hey hey ho\nWho I had a I had a\nI have I have a I uh hey hey hey hey hey\n[noise] up it may happen\nOver here I'm a ... but there are a ... a more a low or mine or a little ...\nA day to work in a hurry they'll monetary loan they too are they\n... the ... ... they have a minute talk a little over a\nYear after work you know we're on everybody do mercury low they too are they who\nWho who ... who who who who who are\n... or\n... or ... or\n... or ... uh hey hey hey hey hey hey\nHey ho ho ho\nI had a guy had a I had a I uh\nHey hey hey hey hey ho\nHo ho hey a a ... a a\n... or ... or ... or a\n... or ... or ... or Iowa day I have a have a home oh hey I'm a non I uh\nHey hey hey hey hey ho\nHo ah hey a a ... a a\nYo yo yo ... a\n... a day my mother or ... or ...\nAnd I know of a hell of a a mud or not they are made by a much higher salary or\nOn a lot I had a\nYo\nYo yo ... uh\nUh other than my ...\nMy mother a no no ... no ill or I or go to a man and I have a whole oh Hey Don my non or\nThere is a by a much higher salary or on why are they are like a\n... a heckler Jimmer ...\nAbout ... ... ... my ... young ...\nEye coming up next we do have a shoutout to give\nA shout out to Derrick when my ass by coming from the opinion\nCruise I just wanted to do a shot for you for today to Derrick when my us by and the sound they chose for you is Don Carlo young girl so here you go and thanks for joining in to KU why\n[noise] and [noise] um they only began\nTo teach it to be a nice car you can\nTell me to translate that nitrogen but nothing you can write to me you know anything can transcend managers Tom tom in\nYour piece of a man named would think tank and comes when I come to those Nineteen Ninety\nFive pounds and she's still like to feel like we're paying\nLike three times when I came here to the next time [noise]\nI don't I Try to sit down and I had come to get that time in the room and we can get a [noise]\nA discount and\nThings like thinking\nThat tell you that some of the time I did not see the other\nTimes\nSince then that they can see that the strong\nAddiction sometimes seems like the middle of my family\nWas blown up [noise] [laughter] [noise] actually\nTen ten times can you can take many phone calls on the one piece Silverman\nGuess they would be something is how I felt very concerned and I feel like I'm going to come and see those lines you go like day when my time in\nFront of you who may take my time in the town I can hear it [noise]\nOh man I guess they would be so bad oh I Do I Know but you know like like a ... a lot of I don't know well into those banks you know by games\nWhen my kids are\nWe going to do and\nWe're not talking to you and I came here I don't know she told me a check in the town I Know I felt very you know I can\nSee that was just\nLike you know he's a young man when\nHe said no no\nNo no\n\nNo matter who\n\nThey know that there was a man and dignity um do they know the one who the\nO nine na na na na na na na na na na na na na na na na you go to a new ...\n\nWho were around for a\nLong range you know one of the name of that\nAnd they're like\nNo I mean God or anything and the and it is I\nBuy beer a day\nTo do that to me the ball on\nThe\n\nAir\nI'm I'm only\nNineteen oh a monitoring\nAnd now I'm going to be a good job minor land\nYou can't make a new one way or that you know and then when I was at a local to\nGetting and drove me being on the line and ... ... I mean it is a ...\nI'm ... I'm\nA I'm\n... I'm ...\nI'm a\n\nI'm a\nI'm a I'm a\nI'm a\nI'm a I'm a\n... oh na na na na\nI'm\nNo\nLonger or more a matter of fact\nI remember a rumor and when the\nMan or a\nNa\nNa na na na na na na\nNa na na na\nNa na na na na na na na na\nNa na na na\nNa\nNa na na\nNa\nLittle oh ooh\nOw\nWell\n\n\n\n... ... ... ...\n... ...\n...\n...\n... ... ... and you'll know\n... or ...\nOh no no no no no\nNo no no no ... is all no no\n...\nNo no no no\nNo no no no ... no ...\nNo ... ... ...\n... ...\n... ... ...\n...\n... you know and then they said\nOh no the ... ... ...\nOh no no no no no\nNo no no no no no no ...\nNo no no\nNo no no no\n\nNo no no ... said yeah no no no ...\nNo ... and ... and you\nAre listening to pay you why I Hope that law eighty eight point one F. M. N. K. U. L. Y. I. L. P. upper ... eighty nine point one at a project of the Hopi foundation\nStreaming online that you know why I dont know your Native American public part radio station\nSigned into law in two thousand sixteen the act is designed to improve and promote travel tourism ... is the assistant secretary for Indian affairs at the Interior Department\nWith this piece of legislation I it's important to understand that tribal engagement and tourism activities and I you think that\nThe data that we have out there to promote a visitation to to promote the development of infrastructure and economic development and job creation in our communities and having the systems in place to ban attract tourism into Indian country\nCanal Ferguson is the executive director of the American Indian Alaska Native tourism association mission is monumental this is a this is a very bad\nWhere's the activities and uh using the the data that we have out there to promote a visitation to to promote the development of infrastructure and economic development and job creation in our communities and having\nThe systems in place to than attract tourism in Indian country\nCan mail Ferguson is the executive director of the American Indian Alaska Native tourism association this is monumental this is a this is a very beneficial opportunity for tribes\nTo engage with federal agencies to be a part of their planning process for the development of tourism um this gives the tribes the\nI'm to be at the table when tourism\nDevelopment is happening now after the fact provisions and native act including ... Native American tourism into federal planning and providing funding and technical assistance to try the native organization to develop and increase their tourism efforts tourism plays a role in providing jobs\nAnd other revenue source for tribes across the country\nUs secretary of the interior Ryan Zinke he is hosting a celebration for Virginia's six federally recognized tribe the event Wednesday in Virginia will include tribal leaders us lawmakers and state officials\nTo celebrate the tribes at federal status which became official earlier this year the tribes spot for decades for federal recognition to give them direct relationship with the federal government improve services for their people\nAnd assist in repatriation efforts\nThe crow tribe in Montana is accused of misusing millions of dollars in grants intended to improve water systems according to a federal audit nearly five million dollars were intended for improvements and an additional nearly eight million cannot be accounted for it to pay benders the Associated Press reports\nTribal leaders were reportedly reviewing the audit Tuesday and are expected to release a statement and inaugural boarding school conference is being held in Carlisle\nPennsylvania this week the national Native American boarding school healing coalition is hosting the event to\nRaise awareness on the history of us Indian boarding schools topics include trauma and healing\nI'm Antonio Gonzales\n[noise]\nDefinitely and birth Ashville made for studios like water frog corporation financed by going lovers provider of loss wish and by the corporation\nFor public broadcasting support\nFrom radio satellites support five you know so frail one of the American Indians science and engineering societies talks with the employers you can join us for bee basis Congress October force or the success in Oklahoma City info at any thought this dog for\nSupport by a A R pay our opinion creates and connects people unique tools and progress scopes can sort of personal resources unsettled issues that matter most to individuals families and communities more at a A R pain dot org\n[noise]\nMade a voice on the Native American radio network\n[noise]\nThis is native America calling I'm ... I Would\nGuess Florida's Disney World can experience an avatar virtual reality tore\nTake pictures with lying Disney characters and buying souvenirs and one of the many gift shops and right now deserves can also view and envisions art exhibit exhibition that exemplifies current and past Native American art ... tradition innovation and change in American\nIndian aren't open over the summer at Epcot American heritage gallery exhibition includes eighty nine artifacts and contemporary art pieces my need of artists including a Glenda McKay Juanita growing thunder and Bethany yellow tail to name a few\nFashion designer Lawrence or gun was also commission to design a dress for the show will so you will hear from him this hour and a show is a collaborative effort from\nThe national museum of the American Indian in the museum\nOf American indian art and culture and Disney might not be the first place you think about when it comes to presenting native art and culture well here's Kevin Grover director of enemy eye opening day\nTens of millions of visitors is in Washington or [noise] um\nBut the reality is that a great many people from around the world and never visitors and a great many of those people will never go to the Smithsonian will visit and we're hoping to give them just as we do business owner and\nThat was coming over from enemy I recorded by the Disney geek\nCalm book and now we're going to take you deeper into the exhibit and if you have questions or observations about preventing native art to guess at Disney's theme park well we hope you'll give us a call at one eight hundred nine nine six to eight for eight and if you visited this gallery You're welcome calling to tell us about your\nExperience ... one eight hundred nine nine native and today we have a couple of folks joining us here in Studio forty nine my pleasure to say hello to do a warrior also Tony ... who are here with us and Lauren era gun\nAnd ... is the director of the museum of ... a museum of Indian arts and culture and she's a member of ...\n... me a ... thing one thing I mean to walk on a winning does own funny to clogging ... see one ... causing ... one eight hundred three one eight to five nine six came out with the shoe and healthcare dot Gov\nGone during the God to the Centers for Medicare and Medicaid services\n[noise] they may just [noise]\n\nThat I [noise]\n\nYeah yeah yeah yeah\n\nToday we are talking about and you need a bar to exit at Disney World cup theme park and it might seem like an odd place to showcase eighty nine pieces of native artifacts and art but the native curators who put the extradition together seed reaches a home\nAudience and right before the break we also heard about it builds bridges join the conversation to at one eight hundred Ninety\nSix to eight for each with us here in Studio forty nine today is a native designer ah learn air gun of\nThe line I can ask you come to us from ... blow also here too is Tony ... curator of neurology at the museum of American indian arts and culture as well as della warrior director of the museum my pleasure to welcome them back and let me turn to you too about what ...\nWhat it meant to be asked to ah create for an exhibit like this and and any thoughts to about challenge pass\nWith Disney and native America\nGo up to start it was a really great surprised to hear that they wanted me to commission a peace directly for this exhibit and a ferocious little unbelievable the diverse me at the engine market in Santa Fe and or\nWasn't really sure if it was true [laughter] and ah\n[noise] ah got all the contact information from every one of those\nPretty official and it took a little while to start but things that role in it was definitely an exciting time in a great opportunity for for me to showcase my work represent my people and I'm\nReally show a part of the world like what I can do and what we can you it's as native artists and to be selected as just one is three featured artists alone or Glenda McKay and we need a growing thunder for already um\nThat was quite an honor and it was great to see that Disney was reaching into the communities more responsibly the native communities\nWhere responsibly to really get things right really get things for from the people that know best uh the curators and this is Sonia and in Santa Fe and then the artists themselves and I'm\nBringing all that into one gallery to showcase to the world and really more of an educational as it gets really great that it's in the upcoming term because it's more of an educational park and\nI remember that from you know as a kid going there to see the science advances in technology and a learning a lot of what was going on around the world and\nSo that I think it's a really great place for a place for it to be Jewish focus of the world and get some people are more of an idea of where we come from an R. progression in the art to more modern styles and in any medium\nAnd hearing that you went there when you were young how does it feel now you're that young guy going through their um and now here is your work and and you know the center of who you are being featured\nOf it was it was a great experience I remember going there with the science camp and\nJust taking in all the the science of the job I guess the features of the park and as a nerd you know you go crazy on those things and and also the kid you want to write in all the rides I actually didn't know that the\nUh the world showcases was part of the\nUm Epcot Center and when I was young so I'm going back again this time as an adult was was really more eye opening and really great to see that they've um again put forth some responsibility to reach out to the countries in wearing proper representation in to those things\nIn one role that an artist plane which is a very special\nRole is um letting people know that we're still alive we're still here we're creating we evolve um you know we challenge or you know different forms of art and talk to me about exposing people who are going there to be entertained have a good time and\nAnd here you are bringing this kind of narrative we're here we're alive and look what we do\nRight um again a quite an honor to just be able to talking to people of our capabilities that you know we're we're beyond what people think and seen the movies and that we're progressing or work in so many different mediums um I for one bringing ...\nUm you know we challenge or you know different forms of art in talking about exposing people who are going there to be entertained have a good time and and here you are bringing this kind of narrative when you're here were alive and look what we do\nRight um again a quite an honor to just be able to talking to people of our capabilities and that you know we're we're beyond what people think and seen the movies and that we're\nProgressing our work in so many different mediums um I for one bringing forth\nThe representation of Iraq multiple pottery culture and putting it into fashion so also showing that we're not just limited to the things that we know that we've\nCome to be known for in our communities the acting was mostly known for their poverty art I'm the northern tries more for the beating regalia and all that thing all those things um\nEverybody's taking their own strides to show\nOther capabilities other talents that we have and it speaks volumes than it really again ... ... plays more\nOf the story for us and it tells more of our story where we come from and it opens up people to start asking the questions I Want to know more I Want to I Want to know more about this tribe on more about this person and so again really really great opportunity for all the artists who are representing their\nRight you just heard from Lawrence Oregon here in Studio forty nine\nWith us today from ... come up with a blow a he is the owner and designer of ... if you'd like to talk to him directly give us a ring when he hundred and Ninety six to eight four feet environment ask you to get visual too and describe the dress that you design in any talk about in that\nProcess of creating for this exhibit\nSure um well this is a little bit of a unique approach for myself even a Disney had wanted to showcase\nReally what were they when they hadn't heard about what I was doing\nThey really wanted me to showcase an highlight my my skills that way in representing our party culture and put it into fashion so the display that might address this and has the pottery from which it was actually inspired by so this showcases the whole\nUm titled basically I'm changing innovation and they reckon Indian art so I'm the piece that I designed was inspired by an old ... oil pot I'm On a chrome print on the on the outside black on white clay with the terror caught as\nColor in the interior and just picking up part all those highlights and the things that were very\nIntriguing to me I I picked it apart to to basically kind of highlights\nThose aspects of that pottery into the into the dress and\nI really wanted to incorporate more of all my skills um I also do jewelry and accessories and worked at a ton of different materials so\nI really wanted to put this all into one piece and really you want to make it stand out and really live up to the whole uh Disney Princess uh um hype [laughter] so I really wanted us to be a a ... a beautiful representation of and really kind of sit along with the whole history of of the Disney Princess is so\nI thought a lot bigger and unfortunately that's coming down because I'm as that Tony I mentioned to the galleries a little bit small so [laughter] to confined to pieces to to fit into different glass cases and I'm a I was really happy with what I\nHad turned out and you can definitely see my work at\n... dot com photos of the the piece that I had submitted and or follow me on line and my Instagram at can have a to see more of that but um I think that the the thing that I Want to highlight the most as well is that I incorporated a little hitting Mickey in now on the whole dress so when the the curators at the park saw that they were they were Florida\n[laughter] and what was going through your mind when you were cutting that piece of fabric\nUm you know I was\nThere was a lot of excitement and a lot of emotion they are\nNow where it's really hard to get where I Am now I'm moving away from engineering to pursue fashion which is kind of a crazy [laughter] is what I've been told us about several times I think it works\nWell [laughter] so yeah but I I applied just everything that I wanted to into this piece and\n[noise]\n... not I'm not\n[noise]\nNot Haiti knock down by the not the\nNot the family friends and allies enough to you know I have no money\nThat you and say he's\nDone guy he was a young guy he was\n[noise]\n[noise]\nMeeting gee maybe not\nMe not to be\nDone on a ... a month you know he\nGot he may that I\nKnow you're connected to native America calling I'm Terry T. one from its little quibble and we're focusing on\nThe new need an art exhibit at Epcot in Florida it's called\n... tradition innovation and change in American indian art and what do you think about the adventure native art has embarked on with his partnership dialing and share phone lines are open right now one eight hundred nine nine six to eight forty eight we're going to go in and take a call here from Evelyn\nIn orange County California listening in on line and when things were given us a ring euro near\nThe yet so I just wanted to say congratulations to the artist that got their work into this then he'll it 'em long overdue that think that something with it that's a real need an artist\nAnd I wanted to comment I was hoping that you would have a Disney person there but I didn't want to comment that does he does have an opportunity to create more\nNative Americans in their heart such as at Disneyland in California where they have a French air land or they could put traditional\nNative Americans there and in their California Adventure park there's great opportunity to contemporary so they can help those stories and I hope I can see that in the future and once again thank you to the artists that are showing their work there and that address is beautiful I just looked it up\nAll right thank you for that I'm Evelyn there in orange county here in Studio forty nine with us we have Tony ... Maria della warrior mourn air gun and also on\nThe line from sue in Maryland is a moral her many horses and don't want to turn to you um we did reach out to a representatives from Disney but tiny they couldn't make it for a\nLive broadcast and I'm Wondering in your discussions with Disney um is there anything you'd like to share of what they were thinking in jumping into this venture\nWell just to give it a little background on how this came about it was with a partnership but I always had with one of the vice presidents Carmen Smith when I was the president of I say she approached me and she asked if we were what our plans were in\nThe film area and I said well you know we had hoped to have a baccalaureate degree program but at that time the funding was was um\nPretty much at risk but they invested in\nIowa and started a film program there which is now a four year program\nSo when I was at the uh at at my back I reached out to her and asked her for pro bono help in a helping us to revamp our one of our permanent exhibits here now and always\nSo she accepted and she brought some of her team members and worked with my team for a couple of days in the museum and sour collections which we have\nSeventy about Seventy five thousand objects in our individually catalog collections and about eight million and the art archaeological that's an election so then we went to Orlando incurred um\n[noise] the Epcot and that exhibit and also just learned on how Disney does things so she said to me how would you like to have\nAn exhibit here and of course it yes and uh she's great when I worked on three projects together and I wanted to tell their audience that\nNext um in June of twenty twenty that will have a new year down always and one of Lawrence work or will be in that exhibit\nWe're revamping that exhibit and the museum has been working with about I think fifty five Native American sell consultants from the uh various Web blows in the Apache\nTribes in and out of the whole nation so where I'm\nRedoing that exhibit and it will be up for several years and one of the floor and so we had commissioned or I don't know if we commissioned it or we got it from ...\nBut we did have a beautiful dress in fact Disney wanted that and we said no we're not going to alone is when you go get your own and what you just referred to is in Santa Fe New Mexico\nNo no the museum of age in our culture is in\nSanta Fe right and say on the hill and then while I have this opportunity on December twenty first we're going to have a walk the hill and we're going to have people come the week before\nAnd make Christmas ornaments and we'll decorate the tree\nAnd it'll be quite beautiful on the hill and the tree is donated being donated by a tribal member one of our engine advisory panel members Malcolm ... so the public it's local here could come up and uh spend the day and have some fun on museum heal and\nVisits the collections and our exhibits of course\nKnow in December is getting here really fat thirty feels like it's knocking at the door and I'm Vicky for that dilemma and meaning you're sitting there wondering\nOkay been Epcot I I Do remember this um I'll give you a little bit of a low cater a creating tradition innovation and change in American\nIndian art is inside the American heritage gallery which is inside the American adventures showcase which is inside the world's showcase inside Epcot theme park at Walt Disney world\nIn Florida and so did you know any of this what's going on what is your thoughts one eight hundred nine six to ...\nAnd at the door and I'm Vicky for that ... and many years he was sitting there wondering okay been Epcot I I didn't remember this um I'll give you a little bit of a low cater a creating tradition innovation and change in American\nIndian art is inside the American heritage gallery which is inside the American adventures showcase which is inside the world's showcase inside apple cup theme park and Walt\nDisney World in Florida and so did you know any of this what's going on what are your thoughts one eight hundred nine six to ... for eight or does he can have a comment and say Hi to joy Susan wounded knee South Dakota listening in on camera I ally Julie screen to hear from you go ahead you're on here\n\nIs very large in case of mine I think ...\n... trial hanging create thinking I can pay and salary during back in my thought I thought that if I could tell why I'm doing some lady\nAnd Jake Tapper a\nMac that's actually how\nTo write my language\nAnd act that I that I ... I get to go to the ... thing to\nMe the animals were big tech truly good Native American population is why I didn't I bike and Langley of hers and holy creates an egg\nShell and click the through like three times in our native language is a ... a day and by the piece that Sean\n... and you know what a choice that is such a wonderful idea because the language is a part of all of this artist to artist learn anything you want to tell Joyce\nA joystick or if you go to the exhibit that they're actually interactive this place is part of the whole exhibit and Disney was\nKind enough to allow the featured artists to present or a kind of a collage of images of their work as well as the narrative of the artist speaking to what's being shown and\nThe great thing about that was we were able to introduce ourselves in her native languages so um there is a small part of that in there and I honestly I that would have been great if we could there be incorporated both our our language it um\nIf it could be written [laughter] a lot of times though a lot of our languages aren't written so um but definitely if if we could have had more of an opportunity to speak up about it and talk about in one of our in our native tongues would have been great\nWell and and it's exciting to hear that um the spirit of the language is there in in some form and you know are there any more details you'd like to share with folks um about what people find inside this exhibit\n[noise]\n[noise]\n\n\nOh can you can ... I was homeless within about six or seven months I'm baffled how I lost everything so quickly and that's just the strike everything\nVisit drug free dot org a message for partnership for drug free America Arizona affiliate\n\n\n\nAh\nIf\n\n\nYou are listening to kill you why I put the law eighty eight point one and and tell you why I lp upper most companies eighty nine point one and\nProjects up the whole ... they should dream and online education you why I got that your Native American public radio station the following provided through the partnership between getting your why I Hope you radio and and have you every zone off public radio [noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\nOh my ... I can tell when the\nBBC News hello us extra state Mike Pompeo has accused of abusing the international court of justice and using it for political and\nHis criticism followed and I see Jae ruining ordering the western shoulder free export to Iran of goods including food and medicine the U.S says it already make sure the humanitarian supplies get through his proper place how sure\nIran argue that the U.S had violated the terms of what's called the treaty I Am a tea with this decision to reimpose sanctions the two countries signed the accord in Nineteen fifty five to regulate commercial relations and\nIf you did sense to take each other to court because you're for parents that Iran case was with a merit that it had abused the treaty therefore to us was terminating the agreement he also rejected icy Jay's ruling saying the international court had no jurisdiction over what he described as America's sovereign right to protect the security interests\nA coach in Peru has reduced to pause and granted to the country's ex president though that is what you more often appeals from victims' families ... had been having a twenty five year sentence for human rights abuses Kansas pit bulls\nOh that is what you Mari was comment on health grounds in December when the president of the time I go to a public ... in a movie\nWhich stopped widespread protests Mr ... not to release mistook would you Mari as possible political deal to avoid\nHis own impeachment I'll bet if what you mores that marred by many in Peru for crushing Maoist rebels in the nineties and ending a conflict that cost tens of thousands of lives but to his critics he's a corrupt dictate to was white fleet James ...\nDuring the kings of innocent has been\nAround sixty migrants to drum up the coast of guinea is now in West Africa off the boat capsized they don't believe to being any survivors or Africa editor will Ross reports\nThe wouldn't budge since reported ... capsized during a storm when it was close to ... percent of the border would set a goal uphold officials\nWell it was in the nineties and and getting a conflict it costs tens of thousands of lives but to his critics he's a corrupt ... was rightfully jazz for during the kings are innocent has been\nAround sixty migrants so sad to have drawn the coast of guinea pigs in West Africa after the boat capsized they don't believe to being any survivors are African editor will rule ...\nThe wouldn't vote is reported to his capsized during the storm when it was close to ... percent of the border with set a goal posts officials had the coast guard could see that the people on board we're in trouble but the navy has been unable to intervene as it didn't have any thoughts available\n[noise] guinea fowl has to speed boats but according to local reports play ready leaves the port due to lack of few the nationalities that the migrants is not known nor is it clear where the plane was headed but the seat crossing from West Africa to Spain's Canary Islands has been popular in the past\nThere are conflicting accounts of what's happened to a prominent Saudi journalist who disappeared off to go ... countries comes in is temple ... a fierce critic of the Saudi building establishment entered the building on Tuesday he hasn't been seen since Saudi officials say he left it comes to the but the Turkish\nWill ... is still there and then the kids here too with the Saudi counter tops this is the world news from the BBC\nThe fringe anti terrorism prosecutor Francois ... has been giving details\nOf the police operation lifted the recapture the country's most wanted gangster red wing fight three months after he escaped from prison in a helicopter to Mullen said the mobile phone records\nLed police to ... north of Paris where suspected female accomplished saved police raided her apartment before dawn where they discovered fight sleeping with a loaded revolt within reach\n[noise] Britain's prime minister his wall and had a divided conservative style jeans at the toughest age of ... just as a come\nI just called for unity addressing the party's annual conference Theresa May set of failure to strike a deal with the European Union would be bad for both sides but insisted the future for the u._k. was still promising guess robots and\nOh describe but it's a really steady income for the defense of capitalism ... conservatism as she called her and most important of all how Brexit policy I mean let's get\nRight to it and let the fence about Brexit policy was basically ... youth activist you may know is highly like it unless remind ourselves right there is for sort of free trade free customs area\nWith the European Union but she said look at the old Honda says it's either leaving without any kind of a tale of full or maybe just ... Brecht set an a second referendum in domestic political chaos\nThe Portuguese football's sun Christiana ... his strenuously denied and accusations that he raped a woman in Los Angeles nine years ago in a tweet he said rate wasn't abominable crime that went against everything he believed in on Tuesday police in Las Vegas said they'd reopened that investigation\n[noise] the world's governing body for chess has elected a new king the former Russian deputy prime minister or how they do all of which the politician outmaneuvered his great rival Joe Joe's macro pulled his winning by twenty five votes of the world chess federation come grass in the black sea port of ... to me\nThat's the b._b._c. news [noise]\n[noise] hello welcome to the news out from the BBC will so that was coming to live from London Monday just pulled henley today we'll bring you the latest don't\n[noise]\nI have not seen [noise]\nHot segment Ken my I Am now and I found one that [noise]\nWell I live outside [noise]\nEm I feel I guess I Am [noise]\n\n\nA fight with a hook them they'll look something\nThis way but says ...\nAlone now with a lot of money to buy her with their little ... de\nLa ... you know [noise]\nI sent him a bum bus I'm like you are [noise]\nMan emitted\nBy [noise] [noise] did he doesn't want me to die in my life with a with a ... you are\nMore information seven three eight five to five one\nDomestic violence awareness host and encouraging hopefully values resource Parenthood valued elderly building October night that for the em [noise] details are nine to wait two to five six eight seven three\nImmunization and flew clinic October night sixteen twenty thirty and thirty at all and the hope the health care center lobby\nAt ten am details are seven three seven to five seven [noise] low cost ... vaccination clinic October ninth and tenth as the Hopi buried clinic more information and then three eight five to five one\n\nHandler's training at upper ... senior center October tenth at nine AM more information as I step in three for\nThree four zero three [noise]\nA carnival event that help Veterans Memorial center October to out that five PM more information as I said when three for three four three two [noise] reggae band October thirteenth\nThat monk appeal like yesterday in starting at eight P. M. Arlen standard time [noise] more information is on nine to eight to eight three four five zero zero eight traveling rabies vaccination clinic for dogs and cats October Seventeen\nEighteen and Nineteen or times and locations you may now\nI've been three eight five to five one or seven three seven six to seven five [noise] James canyon elementary school Halloween they're banned October Eighteenth as six PM more information is out of seven three eight you three eight\nFive domestic violence awareness conference at monk or the legacy in October Eighteenth that one PM more information nine to eight to five six eight seven three [noise]\nRed feather Jose class how to keep your house is warmer in the winter and cool in the summer October twenty third RSVP is at nine to wait for four zero five one one nine\n\n[noise] substance abuse prevention center hosts the monster dash October twenty seven at the Hopi health care center at nine AM\nMore information seven three seven six three eight five [noise]\nDog and cat costume event October twenty nine that's the hope you've been married clinic at six P. M. more information as I said then three eight five to five one\n[noise] twenty Eighteen girls night out October twenty nine that they're helping Veterans Memorial center at five PM [noise] more information seven three four one one five one\n[noise]\nA monster dash October thirtieth among could be a legacy and into but steady beginning at five thirty P. M. more information nine to a to a three one two three four zero [noise] first may use in our community Halloween party October thirtieth as six PM in the first\nMay say use center more information as I have seven three seven to seven nine nine many how pairs up into the public November thirteenth to help Veterans Memorial center starting at five PM out standard time\nDetails are seven three for three four three two\nAdults coed basketball event hoping Veterans Memorial center November Seventeen and Eighteen more information is that seven three for three four three two\nDiabetes group visits taking place every second Thursday of each month from eight AM to eleven AM [noise]\nMore information is out seven three seven six two three one [noise] I'll be culture and language Russians are Tuesdays and Thursdays beginning at one PM Batman company legacy in more information is on line to eight six six zero three five or to\n[noise]\nAlso again ... election board will be holding elections for tell your community members today October third until seven P. M. [noise] more information is at seven three seven two to five\nOr [noise] all righty and now you're hoping junior senior high school sports first step Hopi high schools part of the high school volleyball October fest Joseph city in by that Joseph city high school\nTime to be determined [noise]\nOpie high school football October ... versus valley Sanders Hopi\nAnd that is the night varsity starting at seven P. M. O. P. high school cross country October Dave ... invite in Phoenix at Marlon veal part darling at eight thirty eight em [noise]\nAll the high school chess October fifth and sixth regional one tournament Eli Williams high school starting at one P. M. [noise]\nAll right enough for your hope in junior high school sports first step hopefully junior high school football October third versus gently junior high school at ... has been pushed back to October for\nJay you be starting at two PM and bar city at three thirty P. M. [noise]\nOpen a junior high school volleyball October for birthdays to an earlier at hoping junior high school\nJV starting out four pm Anbar city at five P. M. obey junior high school cross country October six but Davis invite at chipper city high scores starting at seven A. M.\nAnd that's gonna do it for you are hoping junior senior high school sports are more information and I hope the high school and hopefully a junior high school sports activities you may call nine to wait three eight five one\nOne one [noise]\nAnd that's gonna do it for your community counter update board as the Wednesday October third youth tiles in a team\nIf there is information you they're not here stating that step and am am noon and five PM when we are in our community counter ban it'd be ... I Hope the radios free community counter which they continue to support our mission considered becoming a case\n[noise] for more information and I hope the high school and hope in junior high school sports activities\nYou may call nine to wake them in three eight five one one one [noise] and that's going to do it for your community counter update borders Wednesday October third two thousand eight team\nIf there is information you did not hear the two nights there been am am noon and five PM when we're in our community countering bent it'd be ... I Hope the radios free community counter which to continue to support our mission\nConsidered becoming a KU why I underwriter your financial contributions during this move will help us prepare for an even brighter future and allow us to return to the normal broadcasting you depend on daily\nShow you why I offer supported by underwriting to get your message out you our listeners\nCommunity counter strike missions I edited to one sentence which you just takes a couple of seconds to read for just a few dollars to record your information therefore paragraph thirty second announcement to reach out thousands of listeners emailed info at K. you why I got to get on the air ... ...\nAnd that's gonna do it for your community counter update coming up next it there are updated whether\n\nMm [noise]\nMm Mm\n\nMm um Mm um\n[noise]\nMm\n\nMm Mm [noise]\n[noise]\n\n\nAll righty I'm back with their updated weather for this Wednesday October third two thousand eight\nTeams [noise]\nFirst step team's Kenyan tiny as when did you do with an overt task [noise] this afternoon part because I knew with a high near Seventy five south south west when six to ten miles per hour [noise] tonight [noise] partly cloudy with a lower I'm forty seven out the window around eleven miles\nPer hour [noise]\nBecause ... tiny as Seventy two within overcast\nThis afternoon part is I mean it was a high near Seventy five southwest when five to nine miles per hour [noise] tonight partly cloudy with a lower I'm forty six dropped when parents are Thirteen miles per hour with Garces highest twenty miles per\nHour [noise]\n... city area current near sixty three and mostly cloudy [noise] this afternoon\nTo\n\nAround then and then my ... grade and my uh ran a I have a bad day and then I can\nTry and write down a man I married now than I Am not a very large role in\nThat we can go ahead and I think I have time to time I am at the same ... [noise] [noise] wow\nMan behind that guy has done in a while and a treaty I'm de de de de down and not be ready\nAnd then you can go out and I\nThink I read the fine dining how why am pass the time and maybe [noise] wow\nMan behind\nThis guy got done paying a lot of the treaty I'm paying three days they buried down and not being greedy\nWhen I said that there was no sometimes I have no sign on or whatever and then as\nI say I read the fine dining and now I Am at the house\nAnd the [noise]\nWell my son and I just kind of jobs in most\nOf the and the planning cry and cry in the back more men than we can then\nThat meant that they're proud of the time and not better than mine mine or not the\nWay up to me and my dad and my thing\nI mean me and my son I I Know I got that big of a game\nOr a job or some green and na na na na na na I\nTell them no longer and I can find a way yeah mom Diane I can do\n... and they're bound to tell the fact that that that it is now mine monitors around them in\nThe last day by day I may name my time\nAnd now I Am happy to ... ... ...\n... ... the next song we're going to sing is title Christ but I really thought they translated by I tell them I'll look how\nThe ... ...\n... ... ... or whatever you\nWrite about a boy Don ... I'm going I don't\nKnow the man is not a a visa to being more care a bomb\nOn with 'em\nRight but I'm doing a lot of time and then down\nThe block a by a ... a good I\nMean I'm I'm ... I'm I'm the I'm a big\n... na na ve\nRight but I'm going to a a a you have that\nI'm not ... I'm a big guy ... ... ... a man a very\nUm oh ... I'm ... now I'm a\nGuy and they know\nThe by a by a day\nA man I'm the blind yeah well I'm a\nBig or when they're ... [noise]\nRight or a ... ah ... I'm a ... or you go on the ... not a very well long we spent a\nThird call um I thought I'm ... I'm a guy named no\nBugged by a by a ... ... a man I'm looking for money oh I'm the I'm the\nOne day a huge ...\nNext we're going to see is the ... ... ... how about you know and became obedient to death on a ... ... pm chapter to burst eight\n... ... ... ... ... ... ...\nFine na na na na na\nNa na na\nNa na na na ... and ... and\nI I'm I'm drawing a ...\n\nMinute long and I'm Sorry to say the law\nAnd they all you had\nA\nGlass house being na na na na na\nI pray and da da da da da\nDe de dum de la\n\n... long run again I'm not a hundred and five\nFive oh well I'm no longer in ...\n\nAnd ... and then I'm going on now you're in\nA ... a you know and if you are yeah ...\n... email again ...\nAround like a piece that last night and day now I work\n... hours a\nDay ... day or a ... ... ...\nAnd ... then drawn management my son my\n... yeah\nYou know we don't know I'm ... I was\nSaying they are now ... ...\n... de dum de ... ... ... ... ...\nAnd the idea that it was like\nOh\nYeah yeah I ...\nI don't want to know 'em me that in that way we do\nWhen they are\nMuch more than ... I was\nIn\nA\nBank robber [noise]\nRun I'm\nNot sure that every\nGrows the\n... ... ... men have\nMade some day my\n... a\n... a\nLot of the um I Love\nBut then went to the next stop I'm an eleven I'm In a lot about what their job and I continue to have one they were living like a teeny ... little the trying to limit the job I\nCalled him out in my jail with the age of ... with the non right to jump on the ball back the number of the ball on John rate down like a bell but not all of her voice jail on the concrete real bad you're going to land on the gas bubbles\nAvenue trying to get away with a Jack Jack say you know what I mean you think that we are not at all but don't be if there was a problem with your outlook on the look on the bottom\nLine for me just remind me that I didn't mean to me but I read the book and read the mind for me\n'cause I'm a liberal way lining of the things that we all went down that created the place down another taking hold in about ... like the ... mission in Kentucky to on this element concept when they want us to like say\nThey don't pay a lot like a new job cuts like a waste of my talk fast but I mean yes I was struck by the way up in the back of course when it's on to get like a toddler my when I take my you know if it wasn't a problem to outlaw me to look nice to have long it\nWill be in the in the spring and for me just in the new one and I mean just in the meantime we then I Believe when we\nGet outta here where taking my\nMeeting new nice to meet the needs for me to lose a little baby do lose\n... ... ... ... ...\n\nYeah God in a row\nAnd then that didn't get\nTo the allied gold mine the war on who\nWork at night or during the night long\nTalk phenomenon not hear the monument\nGum in the ...\nProblem in fact I live on ... by not\nToo long to\nCome back on the line ... by nano\nTube I don't want them to move on to like let me know\nThat to me that day to pretty much on that that that that that that\nThey don't even know what they want to know how to deal with the Torah bunch alright Don not only won one\nTied the Daschle to black star I Try\nTo learn from when we were on the same\nDistrict [laughter] to be gone [laughter]\nTo my mom who he's going to be one time that that is that the team that there is already one\nProblem that tiny tiny need by nine\nTo you know I don't want 'em start dialing nine dining by not tell me about it from the one who\nMy\nGirl my mom who\n\nWas grown I'm wrong on who\n[noise]\n[noise]\nThat's\nWhat all of\nA mostly riding high known in may\nThat ran on my back on\n\nAnd on their way of saying the same\nMan on every letting me know what\nI'm saying I'm up up up up to ... live in Arizona and over and and I and also on the line\nOn my mind and that\n\nCan deny it on my long term thing going on why\nAm I saying you were a lot jump right on a big bird that are friends of mine up\nAnd down and over and [noise] and I know one thing\nI Am on my hands yes\n[noise]\nAnd I ran up my little boy\nOn and I'll hang up and down and over and [noise] and I know one thing in my\nIn my home I just watch them do rent that\nNa na na na na na na na na na na na na na na na na na na na na na Iran\nI'm gone our room on a big ball and\nI mean God and\nMy mom or\nA\n\n... and ...\nShe says she wants the granddaddy and three and I knew she was my no well yeah that's how I Am a ... not too unhappy per se but then some\nOf them a\nLoan will tell you know I Know I mean they you know ... you know I always am I'm\nA Mac died out\nAnd I'm back um ... you know and and now that I'm making their on camera I Know but I mean we just do my own and na mean\nProceed on marry me\n\nBut I remember when ah when ah ah most and just\nA very came down here we are in school for it and no ... no I mean bill banging away when I got but yeah I Know their name a new one that went around a na na na no\nOr daddy manager and then the ... and all but hey on on the long\nThe\nLine\nCalling from [noise] yeah [noise] [noise]\nNo I Can't speak to my health I think they use\nThe [noise]\nI don't want to [noise]\nWhat do you\nChange any time he was he signed my whole\nLife so to\nMe that's the\nThing the only come up [noise]\n[noise]\n\n[noise]\n[noise] [noise] [noise] [noise]\n\n\nYeah I'm In my brain\nYeah in a pretty you know\nThen\nThen I\n[noise] I Am\nNot a lot of say a handle on the train\n[noise] you know why I wouldn't mind yeah no I [noise]\n\nAsked him the night [noise] I Know why and not only a dollar more than that right well\nOther than to come\nTo the injury and when the when the man\nI'm no I don't mind [noise]\n[noise]\nNo [noise] [noise]\nUm [noise]\nCan you\nKnow then I don't mind yeah my mom [noise]\nYou know then I don't I don't\n[noise]\nI don't know [noise]\nHey we're still in a row and you're listening on the current\n[noise]\nThan say man the young guy I\nSaid when Lauren calling from\nThe man to last year by bus to browbeat them in a nice to have so much Eddie ... daughter I'm always around you know what you know ... or you can read\nAll over [noise] about [noise]\n\nThe the Internet has been a dog and the other day when the tree never know when we're the one child in the ... right\nNow I\nWork for um [noise] that area you\nKnow what you know\nGoing and\nUm [noise]\nI\nI\nKnow [noise] [noise]\n\nRight now are there are no I'm about an hour and ... but I may never stand right hand sewn grilled cheese in\nThe world beyond my for me to follow that God fearing ... no one\nReally bad shot down\nOne at all I'm saying that you\nKnow that they were afraid [noise] you know [noise]\n[noise]\n[noise]\nA long story then you add in a\nBad day we're already\nKnow na na\n\nNa na na na na na na\nNa I Am\n[noise]\n[noise]\nNo no\nNo no no\nYeah but you know during the last thing\nYou know they know I'm sure they do when the bombs and your job to do just about\nA man and we don't need them their main job was to go to the train them that you know\nSo we all like ... ...\n... ... ... ... she just can't\n[noise] well well well well well\nI\nDon't\nKnow about\n... ... ... ... ... ... ...\nWhat would you like you know the general\nDe la la la la la la\n\nLa la la la la la la la\nLa la in ... in\nThe end of\nThe men in life you can join the you know I'm On\nMy little one you know when a man\nMm Mm Mm Mm\nThey don't want to you know it was\nA long way to put you on my phone call yeah women I talked to some of them are well\n... ... ...\nI'm going to\nCome up with my mom when I'm when\nI'm like whoa whoa whoa whoa whoa whoa whoa whoa whoa\nWhoa\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa you know when\nThe la la la la la la la la\n\n... ... ... ...\nThe border is no ... no God knees won't be seeing the genetic but all ride on as bad as I go ...\n... ... ...\n... ... you know there's\nThree months then you're ...\nYears I'm ...\nAnd she always welcomes we heard do Mm ... Mm no ... on\nThe ... well not wanting to know by John my and I get angry men come back some today ... shadow the brand name ... got many in law and I\nDo a ... you know my little or no men to go all\nOver [noise] [noise]\nIf you ever see you go from there is why you got in all armies so there'll be ...\nNose or vermin host this show and you know they get around all the way I'm Joan\n...\nWell not wanted the no fly zone by and I get a new breed they're gone back from the day and you know ... the brand name brand so now I've got many bars on\nOh no no no no ... you know like a\n...\nI think he ever Warren point that's Marty Stewart and his fabulous to correlate with old Mexico he left and Abigail Washburn gave us what you can do and my ... jumbo which Clara no time at the top of that sat and I'm like ...\n... ... if you're just joining us well here's John Lee hooker junior\n[noise] [noise] [noise] [noise] [noise] I see\nSanta Fe to the world can face the lowest paid such as you know we can do\nRight\nNow\nSo I don't know I'm\nDrawing on that\nI always wanted to be judged by Bonnie and Clyde [noise]\nBut how did you try to destroy you to be back down\nAnd um yes I Know [noise]\n\n[noise]\n[noise]\n[noise] I just found the\nUndercurrents is made possible by your support an eye the corporation for public broadcasting as well as envy one stations like\nKay why in our in top and Washington and W. O. R. T. N. bureau quasi Wisconsin is his native voice wind the Native American radio network\nNa\nNa\n\nNa\nAre listening to ... I Hope\nAny point one at a king you know what I else in the upper ... on one\nA ... dream in my mind again why I thought gee why I enjoy your Native American radio following it provided through our ... I Hope you radio ... and a new Arizona Public radio\n[noise]\n\nI Know it is an easy to say no when our friend offers you off or some other drug on here's a thought that might make it easier next time somebody asked hey you want to get high imagine what he's really saying is hey you want to mess up\nSee studies have shown that alcohol Molly marijuana and other drugs can make you mess up\nAnd doing poorly in school even performing worse in sports so just sub speak to mess up or getting high from now on which would be easy for a smart kid like you brought to you bye to you why I Hope you radio\n\nWorld oh [noise]\nOkay is that the person residential alerted are almost no way to opt out even if you want it to their was anxiety and at least one losses they said that this essentially amount to warrant less non consensual\nPassing by the government they said they worry that eventually minimal training to about government control loudspeaker in the home and I made her think every American was a different kind of the\nTrump allegedly said these countries hey\nIt's now part of the story of the first lady trip to Africa was an international blood smuggler tells her story and memories from Mexico's Nineteen student protest stories and more coming up on the world\nOh [noise]\n\nI'm joined Macintosh with the b._b._c. news hello the White House press her she has defended President Trump often\nHe ... the testimony of Christine dusty folded a campaign rally in Mississippi on Tuesday the president made fun of the fact that took this whole choose the key to Supreme Court nominee Brett Kavanaugh's sexual assault couldn't recall key details of the vegetables\nAnd so it sounds as insisted that Mr Trump's remarks were justified\nThe president was dating the facts I frankly facts that were included in special prosecutor Rachel Mitchell's report he was dating facts that were given during Dr ... testimony innocent there has to make a decision based on those facts or whether or not they see judge Kavanaugh to be qualified to hold the position on the Supreme Court\nBrett Kavanaugh strenuously denies all allegations against him us at ... state Mike Pompeo has accused Iran abusing the international court of justice and using it for political and his criticism came up to the U.S CJ ordered the U.S to ensure that Iran is able to import food and medicine despite sanctions imposed by priests\nIn special prosecutor Rachel Mitchell's report stating facts that were given during Dr Ford's testimony innocent it has to make a decision based on those facts and whether or not they see judge Kavanaugh to be qualified to hold a position on the Supreme Court\nBrett Kavanaugh strenuously denies all allegations against him and us states Mike Pompeo has accused Iran abusing the international court of justice and using it for political ends his criticism came up to the U.S CJ ordered the U.S to ensure that Iran is able to import food and medicine\nDespite sanctions imposed by President Trump the U.S says it already make show humanitarian supplies get through but the Iranians since the ruling showed that the sanctions were illegal\nUs national security adviser John Bolton criticized the coach decision\nWe're disappointed that the icy Jay failed to recognize that it has no jurisdiction to issue any order with respect to sanctions the United states imposes protect its own essential security under the treaty says the court allowed Iran to use it as a forum for propaganda\nThat developed an added that Washington would now review all agreements that much expose it to international court of justice buildings\nA coach in Peru has reverse department granted to the country's ex president a better for ... after an appeal from victims' families that the more you had been serving a twenty five year sentence for human rights abuses Candace period has more details\nOh better for Maria was problems on health grounds in December by the president of the time president public ... in a movie which stopped widespread protests and the ... he denied that he really Smith defeated Murray as possible a political deal to avoid his own impeachment I'll bet if what you already said marred\nBy many in Peru for ruthlessly crushing Maoist rebels in the nineties but to his critics he's a corrupt dictator who is rightfully James for\nDuring the kings of innocent peasants\nAround sixty migrants ... drones when it wouldn't boat capsized during a storm off the coast of guinea pigs so\nOpposed officials had the coast guard to seeing the boat was in difficulty but didn't have the means to launch a rescue attempt the incident happened close to the border with cynical a puppy does point to migrants hoping to reach Europe accidents are saying overcrowded boats are combing\nYou're listening to his well news coming to you from the BBC\nColleague over into going to use opposition leader who's been on hunger strike for two weeks say he's been admitted to hospitals in the capital low may make a deem a a yo how pia has been calling for the release of dozens of opposition activists detained during anti government protests in February\nEarlier this week to take this to be over the border to get medical help and gone the failed when the alternatives\nStopped him from leaving there are conflicting accounts of what's happened to a prominent Saudi journalist who disappeared off the going into his country's comes to that in ...\n... is a fierce critic of the Saudi\nRoot against opposition meant jumps and reports\nTomorrow ... Saudi commentator living in self imposed exile\nFrom that he's being critical there's many recent developments in his homeland ... nice to crackdown on dissidents in to the sun comes from a tennis stumbled on Tuesday and hasn't been seen since I was wondering if you don't say sounded the alarm\nSaudi officials insist that they show the last the confidence of pretending to some personal business that the Turkish authorities say he's still in the building and then go shaping the Saudi counterparts\nThe Austrian chancellor Sebastian ... told the Russian President Vladimir Putin is too many regional powers and sympathize but trying to exert their influence in Syria on a visit to St Petersburg Mr ... said he hoped foreign troops would soon with\nTroll correspondents famous because this trip is intended to highlight Austrians role as a possible bridge builder between Moscow of the European Union astronomers have found what appears to be the first moon to be detected outside our solar system they believe the extra moon about\nEight thousand light years away is about the size of next year making it much love of the larger than astronomers have predicted\nIt was observed with the Hubble Telescope by two U.S researchers\nBBC News\n... support for the world comes from legal zoom dot com offering a network of independent attorneys and tax professionals who can provide the advice needed to get through the daily grind of owning a business more as legal whom dot com slash\nWorld\nMarket where men and this is the world we're glad you could make it at precisely to Eighteen pm eastern time today all of our cell phone started beeping at once and flashing this tax message presidential alert this is a test of the national wireless emergency alert system no action is needed almost all American\nSaw that on their cell phones today it was a test by FEMA the federal emergency management agency for a system that the president could use in case of a national emergency got us thinking about how other countries do the sort of thing and the world's Lydia amount of leader looked into that\nOr is this something governments who is this normal\nAround the world yeah it's it's an they many governments around the world are they use these systems for emergency announcements everything from natural disasters too missile warnings\nAnd I gather Lydia here in the U.S there have been a quite a few privacy concerns about how the government's going to use the system\nYeah that's right there was actually a federal lawsuit was filed last week by three people they want it to block the Trump Administration from sending today's uh ... uh they said they worried that eventually the system will turn into a quote government control loud speaker in the home that every person a FEMA has said though that\nSomeone and we still don't really know who got this idea that they can create what they called a plasma economy where they were paying farmers who never paid for anything farmers had a nominal income and with no sleep assistance wedding or farmers where they could pay them a small amount or their\nBlood and blood plasma and that everyone would get rich and the process now a lot of farmers to get rich\nBut pretty quickly into this system I'm HIV entered the classroom pool and because the system is so ramped up and moving so quickly favor be using to being ... needles they were often times in much donation you re injected Joan are where\nThe red blood cells and in some cases they were actually injecting how the people with tainted blood cells and how it was almost a perfect storm oh wait to read a blood borne virus through a donor\nPool on according to one she came to the doctor who actually discovered April ... in the class and I said that she warned provincial officials she warned central government in Beijing that HIV with him is that people were getting infected\nAnd in spite of all that it took three months to officially shut down assistance so there was this period I mean you can kind of argue about what the government knew when that there is this period of three months before the government closed down all of these sanctions plasma stations and where they absolutely knew what was happening and\nLet it continue so\nIt's a yeah it's similar to what happened in the u._k. and we had our own problems in the U.S I mean there has to do with it yet but there have been tainted blood scandal all around the world um and it said it's kinda revealing look at how governments respond when these things do happen in China's responses\nTo shut it down and cover it up quickly as they went in public health crisis since the last thing you want to do\nJournalists Kathleen McLaughlin wrote my career as an international blood smuggler for the guardian thanks very much for being with us\nMark out\n\nOn the radio and at the world dot O. R. G. you're with the world\nYou're listening to the world on can you need you Arizona Public radio your source for NPR News and talk good afternoon it's two twenty\nFunding for working in a new comes from northern Arizona biological dentistry Dr Barbara Ireland embraces holistic that'll treatments as part of whole body wellness using only bio compatible and non toxic materials complete family dental services in Flagstaff and a B dentistry dot com\nWell that was a soaking of reign of the lights we haven't seen around here in quite some time I'm you know we're all just be born from Arizona Public radio in Flagstaff rainfall totals Flagstaff two point three one inch in Sedona to point to to\nHide three point seven three crowned king happened everybody off and over five inches and a little bit last around Prescott and the reservation where it was round the happening to an inch of rain around us scattered showers and thunderstorms are becoming severe afternoon\nInto tonight\nI'm Mark a woman you're with the world saving the Amazon is and has always been about trees and wildlife and the indigenous people who live in it but the giant\nRain forests at the heart of South America is also a key factor in the global climate and that's become more and more important as we humans continue to alter the climate now there are signs\nThat as we chip away at the forest it is losing its ability to help us fight climate change we're taking a deep dive this week into what's going on in the Brazilian Amazon and why it matters to all of us today reporter Sami ... looks at some of the reasons deforestation there is so hard to tackle [noise]\nLast October mob of angry minor paraded through the streets of mice\nWith those northwestern Arizona State [noise] they were headed for the local office was ills environmental agency called mama which polices deforestation in the Amazon pages there recently shut down in illegal mining operation in\nA nearby forests preserve this was paid [noise] yesterday was captured on a cell phone video in an instant the field offices to vomit trucks went up in flames Asian harm [noise] was no spontaneous corruption and violence he bomb U.S officials say\nIt was started by the town's mayor and several other local politicians and hosted a barbecue with free alcohol and then encourage the miners\nWho attacking politicians were arrested later [noise]\nFish\nThough he by my agent Evander Carlos Silva says\nWhen you're in the business of stopping illegal deforestation conflicts like this happen all the time a mob burned want to sell the trucks last year nears off in some other Grosso and he's dodged threatening ambushes\nCombining the non I ... a lot of stress attacks new scare him he says but he transfers that fear into being cautious Dobbins air macho Grosso is big news third largest state you live on the southern edge of the Amazon Forest dead center in Brazil so called arc of deforestation\nWere illegal logging is rampant facility says his office has just for agents patrolling the area the size of Florida\nThree of them are set to retire next year until the sister unlikely to be replaced after deep cuts to the agency's budget by my side of the some of us are from G collapse\nThan the non ... a\nLot of strategy attacks new scare him he says\nBut he transfers that fear into being cautious down there motto Grosso as Brazil's third largest state it lives on the southern edge of the Amazon Forest dead center in Brazil so called ... station where legal logging is rampant but ... says his office has just for agents patrolling the area the size of Florida\nThree of them are set to retire next year until the says they're unlikely to be replaced after deep cuts to the agency's budget\nNumber ... ... you call up on me\nTruthfully he says the agency has an collapse situation\nThe budget cuts have been blamed on Brazil's economic crisis but they were pushed by president Michel to mayor who's an ally of the powerful agribusiness interest in Congress rural east is as they're called\nBut budget troubles decided to sell this as few here in the Amazon region comply with deportation laws anyway for you know why because he says there's no fear of being punished and simple\nHave [noise] the room\nIn the back of selling his office offers a window into why perhaps it's full of shelves stacked floor to ceiling with green and blue folder boxes several grabs one of them like all the others it's stuffed full of fines for a legal cutting last move up because of\nA fine fellow says most of which are never paid with al ... and why would they be when the government last march for gave more than two billion dollars in past finds\nA powerful signal that no one will be held accountable for breaking the law the signal seems to be being received deforestation rates jumped almost thirty percent in two thousand six team eased up somewhat last year and seemed to be rising steeply again this year [noise]\nThe sound of a large truck passing outside interrupts our interview may [noise] meet someone says\nA cattle truck he says that's the easiest way to identify what stage of deforestation and Amazon town and just look at the trucks logging trucks for the first stage cattle for the second after the trees are gone and then\n[noise] soy trucks [noise]\nIn northern mustard grocers agricultural boom towns you know about a thousand trucks a day had north\nSoybean export warehouses and tributaries to the Amazon River feed the booming international demand for so I see no spring history includes all three of those stages from forest to logging town in the seventies to cattle ranch is in the eighties to today's mechanized soy plantation\n... the kinds of places that are well too early settlers like ...\nOr the so uh we came here to clear the fourth tour and young you know there are a lot like you to turn this nearly abandoned land into a\nProductive area of suicide that now ... owns an eight thousand acres [noise]\n\nGiant combine harvester rumbled by ... cigarettes and lights up as we wait he came here in the last days of Brazil's military dictatorship in the Nineteen eighties and he says his style jak for that time\nFor more and got not those little ... we were cheated by the next government he settled in Brazil became a democracy and you're afraid to a change in Brazil's environmental laws before Amazon landowners had to keep the for standing on half their land\nBut after that dictatorship that was increased to eighty percent of lake don't bill ... is the laws that are blocking us fair and Yon says but things are looking up for him and other released as president to marry\nAnd the ... are doing their best to dismantle does laws and in\nNew ... alliance candidate is the leading contender next week presidential election Jared both an arrow is a tough talking right wing populist who's often referred to as Brazil's Trump ... wants to give them to pick up a little ... maybe we'll get a Trump here to fire\n... by the set this country straight and that could send deforestation rates in the Amazon soaring again this justice scientists are increasingly alarmed that tree cutting and other changes to the Amazon\nAre starting to have global effects for decades the vast for us to help suck up huge amounts of CEO to pollution from the atmosphere but recently that\nProcess seems to have stopped maybe even reversed that threatens one of the planet's most powerful buffer against even more dangerous climate change [noise]\nYou know various legal effect definitions of differences but really helping people who are in need today\nIn cooperation that's the kind of security architecture that I Would like to see in the western Pacific that could really deal with real problems not haggling about Roxanne reefs and\nYou know various legal listing definitions of differences but really helping people who are in need today\nFor its part the Trump Administration appears prepared to stick with a confrontational approach to China especially on trade a White House official speaking at the Chinese embassy in Washington last month said for us competition is not a four letter word so the world I'm Matthew bell\n\nSo we all remember our civics classes in junior high school writes if it has it been hammered into a slightly let me remind you Supreme Court appointments or for life supposedly\nTo prevent political interference if you're a justice and you're not worried about being fired or getting reelected you're free to rule on the legal merits even if it's unpopular all good points of course but as we've seen with the cabinet\nNominations the appointment process can still become a political mess so what happens everywhere else in the world ...\nSmith is a senior research fellow at fickle that the British Institute of international and compare to Los so you're in London you must start there and of course America's judicial system evolved out of the English system briefly tell us about the origins of lifetime tenure for judges over there\n[noise] [noise] yes well this is a country which had its backers of appointment of judges and they must have happened a long time ago so the\nEnglish civil war of the seventeenth century was the midpoint of a century of struggles and at that point the judges served as the pleasure of cake so they can could dismiss them at any time so when parliament became more possible\nIt's pasta framework and Seventeen hundred and in that act settlement it provided that the king could no longer dismissed them\nInterestingly it led to some of the change in the U.S at the time of independence\nLet me just clarify there and so basically the judicial system and in England evolved for the same reason we kind of say here to prevent the monarch bullying judges\nYes that's a great way of putting it and there was some brave judges in the seventeenth century but if we look at the standout cases that were more judges for example denying bail\nOr just arbitrarily imprisoning opponents of the king when that hadn't committed crimes that type of behavior which was driven by the dismissal one could say looking at the big picture\nAnd today in England or those lifetime appointments still the situation\n[noise] friendly enough that knocks a lifetime appointment was the main safeguard for nearly three hundred yes but in the Nineteen I realized that as more judges were reaching advanced age the um let's see ... and\nThat's one of the most famous in this judge has no tending the leading judge of the ... century started expressing some very uh especially conservative views and folksy was rising and the feeling was that if judges were going to do this at the edge they could bring the\nReputation of the courts into district periods so a retirement age was introduced it currently Seventy\n[noise] I mean there are more than fifty countries in the commonwealth which are influenced by the English model from India to urinate of South Africa have they all evolved in the same direction of ending lifetime tenure\nAt yes they have so there are exceptions but there are three small island states where judges are typically brought in on a contract basis for this discussion when we're talking about logic countries we can leave them to one side so it's striking that\nSays no more lifetime appointments in that group of upcoming little countries with the heritage that US system says\nSo here I Am a little confused about where the U.S sits right now so if you consider the systems of judicial appointments or in the countries you've looked at it compare them to the current state of affairs in the U.S would you say the U.S has behind the times\n[noise] I I wouldn't say the U.S at a heightened time or it's crisis which are robust and has helped the scrutiny even ... years sometimes what part does and what I Do want to highlight is the\nSpecific issue of retirement that we've been speaking about that is an area in which we've seen that the U.S has\nBeen left behind with other countries have introduced the time it's just\nAnother problem the closest that we haven't talked about yet is\nThe pressure on individual justices decide when to class so Justice Kennedy made a very important decision when he retired now like any of us he's entitled to to stop working back that far more consequences\nBecause it was ... and ... where there's a retirement age a\nMore predictable in that way and set up less tension between presidents government some of the one side and judges on the other side to side with the new ... seats on the court to the government of the day that will be choosing the next nominee\nI'll never forget a Thurgood Marshall a return from the court and a a a reporter asked them on the steps of the Supreme Court why argue stepping down and he said it's because I'm old [laughter]\nThat should be the reason\n... Smith is at the center for the rule of law at fickle that the British Institute of international comparative law thank you very much this is really fascinating might\nNot [noise]\nIn twenty Eighteen we're marking a lot of fifty year anniversaries from the heady days of Nineteen sixty eight this week Mexico\nIs noting one of them it happened on\nOctober second Nineteen sixty eight Mexico City was just days from opening the summer Olympics was the first time in history a Latin American country was hosting the games and the nation's leaders are ready to show the world\nThat Mexico was a modern with a country but a student led protest movement was disrupting the preparations like young people all over the world in Nineteen sixty eight Mexican students took to the streets to demand\nMore freedom or democracy more rights Mexico's then president ... Diaz or does\nWhat's concerned then October second Mexican police and military open fire on people's student demonstration and they trust in local neighborhood of Mexico City the death toll has been a matter of dispute ever since the most recent official version is that forty four people died that day\nActivists say the real toll was much higher in any case it's one of the darkest episodes in Mexican history said he ... took part in the student protests in Nineteen sixty eight and Mexico he studied and written about their impact ever since currently as a researcher at the corner\nHill they may go a glass says what he and other Mexican students were demanding fifty years ago were very basic rights\nWe one says that the state does not use force against does we didn't live up to the mall is bothering him or at least I'm more of a citizen patients up plus all the way they live in a peaceful way\nDarkest episodes in Mexican history savvy ... took part in the student protests in Nineteen sixty eight in Mexico he studied and written about their impact ever since currently as a researcher at the corner he'll demand he co ed ... says what she and other Mexican students were demanding fifty years ago were very basic rights\nWe one says that the state does not use force against does we demand lived up to that ... in Oregon a relief on more her citizen patients up when I saw\nOn the way they live in a peaceful way most of us we were demanding in a way that we've become Democrats become ... or even the ... the ones that live in these are the Jews over the world where the ...\nSo the student led protests have been going on all summer I'm just as Mexico City was getting ready to host the Olympics how had president Diaz or dies responded to the student protests\nLittle wants to pull out the ... among the students and they were over ... because there is all about them as the president went to the schools is to stop the Mormon because ... says we want to do that unless\nYou give us some freedoms you'll just on a lot of the month and the president concluded we'd advice or they may look that was part of it caught me in a moment\nAnd the that the students was controlled by less than local and really love that they want to ... ... I'm ... I'm a communist government in power letter from the or the mouse or for worse and all that but I see them\nI mean we don't even know the exact number of students who were killed on October second ... do you remember your reaction when you heard the news\nI was completely shocked because I I knew that there was a peaceful movement a lady\nI was sure was not going to be in the world then because there were ready if you're coming in Mexico Mexico west controlling body for that was among the things I ... I was powerless I thought it was for later on I thought that the loan covered it into the\nFence around by some democracy and that's what I said that the one of my life\nIn Nineteen sixty eight in Mexico how unprecedented were the student protests\nThere wasn't a lot them in in the sixties I mean we whether you know if I may early on in the schools that are available because we want to be experts on they live there was one example movies like you still be than with James Dean yeah that wasn't allowed in Mexico rural control what they will\nProbably end up time Mexico was very proud of Roque you know we were isolated from the world but yes we do this evening formation of what was going on they music I mean the rock and roll with every quarter\nYou drop them all the time we dont know criminal or the time and we what ... what was going on in the U.S about Vietnam I mean what what part of the world one way but we weren't allowed to the bottom of the world\n\nPatricia orb on his new book is called buried beneath a bit of a tree she lives and writes in a booth\n\nAnd that'll do it for us today I'm marker where I'm from ... studios here at WMFE ... in Boston\nTomorrow [noise] uh\nThe world is the co production of the b._b._c. World Service the R. I. N. W. GBH Boston supported by the John D and Catherine the MacArthur Foundation committed to building a more just Britain and peaceful world learn more at ...\nDot org PR I twenty twenty dollars including the Roger ... family supports Public Radio's dedication to fairness and objectivity in news reporting\nMargaret stayed Hoffman who values journalism and storytelling to reach across our divides to create a more informed connected world and by the w._b. H fun for environmental reporting donors include the Grantham foundation for the protection\nOf the environment supporting a cooperative approach to solving are critical environmental problems while we still can and to continue to fund furthering the values that contributes to a healthy planet\nOur international\nI'm Shelley ... general manager is Kenny\nValues journalism and storytelling to reach across our divides to create a more informed connected world\nAnd by the W. H. U. P. H. fun for environmental reporting this daughter's include the Grantham foundation for the protection of the environment supporting a cooperative approach to solving are critical environmental problems while we still can continue to fund furthering the values that contribute to a healthy planet\nAre bringing international\nI'm Kelley Weiss in general manager of Kenny you thank you for once again making pledge drive like a success thanks to you we hit our one hundred eighty thousand dollar goal and we did it without interrupting the programs you love thank you for supporting Arizona Public radio\nFunding for working in a new comes from the vice hearts council presenting roots and indie folk with North Country a band merging the sounds of the musical pass with the future seven thirty tonight at the Coconino Center for the arts flag arts council dot ORG\nMarketplaces max but at three thirty all things considered\n\n\nThat young readers made new voices and the mouse cleared his voice and bad for me to share my\nElementary readers may need to be two years Ron ... marriage in the ... parents ships and\nOlder children may benefit from discussing what they're reading an answering your questions about their book\nWhat do you think the main character was thinking there what do you think what the central\nNo matter their age help your children develop into lifelong readers this is Joe ...\nPresident of the Arizona Education Association reading to your children early and often rates habit that can last from like encourage reading in your home by visiting the library frequently and letting your kids pick up books off the subject but the truth and\nFeed their natural curiosity what's book reading as a habit I could spark a lifetime of learning a message from Arizona Education Association\nYou are listening to carry wired hope bell eighty one FM streaming online at the Y. R. dot net during Y. I. L. P. upper ... nine point one FM projects up the Hopi foundation and your neighbor American public radio station ... music [noise]\n[noise] [noise] ...\nYou can you hear why any like at at the rate [noise]\n[noise]\n\n\n\n[noise] [noise] [noise]\n[noise] this is a severe thunderstorm warning for the ... area for the national weather service in playing soccer has issued a severe thunderstorm warning for piano by county in West\nLeft open you know ... north central rhythm and feel free\nTo repeal amounts of time to repeal mountain stand in front of a severe thunderstorm was mostly just miles northeast of told him you know what the forty five miles an hour [noise] tons of sixty miles an hour wind gusts half polish fuel source\nWe'd already indicated impacts kill damaged her vehicle practiced expect winning damaged rules\nInjuries severe ... areas you haven't by income can be no counties lucrative Easter for eighty nine in film\nInterstate forty prince concluded the following highway eating late ... mile markers three hundred and forty nine and three hundred and fifty five [noise] for your protection moved joined in Syria room on the road for of a building repeating a severe thunderstorm warning until ... pm mountain standard time for\nThe phone call them you know [noise]\n\n[noise]\nMm Mm Mm Mm Mm\nMm\nMm\n[noise]\n\nUm I'm\nA\n... on the news to live in the late ...\nWhen when the cameras like man I don't know who know\nA ... ...\n\nYou know when they come on man come when they live and die and then in\n... I'm ... ...\nIt was on loan it in um uh you know I'm not going to be more in a you know\nThe right way even those that have\nBeen in the mountains and then\nYou know and I'm a ...\nMinute bread when\nThe men in\n... I'm I'm Lynn then we'd see the um he was living in\nJanuary the ...\nUm\nThe main line who ran the late\n\n... Mm you know we we\nLive we live\nIn ... Mm\n\nMm\nMm\n\nMm\nMm\n... Mm\nMm Mm Mm Mm drinking\nLike men are in one Mm they may you may have won\nAt all now my ... birthday and my job you know they did all this by 'em back and give them out on my idea but you are in the Bible about loving my I'm\nA I'm On my\nWay or the\n[noise]\nMm [noise]\n[noise] well [noise] ... ... ... ... ...\nWell ...\n... ... ...\nWell well well\nYou know a la la la la\n[noise]\n[noise] oh so so much\n[noise]\n\nBill on one\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise]\nOh\n[laughter]\nOh\nWell we may you know I'm I'm ... in the news you know the full name\nYeah gone she said\nGo ahead and ... then the only real way in in ... we only want to know the more you know when we got to be done yeah either that\nOr is that ah [noise]\n\nReally\nReal you know ... and ... you know we didn't know\nAny uh in Moline God she did and then go out and then in the movie\n... and do all the other way yeah it's a game you know we only a new one there was a movie you know he loves the we got ... in the city you\nLive in a in a in\nGeneral [noise]\nMm yeah\nNa na na na na na ... [noise]\n[noise]\n[noise] [noise] [noise]\nYeah this is a severe thunderstorm warning for the point where we are we are National Weather service implying Sharon issued a severe thunderstorm warning for\nYou know ... in North central Arizona into four pm standard time three twenty five you know standard time if you're on your show was located in February ... for North of thirty miles an hour hazard sixty\nMiles an hour when he goes to a quarter sized females source indicators pill damage to vehicles even expect to expect when damage to ... injuries location I'm trying to include were journal where's the Williams punishing coups interstate\nForty three mile markers one hundred fifty one hundred and fifty seven in between my own markers one hundred and sixty one and one hundred and sixty three for your protection can when they truly are we on the Louis for building repeating severe thunderstorm warning has been issued\nA billboard piano to stand in time for the following county have you know Arizona\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\nBack on that point I don't want to go to the government do wake up call for you and I did not\nGet in over a no no wait a minute I guess young old brain but the\nOne where I draw the\nLine backer or what to do what they do not know when they come back more than once you're not going to do when they call you back on that point people want to buy a new basketball back\nYou're going to do [noise]\n\n\nThe Mormon\nMember on the windows I'm One of my favorite summer from you know I\nRemember being a woman who knows [noise] Battlemind battling bundling when are we going back going on what you're going to do\nWhat they do and when they come on [noise]\n\n[noise] basketball basketball I Wonder do they want you know when you're falling on one thing to do\nWhat they were going to come you don't get something done more to give up on them I\nWas talking about the fact that you're going to do what you do when you're talking\nAbout it if you're going to do\nWell\nIn the ... they they are the na na na na na na\nDa da da\nDa da da da da ding\n\nDing ding ding\nDing ding ding no Cheney I'm young man in\nThe campaign\nIn Maine and didn't even know if you're a new name and you know\nI did see the family are in the uh you know\nMaybe just\nNo you're na na\nNa na than than the one being in New guinea the\nDa na ... name and you know ah yeah you did\nIn the family are in\nThe uh you know na na na na\nNa na na na\nNa na na na na na na na na na na na na na na\n\nNa na na na na na na na na na na na\nNa na na na na na na\n[noise] bom bom bom bom bom bom bom bom\nThey want to do it and I know that I'm a I'm like no no no no no running a little bit of a job to go out\nAnd this guy got it and I'm going to look at it out well I Know what I find that that would be I mean that that guy I mean in some of them either I\nI was young I Know that you work in an American or wind up with a plan they got it right and it's difficult enough I Would have given me like I didn't really like I couldn't\nGet reading what I think that I got run over by the time and how we got to witness that we have like\n... and even then we bring you like\nTo jump on the road so whether some of them I think we've gotten on them they're around there and there's never been there we're not going to do that when you met ...\n... what would you want to go around or whatever I remember when I'm\nDoing wrong and I read a book that I got to go about it but you know we're all down there and I made a lot of dog do any of our front of a problem with it you know we were wrong on well we got older\nI got a ban on what it is no better better they even got to do in Reno\nRight wren wren and there have been damaged the day and every time we ran ran right and\nWrong wrong wrong wrong wrong wrong wrong wrong wrong wrong\nTime and I have a time and I live and I want to thank God and none of them is that they have a lot of\nWomen and I think that we're living in a group or another that however I don't know why don't we we were down and my job was Harlem but it really well everybody wanted to know exactly\nWhen they make every now and then when the man running again in a number\nOne girl in a while and so on and tell me a lot of ways I mean a rod oh my God oh a few\nHours now I don't know how old are your way to grow\nAnd grow from\n[noise] na na na na na na\nNa na na na na na\nNa na na\nThe John John gun game on I'll do that and they found John John founding na na na na na\nNa ... shows up by\nBuying the euro\nNew pads on TNN I'm gonna\nMm Mm Mm Mm\nMm Mm Mm Mm\nNo no no no no no no no that's just another bomb racial nine in ... in North Carolina\nAnd I am I going to try\nIt on\nA chair show [noise] and uh share share ...\n\nYou are listening to tell you what I Would do that and he wouldn't want to and and say you why I ... a promotion I'll be eighty nine and ... and project about what we found diction streaming online at the White House dot net your Native American public radio station\nParental involvement is the key to your child so this is your top president of the Arizona education whether it's volunteering school including what teachers on a regular basis\nFor helping ... we know involvement is crucially important so get involved working together parents educators can make this a great school your average than Arizona a message from the Arizona Education Association\nOatmeal and music ... ...\n... and all that\n... that can you hear a you why any like one of the rate\nIn the\nRoom and then you guys out of her baby ... rather wrong then there is always good to ... that\nAre um learning how to do that as regular beer and it's been raining yo I William and their\nJob oh I'm ... I'm I'm a ...\nTo ... New Jersey we didn't know what do you remember your cholesterol so rather wearing the same there's a lot to do a bomb on\nThe bread barely make this a daddy died at your brand in another ... mom saying lie to roll stone\n\nBomb marches oh ... years old who then [noise] down no no or moves out being a man or a non drowsy\nBank is paid by a man named James Cameron made giant ...\nAnd ...\nOther lower died ... are all ... out of a reality that age and the ... the maple trees me\nI Do say that oh my well you know solve all\nAround marches o ... o ... mom did no\nNo no no no no no I'm a Jew so\nTo me you know\nWho do do do do do ...\n... ...\nTo um [noise]\n[laughter]\nOh [noise]\nIn the city and then do you\nDo [laughter]\n[noise] [noise] Mm she shares\nFor God she was in a new one a day yeah hang on June ... I'm On my way to meet with\nThe street and fish and do they need to do that while I'm eating my aunt and I'm ... I'm In my breath away ... factor\nMaybe times [noise]\n[noise]\n\n\n[noise]\n\n[noise]\nOh my God I mean I'm sure\nI could just move she then I just didn't find a way to make you know yeah say Jews in very good move away from where my old man very we\nGot these huge as to how much on the need is Jackie I'm all my friends and count the tractor\nAnd maybe it's time to\n[noise]\nMaybe [noise]\n\n\nMaybe\nNot so\nMuch and\nI'm\n... I'm In\nThe [noise] [noise] [noise] [noise] [noise]\nOh no no no no no no and then they\nShow on may\n... and ... and and now and I'm\nA man\nAnd then you know and I don't\nKnow to me and my name is Jean or you know I don't know nine nine men in\nThe sand and maybe\n\n[noise]\n\n\n[noise]\nBut then\nYou are listening to K. U. I wrote about what eighty eight when one that I'm living on the line that K. U. R. A. I. dot net get your eyes a project I Hope people don't\n[noise]\nKnow you're not getting the\n\n\nWrong wrong wrong [noise] my\n[noise] my\nLittle ...\n\n\n[noise]\n[noise]\n[noise] well no I don't I'm\nNot to read this John I'm a I'm not a whole three to ... when when you\nKnow I really do you talk to him but I don't want\nThe day at a time and I'm not the\n... the do the pain that\nWay you'll she ... and ... not right now I'm a junior year you know don't Joe Millionaire thing I'm not really you know six my grand mom those bother with they bring\nAlready\nUsing it to be a doctrine aided in the pouring don't jump up on member can knock out a lot to do my job or that's not you know and they don't want to do the low rent\nAnd we just on the way she\nDirects the only thing we do you you're in some way to make your little or G. E.\nD. is not right it's like it's not right\nNow All right yeah\nThe thing that this gentleman that talked to people living in a lot of chicken long ago we live in\nAn old I recognize it and then you know but what would you what you may remember\nWhen we I live in a way of run next to me you know when we had last night they don't get to do it when I knew what and when we do I guess I\nJust know that Iran much I can tell you\nIt's not that you know hidden maybe it\nRemind you know who you are you ... and it's not right to be you know you're you're young oh no\nOh wait I'm like oh my so to speak to the patient seeing my mother in law loves when no one drop among the town we only know\nWhat I'm going to win Judy Jay ... and it\nTells you change that I don't think she may have been directed it started writing it die right\nHere yeah I don't know yeah\nIt really opened up to\nYou know we like to\nGo on\n[noise]\n\n[noise] [noise]\nDon't manage them down not that\nMuch trouble well I'm not saying that Joan\nJoan mashed fans are saying young man when I saw it on you know we don't know\nWhy I'm [noise] going to talk\nTo you\nYoung man in June and they don't match the young man [noise] don't you know we can\nSee why\nThey call them [noise] [noise]\n\n[noise] [noise] do\nYou do [noise]\nYou\nKnow [noise] [noise]\n[noise]\n\n[noise]\n[noise]\n[noise] [noise] [noise]\nThis is a severe thunderstorm warning for the ... area and National Weather service\nIn playing issued a severe thunderstorm warning for ... you know county in North central Arizona until five PM mountain standard time for twenty five PM mountain standard time\nThat parents are from the stones were located in ten miles southwest of the northeast and twenty five to thirty miles an hour hazard sixty miles an hour wind gusts going all the time of course\nThree already indicated panel damage to vehicles either expect wind damage to rule citing industries location to include it starts\nRaining Boy Scout camp lake a campground in ... hours a week a campground who's the following highways interstate forty between mile markers one hundred and sixty\nIn one hundred eighty six white eating or mile marker two hundred and twenty six for your protection moved here when the interior room on the lowest form of a building for a piece of severe thunderstorm\nWarning that front issue until five PM mountain standard time for the following county Coconino Arizona\n[noise] [noise]\nAround the world to tell you where do they will look good talking to my parents were I flew by lying now [laughter]\n\nI Hope\nThey don't want to\nSign up for\nMe I Know a new\nGiant garbage in the right to pray and why not Purina street\nHas nothing to you know what they told me I find out more than you know because we get only ... ... pm on memory\nI mean\nI Know new giant garbage can do for a parade in St\nLouis or not they knew you know what they do not want to know more training you know because you get old and I\nFeel like I'm On the job but I\nDon't know why would you know what do you know one thing that's on your own home among them picking on me I'm wrong and there were no no\nThat's your choice do we like going to not know Marines are I don't know if you've got to see some of the New York we can\nMake more became a guy like me\nI'm not doing well actually I don't I don't watch me I'm not saying\nThe men watch rather\nThan I Do I\nWant you know go on and on on the bottom I'm On the phone from Don I don't know I just don't go to rely on the phone\nSo [laughter] I\nDon't even know anymore thank God he's he does not mean\nThat you know what they do not want me to get on the up and\nWe don't know why did he or you're going to go on strike on Iran when I'm On my mom I'm sure\nThere were no no no we'll just showed up on food on to me that we didn't um I don't want it to be calm sometimes make you\nWant to come in the New York so we don't want to do more to lose your\nShirt on who you're going to check on my on\n\nMy phone number one and you know saying oh yeah it's really a big fan of the [noise]\nOh my God the [noise]\nAh\nThe um the main he you know the phone and said oh no no maybe in a\nFunny ha ha ha ha\nHa ha ha ha\nHa me I'm not saying oh\n\nLet me thank God my main thing\nTo me oh you\nMean oh [noise] to a\nMan leaving oh yeah yeah it's really a ... in a\nRow team and a nice\nHome I'm I'm I'm\n...\nI don't know I'm a ha ha ha ha ha ha ha ha ha\nHa I oh I Know I I I oh why oh why oh why oh why oh hey\nI oh I uh I Do\nSo and I knew that I Do get a bird and a bird Magid yo ... me through\nA job yet the board member oh oh oh oh oh yeah\nHa ha ha ha ha ha ha ha ha ha ha ha ha ha\nHa ha oh oh oh yeah oh yeah oh I\nI oh I oh yeah oh hey I oh yeah oh yeah oh yeah yeah I Do I Do I owe\nThem from yeah my ... and you know and I do good gr bar or in a bird that magic ... me\nA note there or a bird I heard I oh I uh oh I\nGot a a ha ha ha ha ha ha ha ha ha ha ha\nHa ha\nOh I Do get to the war\nOn terror and a bird\nThat magic ... ...\nA no go ahead there or a bird I heard I L O R A L I N\nO da da da da da da da da da da da da da da\nDa da\nDa da da da da da da da da da da da da da da\nDa da\nDa na Gurdon\nManaging you why am I didn't mean\nTrue of a job there or a bird I Hi oh I Know I Know my uh\nLa la la la la la la la la\n... and I I Know a dog or\nA oh why oh why oh why oh why oh why oh I Know I had an old\nMan a new one in a way to the board I ever and ever and that and then you ... magic me throw", "show_name": "no_show", "year": "2018", "city": "Hotevilla", "day": "03"}