{"month": "10", "state": "AZ", "station": "KUYI", "content": "Mhm [noise] [noise]\n[noise]\n\nMhm [noise] [noise]\n[noise]\n[noise] um [noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise]\nWell in a new\nOne and a ... who\nWho oh\nLay a non you know hey I'm not actually on a we have a tree honey\nTo who we actually uh see I don't know who\nI Am very nature he uh he he\nNamed whoa whoa whoa man you know\nI Know um\n\n[noise] [noise] [noise] ah it's\n\nA bad mood in uh\nIn any time for a low oh a ... a while a following a a\n\nFine\nLine you know was James ... was it in a a a woman\nWho or what oh and\nA whole okay and I and I I'm going to a club\nOr a\nWhole or in\nA a a a a a ... a ... a a friend of\nMine\nIn front of the other thing that was John John\n... or ... or ... uh uh uh who\nOr almost all in a a a ... I ... I\nKnow\nWho knows who\nHe made a hell of a whole a whole fan I I\nKnow who\n\nHe knew he fell off a whole okay a all over the year and a half a hail where you know I say I am a\n... or\n... or\n... where are all in\nA in a ... a ... a lot of things I was a ... a friend and I I\nDon't know\nIf I say it was\nJohn John was saying in a while if you're in a a whoa\nWhoa whoa whoa whoa whoa oh in a a whole okay I and I had a a\nNew\nRules how\nIt how all ... all had I had a a\nNew\n\nName giant hey ho ho ho ho heavy guy a hail all\n\nMm Mm\n\nMm\n\n\n\nMm\n\nMm\n\n[noise]\n\n\n\nOoh\n[noise]\nMm [noise]\n\nMm\n\nMm\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\nMm\n[noise] ooh [noise]\nMm [noise]\nMm [noise]\n\n\nMm\nI'm\nOr ... or ... or any\n... or ... or ... or ... or a\n... whole yo yo Dante ...\nPolio ... we are a hero\nWho\nPlays ... Johnny ...\nAlright welcome back to Kenya why he concludes our\nIn your car and my question was how would you like to say no more no\nThat's one thing again we were long enough to be here today to be a short interview on the\nThe release of the that's the title of the album and his team that you know that a lot of the\nTime to interview here in St Thomas the crew that you are today and I'm Bonnie ... manager will be foundation and I wish everybody out there well they a lot\nOf our prayers and a whole\nTogether so that when he was the rain here for our lands on here and I know we're all ... ... activities and let's keep on heart together no that's the purpose work so I\nTry to maintain our behavior maintain our respect maintain what\nThe leadership told us and not the only way I think things will come to a ... all one way and um that's that's what I Want to say if I don't know what the deal also somehow my thoughts and your doctor or by Cleveland none of them uh what's that ... talking about you know\nThat the dog we all like ... not ... rotten all the sudden like in a ... not ... why don't\nWe wouldn't be in the in get knocked up to ... I was young captain like when I'm ... now you can put him on the ... not the only thing in my life I'm not thinking when you need to know my mom got probably are like ... ... ... ... ...\nIraq that kind of ... ... ... and Michael Hi and thank you again for how many ... why I mean you know and that's our ...\nThat's our ... come up come from I think you will get how many ... why I mean you know and that's already in your car and I knew I listen to the Y. I Hope that\nA new one and and and he was like I Am the upper more me eighty nine point one at a project in nature you know like they can why a ... a Native American from the great\nFor us listening to KU I I don't know any eight point one S. N. N. K. U. L. I. L. P. apartment I'd be eighty nine point one aunt and how'd you accept the Hopi foundation assuming I'm mine at key you I I I\nMust be under your good work out you know not not not talk circa you're caught on with it I'm not W. W. W. dot K. U. I. dot and eat the young\nLady pot you know the you know by none of that book\n[noise]\n[noise]\n\n\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\nHello my\nName is ...\n... or ... or ...\n\nOr ... or ... yards or who they are in a way in China\nOr\nOr or or ... you know who\nThey are here we are in a job you know who is the uh the uh in a hot no ... no ... or\n... or\n... or\n... or\n... or ... who is\nA ... ... ... ... is a man on\nThe line or a\nOr a ... ... ... who who who we\nHave a ... a man named John ... who he uh he uh he ... you know ... uh I ... and\n\nI have a a\nYou know I ... a\nYoung high high heels from Iowa Ohio Ohio Ohio\nAnd I think you know a A R a I have and I\nYou know\n... a A R\nU ... will tell you you are oh ha ha\nHa ha ha you also I Ohio Ohio Ohio\n...\nNa hey I'm ... Ohio ... and hang on China China or ... or\n... or ... I asked Jonathan ...\nA man who is a man on a road in a in a man on\nTrial or are you I'm I live in\nThe O. J. or have a hearing how did you oh you have a\nHave a man named John ... shows I mean you go higher ... hey I'm ... and\nYou know\nOn a\nHigh ... who he is he\nA\nYo yo yo yo yo yo yo\nYo ... here in New Jersey I'm\n[noise] low or\nNo\n\nNo no one it was ... for a long long on\n\nHaiti\nOh on the line on on a ...\nA ... you probably know run away from the time and\nIt is certainly he does things in a\nI like swimming around that time\n[noise]\nI mean [noise]\n... [noise]\nI mean you know you can join [noise]\n\nWilling to him he was removed you can\nImagine [noise] [noise]\n[noise] [noise] [noise] um [noise] [noise] [noise] ...\n\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise]\nWell you know ... how close\nIs really a a new\nRules oh\nBoy yeah on a new house and I have a a ...\nA ... a ...\nWe really are or do you have a say a gene a job I have\nA ... day and age or the or any and\nEvery ...\nUh I'm\nMust be your doctor or you know not not allowed to talk for circa ... ... well yeah there was a lot\nW. W. W. dot ... dot and the young the [noise]\nI um [noise]\nRight yeah oh yeah [noise]\n\n\n[noise]\n\n\n[noise]\nYeah\n[noise]\n\nMm [noise]\nMm [noise]\nRight I\n\nWill never\nKnow\nWhat's going on\nRight\nNow\n\nAnd then turn around and you remember when\nI when you go from\n... in man\n\n... ...\n...\nHave imagined that game and then\n\nI asked right and then you can join\n\n[noise] [noise]\n[noise]\n[noise]\n\nI mean you know he may ... ... [noise]\n[noise]\nMm [noise] Mm\n[noise]\nMm\n[noise]\n\n[noise]\nMm\n\nMm\nMm\nMm Mm\n\n[noise] Mm name a man named ... and\n\n...\nNa na\n\n\nNa\nNa\nNa na\n\n\n\nNa na na\nNa\n\nNa ... right right\nRight [noise]\n\nOh the whole the whole\nA whole\nA whole\nA whole a\nYou are listening to tell you why I hotel eighty eight point one Afghan and K. U. L. A. I. L. P. up at my copy eighty nine ... projects at the Hopi foundation streaming online at K. U. L. I. I. dot net your Native American public radio station\n[noise]\n\nI remind you won the Jamaican lottery my money and mine are high\nAnd evening my name is Paul sitting Emily tonight with the eye of the justice services in recent years we become the target of many phone scams now seniors and others are receiving calls from an eight seven six area called congratulating them on a winning a Jamaican lottery or a new car it's against federal law to play a foreign lottery\nSo if you get a call it's likely scam scammers guy ask you to send money or your winnings our car can be delivered to your home even identify local landmarks to make the frog more believable they'll direct you to not tell your family to make it a fixed price they feel they hook the protests\nIn March to make the prompt more believable they'll direct you\nTo not tell your family to make it a big surprise did they feel they hook the potential victims ... increasing frequency often resulting in hundreds of calls its cameras requests your money through Western Union or in the creative ways like putting cash in the magazine\nNever wire money to anyone with whom you are not familiar never provide anyone with your personal information bank account pin or Social Security numbers chick any unfamiliar to recall before returning called\nContact your phone service provider\nLocal authorities or the Federal Trade commission to reporting potential scan for details you may you visit the world's eight seven six dot com\nBrought you in partnership between the Hopi police department in the radio ... point one\nOn one happy ... this is wrong with the items junior so no\nAround the ... village and you put your shrine Adams up there in South Dakota you're listening to to you I I eat eat only one that's been open radio streaming online at ... dot net Native American public radio station\nTo congratulate the she does in Fifteen boys cross country the champions and try to be a part of this great running tradition we started back in Nineteen Ninety and also like to say hello to all my relatives back you're on the wrist\nAnd there's all these guys in the well you guys you talk to you often hear all related\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise] [laughter]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[laughter]\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n[laughter]\n[noise]\n\n\n[noise]\nNa na na na na na na na na na na na\nNa na na na\nNa na da da da da da da da da da da da da da da da\nDa da\nDa da da da da da da da da da\nDa da da da da da\nDa da da\n\nNa na na na na na na na\nNa na na na na na na da da da da da da\nDa da\nDa da da da da da da da da da da da\nDa da\nDa da da da na na na na\nNa na na na na\nNa na na\nNa na na na na na na na na\nNa na na na na na\n\n\n[laughter] [noise]\n\n\n\n\n\n[noise]\n\n[laughter]\n\n\n[noise]\n\n[laughter]\n\n\n\n[noise]\n[laughter]\n[noise]\n[laughter]\n\n[noise]\n[laughter]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\nAnd she told me not to say she just got back on say\nHello my name is Tim Duncan my name is yellow bird dancing I'm from Mesa, Arizona but who dentures and tune since\nI was five years old and so he could have different albums with Kenyan records you are listening to KU why I hate the Twenty one that's him do you mean on line that can you why I Don ... your Native American public radio station project of the ... foundation\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\nYou are listening to KU why hotel my eighty eight point one FM and K. you why I Know the upper ... eighty nine point one FM projects so the whole piece on nation screaming on line at K. U. I. dot net your Native American public radio station\nWe\n... we didn't tell you when I knew they were saying I Know ... ... who's ... among them eat and then in the\n... only ... ... ... loan Muslim took to mean we can give me your name was on the news on the two main trunk my nose you know we're doing a ... year ...\n... people should have been over ... ... ...\n... what I mean some daylight savings time warm up you know ... ... what do you not daylight savings time this is a huge either DJ back in the studio\nIt's been a while I'm quite quite a few changes here and um my numbers looks good Bye bye mum nice and um I figured you know what the heck I'm going to go up and I'm\nWaiting for music for you guys for a while my number one I mean are you ... Maryland\nI figure you know what the heck I'm going to go up and I'm\nLisa music for you got ... when I have to know the more men can now buy some beyond the\nOh my name on the computer ... he just might not be in the movie though most of the ... ... ... ... you know we talk now with my ... my place\nAmong the rusty orange\nAnd play for sounds where do you buy an artist named Jim ... and um her son will be now when for ever after that we'll be memories\nAnd then a stocker up their\nDiamond girl and after that we'll hear from Julie me back from my my my my collection of music from a Native American site so enjoy the show this is our our\nKaleidoscope well usually kaleidoscope so so long as you're just a mishmash of stuff that I got on my laptop and they'll probably get to our our CDs appear and let's see but I still remember how to operate this machine and all the stuff on his trip to stop\n\nBy the current owner\nI'm trying to figure out which I Know this goes on with the\nWhole you know that started all over again shall we this is now in wherever\nI I\nI ... I don't know why I don't see a problem for\nYou I I uh I I did and um I don't know\nI Know this is a million dollars is a\nMiami I live in a house and I know there's an hour is on the ...\nUm is you know\nI I'm ... I had a million dollars a day\nAt a ... a ...\n... ... you know\nThat you know I'm going to some of my\n[noise] ... yeah I mean I'm I'm ...\nI'm I'm a little more than\n... when I hear ya I I had already out there and they had\nA I'm a I'm a I'm a I'm a\nI'm a I'm a I had a ... you know\nHow old are you\nHow long have you know you got the family you know much about you\nKnow ... you know a normal phone\nMy raising the conversation I Know now they're like you know\nMy son and already you know the only\nWay I Am I in a minute I ...\n\nI mean yeah I had\nA million dollars is a ... ...\n... ... ...\nYou know on a\nPlant and I'm I Am a you know I honestly I\nDidn't uh I'm a I'm a ...\nI I ... I had a million dollars on\nA comment oh no\nWell I mean I\nDon't know I'm and I'm ...\nI I I I\nWas a man on a\nOn a holiday that it\nHas a ...\nA crime\nOh man I can tell you how nice of\nYou know ... ... no\nOne has already been economy that right yeah you know ... like you know\n... ... no ... on where you you know\n\nWhen you know I\nDon't know\nI don't know who may you know and I'm like oh man I ... I have no money\nYou know and I'm like oh man oh yeah well I I\nKnow my ... you know mom and then on\nFire you know I don't know I own\nA home in ... in all I Know how long were you know there's only I\nKnow you know I'm In Oregon\nYou know ... years\nOld uh you know ha ha you know and\nI\nMean you know I ...\nI don't know man oh man I Know my own way you know I Know one way or a I I Know you know I'm going\nHome and uh you know when a a you\nKnow ha ha you know a lot more in\nJust a man or pay a Manx man\nOn Iran or God I Hope by the again so I'm a I don't know I may come a long ways uh you know and\n\n... you know no way to go and on and on and on a regular old man\nOh no no no for a ...\nA young man all go away and I am a man oh no no you know ... ...\nNo no no no and\nI always\n\nSay oh man I tell ya we all go on and on and on the old\nMan oh I Know there's no way oh wait oh well I Know I mean I had no way than I Am and I know a long way yeah yeah yeah it\nIs also a ... a you know I'm\nParaphrasing here where I Am saying is that when they say they go\nOut to the root cause Don style I Know a lot of ... you know\nWhat I'm saying they die and then some job fine and I'm late and like you land that was\nMy fine and I'm Don ... from a A N\nO ...\nO we seven twenty appear to Key West and it was and this is a he ... the G\n... he's with a bomb happy me diamond girls that much you know ... ... ... you might have to clean Julian Denny I'm wanting to do another for as long as the NRA was in here for ... a song called nibble I'm eight years\nAnd then you have thoughts could speak\nCosts like clean and I'm probably love\nDude will be up for some and then after that\nWe'll see what else I have learned up for you all and um\nI think cars going back and forth on I can you can actually see the traffic well I Can't see this nighttime but anyway I Would choose the spores right outside the door\nLike liberal feet away maybe out and about please be careful what was her which I'm from the rain that we've gotten thank you very much we can do it's nighttime so be careful out there don't go too fast\nTime you'll get there and you can never say leave you don't rush so if you're going to go somewhere we choose to leave when he gets there right we man no I'm Talking to myself [noise] seven twenty two okay one key why ice to use\nAnd um so now let's move on to union Denny listened to their songs and then from then we'll see what else I play\n[noise] [noise] [noise] [noise] [noise] [noise]\nWell\n\nI'll I'll I'll I'll I'll I'll pay I'll die\n[laughter] I Know I don't know\nIf I may I say oh I Know\nOh it's a it's a trade off a bomb to wait oh I Know we all play yo yo yo yo yo\nYo da da\nDa da\n\nDa\nDa da da da da\nDa da da da da da da da da da da da\nDa da da\nDa da da da da da da da da da da da da\nDa da da da da de la ...\nIs pretty old\nOld\nWhen all\nThe\nWay I Try\nTo find out a way of a mile to play all the all the time all over our praise\nOh I play a role\nPlaying or they may pay off all over all the all laid off now I don't know\nWhat it's all a\nBit when\nI'm not\nI'm not pay it all said oh well all the all play along very well but it all\nOff a parade oh\nWhat a magic moment for me to speak up for the girl so why do they live for a two off duty I'm never for just a moment when I made it through the thing is a\nA boat pardon my pay\nAt all [laughter]\n\n\nWhoa\nWhoa whoa whoa\n\nWhoa\nWhoa\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\nWhoa whoa\nWhoa\nWhoa whoa whoa whoa whoa whoa\nWhoa\nWhoa whoa\n\nWhoa\nWhoa\nWhoa whoa whoa whoa whoa whoa whoa\nWhat is it do to stop so really\nThey put a oh\n\nWhoa\nWhoa whoa\n\nWhoa whoa\nWhoa whoa\nHo ho\nHo ho\nHo ho\nHo ho ... a A R pay a whole day or a a A R a oh hey hey ho\nHo ho ho have a a you know who you know I Do\nLook good so you are\nAll those things so tired waves\nTo gather their yo hey a A R but now that we're close\nTo the stars so you know while a son my mom a lot probably yo\nYo\n\nYo yo\nYo yo hey hey hey hey hey hey hey ho ho ho\nHo ho ho\nHo\nHo ho ho you know she asked me\nHey ho ho ho ho ho ho ho you know hey hey ho ho\nHo ho\nHo\nHo ho ho ho\nHo ho and yo hey hey hey ho ho ho ho ho ho ho ho\nHo ho ho ho ho\nWhen you look good so you are I heard\nThose bank so tired that way is to gather every oh a are we are right now that we have a son so ...\nSo you do do a song mar a\nLago who you know you know\nFor sure what to\n\nDo ... ... no one was way below zero\nTo\n... to ... you know\nSo why not ... when I'm doing those things you know ... ... ...\nNew ...\nHer life size Rhonda Randall don't know I don't know\nWhat is the way to\nSay how are we going to ... to to call me Randy ... going to have a [noise]\nA five or five of us to see some of them for a long\nTime\n[noise]\n[noise]\n[noise] [noise] [noise]\n[noise] [noise]\n\n\n\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\nI'm like I\nSaid you know I just I Want to see\nThe trends in\nBecause it has to do I do [noise]\nI sue ... electric ranch freaking mom show\nHere in Charlotte airs refused to\nLeave you alone let one battle [noise]\nI Do believe we shall see videos you may as well as you always slightly she re\n\nRead my mom my mom says the\nDa da da da da da\nDa da da da da da\nDa da da\nUh oh\nGod [noise]\nThe the new\nThe\n\nNew ...\nNew\nA\n\n\nNew movie um\n[noise] the\nPoint is in your own thing I Want to watch the news [noise] nine oh one piece\nIs there anything\nYou want to watch the news [noise] nine or run him maybe you're\nOn the right time once again the aging a DJ holding down or where is your um the jokes no highway eighty seven and we're up to six for our phone I was counting cars\nBut that's our last caller why [laughter]\nAre we know\nWho might be going to look like when you are listening to your oil ... FM in January I al ... upper ...\nProjects of your piece foundation streaming\nOnline or can you ... your new American Public Radio's do show\nHey you were so that was um ... no ... um\nIs there anybody out there ... ... ... you know what I'm saying that the people go driving back and forth maybe I'll start counting again I don't know but anyway I got one more from being poured\nYou do with\nYour next after that we got promoted group coming up from your ban a book on the news from whatever group when\nI'm channel or Morocco and changed our governor movie about some tuned to it but when the ... over to our dog ... on the Internet or Internet for one of them are like one of them are\n...\n\nHave you been out for the people getting you know getting oh can you you\nHave you\nBeen ... making love and you do you mean\nHey you\nDon't know them to bury a\nShow ... without the light\nOr a\nUm a war on your own wedding day by the ball out made\n[noise]\nI guess the ... when most don't want to call out of the\n[noise] uh\nI Would you help me to carry 'em\n\nOn your how or how common\nAre [laughter]\nEm eh\n\nHa ha ha ha ha ha\nHa ha ha ha [noise]\nI'm a\nOne dollar in a a um a lot of your house you know\nI'm no matter how dry heat and I'm not sure I'm a well they do now when I ...\n\nAnd [noise]\nAnd [noise] [noise]\nOh my God how many people [noise] oh my God I'm Tania how\nAll\nOf our own [noise]\nOh I'm In a way um\nOh yeah\nYou can change the change in\n[noise] and on the national wage and ... ...\n...\n... he can\nAnd\n\nShould be changing\nNow and she's been challenging to John and John's on the line change change\nChange by a huge change [laughter] [noise]\nShe she she she didn't want [noise]\n\nAnd and and on you know and I and a ban on them\nAnd they see and I'm a pretty good how are they\nAnd and the na na na na na na na na na na no news and ... and and they do not but I Know in in in ... na na\n\nYork and\n\nSo\nUh so\nUh [noise]\nOh no no no no no no no no\nUh\n\nWhen I Am a ...\nFor a\nOne way I Know you don't even know me a little bit\nOf a a a\nAnd Iran has no matter what no I wouldn't say no no no no uh and and oh\nMy God oh now I Am today or on our now and I'm a I'm a ... on my own name in a a\nA a young man now and God no\nNo no I mean there was a ... na na\nNa na na na na na na\nNa na na na na na na na na and Aa River and we were in Iran or ah\nOr rather than why we're there in ... ah yeah\nI ... and a man named ...\nWho died in a bad day\nAnd all around [laughter] you know and ...\nAnd on and when you in right now I'm In ah in my view on ... hours a\n\nDay or a\n\n\n\n...\nOn the other guy\n[noise]\nAnd I\nDon't I don't know that\n[noise]\n\n\n\nYou know [noise] um [noise] I Know who your family or whatnot\nRight [noise]\n[noise]\nYeah well no no ma'am\n[noise]\nOr or a [noise]\n\n\n\n\n\n\n\n\n\n\nA horrid November Rain from no\nGovern roses almost didn't get burned during their name [laughter] before that we heard from 'em guns in rows\nUm and then before that it was a was among the coup\nSo moving on into our music ... Jimmy Cliff coming up rowing Ricky fan I can see the ... the rain and then uh from way back in the beginning but digging in the creek\nI Need ... to ... and then after that a third world with ... ... ... ... ...\n... ... ... ... bank on us to make you move south somewhere where we\nYou know when they do when no one one the one that's watching me ... all over your life you're listening to [laughter] anyway this is\nJanuary I ... I ... I Wonder if they're mainly you are on the Internet\nOr you ... I don't\nThink he's very much for you to ...\nNo ... radio station\nAnd this is our Glasgow show and I'm just saying whatever I feel like going into\nAnd they were taking on a bus to go from there were some of the loop which\nAre a lot more common where am I represent like shirt on and you know we're rather than coming from\nA\nFamily member or friend showman free and that's when you just know la da dum who may be a\nTime when they see a stray and they were you you'd be waited on the ocean and dying I Do I think\nOne of\nThose [noise]\n\n[laughter] [noise]\n[laughter]\nMy son and I don't know if you are no longer in turn around and make\nSure I took my gosh you know this\nGuy and I'm Sorry that\n\nYou were saying and dying at the very\nBrilliant\nOn everywhere in the trees and right now\n[laughter]\n\n\n[laughter]\n\n[noise] [laughter] [noise] I\nThink it should be kept you can [noise]\n\nDo you think [laughter]\n[laughter]\n[laughter] [laughter] what do\nYou do if\nWe can change if we can learn to\n[noise] [laughter] [noise]\nI Want to find out that might have to have to agree\n\nAnd I remember I think a great\n\nYou're sort of agree\n[laughter]\n[noise] [noise]\nOh not too long [noise] [noise]\n\n[noise]\n[noise]\n[noise] and\nThe only one in Maine man when your panning down [noise]\n[noise] [noise] [noise] yeah well\nEight year old man he knew you on the line\nWow man\nThat bottom man oh\nMan yeah\nHere\n\nWe um you know did you hear\n\nAll\nThe all the time they said well mom thing he does and you know one [noise]\n[noise] [noise] [noise]\n\n\nOh hey I'll be paying them away all the time [noise] you know green\nNa na na na na na\nNa [noise]\n[noise]\n\nOh\nMy God damn\nLong here on you\n\n\n\nKnow\nRenee ... and it was nice where do you have you on your life every time I feel like I Can't remember but anyway if we are it's like forty nine forty nine now so that was a marriage you lived with\nMy wife ... got some ... hip hop artist that do you make your parents not to the next week in or if you don't ever Ninety or get a nerve because um\nRight [laughter]\n[laughter]\n[laughter]\n\n[laughter] [laughter]\n[laughter] [noise] [laughter] [noise]\n\n[laughter] [noise]\n[noise] [laughter] [noise]\nI Love to do that and it made them feel alone in yeah\n\n[noise]\n[noise]\nNo I came to that kind of the car and now it's no fun to me in a navy you know I Know I mean\nHow long\n[noise] [noise] [noise]\nOutlook on it you know that I get\nOut and she said what are you wrote back relax land it would probably have to talk you know and\nGo when we were so when they came we may have been on the capital of the ... my ... my three didn't take the money that I learned about the time the problem but ended the motto in for him again\n[noise] jeeze [noise]\nUh [noise]\nThat'd be the very beginning and for some\nTime\nWith my brother\nIn law is really\nInteresting you know\nWe don't know I don't know\n[noise] gee I don't\nWant to like the whole law\nShould\nApply to buy insurance [laughter]\n[noise] [noise]\n[noise]\n[noise] [noise]\n... and as soon as they did a DJ holding out for a will be better than going up to nine PM but I'm going to go a little bit over a got a couple of phone blend up oil is um\nI mentioned earlier we started out we you know he has come under ... oh you're close by [laughter] so but anyway uh welfare mark Morris than returned them actually and that was a school for ... and the rain any nukes and\nEverybody in ... on that and this is in the background to Charlotte may have missed the ... and you are listening to ... I Hope your lady for one of them and can you what I Want you to hang on one of them\nAre just stuck in hopes foundation I mean there are a lot of K. you why I don't ... your Native American public radio station\nAnd not considered a balloon let's see your ... and yeah but I don't know a bit rusty and we'll\nBegin with a laptop and nobody loses a okay in anger at Cannes ... pay a little kid in a little while and then then I'll hit on the door\nTo know when you're ready for work tomorrow when food we eat party I have been all about some of the bone holiday and the poor are having a we are not having always anyway indigenous peoples have small right are we not the other guys the\nIndigenous people stay more real\nFor Russia mock them or whatever\nAnd we are so anyway let's get back or for the music while I'm so ... so to me Mickey DJ with um [noise] in Johnny ... from the north North Korea forms the ID I don't know I think [noise]\n\nTomorrow if Russia mock them or\nWhatever we are so anyway let's get back to the music while I'm so they can either make Mickey BJ so Johnny ... from the north North Korea forms the ID\nI don't know I mean [laughter]\n\nThere's a new bill and now they really can't stand them in the keypad that oh oh\nOh I Want to\nBuy New York times and now to the bank but then bombed them make him take you back on\nA on a\nFriday night and nobody can add in the main line where bombs are they miss the Cold War you know we can either down one way or that in my hand and hay\nAnd then the day\nThat you can get in on a long long time oh no no no right\nNow we know came to mind [noise]\nNa na na na na na na hey hey man I Know\nI'm going on and\nOn and you know thank God that we may have shaped the way I Know\nOh why oh and\nBy then and only can can jump on the line well yeah but not you know they do call my friends say no we get down man come on man hey\n\n[laughter]\n[noise] [laughter] [noise]\nI'm Sorry I didn't make a good time to go about my roommate at one another part I didn't mean to me like I'm going to be the line when our number one number one I'm a memorial to Laurie Laurie\nI'm running on my on my mind that I met my now my mind that\nI Know one one one one one\nOne one then\n[laughter]\nI Know one one one one one one one then\n[laughter]\nSorry sorry I didn't mean to Laurie Laurie mandatory mandatory reporting on the line [laughter]\nAnd then [laughter]\nAnd now that now\nAnd then\nMy dad [laughter]\nMade an area where you don't really know\nWhen I met a fight on the line by line at one point on the line mandatory mandatory remained good line I won't go for it I really don't want to Laurie Laurie [laughter]\nUm I met him by not by now [laughter] [laughter] [laughter]\n\n\n[laughter]\n[noise] I get better [noise]\nI get better [noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\nHe he you know you're you're gonna miss me\n\n[noise] [noise]\n[noise] [noise] [noise]\n[noise]\n[noise] [laughter]\nA lot to do a whole lot more\nAbout the way it is\n[noise] and [noise] [noise]\n\n[noise] [laughter]\n[laughter]\n[laughter] no [laughter]\n\n\n[noise] [noise] oh\nNo no\n[noise]\n\nOh God he was changing by a chicken\n[noise]\n\nOh no I don't\n[noise]\n\nYou know he was changing owned by\nThe time it's a change in a way and I was in the middle east I think\n[noise]\n\n\n[noise]\n[noise] [noise]\nThe average [noise]\nTrying to think that we have one in Maine will be here\nWe have no one\nElse can we do today I don't know [noise] it's a real real\nHappy [laughter] [noise]\n[noise] I haven't\nHeard a guy and [noise]\n[noise]\n[noise] oh my ... year old and although I'm\n\nNot sure I don't know [noise] [noise]\n[noise]\n[noise] [noise]\n... where\nAre you coming from you [laughter]\n\n[noise]\nAll sweet spot on Mumbai stowed away jobs I live in a row that sounds great\n[laughter]\n\nAll sweet spot on Mumbai stored away jobs I live in a\nRow that that was great uncle\nJoe with like talk of when I got is that of Robert could walk around a little bit out there should be ... do ... do I have that I got it they would oh wait until it was just one\nOf the oh this is this a little girl my way to do a lot of wild [laughter]\nWow [laughter] a whole\nList bought them blocked off line up a Little Rock where I Would love to hear about this yesterday as well there's not that old\n... been with this guy so we started out one thing that I was not a key in the ... it was a little bit about what it was about ... say our baggage Bob during the war like why do why [laughter]\n[laughter] wow [laughter] wow she say\nAbout the only way that they have the money right [laughter] right by Ron ...\nThe mental game is about the law [laughter] still though I took that you know what it was no fun I think it was that a lot of ways that when I went on\nFor a while [laughter]\n[laughter] okay [laughter]\n\nRecovered [laughter] wow [laughter]\nGood I'm Still a local bar and you know what I was there was a great day in the last year but now what does your shows me the wrong\nWay to ... know\nWhat I really ... de la ... one thing I think it'd be too I just I [laughter]\nWas [laughter] [laughter]\n\n... and ... and that kind of gave me and said they were standing\nAround and there were a per mile per hour [noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise] you know to tell him you know when\nWhen general than any time you're on the label o da lay on the on the other\nThing one day and night and I'm Wondering you know I'm not going to find the\nRight for a really fine and the real thing on you know\nThat it is a man and gas and\nRape and they said they said that they may they may\nNot be\n\nAlone [laughter] um my parole\nYoung young they gave me a chance to make a real gumbo and they tend to be on a new pope and now we now\nKnow the ... ah ah you\nKnow and and I spent\nA lot longer\n\nNo no\nNa na na\nNa\nNa\nNa old assumed manner to me and my dream\nMy whole you know well a new thing are you waiting for so long to lead you\nTo a huge change\nAnd all day long\nAnd the song do lose July a dumb Jew and ran and you may or may have made you think there's a chance\nTo later I'm a ... job you home\nOh\nWhoa\nWhoa so much that\n\nThat was ... about\n[noise] um\n[noise]\nAll right ladies and gentlemen boys and girls\nHandle one appearance he wants to eleven or one PM if you're on the last time we are still saving their life to darker so as soon as they did a DJ signing up for you and thank you very much for tend to ... to ... I Hope LA for one so\nI Hope we all enjoy the music that played a little bit of everything I get a chance to play a lot of countries that maybe next time I come up I Will pay a bunch of country I\nDon't know we'll see what you want to come up yet but thank you again for it to me and you are listening to ... I Hope the lady from one after him and tell you why else the upper ... up the eight or nine one one Afghan project up the Hopi foundation\nStreaming online ... was Native American public radio station [noise] if you are still out there on the road the leaker who drive carefully don't speed eyes on the road and you'll get there safely\n[noise]\nAll right All right I'm going to switch over to open up programming which is already barbers and then you'll hear Randall in the morning tomorrow morning car with the law by ... [noise] she wakes up in a way to go [noise]\nThe managers but that don't allow the citizenry hold on this by the way that\nWe've got to get on my hands in the west and all that okay on my living room [noise] no\nNo no no [noise] new this is the you\nKnow I don't know [noise] man in the\nMiddle because again a lot of a young age is ... very simple beyond the uh\nYeah you know on a day\nIn the news business not the ...\nThe low by they know what do\nThey do but you know why they\nDid agree and I love a judge a newsletter that goes beyond the law was shot in the eyes and Amanda ... with the low I was a day and you know when my\nMom who really didn't know the the the two women\nSo I'm trying to you know one day\nThis is the ... ... ... ...\nOh yeah well you know when you want to get away with one thing about why they work and we all day\nAnd I work ... like you were to go way back on the weekends\nAnd when I come to that that's what they say they love lament the gas in the world to the beach\nI like the lord of the war on the run of America as otherwise I'll give you more than ... they'll probably by larger a man named ...\nWho may look there are those are the result of the ... about where to go look a little\nBy little you know a day\nYou know people do that is that the two men on\nThe low right now in\nThe region the neighbors\nThe low right they do do a day or\nThey begin to lose it and you\nKnow a five day on the news\nOn\nA on a on our on\nOur plan that come\nOut and then when they came\nOut and run by cutting back not paying our Congress longtime rival by now wait on them when\nI you know I mean\n\nCome on cry on how a bomb and try and do their thing and we're\nGoing\nTo tell me where no nothing at all the time when I Try\nNot to be mad at you know we had\nAnd [noise] [noise] [noise]\n[noise] [noise]\n[noise]\nOh I'm blown away by now they can live in the back of my you know\n\nHe just told me how to how [noise]\nDi di di di di di I Try to try and [noise]\n\n[noise] [noise]\nBorrowing without land on\nA on a\nA a\nA R a\nI\nLive in a way I Am a run around a lot not a bad guy last night after a\nHeart attack on a relaxing on a on a lot of I don't know how I Am now a\nLot of anger out on a round of our ...\nOr na na na na na na na\nNa na\nNa na [laughter]\n[noise] [noise]\n\nUh uh uh uh\nUh\n[laughter]\n\n[noise] [noise]\n\n[noise]\nOh\nWe're going to be [noise] [noise]\n[noise] [noise] oh\n... oh hold on the\nNews [noise]\n[noise] [noise] ... ...\nAnd ... and in the desert [noise]\nAnd [noise]\n[noise]\nOh no no no\n[noise] no no no no [noise] [noise]\n[noise]\n[noise] [noise]\n\n\n\nHe\nHe he he [noise]\n[noise]\n[noise]\n\n\nI had I hadn't gotten and [noise] I'm not that big\nYou know [noise] [noise] well\n[noise]\nWell [noise] long Kevin [noise]\nYou know [noise]\nNa na na na na na ve and um [noise]\n[noise]\n[noise] well no\n\nOne wants to come in a long long time [noise]\n\n\nAnd um [noise] that that you know\nAnd [noise]\n[noise]\n[noise] [noise]\n\nNo no [noise]\nI I did not at all [noise] [noise]\n\n[noise] [noise] [noise]\n\n[noise] [noise]\n[noise] [noise]\n\n\n\n\n[noise] [noise]\nNa na no but I don't know\n\n\nNo no no no I\nDon't\nKnow [noise] [noise] [noise]\n[noise]\n\n\n[noise]\nOh\nHow nice\n[laughter] [noise]\n[noise] no [noise]\n\nNo\nNo [noise] [laughter]\n\nOh really oh [laughter] [noise] and it may be number nine very well [laughter]\nSo\n\nWhy why why why why why why\nDon't you know let's see [noise]\nYeah that's what I mean\nTo you know I order\n\nDiner I\n\nKnow that you're married\nAnd I don't know what to do it on the\nAir or when you know\nFor a\nMan I'm dying to change and why [noise]\nNa\nNo [noise]\n[noise]\nI got a lot but I I I live now I Know I\nMean [noise] [noise]\n[noise]\n\n[noise] [noise]\nOr ... or\nSo and\nYou are listening to get your y ... eighty eight going on at them and tell you why I asked the upper ... eighty nine point one FM rod jacked up the Hopi foundation really an on line it gave you why I dont that your Native American public radio station\n[noise]\n[noise] no no\nNo no more [laughter] [noise] [noise]\n[noise] no no no no no no\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\nUm [noise]\nAny any\nWay of living\n[noise]\nMm\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise] [noise] [noise]\n[noise]\nRight na\nLike letting me go\nIn and the thing is we\nAre around ... or ... or or a or a\nNew ... was a and broken live\nThere for\nA minor league in mud Jay into what my blood began the lower ... when I wrote him right now\nI'm going to bring him on the ... the the jokes that are going right now I'm going to bring my eyes that do to bring a roast pig I ...\nOr ... or ... or ... or a magazine or a\nGold star to run burning these little murder dinosaur gold and and and I'll take the river down in the water and brought them back to the dog to the man I'm going to\nI'm going to bring my ... my ... the pages of uh\nYea I'm ... na na na na na\nNa na na na na goals are started by run burning these will learn a dinosaur gold and you know Mm Mm shake the river down the new water and run the fabulous do you\nKnow and I'm going I'm going to bring my ability to bring the change in a in a line going great I'm going to break my day to bring my rusty ...\nAnd ... and you know and and and [noise] and [noise] one\nOf the long term [noise] like God's I leave my life [noise] I don't know what they're going to be under screen and I think they told you are still you know from\nMy daughter came to\nMind going um rent\nIs going to bring him on a road Dick Cheney general [noise] during that time I don't want to bring my joined a wrinkle I received Jane general and [noise]\nI I don't mind going to bring my daughter and my family the John run [noise] for a short\nBreak we'll be able to bring my rusty and ...\nAnd\n\nYou're listening to you I Would rather eighty eight point when the famous J. U. R. A. I. L. P. upper money could be eighty nine point one next bam projects the Hopi foundation streaming online that gee why I'd dot net your Native American public radio station\n... in the same boat\nAnd from a big dog did not do change to bomb\nBomb burdened by a\nBaddie John it's may ... on on the road a pain it's on a man\nOf la ...\nAnd the fence posts iron and a lot and a non ... than a and the ... family around and burned\nOut and buy and well designed it than the shy away\nFrom the time\nThey look at on one of the\nShow today maybe he can and and uh and then the whole ... runs free\nI mean there are a big ... and the\nMain um on on the road bomb through their the de da da da da da de da\nDa da and the fence about an alliance and uh they're not the same to me the name and then John and the bottom of the news about and burned up and they rarely buy just shut\nShut up way\nToo long for a long time\nBecause we needed to produce [noise]\nAnd I have no end to end the fence\nLines I can live not around any saying then die and about is it to the ground and burned out and buy that day\nWhen I'm On the stand up in a way\n\nTo\nDo\nIt again pneumonia and I mean you're right we had a little they would not they know now we're in reading and then\nThey end up calling and I\nDo not when I'm when we even went\nReally well but he knows that the more now than it\nAny more than them and I know but I went to the line then we're not we're not going to\nDo it in the morning you know\nThe man the law and I think that that\n[noise]\n\n[noise] [noise]\nBut then I think that that's just a minute or two [noise]\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\nUh when he was going to get up and you wait a minute to get the girl who made you want to know looting in the long\nRun the yeah the yeah the yeah the one that lives in\n... I had a lot of money on a lot about the ... mine do they know a lot of money and run out no no no you know\n\nThe mole the mole and in in a day that the loser [laughter]\nGood in a little a little more than most people know\nThat they just [noise]\nWhen you when they got out that the celebrate by the way they even made and a half now\nStadium seating Caitlin another did little friend and I made the wrong and I'm David mom does that so long and I don't care and then\nIt goes on in your mom a big long have you found out they just don't have to\nEnter Mariner Mariner\n\nMariner Mariner Mariner and\nThere are no longer and really\nSave money and million ... ... are you going to happen\nAnd then when the wind is granted they know what I found out they just don't do any oh my God how they do your mom and I heard that do domestic to my family is your life you know\nI hear your mom or they all kids you know maybe they just don't do it yeah\nWell you know ... ... mainly just aren't you in a\nIn a middle school and then and then ...\n... ... my mind and no one\nDay I just didn't know who did they think they just don't know when they do but to me\nBut my ... I mean they were um and then in the we didn't use it I mean the ... name\nBut he did when the men do pay day here in ...\nWhen you had no money than the on what our young never make very wrong again\nHe's going to be ... Mikhail none other than the big ...\nHas been I think Neal that they did did you ever been here ... ... ...\nI had no money then you don't know what I was young never mind should run again\nYou know I Know that we hadn't\nMikhail none Murray then\nThe big ... in hand and then the the young women Neal thank you thank you yeah did did you did in the hidden ... no ... no no no\n\n\nAnd\n\n\nNo no no no no\nNo [noise] [noise] ...\nYou know what the heck do you need to do I mean I think that the money then you think the one that you may have known does he does not like he\nDidn't he didn't do the men do\nThey\nKnow the\nMan you know no one was to me I don't know do\nThey do like to thank you day bringing home the men they\nBegan to and we don't know the heroes or you know\n...\n[noise]\n[noise] [noise]\n[noise]\n\n...\n...\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\nWell you know the movie the you know do do run again the moon is another one that you know Murray loan and then just like\nAn angel or month and a number of years and then as the bulls are learning new\nA new ... New Hampshire\nNo no I don't know much more of\nA number of years ago when they come in and do both to learn a new\n\nA new job and learning and ... turned down there but you know against charges or you know\n\n\n\n\nHigh\n[laughter] [laughter]\n[laughter]\n[laughter] [noise]\n\n\n[laughter]\n[laughter] [laughter] oh [laughter]\n\n[laughter]\n\n[noise]\n\n\n[laughter]\n\n\n[noise]\n\n[laughter]\n[noise]\n[laughter]\n[noise]\n\n[noise] [laughter]\n\n\n[laughter] [noise]\n[laughter]\n\n[noise] [laughter]\n\n\n\n[noise]\n[noise]\nMm Mm Mm Mm you\nMade me in a new hobby all come\nDressed to go\nTo line them and you know who to read\nIn the [noise] news we will\nWait a minute your\nKnees\nOn how your uncle ... [noise] your ... to ... you\nKnow you you\nKnow you are whether the\nThe\nNew law is\nNot you know\nThat's one of the\n[noise] each time a long long movie\n... never win\nMe being ... you know we\nNeed to you and my you know\n[noise] and\nWhen you begin to see\nYou know how\n\nTo\n[noise]\nTo\nMe\n\nTo\nCome\nIn one of the\nDrone each time I've sledding\nAlong the [noise]\n\nNew friends and he he beat me you know we do know the\nAllowed me to you and and my whole just like oh\nNo [noise] no\nAnimal ...\nCheese\n\n[noise]\nTo do and\n\nWho he [noise]\n[noise] [noise]\n[noise]\nThis is Randy Moss gala I Am ... village of ... and you're listening to KU I I ate point one FM hold the radio sharing online at K. you I I don't get is American public radio station a project us to go the phones ...\n...\n\n\nNa na\nVe\nTo the movies and\nThere are ... in the new\nYear and a man a\nYoung readers made the voices and the mouse clears your voice sounds bad we just keep\nElementary readers may need to be two years rocks ... they had their ... and ... terrorist shit and\nOlder children may benefit from discussing what they're reading and answering your question about their book what do you think the main character we think we're there what do you see what the central no matter their age help your children develop into lifelong readers ... this is Joe ... president of the Arizona Education Association\nRatings are your children early an awesome rates habit last from like encourage reading in your home but there's been a library frequently and letting your kids pick up books on the subject of interest not feed their natural curiosity what books reading as a habit I could spark a lifetime of learning a message from Arizona education\nAssociation you are listening to KU why what below eighty eight white one F. M. N. K. U. I. L. P. upper ... eighty nine points one FM project felt the ... foundation\nScreaming on line at K. you why I dot net your Native American public radio station\n[noise]\n\n[noise] Mm\nMm Mm [noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise] [noise]\n[noise]\nOoh\n[noise]\n\n\n\n[noise]\n\n\nRight\n[noise]\nI don't know [noise]\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise] I Know\nThere\nThere were\nA matter of\nFact and [noise]\nUm [noise] I just you know China\nNine and ...\nAnd\n... and ... and my\nMom and dad\nAnd I have nothing to do so\nAnd I and and\nAnd and um [noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\nMm Mm Mm\nMm Mm\n\nMm\nMm\n\n\nMm Mm Mm Mm [noise]\n\n\n[noise]\n[noise] [noise] [noise] [noise] [noise] [noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\nMm\n[noise] Mm\n[noise]\n\n\n\nNo no no no no\nNo no no no no no no no no no no no no no no\nNo no no no no no no no no\nNo no no no no no no no no no no no no no no no no\nNo no no no\n\nMm\n\nMm Mm\nMm\nA\n\n\nWhole\n... mhm Mm\nMm Mm\nMm Mm\n\nMm\nMm\n[noise]\nAnd\n\n[noise]\n[noise]\n[noise]\nMm yeah [noise]\nAnd [noise]\nAnd um I don't know I haven't\nAsked us to\nDo is to\nMake that very connected to the next thing I think for\nFor [noise]\n\n\n\n\n\n\n\n\n\n\n... Mm Mm Mm\n[noise] [noise]\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\nI was\nIn a million dollars in Long Island N.Y than some other [noise]\n\n\nNa na na na na na na na na na\nNa na na hey hey man [noise]\n\n\n[noise]\n[noise]\nYou know that I knew that I was going on and on the phone and then I have\nNo idea how they're handling\nOr you can\n\n\n\n\n\nDo\n\n\n\nAbout\nThat [noise]\nOh\n\n\nOh\nOh\nOh\n\nOh oh\n\n\nOh oh\nWow\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n[noise] [noise]\n\n\n[noise]\n[noise]\nAbout yeah why why are you doing on line yeah you know why I got that right yeah right right right\nWell ... down the way for the nerd gay none of the sun shine they I'm\nI'm a ... I took a trip all the names who want to make good on me so well and that they\nWere my mama way well maybe by Khomeini a day my heart just downloaded turning around and I had a really good ... things and a ...\nDown the radio on the same girls when to a pro I must be closer to my heart is a more a man from the new like do they\nGo they my mama way more maybe a little man he a day and my heart is down my head around my I had to leave a little girl and getting them into\nA ... a down in the marketplace you can you learn is cry for a long where\nIs that a fish sunrise the names are not ... by then it I'm a deer well lives that day by law law way\nBlown away by Khomeini a de La Guardia now my head at around my I had to leave a little girl and things and a ...\nYou know\nThe the [noise] um and\nHe he [noise] the the the [noise] the [noise]\nHe he he [noise] nah\nNah nah [noise] jeeze\n\n[noise]\nThe\nThe the [noise] he he\n[noise] he\nUm [noise] you know\nThe change in the name\nMm Mm Mm Mm Mm Mm Mm Mm Mm Mm\nWell one of the time and it was the one that went in and\nSaying you know in the end it was in law and then\nThey had no no no not ... ... and\n... million this show in the hands of God on this trip to China things we do not see the same renew the grants to read what\nThey want to do that no one none of that and one job\nReally is I don't know\nBut I use it it was and then one journey regimes trying to do when you really need to explore tech guy cry\nGeorge managed to see how long a shell because the million trees bringing them but just seeing it will let you cannot change from ... learning about the vaccine na\nNa na na na\nNa na\n\nNa na na na na na\nNa\n\nNa na\nNa na na na\n\nOh my God\n\nI'm\n\nLike oh\nMy\nGod\nThat we didn't I didn't want to show it\nTo the one job you know what I'm saying well what do you do not have\nHad ... oh you didn't stay long you know the ...\n... [noise]\n[noise]\nWell I just don't know why wouldn't you want to thank you very much good I couldn't do we'll ... we'll be arguing they must they get to go with blessings [noise]\nUm yeah I mean I Know who they are are they a way\nI Am a ... a a a a way I Am on a a a a a a a yellow one hey\nHey I'm very I lay o da lay o\nDa lay out like\nA a a a a A R s a young woman or a a in a way I Would go hey\nHey oh okay yeah yeah I Know you're right you know\nA man I mean I Know who they are or where do you have\nYes I travel the world will not have me and I travel then me in ... in many ways\nNo no no no no no no no no no\nNo no no no no well\nYou know ... some\nRuling man man no I Know I Love to know\nSometimes\nI Know by the way she said a land nor I my ... my weight gain ascertain more I\nDid wrong a man's name like Ken\nLay o\n\nO ...\n\nO lay lo o\n... who who who who are more than ... or ... ...\n...\n... a a I'm a native than a a\nYoung girl who was a yo yo ma I Am a ha ha ha ha\nHa you know ... ... ... you know your son in law for about\nA ... a\nYoung ... ... ...\nOr a or a woman\nWho was on the ... ...\n... ... or\n... her her uh your order and or or\nAre they are there are there her ... her her her ... her ha ha ha ha ha ha ha ha\nHa or your your your your or or\nOr or or or your\nYour ... or her mother her daughter\n...\n... ... or\n... or ... or or or or uh\nHuh yeah yeah yeah yeah well\nOh yeah yeah yeah\nYeah yeah yeah yeah\nI Know me well oh oh oh well it does not like you know I yeah\nYeah well I don't know I you know ... N.Y\nLa la la la la\nLa la la la land and uh oh I Know what do I have\nA ... a ...\n\nOh my knee\n\nDoes I E R o da de la ... oh yeah oh but ... our\nE and now that they know me you know ... ... ...\nOh why\nOh why oh why oh why oh why oh why oh oh oh yeah oh yeah I asked\nMe that the guy said oh man the ... you know ... ... ...\nOh yeah\nWell my knee\nI Know that he will do get a good\nDay or yeah neat um were gay I I only eat and no or not he ... the new ...\nAnd ... and he's [noise] he's he's jak\n[noise] to monitor [noise]\nMm Mm\n\nYea\n\nYea ... na na\n\nNa da na\n\nNa\n\nNa na\nHandy\nMan hey\nMan I don't\nKnow my\nMom and my last\nPoint yeah [noise]\n\nYeah\n\nYeah a a\nMan man\n\n\nMan na\nNa\nNa\n\nNa hey\n[noise] man [noise] man [noise]\n\nNa\nNa\nNa\nNa na\nNa\n\nYour yard it's no no no\nUh no I Will wear my and I saw I go to a more moderate while I go to a ball show or a dog and a um a\nWhile a yo man job or not can I say God I Know\nI have my yard and you are saying much I'll take 'em all uh yah yah yah I\nDon't know I Know\nA young guy very well my dad died like oh I'm I'm a while I go to a more jaw no jam or I'm a ... a yo man draw or not and I say God I Know\nI might I don't know if they bomb but hey I'm also a a a a\nA um a lot of work a lot a yo man draw knock on the card I now I Am not a guy saying mom much or ...\nOr a job or I'm a law like okay\nWell oh you oh man oh can I say God I Am now I Am a ... a ... they're much\nOr take a whole a job or John\nThank you\nThe last song is going home Tom and Tom just pay the British people we we all came here when we heard good song and we have good feelings and we're\nTaking all these lessons that we heard through song and dance and we'll take them back home with their travel back to everybody back to where you came from and again we've taken her wedding is out here really during the day and we're really\nHoping I enjoy your doctors and our son\n[noise] [laughter]\nYou know even\nThough they saw a man glad that I have um I'm a\nMan in a it's a game show okay when I hear ya I told him I'm drawing a\nBlank and young you know as long as soon as I Do when you're a dog and a guy so I think I don't care I'm ...\nI'm Sorry I I\nSaw in ...\nWhen John Jim I'm Glad that you know I'm\nI'm a dog can raise your some of them I'm Sorry I I I was like well yeah I\nThink I thought okay oh hey we got a call okay I have read you know saying hey I'm a ... or ... yeah yeah yeah well I'm a law known him\nSince may\n... na na na na\nNa na ... going on here\n[noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise] Mm\nMm Mm Mm Mm Mm Mm\n[noise] [noise] [noise] [noise] [noise]\n[noise] man ... ... ... ...\n... ...\n... ... [noise] [noise] [noise] [noise] [noise] Mm Mm Mm Mm Mm Mm\n[noise] [noise]\n[noise] [noise]\n\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise]\n[noise]\n[noise] the\nMakers\nAre between the new ... new\nNew ... who runs the one who didn't want us\nTo do you want to know who ... who knew [noise] he ... he was\nIn the new cars and who want it to your new one on painting in the news in God who might be you know no ...\nHong Kong and\nHe said oh he was Daniel ... new\n\nHe's seen a who's who really knew what she\nWas\nIn New ... who knows no no no he he knows and [noise]\n\nShe's part I used to have a shot on the\nWay it's I'm not on June ... da da da da da da da\nDa da da\nNa I wear it yeah on Yahoo a while I was a ... a a a lake ... now on its own way hey you know well I\nDo in their own they are always great\nJoy na ... young guy a while and they also I don't want a way I Am a\nYou are listening to you why I don't belong in the past ... streaming online to key why I don't know the one I use the project called the ... foundation\n[noise] [noise]\nKnow a a young man I Am I Am I saying I Am a\nI Am a man I Am I Am I oh man I Am a out of\nThe way I\nAm am I Am I Am a man I Am I Am I. L.\nS. A. L. O. hey hey hey hey\n\nHey hey hey hey hey hey hey hey hey hey hey hey are\nYou know why for me now why are you saying\nNo no no no no no no no no no no way they normally on nine nine when may I'm ... now and now we're in a um\nYou know no one man your ya know I'm now when they are no no no ... no no ... no\nNo no no way they don't know where your ... your oh\nI go to this guy Chad Farley\nFrom Manuel rise you brought up in our lives thank you very murder for loving la was saying you grandfather and fourteen next you know what\nYou do for a very obedient ... na na na na\nNa na na na na na na na na na na when they um ya know now we're in a um\nNo no no no no no no no no no no ... no no no\nNo no no way they are who we are no I ...\nI go to this guy ...\nMama arise you Brian Levin learn by Larry do grandma dirt floors I think oh well thank you grandfather for saying she no one\nYou well ... na na na na\nNa na na na na na na na na na na when in may I'm ... now we're in a um\nYou know not knowing your ya know no ... no no no when your ya no no no\nNo no no when mayor who were your ... player on\nI Swear this guy ...\nMama arise you Brian Levin a line St you ran a day for the love bug St you grandfather and for ...\nYou know what you well for a very heavy in ... na na na na\nNa na na na na na na na na na na when they um even now I Know we're in a um\nNo no no no no ... no no no ... no no when\nWe are no known with me who were your ... your\nEye is really nice guy tennis\nBall from all all rise you brown love in our lives thank you ran a third floors I think all of us thank you grandfather and for a change you know when I was\nYou ...\nYou're listening to cater why I any ... when ... and ... radio shaming online I hear why I got\n\n\nNo no\nNo no\nNo\nNo no\nNo no no\nUh no no\nNo no no\nNo no\nNo no no\nNo no no\n\n[noise]\n\n[noise]\n\n[noise]\n\n\nOh really knew\nWho who you know\nMaybe we didn't even\nKnow who [noise] who\n[noise]\nOr\nOn a\nLot of [noise] you know ... ... [noise] [noise]\nMm [noise]\n\n\n[noise]\n\n[noise]\n\n[noise] [noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\nMm Mm Mm Mm\nMm no new na na na na na na\nNa na\nNa na na na na\nNa na ...\nIn the longer moles ... on the air go how does she leave ...\n... ... ... ... ... ...\n... ...\nYou know no no\nNo no\nNo no no no no no no\nNo no no no no no no no\nI'm not\nToo long you know there's been a major issue in front of a ... and you know so little speech the ...\nThe way the news they shoot me down this way was\nThe main a\nWild man I Know\nI learned a lot\nHas been\nA\nLong\nLong\nWay to me that\nHe is a slow down and just for the call or two to\nThree ... and when you speak should be done by the way the ... the\n... [noise] [noise]\n[noise] no no no no no no no no no no no no\nNo I'm On the on the ...\n... ...\nAnd her we na na na na na na na na\nNa na\nNa na\nNa na na na na na na na na na na na na na na\nNa na na\nNa na\nNa na\nNa na na\nNa na na na na na\nNa na na na na na\nNa na\nNa na na na na na na na na na na na na na na\nNa na na\nNa na\nNa na na na na\nNa na na ve\nAnd ... ... ... ... ... ... ...\nPer\nSe na na\nNa\nNa na na na na na na na na\n\nNa na na\n[noise]\nWe're on the pressure on them especially for a\nPerson wants to once again mother's family is being offered to pretend to\nBe I'm really not only do our own environment and to each other as human beings\nTo extend are related to the rest of the universal family\n[noise]\nMany of the genetic makeup people have a rich among them don't\nHave problems with the knowledge that certain they wait until the right time\nTo reveal could answer questions can be given to spiritual minded or the water\nAnd it should not be an issue or is this time of my\nTime when we don't want to\nMake a tribute to [noise] do me a shiny just let\nThem chip away from it or not the rent\nOr one now is to direct ourselves as what they weren't ever way in order to another homeland [noise]\nThat's\nOngoing relations between the\nPeople in order to orange guy but he rose has been going on now on the air [noise]\nMany Native American ceremonies make you a long\nTerm and the next to somebody\nAnd my mom my mom up there and the answer to return [noise]\nThe rest of the family car or\n\n... percent can guide spiritual people as they seem\nTo be in the last bit each one way and\nRepair for the future as long as the head of\n\nLettuce to remember as a mother earth I went to the open source for the opportunity\nTo first once again another gold at the ancient ones are reminding to weaken your own spiritual power and potential to become in harmony\nWith the mother the universe and the electronic community [noise]\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\nWell you know ...\nOr ... show I always say you know ...\n... ... ... a day or a you know I I Know\nWell below us or the other day or two\nMaybe a straight a man show re\nI they die while I was in some of the bailout way do my sweet ...\nI ah hey Hi\nHow\nAre you know our\nWay Ohio way you know or I don't want\nTo weigh on our way out of the uh you know a ... I have a A R o\n... o here there are some of\nThe way that a man struggling a\nI think that while I was in some of the best way to my ...\nHad high\nAnd do my ... a man whose job today\nI had high a\n...\nA year\nNow when I Am now or\nWait oh I Know I always say\nWell our way out here I Am a little while and you know like a a I Am I Am a oh\nI Love to go you know I have a ...\nA man stronger a I think that while I'm In the best way to my friends have man struggling man\nI I Am I Am\nA yo\nYo yo\nMa ma ma no\nWay you know I always say you know oh ...\nWell our way I\nAm I Am I Am on a yellow\nLab they are I have I Am a oh\nNow I Know a very you know I saw that I have a two\nMan it's rare that a man stronger a I think I bought a man and so the ... when they do my three is a man strongest man\nI I had high ...\n[noise]\nYou are listening to ... I Hope below any point when they're from streaming online and why I don't know why I in a project called the ... foundation\n[noise]\n\n\nNa na na na na na hey\nMy name's Larry Larry with name they are now I have a a man\nNamed na na na na open and they say I'm a woman named ...\nI Would say very very young when ... I have no\nOne no one knows where like you know ...\nMillion dollar way you do a rape rose what we'll do I use the song by their love me no matter what even one young man and I mean I think\nA lot to be that your phone or you know you are a blessing do the same way you know around\nYou know\nOne name he no\nHe was my last year na na hey hey you know with name they ah now I have to lay out when they\nLay down by name saying you know when they play on my own and they may they may very well may need on my way\nNo no no no no no\nNo no no no\nNo no ha ha ha ha ha ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha ha ha ha ha\nHa ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha\nOh\nOh oh oh oh\n\nOh oh oh oh\nOh oh oh oh\nOh I heard\nAbout this is true today from Lexington, Kentucky and you're listening to tell you I mean the point was FM radio\nCreamy online that you are ... that project is hoping foundation fewer innocent decay you are I Hope to fill up the pressure on FM screaming are learned that you're right I ... ... is a project consulting firm ...\n\n\n... ... ... ... ... I couldn't do it or\n\nNot she can I Do I\nLove your own or\nDo you see\nThat he needs to say can\nI can do to win the no I Do\nNow is she now that I'm an ... when the Yankees\nOn you know yeah it does a\nClean or as you get then that's\nNot what's your\nWhat's your\nDog musher can\nPush you know that when you\nSaid\n\n\nHello my name is Pamela along with the hope event and every services shout out goes to all the animals on the reservation our pet owners make sure you take care of your animals\nDogs cats horses cows sheep they all need love to you are listening to KU Y. I. eighty eight point one FM radio streaming online at K. U. L. I. I. dot net thank you yeah\nI'm a I'm a new school who hired ... New Jersey golf oh who ... hey John ... hey hey now\nWho says get hooked on go high he's come ...\nWho the un has a goal ... there's no goal who ... who who highest ... hey John has gone Hamid Karzai a\nNail wrong now has\nA ...\nYear old they ask us ... and there's your goal who Hamid ... hey there's a ... a little high he had a ... and John you go Hamid Karzai a mail room\n... he's a he had any this done then they're going to high income you hey John Nagl who who high income you hey John Nagl who who hired ... John Deere\nGo high income you're a\nMale wrong\nSo send us in this high he's caught you hey I asked ... ... ... who who ...\nWho ... he's a he hey John Nicole Hi he's ...\nNow since he's got ...\nSays he's ... he's not using any news show that gal who who high he's not you have any national ... who who ... he's a he had any knowledge on this go huh he's ...\nNow\n... now has a a soap as high as ... you know they go a little high income ... national Nick ... who ... John Deere going high ...\nNail wrong\nKnobs ... has been hired ... called ... high he's caught you hey Nick ... who ... you cannot you hear me now John ...\nWho high income ... John you go highest ... nail long\n... long ago high he's come out you have any ... any national go who highest come to you you know John ... who high income ... John ...\nHey maybe oh\n... no ... just beyond a ha ha ha ... just in\nThe ... I Am a nail ...\nSunny ideology eight and ... ... ... ... you know being a Ga Ga Ga ...\nDe Mayo alone\nDa da da da da\nDa da\nDa da da da da\nDa\nDa da da da de\nMayo alone ... he\nAte the energy and this man the a\nHa ha yeah you know\nThe energy industry in the ... a\nYankee now\nTo be in the the energy and the\nE\nB energy a dish in the ... a Yankee\nMail along to\nPush on the the energy a niche in the\n... young\nThe energy and this may be a ... a day\nMay alone to pay\nIn Ninety eight the energy Amish man be I\nDon't eat the energy\nIndustry in the ...\nDe Mayo alone Sean can't\nDa da da da\nDa\nDa da da da\nDa da da da da\nDa da da\nDa da\nDa da da\nDa da\nDa da da da\n\n\n\n\n\n\n\n\n\n\nYou weren't listening to the white I point when you treat me on my key you might I got my eye on the beach\nAnd they gave\nMe a young man man on the plane in\nMy\nMind around me and just like any\nThey and he he he\nKnew would die on me when I'm On my name\nIs Amy they the the\nNew year and a man named man will\nGo and my name is Amy Amy gross me down the line like turn green ... ...\n... my nine black\nRainy day he came to mind barely contain a\nNice\nMine not only in my mind and Amy\nMy ah\nMy dream we eat\nA like a diamond mine not\nA rally in a time um mine mine and John cooked on a car or a ...\nAnd ... and ... and\nNow we're a young man and I'm One who found naming a\nNice to have and Ernie ...\nMan with a young man when I was ... done name\nAnd how are you saying hey\nWe're close timing that'll get ... Wang racking my soul\nWing ... Ga which was one girl you ... for a family\nAnd found a um I have a nine hour really I'm a ... and carrying a honey hanging\nAround [noise] and have been nine and how they may have the may ... may\nWanna fan then and now for more so go after him and then a a ... a month and Iraq the\nIran or any hurry up and the hiring and and\nThey ... ... you\nKnow we're done now I'm a man named down one goal grown more than ... ... ...\nAnd ... and ... and a and you\nKnow a young driver menu and now they're all grown will die in a in a house and they have real close friend made more traveling around on my\nShow ... work all week we'll wrap where they eat\nThem I'm not a night or that way I'm a ... a year and you have to have any hey in and\nAsk any ... happening right out the ... have been mad man\nWith a man in town kills more so there are five and a man or is it\nBad Donna I'm On the Yahoo Yahoo I I'm a ... and ah they have in and\nSay I'm ...\nNow we'll have a ... a man a goal grammar ban may and ...\nAnd ... and ... and now we're\nForever young I'm I'm a ... mile ... than men Ira how are you saying hey we're closer than the men get a lot of them are ...\nWeren't on coal and nuclear weapons or break a\nDiver down or how much higher line not run a I'm\nA ... hour hour and a rabbit and a half\nA year and there are nine nine or ... or I'm not I'm not the way it is\nI'm a man ma'am I'm just on a A R I and\nMy now ... ah a mind not the way a I'm\nA mom and I'm just a A R or any any\nThey ... me and\nThere were a young man a man man we're going on than name or\nHer around a a a a NBA ...\nNow where ever you're on a limb and mountain will grow grow on may ... has a A R a handy work or family member or white or black my\nEarly in the wake work or only ... third\nTime I'm a I'm not a line that I run a a\nA a a her in any in\nMaryland\nOr as a hey hey hey girl my ... ah I'm not I'm not the way in based\nOn my mind nine and ... and higher or any any\nMinute now like you have a time and your mind not\nPaying rally he is Tom I'm wind rain and ... you know a a ...\nAnd ... and me and\nKnow [noise]\n[noise] ... [noise] [noise] [noise]\n[noise] [noise]\n[noise] Mm Mm Mm Mm\n[noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n\n[noise] [noise]\nOh Mm [noise]\n[noise]\n[noise]\n\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n\nMm Mm Mm\nMm\n[noise]\n[noise] [noise]\n[noise]\nOh [noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\nOh\nLook look look look look look look look look look\n[noise]\n[noise] [noise]\n[noise]\n\n[noise] [noise] [noise]\n[noise]\n\n\n[noise] [noise]\nNo [noise]\n[noise] Mm Mm\nMm Mm Mm\nMm Mm\nMm [noise]\n[noise] [noise]\nThe the\nNo no no\nNo well ... ... ...\nMm Mm\nMm no no no no no no no\nJust down the ... the teachers know them me and he'll Judy [noise] na\nNa na na na na na na na na na na\nNa na na\n\n\nNa na na\nNa na\nNa na doggie no no no\nNo no no the\nUm\n\nMm Mm\nMm\nNo no no no no no no no\nNo no no no no no\nNo no\nNo no no no\nI'm\nA\n... money to mail look happening deserve their cars or job was like I can ... do you buy or would you do all my hope the relatives that he was too you're listening to kill you why\nI asked and on the Hopi Reservation negro much begin to mix\nYoung and what not and that money one day and you know I\nI was ... and I I\nThink we'll try to go away by email and I'm a you know the the only way I don't know I don't know more and more than ... and I\nUh I\nWas there and on my way to go away or not that young because I\nAm now my I mean we've\nSeen in hand\nOh okay I see no no no no no I I was so low\nAll in a new one a while yeah there are a ... a day hey yeah I\nKnow it ... no ... no ... no ... or your ... or ...\n...\n... ... ... being my Gillette let Jacqueline Leo ... fellow was probably the upkeep and now let's hope you twenty ... twenty Thirteen\nNow and when when they end up in the last Fifteen tally up until I Am I'm ... now I go from one month at that now myself at that time that ... team can do what I mean the unhealthy and my you know make out and find must be like\nNow I'm On my way up the mess hoping they can have tendency that in ... all\nThey want to wish everyone out there that they can have a great day to day with miles and positive that way\nAnd the others that take care of yourself and your family because you're always language among them was asked me and my high like Afghan young young all the um uh but I mean only\nA ... ... ... oh\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise] [noise]\nMm [noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n\nYou weren't listening to any way I Hope ... probably one of them any online uh gee you why I don't see why I asked the project will be it would be a station\n[noise]\n\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n\n[noise] [noise]\n[noise] right I learned by reading and we're\nGoing to bring about greater diversity that we may never bothered by\nThe guy [noise] were\nLong lines do on a\n\nOn a full day job on our own\nAh [noise] [noise]\n[noise] I Do about it that way I\nI'm not doing so in a way I live in the valley one that you know bring your own [noise]\n\nAnd I knew I was more about or a [noise]\nOn the side gone done laundry and a good job of dogs in our own that go there and go oh you know I Know a\n\nWoman [laughter] and then\n[noise]\n\n\nDa da da di ... shore every chi chi or like going out the red alert\n[noise] [noise]\n\n\n[noise]\nWhat do you draw the\nLine\nAnd who wants to give them your\n\nOh God it's like a bad guy we da da da da da\n\nDa da da\n\nDa da da\n\nDa da da da da\n\nDa da da da da da da di\nDi di di di di lord\nMan a man\n[noise]\n\nOh no we are not [noise]\n\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n\n...\nWe're not Mm Mm Mm Mm Mm oh\nGod if mom seven nation a good long na na na na na na na na na na na na na na\nNa na na can then be a bomb on my mind the no no\nNo no no no I'm In my name is ... ... ... you\nKnow on every single one guy I mean one\n... um the clean up thing na na na\nNa na na na na na na na na na na they want you to do\n[noise] na na na na\n\nNa na no just a little\n... mom is a well I'm I'm I'm I'm done on the trial the late ... found them last spring na\nNa na na na na na na da da\nDa da da da\nDa da da da da da da da\n\nNa na na na I don't know\nAnd to me when\nI was ... to uh the the new like to me to go to\nEverything and they said that propose to here yeah and then the men\nCan do a man\nOr woman charged on his dream in a brown and when we worry are free to do a full ... hours a day or two or three jobs\nFor the delay\nHim no matter and um [noise]\nNa na na na na na na na\nNa na ...\nMm\nOh God yeah so for\nMe it's a ... oh that too and so did you say that I'm In a job as a\nMilitary ...\nLa la [noise] yeah I mean and a\nMan na na na na na na na na\nNa na na na na\nNeed to know\n\nMe well let\nMe a lot and\nI like my ... and I'm\n\nReally yeah oh God I ...\nFrom ... in the\n\nLong term oriented I na na na na na na\nNa\nNa na na na na na na\nNa na na na na na na na na na na\nNa\nNa na na na na na na\nNa na na na na\nNa na na na na na na na na na\n... ...\n... ...\n... ... ...\n... ... ...\nThank you very high ... na\nNa na na na na na na na\nNa\nNa na na na\nNa na na na na na na na\nNa na na na na na na na na na na na na na na na\nNa na na na na na\nNa na na [noise]\n[noise]\n[noise] you know and I'm not I'm not getting\nOn my\nWay to\nSay no what\nYou\nWant you know we've been Ninety let me see if we\nCan watch the\n... and ...\nTo ... ... ... I'm\nSorry I Can't ...\nMan re a breeze ... and\n... and ... may change\nThings ... and ... ... ...\nAnd ... and and and I'm ... I\nDon't know\nI ... I\n... and last\nOh Mm Mm [noise] well\nSee then fly no drive\nOh ... well\nSee then fly by\nMarch ... Rene ... then we\nAny then down ...\nWe the ... de\n... no ... no no\nNo no no no no\nOh damn man on the ground Mm\nMm\nMm Mm no\nFun than ... than by far and then in ... right no no no no no no\nHe wrote\nOh ... ... ... and ... and\nAnd the pay no man\nIt sounds to\nMe oh no no\nAnd no no no you know ... and learn the lesson\nAnd oh no no no no I'm I'm [noise] [noise] [noise] [noise]\n\n[noise]\n\n[noise]\nWhere which he can do that and\nI Can't begin to nowhere and I know that it's quote\n\nWas doing [noise] and the spring bee chain so I'm a ... you\nCome along\nAnd [noise] Reggie no\nActually but now\nI\n[noise] I don't know\n[noise]\n\n[noise]\n\n\n\n[noise] [noise]\n\n[noise] [noise]\nYou are listening to kill you why I Hope I'm eighty eight point one afternoon we online it anyway I dont know January I in this project come the OB foundation you are listening to\nYou why I feel a a one man ed K. U. R. A. I. L. the upper ... the eighty nine boy one that's been ... ... that's the hope is foundation depending on the case why does Mitt your Native American public radio station\n[noise]\n\n[noise] oh no\nNo no no I'm Talking about\n[noise]\nNa na na na\nNa na na\nNa na huh [noise] [noise]\nI I Am now [noise]\n\nI'm\nNow an awful lot [noise]\n\n[noise] [noise] [noise]\n[noise] [noise]\n[noise]\n\nOh la\nLa la la\nLa la la la la [noise]\nYeah no\nI\nDon't know [noise]\n\n[noise]\n[noise] [noise]\nOh\nMy God [noise]\n\n\nWhoa whoa whoa whoa whoa whoa whoa a good\nWay off in a way of what they say oh\nWell all of that is a day off I saw oh whoa whoa whoa wait wait wait whoa whoa whoa whoa whoa\nWhoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa way off\nOh I'm a ... call huh ha ha ha ha ha ha ha ha ha ha ha ha ha\nOr road going to hold off\nOn a lot and I caught a wage paying job hot here well a lot in la [laughter] going oh whoa what product thank God for the la la\nLa la la la la la La Crosse\nHigh off way off quite a you know I'm like oh my God what a a a a cold ah\nOh whoa whoa whoa whoa\nWhoa whoa okay while I talk a lot of ways you say oh man yo la la la la la di da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da\nDa\nDa da da da da da da da da da da da da\n\nDa da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da da da\nWe're ... ... ... ... ... you know hey will really only a ... a a you know hey are you a a a\nA a\nA a a word yeah oh I Know\nI Know I Know I I\nI Know I I I Know you know ... or\n... or ... or ...\nWhy I I uh I play I um I I Know ... or ... or ... or somebody I I\nShall I say I I Know how I Am I'm like oh\nMy gosh el ... I I [noise] I uh I I\nKnow I mean all I can I say a ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha ha ha ha ha\nHa\nA ... a a ...\n\nOr\n... or ... or ... or ...\nOr ... or ... or a boy or a la\nLa la la la la la I play a\nAs a hell of a [noise] oh [noise]\n\nOh no no no no no no\nNo no no no no you gotta die of maybe a thousand\nDollars a year or the other day on the other\nDay a young guy yesterday Diana yo yo yo\nDa da da da da da\nDa da da da da\nDa da da da da da da\nDa\nDa da da da da da da da\nDa da da da da da da da\nDa da da da da da da da da da da\nDa da da da da\nDa da da da da da da\nDa da da\nDa da da da da\nDa da da da da da da da da da\nDa da da da da\nDa da da\nDa da da da da da da da da da da da da da\nDa da da\nDa da da da da da da da\nDa da da\nDa da da da da da da da da da na na na na na na\nNa na na na\nNa na na\nNa na\nNa na na na na na na da\nDa di di di di di di\nDi di di di\nDo they\nFeel like you're getting a job they did not like the\nOne that you know ...\nNa na na na na na na na na na yo yo yo\nYo yo yo da da da\nDa da da da da da\nDa da da\nDa da da da na na na na na na\nOh a whole whole uh uh uh\nI uh oh\nMan I\nThought oh\nNo no no no no no no no and all the way in a row now\nThe oh oh oh oh oh\nOh oh oh I I I uh I uh and uh oh\nI have a oh\nHow ah hey hey hey well\nOr or the river\nOr new words you're\nGoing too far from where the jurors to go\nInto a curve ball where it was total on the phone number\n... prose for you for your bird flu or do anything for ever grow\nFrom where you go through a ... year old girl so we're we're\nGoing to go for a loan from the rover to produce for you or your partner or you were there for\nA very very pro\nPro pro more you're for or a bird is to move\nInto murderers who were words or no room rose from the school\nFor perjury reward for those who were near zero\nFor your own or work pro phones phone or your\nEr into your true blue rodeo drugs no more and more of a whole\nWhole room or from the word cool per per year war or\n\nI Am na na\nNa hey\nHey ho man\nA man oh man I Am I Am\nA I'm\nA yeah oh yeah yeah I'm here yeah yeah how\nAm I right now a\nLot and I know my I have to\n\nRight I yeah I Know\nI I uh\nI don't know how my\nLife as a as\nA yeah I I don't I don't know I I\nI I I I I\nKnow yeah I I I\nI I I I I\nI have a nice guy\n[noise]\nMaybe\nI'm a young woman and all of them at all\n[laughter] [noise] [noise]\n[noise] [noise] [noise] [noise]\nOh no no no no no no\nNo no John\n\nAnd John's\nOn the other job as a you know a little on the phone\nAnd\nI was going\nTo\nStay in China I don't know where all of\nThem [noise]\nOh no no no no no no no the\nDollar store on the job you know on the\nOn the other night on\nAll the all the um [noise]\nA lower on the talk shows I don't know\nI saw him on on the agenda that though [laughter] [noise]\n[noise] [noise] or if they don't\nKnow I don't know\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\nYeah you think Kay you write I NPA Frank Land in San ... from Japan to own a Home Depot\nI Know\nThey say [noise]\nHa ha\nHa ha ha ha ha ha ha ha ha ha ha ha ha ha ha ha\nHa ha ha ha ha ha\nThe White House and you know we're not going to show [noise]\nBoy di di di di di di di di\nDi di di di di di di di di\n\n... or ... ... ... ... a ... bird book may um Mm\n[noise] I don't know how you want your warm warm warm\n\n\n\nOoh\n\n\nOoh\n[noise] [noise]\n\n[noise] [noise]\n\n[noise]\n\n\n[noise]\n\nYou are listening to your your why I Hope my law eighty eight point one F. M. N. K. U. R. I. L. P. uppermost copy eighty nine point one at a project of the Hopi foundation\nStreaming online the train you why I dont know your Native American public radio station\nAnd among those I like to eat them or the money to rent a lot of money\nThat way I thought that my love\nFor memorial up on ...\nMore than once you're young I\nFeel like you know my younger one but my ... year old boy and the only ones who might be one of those things on ... billion\nIn the winter when\nIt when I asked the same\nTime and my thought it had to kind of\nHoping that the fight for the money my gun\nBy none of them\n\n[noise] [noise]\n[noise]\n\n\nYou're waking up my one of the baby boom I I [noise]\nWhy hired word you're listening to my good friend ran a model you come to live on the morning show it don't want the\nMining mining\nOh man not a ...\n...\n... the ... not Tony\n... a gallon scene I'm a\nMom let me\nKnow huh again and he\n\nHe ... he your in the\nWake up my grandchild well\nWell\nThat's a free for a living the\nPray for him man rallies prefer raw ... H A\nN E yeah ... ... you ... yeah\nNo no no ... in a\nIn\nA movie ... thorny\nSued to key does ... seen no ah\nThe moon and knees\nNo king ah knees\nAnd he he ... he ... he in the\nWake up\nMy grandchild well agree\nThat um pray for a living dean\nPray for man rallies pray for a ...\nHe ... he ... he\n\nHe yeah he ... he he'll have any\n\nLittle much do we get in a totally I ate been is just getting\nIt was good it was getting my hey good morning everybody six zero said that he or she you a radio station on ... ... it also can be ... be upper among ... ... project jumped in what to do dishes ...\nYour Native American public radio station\nAnd you are to the to the doctor program you want to know this morning random ... better known as we're\nGoing to be bring you some good needed American indian gym so hey what a great way to wake\nUp in the morning here on\nMonday the raid jam day just another Monday morning here it is the what ... the a\nA job or two thousand and Eighteen and one of the good morning it is nice and cool off site in eight Coley just cool Cape so was it was it will be\nThe way it is right now we're cloudy skies and the president timing lead to be the sprinklers coming down here in ...\nThe area I just transferred all obey all we can all agree morning and we liked the will of the people that are similar to lend a key way I'd done it where ...\nA a mix you got some of whom see kids will be getting some good near mic and in a gym so wherever you are what are we doing is just waking up in ... had been a great one this morning and ... we could play much lower than the ones that pay a Muslim guy comes up a bit to play you just went to\nA ... to ... to getting ... late in the\n\n... they were ... years when that ...\nGod there's a a ... a a a a a a\n... a a a new movie he's yeah he's in a in a in a in a\nMore money than a a a a a a a like a a a low on money is\nA is a a a a a a a line uh nah\nI'm all\nLike I said a home in a in a giant uh\nAll the time I saw it in a I'm home\nI Do not in a\nLow live here tonight though in a ... a a a ...\n\n[noise]\nOh whoa whoa whoa whoa whoa\nHeh energy\nJoe oh\nHey hey hey hey hey hey eh Joe\nOr\n\n... or\n... or ... or ... or ... or ... or ...\nOh whoa whoa whoa whoa whoa\nHey did you do or\nSay hey hey hey hey ed J. lo\nO lay\nLo\nO lo o lo or\nSay hey hey hey you're a ha ha ha ha ha ha ha ha ha\nHey hey hey hey ha ha ha ha ha ha ha ha or how did I\nSay this as a ... year\nOld oh whoa whoa whoa\nHey ed\nThey do or\nSay hey hey hey\nHey ed ...\nWhoa whoa whoa\nWhoa whoa\nWhoa oh boy\n... or ... or ...\nYears have been the size of a ... ...\n... ho ho ho ho\nHeh\nHeh heh heh\nHeh Joe oh boy\nYou\nHave oh\nHey hey hey hey ha ha ha ha ha ha ha ha ha ha ha ha\nSo ... that's the ...\n\n\n[noise]\nThe cold and saw not all ma hey a voting as a\nWay to have gone not all\nMy hearing a a floor or a small all now your\nCity called ma saw a multi oh now spinning and then\nA a a loan or a high\nOr your ...\nFloors asked a ... a a there is just a stray on I ...\nA nine year old she\nCosmo Shaw I'm a series or job training\nI ah John yeah it's a [noise] Hi\nHow are you doing\nToday is uh the uh there is a girl and she\nKnew it does not all my ... a song or a they going to have all not all my ... a song or a [noise] a\nNo nah yours\nThe scars ma saw how much they call a screen and then\nA a a long or a high\n\nTone is a senior or they may on a ... or ...\nOh no no she called ma saw how much they fall out ten million\nAh a a long and I'm a high\nOr heard\nFrom ... it's a chain or they may on ... ... means Siri\nDo they do not or ... I uh\nSaw it as a\nThey going to have dogs that saw ma\nHey a song on as a A R nah you owe\nShe ... them all saw a Mercedes or job creating a main\nAh hey a law that Tom Hi you're\nOn the\nPhone they uh they uh they may not good for you smile\nAt all now you know it's the talk or Mao saw how much they call a famous name\nA a a loan as a a you\nKnow\nWho they are they are they still don't know ... ... [noise] the Florida\nIs showing off by a a large as a\nThey they all all\nMy ... a song or a car all now your\nGD or small Shaw how much they or job training of Maine\nOr a a long hair\nA car\nSo you have a tree or they may not do ... I mean these\nAre all now I Know the cause ma saw how much they call down off the main\nAh a a well known as a uh\n\nUh the uh is may ...\nDa da da da da da da da\nDa da da da da da da da\nDa da da da da da da da da da da da da\nDa da da da da\nDa da da da da da da da\nDa da da da da da da da da da da da da da da da da\nDa da\nDa da da\nDa da da da da\nDa da da da da da da da da da da da\nDa da da da da da\n\nDa da da da da da da da da da da da da da da\nDa da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da da da da\nDa da da da da\nDa da da da da da da da da da da da\nDa da da da da da da da\nDa da da da\nDa da da da\nDa da da da da da\nDa da da da da da\nDa da da da da da da da da da da da da da da da da da\nDa da da da da da da da da\n\n\n\n\nDa\n\nDa\n\nDa\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n\n\nI\n\n\n\nI\nAh [noise] [noise]\n\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n\nRain the na na\nNa hey I'm a I Know I had a\nI have high they are playing na na na na na na na na na na hey oh\nI Know I hear I hear Hi Nancy Lane I na na na na na na na\nNa na hey oh my I have a I Am fine na\nNa na na na\nNa na na na na\nNa na na right now I Know I Know I ... I have high dam\nNa na hey oh man\nI married a man when\nThey now right now right now I Know I Know I have no I I Am ... na na na na na na na na na\nNa hey oh I Know I you know\nI have ... na na\nNa na right now I uh I I hear a\nI hear how high they are playing na na na na na na na na na yeah oh I Know I Am a I\nGot on the Web or on the wrong way why were they on on the\nMarket and the number of them getting rent that hold on there and they get on the on the run or say that to me at the council today and I cannot keep on running around and say that that knowledge that we\nCan get one day they were paying them at their homeland or not there no matter if you're not you're under the gym that I didn't have the presence of the holy\nThen that gives them passionate about their back in the only way he saw them down below deck on the red cross it can happen in the town did they get back to the new ...\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise]\nYou\nKnow seven o'clock soon as long as your radio station and your tune into the ... program you know why I eat when one of them and also key why healthy for among the on ... wouldn't have been\nProjects else do you hope your bones and online and K. you Don your American public reviews in\nThe ... from Italy partnership between the ... I Hope you're reviewing you Arizona\nPublic radio station obviously you were to MPR and last year was a ...\nUm we have much time do they use language so you have a great and you are to NPR are\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOkay nice to know what's going on but we're like Judy NPR this morning I don't know is this the chances of winning the world but not coming through so I guess we'll go ahead and start we are committed calendar year for today for over a\nTwo thousand and Eighteen you why I cannot be hurting them just some ... ... people in eighty nine point won it in ... she goes on in Washington which is approximately ... miles\nYou why are they not going to need support you and I find the original privileges and also they keep on who it was seized on broadcast from ... to ... to show launcher\n\n\nYou see ... you know low key to jump shooting up the road to sixty four in the eighties seventies Misha every also cause cancer ... ride it grew into when Louis originally or a U.S telephone number nine to a two three\nFive wives you fly enter picks number nine two seven\nThree eighty five by to buy the seat for open speaking volunteers and community of life for members\nAre it'd be almost response was stationed in the community about the importance of can you ... I Hope your radio we might be an such an employee in a ... right now and then I'm going to buy or someone you know you\nI can name\nOpen radio we might be uncertain and play in a will be lovely I tell ya if and if not in that I'm trying to do and you buy a time when we all your eggs you name\nIt must be my thing that you end up we must be a board members\n... somebody wants to only by eat it I Want to see what happened to me and lead them like I said to smile but uh in my own up to you and I'm not ashamed though in the ... but by I'm a I'm a mom\nSo many ... a young\nKid took you know if I see my I went on and on the radio station where he came up with the movie though it might help them in a way you leave by the\nHype behind heat the handset without knowing that I'm safe to move on repeal upon when ed K. you why doesn't that\nYou can email us for more information or a ... and also anybody that wants to be a DJ from your head in Fort ... I'd gotten it and again our telephone number is night Jewish so then the H ...\nN remembered is a million committed to kill him there and no sense at least to explore humid by mail it into a ... I've done it and I love about two to this day for you to be added to the killings or\nOr what you can do is have even better yet is wondering moved by getting ... from the message out to our listeners right away or sixty dollars we can record you permission and St Paul program and it turned his ticket announcement so email your information to employ\nKitty way I'd done it to get in there we probably wouldn't be a ... when\nI ... accent than a than a unfair them among them ... by an sixty dollars will usually by hiking meet the plane and they were able to eat in a light on when I'm ... now and the mobile\n\nCall limited number and get more information so in the seventies extending the one who controls the LA good says she and her health Tuesdays and Thursdays beginning at one PM that among coffee reducing number to call police permission ninth to eight six six zero three five all three\nIs this going to do it for a year or more to report here okay you why it is this your permission if you didn't hear just stay tuned it will be coming back you at eight o'clock in the morning here in about another forty five minutes or so and also I knew ten minutes five PM\nAnd liberty submit your community killing a non ... million to implicate the way I'd I'd had and a lot about two and three business therefore you've been to get it to the calendar and if you value Katie ... we hope you really you really you're committed to ...\nIf you value your eyes\nHope being review green committed to killing them wished to continue this for a mission considerably communique you lay underwriter your financial contributions during this will help us fifth therefore they've been bred if you couldn't allow us to return to our normal broadcasting is your bed on daily so\nAnd do that and get on the air here ha anyway also offers supportive of underwriting to get your message out to our listeners\nCommitted you kill some issues are they took two inches since ... ... and which you usually takes about a couple of seconds for me but for sixty dollars you can go to information as April paragraph\nTo reach out thousands of listeners all over the world so they knew even though they have permission to implicate the way I got and that\nTo get on there because clearly couldn't died and I'll be coming back to you or your whether they're very good good video [noise]\nMoney [noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise] [noise]\n[noise]\nSeven twenty five year are you a radio station on the eight eight point when Batman okay your way out the upper ... big man let's see what the what is this going to be like you're in northern part of Arizona I can tell you is very very ... is that right now and then\nAll the ... more moisture coming any okay for teams can employ it wouldn't seem to ... do you should do do you do I get into areas ... obese be two white cones steamboat\nLow mon they\nTalking about you one of the ... you had some snow there yesterday and he's getting cold out here so and pull up every I Want to show that there was a little ... currently just sitting at forty six degrees here every\nDay and no hughley outside this morning but he was nice okay\nHey says his Columbus Day\nYeah I didn't know that I didn't even know Columbus she's anyway [laughter] they do a good morning is\nYou have a buck fifty percent chance of showers in the area so fall before eleven PM otherwise it will be mostly crowd with a newer owner fifty five solve wins about nine to you live in most part of becoming ... dirty noon\nHey maybe that's why do you see no buses or I don't know they're having a holiday or what but\nMan he was no bust his morning\nOkay for today you're looking at a buddy at thirty percent chick showers or maybe before eleven PM and there'll be most of the cloud with lower on that thirty seven West is always wins around six miles per hour we're becoming calm after midnight so that's how I look Syrian\nWas lacked guy area\nThen\nTo see what are we going okay we'll go to a few good movie which will they have gone into those eight up into all legacy who couldn't get the bull ... Olympic cultural center area\nGranted your city uh forty six degrees there this morning so good morning Kato and to the you got about ... percent chance of showers in this area so far before to live in a an otherwise you'll be mostly cloud will hide near up to five West Windsor owns\nEight miles per hour airport today you have a twenty percent chick ... there'll be a part of the cloud with neuro now thirty six solid waste when several by muscle are becoming come in the afternoon\n[noise] the way they go to be too bad here then we go on in to see here a man was going on in tune you know ... be\nToo by city area to people as well get paid ... to ... to arrange springs shouldn't do area I ended up in the coal mine nice a tuna that they currently sitting at thirty nine degrees in ... and today you have a forty\nPercent churches showers area so Fox before Lebanese aim otherwise you'll be part of a sudden it was a ... year of sixty night or Krishna that fits the night ... become in North west that about ... most power in the morning\nKnow ... ... ...\n... my father John ... going to James how young you know with other ... uh by us he a\nMood a\nMother knowingly done um uh my major is only the top of the you know ... ... ... is a young\nOne the only one you've done much the you know we only know maybe ...\n... on my own much LA's youngsters help them get the money you know ... a day I Will kill you Tom ... to ... going\nTo say young you know with all the news then load them young oh my gosh you know among\nA\nMonologue normally done them a Monday it's only the tone of the you know they do is ...\n... ... is a young one of the money on the other room which the you know we've done actually no they won't ...\n... ... ... no no not on the\nOne who was a was a was a one on one was uh one\nWas on ah what was a woman ah well ah well ah well I'm a well a lot on\nOn a on a high end on a on a ... on a on a hunger you hang on a home and\nI have a young\nYoung how they may they may they may be may bobbing\nOn a date on the bond on who I'm going to a mother a toss\nUp the new uh Don Young on um uh how close was a lot of ah you know I'm a ... you know the laws are hockey my ...\nI I only got one by you know I hate them when they do in London yesterday I ...\nA new home all the you know on on the on my on my own much ... known all night on\nThe\nOne that was a while it was a law or was it was a was a was a lawn or what\nWas a ... ah well ah well ah well I'm a well a lot on\nOn ... on a on a hey I have a ... a how and\nI have I have\nYeah yeah\nWhoa whoa whoa whoa ... hey\nLook you wait a minute the bugs on blue for going to study on you know with the news doesn't know me on my house he does the money\nOn a\nMother knowingly done some er my name is only a day of the ...\n... ... is a young one of the money they\nWant to get a much debate you know without showing no when you ... you know the more than I own the I'm a mom much ... shows us how from Utah the money you know my\nAunt nanny I\nWill kill he wanted to propose on pools going down the ... games with other venues in the ... on my house you don't mind\nA\nMother knowingly done them a Monday is the only thing to do no\n... on a deacon\nIn like ... the\nOnly one ... much of a you know we are joined no way they you know home a a young one night only movies I'm On a mountain much LA's shows us how come you know my uh no no not on\nThe way I Am\nOne was a was a was a one on one\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\nOh no oh no we've been on a on a whole no no no no no the hung on and on and on and on and on you know\n\nFrom the heart of new to him or is going to go\n[noise]\n\n\n\n\n[noise] [noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\nYo yo ma a law third oh no no no no\nThird oh no no no no no thirty yo yo Yo Ma yo\nYo yo\nYo yo yo yo ma and pa on a on a\nLong time but no I don't know all the time but I don't know about\nIt all done\n[noise] ah [noise] ah [noise] a\nA [noise]\nA [noise] a on a I'm a\n[noise] [noise] [noise] ah\nA a a a\nRadio station ... your ... to ... ... ... ... ... the projects you hope you're going to share\nSimilar online you while you're done you're Native American public radio station DePaul we used to have a partnership between the way I Hope you review you Arizona Public Radio's\nGood morning\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nI don't know what's going on with\nNPR right now so I've been trying to oversee here\nAnd just won't go so I'll go ahead and have committed to kill under your use or good morning to all of you in a ... year old doing great so far I'm trying to her but I don't know what's going on with this deal you're in a ...\n\nBy the ugly so\nWould you commit to counter here\nThis morning okay I cannot be heard of the villages from ... new do nine one one event in your ... hardly watch a richer approximately ... miles to go to John you know just do what it is for you I Wonder Richard normal ... villages\nAnd also the ... who it was as a broadcaster strong let's say two\nOr they'll show launched\nIt is we continue to speak or Leno semi located\nJokes you know how we suddenly to sixty four in second this area\nWas job on numbers like tuition and three by ... by it our number is nice to each other then three\nBy five to five\nOr six more middle of ice fishing volunteers and committed to vote for members are she be reduced lunch station is educate the community of what the importance of key why are you really you know doing the\nAnd also the\nRadio station going member our phone numbers and activists are three by by by remember to southern committed you know we used to ... by military ... done it all on although buck to move to this is a sporting event to beat it to the killing or\n\n\n\n[noise]\nOr\n[noise] [noise] [noise]\nYeah yeah yeah yeah\nWell uh\nYeah yeah well I I Am\nA re oh hey LA oh\nMan oh yeah yeah\nAnd they end\nUp on yeah about five I Know I live in\nA bank yeah Ali I Am way I Am I\nA a a A R A L o\nNa na na ... oh yeah yeah\nYeah yeah and eh\nThey live on yeah well I mean\nAre they eh yeah all they have a a way I Am I Am\nA re oh they are they are oh\nBut four sixty dollars if we can be good to have permission to seafood evidence or does it get to know what I'm saying to Richard ... millions and billions and trillions of listeners all we're all we're all oh but clearly couldn't a cat\nIt's noon you could not uh fortunately the key why are you there\nIs no eight Nineteen and they'll be coming back to you with your window into very short bit so\nStay tune\n\n[noise]\n\n\n[noise] [noise]\n\nOh [noise]\n\nOh oh oh oh oh oh [noise]\n\n\n\n\nOh [noise]\n\nOh oh [noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\n\nOh [noise]\n\nOh [noise]\n\nEnjoy the weather while we have eight\n\n[noise]\n\n\n\n\n\n\nEight twenty five ... radio station and nine twenty five people to do as soon as ... community ... years old ... in up to see what the weather's going to be like the rest of the day he is a great ... so far\nIt wherever great whether\nThey'd be ten and a lot of moisture so hopefully we get more but let's see what's going to be like the rest of the day here\nOkay keep skinny bully people in the midst I look I ... and currently just sitting at forty eight degrees so it's climbing up Erie was down to about a forty five this morning it\nToday as a kid at a fifty percent chance of showers for keeps getting area for the beep and Jim ... and just the every fall before ... and in other words will be most of the crowd with a high Niro\nFive five fifty five south wins button I Do live in ... in the afternoon and for today for me I'm not a place to be about thirty six\nThirty percent chance of showers mainly before eleven PM it'll be most of the crowd was a little early to thirty seven degrees west to solve West Windsor only six miles roller becoming call me the afternoon or comment investor midnight man I'm we all you know just one anyway\nI guess I didn't have enough cup of coffee or something but I'm going on here\nOkay for you quits movie ... and up to ... where the oh yeah I Hope the Carter center area currently city it\nForty eight degrees also this morning because movie and kick do you have a what a fifty percent chance of showers and areas a while before I live in an otherwise you'll be mostly crowd with a ...\nI'm near a big ... degrees west winds about ... miles per hour\nAt Fort today you're looking at a buddy twenty percent chance of showers there'll be partly cloudy with a lower on thirty six degrees south West Wing sort of by muscle are becoming calm in the if they're noon\n[noise]\n\n\n\n\nOkay continue with your weather here or\nTo proceed area among the few people as well get the tone on it is they go by made Syria ... springs curly bill area today you had like forty percent juices showers\nAnd area of fog before Lebanese game otherwise you'll be part of a sudden it was a ... D nine degrees so which one is about five to eight months Barbie coming North West in the afternoon\nAnd what's your name on a couple of years looking at a twenty percent checked showers you'll be part of the cloud with a lower on I'm forty one degrees north of North West Windsor on five ... becoming calm after midnight so that's what he's like Don ... torn on this disease cutting the Donny mom cook the area\nHa ha ha ha oh oh ha ha ha ha ha ha ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha ha ha ha ha\n\nHa oh hey ah they have the game here\n\nAnd they all\n\nHave ... I Know I have all over the hill\nHey I\nPaid ... ha ha you know he\nKnew\nWhat they should know\nWho who really know who\nThey look they look really nice to have a a a a play like\nWhoa whoa whoa\nWhoa whoa whoa whoa\n\nWhoa whoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa nothing go oh you know a\nLegitimate issue like Jay Leno show or the middle of a a day and I\nKnow who the hell do\nOh\nWell you know who oh whoa whoa whoa whoa\nOh no no no no I Love you know a\nBig budget AJ Jay the guy that\nThey'll say hey I'm way all day\nIt's like they said look we know who who\nLooked it looked like who\nWho who the other is oh\nHey look you know they will\nThey'll have a a a big cage ...\nWho\nKnows\nWho knows who\nThey look like the guy who\nDo have a\nClue who oh whoa whoa whoa whoa\nWhoa\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa\n\nWhoa whoa no no no no no no no we're not\nGoing to take like Jay Leno and all over\nThe man\nWho who who knows how long\n\nIt'll grow how we're doing a little bit\nLike those who are going to go to\nJay Jay Jay Leno able to build a\nNew all over the whole whoa whoa whoa\nWhoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa\nWhoa\nWhoa whoa hey go in and go ... or\n... or ... or do we do over the middle of a\nNew law will go\n\nWhoa whoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\nLook they look they normally would\nHave had a play on a day\nOr two years but we eat\nThere you know\nWho are ... there is there any way or another rule\nThe man\nWho really know who\nWho are getting really ill\nPeople who are not\nGoing to go to\nWho who who\nWho should go do real no I don't know the new\nYork oh whoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa whoa no no no no don't go overboard on\nIt or not you know who\nWho oh whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\nWhoa whoa oh no no no no it's not\nGoing to do is they'll go on a\n\n[laughter]\nA lifetime with a guy\nWho was on a more of a job or\nIs she oh well okay you had a ball game or a cat or\nA job to call\nA non uh they teach law has a a job in a in a\nIn a\nCouple of years ago a law school and you often\nSee oh whoa whoa whoa whoa whoa okay no no not a good day a day\nJob as a non smoker and only on a piece to like a da da\nWell do as soon as I Am and always wanted to say it was a great morning I enjoyed my ... year and hope you enjoy your morning listening to these big need American indian music ... ...\n... ... am and I just wanted to see that your tune in to the doctor programming or and I hope you enjoy the good news is brought to you here on Columbus Day he I don't know me know Columbus you [laughter]\nIt really ... and ... by now like if you win them until you start though by the ... I'm ... I'm going to say you must move by the ... ...\n...\n... ... none of my knowledge I cannot be hardly any look about ... ... it does seem ... how do they do Wilma 'cause there's no need cook clean we buy guns I'm\nAccused Monday that by bus and the ... when I Am a Ninety by\nHow can kill all the way up in the ... I'm ... I'm In a ... a lot of the week by some of the matter low and and play and said we do eat more when they tell me ... let the ... D\nYou can play a month so I'm not an image and not you know you need to play I end up doing it with you about anything during the place of worship God did they give it a seemingly ... side but you know they've got to tell you the best in the uh the flu shot ...\nTo ... to ... we wouldn't have done what you just dial you can put the ... and the answer to all be called me to Monday ... wouldn't wasn't a time when he named ... and decided to check you and your ... and\nYou know you can put me into going oh you'll get behind ...\n... ... candy and he called me ... ... ... no one that he can permanent immune to throw at me told me ... all of them you want to remind me with all the ... ...\n... or ... maybe ... saying you knew what we do you do you hope when I went to anyone using it on when when he weighs so you'll have a good\n... lawyer Monday a member of ... just another Monday morning so let's put it on dismantling\nGreet each other with nothing but kind words I don't want to see you again I'll be back here on the Wednesday morning six o'clock so the children under six o'clock and you'll be enjoying this good native ... couldn't give me a T you hear from key why is meant to morning was your ...\nOne in your right so I just wanted to say ... years I was wondering really random only\nBetter known is where they go crazy couldn't die yeah\n\n\nYeah oh oh oh yeah oh yeah oh I\nI I Know I don't know I don't know how I Know all all day all all I Know how how old are you know I Know I said oh\nOh oh oh oh oh\nI oh I don't know I oh I I I oh I Know I Know\nShe is my girl she is my whole world she said she will love me through the\n... I Know I I I oh I oh I ... I oh I I I Know\nI Know I Know\nI I don't know I Know I Know I\nI I oh oh oh\nI Know ... and all of a I'm a I don't\nKnow I I tell ya yeah oh oh oh oh oh\nOh oh oh yeah oh I oh I oh I Know I I own\nShapes sad I Know I I can bring joy ... well okay ...\nOh oh oh oh oh\nI you know I I I Am I oh I I I oh I Know I I Know\nI Know I Know I Know I Know\nI I Know I Know I\nKnow I ...\nI I Know a A R O L hey hey ho ho ho I Know\nI don't know\nHow ya oh I Know I I Know I almost\nNo way I Am that boy that can bring heard Joe or I Will\nSay hey Kara ... heard I well I well I well I Love her and\nSay oh I oh I I oh I Know I Know [noise]\nAnd boy that can bring heard Joe or I Will pay\nCare how her I well I well I Know I went to a lot of her and\nI I honestly held on I don't know I\nI don't know I Know I Know I\nI I Know I Know\nI I don't\nKnow ha ha ha ha you know I I'm a man I'm On my own mind how how how long I\nI don't hang hang ha ha ha ha ha ha\nHa ha ha ha ha ha ha ha ha I don't\nKnow why he changed my ... my home she bangs shame ... thank you ...\nWell I Wish you well I\nWell a lot of my mom ...\nNa na na hey I don't know I Know how long\nShe is my ... my ...\nSays she will love me true it was very strange saying I turned mine on her mind and she said\nWell long term Lauren thank you know\nI when I\nWent down I ... I Love her more I well I well I well I went down a lot of her more harm\nBy ya know Mariel oh why oh why oh hey I Know I Know I don't know\nSo who do you do do\nDo do a movie no I'm a jog John\nWho feel all real [noise]\n\nAirlines manners sharing your story ... ... [noise] how can reach airlines prevention program might encourage you to find a reason you\nOnly can we can't we can't campaign ripping of local people in Oregon I think he was from northern Arizona we care about you I mean when we cannot community and we are\nHere to offer [noise] how come how come when you know we don't get it national suicide prevention might it's open twenty four seven locally we cheer might need if you support my family taking calls Monday through\nFriday three to seven PM I ... haven't haven't for sixteen pretty fine we encourage you to empower an honor your mind [noise]\n\n\n\n\n\n\n\n\nBy people what the other moon this is it ... and you're listening to the eclectic music mix on K. U. I. eighty eight point one\n[noise] [noise]\nWell\n... ... ... ... ...\n\nPeople what in the mood is is it ... and you're listening to the ... music make some ... ... one\n[laughter]\n[laughter] [laughter]\n[laughter]\nNo no no no no no no\nHe's got a phone call a ...\nWe\nAll know he got all of them\nUh well uh we\nJewelry and I just\nKind of funny like you know [noise]\nMy mom was born in New York my dad was born [noise] when my dad was um [noise] you work for the navy [noise]\nNo no no we don't mean the public works all grown up the most loyal to the ... [noise]\n[noise]\nThey want to know why don't you come back to try to come we supposed to be like when my mom and dad they you know [noise]\nUm\nHe\nWants to be content than pro or\nCon drive to the people who crime oh that must make enough money then kill somebody\nTo eat a lot of women who\nDon't we just have a greater pressure\nI was on the sea of course he was he known as to why you to tell me\n[noise] you know you had to make the best way I'm the kind of like the ad in\nThe world who we are I knew it was either ...\nWho is that okay not Bible\nUm\nNeed we need to\nBe content na na na\nNa na na na ve to\nStay in a way and then when\nYou say ...\n... ... I Know\nHe's got a phone call huh ...\n\nI'm a guy\nYou know a ... ...\nMm\nNah a war about oil a ... or you know I'm a\n...\nA look at the top\nTony ...\nMm [laughter]\n[laughter]\nNo no no no\nNo no no no no I'm using the same [noise]\nHang on a man a you know we have to follow him on the uh said he was going\nTo\nGo and you know there's only one who ... who may not um\n[noise] I mean\nI don't know who who um mono man John who are in\nA yeah I Know the long run you know na na na na na na na na na na due to the\nBank account on how long have you tried to ... I'm On I'm\n... I'm I'm a long way off we come on and on a single mom man the\nPhones ... ...\nI'm ...\nI'm On a mountain pine cone hockey I'm all for money all we know when they come\nOn in a in a day or a man from\nThe ... come\nOn man and they are you in a game for a day\nAnd the band or a comment or\nA different time being on my mom's mom and mom a\nWay to find although I'm a ... or ...\nMaybe\nNot in a way to the ... ... ... or ... or ... years ago a ...\n\nYou know he I'm buying and and I know who I'm going to be a a a a bad day game and you you\nI was a\nClean home for a long\nTime my son who's ... and why why\nWhy not Obama much control [noise] wonderfully\n[laughter] [laughter] [laughter] oh God\nHe will be a ... a movie called ... or ... or\n... oh man\nHe can no\nOne man ... no no no no Neal who he'll be a man cannot be a whole meal in a row a\nCon man who he oh\nMan uh who were on the overall\nA new one man\n... only\nA running all non on loan\nFrom the\nNew for me to the to the new\nThe new\nA new way\nTo play a game a comedy um I ... in the ...\nThe car who\nHe is\nWell what do you do get\nA new way to buy any kind of a\nA little lame a comedy um I ... in the ... the car he\nHad he had local can make a call ... ... ... a little over ... ... now\nLook to\nDo it for them to come and go to jail for ...\nTo ... ... ...\n\n... and then you can you give\nThe lotto although we know who is who need to pull away from me to call me the ball to blow up a woman who does the globe on a\nHe he he Paulina ...\nBecause the\n... who who he calls me to go on a moment to\nMoment leading\nTo buy a new a new long term\nCapital gains ...\nHow do\nThey call ... ... who will ... will come to think\nWell he he took ... billion a year and he\nSaw a clue\nTo the level of the ... to ... ...\nDa da da da da da da da da da da da\nDa da da da da da\nDa\nDe la ... not a you know the only people\nWho may not be able to\nPull up a bill to pass laws while he all we all know knees\nFor people to do\nOne or you know go to the ball to\nLay on the same all compounding McCain old\nGame called la ... due to bad meanwhile all the way all the\n[noise] [noise] [noise] [noise] and I\n\nThink there's I think there's a school [laughter] yeah\n\n... ... ... ... ... ... ... ... ... ... ...\nAre you in my dream you know we were\nWalking yeah and then on was Sunday we sure laws on my ... from ... ...\nWe're so much time alone was you\nKnow ... to ... ... ...\nA meal knows why is this so I'm a real show ... nine\nOh new\n\nClothes clause stone ... be lying in the sun Tony was the\n... the you know ... ...\nLoan or still shows no line ... I'm a real show Roxy I'm nine\nO O\nLone Star state in Mercedes my small place ...\nMailer yeah this is a ... [noise] I don't know why you\nGuys do the to the\nPhones no no no\nNo the ... news and you can do\n\n\nTo make the case and ...\nYou can do to change and then when the\nMay ... new ... new the new\nMeaning they need to be the man he made\nA reminder new\nFor me to\n\nDo and um [noise] I Know but [noise]\nThe the job it was better than no less than a\n... a ... in the past are we learning math so last year\nOr two that are older you are the car can there was on how I Am from Long Island\nAnd these ... magic\nOh [laughter] oh I think for a bomb on the side of the landslide [laughter] from Raleigh so gosh\nWell good\nStudents and bumper let me know you don't know if somebody's barrel about this time for them on a male and the demand for Columbine and some were a man\nFrom the from the ...\nWhen God of all my oh my God I don't know why is\nThat he\nWas a lot from some guy going on here five years from now ... ... ... times\nToo often we go now though some holy man shot by a book by all the town I raised on\nLong held up by a body of this study showed about ... people are worried about their toys or that\nThe only way you know and so we'll see a\nBig proponent of there's some magical maliciously hero and move on and the only way you know the last time I am to my mind\nWhen we come from a movie and you know we try and do what do we think we have to\nBorrow it from ... to ...\n\nFor the phone from the people\nTo buy a competitor to try to stick to the town of about ... ... I'm sure some\nPeople\nWho\nKnew a lot of them uh who who uh\n[noise]\n\nOoh oooh oooh oooh\nOooh oooh\nOooh oooh oooh oooh\n... a ...\nWho\nAre on a new ...\nA night or are you in\nA low ...\n\nWe are ...\n\n... a new\n... or ...\nOr\nThe two you\nKnow on a a\nA\nA ... he\nKnew\nHe loves he sees\nA\nCalling\n\n\nIn\n\n\n\nTo a\nNew\n...\nWell I\n\n...\nOh golly\n\nYou are listening to K. you why what eighty eight point one essay M. N. K. U. I. L. P. upper ... eighty nine point one FM projects the Hopi foundation streaming online at K. U. I. I. dot net your Native American public radio station\n\nDiscussion coming up we'll hear from a professor about what students are saying any Oklahoma City\nTeach me or leaving home is right near me the proclamation forward that CDs first indigenous people stay he talked to his earlier about this historic moment for Oklahoma he sang in Oklahoma City in the state of Oklahoma have never officially acknowledged Columbus Day\nI'm the mayor of of the capital city of a state that that is the home of thirty nine Indian tribes and and so um I think that that gives Oklahoma City a a a special role in in Indian country and um [noise]\nFortunately though we had this kind of I'm back and forth argument at our at our city council meetings for the last two or three years [noise]\nUm and ultimately resolutions have been brought forward to declare it indigenous people that were defeated and\nAnd you know I don't know I Can't speak to the past I wasn't there wasn't a Mariette I uh I don't know why that\nWent down the way it did um but when I came into office earlier this year as the first native mayor of\nOklahoma City I remember the ... tribe which is actually based in northeast Oklahoma but um but but a couple of hours from Oklahoma City but we never had to actually never had a tribal member who's the mayor of Oklahoma City and I came into office certainly\nYesterday and none of the other on on on on the ... and ... you go on and on the you know he's been based on anything I mean you've got an\nEmail ... ... ... you know and I mean NATO is based on that one eight hundred to eight to five nine to ... a case to be carried out a message from the Centers for Medicare and Medicaid services had\n[noise]\n\n\n\n\n\n\n\nThanks for tuning in Geneva of America going um during the day when from inside a blow and we're in knowledge in cities and towns that are celebrating indigenous peoples today in our there notable needed individual you think could have a federal holiday means after them goes\nWith your thoughts in ... is one eight hundred dining six to eight for each and we do want to hear one does indigenous people's day means to you one eight hundred nine six to eight for aid is the number and thanks again to Mitch ... Los Angeles city council member\nRepresenting the thirteenth district uh he was joining us to talk about what this means for the Los Angeles and also in Los Angeles Justin King Donna he is a development director for United American indian involvement in member of the Los Angeles city\nAlso a county Native American Indian commission and Joseph is ... percent juices things for continuing to be here with us and um what I mean we heard a little bit of the history and\nI'm exactly how this came about but what does it mean here is October ... twenty eight team it is indigenous people being one of the largest cities in the country and maybe around the globe it's got a pretty big numbers what does it mean to you is\nThis really means that we have an opportunity to impact some quality change for our community and really give some substance to say that our young people matter our elders matter\nAnd although this is one major success for for us you know it's one thing about us on the back and to say yes we were able to to to do this together but now we must look for when muffled for that providing quality health care for people\nWhen it must be able to look at how do we continue to tell our young people it's okay to speak your language they might be in a public school was there one of\nThese students in a classroom they might be the only student at the Indian you know oftentimes I tell\nPeople you know people look at Los Angeles and they immediately immediately think of Hollywood and they think of the glitz and glamour that that brings\nBut I also see Hollywood as a barrier I see that as perpetuating negative stereotypes for our people especially our youth\nAs a our young men what can they ever aspire to be do they want to be a politician do they want to be a marriage or they want to enact some type of change for their tribal community and how do we place them in a position where they can do those things and I think\n... racing stereotypes or examples of hate or negative stereotype that continuously subjugate us or hold or or keep us back from accomplishing things must be changed and I think that's what we're doing we're Columbus Day I think they have the member expressed it earlier\nUh Columbus Day never Columbus never actually set foot on the continental United States but his impact on the indigenous people that he was in contact with\nLead to genocide not only their butt genocide here in the Americas as well and I think we're trying to ah continuously solve those problems those historical traumas that are in place are the reasons why are people drink are the reasons\nWhy are people can see long term career field or a career advancement\nUm and so we're trying to figure out how can we utilize this energy in order to ... and and push push it to other issues you know a one of the things that's happened have been beneficial is the power of protest\nAnd we've seen that a withstanding rock we've seen that with ... and other places are people are young people are getting energized by this and they want to take action they want to be a part of their tribal communities which is good\nBut they also understand that they have a tribal community here\nIn California and Ninety percent of the American Indians now live in the cities and so how can we continuously provide them the resources and services that they need in order to be a successful long term\nYou know there's been people who are asking these questions to about ... indigenous peoples gay but how do we keep this dialogue going year round\nAny thoughts on that one eight hundred nine nine six to eat for aid to ease the number and let's go ahead and take a call we're going to say Hi to Karen who was in Tennessee Mexico listening in on Kenyan can thank you for giving us a ring and tell us somehow you're celebrating\nNow live in the cities and so how can we continuously provide them the resources and services that they need in order to be a successful long term\nYou know there's been people who are asking these questions to about okay it is indigenous people stay but how do we keep this dialogue going year round any thoughts on that one eight hundred nine nine six to eight for aid to ease the number and let's go ahead and take a call we're\nGoing to say Hi to Karen who was in Santa Fe New Mexico listening in on team Karen thank you for giving us a ring and tell us somehow you're celebrating indigenous people the\nWell I Am a member of the ... tribe and I'm a vice president of the Santa Fe and the and the center and we're on the plaza in Santa Fe today we have come down to visit us and we're watching many different tribal dances and speeches from\nTribal officials and city officials and we love to see him\nIn a caring what are some of the words that you know people are going to be sharing if it's about educating um what are some of the things or maybe even things do you hope will be discuss today a and some of the speakers that to the podium\nWell in the past our tribal leaders had talked about how we are hearing the Santa Fe standing on ... and that's something that we honor and we hope that I Hope that we'll talk about that today as well [noise]\nUm [noise] and for myself I don't I think it's a sign idea to have Italian people have something to celebrate that I think it'd be nice or say celebrated something that was based on fact and honesty and a lot about killing Indians\nAlready caring and or is there any place where somebody can look up the schedule or just see who will be stepping to the podium\nYes there's a website that I can tell you quickly that um and we'll be having dances from the ... one\nOf the dancers to uh to to keep afloat dance three lightning who boy Dan says her four to five and that all in our day and there are some people at the podium and now that are speaking of from the city [noise]\nAll right thank you for that to an maybe there is a or things that are being planned or in your neck of the woods you when you tell us a little bit about it a celebrating indigenous people stay or give us a call one eight hundred nine six to ... eat is the number and we appreciate our caller out of Santa Fe New Mexico\nAnd you were going to grow the conversation Ringo to Fairbanks, Alaska now I have to say hello to Dr sheen Sean a top cocky is an assistant professor in the school of education at the University of Alaska Fairbanks and he's in the back and Sammy our pleasure to have him here Sean thank you for being with us\nA quick enough of a a A N thank you good morning\nAnd Sean thank you for a green miss even in your own language and it's exciting that they're even one of those words I recognized\nJust um are years here I'm listening to indigenous people and bringing that language forward in China I think many people are using this day to celebrate language John for you how are you celebrating your culture on this indigenous people say\nOh I think stay away at the statewide level we're celebrating and encouraging people to [noise]\nFirst of all I'm rarely there Rick yoyo showed that [noise] um ... pride and resiliency that we've had worse so here after um [noise] of hundreds of years of colonization and we're still celebrating our heritage is\nAnd we're um we're I'm Still I'm Still celebrating um our our ceremonies\nOr language or or food um everything else that defines who we are\nIn a little bit about uh the University of Alaska Sarah Banks a women they started celebrating indigenous people's day\nNo before and I'm a ... the University of Alaska Fairbanks celebrated Alaska 'em in twenty Fifteen actually made a proclamation as the Governor Walker and twenty Fifteen\nOr had the ... the ... second Monday\nAnd J I feel\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\nThings for spending some of your indigenous people Dave with us today here on Native American calling and we have opened up these phone lines to hear what this holiday means to you and maybe even something\nYou've been planning all year long like celebrating indigenous people's day for the first time in your own city even\nYour own state tell us a little bit about it by calling in one hundred and Ninety nine six to eight for aid is the number and does your city or state recognize indigenous people stay what does it mean what does it mean if they don't want to eat hundred Ninety nine six\nTo ... feet and let's go ahead and take some calls we're going to say Hi to max in Albuquerque New Mexico tuned in on Kenyan max thank you for giving us rank your honor\nYes All right um\n[noise] um have rooted in Albuquerque New Mexico a little over Thirteen Years now and I'm among other things are going to try and through a trigger wage true true relationship between\nIndigenous people the nearest toaster so one idea is to work together to create unity guard\nWill include the indigenous people um food a little I don't know I Need to know about all of that but I think a\nPretty good opportunity for people to work together on a community garden are based on people food items will be one way to serve\nTalks in journal about the contributions or the richest people have made in January today\nMax at a wonderful idea and you know we're going to do some of that tomorrow\nTalking about corn in\nWhat it means and um you know when we talk about wanting people do get more understanding of who we are as indigenous\nPeople in educating especially the culture what are some of the things that you use this date for a do you use this data as critical questions about sovereignty or a talking about it call is one eight hundred and Ninety six to ... for aid is the number and what do you think about indigenous peoples state\nIs it enough or their limitations to just having a holiday one eight hundred my nine six to eight for aid is the number let's go ahead and take another call we're going to go hand in the high to Steve in Oregon tuned in on ... and so Steve thank you for calling Irani\nThank you very much I was a teacher for forty one years in Oregon\nMight dissent culture is Ukrainian American immigrant one hundred years ago [noise] I I support very much this wonderful construct a step forward\nAnd part of education well of course ... to ... so helpful to everybody and all of this very day\nSo called Columbus Day in Nineteen sixty two was a tremendous hurricane like storm that went up as well when I'm In Oregon\nAs there are many as sixteen different tribal groups there along with everybody suffered through that horrible storms and of course I mean could change that says this is such a great step forward\nAlright thank you for your call Steve uh they're listening in on key to the U.S a couple of minutes\nLeft one eight hundred mining six to eight for eight to join us and let me bring our guest back in ... cocky is an assistant professor in the school of education at the University of Alaska Fairbanks also here with us is Joseph king\nDana and development director for the United American indian involvement and\nHe comes to us from ... Pueblo and she wanted to ask you know if we're talking about bringing indigenous peoples team replacing it with Columbus Day oh what are your thoughts on people who say why can't we celebrate both\nUm [noise] gosh I I don't either who um [noise] in in my humble opinion you know I was just speaking on behalf myself I think\nI'm celebrating Columbus um which is ... actually celebrating genocide ... celebrating um [noise] a lot of atrocities that uh you know slavery\nI'm Irish and that um Columbus should is not really known for it and there's a glow who has written rethinking Columbus to encourage people to read\nStates or has a series of articles of of all the atrocities that ... they were ... um me\nI'm shopping taught in schools\nEither maybe even um you know unlike history is mean touch of these kinda things and I'm just going to turn to you to read from today's proclamation coming to us from US President Donald Trump I'm speaking about the discovery and here's here's a line from it um the proclamation\nReads his expedition we're talking about Christopher Columbus I formed the initial bond between Europe and the Americans and change the world\n[laughter] I'm shopping taught in schools\nOr either maybe even um you know a light history ... mean touch of these kinds of themes in I'm just going to turn to you to read from\nToday's proclamation coming to us from you as president Donald\nTrump I'm speaking about the discovery and here's here's a line from it um the proclamation\nReads his expedition we're talking about Christopher Columbus formed the initial bond between Europe and the Americans in change the world for her to me in that spirit we continue to see the New Horizons for greater opportunity and further discovery on\nLand and sea and in space and still ... says how does that sit with you when we just\nWe we constantly hear when we do this program we do it many times I haven't gone through the archives and seeing how many times we have seen 'em about celebrating Columbus Day and but we get this history with the discovery meant for indigenous people here we have\nA presidential proclamation forward today I'm Talking about in initial bond between Europe and the Americans any thoughts\n[noise] that's why changes important and that's why we must continue to advocate and educate our community not just the native who we have continuous contact with but most importantly the non native public being inclusive to them because they'll find we have a lot more support\nThan we realize when we look at something like the federal ... who's in place who who shares a message that's problematic for us that's difficult to take on our on our behalf but we can't\nSit sit idly by and and and wait\nFor anybody else to come in and solve the problem we have to be the ones to provide the answers to those questions that are going to happen overnight and what's not we you know there's over five hundred and sixty\nFederally recognized tribes across the country are they all going to agree on it you know they're not but what can we do to let folks know all the way up to the highest office to say we matter we exist\nEven to this day ... ah like ah my colleague who's on the phone to mentioned before the resiliency that's they're the hope that there but most importantly a thing having someone said to you that you were\nFound that we discovered you that you didn't have a court system that you didn't have a government that's difficult to process imagine are young people are saying are are buying into that and they're saying you know what I don't want to be Indian I Want to be American that fits a better concept where it's going to create an easier life for\nMe and that that's difficult to understand you know a lot of people today they say when they live in the city they live in two worlds and and that's difficult because being Indian means that you're part of your community that you\nSpeak your language that you understand I'm teaching such that she'd been shared to you and that's starting to that started to take place within the urban\nCenters are but we also have to be mindful that there's going to be\nAmerican calling reducing the number of national NATO in Albuquerque New Mexico\nLike swamps broadcasts braces native nonprofit media organization funding is provided by the corporation for public broadcasting support from the public radio satellite service [noise] music is by reading Michael David native voice on the Native American radio network\n\n\n\n\n\n\n\n[noise]\n\n\nOh\n\n\n\nYou are listening to tell you why I hold fella eighty eight point one yes and and play your way I L P upper among puppy eighty nine point why not sound projects out the Hopi foundation streaming online application you why I thought that your Native American public radio station\nEach year more than one million athletes quaint many kinds of sports sustain concussion people with a concussion hope I don't know they have why it's important that athletes and coaches learn about concussions sign up to new guidelines from the American Academy of neurology recommend that people\nThought they had a concussion be immediately remove from play golf play a space and protect your brain learn more at H. A. N. dot com slash concussion\nHe needs to buy the pike was down ... knack\n\nFor the\nCall so I'm a firm called ...\nAnd ... a\n\n... a ...\n... ...\nOh [noise] oh yeah\nAnd\nWe're close to a\nPhone call my ...\nMe a call ...\n... a ...\n[noise] ...\n[noise] oh yeah\nThe ... [noise]\nI'm I'm I'm a\n[noise]\nA ...\nOh ...\nOh he ... [noise] Mm [noise]\n... [noise]\n[noise]\nMm [noise]\nMm [noise] Mm Mm\n\nI'm On a a man\nNamed ...\nAnd ... cheese\n\n...\n... a call ... ...\nMm\n[noise]\n\n\nChange social Johnny [laughter]\nNew new\nThe new\n\n... who knows a poll on the\nWay I'm a a dream that one no no don't do\nA ha ha ha you know so well known as a\nChain seems to me I'm a painful to go to\n\nSome the shoe bomber stuff we do know no biggie peas you were in\nTrouble now my name is John John Boehner channeled when they come up so well if\nWe were\nBoth really mean\nIt was a [noise] no no junior\nIt's time to wait till the ... the the new world travel now live in a high\nChance Monday's GOP took some way to live\nIn ... you know\nThose little green\nGoes on in the June ... she's the one thing\nTo why don't why\nCan't ... I call the\nTree to sell to Greenland and the reason those is to do I'll watch them do for the call to me and you know when I was going to ...\nTo ... looking who\nLassie collies do to win that seat to tell you why in the right place for me I like to ... you can do to my\nLocal news or schools or who who were to go to Congress during the pre teens teens learning\nHow to stay single people pass through\nThe screen is the season and singing and how do you do then maybe they see\nNa na na\nNa na na\nNa na na na na na\nNa na na na na na na na na na [noise] um [noise]\n[noise]\n\nI don't know\n\n\nI'm not a\nNational [laughter] yeah\nMy ...\nOpposed to when I come to ... billion [laughter]\n... I have to do a job and not have jobs and why ... na na na na na\nNa na na na na na na ve\nAnd\n[noise] I was about nine yeah and they have a lot of my day\nAnd John ... [laughter]\nYou know their name\nAnd\nHe was mad about I'm\nNot a man and then we'll do my day and\nI are brag about what I'm saying where a man\n[laughter] you know all their friends they only when the when I'm up in\nA row where do you know reading and a ball of my day\nAnd there you know of a man\n\nAnd\nA ball in the show who lives there and I'll be the next day and\nHe knew [laughter] we have one man show or good na\n\nNa na na na na na na na na\nNa na na na\nNa\n\nNa\n[laughter]\n[noise]\nUm [noise]\n... da da da\nDa da da da\nDa da da da da da da da da da da da da da da da da da da\nDa da da da da da da\n\nDum\nLa da dum la da da da da da da\nDa da da da da da da da da da\nDa da da\nDa da\nDa da da da da da da da da da da\nDa da da da da da da da da da\nDa da\nDa da da da da da da\n\nDa da da da da\nDa da da da da da da da da da da da da\n\n\nDa da da da and try and come to be a\n...\nA ... tell me more knowledge and\nShe told me that you can do\nYeah I'm going to be a guy in the\n... group\nAnd a ... pound sign and nothing and learn about the\nPeople that don't need to\nDa da da da da da da da da da da\nNa na na na\nNa na na na na na da da da da\nDa da\nDa\nDa da da da da da da da\n\nDa da da da na\nNa na na no no no no no no we\nLive in a manner and ... and ... men and women and men and women\nCan be [noise] [noise] [noise]\n[noise]\nNa na na na na na na na na\n\nNa na na na na na\nNa [noise]\n[laughter] and you know\nThe ... the dog to the bottom ... all around ... ... in a\nBarn and argue about me that the model always to be a well a lot of there's a man and a\nHalf and hour and\n... down the\n... to ... na na\nNa na na na na na na na ...\n... ... ...\n... ... [noise]\n\nOh you're you're\n...\n... ... ...\n\nI'm a I'm a I'm a I'm a I'm a I'm\nA new thing to do that the na na na na na na na na na na\nNa\nAnd AA audio job well I'm\nNot into a new low wage you know we talk now so what does\nThat do the gay money na na\nNa\nNa do they do the right and which na na\nNa na\nNa I'm On a on a on a\nMan in the middle of the\nDay she was the last year and the ... that he was on the ... yeah you know what I Do\nWell in the June and you know they do that and the na na na na na na\n\nNa na na na na\nNa na na na da da da da da da da\nDa da da\n\nDa\nDa da da na na na na na\nNa na na na\nNa na na na na na\nNa na na na na na\nNa na na na na na na na na na na\nNa\nNa na na na na na na na na\nNa na na na and AA a uh\n\n\n[noise]\nGot a friend who said oh no no no not a burden that all of those polled the travel well\nKnow no ... made me the new\nUm\n[noise] [noise]\nOh I was doing All right to lose that no no no I think you\nKnow code\n... ... ah yeah\nI can see through ... role do me\nA me\n...\n... ...\n...\n\nNa\n\nNa\nYou are listening to ... I Hope the law any point one K. U. L. Y. I. L. P. upper ... eighty nine point that Roger ... foundation streaming online KU why I thought that Cain why I enjoy\nYour Native American public radio station following it provided to our ... year why I open radio ... and a new Arizona Public radio\n[noise]\n\n\nA\n\n[noise]\n\nA A R a\n\nM O o mine the b._b._c. news hello I'm Jamaican icon Brazil's current presidential candidate ...\nSaid he went back down from his views on gun control human rights and gender as soon as he prepares to face a left leaning tend to run off the markets have reacted positively to his victory as a sound card on the country ...\nWell no no no it has gained support sister his tough talk on crime and corruption when it comes to economic policy his ideas and the other day that doesn't stop ending the investors favorite judging by the way the stock market to working they'd rather have him ... she returned to power\nOn Monday miss most now he said the pilot Gettys\nTo Chicago train investment banker and his chief economic advisor would remain with him if he'd victorious and the second round\n... up to half a million user accounts and it's Google Plus social network could be potentially affected by bugs that could expose them to external develop as it said the shutting down Google Plus across recollection these special network it up by developers potential access to private data from twenty Fifteen\nToo much this year when in terms of the sky and discovered sixty a few in a statement cause all kinds of sounds never said anything about all I was aware of about\nOther Trump says the sex assault claims against the new queen court justice Brett Kavanaugh was fabricated and these days earlier he said he found Christine Blasey Ford's very credible but now\nHe's described Brett Kavanaugh as a man who did nothing wrong ... caught up in a hoax by Democrats not wants to impeach him addressing police chief in Orlando, Florida President Trump called the behind the capital allegations evil\nIt was very very unfair what happened to him for all these charges false accusations horrible statements that were totally untrue but he knew nothing about friendly terms\nThat you've probably never heard in his life he was this year was that he never even heard of these jobs was a disgraceful situation brought about by people that are evil and he just stood out will tufted out together\nThe Swiss bank UPS has gone on trial\nThe Democrats who now wants to impeach him addressing police chief in Orlando, Florida President Trump called those behind the capital allegations evil\nIt was very very unfair what happened to him for all these charges\nFalse accusations\nHorrible statements that were totally untrue that he knew nothing about frankly terms that you've probably never heard in his life he was this year was that he never even heard of these types was disgraceful situation wrote about my people that are evils and he just stood out we all tested out together\nThe Swiss bank UPS has gone on trial in Paris constantly helping wealthy clients invade moment eleven billion dollars in taxes by hiding their money and I'm the clad offshore accounts and trust comes the bank to screen the allegations which could expose it to a fine of how to mount ...\nAccording to prosecute the Swiss banking giant UBA used tactics worthy of James\nGone such as critics can choose to\nBusiness college for very executives that you know should you be let go their executives used to switch hotel and they organized allegedly organize hunting trips and golfing tournament so that they could approach wealthy clients without having\nTo go through with special channels in order to\nTo sway to stash their assets in cash in Switzerland\nThis is the world news from the BBC\nThe kind of Indian government has dismissed the opposition presidential candidate nor has come to claim that he won Sunday's election it's a news conference needs to come to that he had received a clear mandate from the people and without providing any evidence of victory he called on the incumbent phobia to organize a peaceful handover\nTech is president Richard type Edwin has Saudi Arabian official must prove that they're missing Saudi journalist amount has shrunk G A critic of the Saudi Government left that comes to like an instant go safely headline is putting hungry from Nicole ... reports\nDon't they have cameras if he left they have to prove it with footage Christian Edwin told reporters in the past referring to the machine generalist ... who writes for the Washington Post newspaper\n... officials kennel save themselves by saying that he left the building crushed to add one continued\nOver the weekend Turkish police suggested to push to show me who's written articles critical of the government in Riyadh Mike of being killed by a Saudi hit squad inside the embassy off the entered to arrange papers these marriage to a Turkish citizen\nChristian Edwin said the Turkish will authorities were doing everything they could to find out what's it happened to him\nAnd the French prime minister Edwin Philippe ... European counterparts and there's no national solution to migration and it must be tackled I'm an international crisis\nSpeaking head of the meeting the gene six nations and the French forgive me on this is what he said he expected the Frank exchange with its knees interior minister and I tell you that so many cars as a kid the French President Emmanuel Macron of leading the pro immigration debate in the\nProsecutors in Belgium say police have broken up of people smuggling rings that were taking around twenty miles a day to Britain offices detained ten people in right around Brussels on Sunday and and now charged seven up some of the migrants to paint any three thousand dollars to make the trip hidden in\nLaura's including refrigerated trucks\nBBC News [noise]\nI have one that's not saying [noise]\nHot man my non ... found one that [noise]\nWell I live by outside [noise]\nThat might get in there tight and I am [noise]\n\nA life with him or her comes to look for\nIn some way but says ...\n... ... with a lot of money to buy her with the little ... that took on the\nLaw [noise]\nThat's the bus him a bum but if I'm lucky you are [noise]\nEmitted\nBy [noise] they do and [noise] did download it dies in the ... the ... the Hindu\nVoted not on the dog that\nAnd allowed you to three business days player event to be added even better find are moved by getting your message our child\nListeners right away or just sixty dollars a record your information as April paragraph thirty second announcement\nEmail and bow like hey you why I done that to get on the air quality but [noise]\nAlready and for the mobile computer lab for this Monday there'll be heading to circle am from one PM to four pm more information for the mobile computer lab ninth you ate three one three six six or or [noise]\nThe whole the bookmobile bookmobile trailer is open for library services I have to hope for tribes administration complex from ten AM to four pm Monday through Thursday\nMore information for the whole the bookmobile nine to eight you owe five eight zero step in three\nThe hopefully tribal courts normal business hours resume today October eighth more information nine to a Jew all five one two one five [noise]\nLow cost me ... neuter and hope you're betting area services and kings canyon October eighth through the tent information seven three eight five to\nFive one [noise]\nDomestic violence awareness host and encouraging hopefully values resource fair and hook value elderly building October night that for P. M. more information is on line to eight shoot you five six eight seven three\n\n[noise] and then as they shouldn't have political next October night sixteen twenty thirty Thirty years\nOn the hoping health care center lobby darling at ten am more\nInformation is our seven three seven six two five seven [noise] low cost ... vaccination clinic October night than ten at the Hopi veterinary clinic details are seven three eight five to five one [noise] who handler's\nTraining at upper ... senior center October chance at nine AM more information as I step in three for three four zero three [noise] far carnival event that hopefully Veterans Memorial center October to out that fight P. M. more information is out and then three for three four\nThree two [noise] they re gave an October Thirteen or ... I guess the end starting at eight PM mountain standard time\nMore information is on line to wait you wait three four five zero zero eight kitten a smart clients October sixteen Saturday at ten am more information is that seven three seven five for nine\nZero [noise] a traveling rabies vaccination clinic for dogs\nAnd cats October seventeenth Eighteenth and Nineteen [noise] four times and locations humid down\nSeven three eight five to five one or a step in three seven six to seven five [noise] James Kenyan elementary school Halloween they're betting October Eighteenth that six PM more information is out seven three eight two three eight five\n[noise] domestic violence confidence among the legacy in October Eighteenth at one PM more information is on line to wait two to five six eight seven three [noise]\nRead better holiday class how to keep your house warmer in the winter and cool and the summer October twenty third RSVP is on line to wait for four zero five one one nine\n[noise] substance abuse prevention hosted a monster ... October twenty seven at the ... and they're starting at nine AM\nMore information is out seven three seven three eight by\nNational drug take back down to ... not the Hopi how care center parking lot beginning at eight am\nMore information is that one eight hundred eight eight to nine five three nine [noise] a dog and cat costume event October twenty nine that prevent their clinic at six P. M. details are seven\nThree eight five to five one [noise] Tony a gene girls night out October twenty nine that's the hope a Veterans Memorial center starting out by P. M.\nMore information seven three four one one by one [noise] a monster dies October thirtieth that monk appeal at CNN server city starting at five thirty P. M.\nMore information is on line to eight to eight three one two three four zero [noise] first Mesa used in that community a Halloween party October thirtieth that six PM in the first may say use center [noise] more information is our seven three seven to seven nine nine\n[noise] many how pairs up into the public November Thirteen or do you hope you better is memorial center at ... pm mountain standard time\nMore information is our seven three for three four three two [noise] a dog ... basketball even out the Hopi Veterans Memorial center November's teen Eighteen more information is out seven three for three four three two\n\nDiabetes group is it's taking place every second Thursday of each month from eight AM to Lebanon am more information is on seven three seven six two three\nOne [noise] multi\nCulture and language Russians are Tuesdays and Thursdays beginning at one PM a month or feel like they're seen in more information is on line to eight six six zero three five board to [noise]\nAll righty and their community counter update and I'll be right back with their hope the junior senior high school for [noise]\n\nAh [noise]\n\nAll righty I'm back with they're hoping the junior senior high school sports [noise] first up hope the high school all the high school cross country October Nineteen mount sack invite\nAll not all not California at the helm or large stadium beginning at ten thirty am [noise] Opie high school football October tenth versus around valley at eager JV beginning a pork pie\n[noise]\nAll righty I'm back with their hope the junior senior high school sports a first step Hopi high school or high school cross country October Nineteen mount sack invite\nAt all not all not California at the helm or large stadium beginning at ten thirty am [noise] Opie high school football October tenth versus around belly at eager JV beginning out for P. M.\nHoping high school volleyball October night versus opinion at hope the high school and that is ... night JV beginning at five PM\nAnbar city at six P. M. [noise] Hopi high school chess October nineteenth Antonia region team qualifier at Holbrooke highschool beginning at\nThree P. M. [noise] All right and that you're hoping high school sports [noise] now for hope in junior high school or junior high school football October tenth versus tuba city junior high school\nAt Cuba's city J. B. beginning at three PM and bar city at four thirty P. M. [noise]\nHopefully junior high school volleyball October night versus the St Michael's at St Michael J. B. beginning at ... pm and bars thirty three PM and by Pete and [noise]\nHopefully junior high school cross country October tenth Lake Powell invite a page middle school at the page golf course beginning\nAt eight eight em [noise] and that\nYou're hoping junior senior high school sports and for more information and all hope the high school and hopefully junior high school sports activities humid down nine to eight seven three eight five one\nOne one [noise] All right and that's going to do it for your community counter update for this Monday October eighth two thousand eight Jean and if there is information you did not hear states United seven AM eight am Noone in\nFive PM when he announced community countering bent [noise] if you value K. you why I Hope the radios free community counter in which they continue to support our mission\nConsidered becoming a KU why I underwriter your financial contributions aren't as more will help us prepare for an even brighter future and allow us to return to the normal broadcasting you depend on daily [noise]\nJay you why I offer support of underwriting to get your message out to our listeners community countless other missions I let you into\nOne sentence which you just take take ... seconds to read\nFor just sixty dollars to record your information as a pro paragraph dirty circuit announcement to reach out thousands of listeners email info like why does that to get on the air quality but\n[noise] and that their community counter update coming up next it's your updated weather [noise]\n\n\n[noise] Mm\n[noise]\n[noise]\n\n[noise]\nNo no no\nNo\nNo no no [noise]\nOh I'm\nA\n\nI'm a writer right well I'm a I'm a I'm a\n... a man [noise]\n[noise] oh\nOr\n[noise] or whatever [noise]\nOr [noise] or [noise] [laughter] [noise] [noise]\n[noise]\nI'm In a nice\n[noise] [noise] well and I think\nMy gosh I remember um [noise] my dog [noise] now and I'm saying [noise]\nNa\nNa na na na na na na na na na\nNa na na na na na na na na\nNa na na na na na na na and go into ... [laughter]\nI just feel that way gone or [noise] or about to go but [noise] they're more\nThan enough to go buy a\nCar [laughter] dollars should do is try and find a\nJob or [noise] [noise]\nNo no no no I'm [noise]\nI'm a I'm\nA ... na na na\nNa na na na na na na na na na na\nNa [laughter] you know for her or\nA [noise] a a a\nA\nA a a\nNice place to make money\n\n[laughter] [noise] [noise] I\nWould have been very neatly tended to be treated me live near the laws that say they are and then they also worry that you're\nNot a ball and no matter who ... who I wanted to talk to and I show last three\nAnd a half an hour long and I think about when she was a man or a laugh cry\nAbout are you already know what I'm asking you know as long as she was mad about\n[noise]\nA little da da da da da da da da da da da da da\nDa\n\nDa da da\nDe la ... and ran away or\nBobby I just have\nA holiday\n[noise] [noise]\n... ... ... a man had\nA hard ... not well why\nAm I on the line I get\nAbout when she went blind [noise] snipers crying on\nThe job that you are right now I'm Down by Dr last you know she is a bad\n[noise]\nOn a long time since I've been out of my friends die [noise] down around like a child I thought about just\nA comment\nOn channel\nOff [noise]\nLand\nA\nMan or an hour\nThe Republican [noise] real\n[noise]\n\nLoni boy [noise]\n\nOne on one in my back the guy that like you just say a lot of them do\nAnd and get paid a dollar and that\nTime and I will get in and out and the magnets in there and and and you know like I bought the Lynch and over again and I like that or a nice guy and a guy and young man in America now and\n[laughter]\n[noise] um [noise] the ... to ... [laughter] [noise] I enjoy\nIt [laughter] [noise] [noise] [noise] and\nYou're listening to tell you what I what Bela ... once one F. M. K. U. L. Y. L. P. upper ... eighty nine point one FM projects or the Hopi foundation\nStreaming online at ... dot net your Native American public radio station that's no song hallelujah twelve years started when I was very young ...\nAnd there was a time when I met\n\nA guy John Montanaro you want to have got to have no boundaries he's going to\nGo to the Dodgers [noise]\nYeah do they even allowing them\nTo do and I both of\nMy\nUh my you know I don't know how to\nLand right now you know\nOn top of my friends used on the wall and in the back when John hold on please Donald me shouldering\nThe how old are they called and joins blow whoa wait a second and baby you're our ran out of your family\nIn the journal because you're reading and we will\nWe remember when my mom I don't know I\nKnow and\nNow while you're on the counter and helping them\nTo the bottom oh no no I Will be a lot of\nPeople here are so\nAfraid of the day and what was what was your what your\nMom would say well you know\nAs you I write ... no ...\nNo no\nOh my God\nOh my God you know when I Do while you're there you know\n\nI Know I\nThink I think if I had to actually see the uh did you did you say are you finding a way like you\nMentioned worldly over matters of the ... I Know what you do when we're out and\nBuy their own little by little\n\n\nMy\nMy [noise]\nMy [noise] my [noise]\n\nMy my my my\n[laughter]\nYou know they don't really know how they feel\nAnd\n[noise]\n[noise]\n[noise]\n[noise] [noise]\nMy my ... my my my my\nWell no no long term to name a new one [noise]\nMm changes like go if then too I think I'm not here to want to know when I'm ... and you can see\nThat you know so they are now yeah I'm not saying I live in a\nWhile I thought oh my gosh I'm I'm\nA\nI'm\nA na\nNa na\nNa na na na na na na\nNa\nI everybody this is Molly O'Brian and this is rich war you're listening to undercurrents American music with a passport\nDue to the [noise] and then turn the term [noise]\nAnd then yeah it's been\nReally see the sun and\nThen he does it change the ... and ... and ... and no no\nWe're gander at the time and change the way down the middle name than we did the da da da da\nDa na\nNa na\nAnd then not\nBeing on an old man took me a break and they had the nerve to\nHave these these songs and how can we may be greener and well we got here and da da da da da da na na na ve about you\nKnow but he he you know that the na na na na\nNa na na na na na na na na na na na\nNa na na na na na na na na\nNa na na na na ... [noise]\nAnd they're on and on and on and on and I and and\nYou know I mean I don't know man a man and I don't want to hear you on the line but I I\nAgree I don't know I mean when I was on the line now I'm In\nA long long long long\nTime gone now I'm Marlon I'm ... I'm ...\nI'm going back and say well I dont do it all in one way you're going on for a long long long time and they're not very well and\nI and I I mean other than a big\nDinner and you know like the button and I'm going to be normal and we want 'em there's no you know there are a lot there were ... and ... and\nYeah\nThere are\nLike oh I Am and I know I'm a young boy about ... minutes or ... and there's not enough air I'm and\nI'm like oh no no no well man up here you know there were a lawyer and both my parents were\nHere in the morning and I\nDon't have\nTo\nMake you angry but I\nDon't know why she mind no money no man you know there are\nThree and a little older and older than I Do spend a lot more you know they were going to be in you know when I was going on here that it's not a lot of the [laughter]\nDrawing the line and then going back over and over [laughter]\n\nI don't know and\n[laughter] and show [laughter]\nNot on\nMy nerves [laughter]\nToo I'm sure your\nShirt on their own shame\nAnd and I and I am and\nA really [laughter] I don't know some of the banal banal mommy [laughter]\n\n\nMe too yeah my name\n\nIs Amy in\n\nSt Louis oh man he was the end when he does he owe me\nNot to do\nWhen he when he came on oh well see I don't\nBelieve that\nHe didn't really\nNa na na na na na na na na\n\nNa na na na na na na na na na na na na\nAbout a year and a lot and and I were to all of them\nAre gone I I\nDon't know ... ... you know do I want to know chosen my friend you know what's wrong with the money now I'm walking down a bicycle from Beijing\nNine or ... and ... you know I read the whole town [noise]\n\n[noise]\n[noise] nah\nNah nah nah nah nah nah nah nah [noise]\n[noise] [noise]\nIn fact\nYou know will be well I'll tell you know not I don't you know one called ... wars you know in the\nLong run and run around about it and I read a\n... year old man [noise] [noise]\n[noise]\n[noise] [noise] [noise]\n[noise] no [noise]\nUm [noise] I'm a\nLawyer John ... no I don't know I don't want you know and don't down from we're going through your\nToll on the line with around a lot [noise] I Am all down into the in the mountains [noise]\n[noise] [noise]\n\nSo Willie Dixon dog before but Muddy Waters I'm ready for the London Muddy Waters question\nI was waiting to see pretty sure wider knows right in front of me but that's how I remember yeah much bigger more polish so we used to hear what the brass section and everything\nMuddy Waters every generation arrives good she started from the world it was it was we were cooking from I Do\nHave you just joined us work under current agree with Richard Michael protein spiritual just bad for taking the music of Greece Potter for her new album is actually not her album it's a lot of different ours contributing individual San charged a callous across\nWhen we go to Chris Stapleton grace Potter of course oh Gees as many others\nA callous crowd I mean they'll secret Stapleton grace Potter course and Jason is many others so Muscle Shoals small town\nAnd\n\n[noise] and\nShown me oh why oh why not you know\nSome of the barrel then you know\n... [noise]\n... well ... well\nBefore or in la\nDi da na\nAnd\nAA nah\nI don't want to\nDie and\nI Love you know you don't want to know a\nLot was when I was living in a row\nAnd the power and that and now the na na na na na\nNa na na\nNa na\n\nNa na\nNa na na na na\n\nNa na na na na na\nNa na na na [noise]\n\n\nUh\nThen made it was ... ... oh okay so\nThat never write a letter and that there are\nAll men and [noise]\n[noise]\n[noise]\n[noise] [noise] [noise]\n\n\nContributions from many different artists celebrating discover Muscle Shoals\nSmall town so I'd rather go blind curry powder he can find this on your smartphone when you're not driving at undercurrents radio dog yeah\nThe players deserve to just go right on through it also that journey to quickly that's truly you know a few more mature than we're doing what supporter\nAlso that's changing quickly that's truly you pay pal she'd like each other saying we're doing I Want to support\nTheir streaming here to undercurrents radio Josh yeah thanks short production team W cost a lot Christina honest in January I'm Greg mixture and support comes from the corporation for public broadcasting from the friends of Africa and from envy one stations like\nWG IRR and bread and roses Florida and W. argue about coal Illinois and this is native voice why the Native American radio network\n\nSays undercurrents I'm tri state public radio to W. I. N. McConnell Ninety One point three I find each de chew and W. I. U. W. wars ... Koch\nGuinea nine point five ... and on line at P. S. P. R. dot org [noise] try and\n\nNa\n\n\nNa\nAre listening to Cain why I Hope\nI have a point one asked why else up or ... point why al\nPacino hoping pounded streaming online can why I talk to you I hear Native American public radio to following has provided a partnership between ... and ... I Hope you radio and ... and a new Arizona Public radio [noise]\n\n[noise]\n\n[noise]\n\nSisters the b._b._c. news hello I'm Jonathan ice on President Trump has accused Democrats of fabricating the sex assault claims against the new Supreme Court justice Brett Kavanaugh\nAnd these days and yeah he said he had found the accuser Christine Blasey Ford to be very credible but now he says the claims were a hoax addressing police chief in Orlando, Florida President Trump called those behind the capital allegations evil\nIt was very very unfair what happened to him false charges false accusations horrible shape as it were totally untrue but he knew nothing about frankly terms that you've probably never heard in his life he was this year was that he never even heard of these terms was a disgraceful situation\nBrought about by people that are evils any trusted out we'll tufted out together\nJustice Kavanaugh was quickly on and on Saturday in a private ceremony but in a brand new President Trump ordered a ... swearing in ceremony at the White House later on Monday the Senate voted to confirm justice coming on Saturday divided public opinion\nBrazil's farm Wright's presidential candidate shambles they're not really has said he went back down from his views on gun control human rights and gender and sees as he prepares to face a left wing contend the runoff ... who won the first round of venting on Sunday said he wouldn't turn into a peace and love kind of\nTo to try and win centrist but\nGoogle is shutting down much of its central network Google Plus pretty much the private ... up to half a million users had been exposed the company blames a bug in the software they believe reports\nGoogle Plus was launched in two thousand and eleven as an attempt to compete with Facebook\nIt failed but Lynn Good old in the bowels of Google's boss network of connected services in March as Facebook was going through the Cambridge Analytica scandal Google it its own investigation into whether that policy option Google Plus to present a similar problem fiance was yes but the company decided\nThe severity did not meet the threshold for disclosure the whole Street Journal\nCourtship internal memos that showed Google executives were concerned about added attention from regulators if the software flow was made public\nAnd investigative Web scientist named the second rushing who Britain says was responsible for poisoning a former Russian spy with the chemical agent nobody's talking some spin off much then cap says the real name is Amanda previously United ... is talked to an extent\nThe Michigan it said he graduated from underneath medical academy when he was recruited by the ... military intelligence okay screen as from the BBC's Russia sent us\nBut it's not that much we know at the moment about ... Michigan and the way she was identified the only thing we have a his passport photos and information from the internal\nCosts but that that base Russian database so we only can see that his pictures are really similar to that guy who was identified as I can tell by the British police won't tell such huge will come tomorrow when when it got from is defined mission detailed report\nBBC News the cameras in government has dismissed the opposition presidential candidate Martin's ... claim that the one Sunday's election at a press conference to come to his head he had received a clear mandate from the people and without providing any evidence of victory called on the incumbent pulled me out to organize\nA peaceful handover a government minister described the declaration of space and legal and west US President phobia is expected to win a seventh term\nTech is president ... says Saudi Arabian officials must prove that they're missing Saudi journalist left that comes to the dentist on both safely somehow show ... leading critic of the Saudi Government it's not being seen since he entered the building many a week ago technician official when he was murdered that James Robbins reports\nThe fact that ... was last seen almost two weeks ago entering the Saudi comes to us and you stumble and was not seen by anyone leaving remains the most powerful driver of suspicion something happened to him inside the building Turkish officials have been pushing saying they believe the journalist\nWas killed there because it comes to the Saudis hoping territory they cannot go in without permission to accuse president title one is increasing the pressure he told a news conference the culture to Fishell kennel save themselves by simply saying he has left they have to prove it\nFrench prime minister and ... and his European counterparts that there is no national solution to migration must be tackled internationally\nSpeaking out of a meeting of the six nations and the French city of Neal is just an ape said he expected the French exchange with isn't as interior minister and I tell you how many who was accused the French President Emmanuel Macron of needing the pro immigration lumpy in the\nJoint winner this year's Nobel Peace prize not him around has appeals to the international community to do more to find sexual violence and genocide addressing a press conference she's had the world must hope ... moral and legal responsibility to bring those responsible for these crimes\nViolence and genocide addressing a press conference she's had the world must fulfill its moral and legal responsibility to bring those responsible these crimes to justice BBC News reports\nFor the world comes from legal zoom dot com offering a network of independent attorneys on tax professionals who can provide the advice needed to get through the daily grind of owning a business more as legal ... dot com slash world\nI'm more of a woman\nAnd this is the world glad to be with us today consider this a presidential candidate heaped praise on the military you talk stuff about crime and corruption and he also comes off as racist and massage genetic this is ...\n... shock the Brazilian political establishment\nAnd beyond but transiting his rivals in the first round of voting yesterday this despite the fact that his campaign sparked massive protests from Brazilian women just a week before the vote both in our once suggested to a female lawmaker\nThat he wouldn't rape her because she wasn't attractive enough he has promised to veto any attempt to legalize abortion and he suggested that the gender pay gap isn't such a bad thing and yet ... seems to have\nAnd it's actually gaining female support Rio de Janeiro based journalist Shannon Sims wondered why so she went to an spoke with several dozen female both supporters and wrote about what she heard for the Atlantic one of those women she met was Giovanna ... an upper middle class white working mother with a young child\nShe described wanting to vote for both narrow because to her he presents the best option to protect her economic interest in economic interests of her family\nI think ... too much from day ...\nGovernment as almost fourteen years of corruption having a baby I don't want him to grow up in the country like that I Want to be patriotic ... and I think that ... for\nAnd he was found guilty of full of the crimes he was charged with a related to him is but in a twist he was also able to walk free because the court ruled that the statute of limitations didn't allow them to put him in jail\nThe woman at the heart of the lawsuit ... says she will appeal but ... also says she feels some measure of justice already even if the doctor who stole her from her parents was allowed to walk free today\nI mean the main thing is I don't mind if he's not going to jail that's not the most important thing it'll be very difficult for him to leave his house because everyone move recognizing everyone will know what he did and she says to me he can get in any way about any number now\nDr Edward ... is the first person to go to trial for illegal adoptions under Franco dictatorship reaction was mixed today from people whose families were affected again here's my BBC colleague loosely Williamson\nSays mothers outside the court today who they themselves believe that a bad ... babies were taken in a similar way and the campaign is saying that that may be thousands tens\nOf thousands even children who were taken in the same way as in his state reading Mary action that was that was happiness to this study had happened to the tool that somebody had been found guilty of a crime like this because it's been a very long journey to try and get any official recognition\nBut of course the fact that he was able to walk free um was was\nA source of of distress one mother says it's like being slapped in the face\nThe BBC's Lucy Williams and reporting there from Madrid [noise]\n\nComing up un climate scientists say is not too late to avoid the very worst effects of climate change though would take some truly historic and transformational change of the ways we live\nOn the world you're listening to the world on can you know you Arizona Public radio your source for NPR News in sock good afternoon it's two twenty\nSupport for gay and I knew comes from northern Arizona university helping build a better tomorrow in Flagstaff online and that community campuses across the state more at N. A. U. dot edu\n\nFrom Arizona Public radio in Flagstaff I mean these are all just and he bought a cold autumn storm system continues to impact the region say mostly cloudy scattered showers and thunderstorms and cooler temperatures throughout the day the storm system but measurable snow to Flagstaff on Sunday the nights earliest recorded\n... dating back Eighteen Ninety eight and ... you got to go back to Nineteen eighty six aside and earlier smell in town sunny and a bit warmer Tuesday Wednesday rain returns to the region late leak\nTo find an earlier smell in town\nSunny and a bit warmer Tuesday Wednesday rain returns to the region lately\nA marker worm and you're with the world the difference between one and a half and two degrees Celsius doesn't seem like much but in terms of the global climate and how it impacts hundreds of millions of\nPeople around the world it means a whole lot scientists have been looking at how we might keep the warming of the planet to one point five degrees Celsius and researchers have just put\nOut a new United Nations report on climate change say that goal is still possible but limiting warming to one point five degrees Celsius are about three degrees Fahrenheit wouldn't require huge changes to transportation\nLand use an urban infrastructure that are unprecedented in human history\nWe really need to start working very hard right from know if we're not going to see the options that way so the message is indeed a very strong\nThat was Jim ... from the UN's inter governmental panel on climate change which released the report the world's Carolyn Beeler is here to tell us more about it uh this report found as possible to reach that one and a half degrees Celsius targets but just how hard would it be\nWell hard as you mentioned that reports authors hundreds of them wrote that's ready inter governmental panel on climate change said there's quote no documented historic precedent for the scale of the economy wide changes we'd have to make to cut emissions enough to keep global warming to one point five degrees Celsius\nThat's because we have to cut carbon emissions roughly half in roughly a decade and would actually have to reach net zero emissions and just Thirty years I just want to underline how hard that would be to do it basically means that we have to reduce carbon emissions enough by twenty fifty that\nAnything we and that we can then sucked back out of the atmosphere by planting trees are taking other steps so that would be a huge undertaking\nYeah I mean people are already talking about how hard it is why Carolyn has this report focus exclusively on the differences between one and a half Celsius and to Celsius in other words this is the difference between about three degrees Fahrenheit versus three and a half degrees Fahrenheit\nBecause those are the two numbers that are written into the twenty Fifteen un\nClimate change agreement so for a long time two degrees Celsius what sort of thought of\nAs this kind of goal but in Paris at the un conference in twenty Fifteen low lying island nation than really vulnerable countries like the\nMarshall Islands in Bangladesh banded together to push for this more ambitious target to be written into this global document so they got it in their Bangladeshi climate advisor ... hock with one of the people\nWorking behind the scenes to get that more ambitious target written into that taxed\nAt that time it was more of a moral argument that we want to save all the people on the planet and not just some people on the planet but what we have now is a very very sort of scientific assessment of how much damage to the dean who's going to do to the whole world is not just for people on the planet\nYeah okay so what what two degrees Celsius due to the whole world\nThis report to talk about some really significant differences even though one point five and due to read don't sound like that far apart for example on ten and a half million more people would be impacted by sea level rise under two degrees and hundreds of millions more people would frequently face extreme heat waves on\nNatural habitats would shrink for a lot more animals and coral reefs it'd be all but destroyed whereas under\nOne point five degrees of warming some with\nThey'll be around you and twenty fifth is just around the corner so this is this is really sobering news um and like so much of what we hear about climate change kinda depressing where's the hope in this report\nWell I think people like ... ... email ... in Bangladesh been pushing for this one point five degree target for a long time would say they're happy that is still technically feasible to reach that and also that this report\nThat was thoroughly documented the differences in real human experience between one point five degrees and two degrees will help focused even more on\nThat morning dishes target which I'll do it would be very difficult to reach I think that increased focus would be seen as a positive by a lot of people\n[noise] the world's Carolyn Beeler there the winners of this year's Nobel Prize in economics or to American scholars who make connections between climate change and economic growth the royal Swedish Academy of Sciences said that William Nord\nHouse and Paul Romer were picked for their work on the most basic impressing economic issues of our age Nord house as a pioneer in environmental economics he started warning policymakers in the Nineteen seventies that their economic models were failing to take the impact\nOf climate change into account New York university professor Paul Romer helped create the modern approach to understanding innovation and how it relates to economic growth joins us now from NYU Stern school of business uh first of all professor congratulations I have you had a chance to speak with your fellow winner William nor does no\nI haven't I just wrote one of his nephew hoping that I can find out how to get in touch with Bill it's really a terrific honor to be linked together with him he's just a great scholar and match subsequently decent guy couldn't ask for better association\nSo your work is linked to a work of Dr north house how would you describe your work [noise]\nWe're both interested in\nNot the kind of trade off the common in economics like we can use this field to produce a little more corn or a little more wheat what Bill and I were focused on is the huge change in income from discovering new things the real source of\nProgress for humans as in the discovery of new ideas that gives you more ... corn and wheat so that's a unifying element in what we do we\nHave our own different specialization that was really the one who's focusing exclusively on climate change but you know I'm very supportive at work and I firmly persuaded that the real key to addressing the conversation of the energy system will be\nTechnological progress and the key to policy right now should be to encourage this amazing machines for discovery we have um a modern economy just encourage that to go tackle is very important problem\nSo it sounds like your body of research looks at the discovery of new things part of technology can you talk about how that overlaps with the work of duck nor has an ... with climate change [noise]\nA very simple model that would say something like oh the government's support basic scientific research by giving grants to university professors than the private economy puts that knowledge to work\nProfessors that story because it involves the government getting money to professor so you know they're they're keen on that but the truth is that most discovery and most learning comes from the work on specific problems\nWe reached out to Saudi Arabia embassy in Washington for comment they wrote back to us this morning saying to most disappearance as a matter of great concern to us and we category league reject any allegations of involvement in his disappearance they concluded the message our sympathies go out\nTo the most family at this time\n\n\nIn some parts of the U.S today is indigenous people's day a little writing of the historic record for the dubious legacy of Christopher Columbus in the Americas we're not going to get into that today we are going to talk about indigenous people though in\nAustralia it's a story about ... the huge red rock in the middle of Australia this sacred to aboriginal people it's also known as airs rock\nA tourist destination for decades as a fancy resort nearby with tour buses going back and forth daily but the actual owners of the room or the aboriginal people who live\nIn poverty on the other side of the rock today people Fernandez looks at what remains to that community\nTo stand at the base of this massive red rock called ... and look up it is nationalizing the only one with my mouth agape on this warm winter mornings there doesn't people from all over the world doing the same theme\nAm to ... you got to keep the ...\nThe Simpson family was getting ready to scale the side of on the roof it's a shop and rock face to me that's\nThe way it did it when she was some similar to a kids' age um and um she's always wanted to do it again\nI don't know how long you have a rash grandparents Andrew ... way for family off high climbing you'll be three hours as we watch\nThe kids tend to scramble up the first side entry tells me he's climbed multiple times it\nDoesn't look so bad from here but they're actually very very steep points and very windy points\nThey just want to Helen jumps in to tell me she isn't climbing for one main reason and she was clear we've had daughter about it she told her that local aboriginal people asked no one climbs the rock because it's sacred to them\nOut in favor of respecting the aboriginal people and then they need to keep it say it but my daughter is a very determined [laughter]\nSee when tourists began coming to hold a roof back in the Nineteen fifties the local operational community was not in charge\nOr they could do was ask that no one climb today there's a cultural center nearby that spells out clearly house sacred the rock is and why it offends the operational honesty on a new people when tourists scamper on it\nAnd there were signs all over the place that say please don't Klein\nI'm Brian ... I'm a grandson of an all the traditional honor of\nThe traditional owner is away knowledge in that ... people actually owned the land first easiest to date someone else has a title to that land\nAnd the cases all over the Australian government returned ... to the traditional Ernest in Nineteen eighty five [noise] this huge ... has deep spiritual meaning to operational ominous like Brian ... and his family\nAs we sit at the base of older he points out to the top bridge and tells me happy outlined resembles a woman lying on her back silhouette\nOf this the ... you can actually see a full head out there\nBut let's family told him many stories about all the new as he grew up now he lives in South Australia about nine hundred miles away but on the roof is still very important to him\nIn a movie that's very true\nWhile he looks out at the climate is on Hulu and he's the picture is humanity that Steve both when the manager of the national park land that includes all over it's much more blunt he's known in such an ass but he tells me that tourists climbing the rock is very offensive to the minute\nBy calling us what you're saying so that comes from observing them on the\nClock as I talked to ... to the base of lower\nDoses one sentence expressed repeatedly a feeling that whoever was an Australian ... ... they had a right as a ... to climate like this guy doing a few stretches because it's a hard call 'em all remember it being hot Glenn from Mehlman who was doubled touching has totally when I talked to him\nOh I understand why the aboriginal people dark want people to claw do get that but um I respect the rock is older than them to a so I'm happy to climate again in a more to do it\nHe's come now because of a recent decision by ... any aboriginal owners to close over to climate in twenty Nineteen\n[noise] it's something ... and it's had one for a long time and wild Glen and all the tourists might be upset pox Australia Steve ... they just don't realize what the rock means to ... people that he has this one liner\nI say what you have done by climbing on that side of the way you should start climbing out of that seems to decide if the equivalent of ... over the Sistine Chapel or all climbing over church\nThe decision to close all the rich\nEssentially decide if the equivalent of ... over the Sistine Chapel oral climbing over church\nThe decision to close over to climate was a big deal folder and says\nI was in the room on that guy and there were people in tease it was it was ...\nHe says it came down to data fueled in twenty percent of the tourists to pass through the entrance gate one actually making the climb closing the rock to climate won't be so drastic he says there are plenty of other activities the tourists\nYou could hire recycle and ... you can have a progressive dinner on a double decker bus or not\nYou get the picture and the local aboriginal community wants tourists to keep coming after the land was returned to them by the Australian government they least it back to talks to license and run all the tourism activities\nIn return they get twenty five percent of the puck entrance fees and wanted to know what leaders from the local on a new aboriginal community from what about the arrangement [noise] so in the shadow of Hillary I met with on a new Shannon sunny Wilson\nVisit each other and they love him some visitors love it that well what does your community get cheap oil it's one of those I'm doing all the visiting William guns are very few\nOn a new are actually two leaders he tells me when in fact it's his people who have the history here his people who have all the stories the nearby result knows visitors once an aboriginal education\nSo they provide it could well from what I was literally on the ... are mostly talk about all the hunting weapons\nAt this free daily talk and the result village Levi ... entertains the Gabby tourists we show and tell about how in the kitchen is people have survived in the Bush an arid desert for millennia\nOld on then I had was a large wooden ball she laid the little ones in the camp she talked to a big one at gathering\nLester is one of the few indigenous workers at the result his family is the traditional owners couldn't more of these people do jobs like this semi Wilson asks instead the jobs they are off at a mostly menial he says like cleaning rooms jobs that pay well\nI don't want to do the job that want to do what would your\nRadio not blood money went calling Laurie I'm going to get the money it seems like\nYou know from there is a lot and there's money being made here around this whole a route just your community get much money from this from the old the tourism dollars that come here yeah someone making money on [noise] it's not us\nThe money the local aboriginal community receives is a share of the talk entrance fee that twenty dollars for three days past but they say the real money is made up the result so why don't share some of those profits with the local traditional owners\nI pose that question to any five to ... percent of the aboriginal one land trust corporation that owns the result\nIn relation to the ... getting a matter that we have certainly turned her attention to in the last twelve months we're working very very hard on that there's always bring\nFive promises that one year from now the jobs and profit sharing with the on a new people would be much better he says that since taking over the ... six years ago they've markedly increased the number of teaching us work as an started an onsite hospitality training school ... people\n[noise] but most of those slots field find digital people from all over Australia\nNot the local community that you know ... Brian ... left the grandson and a little over a traditional ... wants to show me how dire things off the abolition of community who lives just on the other side of the raw\nFish driver they him up he used to live here and every time he comes back it makes them sad to see the garbage strewn about\nThe falling down houses kids looking unkempt ...\nHe wishes ... of the tourism dollars would be used to bring health hygiene and education programs here\nPeople can't even afford the basics he tells me\nYou know you walk around the community and ... and you know and those kids even to give the family a packet of tissues no way you don't see it\nWorld\nA co production at the b._b._c. world surface P. R. I. N. WG a ball point in my hand Neal herring committed\nTo supporting objective unbiased reporting on national and international ... by the John ... team MacArthur Foundation committed to building in more chest virgin peaceful world next sound dot org\nBy the Ford Foundation by the hour I twenty twenty donors including the rose family signed investing in foreign risk taking and mark ... Hofmann who believes that substantive fact based reporting prepares citizens to contribute to fight for democracy\nAnd vital do miss him\nSubstantive fact based reporting prepares citizens to contribute to apply for democracy and by the lumina so\nYou weren't listening to the gym or why ... ... when I say I'm going to be on line that gee why I don't know why I lp upper ... the nine one one FM projects will be open foundation at your neighbor American public radio station\nRental involvement is the key to your child who this is Joe ... president of the Arizona education whether it's volunteering cool communicating with countries on a regular basis for helping with homework we know\nInvolvement is crucially important to get into the working together parents educators can make the grade school year for every student in Arizona a message from the Arizona Education Association\nYeah we've got a dry year will do California where you live on [noise]\n[noise]\n\n\n[noise]\n[noise] on our way\nTo my\nDad my dad and I know I [noise] my man that I had\nNo\nWay of thinking that they can\nWin money\nIn your hand in\nThe Welsh all day long you been a long\nAnd it may be careful and planning\nOut\nYou know I Am I\nAm a man and when you are\nGoing down or [noise] um I live in it as a lawyer [noise]\nUh\nI don't know what I said oh no I\nMeant when they do but they were you born\nThen but I don't\nKnow why not just\n[noise] [noise]\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\nMm [noise]\nYeah that\nWas the eagles right there with the hotel California coming up and tell you why it a point one black ...\nOr a couple of jobs\nThat they know that it's gone me that they know that\nNo the\n\nGummy then manages to the movie and did that in and around and then he goes\nOn may know him being dumb or do you read along\n\nDo pull Greece\nAnd Rome me but then manages\nIts\nCage around me you know the\nOld\nDays\nAnd days\nAnd Ron ... did not\n\nKnow that they will dreams are made me a long time in the morning and learn to be in a rush to get the dummy when they know man did ...\nYears old and\nI'm Still remains all the men and women in those days and\nOr just the combination of the night and then a neighbor that by\nThe bank or what\n[laughter]\nWhat about like [noise]\nThe teachers on me to do more on my end up paying a while to find out that way\nTo do with a look at the end I\nThink I'm Alone and da da\nDa da da da da da\n\nDa da da\nDa da\n\n\nDa\n\nDe\nLa ...\nOn a really you know I'm going to be\nYou\nKnow I'm In\nLove with a lot of my\nUh you know I'm a A R o\nThree ... you\nKnow I really like um\nWell why don't you know a lot of 'em\nOr do we read when I'm On I'm On the line\nWhen you're like oh I Know oh you\nOh I'm like oh\n... did he oh\nJeez you know ... a\n\nRobot in the county jail land they didn't know what I was young but then when we joke\nAbout that on the line and all I have a friend\nOf mine said well this is John John on the drums and all the blue rhythm\nAnd all that [noise] I Know we're going to\nThe gym but did you talk to me to do with the jail I\nDon't know I don't know I don't know [noise] [noise]\nNo no no\nNo no no no no one would you be knows why then why bother you at one\nTime and [noise] and all of a thing\nFor him to take a break to make up around a lot of my Jay\n[noise] [noise] [noise]\nOh man yeah nothing like who you're dealt middle when\nI got more meets boy if you got to do right over your ears you tell you why I bought one of them I ... I Hope you know for my ... and I are one your Native American public radio station I got plenty of more music\nThat he you know and you know in\nThe air sure that I Know that\nAre not as much from going out to all the postal worker for whether all we got there were handling our mail from Monday through friday even Saturday of you are working on a Saturday or something just went up to this one is the mavericks are Nineteen sixty one Mr postmaster are just going to get these guys to although most people there\nGoes my phone and then they\nFind\nA way [noise]\nYou know [noise]\n[noise] now he has no\n[noise] [noise] [noise] oh\nAnd by then and then now I'm\nNot yeah no no and they will [noise] way man\nPanel mine all day long and [noise]\n[noise] [noise] only\nOne way or the white man whoa how badly\nThey aren't the only\nMan man laying on the plane than\n\nBy Joe ... God me when my [noise]\nOn top of them are not good enough\nFor me mad\nAbout my [noise]\nTom and Tom and Tom and Tom Cat had found out [noise]\nAnd um [noise]\nYou know you're even seeing the march ... you're all busy doing other things that have been back\nIn the morning\nAnd I do go do something about a year on the news\nOn John you know the ball\nAnd ended up on your on your back on their minds on\nThe\nSame\nTime I had a tough tough\nTough times and bad cop and [noise] [noise]\nYeah I'm a ... I got his record mix right here in the lord ... let me turn to joy to show your wide but one as a matter\nWhere we all um well no no oh\n[noise]\n\nOh what do you think you can down the middle of the Arab and Muslim how it can ruin a guy called me and you're getting into\nSome of them go on there and my from my ... and you think you can do that and do you get your history and you'll see it will go up a jerk but I\nI like cold and rainy and then your parts or does your hand and did you get a walk on I didn't know whoa whoa a lead a road map Jane Harman [noise]\n\n\nOh we should all be done to her\nBecause we don't because they have a model where the people who wanted it over there in order to roll your anger and then go on for years and you\nKnow what you mean in my back [noise]\n\nMcDonalds\nCan be pretty much the only thing that you can\nYou remember that the guy that had been burned down in a way I thought my dad my dad he said you know\nWhere where do you call a bottle\nOf beer and move on and all of this an overgrown and what are what are your plans and we don't even know\nWhat we can protect our location\nWell let me let me you know\n[noise] go to\nOne of the older you know\n[noise] uh yeah I\nGot my mind here he may be why one [noise]\n\n[noise]\nUh and I'm a ... or ... or\n... or ... for a while and\nThen we won the ... and and all the way in the air\nAnd for this gray hair or\nBone marrow donor\nMom and dad you know the the ... man\nOr woman you know for that\nYou will not around or\nWe go through\nThis three and a\nNew job you may be one\nWay or or\nOr\nA [noise] a [noise] a [noise] a\n[noise] a\n[noise] a ... or ... or ... or\n... or\n... or um [noise]\nUh uh [noise]\nI don't know what we do it\nBut then we did is our number one on more than I Do it to get it up on that level or not they don't\nKnow I Do it on and on them all day trying to buy one\nDollar one night and one of the law that allows them\n\nFor [noise]\nKing why I support it in part by volunteers from the community key why I volunteer czar students take me to members to provide a unique on air radio experience for our listeners in northern Arizona the key way ice down thanks for your contribution to hoping radio key why I eighty eight point when they\nGrow up you know\nWay I dont think since we contribution to hoping radio to you why I eighty eight point when they grow up\nYou know I Know I Know\nYeah I've been to volunteer for the past me the seven years now we're here to tell you why station jamming out with music that I've been playing for all the years I've walked away for a while maybe about five years and got back to chaos I missed it so I came back from John\nDarned gee why stop again it's a long career so have you come down here and fill out an application join us as a volunteer and help without\nWe've got a lot of things to do around here to we can use your health a bone here but I Want to say a special thank you for our newest volunteer and she's been helping us you'd be doing real good job her name is Joyce you've been here for what should we don't\nReally know I guess I'm wrong three weeks so I got from going up to her she's a\nShe's a she's over here helping us out we appreciate her her help that she's been doing over here to K. watched nation so I mean I just went up to her like very thank you very much from the chaos ... station staff and everybody else out there to appreciate church do you how do I get no better\nNa na na na\nNa\nNa na na\n\nNa na na na na\nNa na na na na na na\nNa na\nNa na na\nNa na na na\nNa na\nNa na\nNa na na na na\nNa na na na na\nNa na\nNa na na na na\nNa\nOh the land that music me back in ... Hi I'm Janet Hi this is Eric and start with the whole but my name is Hi I'm Jim boy in New\nGuinea pig out\nOn a on a\nOn a um [noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise] oh\n\nYeah that was back to back native creed right there and I would like to go to I haven't seen her do from music for a while I thought a preamble go over there\nAll right all the I ... for you guys are you [laughter] [noise]\n[laughter]\n\n[noise]\n[laughter]\nUh do what it is about that\n[laughter]\nAnd not as bad as I say about that\n\nDon't know if you're on your\n\nSkin and\nWe're getting to\nKnow what to do well\nNo no no I don't know\nWhy why\nDo you do why do\nYou do what\nI was wondering how much it can trigger that we're allowed\nTo drive ... someone's drew me to go into the water\nCan na na\nNa na na na na\nNa\nNa na hey you I Hope you\nKnow beautiful down and hope you land\nYes it is a beautiful day outside lots of fun lots of cool air near getting both time go don't forget to get those jackets out and get them ready to start putting your in your stove and so your hobby because I Know oh triple not ready for the summer time it's your cold dark dropping those words get ready to go home from school and some would your\nYou start putting in your stove inside your house because I Know you probably took 'em all ready for the summertime\nIt's cold start dropping as we're getting ready to go wholesome Cohen some work to your house yeah it is going to be a time of year again we're going to be all shoveling and everything else and I wish summer was here it's too cold yeah I Know that's what everybody will say if you are worried about anything out there that are just offered you guys\n\nAre in regular as opposed to be happy to be happy and tell you I Want to do that relied we have some drama but when you make\nA go don't worry you'll be happy to go or whether it'd be\nVery happy with\nThe ball ball ball ball ball ball ball\n\nBall ball [noise]\n\n\nGosh\nMy daughter who are raising it could be and we put on your face will from that will bring nearly body down so don't worry be happy to be no other way they have\nTo do whether a we had the\nBomb bomb\nBomb\nBomb bomb bomb bomb bomb [noise]\n\n\nYeah tell me oh I\nAm [noise]\n[noise]\n\n[noise] [noise] not the\nFirst thing\nI kinda bring it back like you I bring it back like you had in the winter night tell me telling me that [noise] way way way way way way\nLet me give me give me one of the cage and when I [noise] I just I mean I'm not how'd you how'd you do now but\nI don't know how to solve thirty something [noise]\n[noise]\n[noise] [noise]\n\nOh I heard\nSomething about do you do you want to do [noise] I don't have to I was just because there was\nOne of the nation so there are some\n[noise]\n[noise] [noise]\n\n[noise]\nYeah that was a harmony harmony and John drinking during drool right there with a mix right there up there on Mars the tone of coming up on the line on on the court you can you hear just you are not to be gay pride over here on your typical\nJune June tell you why are you going on in the in the ghetto around\nMy mommy and all that he spent Spanish she let her die just me\nAt the end they don't let the kids didn't have a little bit but not like something better but back in the white women get dumbing down by the navy base in the mood like it was all the way the brain due\nTo back the mobile beyond the no what you like about with your brother that time to be ... did not run the ball we got to know right now like you said the show but I think\nWhat the lady I'm All right do you go to where the jobs in the ... how do you want to put me don't be fairly waited\n[noise] way and you can be [noise] did they waited and waited and you can you\nBe entertained when I'm when I'm at the time [noise] and we didn't know I mean\nYou know [noise] [laughter] [noise] [noise]\n[noise] [noise]\nYeah that was a real good for their ... with it on the wide for one I got the parents were coming up on next shake it off on tell you why are they going\nTo go back\nTo what people do I do to prepare for the right to\nSay\nThe\nBay area code and then again I have a\nVery very bad very bad day today\n[noise] I\nDon't\nI don't\nKnow I'm sure some people who are going to rain\nMay laugh and\nSay hey I'm afraid and I think that [noise]\n[noise]\n\nHey see you down and out about the law is not a dirty dirty\nIn the world you could have been moved down to the man you know God right she's like oh my God I'm shaking I like to have a baby when you shake shake shake\n[noise] [noise] [noise]\n[noise]\n\n\n\nYeah and our prayers were partner with chicken all looking to tell you why are they going to want your Native American public radio station a public ... foundation hope you guys are joined a song that I've been playing or you go okay your radio during then because we've got lots of Miami to play again what's going to get it from going I got some\nHits the road jak right here does that tell you why\nDon't you come back role model my ... with the wrong day don't you come back no I don't come back role model my window oh dang comeback low\nAnd a guy and don't go not role models I won't be a no no I'm not going well dang combat role model my window that you know go not no no\nNo no no no no no no no uh Manuel more gloom\nNo no no no we don't know what's going on [noise]\n\n\n\n\n\n\n[laughter] [noise] [laughter]\nI don't go along with the dry I don't know I don't know what I don't know\nWhy don't you don't know what I Do know that no no no no no [noise]\n[noise] [noise] [noise]\n\n[noise] [noise]\n\nNo I end my you know right now my behind my you know oh my little one them up on the\nNet miss hoping tiny Seventeen twenty eight my name is but in my family my hope you name it I mean I Am to ... them up with me I Am the tiny teeny tiny peanuts and my ... from the\nLast show and like I said that we should\nLet the well then the ... net Mikhail a gamble young uh-huh and let's see what the biggest one next month and I\nMet when I used to read the twenty eighth team is the first thing and then I Am a gala gala lowly hope you name it well then yeah I Am at the current climate and I am from when I Am twenty Seventeen twenty eighth team is hoping for this and that\nAnd like a rummage sale intervention now you know I had a mental image and that can I can go via\nOn my neck all Gallo a net milk and then the net he doesn't Seventeen to that in a memorable thinking I I Will go yeah I'm ... and the village of ... and I am that he doesn't he doesn't like me and my platform is now mind them you know", "show_name": "no_show", "year": "2018", "city": "Hotevilla", "day": "08"}