{"month": "10", "state": "GA", "station": "WABE", "content": "Marketplace morning report is supported by western hotels and resorts dedicated to empowering your wellbeing while on the road with signature wellness programs designed to help you stay in control while traveling last ten months rise more at West in dot com\n... knows HR payroll talented in timekeeping and one unified system\nLearned more in krona stop calm pronouns the workforce innovation that works hand by pay pal business financing pay pal has how businesses by providing access to more than five billion in loans globally if you need access to a business financing pay pal can do that I learned more pay pal dot com marketplace\nThe major league baseball season wraps up this evening with a couple of one game playoff to determine who will win the national league central won the national league west has always in baseball pitching is key and listen to the story about the weird economics of getting good pitching it's her marketplaces Andy Huler\nFor more than a century the main question baseball fans of asked about any given game was who's pitching but Jason's stark a senior writer at the online sports like the athletic says times have changed\nIf you're asking this question and I and the answer is everybody it's not the same ...\nHe says there's a new strategy to win games you're starting pitcher doesn't have to go deep into the game if you have a bunch of great arms and the bullpen ready to pitch to a battered two at a time\nIt's a window into the thinking inside front offices\nAnd for relief pitchers new strategies translating into much higher salaries to New York Yankees sure their highest paid player is John Carlos Stanton a home run hitting outfielder\nBut number four and five on your highest paid lawyers on that roster or rules Chapman and David Robertson to relievers\nEric Fisher writes about baseball for the sports Business Journal\nThere's no question we're seeing GM's continued to value bullpen arms more and more\nThese days starting pitchers who pitch in to the fifth inning or something of a rarity but the Tampa Bay rays have taken the bullpen strategy to an extreme\nFor much of the season the rays would have a starter pitch in any or to only to be replaced with another pitcher Fisher says baseball general managers don't think of pitchers in specified roles much any more that means starters enclosures aren't the only\nOne is getting paid a lot these days\nThose middle reliever as we're that used to be a minimum salary one million two million cut a guy there are very frequently mid seven figures now so even those nondisclosure roles are being elevated more during a question\nThe new strategy also means more breaks from the action for pitching changes which means more commercials for TV viewers game attendance is down about four percent this year and all those TV ratings are up in some regions the league is worried about losing fans because the games take too long Jason stark at the athletics is sits down to a simple choice\nBaseball strategy versus entertainment strategy which is more port\nOwners in league officials hope the two strategies don't have to be mutually exclusive\nI mean either for marketplace\nAndy wanted me to say that his pieces about pitchers costing a leg in an arm\nAnd a wise guy in New York I'm David Brancaccio was marketplace morning\nFrom eight PM American public media and the next fresh air the journalistic challenges of investigating Russian interference in the election and connections between the Trump campaign and Russia we talk with Washington\nPost reporter Greg Miller who's broken several related stories and shared a Pulitzer Prize this year now he has a new book called The Apprentice Trump Russia and the ... version of American democracy join us this afternoon it to ... point one W. A. B. E.\n[noise]\nThanks\nFor joining us for MORNING EDITION on member supported Ninety point one W. A. B. E. Atlanta I'm Sam Whitehead see Sean there has been our producer sure to join us again tomorrow morning to start your day in the know up next one a take a look at the political implications of Brett Kavanaugh Supreme Court nomination\nProcess that straight ahead we've got Seventy two degrees under cloudy skies in Atlanta at ten o'clock\nYou've heard the testimony you watch the hearings you had the weekend to think it over [noise] so\nWhat do you think of judge Brett Kavanaugh today\nFrom W. A. M. U. and NPR in Washington DC is one a [noise]\nA there I'm Joshua Johnson today I Would want to have the Kavanaugh confirmations the FBI is investigating claims that the judge sexually assaulted Christine Blasey Ford when they were both teenagers it's the result of a bipartisan deal the climax of too dramatic days at the Senate Judiciary committee\nAnd it's got the nation talking about the Supreme Court sexual assault and the lives of women in America\nWill get some analysis and we'd love to hear from you so call us eight five five to three six one a one a email won a a W. A. M. U. dot org comments on our Facebook page or tweet us ... won a [noise]\n\nLine from NPR News in Washington encore of a Coleman the FBI and spending a week reviewing sexual assault allegations against Supreme Court nominee Brett Kavanaugh Delaware democratic Senator Chris Coons told NPR's MORNING EDITION the FBI investigation needs to be broader and should include more witnesses and documents\nI'm working hard to encourage my colleagues in the Senate principally Jeff Flake from Arizona but others um to speak up and to say the whole point of this week\nUh is not to have an ... an open ended or an endless investigation but a credible I'm short but purposeful investigation of the sexual assault ago allegations against a judge Kavanaugh that are in front of the Senate now\nSenator Flake a Republican had initially announced he would support Kavanaugh's nomination but friday called for the FBI investigation\nPresident Trump says he'll speaking about an hour at the White House about the new trade agreement reached last night with Canada\nIt will include Mexico and will replace the north American free trade agreement the U.S had already reached agreement with Mexico on a trade deal the negotiations with Canada and dragged on for weeks to scientists will share this year's Nobel Prize in physiology or medicine for discoveries that have led to a revolution\nIn cancer treatment NPR's Richard Harris has the story\nThe price will be split by James Allison who is currently at the empty Anderson Cancer center in Houston and ... at Kyoto University in Japan the to work independently they were both exploring how the immune system works to ward off diseases including cancer\nThe immune system needs to rev up and it also needs to apply the brakes at times\nAlison and hundred discovered they could interfere with this process and release the breaks that makes the immune system more effective it attacking some cancers and the discoveries lead to a whole new class of drugs called checkpoint inhibitors which are widely used today Richard Harris NPR News\nThe jury in Chicago police officers murder trial could hear today from a psychologist he'll try to explain the officers frame of mind when he shot a teenager from\nMember station WBFO easy chips Mitchell has more\nPolice dash cam video shows Jason Van Dyke opening fire is lukewarm McDonald walked away from officers police reports say ... a Seventeen year old who's trying to kill them with a knife in his hand\nNow the officers' attorneys are planning to put Florida base police psychologist Laurence Miller on the witness stand Miller writes about changes in vision hearing and time perception when cops shoot\nIn twenty sixteen he gave Van Dyke a psych exam the prosecutor wanted Miller barred from the trial he argued only Van Dyke knows what was going through his mind when he fired for NPR News I'm chip Mitchell in Chicago\nOn Wall street the Dow Jones industrial average is up two hundred and thirty two points at twenty six thousand six hundred Ninety two announced that gets up more than fifty two points that eight thousand Ninety nine yes in the five hundred is up twenty this is NPR\nLawmakers in the west Virginia state Senate are set to act as jurors in the trial of the first four impeached state Supreme Court justices as Dave Mistich of West Virginia Public broadcasting reports the impeachment trials are the first in the state since Eighteen Seventy five\nJustice Beth Walker is the first four justices to stand trial for their roles in a nearly year long scandal focused on lavish spending by the court\nWalker was named and only one article impeachment adopted in August by the house of delegates\nThat article names all the justices collectively for failing to one another accountable and failing to provide administrative oversight in a pre trial hearing in early September they'll gets acting as the prosecution had agreed to singer Walker and the chief justice\nIn lieu of making them stay in trial and risk removal from office the Senate president ruled that effort out of order senators lead twenty three thirty four votes to convict and remove a public official from office for NPR News I'm Dave mistakes in Charleston West Virginia\nOfficials in France say that singer and actor Sean ... has died he was Ninety four ... was often compared to Frank Sinatra men sank to packed concert halls until the end of his life periods performing live ...\n\nAs men were again his career as a song writer for French vocalist an actress Edith piaf and it's estimated that he wrote a thousand songs over his career\nI Wonder in a way if it even matter though a union in terms of the confirmation I mean I think back to Clarence Thomas is hearing regarding the Anita Hill allegations which CSPAN Iran I think it was the day before the Kavanaugh Ford hearing which was very instructive because you know Clarence Thomas was not calm in\nTerms of the way he responded to any of the hill I mean he used the word lynching twice he called it a high tech lynching and he said I'm not going to give you the wrote to Lynch me with not to hang me with to Lynch me with\nShe where they asked him did you hear professor Hill's testimony said no I'm not ... I'm not going to listen to lies and yet he was confirmed I Wonder in the scheme of things professor for its Patrick how much temperament really matters history would suggest that at the end of the day it's a piece but it may not be that big a deal\n[noise] but I think you hit the nail on the head earlier when you said that it doesn't really change anyone's mind what goes on in these hearings everyone looks at it\nThrough a partisan lens and you know academics have studied something called implicit bias which tries to get at the prejudices that we have against other people that may not be explicit\nPrejudices or or or or things that are very um explicit in our minds\nAnd what they found when they do these studies is that people have more prejudice against people who have different political views than they do than people who are different races or genders than they are so political I'm bias is a very serious\nMatter and and so I think when all of us look at these hearings we'd just see things through our political sphere rather than maybe being neutral observers\nI Want to follow up with you on that we continue particularly whether or not judge Kavanaugh will be able if he becomes justice Kavanaugh\nTo do the business of the Supreme Court outside a partisan lens because there are other journalists you know John Roberts among them who have made decisions that conservatives didn't dig the Obamacare decision for example and I kind of would like to get your sense of that professor for its Patrick when we come back\nWe also want to talk about the FBI investigation many of you were asking about that like Peggy Peggy emailed if the FBI does not find any evidence to support Dr Ford's testimony\nAnd if it does not find any evidence to judge Kavanaugh has lied but he is not confirmed\nWill she be able to keep a job he currently has\nGood question he's constantly on the D.C court of appeals will put that question to Brian Fitzpatrick of Vanderbilt Jeffrey Rosen of the George Washington university law school and the national constitution center will bring in one more guest for the conference conversation and we'll get to some of your calls as well I'm Joshua Johnson you're listening to one a firm W. A. M. U. and NPR [noise]\nThis is one a ... point wind W. A. B. E. Atlanta I'm Sam Whitehead can have you on the conversation ... just on air you're invited to join in senior comments to one day at W. A. B. eat out of work and following a on Twitter there at one a\nWeather today partly sending the ties in the mid eighties not much of a chance of rain it's ten Nineteen [noise]\nYou're busy work school errands kid it never stops and the news never stops either you can keep up between MORNING EDITION and all things can sit here and now my town and Jeremy ... hearing that brings you breaking is developing stories the latest to the arts and innovation\nKept question I'm packing complex issue from across the country and around the world joining Monday afternoon I Ninety playing one W. A. B.\nWABC began serving the community Seventy years ago at the start our mission was to educate school junior\nHe always gives a lot of joy [noise]\nAlong the way we\nWe'll end with the keyboard\nGrew into what you know and love today Ninety point one F. M. B. W. H. B. thank you Atlanta this is double UAB serving in Atlanta since Nineteen forty eight\n\nSupport for NPR comes from this station and from bona with the bonus certified craftsmen program network of hardwood flooring contractors committed to expertise in customer service contract to locate her and more information or at Boehner dot com\nAnd from math knees and committed to changing lives through math by building math achievement problem solving and critical thinking skills for thousands of students every day in nine hundred franchise locations matinees him dot com slash NPR\nThis is one a I'm Joshua Johnson we're talking about the Kavanaugh confirmations and its impact on the nation we're speaking with Jeffrey Rosen president and CEO of the national constitution center and a professor at George Washington you tune university's law school as well as Brian Fitzpatrick professor at Vanderbilt law school we love to speak to you to comment on our Facebook page\nTweet us at one a email one at a at W. A. M. U. dot org and we're taking your calls in voice mails at eight five five to three six one a one a speaking of calls let's get to one now from Florida David is on the line Hey David what's on your mind\nHey Joshua how are you\nGood what'd you think could be a hearing last week\nWell the impact on the nation are you just said the impact on the nation that's the ACA exactly what I Would comment on I feel that uh I'm actually glad that the um you that the hearings were made a public because it allows us\nAs a nation to weigh in on what exactly is going on in Washington with our politicians and how they're making decisions\nFor us or with regard to these things so uh I think it was very important that we all uh chime in on what's going on your guard less of a political aspirations uh I myself\nHave a they also at the alcoholism in my past ah I found recovery in Nineteen eighty five I I understand the struggles of alcoholism but I also understood stand up\nUh in my youth when I struggled with alcohol as I grew into adulthood I uh was able to me I was able to hide or my drinking and to justify my drinking and this is a characteristic of alcoholics they\nAre very adamant about there certainly are drinking and also at the same time admitting that uh they do not have a problem so um\nI think it's very interesting for us to see um individuals or come to terms with their past and how it affects their future and how that affects the future of all of us\nDavid how how do you think how do you think this will affect the confirmation battle though I mean I hear you about these other conversations that need to be had in terms of whether or not Brett Kavanaugh makes it to the Supreme Court or not what impact do you think the last few days might have\nA ... one particular clip I saw on CNN was when I'm One of the senators were questioning him about er an FBI investigation\nAnd he refused to answer he fall silent he he he explained that he was hoping to what the committee or would a welcome however hit she personally would not comment\nOn whether or not he would accept an FBI investigation and it was very interesting to watch his wife\nOr her response to him because when he was not answering that question and she was staring at him very sternly and I always also wonder what exactly what she faking when he refused to answer this question regarding the FBI investigation\nYour your your that your friend that I watched enough that Senator Durbin of Illinois puts a price have enough and\nThere's nothing to hide we should be open to any possibilities\nYeah David appreciate your calling in thanks very much and that was the question that Dick Durbin of Illinois put to Brett Kavanaugh and he posts\nFor a long time and then Chuck Grassley who's the chairman of the committee a Republican chairman of the committee jump back in and then after that Rachel Mitchell question there for the GOP basically lost her job and then the GOP senator started jumping back and let me get to some more of your comments David thanks very much for talking to us Catherine emailed\nAs a woman listening to Kavanaugh defend himself last Thursday I didn't find his presentation appropriate\nIt's smacked of bullying and intimidation aside from that conspiracy theories like revenge from the Clintons aired and Senate testimony is a major disqualify or in my eyes before we bring in our next guest professor fitzpatrick if I could ask you to respond\nTo Catherine particularly whether or not someone who began by making a partisan broadside can be trusted to sit on the Supreme Court at administer equal justice under law\nWell I'm you know I think we have to be realistic about all of this our Supreme Court justices come from the political world they work for president of one party and I'm often times or they have other experience in politics they are\nTo some extent partisan or in their outlook but they try to put that to the side as best they can when they get on the court\nAnd focus on the statutes the constitution the administrative regulations and I think they do a pretty good job obviously\nThe Supreme Court Rob posted on our won a Facebook page I was very happy with flakes decision referring to Republican Senator Jeff flake of Arizona it gives the country and Senate time to breathe any Democrat who wants the FBI investigation to be longer\nCan now be fully accused apart isn't delay since and flakes decision was bipartisan\nThe FBI got hills investigation referring to Anita Hill done in four days so this should be wrapped up by friday Senator Flake and senator Coons of Delaware a democratic senator both spoke on sixty minutes in an interview that aired yesterday Scott Kelly asked a question to Senator Flake\nThat provoked a very telling answer\nSenator Flake you've announced that you're not running for reelection and I wonder could you have done this\nIf you were running no [laughter] no not yet not a chance now because politics has become too sharp to ... there is no value to reaching across the aisle there's no currency for that anymore there's no incentive\nPart of the interview that Senator Flake gave to Scott Kelly on sixty minutes yesterday Elizabeth that's a that is telling it's kind of it's kind of sad but at the end of the day it works like that part of the bipartisanship it's the Senate is supposed to include work the way it was kind of suppose do\nYes I mean let's help sell uh actually I I Would hope that Senator Flake would be disturbed by the news is that the investigation might be severely hamstring by the White House as a\nParent there is some dispute on that's been apparent direction that the ...\nHe's limited ... they can interview 'em and those limitations make it far less of an investigation and more of a foregone conclusion and but I think that that shows that well the political lens governs when it comes to\nOur elected leaders unfortunately um I think that a professor if it's ... actually is a little bit wrong when he thinks that that's true for the entire nation I think that uh the person who called and about the folks that he was over hearing it dinner believing a Dr Ford you know\nThey believe her because they saw her and because they know from personal experiences of themselves or their loved ones that people don't come forward until they have to and to see her emotion and her credibility with incredibly important and that's going to affect the Supreme Court in the minds of the nation\nOr they want to give professor fitzpatrick a chance to respond to that and will respond to more of your questions and comments when our conversation continue to speak what [noise]\nThis is one a Ninety point one W. A. B. E. Atlanta I'm Sam Whitehead thanks for joining us joining the conversation by following one day on Twitter there at one a it's ten thirty eight\nSupport for WABC comes from log men makers of go to a meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more at go to a meeting dot com\nWith everything going on in the world you listen uh W. A. B. E. because you're trying to stay informed\nSo why not support it and on this or Seventy anniversary we'd like you to have our limited edition Seventy anniversary T shirt\nIt's yours within early sustaining donation of ten dollars a month\nThe shirt features radios from the last seven decades and our seventies anniversary love\nTo stay informed show your support\nHelp us and the member Dr early at W. maybe eat that org slash donate\nWe of joy thorough and sexism in the city like good news first determinist modern belly theaters going into their second year we'll talk to co found a job well we'll get a laugh look at burn on there's intense production\nFor forty eight psychosis and Adam Copeland recognizes writer Dorothy field contributions to the great American song [noise]\nJoined us I'm living in one W. H. [noise]\n\n\nSupport for NPR comes from the station and from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with a legacy of putting clients financial well being first learn more at Raymond James dot\nCom and from bona with a bona certified craftsmen program a network of hardwood flooring contractors\nCommitted to expertise and customer service\nContract or low cater and more information or at bona dot com [noise]\nWe will continue this conversation tomorrow focusing on some of the more personal revelations that this confirmation process has triggered we know that a lot of you have stories like professor Ford's to share some of which you shared with us we're so humbled that you would tell us and kind of sad that we cannot ear more of them just because we received so many\nAnd that's kind of what we need your help with figuring out what to do when someone tells you their me two story how have you dealt with these revelations among people in your life once the story is shared\nWhat then leave us a voice bail eight five five to three six one a one a\nIf someone's told you their story of being assaulted or harassed or if you shared your own story with others what happened then to help the healing process or are you still struggling for the ride response tell us your story you can email us one a at W. A. M. U. dot org or use our app what a vox pop\nTo send a radio quality audio file and to keep up to date on future topics and we'll share some of your stories tomorrow on one end back now to our conversation with Elizabeth why throw Jeffrey Rosen and Brian Fitzpatrick before we had back to the phones professor fitzpatrick let me give you a chance to respond to Elizabeth and then we'll keep going\n[noise] well I I Do think that the academic research on implicit bias suggests that we tend to see events through a political prior commitments now there are some\nAmericans that aren't strongly partisan there the independence and and so they're not going to see things through the same kind of bias and so I'd be curious to see what the independence think about but Brett Kavanaugh that maybe are true test of of who's more credible and these allegations\nLet's keep going on the phones now Jake in North Carolina is standing by hey Jake what's on your mind\nHey Joshua uh I was just wanting to bring up something that I've been seeing talked about a lot on line but I haven't heard in your show so far this hour or really on a lot of coverage on NPR\nAre and that's the the idea that a Brett Kavanaugh it should be barred from this job primarily because of his uh\nLive that he has told while uh giving testimony\nWas there any major killer and if they were ... stood out to you sorry what were there any statements in particular Jake that stood out to you\nYeah the the foremost is towards the end of his testimony he was asked if he was watching Dr Ford's testimony or and he\nVery clearly said no and I have multiple accounts or putting him in early watching from a longer a and that that have like eight eight demonstrable fault that that just we can't let slide\nIt Jake I appreciate your calling in with that and actually a Jeffrey Rosen a Senator Richard Blumenthal of Connecticut asked\nJudge Kavanaugh about this legal principle a jury instruction Latin ms ... who know focus in on the bus which basically says if you lie about one thing we can disregard what you said about every ...\nHow much should that way into Brett Kavanaugh's confirmation remembering that this is as we've said not a court of law\nYou're absolutely right about the senator Blumenthal and it was very impressively pronounced\nHis wife and I don't know over the weekend I have a nice um\nAnd ... folks are are tweeting an opinion that judge Kavanaugh road involving Guantanamo Bay detainees where he embraced the same principle and said if you lie about one thing you lie about others\nNow are ... Democrats are promising that if Kavanaugh is confirmed and they take the house they will hold impeachment hearings on the ledge misstatements in the confirmation hearings and they range not only from\nAh his testimony involving Dr Ford and his college classmates insistence that he was a heavy drinker even though he says he wasn't and so forth but also about alleged misstatements and the first part of the hearings where he said he didn't know about a emails involving lower court confirmations shutdowns ... programs and the evidence suggests that he did\nSo regardless of whether the Senate chooses to decide that a small misstatement as evidence of a larger one the Democrats are determined to press these and they're not going to go way\nWho's your mind between sometimes the partisan lens is overrated I Am a moderate Republican women and so many women that I have known experience to solve like Dr Ford describes a friend from my church a high school friend a cousin a neighbor we believe her because we have been her\nPamela tweeted this is an impossible situation I feel deeply sorry for Ford is she was obviously sexually assaulted by someone and spent her life trying to get over it I also feel deeply for Kavanaugh as I have a father and brothers there was no way to prove his guilt or innocence", "show_name": "1A Plus", "year": "2018", "city": "Atlanta", "day": "01"}