{"month": "10", "state": "GA", "station": "WABE", "content": "You look at it musicians were would the original software junkies other than like ... you know hard core corporate business you know who needed to be able to control data and keep that control it and and that meant to have access to it at any time\nWe do with software junkies we were we were the first of all I've kept up with the with with the technology\nYou are always on your on social media your sweet but that has become such an important threat for artists and we've had managers say you know what the key to being a successful artist is what is your social media that look like ... and ... and I recently because it'll bounce Allen it's true it's\nTrue again so again fake versus the reality I mean so that's just a\n... you get non social media and what I say I am as the concept or and so that's not necessarily true doesn't necessarily have to be have any substance to it you know that people can say they're anything on social media in I mean you could ... I mean they say that\nSomebody would believe that it can also destroy your career will and not only that it's\nThere's no model for its individual to individual it's there's nothing there that says will you ... if you do it this way are you going to get more file is if you if you get this way you're going to get more more hits more looks more lives\nThat does nothing for it there's no telling what are the public will want or or or latch onto\nYou have been doing this for a long time you are seasoned veteran hardest\nAnd the ... and you got a lot [noise] still young man I Am [noise] I\nHave miles to go before I sleep and the thing about music is\nI'm not\nFor me ... being people Bryson is not a state of mind I Am people Bryson so that's the ha big apart no knowledge it was just talking about in terms of your new song [noise]\nOh yeah I mean I I I Am that so that it's it's whatever I Do next uh ... that that that's important whatever I Do now that's important it's so in terms of\nThere's there's a ... or ...\nThings to sing about to write about the shot about so because all she wants to do is me I was ...\nTo say that the title but we don't do it all she wants to do with me that's a love song ... how about that I mean that's it's every guy's dream [laughter]\nHow much fun and you have a right now touring\nI'm touring I'm working at ... records are but I have a nine month old little boy in the eye or a wife is my best friend and\nI mean in a in a in a diet that loves men and God look actually got likes me [laughter] you just love me likes me continued success people Bryson thank you for coming in as always well you're just everything here today is that part of a second hand blessing or actually secondhand grace that\nEnds up becoming huge blessing thank you rose for being here and uh if there's ever anything I can do to help your drive please\nDo has to shut up could you sing to us every morning [laughter]\nI could possibly do that no I said I thank you so much thank you [noise]\n\nDo you want to do was\nTo give them the tank Boston [noise]\nWhat a great conversation with people of rice I'm just smiling it's ... it was wonderful it wasn't a wonderful\nConversation that you hear right here on this yeah that's what we do hear a closer look and if you value those conversations six seven eight five three Ninety nine year on line and W. Abe eat out or because we're in the midst of our membership drive and you know these conversations Jay and for me I learned to as much as\nThe audience does you know and be with rice has lived here for a very long time we have a lot of notable that live here yeah but he brought some information that I didn't know\nAbout about Atlanta they Rose Scott then now you know 'cause I yeah you know I Know a little bit of a\nMuch but it's those conversations and part of the conversations we have here on closer look that we think the community wants to hear you know we're we're going to keep up with the young folks as we say you know but we're also going to let you know don't forget about some of these other folks who really put in the time and the work it's a conversation\nYeah money I generational conversations um you know thinking when when you play it allowed and at the top and I'm thinking about what that means to my little ones um and and just the fact that this conversation I can share with them I can appreciate on on a certain level you can appreciate it on a different level\nThe listeners out there the little ones um and that's just emblematic of what the show is and the diversity and breath and it brings and if people Bryson says\nThat we are truthful and that we should be of value I don't know who else you need to put that in a promo absolutely [laughter] six seven eight five five\nThree Ninety nine you're on line at W. A. B. E. doubt or because of the nation helps bring your reports not just been really locally but from around the world your donation helps pay for on the ground local and beyond news coverage\nYou know my colleague Jim birds you know we've been fortunate enough that we've been able to travel outside of the country because there was a connection to Atlanta you know Jim in in ... in his coverage of the AIDS crisis and also\nWith with his coverage of healthcare and and and what the Carter Center is doing also I travel to Amman, Jordan a few years ago right when the Syrian refugee crisis was chest ... you know all of that following what a a locally base ... international organization care\nWas doing wow that was an incredible week I didn't get much sleep\nBut it was allowed to build an incredible it was eight hour time difference but we do trips are made possible by\nDonations after the ... community contributions for everyone out there who's listening and wondering what impact does that really make these really now Neal you are because\nI took to field recording to feel recorders uh hobbies\nAre equipment and one didn't work okay so the other one word that we ... we order\nThat let the other one that the last minute because like they\n... to them you know would rose you might need says yeah so I took this little backup recorder yeah and that would work and I ... and I recorded all my field interviews on that little recording\nThings like that and the community contributions when you call six Seventy five Ninety Ninety or go to W. A. B. that or to donate that is the single largest source of revenue for W. H. B. E. we are not depending on dollars from anywhere else as much as we depend on the dollars from you\nAnd if they're eight people who value everything that Jan just said everything that I just said\nEverything that people Bryson just put what you're saying something I think I please\nDo they I don't know something anointed write to them you know what if you have a good thing\nBut you know you guys are issues comprehensive comprehensive is the word you don't have we don't have a lot of comprehensive anything you know this kind of\nIn Billups everything that's going on around us so it's important to everyone is not it's not important to just one particular genre or or or this particular portion about side or another ... portion is\nInformation for everybody and it's honest in fact based and we appreciate\nThat six seven eight five five three Ninety Ninety or on line at W. A. B. E. dot org and Jay and I know you all you are so engrossed in making sure that the messages and the content of what we're doing gets out to the community because that's what it really all about the community I was at an event last night\nAnd I always love to hear people say oh I Love your station I Love Louis I Love age\nAnd then of course someone says well I thought she'd be taller real\nShot well I'm\nI'm only five three burly [laughter]\nWhen I give it a lot you smell taller we don't I enjoy those conversations I enjoy people coming up saying well how much they love the station I'm much they love the content\nHow much they love what we're doing so that means the world to me and if we mean the world to you and whatever is that your comfort level yeah six seven eight five five three Ninety Ninety on line uh WABC dot org and Jan Barron it's a dollar you know every little\nBit helps happy little house and we like you mentioned those were committed to being in the community and to hearing from you so get connected with us move it a little patch just hearing us on the radio or on your phone call is six seven eight five\nFive three Ninety Ninety donated WABC dot org and don't let it stop there we want to hear from you want you to be at our our fence\nRose is everywhere out in the community representing all facets of the community and we would love to be more and more connected with our listeners because like we've been saying it's all about being connected being comprehensive and representing the people we are\n... and the people we serve is made possible by our senior producer Candace Wheeler producers Amelia Brock and grace Walker engineer today Jacob bulky and our digital services because they keep us on the Web\nSo if you missed any today show don't just go to W. W. dot org slash closer look in the course close look we nights at ... pm today at nine PM you'll get to hear again this fabulous conversation with people with rice and\nStay tuned in any point one W. H. B. E. Atlanta's choice for NPR I'm Rose Scott we're going to end on this song everybody sing along pull over if you're driving I have that moment I enjoy\n[noise] what every nation or gets to determine\nWho is a member or who is a citizen of their nation based on the amount of blood it you have in your your family history and I understand what she's saying this agenda individuals saying but I I Believe we must support when support is earned and do but we also must criticize when criticism is earned and do\nAnd I think when it comes to somebody like Elizabeth Warren\nShe unfortunately has perpetuated this kind of want to be playing Indian culture\nThe floodgates to people that will now use this slippery language of native versus native heritage and it is slippery language but we're used to that\nBut don't make sure we're clear on the term blood clots are we talking about that that sounds like it's related to the sensory test about going in and and finding out how much your DNA kind of takes you toward some kind of tribal ancestry that kind of what that's referring to\nWell no because every nation has the right to determine what ... the amount of blood determines if you are part of the nation or if you're not part of the nation so some so for one tribe it may be Seventy five percent for another nation it could be\nTen percent but it has to be traced back to family name and lineage and that's that's typically the test we have an Indian country it's who is your family who is your band who's your clan\nThat's how it's done not like a maybe somebody way way way way down the line with native and now I get to claim it Rick\nTweeted as an Oneida members there was nothing wrong with what Senator Warren did what was she supposed to do sit back and let Trump attacker one drop of black blood would have got you lynched in the Eighteen hundreds\nWe'll continue our conversation in just a moment with Simon ... Smith march ... and Kerry levine will be looking at more of what various Native American citizens are looking for the midterms we want to hear from you too I'm Joshua Johnson and you're listening to one a firm W. A. M. U. and NPR [noise]\n[noise]\nWith a new sustaining donation of seven fifty a month or a single gift of Ninety dollars you can choose to wait wait don't tell me twentieth anniversary digital download this collectors edition contains highlights from weight weights first two decades and features appearances by well known guests and panelists like ...\nWhen Wendy O'Connell marched into her dark and the motel six room in Columbus ohio drift over the debt Sharon broke her wrist or first thought was I'm going to sue tomboy that for not leaving the light on wait wait don't\nTell me twentieth anniversary digital download is yours with a sustaining pledge to seven fifty a month we make your tax deductible donation online at W. H. B. E. dot org or with the cold is six Seventy five five three Ninety Ninety and thanks\nThe b._b._c. world services that to provide you with a clear balanced perspective on it had a changing world\nWith reporters around the globe and provide religious stories and analysis that you need [noise]\nThat's a ... guide to the news media and saw\nThat the b._b._c. will stuff\nIt's overnight on Ninety point one W. A. B. E. [noise]\nSupport for NPR comes from this station and from the Kauffman Foundation working together with communities in education and entrepreneurship to create uncommon solutions to empower people to shape their lives and be more successful more online at ... dot org\nFrom the lentils and foundation committed to improving lives through invention in the U.S and in developing countries and working to inspire and enables the next generation of inventors more information is available at ... dot org\nAnd from the any each case the foundation\nThis is one a I'm Joshua Johnson we're discussing the impact of Native American voters and candidates in this year's midterm elections with Simon Malia Smith a Chicano writer and reporter CNN contributor and then a glut Lakota citizen\nMark ... editor of Indian country today and they showed ... citizen and carry levine a senior reporter for the center for Public Integrity\nWe heard from quite a few of you who shared your stories\nAbout exploring your tribal ancestry about what that means to you in the context of your life here's one voice mail that was left in our inbox\nHi Sheila this is Carol elaborately uh I found out about oh four or five years ago that we had a lot of documentation from my mother to us that we were part of the Choctaw tribe in Oklahoma we applied to be a member of the ... tribe we were accepted\nAnd it's been a real joy to be a member 'cause we um\nWe can vote now we get all kinds of information from them what they're doing with the tried just amazing\nCarol thanks very much for getting in touch with us ... can you give us a sense of of what the process is for becoming an acknowledged tribal so there's an understanding that every tribe has the right to set its own process and they can be be quite different but ... broadly speaking what what does it take\nYou usually a tribe has an enrollment committee of some kind that actually goes through and sets out the process required proving family connections to Simon said are looking for I'm basically I'm a history of involvement with the tribe that goes back um ah through time\nI mean one of the I think really important ideas and this is that I'm a tribal community has one that's been around\nIn many cases for tens of thousands of years and so this idea of a long art and being part of that is I think really important things I Love to think about is shown is was hunted vested on hunted mastodon hunted vested I think about that long arc\nYeah yeah I it's I Can't imagine Simon the benefit of just kind of knowing\nThat you're part of a community that goes back\nMillennia you talked about appropriation by whites of tribal culture are there other kinds of benefits that you find whether they're intrinsically extra benefits of being an acknowledge member of a tribe that are worth\nProtecting that are worth keeping their proper places I mean Carol talks about being able to vote in the tribe and also just knowing what the tribe is doing what are the kinds of benefits are there to being an acknowledge citizen of a truck\nWell I think what you kind of hit it right there with that that word protection I think that's for us it is we are it is incumbent upon us to protect our ... our our children are native languages are traditions are land\nThe water and the problem I see what these people that are doing these DNA test is booming biotechnology business where people want to know if they're native\nYou know they they the problem is some of them take our culture and they can modify it\nThey take our language and they can modify it they take our spirituality and modify it and they make money\nThey make money off of something that they just either learn they are or it's been a part of their family lore or they speak with some ... mugging titled meant\nLike they've lived the life of a native like somebody who's ever called them an engine or a our word the name of the Washington football team and that's where it becomes problematic and we have to check these allies at the door even if it's Elizabeth Warren\nI should note by the way it was almost exactly a year ago today that we did a discussion about these DNA testing kids the ones that say fine ...\nFree and learn what your family's from we did a program today's October seventeenth we did it on October ... teams of last year called ... where do we come from where we spoke to a geneticist\nNamed Adam Rutherford who's gone into some of the latest research about what DNA can and cannot tell us about ourselves and what you actually need to know if you were going to do one of these home DNA test\nYou'll find that conversation with Adam Rutherford on our website the one a dot org that's the word the the number one daughter a dot org Brittany tweeted I Am a ... Hanukkah or mohawk\nAnd I'm frustrated with people claiming native as a race and doing nothing to help me to issues or thinking that they're uninformed opinion on native issues is helpful\nUA progressive tweeted what we're not talking about now is North Dakota voter disenfranchisement please focused on this\nProgressive she must have known why we both Kerry living 'cause we were going there next because over the past few days there's been this story about Senator Warren but Kerry we wanted to invite you on specifically to talk about what you would progress has brought up there's a lot of focus on what's happening in North Dakota what is going on there\nWell North Dakota\nHas a voter identification law that has been stayed by the courts until now last week the Supreme Court\nTypically between two hundred and fifty thousand and three hundred and fifty thousand people in the St turned out to vote and federal elections what that will be this year I'm not exactly sure at presumably on the high side for mid term but that's about the range of people were talking about so it doesn't take much to to change in election\nI Know we have to pause and just a moment but mark what are you seeing in North Dakota where do you think this is headed\nI think this will make it a lot closer than it would have been I think it would have been very one sided election before this all happened so\nWhether it'll be enough or not for us that are kept to win reelection I don't know but I think it would not have been a contest of this\nAnd Simon ... Smith I Know we have to let you go momentarily but what do you see as the as the outlook for this going forward\nI think uh you know I have to agree with mark I think it's going to galvanize so many indigenous people that are going to go out there and I think that you're going to have a swell of indigenous people hitting the polls and I'm\nTelling them no you can't take my vote you know my my voice matters are voice matters with the original people of this land we're stewards of this land and you're not going to take our our rights away from us\nDo you feel more fuel Simon like this is something that's that's a a growing groundswell among Native American voters across the country this issue of voter disenfranchisement\nOh yeah most definitely and I think a especially under this this rotten administration a lot of indigenous peoples are are going to come out to vote especially to get all of them out we saw how it played out with people like you know when they were trying to get Kavanaugh in and they finally got cabinet and\nThere were like no this is this is horrible and this is happening on our watch as indigenous people were not going to let that happen\nSome employers Smith a Chicano writer in reporter uh CNN contributor and also in a global Lakota citizen working on a book coming out next year\nAbout his experiences as a Native American in the twenty first century Simon it's been a pleasure to have you with us thanks for talking to his\nEx wrap them we'll continue our conversation in just a moment with mark ... and Kerry levine and we'd still love to get to more of your questions and thoughts as well about being a Native American voter and the issues that matter to you in the mid term stickler [noise]\n[noise]\nWith your new sustaining donation of thirty five dollars a month or a single contribution of three hundred and sixty dollars we'd like to send you three great gifts the Seventy eighth anniversary WABC short sleeved T shirt new WHAT east socks and new WABC turban stumbling\nThe shirt and socks are new design and both feature vintage radios and the Turkish Tumblr features the Seventy of anniversary WABC logo this all things WABC combo is yours as a news the state or at thirty dollars per month\nLeaves make your tax deductible donation online at W. maybe eat words or called six Seventy five five three Ninety Ninety\nWith midterm elections around the corner keeping up with the headlines\nThis political season can seem like Democrats need twenty three seats on net to take back control of Congress a teacher did the Kentucky state house majority leader Republican mine are all things considered gives you the context and analysis and news you need without all the noise here the bigger picture\nEvery afternoon from four to six thirty on Ninety point one W.\nA. B. E. um this week said lap as symphony orchestra broadcast it and all American program featuring Dennis\n... so low it then the piano concerto by George Gershwin Aaron Copeland symphony number three and a her continued celebration of\nJohn that I'm Lois rights is joined me tonight nine on W. A. B. E. ...\nSupport for NPR comes from the station and from the Annenberg Foundation committed to supporting educating and engaging communities in the United states and globally for more than twenty five years learned more at Annenberg Foundation dot org [noise]\nFrom Americans for the arts committed to transforming America's communities through the arts and arts education supporting the nonprofit arts industry which employs four point six million people nationwide learn more at Americans for the arts dot org\nAnd from the any each Casey foundation\nTomorrow we'll continue our conversation about the mid term elections with a national look at major races and issues we booked a great panel but we could use your help to focus the discussion what are your main questions in your main concerns about the midterms candidates polls voter turnout controversies or anything else\nLeave us a voice mail eight five five to three six one a one day which we talk about tomorrow when we talk about the midterms on a national level that's eight five five to three six one two one two\nYou can also send us a radio quality audio file through our app won a vox pop you can download the app that's V. O. X. P. O. P. in the store and we'll share some of your questions and thoughts tomorrow [noise]\nBack now with mark ... of Indian country today and carry levine of the center for Public Integrity let's turn now to the number of Native American candidates on ballots across the U.S for the midterms we'll hear from one of those candidates\nIn a moment but first mark I'd like to come to you you've been following Native American candidates for years what are you seeing this year that is\nThe same as the past or that may be different\nOh it's a record breaking nearby a almost every measure at this point past the primaries more than a hundred and four candidates\nUm we have for the first time ever more women than men running for office or just to look at lieutenant governor with a five candidates for lieutenant governor across the country three candidates for governor across the country uh nine for the U.S house of representatives it's just pretty extraordinary also have some breaking news uh\n... just yesterday the lieutenant governor of Alaska Byron the lot who as Clinton resigned and was replaced by a\nDirector of health and Human Services in Alaska Valerie Davidson is you pick as she is now the first native woman to ever be lieutenant governor of a state wow\nThat's just as of like the last twenty four hours yes can you give me a sense mark and this may be kind of a hassle question but\nWhat does it mean to to folks of tribal dissent to see other people to travel to send in these kinds of positions senators members of Congress Senate governors governors can you give me a sense of intrinsically what that means\nWell I mean there's the old joke that if uh you're not at the table you're on the menu and that's certainly part of it but um I tell you I traveled last election cycle with the news Juno who's running for the house in Montana\nAnd everywhere we went little girls would come up to her and want their picture taken with her and you just saw this deep sense of wild that could be me some day and that I think is probably the most powerful message out there\nWell we'd love to hear from some of you about which candidates of tribal descent you are keeping an eye on if there are Native American candidates that you are pushing for or that you have concerns about that are on the ballot in the midterms\nWho are you keeping an eye on and why email is one a at W. A. M. U. dot org perhaps one of the candidates on your radar\nIs Debra Haaland who joins us by phone to talk about her experiences she's a democratic nominee for New Mexico's first congressional district and she has a ... of Laguna citizen Deb welcome to want to\nThank you so much\nWhy are you what what made you decide to run for Congress\n[noise] well I've been involved in politics in New Mexico for a number of years and I was just finishing up my term is the state chairwoman of the Democratic\nParty of New Mexico and I just felt that I wanted to continue to uh work for my state and worked for the the people I Love here and so uh the seat opened up and I I felt that um I Would have a good chance of winning\nAnd so I decided to run to be a strong voice for the people of New Mexico\nNo New Mexico's first district just looking on the map that includes Albuquerque and some of the areas south east of New Mexico is that right\n[laughter] so well there's some areas north and there's some there's some areas east and West is two tribal communities and the district Sandia Pueblo and the ... a Navajo Nation chapter [laughter]\nSo um so it does it geographically it's not large but it has a very diverse population so that is\nGreat now if you win next month's that would make you the first Native American congresswoman in American history ... would that mean to you\n[noise] well of course what I always say is that I Can't speak for my tribe or any tribe but ... my perspective growing up\nUh in to a ... a woman uh with my my mom and my grandparents you know teaching may our culture and traditions and just\nUnderstanding you know having worked for several tribes and and understanding about the issues and the challenges that we face a which\nIncidentally are are the same as a lot of other places in New Mexico and across our country so I just feel like having that perspective at the table a will mean you know something um something good for a for our country a voice that we haven't yet heard\nAnd value life path provided organizations robotic process automation pastors dedicated to making work in hiring by freeing workers from tedious task smart ... marketplace\nJim Gibson and a little bit morning side I've sort of look at the world of history and literature and everything is like a gigantic ocean and my idea is that the deeper you go into it the more you get out of it\nBut NPR converse is with us educates us entertained to shove it takes us deep into stories and I really really appreciate that and if I should ever win the lottery you'll be number one on my list of people to remember\nJim thank you so much yep educates entertains it informs us these are the consistent character traits of public radio and no doubt that while you listen\nLook we've got nine pledges to stay on track in this hour Ken we count on you just like Jim has counted on us six seven eight five five three Ninety Ninety or W. A. B. E. dot org\nSix seven eight five five three nine zero nine zero W. A. B. E. dot org I'm Christine Dempsey he's Dave Barry Swain leaping with you well maybe it was only been with you for a few minutes 'cause he just tuned in and it's just in those few minutes we still need your help we need your support we're looking for okay\nIt's not a big number it's reachable number it's seven seven calls to end morning adjusts edition successfully\nNow I Know that it's something that it's on your list of things to do you know if and if you liked to cross out things this will only get three minutes you do it and you're and we'd like you to support W. A. B. E. now because the closer we get to our overall goal\nThe sooner we go back to ... regular programming so we're asking for your help right now\nSeven eight five five three Ninety Ninety or W. A. B. E. dot org and when you make a contribution right now I'm On this the penultimate day of the drive your name is being entered into a drawing to win one of two Edison electric bikes\nAll you have to do is donated six seven eight five five three Ninety Ninety W. A. B. E. dot org this is courtesy of Edison bikes over and Kirk would one of the bikes we'll go to an existing sustaining member\nThank you sustain is so so so much the other bike is going to go to a brand new member\nSomebody who joined the W. eighty family for the very first time today that's where the second like it's going we haven't talked to you about your odds and things like that but let me tell you\nIt is a great time to make a donation to W. ab you're going to help us Stay on track and you're going to help\nA great radio station at the same time six seven eight five three Ninety Ninety or W. A. B. E. dot or about five pledges to go we need your help six seven eight five five three Ninety Ninety or W. A. B. E. dot org\nWith your new sustaining donation of ten dollars a month or a single contribution of one hundred and twenty dollars\nYou can choose a package of fifty meals for the Atlantic community food bank these meals we'll go to help families in need all over Atlanta and across North Georgia the fifty meal packages yours with a new sustaining donation of ten dollars a month give to great gifts at once this fall online at ... dot org or call six Seventy five five three Ninety nine to ...\nSupport for WABC comes from ... Atlanta a ... family dealership featuring the Audi cue fired the luxury SUB appointed with Audi virtual cockpit and the other rich infotainment systems learn more at Audi Atlanta dot com\nSix seven eight five five three Ninety Ninety or W. A. B. A. dot org that's how you show your support for the station we've got about four pledges left\nTo wrap up this hour successfully and here's how this works if you make your contribution right now start the process right now even though it's nine fifty nine you will still be counted in this hour has tally\nPlease make your contribution make a difference right now it's six Seventy five five three Ninety Ninety or W. A. B. E.\nDone or don't just sit on the sidelines cheering us on saying I Hope that you make it\nJumped off the bench get to your phone go to your computer and help us make it you make it happen when you become a member right now the number six seven eight five five three nine zero nine zero six seven eight five five three Ninety Ninety or W. A. B. E. dot org\nSuzanne from Atlanta just wrote and she says you know what I'm already has a standing member but I couldn't pass up the Seventy eighth anniversary is that's how you feel if you know the station is of value to you\nMake a contribution to support it you know what you can afford and now for the last time we will tell you we are so close but we want to make sure that you get in on this drawing giving away to Edison electric bikes one we'll go to an existing sustain her\nAnd one will go to a brand new member who joined us today it could be you please make a contribution\nThis is W. A. B. E. Atlanta make a pledge W. A. B. E. dot org and thank you\nLive from NPR News in Washington on core of a Coleman the U.S commander in Afghanistan has escaped on heard from a shooting incident that wound into Americans and killed a prominent Afghan police chief Jennifer glass reports from Kabul\nThe shooting occurred as the commander of us and NATO forces general Scott Miller was finishing a meeting with senior Afghan officials in Kandahar southern Afghanistan about security and upcoming parliamentary elections NATO says Miller was not injured\nThe Taliban have claimed responsibility for the attack that killed powerful provincial police chief Abdul Raziq he was seen as crucial to the security of Kandahar the birthplace of the Taliban with a group continue to have a presence\nReading it was also criticized for alleged torture and running and legal prisons but his death could leave a security vacuum in Kandahar and get further undermine long delayed parliamentary elections on Saturday for NPR News I'm Jennifer glass in Kabul\nThere's word now from Afghanistan that the provincial intelligence chief was also killed in that shooting and the provincial governor has been wounded\nTurkish and Saudi Arabian investigators have finished searching Saudi properties and it's done bull or Saudi journalist ... went missing turkey says it has evidence the Saudi Government killed him Saudi officials v\nTonight is the Washington Post has chosen to publish ... most recent column is editor Karen ... told NPR's MORNING EDITION the paper felt the column was timely\nWe just decided that now is the week at the time to do it I I think also has the story is moving to a more political story a story about us Saudi relations\nUm golf relations I think we just decided that it was good to bring the story back to Jim I'm a huge amount was ... and his ideas\nWashington Post editor carrying a T a power is returning to more communities in the Florida Panhandle devastated by hurricane Michael NPR Zazi low on reports of few school districts are set to reopen for classes next week\nSchool districts are preparing for students to return early next weekend Holmes county and Franklin County which sits along Florida's northern coast the classes are still cancelled in most parts of Florida's panhandle ravaged by hurricane Michael\nExactly or window schools will reopen for students some school buildings are sheltering hundreds of families across the region as a cleanup continues after the storm\nState officials are now sending up the Base Camp in Tallahassee to provide long term housing for the utility workers and first responders working around the panhandle where more than a week after the hurricane many do not have electricity or cell phone service and you along NPR News Panama City Florida\nThe death toll from hurricane Michael is now up to twenty nine people many people in the Florida Panhandle are still unaccounted for on Wall street the Dow Jones industrial average is down one hundred and fifty five points the NASDAQ is down sixty two points you're listening to NPR\nPresident Trump is tweeting about thousands of migrants from Honduras who have reached Mexico's southern border with Guatemala\nThey say their destination as the United states Trump is threatened to cut off aid to any Central American country that does not stop the migrants today he tweeted if Mexico failed to do this he would call up the U.S military and close the entire southern us border\nOregon's court of appeals is set to hear a case of an African American man convicted by a non unanimous jury as Oregon Public Broadcasting's Conrad Wilson reports if the court granted a new trial it effectively means Oregon would have to abandon its split jury system because it's unconstitutional\nIn twenty sixteen Olin Williams was convicted of first degree sodomy by a split jury meaning there were two jurors who thought Williams was not guilty\nNow he's asking the court of appeals for a new trial like Williams one of those dissenting jurors was African American Williams attorney says Oregon's non unanimous jury system violates the equal protection clause of the U.S constitution\nThe Oregon department of justice argues Williams requests for a new trial should be denied because it's not based on newly discovered evidence or and allegations of germ misconduct Oregon and Louisiana are the only state that allow non unanimous jury than criminal cases for NPR News I'm Conrad Wilson in Portland\nFlash flood warnings are up for parts of central Texas the national weather service says storms will persist in the region north of San Antonio flooding is already killed several people in Texas the bodies of two people were discovered this week in water near the town of Leno\nCasey give us a sense of what New Hampshire is like politically for those who've never been here in what ways does it reflects other parts of the country and what we've just New Hampshire really unique\nI think in Hampshire it's really a true purple state we sent an all democratic into all female delegation to Congress which I Believe was a first for the state a Republican controlled every branch of government at the state level some of that can be chalked up to gerrymandering but I think it also just reflects the kind of\nA voting patterns that exist and the true you know kind of live free or die independence that a lot of New Hampshire residents like to think that they have\nIn fact independents are the largest voting bloc in the state they make up about forty percent of registered voters as of the latest tally so that can contribute to some unpredictability in election results and also can contribute to candidates who\nOften are on perhaps less extreme as you might see in other places towards one end up the political spectrum or the other\nI Know we've got to let you go in a moment but Casey what is the polling look what look like right now for the congressional races\nSo there's not a ton of polling here so we have very little to go on that as Dominican sad\nBoats congressional races are looking like they are leaning toward the Democrats right now that said obviously a lot can change between now and election day so it it you know for that reason and also for the reason that outlined given the at the political makeup of the state it could be you know could turn out differently\nWhat does it seem like it was going to make the difference who's national issues or more local issues\nI think a local issues I think New Hampshire it's really a state where people are very plugged in politically to what's going on at the state house what's going on at their local town government a lot of the candidates while they will referenced what's happening in the national landscape and I think are increasingly doing that in New Hampshire on at the end of the day people are really building about what's going on in their backyard\nSo far people up about say Nancy Pelosi or Donald Trump isn't a hundred percent effective\nCorrect and I think people are ... are concerned with issues like the opioid crisis issues like health care issues like the economy taxes New Hampshire as a unique tax structure here so that you know can be very I their influence on people's voting patterns of\nCasey McDermott covers politics and policy for New Hampshire public radio Casey thanks for talking to thanks for having me we'll continue our conversation on the midterms with NPR's Domenico Montanaro wanna summers will be Associated Press and Katie centers of politifact we walk more of your questions and comments as well\nI'm Joshua Johnson glad to be with you from Concord New Hampshire you're listening to one day from W. A. and you end NPR [noise]\n\n\nThanks for joining us for one ink on member supported Ninety point one W. A. B. E. Atlanta I'm Sam Whitehead might've heard we are in the middle of our fault membership campaign actually we're pretty close to the end today is the penultimate day of our drive second to last\nAnyone who donates today is being entered into a drawing to win one of two Edison electric bikes all you have to do is donate right now it's six Seventy five five three Ninety Ninety or give online W. A. B. dot org thanks so much for your support weather today mostly sunny with high near Seventy\nOr time now is to Nineteen\nSupport for WABC comes from his into its customer service and engagement platform connects companies with customers through email lived trip and phone support all from one interface to read the company or customers want you to be learned more at ... dot com\nFrom Atlanta planet dot org here's the look at some upcoming events [noise]\nThis weekend the Stone Mountain highland games that are taking place\nAre more than forty years the event featured they hype settles dancing anymore\nThirty ninth Georgia State University in St Paul corals showcase [noise]\nIf you're looking for something to do in Atlanta\nAtlanta planet dot org or download the app on Nineteen [noise]\n\nSupport for NPR comes from the station and from progressive insurance offering its home quota explore so shoppers can evaluate options in one place when buying home insurance custom quotes in rates are available online learned more it progressive dot com\nAnd from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefellers work in food health power jobs and resilient cities at rock sound dot org\nThis is one a I'm Joshua Johnson we're discussing the upcoming upcoming midterm elections with NPR's Dominican lots of narrowed the eighties wanna sellers and Katie Sanders of politifact\nWe'd love to hear from you if there's a particular race or an election that's coming up where you live in the midterms that you're watching very closely we'd love to know what's on your mind about that race or if you just have some questions about what's going on with the midterms overall nationally right now now is a good time to share those comments on our Facebook page where you can also watch video stream of today's program\nTweet us at one a or email one at a at W. A. M. U. dot for them and I wonder if we could pick up with that last question I asked\nCasey Kendra tweeted what I Would like to see is all of the Democrats and Republicans voted out of Congress they are so polarized we need to start over\nHow much do you get a sense that the pure polarization of today's politics is just changing the way voters approached this year's midterms I mean you know Nancy Pelosi's named still comes up quite a bit on the campaign trail she's a of an obvious kind of a hot button for many Republican voters but\n... is that working in terms of making people show up or is it just turning people off\nYou know a lot of people might be an are frustrated with politics and the country but we're seeing the opposite effect of not keeping people home or or voting for some third party coalition in fact it's people strapping on the T shirts and going as hard as they can\nI Do in their political corners I mean the fact is midterms are usually about activist they're usually about the hardest core a people within the party but in fact\nWe're seeing the potential for a surge this year in turnout I spoke to Michael McDonald who's a professor at the University of Florida who's really\nOne of the preeminent turnout experts in the country maintains a turnout database he expects there to be a turnout of about forty five fifty percent of eligible voters this year that doesn't sound like a lot but it would be the highest level for mid term since the mid Nineteen sixties\nAnd that is really spurred on by all of this high interest for seeing high turnout in primaries in in special elections\nAnd you know frankly you've seen Democrats really fired up to vote against this president and we've seen that according to a Pew sixty percent of people say the president is a factor in their vote and that's higher than it's ever been\nA wonder wanna summers what your take is on that in terms of the potential playbook for Democrats first of all let's just said a little context is focused on the house for example how many seats with the Democrats need to flip the house\nShirts that Democrats would need twenty three seats in order to take control of the house of representatives and right now most public pull in when we look across the landscape suggests that\nThey're doing they're making good efforts and things are looking good for them right now one thing that I've noticed as I've been talking to folks who work on the Democratic side of the aisle who are professional political folks is they're spending a lot of money to make sure that their voter turnout and are particularly looking at the types of voters infrequent voters who say\nMay show up in a presidential election year but are more likely to stay home\nAnd I'm an off year or mid term here and there's a reason for that\nTypically when we look at the electorate that shows up for mid term elections it's typically older whiter and more Republicans ... Democrats spending a lot of money and a lot of time on the ground trying to turn out younger voters those millennial voters of color or Latinos African Americans and Asians who are more likely to vote for Democrats are also more likely to stay home\n... is there a certain benchmark wanna for what Democrats would consider for lack of a better word a blowout slide you use the goal just to get a fifty percent plus one or is there a larger like a stretch goal but the Democratic party is aiming for\nWhat I'm hearing from most people including Ben ray Lujan congressmen who chairs the demographic democratic congressional campaign committee as they don't think this is going to be a blowout year they feel confident and their chances of taking back the house\nOf turning the house ... but I don't think most people most members of Congress were involved in this would say that there's going to be a huge blue wave crashing over a pack of some ten seats or something like that\nThey're focused on delivering that twenty three at turning the the hospital and the message I keep hearing from them as they want to do that as a a balance of power right now Republicans\nControl every branch of government and they want to restore balance of power to this administration\nYou know this idea of a blue wave was the focus of an email from Marty who wrote I'm all about the blue wave but I'm afraid that between voter disenfranchisement lingering gerrymandering and possible foreign interference we're about to be pumped again\nDominican let me ask you about some of the polling what are some of the main trends in national polls right now in terms of how the Democrats and Republicans might do\nWell when we look at our NPR PBS NewsHour Marist polling Democrats have had an advantage on what's known as the congressional ballot who would you prefer to be a two run Congress ... the Democrat in your district or the Republican the ... in your district\nThat was twenty sixteen we had two very different kinds of advertising ground games you had Hillary Clinton who did a lot more conventional advertising Donald Trump did a lot of online advertising kind of burned up Facebook but how do you see the difference between twenty sixteen twenty teen ad watch\nShirts I think the biggest thing to go back to what one of 'em the earlier caller talked about that I've heard and seen differently as how they can't campaigns are approaching this issue of health care I think that several years ago you could never imagine that Democrats would be running ads touting their support\nFor the foreseeable CARE Act but the landscape is so different now you know\nI'm over for election cycles you saw the Republicans accused Democrats of messing up voters health care with so called Obamacare they vowed to repeal it they try they failed and it's going to Democrats an issue to really pounce on I think that we've also seen in terms of advertising a lot of these ads have gotten frankly and not just on TV but also in some of the mailers that we've seen\nReally personal and really jarring and I I think there are some of that and twenty sixteen but I think it's gotten a lot more that way and twenty eight\nAnd if I can give you one statistic the when when media group a witch citing or can't our media a which tracks a lot of these ads and buys a lot of these ads half of all the ads that were run in the month of September were healthcare related ads and most of those were pro democratic\nAnd as one of notes that is a huge shift from twenty ten and an ironic twist given that Republicans took back the house fueled by opposition to the Affordable CARE Act\nI Want to make sure I'm clear on what statistic was half of all the political ads nationwide ran last month trial on health care that's right and and most of those were pro democratic before we got a pause and limited but\nIt's amazing how surprising and not surprising that is I mean if you look at even Google's figures for what people have been searching the most in the run up to the election healthcare has solidly been the number one search for months\nYeah and I would say one other thing about some of these issues in the polls because a few recently looked at as some of the issues and how far apart people are on them\nThey looked at opioid addiction which I Know a was mentioned in our New Hampshire segment or the deficit and health care as three of the N. F. ethics by the way as a threat before very big problem facing the country and all of those are places where Republicans are on their back for\nMuch more to discuss as we continue with Dominican lots of neuro Katie Sanders and want a summer still time to get in some of your questions and comments as well liberty emails you can't ignore all the voter suppression going on in Georgia\nA whole group of black seniors were kicked off the bus that was to take them to vote will talk about voter turnout and voter suppression in just a moment ...\n... [noise] [noise] [noise] [noise] [noise] [noise]\nIt's one a member supportive Ninety point one W. A. B. E. Atlanta I'm Sam Whitehead thanks for joining us this Thursday morning\nToday is the second to last day of W. A. B. ease fault membership campaign he my hearing the word penultimate thrown around and good but stay on the radio\nWhat a great time to become a member of W. A. B. E. and support the kind of programming that matters to you [noise] anyone who donates today's going to be entered to into a drawing to win would have to Edison electric bikes [noise]\nNot a great reason to give you have to do is doing right now it's six Seventy five five three Ninety Ninety forgive on line at W. A. B. E. dot org and thanks [noise]\nSupport for WABC comes from taste of Atlanta a three day food beer and wine and cocktail experience friday through Sunday October nineteenth through twenty first in historic fourth word park Atlanta restaurants cooking stages live music and more taste of Atlanta dot com [noise]\nCome to the office and then from ... courage men in these trying time her new book is called everything's trash but it's OK\nSick co host of two of queens joins us on the next city life to live [laughter] so I'm Lois right says joined announced at eleven AM mom ... be [noise]\n\nSupport for NPR comes from this station and from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with a legacy of putting clients financial wellbeing first learn more at Raymond James dot com\nAnd from the science themes foundation since Nineteen eighty five supporting advances in science education and the arts towards a better more just society more information is available at size Sims foundation dot org\nNow to our conversation with one of summers of the Associated Press Katie Sanders of politifact and NPR's political months and are all still time to get in some of your questions and thoughts about the mid term elections email us one a X. W. A. M. U. dot org\nTweet us at one eighty or comments on our Facebook page where you can also watch or video stream of our lovely environs here at New Hampshire public radio also you can go check out some more of their excellent coverage at an H. P. R. dot org including of some of the things that make New Hampshire unique\nThere's a story about a giant pumpkin boat race in ... town\nI didn't know pumpkins were that boy it but I Will after the show I went to check it out and H. P. R. dot org let's get to some of your comments about the midterms Laurie emailed I Am a lifelong Democrat and I can tell you what frustrates me and has for years\nThe complete inability of the dams to get a message and stick to it I've gone to my local Democratic Party website in the front page does not say what they are for does not tell me what they care about\nJuana Summers you've been following the Democrats in the run up to the midterms how common is Laurie complaint and how well are Democrats doing an answering it\nWell I think what Laurie is pointing to is actually really comment and I think Democrats are trying to figure out how it affects that number of the conversations I had\nI recently wrote an article that looks at how Democrats are trying to make sure they have record mid term turnout and they said that when they're talking to voters are sending out mailers are going and knocking people's doors in these battleground states and districts are trying to make sure\nThat they're telling their voters that they have a message that they are running on rather than just having these conversations that are about just running against President Trump's base it on I was talking to some groups that dead centerfield testing recently among Latino voters and they Simon and when they get this field testing\nAnd they were saying people were turned off is that if they got a ... a mailer from their local democratic candidate had President Trump space on it they'd be super turned off right they throw that away they wouldn't even engage or see who the candidate was so I think they're really trying to tweak that matching you're talking about what they can do for them what's at stake that that's\nThat's why you hear are Democrats nationally talking about how this is the most important election of our lifetimes why you hear about health care message I think is demanding to know that being such a huge share of the advertising that you're seeing from pro democratic groups it's because they do realize that they need a message for their voters to coalesce around otherwise they're not going to turn out\nTo medical I Wonder if we could follow up on that theme was one more voice mail from a listener on the east coast here's what judge John left in our inbox\nShould try and make sure to New York\nShow off and on the shows\nPeople for the Republicans for Democrats or Republicans the Democrats or Republicans for instead of doing that they should be focusing on specific policies namely the Democrats that stand for such and for\nThe Republicans to stand for such and such you helped educate listeners because you don't gain anything by just growing Democrats Republicans Democrats Republicans\nJohn thanks very much for calling and sharing your thoughts with us no medical for me I don't know how you hear this but for me as a journalist I feel uncomfortable saying the Democrats who stand for X. I feel more comfortable saying the Democrats who say they stand for\n... or the Democrats who have done that to me journalistically that's more reliable but I Do take John's point that it just feels a little bit too broad brush\nYeah I mean we have to always be aware of trying to get into some of the issues and where are the party stand on these things and what they've been pushing I think that that's been part of\nThe pushback and why you've seen so much interest from Democrats obviously in this election because they've seen so much of what President Obama did a and regulations that were put in place that have been rolled back for example a by the environmental protection agency a and a whole host of other things including an immigration policy\nThat Democrats are firmly against\nAnd it's also what you saw a as a rise of the Tea Party in twenty ten where they didn't trust a lot of their government officials including a lot of Republicans in how they essentially took over the Republican Party with that message of uh taxed enough already and being really in opposition to\nA President Obama's health care act so the parties stand for a very very different things and we're seeing that play out and going to come to a head and in this in this midterm\nStudio I Wonder if you can respond to a listener who left a note on our website the one eight dot org listener writes was the upcoming midterm elections and Michelle Obama's advised to go high when opponents go low what is the effectiveness of negative campaigns are the negative campaign ads coming from a particular party or group Cady\nOh I think everyone's guilty and I don't think any party as a\nAs an Israeli going going high all the time right and I think that's because it's effective and that really sticks with people as much as people like to say that they dislike negative advertising and I think actually do it is a memorable", "show_name": "1A Plus", "year": "2018", "city": "Atlanta", "day": "18"}