{"month": "10", "state": "GA", "station": "WUWG", "content": "Thanks [noise] and ...\nYou're listening to your gp be radio when a team station service of Georgia Public broadcasting thank you so much for tuning in the evening American roots who's next ... be [noise]\nHurricane Michael was devastating for South Georgia farmers recovery will take years some farm will never be the same\nQuarters happened down here in South Georgia is nothing less than a cash or you're just ... farmers why wherever\nThe reporters are in South Georgia as farmers deal with Michael's aftermath began the long road to rebuilding listen for the record during MORNING EDITION and all things considered ... you can with the facts\nFrom the University of west Georgia business Ninety point seven FM Wu WG aimed at W. W. A.\nG. H. G. Carroll that part of Georgia Public broadcasting radio network\n\nOr your consideration [noise]\nThis is American roots from New Orleans or the ... [noise]\nIt's a time for St spirit holiday and holy day for the living gather the day of the dead\nAnd the most revered dead recalled for Tucson\nThe Hallows in daily life gets blurred in night dream of our hopes and be a\nShannon saw the already punk rock band\nWhen she began every single night\nI haven't really ... says send it with me to carrying in the daytime [noise]\nDefinitely felt kind of ... and it was often he resigned\nChildhood I was also born a\nFew days before Halloween so I'm\nCody\nBlanchard in Shannon Shaw Shannon and the glam\nComing later this hour along with pails of Hans ... who didn't [noise] from Memphis many little\nHowlin' Wolf\nOutlook will\nStarting with the bail bonding Nina Simone\n[noise]\n\n\nNa [noise]\nA\nBowman inside the\nBetter screening\nSee it [noise]\n\n\nHe ...\nSaying man I remember when you\nLive\n\nI\nWay\n\nNa\nNa na na\nAre\nTrying\nBed I Am\nMan and the\nThere\nReminder\n\n\nIt's American roots\nHere with Halloween a fiction shame and then the Klan [noise]\nAfter meeting in the bay area a decade ago Shannon Sean Cody Blanchard again brewing up the doo wop me understand Shannon and the Klan [noise]\nWe love a puppy ... side by both John Waters movies were teenage George songs of sixties pulled into a musical persona is visually and ...\nThe ban recently teamed up with Dan our back on the black keys to produce their fifth album onion\nSheen until the growing up Mormon\nIn rural California finding an escape in means\nWhat we lived in a kind of like a hobby farm\nWe had horses and a ton of chickens and ... and ...\nAll the time we raised rabbits for meat that much lately eight rabbits and I really did like living out in the country I'm asked for music we listened to a ton of old ease and eighties country music and then it had an older brother he's Thirteen Years older than me\nThat is for music we listen to a ton of oldies and eighties country music and then I had an older brother he's Thirteen Years older than me and he listened to a lot of a player and Metallica and things like that so I think that they're all pretty good ... division with [noise]\nFarm country life and being Mormon [laughter] [noise]\nI think a big part of getting into more alternative music growing up was you know some kind of resistance also were pretty controlled by our parents and not allowed to listen to anything inappropriate\nBut you have an uncle Richard ... bad now did you figure into the mix\nYou know he is a strange in various character that I've only encountered a few times I actually think that the way we idolized are uncle Richard got us into where kinds of music he came to live with us when I was probably nine [noise]\nHe wouldn't talk to us because he was not a very warm person and me and my brothers would like watch him through window\nPlay guitar and we're just totally fascinated just slept on a mattress floors padded but she was beautiful guitars\nAnd one way or like the prison flip on and then cut short any like a beautiful pompadour\n... do me about your growing up uh I grew up in Portland actually I just moved back there a couple of months ago [noise] it's like real moxie like hobbit homo like big for trees and stuff like that um [noise] but yeah I just grew up on a little ranch house kind of running around and\nReal moxie like hobbit homo like big for trees and stuff like that um but yeah I just grew up on a little ranch house kind of running around in the woods and\nSetting up firecrackers and shoplifting I didn't know you read shoplift don't really know actually other kids used to pay me to steal\nThat can say I think it's the statute of limitations was over there were just dealing candy and nurse ... well yeah\n[noise]\n\n\nTell me and chairman of art school in Oakland\nTwo thousand I don't think he even notice me right on or how they noticed you know I did I hear either a\nPerfect reason to form a band yeah\nBut then eventually we were in that class for a whole semester and then we're like oh like sheep ...\nCool stuff I instantly looked at him totally differently my art which is yeah me too actually if you go oh\nWell I Am\n\n... you're driving a lot of the vocal anti here sixties girls groups and ah you know do what I mean I think you transcend all that but how about some of your heroes here when so in music\nDefinitely rare but then I think is one of the most important\nIs of all time he's always been one of my favorites but that has not said it at all\nThe most important thing is a long time he he's always been one of my favorite but that has not said it at all\nOh my oh\nOh oh\nOh oh oh\nOh no\nAnd then added James is someone I found more recently [noise] and then I Love the like really high pitched crazy stuff like Frank yeah Ali and pay the [noise]\n\n\nWhat do you think of all this where you your guitars yeah tell us a little about how you got into being a the kind of guitar a paint brush that you are in the group praying for a few\nI guess so when I was like a teenager I got really into pulp fiction soundtrack and I want to do like ... ... so um I started like learning some of those songs and like figuring out scales and stuff like that and then I didn't really play guitar for like four years until I went to art school [noise]\nAnd then I bought this Jackie guitar Oakland\n[noise]\nYou know what I actually really like is Raymond God will see their size or guy\nLike that their main player that women wear a rough\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\nAnd listening to so many of his arms in the mood you create a ... and just the titles the draw you in your sleep talk going by dawn surrounded by goes um [noise] there's so much night spirit activity here or you moved by spirits and and the nocturnal\nWhy do you know what all tax syndrome is or are we ... yeah I have had that since I was a kid and then when she and the claims began that was like at the height of it\nEvery single night and I would have it and didn't feel and saying all day the next day from not sleeping comfortably and and it was making me paranoid and the day time\nSo I definitely just felt kind of haunted and it was also making to reflect on yeah he goes to experience it from my childhood and\nAnd um\nIt'll make their own\nThen they will log\nAnd on and\nYou or lone\nRant\nTrying to manage that in my\nEverything bad amazing\nA known as the middleman Neal when she may end\nUp paying ... ... and things that you're\nA ... they eat or they may pay you\nYou going to change a wall in on my hand out in the ...\nAnd you got ... most me mad\nAt me when I'm Alone Leno's fans by as\nBeing mail the day and night on bringing the\nGuy McCain ... pulling out my hair and ... ...\nFriend of mine and we'd go out on a rocky worrying all their arena in Spain back in ... I didn't mean\nIn three and a ... ... the real\nGuy McCain which brand you believe in the house when\nHorn town named Lana weaning my\nReally wet again and they don't loan mom get rain Janell going down the chain chain but now the amount that the\nNow the ball and the whole\n... went up by the whole world\nBy my God when a lot no way and if you came to me by\nGuy McCain picking out rain during the ... ...\n\nThen they grow\nTo\n... you know you're\nThe on the\nWay in a movie or you\n... years ago and then me [noise]\nI got mine jak the Green Bay looked\nThe the man\nLet me\nBe you know\nHe saw me no\nDing ding\nDing\nWe don't we [noise]\nWe don't know the main [noise]\nGrateful Dead from the will be working man's dead Nineteen Seventy Jerry Garcia on vocals and pedal steel guitar was a murderous jail the dire Wolff also some lighter lunar fair Hank Williams Allen at the moon Nineteen fifty one and for that the salacious\nBig bad wolf is played by staying the sham with these ferrets the pursuit of little red riding hood hit song from Nineteen sixty six years demand they called Howlin' Wolf just a brunette from white station Mississippi\nRight now we [noise] he was going on [noise]\nThat you know\nI don't [noise]\nHave you back Joanne [noise]\n\nListener supported the people the radio and Eighteen these in service of Georgia Public\nThe ... and this is American roots frumpy our ex public radio ...\nGet a listener supported G. P. B. radio and Eighteen stations service of Georgia Public broadcasting another hour of American roots next\nMinute then it's the international Americana radio show on G. P. B.\n\nPark here to like you know that the next edition of the international American a music show is going to be Halloween\nA whole lot of great spooky cells to fill a playlist that they mentioned ghost some some basic\nGreat joined me at the usual type for what will be filled edition of the international American\n\nFrom the University of west Georgia with Ninety ... W. W. J. N. W. W. A. G. H. G. Carroll quarter but Georgia Public broadcasting radio network\n[noise] I'm\nFrom New Orleans bitches American roots for Halloween Eighteen ... aiming to put a spell on you this hour\nWith music from Roseanne and Johnny Cash ... Dr John and professor\nLong and he\nWe'll get on the road with Miles Davis in Nineteen Seventy for bitches brew ... miles runs the boob tube down model American written\nThe time [laughter] [noise]\n[noise]\n\n\n\n\nAnd all\n[noise]\nAnd\nMan from\n\n\n\n\n[noise]\nEvery\nWinter number\n\nAnd\n\nShe\n\nShe\nThrew\n[noise]\n\n\n[laughter]\nOver\nNo not really my ...\nYears yeah now ... and grown\nAbout all the way we are you\nIs a\nUm\nThat are already we use a\nThe woman of color\n\nOn it house Lee are read by phone from his first held pee on the track Nineteen Seventy five earlier versions were done by Betsy Smith and later Loni Johnson I recall was a kid that old abandoned houses were often thought to be haunted mostly now haunted houses staged for Halloween\nThis came up in our conversation with Cody Blanchard Shannon the clams about trick or treating\nArizona house where there is a wolf man and you would knock on the door and he wouldn't answer and when you were about to leave you with like tear that door up in the bank costume and throw candy at you and then there was this woman who was always like a witchy fortune teller\nUm my dad one time and make a dad buried himself in the ground not really he laid down into covered himself the tarp and the dirt except for his head which like he put all his fake blood looked like a separate head and there was like uh\nReally he laid down in the covered him so for the tarp and the dirt except for his head which like he put all fake blood looked like a separate head\nAnd there was like a big ... I'm ... and then he would wait until kids went up to the house and then he would like yell at them and they would look around and they would like to see the head of the crowd shouted serious Halloween\nLose ...\nBoom\nBoom boom\nMy blonde room I heard a loud cry\nIran do that when I say my dad\nThe job I'm not saying [noise]\nWild about the little guy than my\nMy ... my plane and I know\nThey don't see what that meant was all about\nMy mother did not\nGet the well I'm I'm a fan of\nProbably in the news was on and how\nNow\nDo\nThey do I\nNot saying that all\n\nNews [noise] remember [noise]\nAnd you can tune into it [noise]\n[noise] [noise] [noise]\nI went and I thought it was a boy you all to the\nMe ask you a\nNew\nYoung my playing out later that\nAbout three and my ... year old [noise]\nAnd\n... the monster digitally song about our haunted house but it was very aware of the spirit world to the point where he wanted to be sure\nThat no one ever touched his hat we're back with ghostly songs as Mexican Ron chatter the ... the murder and forbidding love in country music damned cowboys and the guy\nAt phantom ... track when American roots return\nIt's just American roots with ghostly jails for several cultures\nThe story of like Iraq or the weeping woman for Mexican\nThis is American roots with ghostly jails from several cultures\nFirst the story of like your own or the weeping woman for Mexican it'd be a goes the grieving mother in law's children now vice while looking for them in the\nLaw you run a brings beer misfortune those who for reaching the ranchero law you're on the missing is to build up our\n...\nMental buddy Neal some big\nHoles sooner than men\nMade up tired email\nYou saw your own\nThe you\nLevel\nThey meet you at all\nOr ...\nThe list been throwing money your\nThat one about\nLaw and order by by again all they\nThe whole\n... or not\n\nKid or any of that yeah it is you know the\nTo get the the bird but he ... he called me up\nHer own luxury in show business guy enrolled horses\nHere there for a\nGlobe and do a ... glow\nYour in laws who sold who held era and then all the rage to launch the way they are worse\nAny uh\n[noise]\nA [noise]\n\nI was out on the west coast\nThings didn't work out\nCarter Roman\nSo I started coming back east\nMade a lot of miles of today's\nTopic it out to be home in a way it gives them a ... a lot this late\nNight I got stranded way out of town\nCross ... brainwashed Lauren down\nI was hungry in freezing done call it a CIO\nWhen the lights are low ... top the\nI sure was glad to hear them like come on\nStuck out his hand and said what the grand\n... you're always in a lot don't mind\nAnd he said the name of ... phantom\n... y ... such a name\nHe said son there so ... and put 'em all the shame a\nA ring around an any lie on\nLedge seen nothing ...\nBetter part of the night\nLet's see nothing ...\nBetter part of the night\nWhen the lights up stop came in ... [noise]\nHe said I'm Sorry son less as far as you go\nI got my turn\nThe top ... di ...\nSaid have yourself a hot\nWhen Joe and he's read lord out in the night\nNothing flat and he was pulling out of ...\nI Want to shot in order to be a ... a\nOlder whiter ... sent me up\nHow would I have ...\nHe said no all this happens\nRobbery in your nose big Joe\n... let me tell you what happened about ten years ago\nTonight where you flag being down\nAnd they were right in the middle when Joe the top of the hill\nBut he turned usually\nAnd giving me flyers save that much kids\nAnd like you think your ...\nYear have another job and forget about ...\nKeep it as a souvenir\nFound on the Rio\nLate read so by from Charleston West Virginia with the tail of a truck driver gave his life to save children in a school bus phantom three oh nine before that Johnny Cash his version of ghost writers and the guy said to be cowboys damn to chase the devils herd of cattle\n... turn to the we have time for a few more dreams for Halloween Eighteen with Randy Newman Dr John and professor long hair when American roots return\nAnd professor long hair when American boots return\n\n\n\n[noise]\n\n\n[noise]\n\nMm [noise] yeah\nThis is American roots in New Orleans where dreams gates are plentiful both day and night so I make a Randy Newman spent time here's a child in the waiting years of World War two and it's written songs about those memories but this one is about a dreamy first had last night in Nineteen Seventy Nineteen Seventy two\nAnd finally we recorded for Randy Newman song ... a few years back\nWant to know\nOh no no no I\nIn ...\nOne name\nOne ... ...\nYeah you're right there on may ... a news\nMary ...\nBack", "show_name": "American Routes", "year": "2018", "city": "Carrollton", "day": "28"}