{"month": "10", "state": "GA", "station": "WUWG", "content": "\nYou're listening to the BBC Radio and Eighteen station service of Georgia Public broadcasting thank you so much for tuning in the evening American route to next bungee beeping [noise]\n\nWhen a light tanks in the balance what does beyond a reasonable doubt really mean\nAnything on John them on my mind the ...\nG. P. B. present the radio play beyond reasonable doubt the Troy Davis project by Atlanta play right we know the story follows the death penalty case of Troy Davis joined us at ten am on Sunday October twenty first start G. P. B. radio\n\nFrom the University of west Georgia because Ninety point seven FM Wu WG aimed W W\nG. H. G. Carroll that part of Georgia Public broadcasting radio network\nI just American rumors from New Orleans\nTwenty ... twenty Seventeen we're on one of our grain hear a song makers singer and being a man entwined fats domino\nReal Buddha New Orleans music with his honey going ... miles helped make rhythm and blues with the Gulf Coast\nFirst recording nearly seven decades ago in Nineteen forty nine lined the arc musical Jeannie\nMan was based on John ... blues talking about street wine dealer\nFascinated about watching real girl\nDominant a rare interview from our\nAs an inventor early rock and roll\nFats domino set the stage for black artists\nBreaking into the mainstream\nAs an inventor early rock and roll\nThem and it was that the stage for black guarded breaking into the mainstream\nHere's a man really going on and\nDid away with ... or ... or\nWe'll be on the march with the man who sold a hundred\n\n\n\nLet me well you're paying ...\nKnow\nAre there ready or my ... great American\nWay that\n\nUh\n\n\nThis is American roots following how rhythm and blues became rock and roll as black and white audience is desegregated concerts after hearing their favorite artists on records and the radio\nA few shows go we played milk cow blues popular song in Texas western swing music that lead us back to a delta blues version by Robert Johnson from ... Mississippi here's an artist from Mississippi to ... which is Nineteen fifty five breakout I'm set records\n... will go to the moon I looked in to do I keep a little knew she didn't Lulu\nFellows don't move me get re real ... change [noise]\n[noise]\n[noise]\nOh God given the level of maturity about ... ...\nEmail to poke fun at the gym and then you go on and my mom\nWould have been to one you just want to know how to read to run and he came back into your mum about your New Year's brain going on\nIn the barn burners you turned into the third one they don't want to be able to smoke wherever you\nAre modest living on their own learned\nLot more money than\nWe do not go to\nThe show or good or bad you know that all of them alone you know\nAll these nine or ... minutes or ... or ... when they're you know what would you know the president I don't want to do\nWith my girlfriend Everytime you will know who to the bottom of the comedy is a little more than\nThey would be one of the building barricades around in the winter time a new building the business lobby or medium it in the middle\n... ...\n\nTo go to know\nTo me there's oh\nThe mid\n...\n...\n\nAnd\n\nThe\nCare you know put\n\nA lot but they were going on they may look like me a little dogs ...\nIn the spring when\nThey learn that no one they may want to lend me a little dog ... and\nThen they lose\nBorder in this modern\n[noise]\nNow in Iraq you know being\nIn my car going to stay on their on\nRocket eighty eight was shortage in Memphis son record Nineteen fifty one and distributed by chess records to Chicago the credits the singer saxophone as Jackie bread and the delta cats\nThe sun records Nineteen fifty one and distributed by chess records in Chicago the credit the singer and saxophone as Jackie Princeton and his delta cats band was actually I turned around piano and his kings of rhythm\nThe famous but guitar which to my broken and used by Willie Kaiser I call these classic car romance songs auto erotic much love for the latest automobile technology\nThe Oldsmobile ADA before that mystery train their little junior Parker and the blue flames recorded Nineteen fifty three two years before Elvis's version\nTrains in cars are relatively new technology to the human journey\n[noise]\nWhat about old technology\nIn music the one string you're really both stretched on a board or the side of the house made it screened or wire coat hanger I played with the bottom or beef bones slide Moses Williams to eat it being in Mississippi to give the sense of blue string origins from West African sources [noise]\nUh I'm a law law milder\nThis is American roots\nGarbage Billy Boy Arnold ... Williams Chicago's down the line\nOf credit gee we're going our Monica local street corner with Ellen McDaniel\nAnd the neighbors ... Williams Chicago's down in\nCut his team are Monica I'm looking straight up ... McDaniel also known as ...\nThey recorded the Nineteen fifty by then I'm a man the project director Billy Boy also recorded original got you and I wish you would\nHave remained active in Chicago's minor the city's electric blues\nBoy Arnold spoke to us backstage at the twenty Seventeen ponderosa's down\nName is Billy Boy are no\nI'm from Chicago Illinois\nI really started using ... about five years old\nAnd he says listen to the old blues some\nRelatives played\nAnd I was the only kid\nLike blue that made the country\nI discovered that music is Sonny Boy when\nFascinated to found he got on the Monica\nGoing to\nGo home\nGo home [noise]\nNah you been doing much then your son in law that they know\nA hard time power as the\nStore I found out that he lived in the neighborhood\nTwo doors\nLocked butcher shop\nGot his address and went to the house\nOf cards and then other friends all twelve year old kid ruined the dough bell\nA well dressed man came to do what\nYou say can I help you out I say we only see Sonny Boy to say this is Sonny Boy I say we want to hear plenty I'm Monica\nSaid come on up I'm proud to have you all\nAnd um I'd say Sonny Boy how do you make the among I could say wow wow wow\n\n\nOf those labels you had to have your own Salinger all material\nAnd and that's how you start start writing stones when I was about fourteen Fifteen and then I met both just like you\nAnd play on the street corners where they're bailing\nOut when I was a little boy\nYou know\nWe can now a lot of them on a\nOf it and you know when\nHim out and in history\nThe ball a little short guy strong\nAnd he was the media at the Indiana the forty third and then\nI just couldn't stop ...\nKnow I took him to chess records\nField chance came out of the back room\nFor recognizing their\nMy brother and I think it is\nIt like what are you heard so he was head of the bull by the damn\nI say I'm On my brother and I think it is\nForty so he was dead by the bull by the damned\nPenn right I don't care about what we did like that but we did you get arrested in it and\nWent to beat you up I was busy Monica\nUp and I said I had a so called duty duty dumped on say what changed a worry on\nTerms on the road I Wish you good\nTown and I'm On about the\nBrain the day\nBaby when\nThey're in pain won't do it in her bag baby out for a while\nYou may not have a lot more with ms change when no one will get in kids in late at night baby haven't been able to\nHer hair crafted in Yonkers\nDay the boy can cause a lot of time when you were recalled pause ball label\nThey didn't have to destroy your chest right because then the J Records were all over the world\n[noise]\n\n\nWe call the down home got stuck in the back in the day here in the club and the black could say take me down and the base\nPlayed some really low down\nOne like you've got to change that deal suppose I reach out say\nOh say when he was nine years old\nThe hot water\nBe\nResponse\nPlayed internationally all over the world\nFirst ever sat down by the king both get about a year later\nAfter months after the deadly Chuck Berry made me moving a couple of months after\nRichard made on top salary goes poor man did away with segregation white kids heard those guys\nAnd they want to know why does this music comes from\nNow you go to China Russia to anywhere in the world I Want to say no ballot Danny Boy on it was a black bottom buildings that does not bring the\nI was about a time\nDonald body that the same\nNot all but\nA listener supported G. P. B. radio and eight teams these in service of Georgia Public\nAmerican roots for beer Iraq's public radio exchange\nListener supported G. P. B. radio and Eighteen station service of Georgia Public broadcasting another hour of American ruined ... minute then in the international Americana radio show on gp ...\nCare to tell you the next edition of the international Americana music show but you're going to be deemed edition of the program because I take a break from featuring new songs and I play some of my favorite old songs tracks from his are back in the sixties seventies and eighties in terms of the century as well to join me with the usual kind\nCost should be classic edition of the international American music show\n\nFrom the University of west Georgia because Ninety point seven FM W. W. J. N. W. W. A. G. H. G. Carroll that part of Georgia Public broadcasting radio network\n[noise]\nList as American roots where we'll listen back to Nineteen fifties rock and roll sound that combined rhythm and blues country music and gospel roots rock was bleeding buried getting conscience by Elvis shutting burying Carl Perkins the Everly Brothers and bode did all the\nAll of whom will years this hour [noise]\n\nRock and roll also inspired British artist from the Beatles stones to van Mars and how about\nAlbert leave [noise] so now and has written Seventy is viewed among the greatest living rock and roll ... [noise]\nLike many aimless teens reimpose worrying when our found himself deeply look into American rockers that led to the British musical invasion into\nEl waited on us I mean for the movies and some of the T. V. shows watching you know he was exciting for us then you know there's driving the heat and the preschool recordings [noise]\nThat does seem to go to John [noise] Albert\nLeave from working class freaked a telecast are master living in Malibu following his late ... on both sides of the bond on American roots [noise]\nUh\nOr in your lead let's rock on both sides of the bond bond American route\nThey don't know about you know\nMe away and remember\nThe\nAny time\nSee if we want to ban\nOnly you know I\nMarry a man or the\nHell are you\nSeeing some of them\nIran or we have\nYou on that I didn't know\nIran and then\nI thought I'm going over ...\nThere in a way that\nThey were going back I\nAnd a new way to\nYou've been\nWhere you're wrong or\nYou own or they may\nHave you on that then by\nThe way down south to\nIt ran on Apollo and he\nPulled\nOut of the raw in\nOrleans to\nMe you get to\nThe you're on the road\nThat air over that way\nIn\nThe middle\nTime you were in the business\nHe knew a\nYou own I may I\nLawyer and I was the baby mama rock band ... brain Iran Iran\nIran Iran model\nI've been rock and roll and our long dying I understand it all up to rock and roll in Europe\nBeen up into a long time on the up the rock and roll\nUsed to have a baby and going you know it was her name or in order to you know\nWe are going to begin with Joe ...\nAbout the law and toning has been done though it's been long NATO\nRuled by the same\nI\nBeen rock and roll into a long time I end up in a rock and roll\nOut of my music but\nDon't mind them to go\nGod I have not usually God\nAnd a jump when going to do both I mean\nI wasn't Iraq and roll\nWith a dog\nAnd the la\n\nLa will end of the name of ...\nWhat do you live in a\nLong long time\n\nFor a long long time\n\nMixed up\nWe used\nMean y'all must be [noise] don't care what you\nThe next day\nThey have done well\nWhat we do\nMake\nAnd the ... in the\nAnd\nThey mix Jones will be\nA little Walter the late Chicago blues ... player for mark bill Louisiana crazy mixed up we're\nTalking about how he loves the rock and roll from Nineteen fifty nine before rock and roll was distinct from rhythm and blues you up and other spouse\nBefore that Bob wheels and the Texas Playboy's Nineteen fifty six so let's rock even a western swing ban could do it there with a lead singer Lee Roth is a disc jockey from Long Beach California\nAnd we started with the ultimate crossover guitar anthem Chuck berry's rock 'n' roll music from fall fifty seven the Beatles covered\nFrom Long Beach California and we started with the ultimate crossover guitar and some Chuck berry's rock 'n' roll music from fall fifty seven the beetle covered rock and roll music in Nineteen sixty four here's the original of another song covered by the Beatles\nAnd end up being broken and I do have to do and American roots\nFor Nike forty one\nMorning blues on American return\n\nNews [noise]\nZone in love you and you\nWhat I mean how are you [noise]\nKnow dying from\nThe other [noise]\nMay or may\nNot know none\nOf my bed\nMay not be\nWhen he met with no grand [noise]\nWalking\nThe road\nI don't know what they [noise]\n\nI'm doing [noise]\nHey baby you're traveling on American troops from New Orleans New\nAt it is a story about the ...\n... he runs down in the New Orleans\nAnd your dad died of New Orleans and they don't get\nYou know trained they go through the dog ate why they demand the money to\nGo see if you got certain things on boats you okay you don't have to pay him enough\nNow we did change coming down the line and wish you go there to do a great job but he can down the mandate they\nGot ... I got to vote in a ...\nA guy she oh God oh lives ...\nIs a well your I boy did you know they don't pay me no\nEnd to try and go through and when you go through to do again to try and get a little bit steam or any of the business the\nWay to draw the they the owner died back down the line and ... and he did on but\nThe gun about the gun\nYou're not tell you well know loyal and down and I got it I mean\nAnd I ... I\nOn the night before I got a nine year\n\nThe moon is\nBook\nEnough now less na\nNa na those are all on the I'm\nHe made in the gum\nBe let me know\nMe they may not\nBe\nBut not on the you know look\nTheir own or do\nPrevent a mild but not the\nOnly\nMay be na\nNa na\nNa na\nNa na na meeting last\nThey were\nNo no\n\nAnd\nThey\nThey oh man\nI'm\nPretty\nNice bachelor was paying more than ... down again and Chris Barber live in Belfast Nineteen Ninety eight\nLooking back on the Schiphol era of their you with the prison song they heard from Lead Belly midnight special training was light might change in the cell of the incarcerated in pre stage their release plenty done again before that on his own would lead bellies Rock Island ... and other trains sun with a sense of escape\nWe've been hearing guitar singers and styles and blues country Schiphol and rock and roll but influenced British rock guitarist Albert lea or upcoming gas here a few Albert's picks including Scotty more solar with Elvis\nAnd James Burton Ricky Nelson but let's kick it off the buddy Holly and the cricket Nineteen fifty nine re by\nMean I'm really\n\n\n[noise]\n\nTo spend most of them went to modify your\nI don't know if I really thought that I was going to make a career out of it but I had no qualifications for anything else\nAn incredible era anywhere but actually I think\nI'm I was with cruise father for four years that was\n\n\nOr to clubs in the west end of London it was great for mango club which is kind of arm the tender jazz price\nSo I played a ... and they were a lot\nDown there John McLaughlin stay on their playing with an hour and the band Danny summonses language and my role than\n\nWhat did you see when you thought about the U.S oh well we love the U.S coming from the movies and uh some of the TV shows we watching you know I never dreamed I'd end up living there but\nTo see was early in the sixties when I met the after your brothers and their band you know it was just so glad that we're in a lot of people in ... uh we finished asset and there were a couple of guys standing by the\nBy the wall listening intently and they came up and said oh yeah we love the music and they were American is oh oh you do all thank you yeah\nI don't know where we hear on to a to\nCentral or who you're with I said what would you have a brother who's on the coast my George or up to you know and uh I guess it was a John ... to say that again you know you should come to LA you know we'll watch\nThose great guitar players over there and you said\nYou try to really will you do well that this was Romney sixty two\nThere wasn't until about nine to sit and do the ...\n\n\nAh the\nGators uh two years\nOld friends of mine that I had a ... for a while they said well what we're going to do an album and they\nI was there as a as a session guy\nWe saw we capital any place that is a pretty big deal for\nTree linked to the states you know\nWhat was the band you know being cold had has been straight\n\nMe about some of your favorites on the Laker\nCourse luxury liner where they knew the Harris who was one in particular to introduce me to\nAmerican country market yeah\nOr so who who's his guitar player because everybody's so we James but and you know groups but I took over from James in that in that band you know\nThat that was a turning point for me because I realized at that point [noise] I'm now living in America [noise]\n\n\n\n\n\n\n[noise]\n\n\n\nI hadn't really thought about it before I say you know it's just a it's nice to be appreciated in\nDemand for so long you know I've never really been a big star with ... with a lot of well known people but\nI always look to myself as a gigging guitar player\nWhat would you like to do now where do you see is the current\nDirection for you know a lot to carry on doing what I'm doing but um earn more money and\nDo less gigs and rural aiming for you know", "year": "2018", "show_name": "American Routes", "city": "Carrollton", "day": "21"}