{"month": "10", "state": "PA", "station": "WVYA", "content": "Support comes from a while for say October national seafood my meal plan that includes fishes heart healthy one while for salmon specializes in Alaska sockeye salmon but carries a wide variety of other fish and shellfish find salmon and more wild for salmon dot com\n[noise]\nThis is music ever seen any and I thought I'd ease into the morning before we get into the classical music segment [noise] this is a piece that does have a very spirited opening but it is cold maybe you're still in bed and maybe you're getting the news alarm\nPlease get up to the music is about to begin right after the news from National Public radio gloves without the championship but also on the plane is [noise]\nThis is W. V. I. eighty nine point nine up him W. V. I. H. D. one Scranton Wilkes Barre Hazelden W. B. Y. I. eighty nine point seven EPA Williamsport WG audio eighty eight point three of them ... Mansfield WPRI you Ninety One point five FM Palmyra township\nAnd that's what how to universities W que su eighty eight point not F ... grove we have a translator in Lewis ...\nOne hundred point one your arts and information station listener supported public radio W. V. I. A. F. them\nOn the next fresh air growing up with an absent mother who is addicted to heroin and raised by grandparents who gain legal custody like how could Jared J. ... about his new graphic memoir for young adults hate kiddo how I lost my mother found my father and dealt with family addiction\nIt's nominated for a National Book award he also at the lunch ladies series China [noise]\nEvening at six after all things considered on WB I Am [noise]\n\nLive from NPR News in Washington I'm horrible Coleman the official death toll from last week's hurricane Michael is Seventeen people but as NPR's Quil Lawrence reports the number of missing is believed to be much higher\nHundreds of people who said they were going to ride out the storm may have actually fled inland as the warnings suddenly got worse last week and since then cell phone service and access to Internet has been so bad that family members haven't been able to reconnect if you do have a signal calling someone within the storm's path sounds like this\n\nThat particular busy signal was from the police department and the town of Mexico beach replace you might normally ask about whether someone has been reported missing were found not to have survived\nAt cell phone towers or repaired and electricity is restore the number of people reported missing and feared dead is expected to rise Quil Lawrence NPR News Miramar Beach Florida\nTurkish and Saudi investigators searched the Saudi Arabian consulate in Istanbul Monday Night collecting samples for examination NPR's Peter Kenyon reports pressure is growing for an explanation of the disappearance of ...\nIt's been blue Monday night collecting samples for examination NPR's Peter Kenyon reports pressure is growing for an explanation of the disappearance of journalists to enter the conflict on October second\nNearly two weeks after journalist and government critic ... disappeared after entering the consulate Turkish investigators searched the premises along with Saudi investigators\nThe journalists family issued a statement calling for an independent international investigation President Trump's mention of rogue killers possibly being involved prompted analysts wonder if an effort is under way to insulate Saudi crown prince Mohammed bin Salman from the controversy\nMultiple US News outlets report the Saudis are considering a new explanation that showed you died accidentally well being questioned\nTurkish investigators have said they have evidence he was murdered Peter Kenyon NPR News Istanbul\nMeanwhile secretary of state Mike Pompeo is in Riyadh Saudi Arabia and has met the Saudi king about Chris sugars each case the Saudi king has insisted he has no knowledge of the journalists faint\nA federal judge dismissed the lawsuit against President Trump by adult film actress Stormy Daniels as NPR's Jessica Taylor reports Daniels claimed the president ... earlier this year on Twitter\nDino sued over its week Trump sent in April ... with lying about being threatened in twenty eleven not to go public with her story of an alleged sexual encounter with Trump which the president has denied but in his ruling the federal judge wrote that the tweet constitutes rhetorical hyperbole normally associated with politics and public discourse in the U.S that is protected by the first amendment\nNPR's Jessica tailor the judges ordering Daniels to pay the president's attorneys' fees the co founder of Microsoft Paul Allen has died his company Vulcan Inc says he died Monday in Seattle of non Hodgkin's lymphoma he was sixty five\nAlan was also a philanthropist tech investor and owner of several sports teams such as the Seattle Seahawks and Portland TrailBlazers\nYou're listening to NPR News\nThe second largest health insurance company in the U.S is going to pay sixteen million dollars to settle a privacy case with the federal government anthem incorporated disclosed in twenty Fifteen that the personal information of nearly Seventy nine million people was exposed during a cyber attack\nThat includes names Social Security numbers and medical I deans [noise]\nIn a cabinet reshuffle French President Emmanuel Macron has put a loyal ally in the sensitive position of interior minister NPR's Eleanor Beardsley reports the former interior minister resigned two weeks ago\nMy call has named the head of his political party Christopher Guest and there are these new interior minister the move is seen as rewarding a close ally while keeping someone he trusts in a critical portfolio the cabinet reshuffle as an attempt to steady the administration after a series of high profile resignation\nNot called environment and interior ministers have both resigned in the last two months\nThe president's popularity has also at an all time low Macron has been trying to improve its image lately by moving closer to people he visited hurricane victims and the French and tallies and has recently been plunging into crowds to shake hands and kiss babies Eleanor Beardsley NPR News Paris\nThe Ethiopian prime minister has reshuffle his cabinet to women ministers now Phil half of the seats in prime minister obese amends new cabinet that includes Ethiopia's first female defense minister Ayesha Mohammed\nMoves or a second woman will have the new ministry of peace former house speaker ... camel I'm corporate Coleman NPR News\nFor NPR comes from gobble a meal care company that delivers semi perhaps meals to be finished at home and Fifteen\n\nSupport for NPR comes from ... a meal kid companies that delivers semi ... meals to be finished at home in Fifteen minutes with one pair gobbled Suchet do the prep work like chopping marinating this week's menu is at ... dot com slash NPR and Americans for the arts\n\nGood morning here's the weather forecast for the W. B. I. A. listening area\nSome Sunday ... the temperatures are going to be around fifty three degrees at best clear tonight then becoming cloudy with loads near thirty eight into third Wednesday will be some sun with a chance of showers by afternoon with temperatures near fifty to the chance of rain it's forty percent cloudy on Wednesday night with loads near thirty three\nBy Thursday mostly sunny with temperatures near forty two by friday sunshine with temperatures near fifty six looking into the weekend a cloudy Saturday ended fifty percent chance of rain with temperatures near fifty five\nSunday looks mostly sunny with hides near forty eight and Monday mostly sunny and temperatures near forty seven it's thirty nine degrees at the Wilkes Barre Scranton international airport\nAnd it's nine owed seven at W. V. I asked him your arts and information station\n[noise]\nTo Williamsport simply by ... it'll Stein opens October sixteenth was works by Racine each ... and Brian\nGrammy nominated and chart topping violinist Caroline Golding plays Chuck ... violin concerto [noise]\nWilliamsport symphony October sixteenth that the community arts at her five seven zero three to six twenty four twenty four or ... symphony dot org\nSponsors who'd on Capitol group at my come in college\nI'm Christie early host of live from here [noise]\nYou know they say this country is more divided than ever but there's one thing we can all agree on the people just a little bit Madeline oldfield joined us for a glorious evening a musical comedy that just might bring us a little closer together during the Saturday for a live broadcast from a Fitzgerald Theater in Saint Paul Minnesota with the game for ...\nThe one treaty Mr Gabriel ... [noise]\nSaturday Night at six Sunday night at eight on W. V. I. A. F. N. [noise]\nOh very good morning to you this is Lisa ... glad to be with you on this Tuesday the sixteenth of October twenty Eighteen and boy it's cold out there today honestly uh thirty nine degrees right now our temperatures are definitely dipping into the fall\nAnd that means that the leaves are going to be changing colors soon so it would be a good good weekend to get out and enjoy and get some fresh air and see the colors happening in northeastern Pennsylvania\nUh we have some great music happening musical color on our airwaves today we have some a musical the musical timeline is is stretched today we have music from the\nUh baroque era we have music from the romantic period but we were going to beginning with a piece by domestic what you might also from one of his piece is called ... ...\n... but also wrote a lot of pieces like that and do we have a series of his of his overtures today the Toronto chamber orchestra performs under the direction of Kevin melon on WB I\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\nMm [noise] Mm [noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\nMm [noise]\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\nAnd the wonderful sense of mystery and the ... the music you suck tea on WBAL hey the Montreal symphony orchestra performed on your arts and information station\nIt's chilly out there oh my goodness this morning a you sound a little bit of a blog on the windows definitely had to wear the jacket today but we will see temperatures around oh gosh maybe fifty three degrees at best a nighttime though we're going to be the temperatures dipping into the thirties even the lower thirties\nAnd the optimum optimal leave looking whether this weekend because the temperatures nice a Christian in the forties maybe fifty degrees and so the color should start to have that it is thirty nine degrees and the sun is coming out at the Wilkes Barre Scranton international airport\nI'll just the music scene eat a double duty I and we had used the G taking us on the journey with the sun all the numbers takes on your arts and information station the strings to know the indeed\n[noise]\n\n\nLovely music of growth Seaney and the strings sonata number six in the ... D that was meant by members of the music she performing for you on WB\nI asked them what\nPercent of the food in American supermarkets you actually think his\nSuit the definition of food is something that sustains nurses and nourishment is something that increases your health so forty percent of the stuff that Americans markets wouldn't qualify as food like\nForty percent wouldn't qualify sued right\nHow we connect with our food that's sick time Ted radio hour from NPR\nSaturday new no W beyond a about that is both scary and interesting I'll be tuning in to listen to that the Ted radio hour here on WB on a\nProgramming on WB I I just made possible by our members and by Pennsylvania College of technology inviting you to the limits of modern warfare stalemate technology and the sounds so front and the first World War presented by Dr John deck\nDuring the next edition of the technology and society ... series open to the public at seven PM Thursday November right in the club academic center auditorium at Penn college more information is available at P. C. T. dot E. D.\nBut to the public at seven PM Thursday November right in the clump academic center auditorium at Penn call more information is available at P. C. T. dot edu slash cook with\nMore happening with the kindred spirits arts program they promised you a full year of music and we just had an opportunity to hear Caroline Golding or doing her retro pre says for the for violin a last week or coming up on November or if it's the Englewood angle wins ensemble\nAnd the program has selections by Chopin and ... ... and much more the performance will be held at the milk for theatre and if you'd like to secure some tickets for the November fourth performance at seven thirty you can contact kindred spirits arts dot org for more details\nOn to some musical beyond Sebastian Bach because we take a leap back on the musical timeline and the baroque era today we hear used loop concerto in the major B. W. B. ten thirty to James goalie joining members of the work and Bert chamber orchestra on WB I\n\n\n\nStreaming live at W. V. I. A. dot org we have a translator in Clark summit at ... three of them you're arts and information station listener supported public radio W. V. I. S.\n[noise]\nSan Francisco op represents routine ease the barber of Seville delightful combination is kind of clever and the cartoon characters\nBrought to life with the cash story Lou gives me chills Danielle I'm Out in ... to ... conduct the barber of Seville from San Francisco opera on this station [noise]\nSaturday afternoon at one on W. V. I. A. F. [noise]\nW. vi public media presents [noise] Pennsylvania decisions Watergate team\nThe Pennsylvania ninth congressional district debate\nRepublican congressional candidate John user and democratic congressional candidate Danny ... discuss the issues in front of tunnel it analyze the audience\nKnows the Kennedys before you vote the Pennsylvania ninth congressional district debate [noise]\nJew starting October thirtieth at seven on WB I [noise]\nSupport for WBAI comes from a zone or art center for sending me do you feel harmonic performing a program a romantic master works perfectly suited for the season\nEnjoy Robert ... heartwarming symphony number for a dazzling sweet from these days opera Carmen\nAnd saw songs Halloween concert favorite ... featuring a diabolical charming concert master solo by professor Michael Jordan's friday and Saturday October Nineteen twenty or thirty pm for tickets six one zero seven oh you ... or older Arts Center dot org\nFrom NPR News in Washington I'm core of a cold and hurricane cleanup continues along the Florida Panhandle the death toll across several states remains at Seventeen people but\nDozens of other people are still missing\nCain cleanup continues along the Florida Panhandle the death toll across several states remains at Seventeen people but dozens of other people are still missing and rescue teams and loved ones are continuing to search for them and beer is on the low long reports tens of thousands of homes are still without\nPower utility companies are scrambling to repair downed power lines across the region Florida governor Rick Scott has been sending extra crew to help my clearing debris from roads officials are warning residents avoid touching downed wires run Florida's panhandle hundreds of families now without homes are continuing to shelter in schools and community centers\nHundreds of National Guard members from Florida and other states are helping to lead search and rescue efforts and bingo counties to various hit hardest by hurricane Michael ... NPR News Destin, Florida\nSecretary of state Mike Pompeo is in Riyadh Saudi Arabia he's met king some on to discuss the case of missing Saudi journalist come out of touch or good shape Turkey's government believed he was murdered inside of Saudi consulate in Istanbul NPR's Michel ... is traveling with secretary in Riyadh\nState Department spokesperson said that determining what happened to your show gears of great importance to this administration they want to sit down face to face and in here um their side of events before rushing to judgment about anything um and you'll remember that the president himself has\nBeen very hesitant to to speak out too strongly about the Saudis also he says that you know he doesn't want to upset lucrative arms deals with the Saudis NPR's\nMichel ... in Riyadh news reports have indicated that Saudi Government is considering saying that could show because she died during an interrogation gone bad\nNPR has not confirmed those reports talks remain stalled over the United kingdom's exit from the European Union known as ... that there is fresh speculation UK and ... negotiators cannot reach of Brexit deal ... reports from Brussels a key meeting is set for tomorrow\nEuropean Council president Donald to sum it into teaching letter to eat you leaders\nWarned them to prepare for a no deal scenario that use your status of the border between a member Ireland and Britain Northern Ireland remains the biggest sticking point do you prefer eating Northern Ireland in customs union to avoid setting up checkpoints feared to block traffic and trade but Britain breakfast miniature Martin calling in and sit\nAny customs arrangement involving continued you regulation would only be temporary\nWe love allowed you to take was on the area\nTalented stilts as Britain does want a deal Latvian foreign minister at gushing cabbage puts the odds of that at just ... fifty for NPR News I'm Teri Schultz in Brussels\nOn Wall street stocks are all up sharply the down as some ... five hundred and ... indices are all up more than one percent this is NPR\nA federal judge has dismissed the lawsuit against President Trump filed by adult film actress Stormy Daniels she'd claimed Trump to fainter on Twitter when he claimed she was lying about being threatened over an allegation Daniel has alleged she had an affair with Trump an allegation Trump denied\nDaniel has a separate lawsuits pending that is over a non disclosure agreement Daniels signed regarding her story of the alleged affair that lawsuit will proceed\nA member of the Idaho fish and game commission has resigned after a photo of him posing with hunting trophies on a trip to Africa drew international criticism Matt and Gillum of Boise State public radio reports one image drew particular fire\nIn that picture like Fisher is propping up three dead baboon to the smaller juvenile pleased with mothers while the animals were killed with a bow well Fisher and his wife were traveling in the ...\nYou're like Fisher is propping up three dead ... with the smaller juvenile pleased with mother's lap the animals were killed with a bow well Fisher and his wife were traveling in Namibia the photo drew of eleven hundred emails and three hundred phone calls to Idaho Governor Bush authors office who returned from out of state business early to deal with the fires dorms rounding Fisher\nThe governor accepted vicious resignation Monday in a written statement Autor says he has high expectations for every person who points to serve and big government and he says they're expected to use good judgment\nOrder ... Fisher did not in addition to the Bab moons Fisher and his wife killed several varieties of antelope a leopard award hog and address while in Africa for NPR News I'm ... I'm In Boise\nThe drawing for the mega millions lottery will be tonight the prize is currently valued at six hundred fifty for a million dollars the Associated Press estimates your chances of winning that are about one in three hundred million this is NPR\nSupport for NPR comes from the alliance for lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for a lifetime income dot org\nA record number of openly el GB GQ candidates are on the ballot this November what we're doing\nI think is bigger than we realize oftentimes impact we're having on young people is more significant deeper than we can conceive\nI'm Ari Shapiro around table of algae BP cue candidate plus the secretary of state visit to Saudi Arabia this afternoon on all things considered from NPR News [noise]\nTo join us later today for all things considered on W. V. I asked them\nIn our weather forecast we'll see the sun with temperatures near fifty three degrees clouds tonight with loads near thirty seven sunny into Wednesday with a chance of an afternoon shower with temperatures new fifty to a chance of rain is forty percent\nCloudy Wednesday night with temperatures nearing thirty three by Thursday some sun with hide only near forty four\nThursday night looks clear with temperatures once again you're thirty four degrees Sunday on friday with ... near fifty six and the weekend cloudy on Saturday I fifty percent chance of rain with temperatures named fifty five\nSunday mostly sunny with ... near forty eight Monday mostly sunny with temperatures they're forty seven forty one right now at the Wilkes Barre Scranton international airport and it's ten oh seven at W. V. I asked them\nSupport comes from the greater hazel in concert series provided professional performances to northeast Pennsylvania featuring musical starlings of maybe Barnett the company man and the seller dwellers this year season fashion membership information available at his house in concert series dot org\nGood morning and welcome to classical music on WB I I'm a I'm Lisa ... glad to be with you eat is Tuesday the sixteenth of October ... Eighteen\nAnd I hope your morning is moving along well despite a being a little on the chilly side I Hope that things are warming up with some classical music and the tasks at hand or getting all that are getting accomplished a little bit easier with some lovely music in the background to kind of guide you along\nWere guiding you along and the ten o'clock hour with some almost ballet music send a ballet on WB I asked them we have to music of Alexander gloves and all of the three members of the Minnesota Orchestra under the direction of eight or ... on your arts and information station\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\nNah nah\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise] [noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\n\n\n\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [laughter] [noise]\n[noise] [noise]\n[noise]\n\n\n[noise] [noise]\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n[noise] [noise]\nMm\n\n[noise]\n\n[noise]\n\n[noise]\nMm\nMm\n[noise] [noise]\n[noise]\n[noise] [noise] no no no no\n\nNa na na na na na\n\n\n\n\n\n\n\n\nNa na na na\nNa na na na\nNa na na\n\nWe're [noise] we're very good [noise] [noise]\n[laughter] [noise] [laughter]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise] [noise]\n[laughter]\n[noise]\n\nOh just one piece of music music and gay or chat ski and a piece I have not heard in a long time his party's number find in ... um Monday classical performing for you on double ...\nProgramming on WSBIU has made possible by our numbers we thank you for your support numbers and my dancing ... productions presenting solo piano George Winston performing at the center in wealth borough to stay October sixteen more information a ticket to George ...\nIn a weather forecast we had sun today but it is chili Hi Shelley be around fifty three degrees right now forty one degrees and the Wilkes Barre Scranton international airport\nWill have a full whether rundown after the news from National Public radio and Lebanon o'clock after which Erica funky bringing you just said the dishing up art scene on WB I Am more fine classical music", "show_name": "Classical Music with Lisa Mazzarella", "year": "2018", "city": "Williamsport", "day": "16"}