{"month": "10", "state": "PA", "station": "WVYA", "content": "Second generation chef and owner ... sources ingredients from over thirty local producers to create and serve dinner Wednesday through Saturday menu and information at her house dot com\nJoined us for a celebration of the one hundredth anniversary of the birth of Leonard Bernstein's\nOctober fourteenth the three Jerry and burn it it goes with which we don't\nResent a program that includes excerpts from his H works in the west Side Story as well as early as ... ... these are likely to enjoy this concert so don't atheist make reservations\nOr more by phone five seven zero six five five to\nThis was W. V. I. eighty nine point nine of em W. V. I. H. D. once granted Wilkes Barre hidden ... point seven Williamsport WTO eighty eight points ... Mansfield WPRI you Ninety One point five and ... and ... how to universities W. S. U. eighty eight point on FM Stevens\nGrove we have a translator in ... three point five where your arts and information station listener supported public radio W. V. I. A.\nOn the next fresh air camera Jenkins tax about writing and directing her new movie private life staring Catherine hunt and pulled your body as a couple in their forties trying to have a baby do any means necessary adoption IDS egg donor\nLying than the turtle a my old egg joined us\nThis evening at six after all things considered on W. V. I. A. F. M.\n\nLine from NPR News in Washington ... Coleman at a political rally in Mississippi last night President Trump mocked the research psychology professor who was accusing Supreme Court nominee Brett Kavanaugh\nSexually assaulting her when they were in high school NPR's Miles parks reports the crowd laughed and cheered when Trump pretended to act out Christine Blasey Ford's testimony\nChristine Blasey Ford said last week that you can remember that she had only one beer the nights you Supreme Court nominee Brett Kavanaugh assaulted her President Trump seized on that fact at a rally in South even Mississippi know what I mean she couldn't remember other details Trump acted out both sides of Ford's congressional testimony to last and applause from the crowd\nHow did you get home I don't remember how did you get there I don't remember where is the place I don't remember how many years ago was that I don't know [noise] after\nFour testified last week however Trump called or a quote very credible witness the president also said Tuesday that it's a very scary time for young men in America Miles Parks NPR News\nAnd attorney representing for describes the president's comments last night as vicious and vile meanwhile\nIt's NPR news and attorney representing for describes the president's comments last night as vicious and vile meanwhile cabinet has strongly denied the accusation\nThe White House is rejecting and New York times investigation into President Trump's wealth NPR's child Snyder reports the administration is calling the times report extremely inaccurate\nWhite House spokeswoman Sarah Sanders called the story misleading in a statement and so the IRS reviewed and signed off decades ago on what the times says we're suspect tax Dodgers\nTrump lawyer Charles Harder to all the times of facts at sites are extremely inaccurate the New York state tax department however says it is reviewing the allegations outlined in all linked these stories of paper says it's based on a vast trove of documents including tax returns and other confidential documents from the real estate empire the president's late father\nThe times says President Trump and his siblings increased the wealth or receive from their parents through questionable financial moves that included a sham corporation used to disguise millions of dollars and gifts trials later NPR News Washington\nDisaster officials in Indonesia have raised the death toll from last week's earthquake and tsunami to more than fourteen hundred people teams are still finding bodies under heavy debris on the island silhouettes eight and beer Julie McCarthy has reached the provincial capital and says Indonesians are increasingly desperate for aid\nBut there are people on the ground you know the red cross is on the ground World Vision is on the ground but these are very tiny teams and in a disaster like this organizations like that um likes to come in with a very big operations because they know they will be needed\nAnd so those operations really have been curtailed so far they're very slow in getting up and running\nMeanwhile Indonesian officials say a volcano has a rep in on the same island no evacuations yet It's NPR\nThe Nobel Committee has awarded this year's Nobel Prize in chemistry to three scientist half of the prize has been awarded to American Francis Arnold she will share it with American George Pete Smith and Britain Gregory Winter\nThe Nobel Committee says their work has led the effort that promoting greener chemicals industry such as ... as well as the new pharmaceuticals\nIslamic state has claimed responsibility for a suicide bombing that target an election rally this week in Afghanistan the bombing killed more than Thirteen people and wounded more than two dozen others NPR's ... reports from Islam about\nISIS posted in a statement that they've almost not through security code and to target the crowd in the eastern province of ... the bomb and struck as old as we're speaking to thousands of men it was the first attack on an election rally since campaigning kicked off last week the parliamentary elections\nBut even before campaigning began they'd be in a series of attacks that targeted voter registration centers\nThere widespread fear that they sort of violence ... Rao parliamentary elections they seen as a dry run for the more important presidential elections next year and a test of the government's ability to provide security they had ... NPR News is on with that\nThe federal emergency management agency will conduct a nationwide test alert today at two Eighteen pm eastern time\nThe alert will appear on about two hundred twenty five million electronic devices or just about everybody cell phone in the U.S this is a test you cannot opt out of you'll need to dismiss it on your phone\nI'm core of the Coleman NPR News in Washington\nFor NPR comes from NPR stations other contributors include T Rowe price offering a strategic investing approach that examines investment opportunities firsthand institution advisors\nContributors include T Rowe price offering a strategic investing approach that examines investment opportunities firsthand institution advisors employers and individuals choose T Rowe price pie Rowe price invest with confidence good\nMorning and thanks for making WBAI a part of your day here's a look now at the forecast will see mostly sunny skies today was highs and the upper sixties it'd be mostly clear this evening that'd be coming partly cloudy overnight with Lowes in the mid fifties\nAnd Thursday looks partly sunny in the morning then becoming mostly cloudy along with the chance of showers and thunder storms in the afternoon some thunderstorms may produce heavy rainfall with holidays in the upper seventies or chance of rain is Seventy percent there's W. V. I. F. M. [noise]\nTrends Schubert wrote some of history's greatest art sons but those are hardly his soul contribution to vocal music on the next Chicago Symphony orchestra broadcast because ... conduct Hubert intimate math and eat flat nature\nAlso music my neighbor and Wagner next time with the the S L crisis any on\nSunday at ten pm on WB I found\n\nA very good morning to you this is Lisa ... glad to be with you on this Wednesday the third of October twenty Eighteen we have a great program pledged for you it's the mid we play list so that's a celebration in of itself\nBut since it's the fall we're hoping that some of these musical colors kind of add some color to your life today it's plenty of music all the way up until four but we take it an hour at a time so we ... in the nine o'clock hour with the composition bye Domenico ...\nA theatrical piece called ... and although the peace played at the ... the opera house it did have a very limited run only one performance but the overture seems to be the most lasting peace of the work\nToday the Toronto chamber orchestra begins so did the direction of Kevin ballad music now of ... on your arts and information station\n[noise]\nAnd that code decides who we are a guy ride that story next time on the Ted radio hour from NPR [noise] Saturday afternoon or W. B. R. A. up him\nIt's really hard to believe it's October already isn't it and not too worried though we know that the seasons\nAre going to continue we know that the colors are going to happen and we also know great things are going to be going on in our region to lots of fun fall happenings one of which is coming up on the six\nIf you'd like to go to Milford and enjoy some find music you'll have an opportunity to hear Caroline Golding\nShe was a child prodigy and she has a very promising career in the classical realm she is going to be getting a concert called red violin ... says on October ... at seven thirty at the Milford theater\nIt's all part of the kindred spirits arts program and you'll have an opportunity to hear music up pocket Mimi and it's a little glass tell them on and much more\nOnce again that Saturday October six to seven thirty red violin ... and if you'd like some tickets and more information kindred spirits arts dot org\nSometimes when a composer writes a piece of music and it doesn't have to be a very lengthy peace it is a hallmark piece for this particular composer and such as the case with Gabrielle foray we're going to be hearing his beautiful knocked her number four indeed flat\nMark it gives a composer and such a case of gum brio full rate we're going to be hearing is beautiful knocked her numbers or indeed slapped Kansas when I knew ... where we have the artistry Catherine stops at the keyboard you stick up for re ...\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise] [noise] [noise]\n\n\n[noise] [noise]\n\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n[noise] [noise]\n\n[noise]\n\n\n[noise] [noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise] [noise] [noise] [noise] [noise]\n\n[noise]\n\nThey\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise] [noise] [noise]\n[noise]\n\n\n\n\n[noise] so\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\nFilled with spirit and the pride of Norway music of advised Greek on WB I a and a series of Norwegian dances obits thirty five members of the Gulf and Bert symphony orchestra performed on your arts and information station\nFrom Norway to Italy a little later in the program and an oboe concerto in between a lot of great music just ahead so please stay with us\nGood morning and thanks for making WBAI a part of your day here's a look now at the forecast will see mostly sunny skies today with highs and the upper sixties it'd be mostly clear this evening then becoming partly cloudy overnight lows in the mid fifties\nAnd Thursday looks partly sunny in the morning I'm becoming mostly cloudy along the chance of showers and thunder storms in the afternoon some thunderstorms and they produce heavy rainfall with high in the upper seventies or chance of rain is Seventy percent there's W. V. I. F. him\nOn Wednesday ... said at seven thirty PM you're invited to take it to the limit when the Williamsport community concerts association brings the eagles tribute seven bridges bind to the community are sent to these Nashville musicians faithfully reproduced appeal equal found with local\nPrecision on stage presence that his and some national acclaim for tickets the box office is five seven zero three to six\nTwo for two for all online at the ac nice dot com W. V. I. A. celebrates hundreds of regional some cultural organizations\nFor details on many more events check the w._b. I ate a team Canada and catch up on obscene pop cost WB I ain't dot ORG slash are missing a scene with Erica funky weekday mornings after the news it eleven on W. V. I. A. F. N. [noise]\n[noise]\nWhat what can your bunches of captain have or we told this week when only offering her present drink against ruin score based on mobile mobile mobile [noise] perjury hunter more\nGet top dollar for it and use those funds to support the W. V. on a mission called eight for for W. VISA card that's it for for W. VISA card or visit W vi dot org slash cars to learn more and as always thanks for your support for W. vi and\n\nThis was W. B. I. eighty nine point nine of M. W. B. I. H. D. one Scranton Wilkes Barre Hazelden we're in Williamsport at W. B. Y. eight eighty nine point seven have him in Mansfield a W T I O eighty eight point three of them were in a while and pop back a W. P. A. U. Ninety One point five about them\nStreaming live but nobody V. I. A. dot org we have a translator and collect some it at Ninety point three FM your arts any information station listener supported public radio W. V. I.\nS. [noise] next time on ask me there we've got comedian Tom Arnold star of the new show the hunt for the ...\nPlus singer songwriter Jill so we'll put born with their very own Jonathan Gold than any music parity game about artists who go by one name so joined me over the euro for NPR's our a puzzle games and you're heavier [noise]\nSaturday at all that but I Am on W. V. I. A. F. at\n[noise]\nLike what you see on W. V. I. A. you enjoy fine programs like pull dark nova or nature be your kids love watching the antics of Elmo on Sesame Street enjoy sit the science kid are curious George how 'bout shows like called the doctor Pennsylvania pogo or scholastic scrimmage\nWhatever the reason you watch we want you to know that you make it all possible become a member today and ensure the future of your favorite programs that W. V. I. A. dot org and thank you for your support for W. V. I. a\nLine from NPR News in Washington on corporate Coleman President Trump used his Twitter feed this morning to push back against a skating New York times story NPR's Scott Horsley says the times reports Trump and his family used to be a scheme to evade taxes and hundreds of millions of dollars in here\nNPR's Scott Horsley says the times reports Trump and his family used to be a scheme to evade taxes on hundreds of millions of dollars in inherited wealth\nThe New York times fourteen thousand words story was the product of more than a year of investigation it shows that despite his claim to be a self made billionaire President Trump was the beneficiary of a vast inherited fortune much of which was shielded from taxes through a variety of questionable schemes\nNew York taxing authorities say they're reviewing the articles findings in his tweet the president does not dispute any of the facts and the article but describes it as quote a very old boring and often told peach drop\nComplains the vast majority of newspapers coverage of his administration has been negative echoing a charge leveled by the White House press secretary Scott Horsley NPR News Washington\nPeople who get health insurance through their work or seeing their share of the cost of coverage increase that's according to a new study NPR Dallas and co jak report the average price for a family plan is close to twenty thousand dollars a year\nThe report from the Kaiser Family foundation showed that the price of employer provided health insurance Rosen average five percent this year\nEmployees' contribution to those premiums fell slightly in twenty Eighteen but over the last five years employee share has risen by about a thousand dollars and on top of that more workers have to cover picker deductibles\nPeople who work for small companies usually pay more for their coverage than those who work for bigger firms about a third of those who work for small business cover more than half their insurance premiums\nPremiums also increase faster than inflation and workers earnings so altogether that means that health insurance costs are taking up an ever larger share of people take home pay Alison Kojak and parenting is the\nFederal emergency management agency is going to test a presidential alert system at two Eighteen pm eastern time today NPR's Brian Naylor has more\nFEMA and the FCC are conducting the test they estimate some two hundred twenty five million devices will be receiving an alert all along with an audible tone there'll be a text message dating presidential alert\nFEMA officials say the system is only to be used in time of a national crisis of the country's under attack or an imminent natural disaster and it can be used by the president for other purposes\nNPR's Brian Naylor disaster officials in Indonesia have increased the death toll to more than fourteen hundred people from last week's powerful earthquake and tsunami rescuers are still at work on some of the ways the island trying to free any survivors\nOn Wall street the Dow is up one hundred twenty six points at twenty six thousand nine hundred the NASDAQ except thirty seven and eight thousand thirty six\nYou're listening to NPR News from Washington\nLast night President Trump made fun of the woman who alleges she was sexually assaulted by Supreme Court nominee Brett Kavanaugh\nSpeaking at a rally in South even Mississippi Trump mocked professor Christine Blasey Ford for not remembering all details of the alleged attack in the Nineteen eighties people in the crowd clapped and left\nKevin ... denies the accusation Ford's attorney says Trump is engaging in a vicious violent attack\nA journalist association in Turkey is calling on the Turkish government to find out what happened to a prominent Saudi writer and critic after he entered the Saturday consulate in Istanbul NPR's Peter Kenyon reports associates of Jamal ... say he entered the constantly yesterday and never emerged\nThe Turkish Arab journalist association wants to the government to determine the whereabouts of his Yogi who reportedly visited the Saudi constantly in assembled collect some paperwork his fiance in a friend told reporters he never came out to show he is written critically about the human\nVisited the Saudi consulate in Istanbul to collect some paperwork his fiance in a friend told reporters he never came out\nTo show he has written critically about the human rights situation in the Saudi kingdom which has been trying to promote itself is on the path to reform behind the efforts of crown prince Mohammed bin Salman\nIn a statement the journalist association voiced concern for the security of the show the less Saudi Arabia last year over fears of retribution for his writings Peter Kenyon NPR News Istanbul\nThe remnants of the tropical storm in the Pacific ocean arts swamping the southwestern us what was tropical storm rose up poor record rain in parts of Arizona on Tuesday especially in Phoenix the national weather service is warning of the chance of flash flooding in Colorado Nevada and Utah today\nI'm more of a Coleman NPR News from Washington\nSupport for NPR comments from I drive maker of remote PC providing real time access to PCs max and servers from anywhere for youth when telecommuting or for remote managements learn more at remote PC dot com slash NPR Andy any each case the foundation good\nMorning and thanks for making WBAI a part of your day here's a look now the forecast will see mostly sunny skies today with highs and the upper sixties it'd be mostly clear this evening them becoming partly cloudy overnight with Lowes in the mid fifties\nAnd Thursday looks partly sunny in the morning I'm becoming mostly cloudy along with the chance of showers and thunder storms in the afternoon some thunderstorms may produce heavy rainfall with high in the upper seventies or chance of rain is Seventy percent there's W. V. I. A. F. am\nJoined us for a celebration of the one hundredth anniversary of the birth of Leonard Bernstein's\nSunday October fourteenth the three you\nGet reimbursed for growth spurt your dollar\nResent a program that includes ... works in the west Side Story as well as early as our national WB I Am the ... if you'd like to enjoy this concert or do need to make reservations\nAbout or or by phone five seven zero six five five to\nThe Williamsport simply conducted by ... it'll Stein opens October sixteenth with works by Racine each ... and Brian\nGrammy nominated and chart topping violinist Caroline Golding plays Chuck ... violin concerto [noise]\nWilliamsport symphony October sixteenth that the community outside her five seven zero three to six twenty four twenty four or Williamsport symphony dot org sponsors would our capital group at my coming college\nGood morning and welcome to classical music on WB I I'm a I'm ... glad to be with you on this Wednesday the third of October twenty Eighteen\nAnd hoping you're having a good day of good morning it is the mid week which is a good thing but even better is do you have great classical music on in the background to make the task at hand a little bit easier at least it's a little bit easier for me\nAt any rate we're going to begin our ten o'clock hour and ushered in with music of Strauss regard Strauss and many times can pose as you hear stories where they're really inspired by a space or place they visited that they'd never seen before\nAnd maybe it's the pulse of the people maybe it's the scenery maybe it's a combination of a lot of things that really locked into their heart and they are very much inspired by what they see and what they hear\nAnd such was the case with regard Strauss when he traveled to Switzerland he made some very close friends in Switzerland and really enjoyed not only the people but also the beautiful scenery you've seen photographs of Switzerland but if you've ever been to Switzerland it is absolutely breathtaking\nAnd honestly very inspiring so when he wrote his elbow\nGrass Switzerland but if you've never been to Switzerland it just absolutely breathtaking and honestly very inspiring so when he wrote his elbow concerto in the major he had his friends and the beauty of Switzerland on his mind and heart\nSo today we're going to be hearing all those on chamber orchestra ... ski with a performance today of the ... the major music ... drops on double ...\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\nTo\n\n\n\n\n\n\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n[noise] [noise]\n\nNo no [noise]\nWhat a spirited sound music of Carl gold market in Italy opens forty nine members of the national symphony orchestra of Ireland performs under the direction of Stephen guns in house here on your arts and information state should\nThink about it at the beginning of the hour we went to Switzerland courtesy of ... just came back from Italy and then a few moments we're headed to London this is a no jet lag zone so we certainly hope you'll stay with us\nWBAI we believe our society needs independent enterprising in depth journalists\nWe believe are regional community needs a well informed civically engaged public\nWe believe our area needs public media to highlight our local cultural scene and keep in touch with the world [noise]\nThere are many ways you can help us with this public service mission [noise]\nGet your business to sponsor WB I make a memorial gift donates stocks bonds or mutual funds for a tax advantage include WB I in your will and leave a legacy\nDonate a vehicle you don't\nVolunteer at the station had large CDs answer phones organized press release just help with special events ushered concerts\nPublic media is a community of people who care\nWe care and we thank you for carrying\nThank you for your support [noise]\nMore ideas at W. B. I. A. dot\nOrg so on to London we'd go as we wrap up to date playlists what's the music of from the University of hide it\nFrom the hip hide and lived in London and found out that the loop was a very popular instrument among the London audiences and so he wanted to cater to his audience and wrote a series of London trio is just delightful light works that", "show_name": "Classical Music with Lisa Mazzarella", "year": "2018", "city": "Williamsport", "day": "03"}