{"month": "10", "state": "PA", "station": "WVYA", "content": "It's a recording university or high school students with their parents can learn what makes ms recording your special at an open house on Saturday November ... tour campus and learn about the challenging academic programs financial aid award winning sports programs registered ms recorded dot edu slash open house\n\n\nSend delightful music as we usher in a brand new wait I'll be at a cloudy Monday definitely some rain and the forecasts but some great classical music to hopefully bring you a little bit of sunshine in the background we have the trumpet concerto gay or tell them on also on the playlist music of hiding in ... but first news [noise]\nThis is W. vi eighty nine point nine up at W. V. I. H. D. once granted Wilkes Barre Hazelden W. B. Y. eighty nine point seven Williamsport W T I O eighty eight points ... Mansfield W. P. A. United one point five FM Palmyra township\nAnd such but how to universities W que su eighty eight point not FM ceilings grove we have a translator in Allentown in Ninety nine point three you're arts and information station listener supported public radio W. V. I. S.\n[noise] ... so that the cutting edge of Celtic music absorb influence style from the Celtic hotline and around the world\nLike some of the music made it takes and this week on the ... [noise]\nSaturday evening at eight on WB I Am [noise] ooh\nHe\nLived from NPR News in Washington I'm core of a Coleman President Trump is scheduled to leave the White House this hour for a visit today to pursue Georgia and Florida hit by hurricane Michael\nAt least Seventeen people have died because of the storm in states from Florida to Virginia in dozens of people are missing but authorities don't know if that's because people are unable to check in with their loved ones cell phone service is spotty in some areas especially in Florida's panhandle\nFEMA director Brock Long toward that region on Sunday\nNo doubt about it for a tremendous hit the some of the worst damage I've seen in my career\nMeanwhile teams are going through rubble and some Florida coastal towns with heavy equipment and could ever drawings\nSaudi Arabia is vowing to retaliate if the U.S imposes sanctions over a prominent Saudi journalist who was missing and feared dead and beer is calling Dwyer reports there's growing diplomatic tension over Jamal ... state\nPresident Trump has worn that Saudi Arabia will face consequences if it does behind him all showed the suspected murder is was tromp on CBS or sixty minutes we're going to have to see\nWe're going to get to the bottom of it and there will be severe\nFor the ... suspected murder is the Trump on CBS was sixty minutes we're going after she\nWas going to get to the bottom of it and there will be severe punishment\nFor Saudi authorities didn't take long to answer with a warning of their own or government official pulled the kingdom state run news agency that they totally reject any diplomatic threats according to the official quote\nThe Saudi Arabia received any action will respond with greater action at a Saudi said the widespread allegations of murder are nothing more than ... ... they have yet to offer any official information about the whereabouts of missing journalist college wire NPR News\nIn Germany the political coalition partners of chancellor on gal America have taken major losses in the very end state elections as me Nicholson reports the poor regional results may have repercussions for miracles federal coalition government\nThe Christian social union ... conservatives have such that was the result since Nineteen sixty and anything that abstinence majority and the regional parliament\nMichael's other federal commission pot and other Social Democrats also said pony flown in from second position to sit and gaining any half as many voters as they did in the previous state elections\nWell let's see if you still in pole position the policy will have to form a coalition to govern does area named victims with the environmental screens who came second the far right alternative for Germany hockey entered the state legislature ... time after coming forth for NPR News I'm Esme Nicholson in Berlin\nIconic retailers Sears is filing for bankruptcy the company failed to make a debt payment of one hundred thirty four million dollars it's known for selling appliances clothes and cars Sears is also now known for its debt worth about five and a half billion dollars Sears officials say they plan to stay in\nBusiness you are listening to NPR\nThere have been torrential rains in southern France triggering deadly flash flooding fringe officials now say at least Thirteen people have been killed some rescuers use helicopters to pull people to safety French officials add several months worth of brain dropped in just a few hours\nRescuers have retrieve the bodies of nine climbers who were killed in a snowstorm on a mountain in the palm NPR's such me to talk reports from him by this is the worst mountaineering disaster for that country in recent years\nBy South Koreans line buzz in Fort anybody do guides like killed him in a while then storms that there'll be scanned on the balls glued to the mountain on friday rescue helicopters had flooded the buddies on Saturday but what I needed to land due to bad weather conditions ... Jang hole was among the dead\nHe's the south Korean ... fourteen of the woods highest summits without supplemental oxygen South Korean president Moon Jae in has expressed his condolences\nThe body of the five South Korean climates are scheduled to read so by an event state summer and fall out of peaked mountain climbing season than ... so to me that by take NPR News I'm by\nThe California utility Pacific gas and electric has shut off power to some sixty thousand customers in about a dozen northern California counties the utility sites extreme fire weather conditions and the wind the utility warrants that there could be wind gusts that reached fifty\nMiles per hour the vegetation is very dry and the power cut off our limited to extreme fire risk areas I'm more of a Coleman NPR News\nFor NPR comes from a campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email triplets a drag and drop email at ...\nPain monitor and email marketing platform used by more than two hundred thousand customers worldwide with email triplets a drag him drop email editor and twenty four seven customer service more at a campaign monitor dot com and American for the arts\nGood morning here's the weather forecast for the w._b. I eliciting area we do have a chance of some showers this morning then rain this afternoon with ... expected to be around sixty five\nThe chance of rain is eighty percent showers tonight with temperatures near thirty eight the chance of rain Seventy percent into Tuesday some sun with ... near fifty six Tuesday evening clear they're becoming cloudy with loads near thirty eight some sun into Wednesday with ... near fifty sunshine into Thursday with ... near forty eight\nFriday looks mostly sunny with temperatures near fifty six and looking into the weekend a cloudy Saturday a chance of rain with temperatures near fifty six Sunday looks mostly sunny little chilly temperatures near forty seven\nRight now it is fifty two degrees of the Wilkes Barre Scranton international airport and nine o seven at W. V. I. F. M.\nThe following is a test of the emergency alert system\n\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\nEvolved the ropes and five hundred concerto but he poured his talent into just one for the cello mandolin on the next Chicago Symphony orchestra program mentally myth Avi Avi town performed this in other\nPlus Heiden drum roll symphony next time with the CFO basis any on\nSunday to in the ... the audio [noise]\nProgramming on WB all your years made possible by our members we thank you for your support numbers and by dancing count productions presenting solo piano George Winston performing as the dean center in wealth borough this Tuesday October sixteen more information a ticket to George Winston dot com\nA very good morning to you this is Lisa ... glad to be with you on this Monday the fifteenth of October twenty Eighteen little bit of a chili weekend but it was fall and it felt good it's nice to put on a sweater it was nice to put out a little jacket and feel the breeze go through your your hair\nAnd you see the different colors starting to happen in our region\nYou know we're in a season over splendid then hoping that uh these next couple of days are just going to make some make for some brilliant picture taking I was taking a look at social media this weekend that people are getting scenes of different trees and maybe going around in their backyards and watching the leaves turn just beautiful\nSend the pictures we love we love to see them we looked at the look at them and and to admire the fall together it's just lovely\nYou can a tweet me at the at ... or of course you can put them on our Facebook account to W. B. I. dot org it's just lovely to see that stuff\nWe have some great music to to celebrate the fall the Norwegian symphony is a or we know region Rhapsody of your ... is going to head up to nine o'clock hour today we have is Norwegian Rhapsody number two opens Nineteen the Sean time's up for the orchestra performs on your arts and information station [noise]\nSan Francisco operate presents routine ease the barber of Seville a delightful combination is cutting clever and Z cartoon characters\nBrought to life with the cats during Lucas meet you I'm Danielle ... in ...\nTo ... the conduct the barber of Seville from San Francisco opera on this station [noise]\nSaturday afternoon at ... W. B. I. S. [noise]\nSupport for WBAI comes from the citizens voice providing loser in county was breaking news every day for the past forty years the citizens voice banks their readers who received news at home or on the go\nThe citizens voice here to stay more information that citizens voice dot com [noise]\nWell there's plenty to do at the Louis ... children's museum for the young and the youngest hard and it's the type of museum where it is all touch and lots of talk and lots of asking a question it really is almost like a little bit of a science lab too because it gives the children an opportunity to study things and to really\nGet their hands on things to to know what they feel like no they smell like know what it's what it's all about and this particular month are going to be focusing on lots of things in each are all things nature actually uh they were taking a tease\nOr they were taking a teaching Mandarin language lessons ah yeah last week they did something on the wooly worms you know studying the wooly worm and how the severity of the winter is determined by the Willie worm\nThis week they're going to be studying about trees the tremendous view of the forest and how things are beginning to winter writes I Believe it's are falling how the trees will go dormant\nAnd then they'll come back to life in the springtime because it's all part of the Lewis ... children's museum offering hands on enriching educational experiences for the young and the young at heart and if you'd like some more information about some of the special programs at some of the special classes that they have at the museum\nYou can check their Web page Louis ... children's museum for more details\nJust had a very special piece that I Love and I don't want to overplay but when I get a chance to put it on my list I'm delighted\nIt's music of Chauncey Bailey s and his serenade indeed serenade number one in deep we have another Sophie moot are joining members of stuff's compelled Dresden under the direction of Andre ... beautiful music up the Bailey\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\nMm [noise]\n\n[noise]\n\n\n[noise]\n\n\nMm [noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\nBeautiful music of the baby is on WB I asked him on the Sophie ... Dresden under Andre prepping a performance today of these serenade number one indeed on your arts an information station\n\nThe adult corps of the choral society of northeast Pennsylvania the ... under the direction of Dr Allen Baker will be opening up their twenty Eighteen twenty Nineteen season on Sunday November fourth beginning at four\nAnd it'll be in the sanctuary obscene Stevens Episcopal appropriate the drill in Wilkes Barre it's music fit for king with a program of English Baroque anthems for course soloist the chamber orchestra\nCourse performing music of handled from the coordination asked him for George the second\nMusical personal the selection to good use famous bell Adam rejoice in the lord always\nAs well as a gift thanks and lord how long will be angry and they'll all be wonderful soloist throughout the course of the program we will be giving some tickets away beginning tomorrow to this performance\n\n...\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\nYou take a gay or kill them on on W. V. I Am Sam trumpet concerto indeed teaching hock at heart and burger and the Academy of St Martin in the fields under the direction um I own up around on your arts and information station\n\nOn this week's broadcasted the San Francisco says sometimes you just don't see any number\nOf transitions like rescue strongly at life in a town that's next time with the San Francisco says [noise]\nMonday afternoon it too long ago I found\nSupport comes from the concert series professional performances or musical sonic just may be born in the company and the seller callers does she see some fashion membership information available in concert series dog\nOkay now maybe some of you believe some of you don't believe but it\nIs something that's going to be happening at the Taylor public library and I'm actually excited about this because I I plan on going to this it's the the Taylor public libraries presenting the Pennsylvania paranormal association on friday October twenty six\nAnd the doors will open at six thirty the program beginning it's seven Mary keys as well as other members of the Pennsylvania paranormal association will be holding a general discussion on hunting how they began how they're investigated the Pennsylvania paranormal association results him\nSo if you are interested you need to do is get in touch with the Taylor community public library in Taylor or just show up for the meeting coming up on October twenty six once again the doors open at six thirty and it should be a very interesting evening so close to Halloween getting into well spirit of the season\nSo that's coming away from the Taylor community public library coming up though we have to music that is quite recently music up front you can't hide it awkward parental metal a piano sonata\n\n\n\n\n\n\n\n[noise]\n[noise] [noise]\n[laughter]\n\n\n\n\n[noise] [noise] [laughter]\n\n\n\n\n[noise]\n\n\n[noise] [noise]\n\n[noise] [noise] [noise]\n[noise] [noise] [laughter]\n\n[noise]\n[noise]\n\n[laughter] [noise]\n\n[laughter]\n[noise]\nPeople from Florida to Virginia dozens of people remain missing especially in Florida's panhandle where the hurricane made landfall\nThe president says he it's sending his secretary of state and Saudi Arabia to meet that country's king immediately the Trump Administration is trying to find out what happened to Saudi journalist who disappeared earlier this month as NPR's Michele Kelemen reports Washington\nPost columnist Jamal 'cause she'll be with last seen entering the Saudi constantly in ... earlier this month President Trump says on Twitter that the Saudi king denied any knowledge of what happened to show the Trump said he spoke by phone with gangs all non ended sending his secretary of state Mike Pompeo to Riyadh\nTrump says the Saudis are working closely with turkey to find an answer Turkish authorities said that they believe the Saudis lord ... to the consulate and killed him there and\nThe case is draining us relations with Saudi Arabia and the Trump is made clear he doesn't want to disrupt lucrative arms deals Michele ... NPR News the state department\nOnce the largest retailer in the country Sears is now filing for bankruptcy as NPR's David Schaper reports\nFears losses in recent years are staggering more than ten billion dollars it's two thousand twelve the company's debts are massive also in the billions the suburban Chicago ... parent company Sears Holdings as close more than seven hundred years in k-mart stores over the last two years\nUnder this bankruptcy planned the company will close another one hundred and forty two stores before the end of the year\nBut the company will get the financing it needs to keep about five hundred more stores opened through the critical holiday shopping season and beyond after losing many of its customers who the retailers like Amazon Sears is now pending it's survival led reorganizing as a smaller version of itself David Schaper NPR News Chicago\nA federal court case opens in Boston today against Harvard University over its admissions policies from member station WBUR GBH in Boston Kirk Carapezza reports the university is accused of discrimination\nThe group students for fair admissions queens harbored systematically ranks Asian Americans lower on characteristics like courage kindness and leadership\nHarvard has denied the charges saying Asian Americans now account for twenty three percent of all admitted students and civil rights leaders see the lawsuit of attack on race conscious admissions which the Supreme Court has allowed if terribly done\nKirk Carapezza reporting on Wall street stocks are lower the Dow Jones industrial average down fifty five points at twenty five thousand two hundred eighty two the NASDAQ down sixty eight Seventy four hundred twenty eight this is NPR\nDiplomats from North and South Korea have agreed to reopen railroad and highway links between their countries the diplomats say their nations will stage ceremonies next month or in early December to highlight the agreement\nThe north and South Korean representatives have also agreed to start talking about an effort to co sponsor the twenty thirty two Olympic Games\nFor the second time in just a few days one of NASA's space telescopes have stopped working from member station W. M. F. E. Brendan Byrne has more\nChandra X ray observatory went off line less than a week after Hubble Nassar says the telescope went into so called safe mode possibly because of a gyroscope problem safe mode is automatically activated to protect the spacecraft if it's computers think there might be a technical problem\nThe telescope uses a set of gyroscope to help navigate and study the spacecraft\nHubble went off wind due to a similar issue\nBoth orbiting observatories are old and in well extended missions Hubble is twenty eight while Chandra is Nineteen Nassar says it's just a coincidence both shut down so close together for NPR News\nThe missions Hubble is twenty eight while Chandra is Nineteen Nassar says it's just a coincidence both shutdowns so close together for NPR News I'm Brendan Byrne\nThe national weather service says temperatures will be twenty to thirty five degrees colder than usual in the southern in central plains today as well as in the Rockies freeze warnings extend from west Texas to northern Illinois\nResidents of Colorado and Wyoming got an early season snowstorm on Sunday parts of the state's got up to a foot of snow authorities closed some major highways because of icy conditions\nI'm more of a ... NPR News in Washington\nSupport for NPR comments from NPR stations other contributors include progressive insurance comparing car insurance rates from multiple insurers so shoppers can evaluate options in one place now bats progressive comparisons available at progressive dot com or one eight hundred progressive\nGood morning here's the weather forecast for the W. B. I. eliciting area\nCloudy today with the chance of some showers temperature should be around sixty five degrees the chance of rain is eighty percent decreasing to Seventy percent tonight\nShowers mainly later in the evening with loads near thirty eight Institute some sun with eyes near fifty seven\nTuesday evening clear and cold with temperatures near thirty eight when the looks partly sunny with highs around fifty Thursday sunshine with temperatures near forty eight mostly sunny on friday with highs near fifty five\nLooking into the weekend a cloudy Saturday with a fifty percent chance of rain with temperatures near fifty five sunshine into Sunday with highs near forty eight\nFifty three right now under cloud cover at the Wilkes Barre Scranton international airport and it is ten o seven at W. V. I. F. M. your arts and information station\nAcross the country prison discipline comes down harder on when you've written\nUp for not closing your doors get written up for jumping on the phone without permission and those low level infractions can have severe consequences like more time\nIt was sad because it does is\nOn there who are in low in\nAn NPR investigation this afternoon on all things considered from NPR News [noise]\nHe's joined us from four to six or all things considered on W. V. I. A.\nSupport for it will be it comes from kings college got a closer look at King's College on Sunday October twenty first of their open house here's your chance to discover kings and experienced the campus community participate in presentations on financial aid study abroad\nCampus activities and much more watch meetings with faculty and athletic representatives and tours of campus will be available during the day don't miss King's College open house on Sunday October twenty first for reservations are more information call one eight eight eight kings PA or visit kings dot edu slash admissions\nGood morning and welcome to classical music on W. V. I. A. I'm lease them as a ... glad to be with\nYou on this Monday the fifteenth of October\n... Eighteen and I hope your morning is moving along productively it is hard to start after a nice weekend maybe you had an opportunity to do some fun things over the weekend\nTo wake up on a rainy Monday morning and think back to the grind the you know something that really isn't much of a grind when you have some nice music in the background had some tax that need to get done you start the work week off and all of a sudden things move into\nA pretty good pace and you're kind of proud of the fact that you can look back and say ha\nMission accomplished tasks or finished so I Hope that's the way you feel with the beginning of a new work week\nBut we have some new music and the ten o'clock hour for you well maybe not so new but maybe it's an a discovery for some people who are tuning in maybe for the first time\nWhen the ten o'clock hour for you well maybe not so new but maybe it's an a discovery for some people who are tuning in maybe for the first time on Tony ...\nYou know the saying is true being in the right place at the right time and unfortunately Antonio caught to the idea was not in the right place nor with the at the ... they're the right time\nHe was in a situation where he was a phenomenal composer and many of his contemporaries compare him to the likes of a Beethoven or a Mozart and had their had there not been any kind of\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise] [noise]\nMm\n\n\nMm\n[noise]\n\n\n\n\nMm\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\nMm\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\nWe had things that we worked with around the house when we were kids you know the crayons the coloring books and we'd have trans we use different types of pencils and lots of different types of pressure to get different types of colors\nWell you know Bloomberg university is going to go back to that because it was a natural time it was a way we were only we were able to stimulate our mind by using what we had around us\nAnd that's the whole premise of pop up play day were children twelve twelve and younger that's going to be coming up on November ... third that the Saturday from eleven AM until three at the student recreation center the event is free\nAnd basically it's using things that you see around the house maybe old computer keyboards maybe you have string maybe you know cotton ball wine or maybe you have paper and colored pencils and by all means let the kids run with it and see what they do with it\nSee how they create and how they can use their imagination without the help of an app for without something already being drawn for them\nReally is a nice way for them to really get creative\nAnd I just try their hand a trying trying something maybe they've never tried before you know you have the children that they have everything at their disposal at the time and so when we were kids we were growing up this is what we had to do to entertain ourselves\nAnd it was always quite interesting and very very rewarding too if you were able to make something out of what most people would call nothing and look pretty good to maybe a decoration or maybe a wall hanging or maybe finger paints that looked pretty good\nSo that's good to be coming up a pop up play day on November the third from Lebanon Yemen till three children recreation center on the campus of Bloomberg university [noise]\nThomas aren't his parents are desperately wanted him to become a lawyer but he really had the power of persuasion they saw the they saw this persuasive nature in their son and he persuaded his father to allow him to go into music to do music\nAnd so the father gave in and uh so we're glad we were glad he did too because I had composed a lot of a wonderful symphonies and some very fine and refined work too that we're about to hear the symphony number one and see Catalina performing under Adrian shepherd\n[noise] [noise]\n\n\n\n\n\nRoom\n\n\n\n\n", "show_name": "Classical Music with Lisa Mazzarella", "year": "2018", "city": "Williamsport", "day": "15"}