{"month": "10", "state": "PA", "station": "WVYA", "content": "Of our executive producers nickel child is our digital producer his Redmond Karen Karen with the oh our engineer is Ryan Alison [noise]\nThis is the marketplace morning report [noise]\nAmerican public media support comes from a while for say October's national seafood might be a plan that includes fishes heart healthy one while\nFor salmon specializes in Alaska sockeye salmon but carries a wide variety of other fish and shellfish find salmon and more while for salmon dot com\nProgramming on WB I made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your arts and information station W. V. I. A. F. M.\n\n[noise]\nSomething bright and fun musical ... home alone are playlist today we'll be hearing one of his piano trio [noise]\nDo something festive by William rent them and we had the music of the bad [noise]\n\nThis is ... eighty nine point nine of them W. V. I. H. D. ones granted Wilkes Barre handled WTY eighty nine point seven FM Williamsport WTO eighty eight point three if it means bird Mansfield\nW. P. A. U. Ninety One point five FM Palmyra township I'm so glad to universities W que su eighty eight point of mc ... grove\nPops field translator at Ninety four point nine of them is made possible with support from the Richard ... junior charitable foundation\nJoined us for a celebration of one hundredth anniversary of the birth of letter\nOn Sunday afternoon at three Gary and burn it at all with Iran is Richard McDonald's\nDean to west side story that's one of the early clarinet on WB I ate out of the Dietrich theater invite you to enjoy this concert of us are donate the make reservations or W H M ... or so seven zero five five to eight\nLive from NPR News in Washington I'm core of a Coleman the death toll from hurricane Michael has increased to eleven people Virginia authorities are reporting five new debts from the storm this week\nMichael stormed ashore on Wednesday in the Florida Panhandle where residents are just getting a sense of the damage from member station WFDD alert simply tells us about one family that did not evacuate\nKennedy hold his wife Diane as he tells me about what it was like to live through the storm their home within the outlook area of evacuation zone bit ill wouldn't worry\nLive from NPR News in Washington I'm core of a ... the death toll from hurricane Michael has increased to eleven people Virginia authorities are reporting five new debts from the storm this week\nMichael stormed ashore on Wednesday in the Florida Panhandle where residents are just getting a sense of the damage from member station WFDD Dolores ... tells us about one family that did not evacuate\nThey'll Kennedy hold his wife Diane as he tells me about what it was like to live through the storm their home within the outlook area the evacuation zone but it wasn't worried\nAbout bend your all of ... ... many many many in North Carolina Louisiana\nBut this one was much worse for the Kennedy family six people were under builds Ruth including his four month old granddaughter when a tree peers through their home and brought down power lines with it\nWhen it started buses and all the transformers and all the telephone poles already coming down it was a domino effect [noise] just just snap not\nEverybody safe but his wife Diane said this stretch of putting their home back together is settling in for NPR News I'm Dolores ... in Panama City\nThe Russian space agency has clarified the chain of events in yesterday's dramatic emergency landing of the Soyuz capsule Matthew butter reports from Moscow the two men crew survived the launch aborted after about two minutes\nRussian space agency executive and cosmonauts Sergei ... told reporters today that one of the rockets foresight boosters did not properly jettison and struck the body of the solar use rocket\nHe described a chain of events that corresponds with what could be seen from video footage of the rocket and a stream from within the cabin the rocket was damaged and knocked off course\nThe Russian accident investigation payments on work and curriculum that they should have result later this month indicates confidence that the problem can be identified end result quickly meanwhile the head of the Russian agent said today that the crew of yesterday's launch will be given another chance to fly sometime\nEarly next year for NPR News I'm Matthew Bodner in Moscow\nThe Vatican says Pope Francis will make late archbishop Oscar Romero of El Salvador uh saint on Sunday and beard Danny hate jak reports the controversial Romero was assassinated in Nineteen eighty while he was saying that\nHe was a fighter for justice and they called him the voice of the voiceless this was a time when El Salvador's military regime which was supported by the United states killed kidnapped and tortured civilians many of them the poorest in society\nAnd so remember ran this commission that investigated human rights abuses and every Sunday during mass\nHe named victims of murder and the color to disappeared\nAnd it was incredibly dangerous for him to do that I'm In his family's were broadcast on the radio and they became sort of like\nA newscast for the poor\nAnd the urge any hey jak reporting this is NPR\nThe Vatican says that Pope Francis has decided to accept the resignation of cardinal Donald Wuerl of Washington D. C.\nWorld is involved in the church is sexual abuse scandal a grand jury report in Pennsylvania this year alleged that world while the bishop in Pittsburgh helped shield some priests accused of molesting children\nSeparately he is also accused of knowing that his predecessor former Washington cardinal Theodore ... Carrick committed sexual misconduct world denies that\nWisconsin jury has awarded to state workers a total of seven hundred eighty thousand dollars after their insurance refuse to cover transgender related care from Wisconsin Public radio in Madison the beat Patrick has more\nTo avoid and is one of many transgender people in Wisconsin denied access to gender confirmation surgery or hormone therapy\nHelp to shield some praise accused of molesting children\nSeparately he is also accused of knowing that his predecessor former Washington cardinal Theodore ... Carrick committed sexual misconduct world denies this\nWisconsin jury has awarded to state workers a total of seven hundred eighty thousand dollars after their insurance refuse to convert transgender related care from Wisconsin Public radio in Madison Phoebe ... has more\nEileen avoiding is one of many transgender people in Wisconsin denied access to gender confirmation surgery or hormone therapy last month a federal judge set of state rule barring such coverage is unconstitutional now Jerry had decided boy didn't end up ... deaths are owed hundreds of thousands in combat sitar damages why didn't that this is restored some of her faith in humanity\nThey all agreed that the states ... was disgusting discrimination was illegal in what had happened to us was incredibly ...\nAccording to the ACLU this is one of the first time the jury had the damage it to transgender people tonight healthcare for NPR News I'm Patrick in Madison\nWall Street open later this hour after two days of steep declines on Thursday the Dow Jones industrial last a little more than two percent the NASDAQ fell one point three percent investors continue to worry about potential interest rate increases and trade tensions\nI'm more of a Coleman NPR News\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff is a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair a new episode every Friday on prime video\nProgramming on WB I made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this was your arts that information station W. V. I. A. F. am\nI on Christmas really from lives in here with Chris viewing\nWe're proud to be the highest rated to our life musical comedy variety show on public radio in time slot\nDo it in this weekend for our showed policy leader in Saint Paul Minnesota with the school our brothers missed Madison Cunningham\nAnd dirty projectors fly from here we make great radio\nTomorrow evening at six Sunday night at eight O W v I D I F [noise]\nSupport comes from east Strasburg university where do I go to college east Strasburg university for new wonder grass and transfers come off in the same tuition for all four years the U.S you were warriors belong learn more were warriors belong\nDot com [noise]\nMorning in our weather forecast today we'll see some sun and temperatures feeling like the fall hides near fifty six wind gusts up to thirty five miles an hour some showers likely after midnight with Lowes around forty\nAnd then into Saturday cloudy started with showers in the morning then some sun temperatures near fifty to the chance of rain is Seventy percent\nCloudy on Saturday Night than becoming clear with patchy frost\nTemperatures near thirty six degrees by Sunday Sunday uh we'll see some sun with temperatures near fifty five Sunday evening of cloudy a slight chance of rain with temperatures near forty three inches Monday of forty percent chance of showers with ... near fifty seven\nTuesday sunshine with ... near fifty six Wednesday looks partly sunny with a slight chance of rain with temperatures near fifty five Thursday partly sunny temperature is near fifty three congratulations fall officially has arrived right now we have\nA gusty winds at a thirty or it is it cloudy right now and it is fifty\nOne degrees at the Wilkes Barre Scranton international airport it's night oh eight at W. V. I asked them\nThe evening of cloudy a slight chance of rain with temperatures near forty three inch of Monday a forty percent chance of showers with Jeff Bridges near fifty seven\nTuesday sunshine with my dear fifty six Wednesday looks partly sunny with a slight chance of rain with temperatures near fifty five Thursday partly sunny temperatures new fifty three congratulations ball officially has arrived right now we have\nThe gusty winds at a thirty or it is it cloudy right now and it is fifty one degrees at the Wilkes Barre Scranton international airport it's night oh eight at W. B. I asked him\nA very good morning to you I'm Lisa ... glad to be with you celebrating this Friday the wealth of October twenty eighty kind of excited about it too because this is the first day of October the first day of all we're really feel like fall\nOn the way to work today able to see some of the leaves kind of dancing in the wind and it really is starting to be like the season there were splendid season so we have some ... music for you beginning with a festival overture\nFrom a William ... still on WB I members of the royal philharmonic orchestra of London performing under the direction Arthur bed at lip getting today a festival overture as we celebrate friday together on W. V. I. A.\nOn the music of the month I'll be ... as we kind of walk back on the musical timeline and share with you a concerto in F\n... members of Colorado burn perform on your arts and information station\n\n\n\n\nMusic up all my so I'll be known any ... concerto in F. featuring members of camaraderie burned in ... here on WB I asked him\nThere is an event that's going to be happening October fourteenth and I truly wish I were able to go but I Hope you're able to make it it's called dumplings at dusk with middle ... and Carol is a dynamo and she is\nThe er the river keeper of the west branch of the ... river\nAnd when we were doing the our town insolvent county she figured prominently in that because the loyalty creek was named the twenty Eighteen ... a river of the year and so it was a great designation and so she was a she gave a wonderful interview\nAt any rate she's going to be your host air hostess as she uh tell tells you a little bit about the watersheds aboard the Hiawatha paddle wheeler in Williamsport it's an absolute blast if you've never tried it it really is nice to be able to go on the ... river on this on this so beautiful boat\nAnd you're able to watch the sunset and share will give a little bit of a history about the ... river\nAnd how it's important to keep our rivers clean our watersheds a clean so they can be livable and drinkable and you can enjoy your fishing and kayaking and so forth plus you also have an opportunity to have some dinner you have your ... your choice of sweet or see re dumplings\nAnd you'll be hearing some great music in the background who so it's a wonderful evening aboard the boat to avoid the higher wealth in Williamsport cow Berrent that it's going to be telling you a little bit about the subject what Hannah you'll enjoy music maybe some John Denver a tribute music\nAnd you have some wonderful savory or sweet dumplings if you'd like some more information or would like to make us reservations you can call five seven zero seven six eight sixty three hundred\nBoarding begins on the Hiawatha at five forty five just in time to watch the sun goes down and just enjoy the music great company great music and get some very good information to well rounded evening that's October fourteenth by forty five you can meet your friends at the dock\nComing up we have some music Abed ... speaking of water we're going to be heading down the mole do right now with the Israel philharmonic under Zupan meta on your art than information station\n[noise]\nSix eight sixty three hundred boarding begins on the Hiawatha at five forty five just in time to watch the fine go down and just to take some music great company great music and get some very good information to well rounded evening that's October fourteen by forty five you can meet your friend the ...\nComing up we have some music ... speaking of water we're going to be heading down the mole do right now with the Israel philharmonic on ... on your art than information station\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\nTaking these delightful little day trips courtesy of Smith now as we traveled down the mold down with the Israel philharmonic orchestra under the direction of stupid meta here on your arts and information station so glad that you're with us today a\nSan Francisco offered present Andrea ... who joined down to its tail of\nA poet any young noble woman closing the turmoil of the French Revolution music director me Conan to assault the lead to international kept\nTeaching young ...\nOn up there on the George gotten EJ engineered Brigitte ... join us for Andrea ... on this station Saturday afternoon it was a\nProgramming on WB I is made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your art should information station W. V. like a a family\nSupport comes from the times tribute for over a century the contributions granted served northeast Pennsylvania with news and information that defines our community in charge of our history as it unfolds delivered to your home or your mobile device the contribution is there for you any PA news dot com\nOn the musical beyond up amongst them all on the piano trio when gee open sixty five the boat docked trio performing on WB I ate a\n[laughter]\nFor the times Tribune Scranton is or northeast Pennsylvania New information the financial community at church or a history as it unfolds delivered to your home or your ... by the time tributes there for you any PA news dot com\nOn to music ... on the piano trio in geo ... sixty five the boat docked trio performing a double ... hey I'm\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[laughter]\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n[noise] [noise] [noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\nThis was WBRC eighty nine point nine of M. W. B. I. H. D. one Scranton Wilkes Barre his Wilton we're in Williamsport at W. B. Y. U. eighty nine point seven FM in Mansfield a W T I O eighty eight point three of them were like well I'm pop back a W. P. A. U. Ninety One point five of them\nStreaming live at W. V. I. A. dot org we have a translator and collect so much at Ninety three of them you're arts and information station listener supported public radio W. V. I. S.\n[noise]\nNext time with the Chicago Symphony orchestra conductor ate a device an age of second sympathy\nFor sure most ... turning and invented toward\nMozart Beethoven next time Chicago Symphony orchestra ... [noise]\nOne day a ten pm on W. V. I. F. out [noise]\nLike what you see on WB IRA you enjoy fine programs like pull dark no vote were nature be your kids love watching the antics of Elmo watch Sesame Street enjoy sit at the science kid are curious George how 'bout shows like called the doctor Pennsylvania forgot where scholastic scrimmage\nWhatever the reason you watch we want you to know that you make it all possible become a member today and ensure the future of your favorite programs that W. V. I. A. dot org\nAnd thank you for your support for W. V. I. A. [noise]\nOn Sesame Street enjoy sit at the science cuter curious George how 'bout shows like call the doctor Pennsylvania Florida or scholastic scrimmage whatever the reason you watch we want you to know that you make it all possible become a member today and ensure the future of your favorite programs at W. V. I. A. dot org\nAnd thank you for your support for W. V. I. A. [noise]\nThe Williamsport simply by ... it'll Stein opens October sixteenth with works by Racine each ... and Brahms\nGrammy nominated and chart topping violinist Caroline Golding plays Chuck ... violin concerto [noise]\nWilliamsport symphony October sixteenth other community arts at her five seven zero three to six twenty four twenty four or ... or sponsors who'd our capital group at my coming college\nLife from NPR News in Washington I'm more of a coalmine authorities in southeast usa that at least eleven people have been killed because of hurricane Michael\nVirginia authorities announced the deaths of five people today one of them firefighter Michael crashed into Florida's panhandle Wednesday as a category ... storm people evacuated are being told not to go home yet\nNPR's Greg Allen spoke with some Florida residents who rode out the storm where it made landfall on Mexico beach\nFew houses emerge unscathed from the hurricane to Mexico beach the strong one hundred and fifty five mile per hour winds tore up roofs walls destroyed entire buildings local sitter once quiet seaside town is now unrecognizable pet Hendricks says her house took a lot of damage from the store and from falling trees\nThe biggest thing is is um very large pine tree fellow or snap another pine tree or what is now part way in my bedroom\nShe shows us the hole in her bedroom ceiling where a pie and three now pokes through one man said he said because he thought he would be a category three store he falls forecasters for not holding people earlier the Michael would be a much stronger category for almost category ... storm Greg Allen NPR News Mexico Beach Florida\nGeorgia secretary of state is being sued by six civil rights groups has named Schama with member station WBUR a B. E. and Atlanta says thousands of voter registration applications are still pending little more than three weeks before the November midterm elections\nMore than fifty thousand voter registration applications are pending but the Georgia secretary of state Brian Kemp profits can filter running for governor of Georgia and faces criticism for what's called an exact match policy\nIt requires all registrations to match exactly what driver's license or Social Security information Daniel ... is with the campaign Legal Center in Washington D. C. which is suing Brian Kemp over the policy\nTens of thousands of eligible voters are flat for potential remove all based on a high here in the face there\nThe secretary of state's office says the soda can still do it at the polls with a photo ID according to the Associated Press nearly Seventy percent of these pending registrations are from African Americans for NPR News I'm ... Sharma in Atlanta\nTwenty years ago today college student Matthew Shepard was savagely beaten and left for dead on Wyoming highway he was targeted by two men because he was gay Sheppard died five days later now his remains will be interred at the national cathedral in Washington DC later this month\nHis father Denis says the family did not realize the violence and discrimination against the gay community until after his son was murdered\nWho is just an ordinary kid who wanted to make the world a better place\nAnd they took that away from\nThem from us shepherd killers are serving life prison sentences on Wall street the Dow Jones industrial average is up three hundred and forty nine points you're listening to NPR News\nFive days later now is remains will be interred at the national cathedral in Washington DC later this month his father Dennis ... says the family did not realize the violence and discrimination against the gay community until after his son was murdered\nWho is just an ordinary kid who wanted to make the world a better place\nAnd they took that away from\nThere from us shepherd killers are serving life prison sentences on Wall street the Dow Jones industrial average is up three hundred and forty nine points you're listening to NPR News\nA court in Turkey has ordered the release of an American pastor who's under house arrest after Andrew Brunson had been imprisoned for two years before he was moved to his home he was detained in twenty sixteen after a failed coup attempt in Turkey\nThe Trump Administration had worn turkey it would impose sanctions if Brunson was not freed\nFrom Francis has accepted the resignation of the archbishop of Washington admits scandals over how he handled sexual abuse cases from member station WBUR AMU Elly Yu has more\nCalls for cardinal Donald Wuerl to step down mounted after grand jury report in Pennsylvania this summer raise questions as to how he oversaw priests accused of sexual abuse world with the bishop of Pittsburgh from Nineteen eighty eight to two thousand six before leading the archdiocese of Washington\nIn a letter Pope Francis praised world thing we're all had quote sufficient elements to justify its actions that because of the Nobel any chose not to defend them in a statement world that the pope's decision allows the church to move forward\nAnd said he apologizes for any past errors in judgment the Vatican didn't name worlds replacement but that's in its day in a temporary role until a new archbishop is found for NPR News I'm Elly Yu in Washington\nThe head of Russia's space program says an American astronaut and Russian cosmonauts are back in the Moscow region yesterday they made a hard emergency landing in Kazakhstan after a booster rocket failed on their Soyuz rocket as they headed into space\nThe Russian space chief says the two crewmen will fly again Russian authorities also say that pay or are in great help\nOn corporate Coleman NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Roman does a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair a new episode every Friday on prime video\nGood morning here's the weather forecast for the W the IRA listening area some sunshine with temperatures today near fifty six degrees and wind gusts up to thirty five miles an hour plowed tonight with showers after midnight with temperatures near a forty degrees the chance of rain is Seventy percent\nSome showers into Saturday morning that partly sunny by afternoon with temperatures do fifty three the chance of rain and Seventy percent looking into Saturday Night cloudy then becoming mostly clear with ... with patchy frost temperatures near thirty five\nSunday looks mostly sunny with highs near fifty five Monday clouds of forty percent chance of showers with temperatures new fifty to some sun into Tuesday with ... fifty six\nPartly sunny Wednesday with a slight chance of rain with hides near fifty six Thursday partly sunny highs new fifty three\nFifty one right now under cloud cover at the Wilkes Barre Scranton international airport and it's ten oh seven at W. V. I asked them\nThe market plunges and President Trump signed the target to blame I think the fed is\nFor too stringent federal making a mistake stuff rice said it's despite that we're doing very well I ...\nThere are fifty six partly sunny Wednesday with a slight chance of rain with hides near fifty six Thursday partly sunny ... near fifty three fifty one right now under cloud cover at the Wilkes Barre Scranton international airport and it's ten oh seven at W. V. I. F. M.\n[noise] the market plunges and President Trump signed the target to blame I think the fed is\nFor ... [noise] and then making a mistake stuff right [noise] ed gets despite that we're doing very well\nI note that change will talk to a former fed official about what the president's attacks me for the institution this afternoon on all things considered from NPR\nNews New joined us from four to six to all things considered on W. veal hey\nProgramming on WB all your years made possible by our numbers we thank you for your support numbers and by dancing ... productions presenting solo piano George Winston performing of the dean center in wealth boroughs Tuesday October sixteen more information a ticket the torch Winston dot com\n[noise] good morning and welcome to classical music on WB I I'm a I'm ... glad to be with\nYou it is friday blessed that friday twelve to ... Eighteen and I hope your day is moving along smoothly anticipating a nice weekend we'll going to be on the chilly side but boy there's loads of things going on this weekend there is that wonderful Hiawatha trip\nOn the fourteenth if you want to have some apple dumplings you the story about the ... that's going to be happening in Williamsport\nCloser to the w._b. I studios a we have a lot of fun with a Julie Estee entered done more cemetery tour which will be taking place on Sunday as well that starts at two o'clock in the afternoon and every single year she always has a different story of different people and she has a whole wonderful cast of characters\nThat will surprise you once you start taking that tour so that's something I really am looking forward to going I didn't get a chance to go last week but this is the week then I'm going to take the tourist so I'm looking forward to seeing you Julie and the rest of the ... of the crew\n\n\nMm\n\n\n\n\n\n\nNa\n\n\nDon't know\n\n\n\n\n\n\nMm\n\nYeah\n[laughter]\n\nNa\n\n\n\n\n[noise]\n\n\n\n[noise]\n... [noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\nNo they just the real time restrictions and the ... music ... hon your heart's in information station\nProgramming on WB August made possible by our members we thank you for your support and by the whole ... ... there's more home improvement information the Home Depot dot ... this is your art permission station W. V.\nI say so what do we have in store for you as far as the weather forecast is concerned well it feels like Bob and we'll be throughout the course of this weekend all the way through next\nSo you'll be seeing now starting to change color things are going to take a little bit of a cold snap we even get a little rough on Saturday Night\nProgramming on WB I made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your orchard information station W. V.\nLike a a family [noise] so what do we have in store for you as far as the weather forecast is concerned well it feels like fall and we'll be throughout the course of this weekend all the way through next\nSo you'll be seeing the leaves starting to change color things are going to take a little bit of a cold snap we even might get a little from on Saturday nights Apache from\nAs far as the forecast for today we'll see some sun temperatures near fifty six degrees Saturday some showers with the temperatures near fifty two but then Saturday Night it says when maybe want to take your plants inside patchy frost with temperatures nearing thirty six\nAnd then on Sunday we'll see some sun with temperatures new fifty five right now fifty two degrees under cloud cover at the Wilkes Barre Scranton international airport\nThe music of Carl ... easy gr on WB I Am as we round out this Friday play let's get a clock or joining members of the Berlin radium symphony orchestra under his would slow pace ...\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]", "show_name": "Classical Music with Lisa Mazzarella", "year": "2018", "city": "Williamsport", "day": "12"}