{"month": "10", "state": "PA", "station": "WVYA", "content": "Support for do you come from the ... presenting mystery science theater three thousand on thirtieth anniversary tour featuring original host Greta Joel hops back is Joel Robin I'm Kirby center on Saturday October twenty seven five feet [noise]\nYou get caught up in the music or something like our favorite meals if so tune in for a new song fill a program that explores the music loud and motion pictures from every genre as well as on last kid bits of information you won't find anywhere else I promise our interests for Exxon notes on\nSundays it new on WB I Am Sam [noise]\n\nThis is your arts that information station W. V. I. eighty nine point nine of M. W. B. I. H. D. one scratching Wilkes Barre noodles and WTY eighty dollar coincide with other Williamsport W T I O eighty eight only three of them being hurt Mansfield W. P. A. you know the one point five al ...\nAnd that's how the university's W to ask you a be a point not have MC lives grows we're in Bethlehem at one of ... going on and this is listener supported public radio W. V. I. A. F. um\n\n\n\n\nLive from NPR News in Washington on core of a coalmine news reports say yet another suspicious package has been intercepted in Delaware mail facility it's apparently address to former vice president Joe Biden Democrat has a home in the area\nI mean among law enforcement officers in New York are investigating a suspicious package Japan earlier today at an address associated with the actor Robert Deniro nprcrowdsource long reports similar packages with explosive devices were recovered by authorities on the address is a top Democrats and the New York office at CNN\nSpokesperson for the New York city police department sets the package were said to address a link to a restaurant owned by Robert De Niro it was discovered early Thursday morning in Manhattan Tribeca neighborhood by pd says it looks similar to a package that police recovered from CNN New York offices that package contain an explosive device\nNear governor Andrew Cuomo told NPR's MORNING EDITION that law enforcement are trying to find out more about the baggage that did the nearest business address\nRestrict great New Yorker is also a political voice also spoken out on political\nWeek authorities had intercepted bombs Center for a president for rock Obama\nSo how does a political voice also spoken out on his political opinions\nThat week authorities had intercepted bumps into former president Brock Obama and former secretary of State Hillary Clinton on the long NPR News New York\nThe Dow Jones industrial average in the ... five hundred are poised for some gains when stock markets open in about half an hour stock futures are trading up despite its sell off and most Asian markets at NPR's Yuki Noguchi reports\nYesterday us sell off brought both the doubt an S. and P. back down to the same level where they started a year those declines were led by technology companies and the losses continue to ripple through Asian stocks overnight\nMost of the Asian markets closed down with Japan's Nikkei taking the toughest hit losing three point seven percent\nEuropean tech stocks started their days in a down as well but markets there have mostly rebounded dimmer forecast from corporate earnings and concerns about a slower global economy made investors jittery and the world's markets volatile ... NPR News Washington\nA Saudi Arabian prosecutor says the killing of dissident journalists democracy ... was premeditated that reverses the earlier claimed by the Saudi Government that is death was an accident NPR's Peter Kenyon says the latest shift came in a statement from the Saudi foreign ministry\nAfter insisting for two weeks they showed you left the Saudi consulate in Istanbul freely Saudi officials acknowledged his death saying it was an accident\nDuring a fight now that story is also been abandoned in the face of growing evidence for the killing was premeditated Eighteen people are under arrest in President ... they should be tried in Turkey\nNPR's Peter Kenyon automaker Ford says it's recalling about one point three million of its focus Compaq model there is a problem with the fuel system that could cause engine to stall affected Ford Focus models were produced from twenty twelve to twenty Eighteen It's NPR\nThe joy typhoon warnings that are set super typhoon YouTube has crossed over the Mariana island the U.S territory in the Pacific its current top sustained winds are one hundred sixty six miles per hour although there are reports the winds were much stronger when they passed over the islands\nA settlement has been reached in one state's legal effort to revoke the licenses of an operator of shelters for undocumented immigrant children from member station kj ... Matthew Casey reports on the deal between Arizona and the company called southwest key programs\nSouthwest key programs will Perez on a Seventy three thousand dollar fine surrender to stay licenses and stop taking in more immigrant kids that it's eleven remaining Arizona shelters until state officials say they can continue\nOverly economy as as what the un Cajun reunite families coalition which has demanded Arizona do more to protect children at southwest key facilities\nWhere especially glad that they instituted a third party healthcare consultant to secure compliance\nOne of the licenses southwest keep plans to give up his for a shelter that federal officials closed in September following allegations that workers had physically abused kids for NPR News I'm Matthew Casey and Phoenix\nThe national weather service says the first ... of the season will develop this weekend frontal systems are absorbing the remnants of hurricane Wilma and will spread thunder storms across much of the southern east coast by tomorrow\nAt the store and moves into New England by Saturday forecasters are predicting when treat precipitation along the coast\nI'm more of a Coleman NPR News\nFor NPR comments from NPR stations other contributors include Charles Schwab who believes in modern approach to wealth management starts with asking questions and providing straightforward answers\nThere's other contributors include Charles Schwab who believe the modern approach to wealth management starts with asking questions and providing straightforward answers Charles Schwab own your tomorrow learn more at ... dot com Andy any Casey foundation\nProgramming on WB I is made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your arts that information station W. V. like I Am\n[noise] next time I asked me that they're even later star ... square pants the Broadway musical tells us about the call that led to do it all and they said we have this audition for you can't tell you what it is technically be entitled to that land that project but we think you might be the right shape for it [noise]\nThey're doing Neil you're Eisenberg NPR's our pet those war games and trivia [noise]\nSaturday at all that but I Am on W. V. I Am\n\nGood morning here's a look now the forecast will see mostly cloudy skies today with hides in the upper forties\nIt'd be partly cloudy this evening that'd be coming mostly cloudy overnight with lower and lower thirty is\nFriday looks partly sunny early then becoming mostly cloudy in the afternoon with highs around fifty\nRain as likely on friday night with loads and the upper thirties or chance of rain is Ninety percent will also see wind gusts up to twenty five miles an hour and rain is likely once again on Saturday with ice in the upper forties our chance of rain as near one hundred percent and we'll see wind gusts up to thirty miles an hour\nSo it looks like a wet weekend to head for us here in the W. V. I. A. listening area well very good morning to you I'm ... she'll be long in just a little bit so we'll go ahead and get started with a classical music this morning with music by the Detroit symphony orchestra\nWith Paul portray conducting gets music of it off a dime\nAnd the name of the peace is if I were king on your arts and information station W. V. I. A. a family [noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\nThat's cool preaches on WB I asked him music republic decided to stop the between the talents of the on why Yangon markets how'd you hear on your arson information station\nComing up the exchange art gallery in bloom is mark from now through November night it'd be Glenn Klein exhibition and experimental videos show is that the exchange\nThan those blend client display examples of this imagined a tip and technically brilliant imagery all created digitally and printed on the canvas by Glenn himself and his commercial print shop experimental video showed the exchange gallery\nOr the by the experimental video artist did submit short videos word I was second video screening and it'd be like did they\nShop experimental video showed the exchange gallery or the by the experimental video artist to submit short videos words are we second video screening and the video ... will showcase eighty works from jewelry art is chosen throughout the globe\nThe show's going to run alongside the exhibition by two D digital artist ... mine that throughout the linked to the show the videos will ... monitors in the exchange archeology should be a really interesting visual experience\nThat will be happening once again in bloom spectrum now through the ninth of November interesting if you like some more details on this event or any of our events please feel free to give us a phone call at ... area code five seven zero six five five to eight zero eight [noise]\nUsually I play the holidays from the guitar concerto but today I feel like playing the entirety of this piece by a\nSort of ... this is his guitar concerto in a petri dish Academy of St Martin in the field funded the direction of I owned a brown paper on mental is guitar solo west [noise]\n\n\n[noise]\n\n\n\nNo\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\nThe\n\n\n\n\nMm\n\n\n\n\nWell isn't that pleasant to hear the entirety of the guitar concerto in a bystander down to ...\nI Know the last movie I can stand on its own but when you hear it all together just builds up the momentum lesson found that was taping mantle and the Academy of St Martin in the field funded the direction of I own a brown on W. V. I. A.\nThis week wait wait don't tell me celebrates Twenty years of pointing out how incredibly stupid to the news is Peter Segal and all I can say is we'll stop when did they do join us for it all started celebration but all I pedal is that right all of them\nAnd special gas gets declares that's just one year away from being able to buy the drink that's really neat after Twenty years of doing that wait wait for men feel [noise] Saturday morning at ten\nSunday evening at seven odd W. V. I. A. F.\nSupport comes from the times tribute for over a century the Tribune in Scranton is or northeast Pennsylvania with news and information that defines our community and charts our history as it unfolds delivered to your home or your mobile device the contributions there for you any PA news dot com\nProgramming on WB I is made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your art should information station W. V. like I have a family\nThere's more home improvement information at the Home Depot dot com this was your art should information station W. V.\nI. Pham\nWell you know as much as it's beautiful to listen to some symphonic music on WB I asked them and I'm so happy you enjoy it\nIt's even more fun to be able to go into a theater darkened theater and listen to some wonderful musicians put it altogether and perform some great classical music and you'll have that opportunity actually two opportunities with the northern tier symphony orchestra\nThey said they're all concert dates the first concert being November's thirtieth that the why of losing high school\nIn why loosing and then on December aids at the ... middle school on Franklin avenue in Titanic\nDirector Robert jobs are Robert helmet the has the capability fair planned out for you including music of ... and the wonderful like cavalry overture get up and go music\nSymphony number thirty two of 'em Mozart also music of holds on some of the planets will be featured holds will be doing they will do the orchestra will be performing Mars and Jupiter so you had to bring her job Mars is to bring a reward Jupiter to bring a ...\nA there'll be ... meditation from ... Sarah him get to a violent soloist\nAnd since we are getting into the holiday moods some music of everything Berlin So music ... Anderson some lovely things to get us on the path to holiday\nSo that's going to be November the thirtieth why loosing December eighth ... middle school the northern tier symphony orchestra\nFor more details you can give us a phone call area code five seven zero six by five to eight zero eight introduction themes of variations now ... Alex Klein joining members of the ... National Symphony orchestra\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\nW. P. A. U. Ninety One point five FM streaming live at W. B. A. dot org we're in Allentown ... three and a Bethlehem at well five point seven member supported public radio W. V. I. F.\nOne\n... one hundred two hundred even\nFour hundred and fifty years as we celebrate important birthdays or composers such as Oscar America to Charlotte who knows her old writes in Christian Airbus do light a candle with those we're honoring anniversaries this week on pipe dreams from American public media Michael Barone I Hope you'll be listening\nSunday Morning at six on WB I Am [noise]\nW. V. I. a public media presents Pennsylvania decision twenty Eighteen\nThe Pennsylvania eighth congressional district debate\nDemocratic congressman ... Republican congressional candidate John shrimp discuss the issues in front of pedal is an alliance theatre or you\nKnow the candidates before you vote the Pennsylvania eighth congressional district debate [noise]\nMonday up seven on WB I ate [noise]\nProgramming on WB I is made possible by our members anti Pennsylvania College of technology thinking about college hoping to land a great job after earning your degree think Pennsylvania College of technology\nWith one hundred plus bachelor an associate's degree it's an exciting career field industry standard labs in uh Ninety six percent graduation placement rate pen college is perfect for hands on learners visit P. C. T. dot edu to learn about Penn college degrees that work [noise]\nLive from NPR News in Washington on corporate Coleman additional suspicious packages have been found today in New York City and in Delaware one in Delaware was addressed a former Democratic vice president Joe Biden the one in New York was sent a liberal activist\nToday in New York City and in Delaware and want to Delaware was addressed a former Democratic vice president Joe Biden the one in New York was sent a liberal activist and actor Robert Deniro both are similar to several others suspicious package incentive to democratic officials are supporters this week\nNew York state governor Andrew Cuomo told NPR's MORNING EDITION investigations are underway\nTo have the actual police investigation who sent the packages fingerprints on the pay a postal inspection inspecting the devices themselves then you have a second level of investigation what his motivation\nPresident Trump is also set a robust federal investigation is underway this morning he tweeted that some of the anger in the U.S is the fault of the media he demanded that the media quote must clean up its act fast exclamation point\nGeorgia election officials have until noon today to file a response to a judge's order to accept absentee ballots with questionable signatures from member station WBUR a B. E. and Atlanta ... Sharma reports\nA federal judge in Atlanta says absentee ballots signatures that don't match what's on file must be accepted as provisional ballots Sean Young of the ACLU of Georgia represents one group of plaintiffs and says there were special concern for elderly and disabled voters\nI think the judge recognize that for many absentee voters whose ballots are rejected because if a signature mismatched many of them will be permanently disenfranchised because they cannot vote in person to cure that ballot\nIn total more than twenty two hundred absentee ballots have been rejected so far civil rights groups have filed lawsuits sitting secretary of state Brian Kemp over the rejections Kemp oversees elections and is the Republican candidate for Georgia governor for NPR News I'm ... I'm In Atlanta\nTexas based Exxon Mobil has been sued by New York's attorney general Lynch the energy giant defrauded shareholders by Mitt stating the risk of greenhouse gas emissions to the company from Dallas NPR's Wade Goodwyn reports\nThe legal action is the result of a four year investigation by attorneys general first a New York and then other states or whether Exxon Mobil engaged in a long running fraudulent ski what was the village game\nEssentially the company claimed that the cost of combating carbon emissions would be so high that no meaningful government restrictions could or would ever be implemented therefore investors didn't have anything to worry about and the company could pull as much oil out of the ground as it could procure\nExxon call the legal action against that ... to blaming Al Gore Democrats and environmental is Wade Goodwyn NPR News Dallas\nOn Wall street the Dow Jones industrial average is up more than one percent the NASDAQ it's up more than two percent this is NPR\nThe head of a un fact finding team says that genocide is still underway against me and Mars we're heading to Muslims his remarks came as the team presented its report to the U.N Security council in New York Michael Sullivan has more\n... the chairman of the fact finding mission told reporters that roe hang up are still fleeing Myanmar for refugee camps in neighboring Bangladesh and that hundreds of thousands who remain in Myanmar continue to suffer severe restrictions\nHe said sending Rohingya refugees back from Bangladesh would be tantamount to condemning them to life as subhuman and further mass killings the mission was a Security Council resolution to refer the matter to the international criminal court or in another tribunal\nBoth China and Russia are likely to veto any such effort me and Mars UN ambassador called the missions findings flawed biased and politically motivated and categorically rejected any genocidal intent\nMe and Mars UN ambassador called the missions findings flawed biased and politically motivated and categorically rejected any genocidal intent for NPR News I'm Michael Sullivan in Chiang Rai Thailand\nNew Jersey health officials say seven child has died from a viral outbreak at a facility that provides long term care to chronically ill and disabled children New Jersey health commissioner Dr Sharif el ... says the facility treats very fragile patients\nMany of these children normally breathe\nThrough a ventilator connected through something called a tracheotomy tube that goes right into your airway because of their underlying condition he\nSays the New Jersey health department will be on site until the outbreak is over again on Wall street the Dow is now up two hundred Seventy eight points I'm more of a ... NPR News\nSupport for NPR comes from NPR stations other contributors include St Martin's press publishers of them why we hate each other and how to heal a book from US Senator Ben Sasse about the state of politics and the country's future are available where books are sold\n\nGood morning here's the weather forecast for the W vi listening area will enjoy some sunshine today with temperatures near forty five degrees clear and cold tonight with lows near thirty three\nThen friday partly sunny in the morning giving way to clouds with temperatures near forty seven rain on friday night with temperatures near thirty eight the chance of rain is Ninety percent and it spilled over into Saturday when highest will be around forty five the chance of rain increasing to one hundred percent\nShowers on Saturday Night with loads near thirty eight Sunday looks cloudy with a chance of rain with temperatures near forty seven looking into a Monday more rain with highs around fifty Tuesday looks partly sunny with temperatures near forty six when they some sun highs near fifty two\nIt is forty three right now at the Wilkes Barre Scranton international airport and it's ten oh seven on your arts and information station W. V. I. F. M.\nThe Democratic nominee for governor in Illinois has contributed more money to his own campaign than any other candidate in history some voters don't like that\nIt's just distressing where you see these figures and I just feel like it makes people think that their democracy really isn't that money more\nMoney in Illinois politics slaps the latest on suspicious packages scented prominent Democrats\nThis afternoon on all things considered from NPR News [noise]\nHope you'll join us later today from four to six for all things considered\nProgramming on WB I is made possible by our members and bicycle Hannah university where the departments of theater and music will present the Tony Award winning ... October twenty fifth through the twenty eighth Showtime sorry seven thirty PM October twenty fifth twenty six twenty seven\nAnd two thirty PM October twenty eight and a sweater university ... center theater in the Charles ... campus Center for tickets called us go ahead of university box office and five seven zero three seven to ...\nGood morning and welcome to classical music on WB IRA and leaves them as a ... glad to be with you on this Thursday it's the twenty fifth of October twenty seven tier twenty Eighteen and I hope your morning is moving along productively getting things done that have to get done and having some music on in the background\nTo make the task a little bit easier well you know a lot of times we speak about how composers are inspired by nature when they write some lovely work\nAnd the there was no exception you know even though he really appreciated the talents of ... Wagner and Smith nah and used a lot of their influences in his composition he was\nYou know even though he really appreciated the talents of ... and used a lot of their influences in his composition he was also influenced by Mother Nature and today we're going to be hearing a it's a very sweet piece called impressions from the countryside\nIt's almost like taking a drive in the country or taking a look at nature maybe just kind of getting away for a little while\nAnd observing just what you see\nAnd according to this pressure from the countryside moonlight peasant dance you'll travel in the heights maybe have a fireside talk\nAnd then go to the village dance to wrap it all up so there's going to be that wonderful sense of the uh the ups and a little more mellow kind of a oh the impression from the countryside that you're going to be experiencing in this piece because much sympathy orchestra now with music ... as we travel into the country together on WB I\n[noise]\n\n[noise] Mm\n\n\n\n[noise]\n\n[noise]\n\n\n[noise] [noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n[noise] [noise] [noise]\n\n[noise]\n\n\n[noise]\n[noise]\n[noise] [noise]\n\n\n[noise]\n[noise]\n\nNo\nNo way you\n[noise]\n\n[noise]\n\n\n[noise] I'm In\nAnd the other new to them\nAnd then I\nDo\n[noise]\n[noise]\nWhat do you do\nA [noise]\n\n\n[noise]\n[noise] [noise] [noise] [noise]\n\n\n\n\nMm\nMm\n\n\n\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\nMm\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]", "show_name": "Classical Music with Lisa Mazzarella", "year": "2018", "city": "Williamsport", "day": "25"}