{"month": "10", "state": "PA", "station": "WVYA", "content": "Featured soloist ... Brian ... at Lucas leddy for tickets as the sea music dot org and at the door\n[noise]\nOh my goodness some bright music some delightful music featuring the talents of James go away on the very chilly morning and it's going to get chillier to wait until I tell\nYou the forecast that'll be coming up after the news from NPR and then after the news from NPR great classical music including his piece by the ... day [noise]\nWe'll that means the credits and we also have to say I'm going to know those but first knew\nThis was W. V. I. eighty nine point nine of M. W. vi HD once granted Wilkes Barre Hazelden W. B. Y. U. eighty nine point seven Williamsport WTO eighty eight point three of ... Mansfield\nWPRI you Ninety One point five FM Palmyra township and how to universities W que su eighty eight point on FM ceilings grove we have a translator in Wales ... three point five\nWere your arts and information station listener supported public radio W. V. I. A.\nAside from the latest news thoughtful coverage and balanced perspectives we also bring you\nA five week chess championship tournament in prison this tale starts with a fish called the ...\nNews of the highest went viral and the school was inundated with donated pumpkin [noise] that group that came from two black holes colliding [noise]\nIt's called all things considered for reasons listen every afternoon [noise]\nWeekdays at four weekends at five\nWashington encore of a cool and authorities in the U.S southeast say at least twenty six people have died because of hurricane Michael officials in Florida say at least sixteen people were killed in that state following the strongest storm to strike the area in fifty years NPR's Greg Allen reports twelve at the ... were in Bay county\nBay county in Florida's panhandle is where hurricane Michael made landfall with a sizable storm surge in one hundred and fifty five miles per hour winds some of the worst destruction is in Mexico beach or search and rescue teams have been combing through such destroyed homes with help of dogs and listening gear that's had been reported to Mexico beach it's not clear yet how many\nFlorida emergency operations center says twelve debts and bay county puts one death the neighboring Gulf county had been confirmed by medical examiner's under state law medical examiner's responsible for confirming and attributing Des occurring and their counties\nDebts from the storm of also been confirmed in Gadsden county ... county there were also deaths from hurricane Michael reported outside of Florida and Virginia Georgia in North Carolina Greg Allen NPR News\nA day after meetings in Saudi Arabia\nAnd Michael reported outside of Florida and Virginia Georgia in North Carolina Greg Allen NPR News\nA day after meeting in Saudi Arabia secretary of state Mike Pompeo is in Anchorage today for talks on the disappearance of Saudi journalist ... he met with Turkey's president and foreign minister NPR's Peter Kenyon says Turkish officials believe ... was killed in that Saturday constantly in its temple\nSaudi officials denied any involvement in the ... disappearance Turkish authorities say they have evidence to show that he was killed in search of the Saudi consul general's residence and diplomatic vehicles ... did not take place Tuesday as expected Turkey's foreign minister says the surge could be carried out today that conflict building with search Monday\nCould show ... is the Washington Post columnist and it's been missing for more than two weeks Russian officials say at least Eighteen people are dead and more than forty others injured at a vocational school in Crimea\nOfficials say the attacker was a student who later took his own life and here's Lucy and Kim reports from Moscow the Kremlin first said the bombing could be terrorism\nRussian state TV showing images of rescue workers at a vocational school and the Crimean town of courage Russia's national anti terrorism committee says the blast was caused by an explosive device criminal spokesman said president flooding they're putting expressed his condolences to families of victims and ordered investigators to determine what happened\nPurchase known for being on the crime inside of a new bridge connecting Crimea with Russia Russia annexed Crimea and twenty fourteen\nAfter occupying the Ukrainian province and holding a referendum that few countries have recognized Lucian Kim NPR News Moscow\nWall Street will open in about half an hour futures indicate stock prices may fall at the opening bell investors have new economic news the Commerce Department says construction on new homes dropped five point three percent last month as mortgage rates jumped to their highest levels since ... eleven\n[noise] this is NPR\nDemocratic congressman Beto O'Rourke up taxes went on the offensive last night in a debate against incumbent Republican Senator Ted Cruz Texas Public radio Dan cats report work borrowed a nickname President Trump used to mock crews and the twenty sixteen Republican primaries\nIt started when both candidates were asked for their opinions on a statement by Texas based Exxon Mobil that says the risk of climate change is clear and warrants action crews continue to express skepticism\nFar too many Democrats approach this issue not as a matter of science I think we should follow the science and follow the evidence but instead what they approach of that as a matter of government power they want the power to control the economy\nCaruso that ... vote in favor of a ten dollar tax on every barrel of oil O'Rourke denied us\nIs dishonest for the president called on line to and it's why the nickname stuff because it's for um for the climate is changing and man made climate change is a fact\nTrump is scheduled to campaign for Cruz next Monday for NPR News I'm Dan cats in San Antonio\nIt's now legal to use recreational marijuana in Canada the Canadian government is also pardoning anyone convicted of possessing thirty grams or less of pot now that the new law has taken effect\nThe un refugee agency is worried over Angola decision to expel about two hundred thousand Congo leads nationals in the past two weeks many of those being deported working the mining sector the government of Democratic Republic of Congo alleges ... of its citizens has been violent\nI'm core of a Coleman NPR News\nSupport for NPR comes from the financial services firm of Raymond James offering personal lives wealth management advice and banking and cap\nSupport for NPR comes from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial wellbeing first learn more at Raymond James dot com\n[noise] good morning here's the weather forecast for the w._b. I eliciting area a freeze warning is in effect from midnight tonight to ten am on Thursday some sun with a chance of showers this afternoon with temperatures near fifty three\nThen tonight partly cloudy with a slight chance of some rain and a slight chance of snow showers after midnight lows will be around thirty three by Thursday some sun with hides near forty five\nThursday evening clear with temperatures near thirty three friday look sunny with ... fifty six into the weekend cloudy Saturday with a chance of rain with temperatures near fifty six Sunday looks mostly sunny with temperatures near forty five\nMostly sunny on Monday with highs near forty eight and Tuesday the partly sunny a slight chance of some of some showers temperatures will be around fifty three degrees\nForty one right now at the Wilkes Barre Scranton international airport\nAnd it's nine o seven on your arts and information station W. V. I asked them\nProgramming on WB I made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your orchard information station W. V. A. F. M.\nEmbracing covered so many um frisk 'em all the meaning of all the shipping unfairly too we offer a fly the in France for over a view of a largely an celebrated repertoire\nFive hundred years of ... music this week on pipe dream from American public media Michael Barone I Hope you'll be listening\nSunday Morning at six on WB I Am\nSupporting W. V. I. N. E. Y. Z markets resenting the ... bytes tip of the week every Friday afternoon it for on W. V. on ... do you want to boost your immune system just weeks healthy by tip shares three foolish to help boost your body's natural defense\nA very good morning to you this is Lisa ... glad to be with you on this Wednesday the seventeenth of October ... Eighteen a little on the chilly side this morning but it's fall and it's Chris out there and it's one of these warnings where you get up and it's just nice to have that nice cool air\nA wake you up before you have that cup of coffee it's a wonderful season and even a wonderful day for you to make even better with classical music because we have a lot of a plan for you all the way up until four o'clock so let's get started\nSome Swedish festival music now of August ... on WB IRA members of the Swedish radio symphony orchestra performing under ... um W. V. I. F. them\n[noise]\n[noise]\n\n\n\nOh yeah\nMm\nMm\nMm [noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\nYou think of a steep Spanish dance number nine members of the mosquito tonia performed on your arts and information station in east coast\nHey good or not or the Spanish dance number nine members of the ... said tonia performed on your arts and information station\nIt is cold out there today and it's going to be getting colder we have a freeze warning in effect tonight temperatures dropping down and frost and maybe a few snow flurries in our forecast depending upon where you live\nBut it does remind us of the colder weather is coming and many of us were very fortunate to go to our homes or apartments have the heat on earth some nice warm blankets and just kind of hunker down and get ready for the colder colder weather with our people in our area that maybe don't have\nWhat we have and that's why the Wayne County public library ... among a phenomenal program called project lightness\nAnd they called themselves the blanket tears or you can become one of the Wayne County public library and help people in need by making blankets for children now know sewing skills are necessary teens and adults are welcome the blankets go to local shelters are and the way in Memorial Hospital\nSo it really is nice to be able to have something homemade that you've done as maybe a group or maybe you brought your friends down and you did it at the library knowing that it's going to go to someone who maybe you don't even know\nAnd give them some warmth and some comfort during the cold season it's going to be on friday October the nineteenth November the sixties and December the fourteenth those are the three dates the blanket tears are going to be meeting at the library from four to five forty five\nPlease register by contacting Danielle at five seven zero to five three one two two zero and become a blanket tier keeping everybody warm this winter season as apart project lined up the Wayne County public library\nSo music ... see on your arts and information station today we feature and ... concerto results that came from a very very musical family grandfather was a a would wind player as what's his father so it just seemed to the natural that\nThe ... theme was also involved in music in some form or fashion not only as a performer because he did perform in chamber orchestra that even under the baton of Beethoven\nBut he also wrote some great music to for the instrument and today we're going to be hearing one of his own book and charity\nThis is his ... concerto in gee on WB I a yawn the dominance joining members of the ... of the ... chamber orchestra\n[noise]\n\n[noise]\n\n\n\nWonderful music up ... seats today we heard a performance of his ... concerto in G. featured young dominoes to oboe soloist and members of the silk chamber orchestra here on your arts and information station\nLeave all the road some fine hundred concerto but he poured you challenge it jumped one for the solo mandolin on the next Chicago Symphony orchestra program mandolin I'll be I'll be town performed in\nPlus heightened drum roll symphony next time with the CFL\n[noise] ... minutes on the on the town for fun and\nPlant heightened drum roll symphony next time with the CFL I mean since any on\nSunday at ten pm on WB I Am [noise]\nProgramming on WB on young is made possible by our members we thank you for your support members and buying a Home Depot there's more home improvement information at the Home Depot dot com this is your arts that information station W.\nV. like Sam\nReceiving a word from the Catholic choral society as they begin the Seventy its season and they wish to convey decent Sears depreciation to you when the pastors and stand that members of the parishes\nOut for the continued support and cooperation over these last Seventy years they're going to be performing the generations seeing ... said this is the seventeenth generation seeing concert on Sunday evening November method it's seven thirty\nAnd saint Peter ... Scranton and as in past years this year's concerts trying to sell the ... and both ... medical diversity\nIn multigenerational singer\nSo the Catholic World society is marking it's Seventy it's these and that is huge\nAnd it's ... comprised of more than fifty members symbols Lucerne Lackawanna Wayne hike Wyoming and ... and they will be other courses joining them in celebration out this Seventy ... year\nSo we'll keep you posted its November eleventh seven thirty it's going to be at St Peter's cathedral in downtown Scranton lots of wonderful vocal music teaching these very talented thing is from all over the place that celebration at Seventy years I sneeze\nMusic now a front you see in hiding and I'm Dante with variation Frederick mall you're at the keyboard and double ...\n[noise] [noise] [noise] [noise]\n\n\n\n\n[noise] [noise] [noise] [noise]\n\n[noise]\n\n\nStreaming live at W. V. I. A. dot org we have a translator in clock so much at Ninety three of them you're arts any information station listener supported public radio W. V. I. S.\nWhat percent of the food in American supermarkets do you actually think is\nFood the definition of food is something that sustains and nurses yet as nourishment is something that increases your health so forty percent of the stuff in American food markets wouldn't qualify as food like\nForty percent wouldn't qualify sued right how we connect with our food that's next time the Ted radio hour from NPR\nSaturday at noon on WB I Am that\nMm [noise] like what you see on W. V. I. A. you enjoy fine programs like pull dark knows that we're nature\nYour kids love watching the antics of Elmo on Sesame Street enjoy sit in the science kid are curious George how 'bout shows like called the doctor Pennsylvania Florida or scholastic scrimmage whatever the reason you watch we want you to know that you make it all possible become a member today and ensure the future of your favorite programs that W.\nV. I. A. dot org and thank you for your support for W. V. I. A.\nThere's something about this place [noise] something special call it what you will or history our values or lifestyle here we haven't forgotten [noise] to care [noise] singer is going to be one of the most scientifically advanced an innovative health care organizations in America but we've never\nForgotten where we come from we care it's such an old idea it almost seems [noise] or new [noise]\n\nAnd when hurricane Michael now blamed for at least twenty states debts authorities in one county in the Florida Panhandle are raising the death toll there the area in ...\nNow blamed for at least forty six deaths authorities in one county in the Florida Panhandle are raising the death toll there the area includes Mexico beach in Panama City where damage to homes and businesses is extensive NPR's Debbie Elliott has more\nMost of the storm related deaths are reported in Bay county along the coast where hurricane Michael made landfall search and rescue efforts are still underway thousands of people have been reported missing a high number in part because of fracture communication system\nNPR's Debbie Elliott Michael came ashore in the Florida Panhandle is a strong category for hurricane\nSecretary of state Mike Pompeo is visiting ... where he talked with Turkey's president and other leaders they're reviewing the case of missing Saudi Arabian journalists Jamal ... Turkish officials have said they believed to show if she was murdered after he went inside of Saudi conflict and never emerged\nSaudi Arabia denies that Pompeo visited Saudi leaders yesterday and says the Saudi Government is investigating\nPresident Trump is threatening to cut aid to any country that helped hundreds of Honduran migrants now walking toward the U.S southern border Maria Martin talked with the director of a migrant shelter housing the Hondurans who are passing through Guatemala City\nFather mode of upset if they hit ... a shelter no housing nearly a thousand migrants from Honduras he says more are expected on Wednesday and describes what he's seen as a serious humanitarian crisis\nYou know that I wanted that you'll lawyers said\nThe Trump Administration is threatening to cut off aid to any country that helps the so called march of migrants including Guatemala and Honduras\n... don't go through the ... syndrome that it goes along with it by the rules of equal\nThis priest who's worked with migrants for over Twenty years says if he'd had really gone to help the poor these hundreds of people would not be fleeing from violence and poverty for NPR News I'm Mark\n... the European Union had hoped to approve a breakfast agreement at their summit taking place today in Brussels but it's very shields reports talks are at a standstill with just over five months to go until Britain's departure from the block\nEuropean Council president Donald Tusk says he has no grounds for optimism that the jammed Brexit talks will be resolved at this meeting he leaders ask the British prime minister Theresa May come with new proposal or risk leaving in March with no deal\nThe biggest hurdle is a settlement on held the border between ... member Ireland and the u._k. Northern Ireland can remain open for trading in traffic\nThat you would like Northern Ireland to stay in its customs union but May's government says that's not a long term solution there were reports the un willing to extend the transition period by a year in exchange for British concessions on the border issue for NPR News I'm Teri Schultz in Brussels\nOn Wall street the Dow was down more than two hundred points this is NPR\nRussian officials say a student in a vocational school in Crimea attacked other students today killing at least Seventeen people and wounding more than forty others he then took his own life there have been differing accounts of what happened\nRussian officials first suspected terrorists bombing now report suggests some of the victims may have been shot to death\nProtesters are rioting outside of Hindu temple in southern India to try to prevent women from entering NPR's Lauren Frayer reports from Mumbai the temple reopen today for the first time since India's Supreme Court ordered it to admit women [noise]\n\n[laughter]\nThe now TV reporters covering the reopening of this temple in the state of ... are among those who've come under attack by protesters Hindu temple is dedicated to celebrate deity women between the ages of ...\nThis temple in the state of ... are among those who've come under attack by protesters Hindu temple is dedicated to celebrate deity women between the ages of ten fifty were banned from worship but last month India's Supreme Court ruled that discrimination\nThousands of police are surrounding the temple to ensure the safety of female worshippers but protesters have blocked their access and hard line Hindu groups are threatening mass suicide by self immolation if women are allowed to enter Lauren Frayer NPR News Mumbai\nThere was no winner drawn in last night's mega millions lottery the jackpot rolled over it is now swelled to eight hundred sixty eight million dollars in the press says that the second largest jackpot in us history it's the biggest ever for the mega millions the next drawing\nWill be on friday on corporate Goldman NPR News\nSupport for NPR comes from NPR stations other contributors include Subaru featuring the all new three rows sense with feeding for up to eight and a choice of second row captain's chairs love it's what makes it super super learn more at ... dot com\nGood morning here's the weather forecast for the W vi listening area we have a freeze warning in effect from midnight tonight to ten am Thursday\nSome sun today a slight chance of some rain this afternoon temperatures will be around fifty three degrees clouds tonight with a slight chance of showers than a slight chance of snow showers after midnight loads near thirty four\nBy Thursday some sun with temperatures near forty five\nThursday evening clear and cold with low near thirty three wind gusts up to twenty five miles an hour sunny when a sunny friday with temperatures near fifty five\nLooking into the weekend we will see some sun with a fifty percent chance of rain and temperatures near fifty six Sunday looks mostly sunny and cold temperatures near forty eight and then on Monday mostly sunny with highs near forty seven looking into Tuesday as a slight chance of some rain with temperatures near fifty three\nForty three degrees right now and clear skies at the Wilkes Barre Scranton international airport it's ten oh seven at W. V. I asked them\nWe'll [noise] stories with\nWomen's rights and escape from your mother tells you you're going to go alone to the United states are was really hard stupid that changed the world in my career changed what was impossible is now possible and people change each other's [noise]\nWhat do you want to say is shaped [noise]\nTuesday October thirtieth on WB TV\nProgramming on WB I made possible by our members and by Pennsylvania College of technology thinking about college hoping to land a great job after earning your degree think Pennsylvania College of technology\nWith one hundred plus bachelor an associate's degrees an exciting career fields industry standard labs in uh Ninety six percent graduation placement rate pen college is perfect for hands on learners visit P. C. T. dot edu to learn about ten college degrees that work\nMorning and welcome to classical music on WB I I'm a I'm ... glad to be with you on this Wednesday as we celebrate the mid week platelets together\nWe heard some great music and the first hour and I hope it helped you along as you were maybe at your desk or maybe you were home doing something or perhaps maybe at a studio trying to create\nAnd maybe some of the music what was a little bit of an inspiration for you and help to get the tasks done a little easier at least that's what that's my hope and\nMusic what was a little bit of an inspiration for you and help to get the task done\nA little easier at least that's that's my hope at any rate though when the ten o'clock hour we have another a lovely a hour for you plant as well as to uh some tickets to give away too we have some great things going on in our area and we'll get into that in just a little bit\nBut first a flu concerto video ... down there\nHe was born three years after roe Seaney and two years before don't need that the so he was in a very good place yet that he didn't really have the theme that don't need that the order of the new head but he did do a tremendous amount of work\nAnd today we're going to be hearing a a fluke and chair of ... the the concerto in e light and bright and filled with optimism James go away joining members of east ... under cloudy ... it's music America dumping on WB I\n\n\n\n\n\n[noise]\n[noise]\n\n... ah\nDeal\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\nLovely music ... divorce ... grill man opens in that and he gives will come in and members of the saint Paul chamber orchestra on W. V. I. S. and\nSupport for WBAI comes from the citizens for providing loser in county was breaking news every day for the past forty years the citizens voice thanks their readers should receive news at home or on the\nCitizens voice here to stay more information at citizens voice dot com\nWell weather forecast that we will have an update in just a few moments after the news from NPR\nOh we have a freeze warning in effect in our region tonight temperatures dipping down to the Los thirties and colder weather that cold snap continuing ... by the end of the week though things warming up slightly ... fifty right now it is forty five degrees but the Wilkes Barre Scranton international airport\nWe have some music for you to take us up to the top of the hour the latest news from NPR after which Erica funky an art scene in more find classics Larry Waco then will join National Public radio again for all things considered fresh air with Terry Gross jazz was George Graham\nAnd of course Paul bizarre to be on a pow keeping you informed from the w._b. I used to ask a lineup is here and we're ready to not only entertained formula hopefully and richer life today [noise]\nGerard Schwartz in the Seattle Symphony orchestra now with music Charles script it's a pleasure do the coupon ... he was he I asked him\n[noise]\n\n\n\n", "show_name": "Classical Music with Lisa Mazzarella", "year": "2018", "city": "Williamsport", "day": "17"}