{"month": "10", "state": "PA", "station": "WVYA", "content": "Our producers are Michael Lipton kitty long and Daniel ... New York I'm David Brancaccio with the marketplace morning [noise]\nFrom a PM American public media programming on WB I is made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your arts that information station W ...\nProgramming is made possible by the wonder stone gallery mindful gift shop yoga studio for own levels art gallery and casting offering coffee and loose leaf tease more information about the wonder stone gallery and there are vents at the ones who stone ... dot com\n\n\n\nIt's a great day but when you hear music like this kind of picture just a little bit though doesn't it\nIt means to go from chrome or did they were going to be hearing his party that in every major in this hour classical music coming up music at home mom and a piece by cuddle of insulting plus lots of fall activities happening in our region will keep you posted but first new next [noise]\nThis was W. B. I. eighty nine point nine up him W. B. I. H. D. once rented Wilkes Barre Hazelden WTY eighty nine points that would have had Williamsport WG audio eighty eight points ... Mansfield W. P. or you know the one point five FM Palmyra township ... how to universities W que su eighty eight point of mc ... grove\nWe have a translator induce forget one hundred point one your arts and information station listener supported public radio W. V. I. A. F. him\nOn the next fresh air had terrorists governments political campaigns and even street gangs are using social media to push propaganda and disinformation and fear with real world consequences\nWe talk with the W. singer and Emerson working authors of the new book like war the weaponization of social media China [noise]\nThis evening at six after all things considered on W. V. I Am [noise]\nLive from NPR News in Washington encore of a Coleman the national Hurricane Center says hurricane Michael is now a category ... storm in the Gulf of Mexico with top sustained winds of one hundred miles per hour it's four kept to strengthen and become a major hurricane category three more stronger\nMichael is less than four hundred miles away from Florida's panhandle that's where jets the heat is preparing his home near Pensacola for storm surge\nThe plastic up over the garage and since their legs up and walk the front door and um\nWe've got a garage sale of ours levels and we'll try to keep the water out of their\nResidents along the curved ... part of Florida's Gulf Coast or Big Bend or being warned to expect\nCategory ... storm in the Gulf of Mexico with top sustained winds of one hundred miles per hour it's four kept to strengthen and become a major hurricane category three more stronger Michael\nIs less than four hundred miles away from Florida's panhandle that's where jets the heat is preparing his home near Pensacola for storm surge\nBoth plastic up over the garage and since that bags up and walk the front door and um [noise]\nWe've got a garage sale averse levels and we'll try to keep the water out of their\nResidents along the curve ... part of Florida's Gulf Coast or big band or being warned you expect as much as a ... foot storm surge some areas of the Florida Panhandle are under mandatory evacuation\nNewly confirmed Supreme Court justice Brett Kavanaugh takes his seat on the high court today for the first time he was confirmed Saturday and had a ceremonial swearing in last night at the White House cabinet has been studying legal brief to prepare for today's oral arguments\nTurkey says Saudi Arabia it needs to prove that missing Saudi journalist laughter Saudi conflict in ... as the Saudi Government claims the Turkish foreign ministry said authorities will search the Audi consulate NPR's Peter Kenyon reports journalist ... has been missing for a week\nSpeaking during a visit to hungry president reject type air to once said prosecutors are looking into ... disappearance including the arrival of more than a dozen Saudis ... on the day the journalists disappeared\nEveryone said Seventy consulate officials can't get away with saying he left the building addressing the Saudis air to one added if he left the building then you need to prove it\nInvestigators suspect is Yogi was either spirited out of the country by the Saudis or killed inside the consulate Saudi Arabia denies the allegations President Trump says he's concerned by the ... disappearance Peter Kenyon NPR News Istanbul\nThe international Monetary Fund is cutting its forecasts for global growth NPR's Giles Schneider reports the IMF blames rising interest rates and trade tensions\nThe IMF has revised its forecasts from July when it said the global economy would grow three point nine percent this year it smelled cut that down a couple of nachos downgrading expectations for this year and for twenty ninth team the IMF now says the global economy will grow at a three point seven percent clip\nThe IMF loved us economic growth on change for the rest of this year but cut the U. S. is twenty Nineteen forecast a two and a half percent because of the trade tensions with China\nThe revision to the global forecasts was issued on the resort island of Bali as annual meetings of the IMF and World Bank get underway this week\nTrials later NPR News Washington\nThe White House says that musician Kanye West will have lunch today with President Trump and top aide Jared Kushner west and his wife Kim car Deschene visited the White House earlier this year you're listening to NPR\nNow that said the renowned Hubble Space telescope had shut down into the smoke that's because a piece of equipment a gyroscope failed last friday scientists are not able to point the telescope in the direction they want to look out science observations have since been suspended\nThe president of the Philippines where there go ... does not have cancer to administration officials said today last week they disclose he'd gone protests at a private hospital and raised the possibility of having cancer Michael Sullivan has more\nMinister Eduardo on your told reporters do differently informed cabinet ministers of the test results at a meeting Monday Night last week dude it they said he'd gone to the hospital for more test after an ... last month the test results on you said came back negative for cancer\nDue to a spokesman Harry rockets at the public doesn't need to know more about the condition that not Syria\nAnd officials said today last week the Tour de disclosed he'd gone protests at a private hospital and raised the possibility of having cancer Michael Sullivan has more\nInterior minister Eduardo on your told reporters do you have to be informed cabinet ministers test results at a meeting Monday Night last week dude hippies that had gone to the hospital for more test after ... last month the test results on you said came back negative for cancer\nDo did they spokesman Harry rockets at the public doesn't need to know more about today's condition or that's not serious under the constitution of our president is unable to serve the vice president by law steps in until the six year term is over vice president Lyndon ... elected separately is a political opponent of ... and his war on drugs\nDo their days mused publicly about being tired of the job and stepping down but not he said if we're ready to or to succeed him for NPR News I'm Michael Sullivan in Chiang Rai Thailand\nDisaster officials in Indonesia now say more than two thousand people have died from last month's earthquake and tsunami on the island of ... most of the deaths during the provincial capital Paolo a coastal city that felt the full effect of the disasters I'm more of a Coleman NPR News\nSupport for NPR comes from a campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email to ... a drag him drop email editor and twenty four seven customer service more at a campaign monitor dot com and Americans for the arts\nGood morning here the weather forecast for the W vi eliciting area some clouds this morning then becoming partly sunny temperatures near Seventy eight degrees then tonight them clouds would fall after midnight with loads near sixty three Wednesday looks pop partly sunny with Apache fog in the morning with temperatures near Seventy eight\nBy Thursday showers and thunderstorms with temperatures and you're Seventy two the chance of rain is Ninety percent looking into friday the son returns with hides only around fifty five\nSaturday clouds with temperatures near fifty to Sunday partly sunny with ... fifty six and looking into a Monday some clouds a fifty percent chance of rain highs near fifty seven degrees right now it is sixty seven degrees at the Wilkes Barre Scranton international airport\nAnd it's nine o seven on your heart's in information station W. V. I. F. M.\nJoined us for a celebration of one hundredth anniversary of the birth of letter\nFriday afternoon at three Gary and burn it at all with Richard McDonald's\nThat includes the stage where you can do it when like Lori as well as early as I've written on WB I ate out of the Dietrich theater invite you to enjoy the concert or donate theater make reservations or for their own five five to eight\nThat sounds like a wonderful concert and we certainly hope that you are stopped by you can make a reservation on line or give us a call we'd be happy to welcome you to our studios\nA very good morning to you this is Lisa ... glad to be with you on this Tuesday it's the ninth of October twenty Eighteen little overcast but didn't credibly mild out there kind of feels like spring rather than the fall\nThat will take it it's a good day it's a new day and it's also filled with new possibilities and if it's the first time you're listening to the station welcome aboard if it's going to be at peace that you're going to be discovering today on the show that's great too\nUh but if you've been listening to the station for a while maybe you've heard this before maybe it's worth hearing again because it's one of these get up and yet Adam overtures the overture to a mall by till ma and this is the kind of peace that allows\nNine of October twenty Eighteen little overcast but didn't credibly mild out there kind of feel like spring rather than the fall\nThat will take it it's a good day at the new day and it's also filled with new possibilities and if it's the first time you're listening to the station welcome aboard if it's going to be at peace that you're going to be discovering today on the shelf that's great too\nUh but if you've been listening to the station for a while maybe you've heard this before maybe it's worth hearing again because it's one of these get up and yet Adam over church the overture to remove by Tacoma\nAnd this is the kind of peace that allows you to pick up a fork pencil or whatever wherever you are or whatever you happen to be doing\nAnd conduct the invisible orchestra because as soon as it picks up momentum you're just going to feel tempted to do just that\nThe Montreal symphony orchestra now doing the honors the overture to a mall I'm double ... [noise]\nAbout dissidents or any of the advance you can go on to Facebook holy harvest tone down and look at it all to get information and hopefully a list of the days to what the whole as far as to what you can do ... what specific times\nAlways a very welcoming place wholly and just lovely lovely time of the year to get out and enjoy so we certainly hope you do that Saturday October thirteenth seven thirty at the rich theater in downtown holy\nJust that just ahead we have music in Beethoven and now with the ... not on a piano sonata and we have John O'Connor at the keyboard with the performance of the ... n G minor number Nineteen on WB I asked them ...\n...\n... ...\n\n\n\n\n[noise] [noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n\n\n[noise] [noise]\n\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise] [noise] [noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[laughter]\n\n[noise]\n[laughter] [noise]\n\n[noise]\n\n\n\n[laughter]\n\n\n\n[laughter]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[laughter]\n\n[laughter]\n\n[noise] [noise]\n[noise]\n[noise]\n[noise] [laughter]\n\nMm\n\nMm Mm\nMm Mm Mm\n\nKansas John O'Connor with music and the children to not in a big Nineteen eighty nine or do you run your are you from each state should be\nMm Mm\nMm\n\nPianos Joan O'Connor with the music of Beethoven piano sonata number Nineteen energy minor here on your arts and information station\nComing out the answers\nLike opera company will be will be presenting a program that title hodgepodge three\nAnd to show featuring classical pieces from Oprah and other Broadway to its on Sunday November eleventh to three o'clock struck it by ... founder Gary Richard and it will be at St Peter's Lutheran Church kept the corner of ash street a tailor avenue that's one time the container avenue in Scranton\nUh some wonderful performance to what the professional or semi professional singers and other fine performance from the northeastern Pennsylvania area there'll be a special against your special gas plural\nWho'll be performing and or the barbershop quartet vocal accord\nAnd a ... there'll be a delightful addition to the festivities hodgepodge three\nThat's going to be taking again take place again on Sunday November eleventh at three and it will be at St Peter's Lutheran Church on the corner of cash and Taylor streets inscribed ... if you'd like some more details please feel free to call the station area code five seven zero six five five to eight zero eight\nNah [noise]\n\n\n[noise] [noise]\n[noise]\n\n\n[noise] Mm\nMm\n[noise]\n[noise]\n[noise]\n[noise]\n\nIn ah\nMm\nMm [noise]\n[noise]\n[noise]\n\nNah nah nah\n\nMm\nMm [noise]\n\n[noise]\nMm ...\nNa na na na\n[noise] [noise] [noise]\nI\nDon't want to know more more more [noise]\n\n[noise]\n\n[noise]\nNo no no no no no\n[noise]\n[noise]\n[noise]\nNah\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise] [noise] [noise]\n\n\n[noise] [noise]\n[laughter]\n[noise]\n\n[noise]\n\n[laughter]\n[noise] [laughter]\n[noise]\n\n[laughter] [noise] [laughter]\n[noise] [laughter]\n[noise]\n[noise] [noise] [noise]\n[laughter]\n[noise]\n\n[noise] [laughter]\n[noise]\n\n[noise] [noise]\n\n\n[laughter] [laughter] [laughter] [noise] so\nWhat ... what what what are\nSome things too [noise]\n\n\n[noise] [noise] [laughter]\n[noise] [laughter]\n\n[noise]\n\n\n[noise] [laughter]\n[laughter]\n[laughter]\n[noise]\n[laughter]\n\n[noise] [laughter]\n[noise]\n[laughter] [noise]\n\n\n[laughter] [noise]\n[noise]\n[laughter]\n[noise] [laughter]\nNo\n\nIt was fun to hear after a long time music of phones chrome or and the ... members of Budapest twins performed on W. V. I. S. and\n\nUp in our community from now until the twenty seventh of October the ... it's the only one\n[noise]\n\nIt was fun to hear after a long time music ... chrome or and the parties I N F members of Budapest twins performed on W. V. I asked them\n\nComing up in our community from now until the twenty seventh of October the ... Burke haunted house it's the only haunted house attraction in Pennsylvania that includes a hunted pathway through the woods and then to walk through two story haunted house and seller\nSo it sounds like a lot of fun and it sounds like a lot of screams and scary stuff to just in time for Halloween if you'd like some more details the elites Burke haunted house in elites bird check Facebook for details or a log onto used brick haunted house\nAnd like all the time and so forth that you can go and get frightened [laughter] although we just in time\nAnd our weather forecast we had some very mild temperatures today with ... Seventy three actually a little bit higher and you're Seventy seven tomorrow but then we are going to be taking a little bit of a ... as far as the temperatures are concerned by the weekend sweater weather with temperatures in the fifties\nRight now though it is sixty six degrees on the music of your home Sebastian Bach right after this\nBreak him a doesn't think elections are good for democracy is fundamentally flawed and I'm not sure if\nThey could be a good idea replace politicians with randomly selected citizens work when people do\nJust a heads up at the northern tier symphony orchestra is going to be having a meet and greet and also in opening her sulfur interested musicians area musicians it's going to be at the ... middle school auditorium on Franklin avenue on friday October nineteenth beginning at seven thirty\nStrings are welcome all instrumentation welcome and the music they're going to be working on mode types of sympathy for thirty two for like ... overture from month to pay and hold the planet Mars and Jupiter will be performed he likes them more details you can call us here in Studio ... area code five seven zero\nSix by five to eight zero eight or find music to come\nVisit is W. V. I. S. eighty nine point nine ... found W. V. I. H. D. one granted Wilkes Barre he's open in Williamsport W. B. Y. eighty nine point seven have em in Mansfield WTO eighty eight point three I found out at like ...\nW ... Ninety One point five FM streaming live a W. B. A. dot org we're in our town to not eat on point three any Bethlehem at one of five point seven members supportive public radio W. V. I. S.\n\nSan Francisco offered presents Andrea ... who Giordano tale of a poet and a young noble woman causing the turmoil of the French Revolution music director Nicola Louis on the lead to international cat [noise] teaching young who leave\n... George got an e bay and Janine bridges join us for Andrea ... on this station [noise] Saturday afternoon it was\nLike what you see on WB I Do enjoy fine programs like pull dark no vote were nature be your kids love watching the antics of Elmo on Sesame Street enjoy sit at the science cuter curious George how 'bout shows like called the doctor pencil\nIn music director Nicola Louis on the leads an international at teaching young who leaves\nOn up there on St George gotten the day and Janine bridges join us for Andrea ... on this station [noise] Saturday afternoon it was\nLike what you see on WB IRA you enjoy find programs like pull dark nova or nature of your kids love watching the antics of Elmo on Sesame Street enjoy sit in the science cuter curious George how 'bout shows like call the doctor Pennsylvania Florida or scholastic scrimmage\nWhatever the reason you watch we want you to know that you make it all possible become a member today and ensure the future of your favorite programs that W. V. I. A. dot org\nAnd thank you for your support for W. vi\nMine from NPR News in Washington I'm core of a cool when hurricane Michael is less than four hundred miles away from Florida's Gulf Coast and getting stronger it's a category ... storm with top sustained winds of one hundred miles per hour Florida governor Rick Scott is urging people in evacuation warning areas to get out today\nDon't take a chat hundred and twenty mile hour when\nWe're going to have twelve inches of rain in some places but twelve feet potentially a storm surge do not take a chance\nThat hurricane forecasters expect at the center of hurricane Michael will make landfall tomorrow and then cross Florida\nIt will degrade into a tropical storm as it moves across and Georgia man the Carolinas before accepting into the Atlantic ocean parts of that same region are still recovering from Hurricane Florence\nBrett Kavanaugh takes the bench today for his first arguments since the Senate voted narrowly to confirm him to the Supreme Court on Saturday NPR's Carrie Johnson reports the new justice spent the weekend working\nBrett Kavanaugh and his family appeared at the White House Monday evening for a ceremonial swearing in ceremony but he's mostly been studying up for his new job\nKavanaugh's hired for women clerks a first for the Supreme Court and a source close to the justice says he's been reading briefs to get ready for oral arguments\nHis first cases involve what kinds of crimes sugar mandatory prison sentences under the arm career criminal act Kavanaugh's confirmation opens up another seat for the White House to fail on the prestigious federal appeals court in Washington Carrie Johnson NPR News Washington\nSouth Korea says North Korean leader Kim Jong un wants Pope Francis to visit his country NPR's Anthony Kuhn says South Korea's president will deliver Kim's message to the Vatican next week\nSouth Korea's presidential office issued a statement saying that Kim Jong un had communicated his wish people visit to president Moon Jae in during their inter Korean summit last month moon has an audience with Pope Francis next friday the day before that moon will participate in a mass for peace on the Korean Peninsula in St Peter's Basilica\nNorth Korea isn't officially ... state while South Korea has some five million Catholics the north has at most a few thousand and they practice their faith under tight government control Anthony Kuhn NPR News Beijing\nMourners held a candlelight vigil in Amsterdam New York last night for the twenty people killed in limousine crash on Saturday the vehicle with Eighteen people inside ran a stop sign and crashed into two pedestrians in a parked car killing everyone\nThe White House has clarified in earlier statement announces musician Kanye West we'll visit and have lunch with President Trump on Thursday not today west will also meet with Trump's top aide and son in law Jared Kushner\nOn Wall street stocks are mixed the Dow is down forty points at twenty six thousand for forty seven NASDAQ ends up twenty eight It's NPR the investigative website ...\nGo with Eighteen people inside ran a stop sign and crashed into two pedestrians in a parked car killing everyone\nThe White House has clarified an earlier statement announces musician Kanye West we'll visited and have lunch with President Trump on Thursday not today west will also meet with Trump's top aide and son in law Jared Kushner\nOn Wall street stocks are mixed the Dow is down forty points at twenty six thousand for forty seven NASDAQ ends up twenty eight It's NPR\nThe investigative website ... cat has published what it says is the identity of the second suspect involved in the poisoning of a Russian ex spy and his daughter this year in England\nThe report alleges Alexander Michigan traveled to Britain earlier this year and that he was a Russian military doctor he and another Russian men alleged to be a senior military officers are accused of using a rare nerve agent to poison the former Russian double agent\nA year after sexual assault allegations against Harvey Weinstein kicked off the me too movement in the U.S women in India are naming their abusers on social media NPR switched me to talk reports from Mumbai the accused include a few big names from Bollywood\nScreen shots of lewd messages and harrowing survivors do you have been flooding social media for the past few days a veteran journalist and politician a prominent Bollywood director and famous authors that among the Doberman accused of sexual misconduct\nThere have been forced resignations except with production company has shut down and the future of a popular comedy collective is in jeopardy\nJust days before the social media uproar Bollywood actress than a feed that the huge senior ball with acting on a particular of molesting her in two thousand eight summers thing to me too movement has finally reached India me up I took NPR News Mumbai\nDisaster officials in Indonesia have increased the death toll from the earthquake and tsunami nearly two weeks ago to more than two thousand people some Seventy thousand people remain displaced relief efforts on the island of ... to remain on even this is NPR\nSupport for NPR comes from the department of homeland security with e verify dedicated to providing employment eligibility verification for all businesses and the employees that help them thrive e verify dot Gov slash go and the ... foundation at ... dot org\n\nGood morning here's the weather forecast for the w._b. I in listening area some clouds early this morning then partly sunny with temperatures near Seventy seven clouds tonight with some fall with lows near sixty three partly sunny into Wednesday with ... with temperatures and you're Seventy eight\nAnd then my Thursday a Ninety percent chance of showers and thunderstorms temperatures near Seventy two\nThe outlook for friday sun returning with temperatures only around fifty five degrees\nAnd then at a Saturday mostly sunny and Chris temperatures near fifty to Sunday looks partly sunny with highs near fifty six\nAnd then on Monday cloudy start with a fifty percent chance of showers temperatures near fifty seven degrees sixty eight right now at the Wilkes Barre Scranton editor National Airport and it's ten oh seven on your arts and information station W. V. I. F. them\nYear after Harvey wind scene and me to New York as an acting the country's strictest workplace sexual harassment laws\nThey don't have training that goes well beyond sexual harassment you want to recover discrimination and harassment based upon any protected category not just sexual harassment\nStory plus justice Brett Kavanaugh's first day on the Supreme Court this afternoon on all things considered from NPR News\nDegrees sixty eight right now at the Wilkes Barre Scranton editor National Airport and it's ten oh seven on your arts and information station W. V. I. F. them\nYear after Harvey Weinstein and me to New York is enacting the country's strictest workplace sexual harassment laws\nThey want to have training that goes well beyond sexual harassment you want it to cover discrimination and harassment based upon any protective category not just sexual harassment\nThat story but justice Brett Kavanaugh ... first day on the Supreme Court this afternoon on all things considered from NPR News\nTokyo joined us later today for all things considered from four to six on W. V. I. A.\nThe Y. Center for the performing arts featuring leave you alone to walk future encounter tenor Anthony Ross Constanza on Sunday October fourteenth the two PM at the Y. center tickets available at Bucknell dot edu slush box office were five seconds zero five seven seven one thousand\nProgramming on WB I made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your orchard information station W. V. a a ...\nGood morning and welcome to classical music on WB I a at least some as a ... glad to be with you on this Tuesday the ninth of October twenty Eighteen so how's your morning moving along things are getting done the way they should be getting completed\nI Am satisfied with the fact that you've been able to get things done with some classical music on in the background I Hope the answer is yes and I'm Glad that you did today because we have find music all the way until four o'clock today\nAnd we'll join National Public radio for all things considered classical music in the background always seems to set a good stage it just kind of make things a little makes things a little more pleasant\nWe usher in the ten o'clock hour with a piece by ... see\nA cuddly results they may not be everyday named to you but when he was uh born in in around Leopold Mozart time he was quite the figure because he came from a very\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\nMm\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n[noise]", "show_name": "Classical Music with Lisa Mazzarella", "year": "2018", "city": "Williamsport", "day": "09"}