{"month": "10", "state": "PA", "station": "WVYA", "content": "Programming on WB I is made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your arts that information station W. V. ... [noise]\nSomething light and lively as the gays out the window today and the grey skies but not too worried we would we will see some sunshine and maybe something else this week I'll tell you all about that in the weather forecasts\nBut as far as music is concerned we have to be higher and she is doing some music of uh of Mozart plus we have music I'm Danielle ... there and music of Florence Price\nThis was W. V. I. eighty nine point nine of them do these ... and W. B. Y. U. eighty nine points that would have had Williamsport WTO idiot point three if it means Bert Mansfield\nNinety One point five if I'm home I ... and ... how to universities W to ask you a point on FM Stevens grove\nWe have a translator in east Strasburg ... only three you're arts and information station listener supported public radio W. V. I. A.\nAside from the latest news thoughtful coverage and balanced perspective we also bring you a five week chess championship tournament in a prison\nThis tale starts with a fish called the ... news of the highest went viral and the school was inundated with donated pumpkins that\nCame from two black holes colliding [noise]\nIt's called all things considered for reasons listen every afternoon [noise]\nWeekdays at four weekends at five\nLine from NPR News in Washington encore of a coalmine Turkish broadcaster MTV says Turkish police have received permission from Saudi Arabia and authority to search a well on the grounds of the Saudi constantly in his temple they had previously been denied\nThat just part of the investigation into the killing of Saudi journalist democracy ... NPR's Peter Kenyon reports the conflict building has already been searched\nSaudi officials have acknowledged ... died in the ... following more than two weeks of denials they said it was an accident during a rogue operation a claim that skepticism from Turkish president Recep Tayyip air to won a presidential advisor says the joke is killing is quote a disgrace that reaches all the way to crown prince Mohammed bin Salman\nEveryone wants those responsible tried in Turkey rather than Saudi Arabia Peter Kenyon NPR News Istanbul\nLead says David ... says the government of Mexico reports Central American migrants continue to file applications for refugee status as they arrive from Honduras El Salvador Guatemala\nThousands of migrants have joined together to walk north to the U.S border President Trump threatened to cut off aid to Central American countries if they don't stop the migrants journey today he tweeted us will never accept people coming into the country illegally\nRussia is calling threats by the president extremely dangerous Trump is threatened to develop new ballistic missiles after the U.S leaves the landmark nuclear arms control packed for Moscow Charles Maynes reports\nIn his weekly call with reporters Kremlin spokesman Dmitry ... called us plans to leave the intermediate range nuclear forces treaty and develop\nWe call with reporters Kremlin spokesman Dmitry ... called us plans to leave the intermediate range nuclear forces treaty and develop new weapons path amount to a declaration of a new arms race so to announcements made the world a more dangerous place a U.S calls and Russia have no choice but to think of its own national security or\nThe U.S has yet to formally exit the nuclear agreement the White House has made clear to Russia it's intend to do so in talks with criminal officials in Moscow this week Trump's national security adviser John Bolton called the Nineteen eighty seven Cold War treaty outmoded for failing to include countries such as China Enron and\nPointed to Russian violations with the IMF packed to justify the U.S withdrawal for NPR News I'm Charles Maynes in Moscow\nThe national weather service confirms a rare tornado touched down in New England on Tuesday it struck the city of Lincoln a suburb of Rhode Island's capital Providence it's not clear how strong the twister was a Beverly la Roche says she and her husband will never forget it\nHe could see that big land fly through the air I hear him saying screaming the trees the flying all over the place\nThe national weather service also reports more storm survey work it's underway and north Providence Rhode Island but there's been no tornado determination there yet\nLottery officials in South Carolina say at least one winning ticket was purchased in that state for the huge mega millions lottery the jackpot it's worth one point six billion dollars it's not known who the winner is and it's not clear if there were other winning tickets\nYou're listening to NPR\nUs markets open in about half an hour Asian markets showed mixed improvement in today's trading following smaller losses yesterday on Wall street Japan's Nikkei average rose four tenths of one percent\nWhile the Shanghai index and China was up three tenths of a percent the Hong Kong market fell four tenths of one percent\nWashington D.C.'s attorney general Karl Racine says his office is investigating the Catholic archdiocese of Washington for any signs of a sex abuse cover up by local clergy from member station WBUR AMU Natalie delegate deal has more\nIn D.C the attorney general's office does not have criminal authority in cases of sexual abuse as all felony cases fall under the jurisdiction of the U.S attorney's office\nHowever the the attorney general Karl Racine does have the authority to investigate the church for any violation of the district law governing not for profit\nThat law says charities and not for profit then Washington cannot be involved in any cover up or concealment illegal activity and there's no statute of limitations in other words the ages of it has to peanut power and access to decades of records from the archdiocese\nTwo prominent Washington clerics have recently been forced out over sexual abuse or concealment of sexual abuse when the third in other cities for NPR News I'm Natalie ... in Washington\nBoston has taken game one of the world series they defeated the Los Angeles Dodgers eight to four at home in Fenway Park last night game two is tonight in Boston and it will be justice chilly it was fifty three degrees at the opening pitch in last night's game I'm core of a Coleman NPR News\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane no awhile Christina Hendricks and Andrew rentals a new episode every Friday on prime video\nGood morning here's the weather forecast for the w._b. I ate listening area some clouds today with a slight chance of showers temperatures should be around forty eight degrees then tonight cloudy skies with loads and you're thirty three son into Thursday with high is near forty five clear on Thursday night then clouds with\nFive clear on Thursday night than clouds with temperatures near twenty eight by friday we'll see some sun in the morning then clouds with ... around fifty rain likely on friday night with loads near thirty five\nRain into Saturday with temperatures near forty six that chance of rain is eighty percent ended Sunday on fifty percent chance of showers with temperatures near forty eight Monday looks cloudy with a fifty percent chance of rain with ... forty seven and Tuesday some sun a slight chance of showers ... forty seven\nForty two right now under some cloud cover the Wilkes Barre Scranton international airport\nAnd it's nine o seven on your arts and information station W.\nV. I asked them [noise]\nNext time I asked me and other eastern Slater start ups bench Bob square pants the Bradley musical tells us about the call that led to it all and they said we have this audition for you can't tell you what it is technically it's the title tonight land up project but we think you might be the right shape for it [noise]\nThey're joined me off your eyes and bread for NPR's Arab puzzles where gained Andrea [noise]\nSaturday at all that but I Am on W. V. I. A. up at\nA very good morning to you this is Lisa ... glad to be with you on this Wednesday it's the twenty fourth of October twenty Eighteen and\nOn the playlist we have some wonderful music to kind of breaking up the day some lovely music to keep you in entertained maybe inspire you're just a little bit as you go through the work day maybe listening to it in the background sometimes that's a little bit easier to get the tax done\nAnd to get everything accomplished successfully organist started nice successful uh nine o'clock hour with a little bit of get up and go music courtesy of Daniel ... a spree over there we open with the overture democracy bought up on WB I Richard Bonnie conducting members of the new field harmonious\n[noise]\n\n\n\n[noise]\nSome delightful music now a punk Kelly it's light and fun and fanciful it's from ... and today we're going to be hearing the dance of the hours of music pumped candy on your arts that information station with the national philharmonic under Bruno ...\n[noise]\n\n\n\n[noise] Mm\n[noise]\n\n\n\nThe grand ... music uh pull ... W vi you them and that was from ... do the dance of the hours\nBruno bar Letty conducting members of the national philharmonic here on your arts and information station\nAnd if you enjoyed that invigorating music on the radio can you imagine listening to that kind of invigorating music in a darkened auditorium where people are looking forward to listening to all beautiful program of classical music\nWell you know you'll have an opportunity actually two opportunities with the northern tier symphony orchestra\nThere readying a program for December or for a while losing high school\nAnd that is going to be coming up on November thirtieth and then on December eighth ... middle school and on the program the beloved there needs to be number thirty two of of will come on the day is Mozart ... soup they my boyfriend with the late ... overture\nAnd there'll be other wonderful treat for you as well or along the Christmas line there'll be some uh\nA wonderful piece has finally Rory Anderson and kind of getting you into the holiday mode\nSo the northern tier symphony orchestra getting ready to entertain you and if you'd like some more information on this the bench or any of our events you're more than welcome to give us a call at the studio area code by seven zero six five five to eight zero eight\nTo music now piano music of walking ... on WB IRA the Philadelphia trio is going to be performing the piano trio in um\nThe ... the piano trio number two open Seventy six on your arts and information station Elizabeth Taylor and barber so nice and that Deborah\nTo be Seventy six on your arts an information station listen to counter barbers so nice and Deborah reader a pianist violin and cello respectively with music kept putting up on your arts and he ... station\n\n\n\n[noise]\n\n\n\n\n[noise]\n\nMm\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\nYellow trio number to use the ... on WB I Wonder if the real magic and lush a dramatic the Philadelphia trio performed on W. V. I. N. E.\nI Am Christy Lee hopes to black from here are some types rockets sometimes when you're always excellent variety show\nEach week we still your public radio tote bags full of musical comedy for a long time favorites to new discoveries you didn't even know you were looking for I Hope you join me this weekend for killer show with comedians talk very position Diana Gordon and the the only Jeff Tweedy turn on June ... Trump on\nShow with comedian taught Barry ... Diana Gordon and the one the only Jeff Tweedy turn on tune in and drop off by\nSaturday Night at six Sunday night at eight on W. V. I. A. up at\nThe ... Center for the performing arts presenting to operate in a piece called the nature of forgetting on Thursday October twenty fifth at seven thirty PM at the white shutter tickets available at Bucknell dot edu watch box office ... five seven zero five seven seven one thousand\n\nWell coming up in November the Delaware highlands conservancy is announcing its eagle day and what does that mean will it allows you to get up close and personal with these majestic raptors it's a free afternoon for fun for the entire family at the wall and pop back environmental learning center in holy\nYou can alert or enjoy alive birds of prey presentation bill street or on the Delaware Valley raptor center\n... had hands on activities for all ages to learn about eagles and their NATO other native birds other raptors old and the like\nAnd of course he will bring it it'll be like a a live show until you left up to ... like thrilled to see these ah will the eagles than falcon up close and personal tells you all about their habitats as well so it sounds like a magnificent day for the young and the young at heart\nThe Delaware highlands conservancy can be reached at info at Delaware highlands dot org if you'd like some more information on the day or you can call them directly at five seven zero two to six three one six four\nAnd then coming up by December they're going to be having their eagle a volunteer a day they're training day at ... so anyone who's interested in taking volunteers and people who are interested in seeing an eagle for the very first time\nUp and around the ... election area in the month of January and February you'll be trained on that day in December first to learn all about it's lots of fun things happening with the eagles up and around Wayne County in pike county\nBut right here right now it's music mounting divorce shock today we share with you for Baca tells with ... ...\nAh\n\n\nA\n\n\n[noise] um\nW. P. A. U. Ninety One point five FM streaming live a W. V. I. A. dot org we're in Allentown and not eat on point three and in Bethlehem at what a five point seven member supportive public radio W. V. I. A.\n\nNations I eat as a stand up comic with cerebral palsy and that's part of her stick\nTheir hands on oppression Olympics I Would win the gold medal Palestinian Mount Vernon\nI'm female I'm the same old and I live in New Jersey [noise] laughing through the pain that next time\nOn the Ted radio hour NPR [noise]\nSaturday afternoon or W. V. on a up I'm\nLike what you see on WB IRA you enjoy fine programs like pull dark nova or\nNature be your kids love watching the ethics of Elmo on Sesame Street enjoy sit at the science cuter curious George how 'bout shows like call the doctor Pennsylvania pogo or scholastic scrimmage\nWhatever the reason you watch we want you to know that you make it all possible become a member today and ensure the future of your favorite programs that W. V. I. A. dot org and thank you for your support\nFor W. vi\nProgramming on W. V. I. is made possible by our members and by Pennsylvania College of technology thinking about college hoping to land a great job after earning your degree think Pennsylvania College of technology\nWith one hundred plus bachelor an associate's degrees an exciting career fields industry standard labs in uh Ninety six percent graduation placement rate pen college is perfect for hands on learners visit P. C. T. dot edu to learn about Penn college degrees that work\nLive from NPR News in Washington on corporate Coleman the secret service says it has intercepted too suspicious packages one was addressed to the home of former president Morocco bomb and was discovered in Washington DC the second suspicious package was addressed to former secretary of State Hillary Clinton at her\nHome in New York Secret Service says neither Obama nor Clinton were at risk of receiving the packages the two candidates for governor of Georgia faced off for their first official debate last night that's neat ... from member station WBUR ab ... reports from Atlanta one focus with the right to vote\nRepublican candidate for Georgia governor Brian Kemp and democratic candidate Stacey Abrams spent part of the debate discussing voting rights Abrams says she would focus on making it easier to vote\nAs an ex governor of Georgia I Will work with the secretary of state to ensure that there is no question that the right to vote in Georgia is not a privilege is indeed a right that belongs to those were Georgia citizens and I will work hard to make it so\nRepublican Brian Kemp who's also currently Georgia secretary of state oversees the elections he faces criticism that he has the press the right to vote\nWhen you take off people that had registered ... had a potential double nine or when you count people like Jesus from heaven\nWhen you take all the people that had registered ... had a potential doubled nine or when you count people like Jesus from heaven street there on the pending list no one's keeping them from voting\nThe debate was organized by the Atlanta price club for NPR News I'm this named ... in Atlanta\nThe top health official in the Trump Administration says early new data suggests the opioid epidemic in the U.S is possibly beginning to plateau as NPR's Emily Sullivan reports overdose trends are being cited\nIn his speech yesterday Alex days our secretary of health and Human Services cited new preliminary data from the Centers for Disease Control and prevention just increased by ten percent for twenty sixteen to twenty Seventeen those numbers stole toward the end of twenty Seventeen through the beginning of this year\nIn other words deaths aren't going down but are now at a steady rates\n\nPresident Trump is expected to sign a bill later today that expands medicate opioid treatment programs and support research of non opioid pain relief Emily Sullivan NPR News\nOfficials in Japan say a journalist has surfaced after going missing in Syria three years ago and here's Anthony Kuhn reports from Beijing the journalist who is in good health was reportedly held hostage\nForty four year old Jim pay ya pseudo turned up on Tuesday and an immigration center in southern turkey near the Syrian border Japan's saying to conquer in Turkey for their help with the case you know pseudo was reportedly taken hostage and twenty Fifteen by an al Qaida affiliate known at the time as the new front\nTokyo insisted that it had not paid any ransom to secure yes she does release NPR's\nAnthony Kuhn on Wall street stocks are lower this is NPR\nThe national Hurricane Center says what it was hurricane Willem has degenerated into a tropical depression it's now over central Mexico it once had top sustained winds of one hundred sixty miles per hour it was off Mexico's coach in the Pacific ocean\nThe storm system now moving towards southern Texas the national weather service says the remnants will start to slowly move toward the Florida Panhandle later this week\nThe world series resumes tonight with game too at Fenway Park David prices coming off his first playoff when as a starter will take them out as Boston looks too when it's second game and the best of seven series from member station WBUR you are in Boston Shira Springer reports\nPitcher David Price will try to build off the momentum of its first playoff when meanwhile the red Sox hitters wanted to build off their performances in the series opener the top of the line up with the bats Andrew been attendee and JD Martinez helped get Boston off to a strong start in game one and manager Alex Cora wouldn't mind more of that\nWas ill waiting for those three guys who go hub altogether\nBut I'm going to end the emerging as a think throw the season [noise] um they have in the heart of the same time they're not there is a good time for that to happen\nIs that does happen then the Dodgers have to a World Series will become much more difficult for NPR News I'm Sheera Springer in Boston\nLotto officials in South Carolina and say at least one winning ticket was purchased in that state for the huge mega millions lottery the jackpot is worth nearly one point six billion dollars on corporate Coleman NPR News\nFor NPR comes from NPR's versions other contributors include Amazon Prime video with the Romanoff a new series from the creator of madman starring Diane Lane ... Cristina Hendricks and Andrew rentals a new episode every Friday on prime\nThe creator of Mad Men starring Diane Lane no awhile Christina Hendricks and Andrew rentals a new episode every Friday on prime video\n\nGood morning here's the weather forecast for the W the IRA listening area some clouds ... chance of rain showers with temperatures near forty eight the chance of rain is ... percent clouded this evening with lows near thirty three sunny ... Thursday with ... near forty five\nClear Thursday night then becoming cloudy was temperatures near twenty eight some sun on friday morning giving way to clouds with highs around fifty and then on to Saturday we'll see some rain with temperatures near forty five\nThat chance of rain is pretty definite eighty percent rain on Saturday Night with temperatures near thirty six Sunday looks cloudy up fifty percent chance of showers with highs near forty eight\nOn Monday a cloudy started with a fifty percent chance of showers with temperatures near forty seven and Tuesday some sun slight chance of rain temperatures near forty seven forty four right now under some cloud cover at the Wilkes Barre Scranton international airport and it's ten oh seven at W. V. I. F. them\nMany campaign outlets mall have a unified themes\nThere John them firsthand how important health care for family unlike him\nUltra gone to the drug companies to reduce prices candidates are playing to their voters we are seeing and take on health care more head on in part because voters are so concerned about health care in the mid term this afternoon on all things considered from NPR News\nNew hope you'll join us later today for all things\nConsidered on W. V. I. F. M.\nIt doesn't take long to become addicted to opioids in fact Thirteen Pennsylvanians die from them every day [noise] guys in her is committed to ending opioid addiction with both prevention and treatment in the last three years we've reduced the amount of opioids we prescribe by fifty percent\nWe've opened three medication assisted treatment centers to help patients recover from addiction\nLearn more at guys and your dot org slash had enough\nGood morning and welcome to classical music on W. V. I. A. I'm ... glad to be with you on this Wednesday the twenty fourth of October ... Eighteen hope your morning is moving along productively end of the things that you have to get done are getting done in a productive and\nA faster fashion because the music is in the background kind of keeping temple there but it really is lovely to be able to not only do your work but listen to some find music in the background makes the day move along smooth or at least that I think so\nAt any rate though we're going to start off with a really interesting story about Mozart because we're going to be hearing his clarinet concerto in a\nAnd a this is a piece that he wrote the latter part of his career\nThis was one of the clarinet was the suspect instrument not a whole lot of er an awful lot of musicians and composers really want it to hone in on the value of the beauty and just the sheer sound of the clarinet as a solo spotlight instrument\nMozart was a rogue and he decided he wanted to do it why because when he was going through a New York as a child he wrote to his father even as a youngster and he said oh the sound of the instrument is just fascinating you blend it with the flutes in the orchestra sounds so much more alive\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\nMm\n[noise]\nMm Mm\n\n\n\n[noise]\n\n\n[noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise] [noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise] [noise]\n\n[laughter]\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise] [noise]\n[noise]\n\n[noise]\n\n\n\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n[noise]\n\n[noise]", "year": "2018", "show_name": "Classical Music with Lisa Mazzarella", "city": "Williamsport", "day": "24"}