{"month": "10", "state": "PA", "station": "WVYA", "content": "Programming on WB I is made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your arts that information station W. V. I. A. F. M.\n[noise]\nSounds like a Monday morning doesn't it scrambling hurry up and to get to the to the office or wherever you need to go after him my weekend when we have great music for you to kind of ease you into this work week including a symphony economy also on today's playing this music uh Beethoven ... and we're also going to study the planet\nJupiter to bring her of junk they the\nFirst thing you from NPR coming right out [noise]\nThis is W. V. I. eighty nine point nine of them W. B. I. H. D. one scratching Wilkes Barre Hazelden WTY eighty nine points I haven't ever Williamsport W T I O eighty eight points ... Mansfield W. P. or you know the one point five FM Palmyra township ... how to universities W que su eighty eight point on FM ceilings grove\nWe have a translator in Allentown Ninety nine point three you're arts and information station listener supported public radio W. V. I. S.\nAside from the latest news thoughtful coverage and balanced perspectives we also bring you a five\nWeek chess championship tournament\nIn a prison this tale starts with a fish called the ... news of the highest went viral and the school was inundated with donated pumpkins that came from two black holes colliding [noise]\nIt's called all things considered for reasons listen every afternoon\nWeekdays at four weekends at five\nMiles from NPR News in Washington encore of a coal miner walking caravan of several thousand Central American migrants he's\nMaking its way through southern Mexico reporter Emily Green has been traveling with them and they had for the U.S border\nThey care that took off at five AM from the southern Mexican border many of the migrants had been walking over the last week from Honduras although others were already in Mexico the goal was to make it twenty miles north to top a true led by ten am it was sweltering hot\nStill that thousands of migrants continued forward moms press that their babies as they walked that's pushed strollers three year olds put one foot in front of the other despite at are exhausted\n... I was walking with a five year old daughter she and her family had been traveling for three days from Honduras family I had I not that that that she says she wants to reach the United states God willing but it's not she will stay in Mexico and work\nFor NPR News I'm Emily Green ... Mexico\nPresident Trump tweeted last hour he's alerted the border patrol and the military that\nStay in Mexico and work for NPR News I'm Emily Green ... Mexico\nPresident Trump tweeted last hour he's alerted the border patrol and the military that the caravan of the national emergency and he's demanded that unspecified laws be changed\nEarly voting starts today in some areas of Florida that includes eight counties in states panhandle from member station WFSU Lynn had her reports hundreds of precincts in these counties were damaged or destroyed by hurricane Michael\nVoters can start casting ballots as soon as today and the eight counties most affected by the storm they can also request mail in ballots and writing or over the phone and those ballots can be sent to address as other than the ones on file\nThe move is meant to help county elections supervisors and voters still grappling with this location by the communication infrastructure damage\nLynn had her reporting the president of turkey has spoken with President Trump about the death of the Saudi Arabian journalist apathetic consulate in Istanbul NPR's Peter Kenyon reports the Turkish leader says it tomorrow he will reveal the naked truth about the kings\nPresident ... spoke with Trump by phone and state media said the two leaders agreed that all aspects of journalists ... death must be clarified\nEveryone has so far not blame Saudi Arabia the investigators have said 'cause showed was killed in the embassy and his body disposed of\nBut everyone says he'll talk about the subject in detail during a political address Tuesday\nThe Saudis story of what happened to the show has changed multiple times on Sunday the Saudi foreign minister told Fox News channel that the killing was a huge and grave mistake but said it wasn't ordered by crown prince Mohammed bin Salman Peter Kenyon NPR News Istanbul\nNATO says that us brigadier general Jeffrey smiley was wounded last Thursday in a Taliban attack in Kandahar Afghanistan he was attending a meeting with top Afghan leaders when militants open fire they killed the powerful provincial police chief and intelligence officer It's NPR\nThe national Hurricane Center says hurricane Willa is about one hundred and fifty miles off Mexico central Pacific coast it's top sustained winds are one hundred and fifty five miles per hour it's\nProjected to make landfall tomorrow and start cutting across Mexico forecasters believe it will de grey and coming in southern Texas that's a tropical depression\nIn Boston discrimination trial against Harvard enters its second week from member station WBUR GBH Kirk Carapezza reports the anti affirmative action group suing Harvard for allegedly discriminating against Asian American applicants we'll call it expert witness today\nRichard Kahlenberg a senior fellow at the Century Foundation and he thinks Harvard could achieve diversity but considering class instead of race and secretive admissions process\nLast week Harvard argued it's impossible to use income as a substitute for it in part because most low income high school students in this country are still white following Kahlenberg\nHarbored dean of the college ruckus corona who was born in India will take the stand and defend the university against charges of anti Asian by its former president drew fellows the civil war historian is scheduled to testify on Tuesday\nFor NPR News I'm Kirk Carapezza in Boston\nAustralian prime minister Scott Morris and has apologized to people who were sexually abused as children hate speech in parliament comes after a lengthy government investigation into\nAustralian institutional responses to child sexual abuse in the audience were sexual abuse survivors I'm core of a ... NPR News in Washington\nSupport for NPR comes from progressive insurance offering awaits or by home insurance with their home\nWashington\nSupport for NPR comes from progressive insurance offering awaits or by home insurance with their home quote ... will come some clothes and rates are available online learn more at progressive dot com or one eight hundred progressive bats progressive and the corporation for public broadcasting\nGood morning here's the weather forecast for the w._b. I listening area we'll see some sun today with temperatures near forty eight degrees clubs tonight with temperatures nearing thirty eight either Tuesday cloudy with a chance of showers in the afternoon with temperatures near fifty three the chance of rain it's forty percent\nOn a cloudy Tuesday evening with a chat those sprinkled with temperatures near thirty five when they looked partly sunny with a slight chance of showers with hides near forty six cents on into Thursday with temperatures near forty two\nFriday looks mostly sunny with temperatures near forty five looking into the weekend a slight chance of showers on Saturday with highs near fifty and Sunday looks mostly cloudy with a fifty percent chance of rain temperatures near forty seven right now forty nine degrees the Wilkes Barre Scranton international airport\nAnd it's nine o seven on your art that information station W. V.\nI. F. them\nBut why Center for the performing arts presenting pay off her right in a piece called the nature of forgetting on Thursday October twenty fifty seven thirty PM at the Y. center tickets available at Bucknell dot edu watch box office or five seven zero five seven seven one thousand\n[noise]\nDamage urban and donuts any comedy on\nThe minds really puts while they try to his nephew to marry for money\n\nIn the lead them vibrate featuring repeal Morocco hiding stover Lawrence friendly cause me to\nJoin us for done much going on this station [noise]\nSaturday afternoon at one [noise]\nSupport comes from the contributions for over a century the contributions granted us or northeast Pennsylvania with news and information that defines our community at church or history as it unfolds delivered to your home or your mobile device the contributions there for you and ... news dot com it's\nA very good morning to you this is Lisa ... glad to be with you on this Monday the twenty second of October ... Eighteen\nTo lead to be with you as we begin a work week together new possibilities new day and let the loss of life on music to to get the day started off on the right note classical style to be sure and all the way up until four o'clock we'll bring you classical music and then we'll join National Public radio once again for all things considered\nSo let's kind of set our sights on the list yeah we have the planets and today we celebrate Jupiter the brink of geology it's musical boost up whole says we usher in the nine o'clock hour on a Monday morning with the royal philharmonic under the direction of on drape rather than [noise]\n\nBut they do have an elegant about them that wonderful aura of mystery and there's just that complexity about it that just makes it you want to hear more and more and you feel yourself just going deeper and deeper into the music\nOn his ... Dresden Andre Andre prepping the serenade number two and gee minor open sixty nine music of the baby is on WB I\n[noise]\n\n\n\n...\n\n\n\n\nMm\n[noise] [noise] [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMm\nI'm\n\n\n\n\nWonderful music of jumped today is on WB I asked them we just heard a performance of the serenade number two when gene minor on Sophie motor joining members of stuff's compel Dresden under the direction of Andre president here on your arts an information station WB I\nIn a weather forecast it does feel like follow their we've got full temperatures definitely has today should be around fifty three degrees right now it is forty six degrees of the Wilkes Barre Scranton international airport I'll just the music of Christian ...\nOne of my favorite conductors today we hear his symphony number seven in gee on WB I asked them\n[noise]\n\nVisit ti ti ti dot edu to learn about Penn college degrees that work\nThe eagle has landed and no I'm not speaking of the space program but letting you know the Delaware highlands conservancy is announcing an eagle watch volunteer training day on December first trip nine AM until one in ...\nAnd volunteer training day is geared for those who are interested in eagle who would love to take other interest in the ... other interested individual\nOut in January and February to look at where the eagles nesting get a little bit more information about their habitats and the volunteers have a wonderful time kind of being the nature guide to people who maybe have never seen an eagle before\nSo if you'd like some more details from the the Delaware highlands conservancy you can log onto info and Delaware highland dot org or call five seven zero two to six three one six for let them know that you're interested in being an eagle blown volunteer apple set you up for the training day on December first\nJust ahead we have to music of Mendelssohn on your arts and information station Martin Jones at the keyboard with the ... in B flat open one hundred six O W ...\n[noise]\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n\n[noise] [noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n\n\n[noise]\nOr\nSomething\nThey can\n\nAnd\n\nWomen and\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n\n\n\n[laughter] [noise]\n\nI think the\nNumber number [noise]\n\n\n\n[laughter]\n[noise]\n\n[laughter]\n[laughter]\n\n\n[laughter] [noise]\n\n[laughter]\n[noise]\n\n\n\n\n\nMm\n\nStreaming live at W. V. I. A. dot org we have a translator and Clark summit at ... three of 'em your arts and information station listener supported public radio W. V. I. S.\n[noise]\nMusic by women composers of the past and present are featured on WB I ran and lost my mother told me wrote\nGo holy writ large in eastern ... world is a culture morning one of the afternoon which one is highly promoted music composers such as Clara Schumann and jumped on\n\n... grand concert on the up to the ... on the on your public meeting\n\n[noise] like what you see on WB IRA view enjoy find programs like pull dark no vote were nature be your kids love watching the antics of Elmo on Sesame Street enjoy should the science cuter curious George how 'bout shows like call the doctor Pennsylvania forgot where scholastic scrimmage\nWhatever the reason you watch we want you to know that you make it all possible become a member today and ensure the\nFuture of your favorite programs have W. V. I. A. dot org and thank you for your support for W. vi\nAnd as mentioned we have fine classical music happening in the next hour here W. B. I. F. M. filling up a full day all the way up until four o'clock\nWhen will join National Public radio for all things considered and of course art scene with Erica funky after the news at eleven here on WB I asked them we are going to be seeing some clouds and the weather forecasts but the uh they they do ... they do say that we're going to be seeing some sunshine as well we'll find out and just a bit\nFrom NPR News in Washington on corporate Coleman President Trump's tweets the U.S will begin cutting off aid to Guatemala Honduras and El Salvador because they didn't stop\nBe our news in Washington ... Coleman President Trump tweets the U.S will begin cutting off aid to Guatemala Honduras and El Salvador because they didn't stop thousands of migrants from leaving headed for the United states\nTrump also says he's alerted the border patrol and the U.S military and told them this is a national emergency reporter James Frederick told NPR's MORNING EDITION the walking caravan of some seven thousand migrants is increasing in Mexico because people want the protection of a large group talking to\nPeople hear what they say is that this is an opportunity to feel safer with migrant route so they have plenty of reasons for wanting to flee of violence and poverty and things like that\nAnd when they hear a caravan happening to this is a really good opportunity for not be so exposed on this migrant route that is really dangerous region we can get a group and\nJames Frederick reporting President Trump says he'll withdraw from the intermediate range nuclear forces treaty NPR's Emily Sullivan reports it's a decades old agreement with Russia that eliminated a class of nuclear weapons\nThe decision if that severe blow to the arms control regime that has helped preserve peace since the Cold War since the IMF was signed by President Reagan and Soviet leader Mikhail Gorbachev in Nineteen eighty seven Russia and the U.S have destroyed over twenty six hundred missiles\nTrump accused Russia of failing to honor the agreement saying the U.S had followed stipulations\nOther U.S officials have accused Russia of violating the treaty in the past including the Obama administration chose not to leave out of concern for a possible arms race national security adviser John Bolton will reportedly traveled to Moscow to withdraw from the IMF this week Emily fell of an NPR News\nA U.S army general was shot and wounded last week in an attack in southern Afghanistan Jennifer glass reports from Kabul more details are emerging\nUS Army brigadier general Jeffrey smiley was looted Thursday in Kandahar when the Taliban loyal it opened fire on a high level delegation including the top American commander in Afghanistan he was not injured but the shooter did kill two of the provinces top security officials the chief of police and head of intelligence and wounded the governor\nAnd that prompted Afghan officials to lay parliamentary elections in Kandahar for at least a week\nOver the weekend the rest of the country voted despite Taliban and Islamic state threats nearly four million Afghans went to the polls to choose a new legislature\nThe election was marred by logistical and technical flaws that did keep some Afghans from voting and while there was violence there were no major attacks for NPR News I'm Jennifer glass in Kabul\nThe death toll from this month hurricane Michael has increased the Associated Press reports at least thirty five people have been killed and Ford southeast states twenty five of the deaths in Florida on Wall street the Dow Jones industrial average is down sixty five points at twenty five thousand three hundred Seventy eight\nYou're listening to NPR News from Washington\nPresident Trump and Turkey's president ... ... spoke on Sunday about the death of Saudi Arabian journalist Jamal ... both Trump and everyone agreed that all aspects of his death must be clarified\nThe Saudi Government now says he died in a fifth find in the Saudi consulate an explanation that has not been accepted by critics\nA journalist from Finland has won her case against pro Kremlin hackers who Stockton harassed her both online and off as Teri Schultz reports it's the first time pro Russian disinformation outlets have been sued the European Court\nYesterday ... suffered years of torment from pro Moscow activists after she began reporting on Russian disinformation seeping into finish society and it's so cold troll farm in St Petersburg Russia where employees pumped out misinformation on social media\nRussian disinformation seeping into finish society and it's so called troll farm in St Petersburg Russia where employees pumped out misinformation on social media\nAre sued to finish men and last week she won one of her abusers the founder of a pro Russian website was found guilty on sixteen charges and will serve almost two years in prison\nThe other men received a one year suspended sentence they must pay a combine to find them a hundred and fifty six thousand dollars are says the verdict has sent the Russian troll universe into overdrive that she still being sent hateful messages she'll have a book out about her experiences in February for NPR News I'm Teri Schultz in Brussels\nToo widely played lotteries have swelling jackpots the mega millions lottery is worth an eye popping one point six billion dollars the drawing tomorrow night the Powerball is worth six hundred twenty million dollars\nThe drawings Wednesday [noise] this is NPR\nSupport for NPR comments from NPR stations other contributors include Charles Schwab who believes in modern approach to wealth management starts with asking questions and providing straightforward answers Charles Schwab own your tomorrow learn more Schwab dot com and the ... e Casey foundation\n\nGood morning here's the weather forecast for the w._b. IRA listening area some sun today with temperatures near forty seven clouds tonight with temperatures near thirty eight into Tuesday we'll see some clouds with a slight chance that some showers by afternoon with temperatures near fifty two\nCloudy on Tuesday night with a chance of sprinkled with loads near thirty six Wednesday looks partly sunny a slight chance of showers with temperatures near forty five\nSunshine at a Thursday with temperatures near forty three\nFriday sunshine highs near forty six looking into the weekend that partly sunny Saturday a slight chance of rain with highs around fifty and then on Sunday some clouds of fifty percent chance of rain temperatures near forty seven\nForty six right now under cloud cover at the Wilkes Barre Scranton international airport and it's ten ... seven on your art than information station W.\nV. I. F. M.\nAcross the country colleges are beginning to offer students nor can in case the need to reverse an opioid overdose\nWe felt that he was on the universities who provides me because it's a life saving drugs and we're in the middle of another Democrat effects every\n... others question if it could encourage drug use that story plus the fallout from Jamal ... this afternoon on all things considered from NPR News\nNew hope you'll join us later today for all things considered on WB\nI a programming on WB I made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this was your arts that information station W. V. I. off him\nMorning and welcome to classical music on WB I I'm a I'm Lisa ... glad to be with you on this Monday the twenty second of October ... Eighteen\nIt's dark it's kinda chilly outside it's a typical fall day but uh we are delighted that you're with us and listening to some fine classical music because maybe kind of pick things up a little bit for you especially after the weekend when you have to kind of kicked into high gear on Monday\nAnd get ready for the rigors of the work week but we have something here for you that most everyone has heard especially around this time of the year\nAnd I think you'd delight and hearing it again it's music and Beethoven and the symphony number five and um you know you'll recognize it by the first four notes uh this is this in the in the minor the London symphony orchestra performing for you now and you're arts and information station enjoy\nTo see the the the minor London symphony orchestra performing for you know on your arts an information station and Julie\nAnd\n\n[noise]\n\n\n\n[noise] [noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\nSan Francisco ... donuts any comedy on\nThe mind Julie ... while they tried to his nephew to marry for money\n\nYou should be the lead the migrant camp ... into hiding stover Lawrence friendly cause me to\nJoin us for don't that's going on this station [noise]\nSaturday afternoon it was [noise]\nYou know this is the time of year when you're seeing a lot of pumpkins and a lot of amber colors and read the NRA to fall it's a beautiful time of the year and it's also Halloween time\nAnd it's a lot of fun for kids to an end blues ... they're going to have a great deal of fun coming up on October the twenty six\nIt's going to be a lot of family friendly activities and Bloomberg boo Burke and basically it's going to be a trunk or treat pumpkin painting marshmallow melting that's going to be a lot of fun lots of Moore's by the fountain or you'll be able to uh have family crap so they'll be lots of activities\nUh the children's museum gift shop is going to be open they'll be face painting and scary stage makeup with people from the Bloomberg theatre ensemble and then the popular pumpkin drop is going to be taking place so it's going to be a lot of fun for the entire community\nAnd if you'd like some more details you can look on Facebook for more details that that event again is happening at the blooms birch children's museum\nIt's October twenty six boo Bergen celebration of Halloween\nWe celebrate no voices voices of the guitar and voices of the flu and that's exactly what's fair to the novel cut who really wanted when he wrote his series of their needs for both the instruments he wanted to have a conversation with each other today we hear the conversation to stare and they'd number three in the\n... snake is guitar solo was joined by flute soloist patron Lucas gruff\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\nThey\n\n\n\n\n\n\n[noise]\n[noise]\nLovely voice it music ... serenade number three in the paper Lucas grounds flew solo is in Congress ... snake guitar solo with a W vi\nThan programming on WSBIU has made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your art should information station W. V. like I have a family\nAnd coming up on the news from National Public radio in Lebanon o'clock after which Erica funky brings you are seeing more fun classical music followed by Larry void go and classical music until four and we'll National Public radio for all things considered\nFresh air with Terry Gross debt six jazz tonight with George grandma and all that jazz a mixed bag full lives are and Fiona pot will keep you informed from the w._b. on the news desk\nMixed bag full lives are and how will keep you informed from the w._b. I use desk", "year": "2018", "show_name": "Classical Music with Lisa Mazzarella", "city": "Williamsport", "day": "22"}