{"month": "10", "state": "PA", "station": "WVYA", "content": "Support them from custom container solutions a manufacturer of customers standard roll off front and we're dumpsters at specialty containers\nThe environmental construction energy waste and recycling industry's information at customs container solutions dot com\n[noise]\nTo me is against the baby is in the background then of course it's going to be moving to the forefront of just a few moments we had some lovely music planned on Thursday October Eighteen to including the music of Beethoven we'll have some lovely hawk music ...\nAnd music of George ... made the platelets lesson tickets to give away a lot to do a lot to do today on Thursday the first new [noise]\nThis was W. V. I. eighty nine point nine of them W. V. I. H. D. one scratching Wilkes Barre Hazelden W. B. Y. eighty nine point seven five and Williamsport WTO eighty eight points ... Mansfield WTO you Ninety One point five FM Palmyra township\n... how to universities W que su eighty eight point nine FM ceilings grow\nWe have a translator and collect some of the Ninety point three where your arts and information station listener supported public radio W. V. I. okay\nThis is Ari Shapiro host of all things considered by the time you turn on our show in the afternoon you've probably seen headlines maybe you've read it tweed you might have heard of newscast so we want to tell you more than just what's happening we want to give you reasons why things are happening the context around what's happening\nWe want to tell you something that will stick with you while you're driving home or making dinner all things considered listen every afternoon [noise]\nWeekdays for weekends at five on W. V. I. F. M.\nLive from NPR News in Washington I'm more of a cold and the death toll has risen to twenty nine people from hurricane Michael after Florida authorities report it three more Faye talent teams it's still not known how many people are missing now Florida officials are ... some people who were looting\nJeannie Holcomb is living in a motel in the Florida Panhandle she says looters or rifling through people's belongings they just went from room to room [noise]\nAnd what they kinda went even further to fill the food you know go ahead and get in there and get\nSome of my close Florida officials say more than a thousand people remain in shelters\nEuropean leaders are pessimistic about reaching a deal with the United kingdom for its exit from the e you British prime minister Theresa May is considering an e proposal to keep her country linked with the European Union a little longer NPR's the riots or Heidi Nelson has more from Brussels\nBoth sides more or less agree that the u._k. should remain inside the e single market until December twenty twenty to give them time to set up new trade relations but with talk stalls Brussels came up with another idea me is considering\nA federal ideas stigma attached to creation\nSet up new trade relations but with talk stalls Brussels came up with another idea\nTo me is considering a federal ideas in managed to create an option to extend the implementation period for a few months than it would only be for a matter of months but the point is that the fact\nThat she's even considering it\nAngered pro brags that politicians back in London they accused the British prime minister of surrendering to the EU psoriasis they're heading Nelson NPR News Brussels\nPresident Trump heads back to Montana today for another campaign rally it their visit to the states in July as Montana Public Radio's Eric Whitney reports Trump is supporting the Republican who was hoping to take a Senate seat away from Democrats\nThe president will appear in Missoula a famously liberal enclave in a state President Trump won by twenty points\nA counter rallies being held seven miles away while Republicans are popular in Montana democratic Senator Jon tester won't be easy to beat he's raised more than four times as much money as his Republican opponent Matt Rosendale\nRosendale TV ads feature clips of the president's earlier Montana campaign stops\nA vote for John tester is a vote for Chuck Schumer Nancy\nPelosi [laughter]\nThe nonpartisan cook Political Report recently shifted its forecast of Montana's Senate race from leans democratic to toss up for NPR News I'm Eric Whitney in Missoula\nThe first several thousand migrants from Honduras have reached Mexico's southern border with Guatemala they say they're trying to come to the United states President Trump is tweeting this morning he says unless Mexico stopped the migrants he moved to close the U.S southern border and he's vowing to call out the U.S military to do so\nIt's NPR\nTurkish and Saudi Arabian investigators have completed their search Saudi diplomatic properties and it's done boom\nThey're looking for evidence into the disappearance of Saudi journalist democracy showed jeep Turkish investigators have said they've got evidence he was tortured and killed inside the Saudi conflict an allegation the Saudis strongly denied\nA prominent Vietnamese blogger exiled by her government has arrived in the United states she spent two years behind bars Michael Sullivan reports from Thailand it was part of a ten year prison sentence\nAnd wind up new quitting has arrived in Houston along with their mother and her two young children after being released on Wednesday or secretary of defense Jim Mattis was in Vietnam to meet with his counterpart and two or a former U.S air base\nThe blogger also known as a mother mushroom wrote frequently about human rights and the environment before her two thousand sixteen conviction for defending the government\nSpeaking to reporters on her arrival in the U.S going said she is not alone in speaking for freedom in a statement following her released the U.S embassy in Illinois golden Vietnam to release all prisoners of conscience\nAnd allow all Vietnamese citizens to express their political views without fear of retribution for NPR News I'm Michael Sullivan in Chiang Rai Thailand\nThe national weather service warned storms will persist in central Texas for the next few days rain is falling on heavily saturated ground in the area around ... about a hundred miles north of San Antonio officials there have found the bodies of\nTwo people in water on corporate Coleman NPR News in Washington\nSupport for NPR comes from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with a legacy\nBecause from of Raymond James offering personalized wealth management advice and\nBanking and capital markets expertise along with the legacy of putting clients financial wellbeing first learn more at Raymond James dot com\nGood morning here's the weather forecast for the w._b. IRA listening area a freeze warning continues until ten o'clock this morning we will see sunshine today it's out right now temperatures expected to reach forty five degrees with wind gusts to twenty five miles an hour\nClear and cold tonight ... thirty three sunny into friday with ... fifty eight friday night a fifty percent chance of rain with lows near forty three looking into the weekend a cloudy Saturday with a chance of showers with temperatures near fifty five Sunday looks partly sunny with ... near forty five\nInto Monday mostly sunny with highs near fifty Tuesday looks partly sunny with temperatures near fifty three and Wednesday sunshine with hides near forty seven right now it is sunny clear and\nForty one degrees or the Wilkes Barre Scranton international airport and it's nine o seven on W. V. I. F. them your arts and information station\nSupport for WBAI comes from the citizens for providing loser and county was breaking news every day for the past forty years citizens voice thanks their readers who received news at home or on the go the citizens voice here to stay more information at citizens voice dot com\nEmbracing coverage on me and frisk 'em all the meaning of all the suffering unfairly too we offer a fly the festival overview of largely an celebrated repertoire five hundred years of Italian ordered music this week on pipe dream from American public media I'm Michael Barone microbial re listening\nSunday Morning at six on W. V. I. A. F. M.\nProgramming on WB I is made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your arts that information station W. V. I. off\nHim a very\nGood morning to you this is Lisa ... glad to be with you on this Thursday the Eighteenth of October twenty Eighteen well it's chilly out there today\nBut boy it's it's beautiful nice and Chris nice ride into work today clear cool and it just does that nice little cold snap a snap in the air just wakes you up and makes you ready to work and face the day and I certainly hope you're ready to face the day too with some classical music as the soundscape\nAlways provide says something nice when you're doing your chores or you're whether you're doing your work at the office\nWe have some great things planned for you today including some tickets to give away will tell you all about that in just a little bit but right now three times the charm you know Beethoven when he wrote the lay in order to overtures plural\nAnd he wrote it and what the hope that uh that his suffer daily I Would be called ... because Leonardo was the heroine of daily oh\nAnd I am it didn't turn out that way but when he wrote the three overture as one is about fourteen minutes and like that's the third one you hear that quite often we have the second one which is hardly hurt on our air every once in awhile to send the rotation and the first one\nSupport for WBAI comes from everything natural and Clark stumped featuring a niche door lecture with Dr cash and groom on October twenty first two PM sharing information I'm using natural remedies to fight why does each arthritis chronic pain and more everybody natural shop here if you know what's good for you\n... has been on our air a couple of times he really is an interesting and then using all different types of herbal remedies or to cure illnesses and the like so it really interesting a seminar coming up with everything natural\nI'm Christy we hope to fly from here [noise]\nYou know they say that country has more divided than ever but there's one thing we can all agree on other people just mentally I Hope you'll join us for a glorious evening of music and comedy that just might bring us a little closer together\nDuring the Saturday for a live broadcast from a Fitzgerald Theater in Saint Paul Minnesota with again foresaw the war in treaty Mr Gabriel ... [noise]\nSaturday Night at six Sunday night at eight on WB I Am a\nLittle chilly this morning on the way to work when we do have a freeze warning in effect until ten o'clock this morning but we will seats and son will enjoy temperatures today around forty five degrees right now though it is forty one at the Wilkes Barre Scranton international airport\nYolanda cold enough is now it's a musical Claude ABC and the performance of the Arab ask number one on W. V. I. A.\n[noise]\n[noise] [noise]\n\n\n[noise] [noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n[noise] [noise]\n\n[noise] [noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIt's performing on your station\nOnce the temperatures German chamber orchestra with\n\n\nMm\n[noise]\n\n[noise] the music of guy tunnel don't exist the on WB I asked them south west German chamber orchestra with these teen phony or indeed on your arts and information station we have like classical music here every day all thanks to you or support\n[noise]\nLeave all the roads ... hundred concerto but he poured his talent into just one for the cello mandolin and the next Chicago Symphony orchestra program mental limits Avi Avi town performed this and\nPlus heightened drum roll symphony next time with the CFL I miss any on\nSunday at ten pm on W. B. I. [noise]\n\nProgramming on W. V. I. is made possible by our members and by Pennsylvania College of technology thinking about college hoping to land a great job after earning your degree think Pennsylvania College of technology\nWith one hundred plus bachelor an associate's degrees an exciting career fields industry standard labs in uh Ninety six percent graduation placement rate pen college is perfect for hands on learners visit P. C. T. dot edu to learn about Penn college degrees that work\n[noise] we have some lovely music now for you I'm sure as you say you're sure don't fall for the young and the youngest hard on your art that information station\n[noise] [noise] [noise] [noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\nPercent wouldn't qualify sued right\nHow we connect with our food like time on the Ted radio hour from NPR\nSaturday new no W vi a up um\n[noise]\nDo you ... a public media presents Pennsylvania decision twenty eight teams\nThe Pennsylvania eighth congressional district debate [noise]\nDemocratic congressman Matt Cartwright Republican congressional candidate John shrimp discuss the issues in front of huddle as an alliance theatre audience [noise]\nNo the candidate before you vote\nThe Pennsylvania congressional district debate [noise]\nMonday October twenty nine three seven on W. V. I. S. [noise]\nSupport for WBAI that comes from the owner art center presenting the L U philharmonic performing a program a romantic master works perfectly suited for the season\nEnjoy Robert ... heartwarming symphony number for a dazzling sweet from these days opera Carmen\nAnd sauce on Halloween concert favorite document cop featuring a diabolical charming concert master solo by professor Michael Jordan's friday and Saturday October night you've been twenty or thirty pm for tickets six one zero seven oh you ... ... owner art center dot org\nThis W. B. I. eighty nine point nine F. M. W. B. I. A. H. T. ones granted Wilkes Barre ... W. B. Y. A. eighty nine point seven FM WTY HD won W T I O eighty eight point three at that means for ... bill doubled UPA you Ninety One point five FM Palmyra township\nSays go hunting universities W. U. S. U. eighty eight point nine ... grove\nStreaming live at W. V. I. A. dot org coming up in just moment the latest news from National Public radio on your art that information station\nFrom NPR News in Washington encore of a Coleman you as commander in Afghanistan has escaped on heard from a shooting incident that wound into Americans and killed a prominent Afghan police chief Jennifer glass reports from ... the shooting occurred as the commander of us and NATO forces general Scott Miller\n... and killed a prominent Afghan police chief Jennifer glass reports from ...\nThe shooting occurred as the commander of us and NATO Forces Journal Scott Miller was finishing a meeting with senior Afghan officials in Kandahar southern Afghanistan about security and upcoming parliamentary elections NATO says Miller was not injured\nThe Taliban have claimed responsibility for the attack that killed powerful provincial police chief Abdul Raziq he was seen as crucial to the security of Kandahar the birthplace of the Taliban with a group continue to have a presence\nReading was also criticized for alleged torture and running illegal prisons but his death could leave a security vacuum in Kandahar and get further undermine long delayed parliamentary elections on Saturday for NPR News I'm Jennifer glass in Kabul\nThere's word now from Afghanistan that the provincial intelligence chief was also killed in that shooting and the provincial governor has been wounded\nTurkish and Saudi Arabian investigators have finished searching Saudi properties in Istanbul where Saudi journalist ... went missing\nTurkey says it has evidence the Saudi Government killed him Saudi official vehemently denied us the Washington Post has chosen to publish ... most recent column his editor Karen ... told NPR's MORNING EDITION the paper felt the column was timely\nWe just decided that now is the week at the time to do it I I think also has the story is moving to a more Shia political story a story about us Saudi relations um goal for relations I think we just decided that it was good to bring\nThe story back um to mount a Hoosier model was ... and his ideas\nWashington Post editor carrying a T a power is returning to more communities in the Florida Panhandle devastated by hurricane Michael NPR times below long reports of school districts are set to reopen for classes next week\nSchool districts are preparing for students to return early next weekend Holmes county and Franklin County which sits along Florida's northern coast the classes are still kids will in most parts of Florida's panhandle ravaged by hurricane Michael\nIt's not clear windows schools will reopen for students from school buildings are sheltering hundreds of families across the region as a cleanup continues after the storm\nState officials are now sending up at Base Camp in Tallahassee to provide long term housing for the utility workers and first responders working around the panhandle where more than a week after the hurricane many do not have electricity or cell phone service and you along NPR News Panama City Florida\nThe death toll from hurricane Michael is now up to twenty nine people many people in the Florida Panhandle are still unaccounted for on Wall street the Dow Jones industrial average is down one hundred and fifty five points the NASDAQ is down sixty two points you're listening to NPR\nPresident Trump is tweeting about thousands of migrants from Honduras who have reached Mexico's southern border with Guatemala\nThey say their destination as the United states Trump is threatened to cut off aid to any Central American country that does not stop the migrants today he tweeted if Mexico failed to do this he would call up the U.S military and close the entire southern us border\nOregon's court of appeals it's sad to hear a case of an African American man convicted by a non unanimous jury as Oregon Public Broadcasting's Conrad Wilson reports if the court granted a new trial it effectively means Oregon would have to abandon its split jury system because it's unconstitutional\nTwenty sixteen Olin Williams was convicted of first degree sodomy by a split jury meaning there were two jurors who thought Williams would not guilty now he's asking the court of appeals for a new trial like Williams one of those dissenting jurors was African American Williams attorney says Oregon's Ninety nine of us jury system ...\nAppealed for a new trial like Williams one of those dissenting jurors was African American Williams attorney says Oregon's non unanimous jury system violates the equal protection clause of the U.S constitution\nThe Oregon department of justice argues Williams requests for a new trial should be denied because it's not based on new discovered evidence or and allegations of Germans conduct Oregon and Louisiana are the only state that allow non unanimous jury than criminal cases for NPR News I'm Conrad Wilson in Portland\nFlash flood warnings are up for parts of central Texas the national weather service says storms will persist in the region north of San Antonio flooding is already killed several people in Texas the bodies of two people were discovered this week in water near the town of Lana\nI'm more of a ... NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include Hitchcock's insurance providing customize insurance for small and medium businesses so they can do more and be more learn more at age ... C. O. X. dot com or from an agent ... insurance encourage courage\nGood morning here's the weather forecast for the w._b. IRA let's sitting area\nA frost warning has expired just moments ago but we are going to be seeing some sun and our area\nTemperatures are going to be on the cool side though highs around forty five degrees clear tonight with loads near thirty three sunny into friday with highs near fifty seven into friday night a fifty percent chance of showers with temperatures near forty two\nInto Saturday clouds a fifty percent chance of rain with ... near fifty five Sunday looks partly sunny with temperatures near forty five\nLooking into Monday mostly sunny highs around fifty Tuesday partly sunny temperatures do fifty two and then on Wednesday some sun with temperatures there forty eight it is forty two degrees right now at the Wilkes Barre Scranton international airport\nAnd it's nine o seven on your arts and information station W. V. I. F. M.\nAttorney general Jeff Sessions the defender of religious liberty but its support selective in\nThat as a public face of this government which is very protective of religious liberty and then the real work that they're doing is only protecting religious liberty rights of those who are religious conservative\nI'm Mary Louise Kelly when the administration's views on religious liberty conflict with other priorities in the afternoon on all things considered from NPR News new hope you'll\nJoin us later today from four to six for all things considered\nProgramming on WB I is made possible by our members and by the box choir of Bethlehem welcoming distinguished American pianist Peter circuit to their annual concert gala his program includes box Goldberg Variations and Mozart sonata in B flat major K. five Seventy and a doctor you owe and be minor K. five forty\nSaturday November third at four pm central moravian church Bethlehem\nInformation at six one zero eight six six four three eight to or online at ... dot org\nGood morning and welcome to classical music on W. V. I. A. ... glad to be with you eat is Thursday the Eighteenth of October ... Eighteen\nAnd I do hope your morning is moving along well we're finally seeing peaks of sunshine still jacket weather and looking forward to maybe a celebrating the fall and summer splendid colors in our region soon with this dip and the temperatures\nAre things are starting to look a little more full like leaves on the on the ground definitely but hopefully some of the leaves outside of our our studio see little touches a red and touches of gold on some of the leaves so far so by next week and you should see a splash of color\nAnd if you look absolutely beautiful that's the hope whenever we have the autumn\nSome of the leaves so far so by next week we should see a splash of color and if you look up some of the beautiful that's the hope whenever we have the autumn season beautiful in northeastern Pennsylvania\nWell we have some great music keep you company throughout the course of the day all the way through work long and then we'll join National Public radio once again for all things considered\nSo let's begin the ten o'clock hour in Grand style with the Vienna Philharmonic under the direction of Andre ... music a record drought and the rose cavalier sweet on your arts that information station\nRight\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\nYou think of John C. W. B. on a daily hurry up and said you know the number one in a friend at the keyboard on your information stationed\nIn our society needs independent enterprising index journey to\nRelieve a regional community needs for simply engaged public\nReally our area needs public media to highlight or cultural she keeps in touch with the world\nThere are many ways you can help us with this public service mission\nGet your business to sponsor the makeup of stocks bonds or mutual funds for tax to include WBAI in your\nVehicle you dumped\nStocks bombs were mutual funds for tax advantage include WB are you in your will be the legacy\nDon't need a vehicle you don't\nVolunteer at the station catalog CDs extra phones are going to press releases help with special events were concerts\nPublic media is a community of people\nWe care and we thank you for Kerry\nThank you for your support\nW. B. R. A. dot org\nAnd just before the news from NPR we have some fine classical music for you and a more a more wonderful things happening with art scene with Erica funky today W. B. I. right after the news from NPR so we certainly hope you'll stay with us and then after artsy and of course classical music continues with Larry Boy Scouts\nAnd that'll be until four o'clock will join National Public radio once again for all things considered\nSix o'clock it's fresh air with Terry Gross jazz tonight with George Gray among all that jazz a mixed bag\nAnd policies are and the owner Paul will keep you informed from the w._b. I used to own good reason to stay with us the music of the week ... taking up to the top of the hour and a dollars you to grow for cello and string orchestras\nWe have a total ski today performing on WB I asked him\n[noise]\n", "year": "2018", "show_name": "Classical Music with Lisa Mazzarella", "city": "Williamsport", "day": "18"}