{"month": "10", "state": "PA", "station": "WVYA", "content": "Us crude oil futures are up again this morning up slightly in Seventy three forty four barrel\nIn New York I'm David Brancaccio with the marketplace morning [noise]\nFrom eight PM American public media support comes from the University of Scranton to understand all that Scranton has to offer visited the campus experienced the community with open house events Sunday October twenty first or Sunday November fourth see how one of America's premier colleges will open doors for you\nProgramming is made possible by the wonder stone galley I'm mindful gift shop yoga studio for own levels art gallery and casting offering costs to a new leaf piece more information about the wonders stone Galvin their vents at the wonder stone galley dot com\nGood morning coming up and just a few moments the latest news from National Public radio on WB I asked them and then we have a morning of classical music\nAs we turn the page and welcome October a brand new month a brand new work week and it's a brand new possibilities for all of us\nOn today's playlist we have some music ever see any beautiful music ... songs anyhow the nays opposition to life what surprises and the ten o'clock hour as well and loads of fall happenings will keep you posted but first you from NPR next\nThis is W. V. I. eighty nine point nine of them W. V. I. H. D. one scratching Wilkes Barre Hazelden WTY eighty nine point seven FM Williamsport\nW T I O eighty eight points ... Mansfield W. P. A. United one point five FM ... and ... how to universities W que su eighty eight point on FM ceilings grove we have a translator in Allentown in Ninety nine point three\nYour art that information station listener supported public radio W. V. I.\nS. and the next fresh air that journalistic challenges that investigating Russian interference in the election and connections between the Trump campaign and Russia they talk with Washington\nPost reporter Greg Miller who's broken several related stories and shared a Pulitzer Prize this year now he has a new book called The Apprentice Trump Russia and the ... version of American democracy China [noise]\nThis evening at six after all things considered on W. V. I. A. F. M.\n\nLive from NPR News in Washington I'm core of a cold and Canada and the United states have reached agreement for candidate to join a revamped North American free trade agreement talks have dragged on for weeks NPR's Henri Berliner explains what each side conceded\nBoth sides gave up some ground from positions that they were pretty entrenched on Canada said it's going to pry open the dairy market which has been very protected leaving it up more to us farmers\nThe U.S backed away from this demand they wanted to get rid of these independent dispute resolution panels that deal with complaints about unfair trade the administration didn't like them at all thought they stepped all over American sovereignty us gave\nFor candidate to join a revamped North American free trade agreement talks have dragged on for weeks and beers or a Berliner explains what each side conceded\nBoth sides gave up some ground from positions that they were pretty entrenched on Canada said it's going to pry open the dairy market which has been very protected it up more to us farmers\nThe U.S backed away from this demand they wanted to get rid of these independent dispute resolution panels that deal with complaints about unfair trade administration didn't like them at all ... all over American sovereignty\nUs gave gave up there um and also significantly in the U.S agreed a rich and understand with candidates not going to go ahead and slap tariffs on autos imported from Canada President Trump and threatened that a bunch of times\nAnd the arts or a Berliner today the first anniversary of the Las Vegas mass shooting a gunman opened fire from a hotel upper floor killing fifty eight people and wounding more than four hundred others NPR's Bobby Allyn reports the city is planning a day of reflection and we'll dim lights on the Las Vegas strip\nAt ... pm the same time that wealthy gamblers Stephen Paddock began his shooting rampage the city's famous casino corridor will darken\nAs the ... dam thousands of residents like lawyer Paulina ... will remember an act that is considered the deadliest mass shooting in modern American history she says the fast moving resilient city is bouncing back from the tragedy\nBut not to let this act of terrorism but I think it is that this crazy act I wasn't that stop art and joined us to say\nThat it didn't leave a note he wasn't connected to a terrorist group he had no mental health record a year later investigators say they remain bewildered about his motive Bobby Allyn NPR News the\nJustice Department is suing the state of California Ryan levy of member station KCPW ... says the suited over that state's new net neutrality rules signed into law by the governor over the weekend\nThe regulations prohibit Internet providers from blocking speeding up or slowing down Internet traffic and from charging more for faster service\nThey mirror Obama era rules that the Federal Communications commission voted to repeal last December within hours of the bill being signed into law the U.S Justice Department announced it would suit California over the new rules state senator Scott Wiener who wrote the bill says he's confident it will stand up to legal challenges\nWe bigger than the earth attorney general wrong word but\n... says he hopes to work with other states to strengthen net neutrality laws for NPR News I'm Ryan levy\nFlash flood watches are posted from the Arizona border with Mexico as far north as Idaho as tropical storm Rosa approaches Baja California the storm is expected to break up but the rain will get into the U.S [noise] this is NPR\nThe winners of this year's Nobel Prize in physiology or medicine are American James P Alison and ... of Japan\nThe Nobel Committee is honoring them for their work and discovery methods of cancer therapy they develop ways to use the body's immune system in a manner that can arrest the development of cancer research has led to major advances in cancer therapy drawings\nIn Germany police have detained six men suspected of forming a right wing extremist terror organization has Nicholson reports the group is alleged to have been planning attacks\nThat's always kind of outrage Eddie this morning that has a rest it six men old Jen and citizens age between twenty ... twenty seven man believed to be the ringleader was arrested last month\nThey are accused of forming a far right's terra good at the ... revolution cabinet named after the eastern Johnson City ... immigrants protests took place last month that's us\nIn Germany leads him detained six men suspected of forming a right wing extremist terror organization has Nicholson reports the group is alleged to have been planning attacks\nThat's always kind of outrage at this morning and have the rest it six men old Jen and citizens age between twenty and thirty seven man believed to be the ringleader was arrested last month they are accused of forming a full rights terror group called revolution cabinet named after the eastern German city\nLike anti immigrant protests took place last month\nThe suspects come from the eastern states it's actually I'm just the western states at those area and police believe they were planning attacks on immigrants and political enemies in order to destroy Gemini democratic quota for NPR News I'm Esme Nicholson in Berlin\nDisaster officials in Indonesia say at least eight hundred forty four people have died because of last week's powerful earthquake and tsunami on the island of ... the Associated Press says about fifty thousand people have been displaced\nRescuers are still trying to reach remote communities on the island where communication has been cut off officials fear the death toll could climb steeply possibly into the thousands I'm corporate Coleman NPR News\nSupport for NPR comes from NPR stations other contributors include Baird providing global financial resources and market expertise to clients the world over our W Baird dot com has more information and the Robert Wood Johnson Foundation at our W. J. A. R. dot org\nGood morning here's the weather forecast for the W the IRA listening\nArea partly Sunday on this first day of October with temperatures today expected to reach Seventy three degrees some clouds tonight applied chance of showers with temperatures around sixty\nThen on Tuesday cloudy skies with patchy fog in the morning showers and thunderstorms by afternoon\nSome of those storms producing some dusty wind in the afternoon locally heavy rainfall is also possible temperatures near Seventy three the chance of rain is eighty percent showers and thunderstorms Tuesday night producing some gusty winds with temperatures near fifty eight\nSunday on Wednesday temperatures new Seventy two Thursday looks partly sunny weather chance of showers with temperatures near Seventy eight\nBy friday some sun with temperatures near Seventy three into the weekend a cloudy Saturday with highs near sixty eight Sunday looks partly sunny temperatures new Seventy two\nRight now sixty one degrees under cloud cover at the Wilkes Barre Scranton international airport and it's nine o seven at W. V. I asked them human beings\nAre made up of just four letters a duty for ... to ... billion of letters of code if you had every pitch filled with ... g's and T's you'd have you'd hundred dictionaries worth of genetic code\nAnd that code decides who we are a guy rod that story next time on the Ted radio hour from NPR [noise] Saturday afternoon\nOr W. B. R. A. M. M. O. is fascinating things on the Ted radio hour hope you're enjoying that show as much as I Am a lot of a good things in very\nDifferent to very different types of stories it's\nA very good morning to you this is Lisa ... glad to be with you on this Monday it's the first of October twenty Eighteen we change the calendar we begin a new work week we begin a new month and we begin a brand new day of classical music on WB I a\nHappily to tell you that we will be playing classical music all the way up until four o'clock today and then we'll join National Public radio for all things considered so let's begin or Monday morning with music ever seen the Andy dance number two from the siege of corn the Monte Carlo upper orchestra performing under Antonina deal made up\nA very good morning to you this is Lisa ... glad to be with you on this Monday it's the first of October twenty Eighteen we changed the calendar we begin a new work week we begin a new month and we begin a brand new dance classical music on WB I\nHappily to tell you that we will be playing classical music all the way up until four o'clock today and then we'll try National Public radio for all things considered\nSo let's begin on Monday morning with music approach Seaney Andy dance number two from the east Egypt corn de Monte Carlo upper orchestra performing under Antonina deal made up on your arts and information state should\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\nNah\n\nWell\nNah nah\n\n\n\n\nI\nLove the music of ... songs of an age performed by each ... Perlman and members of the New York philharmonic under the direction of ... you're on your arts and information station [noise]\nProbably one of the lovely is sounds just hearing a group of children singing and there's going to be an autumn corral concert on Sunday October seventh and ... sixteen members of the four Hamilton gives in children and youth choir is presenting autumn corral\nTheir annual Sunday afternoon full concert at two thirty in St Paul typical church on the corner of Pearl and Charles streets in wells borough\nThis year's theme is called choices and the concert title is and that made me made it all the difference those words from now the road not taken up home by Robert Frost put to music by Randall Thompson that'll be one of the many musical selections at the choirs will be performing\n\n\n\n\n\n\n\nIt was a pretty piece was music of Luke on WB I asked them we just heard a performance of his new concerto in G. members of ... performed and joining them today with loot soloist Peter Lukens growth on W. V. I. F. and\nJoined us for a celebration of the one hundredth anniversary of the birth of Leonard Bernstein's on Sunday October fourteenth the three you\nGet reimbursed as that goes with which we don't resent a program that includes excerpts from a speech works can be the west Side Story as well as his early ... [noise] ... ... if you'd like to enjoy the contributions to donate to make reservations or do you\nFeel like they were more by phone five seven zero six five by\nOpening that sounds like a delightful afternoon we certainly hope you'll be able to join us and I'm taking a look at the sign up sheet right now if your name is an honest there's still time you can give us a call to make your reservations either by Sony are going online W. B. I. A. dot org\nProgramming on W. V. I. is made possible by our members anti Pennsylvania College of technology thinking about college hoping to land a great job after earning your degree think Pennsylvania College of technology\nWith one hundred plus bachelor an associate's degrees an exciting career field industry standard labs in uh Ninety six percent graduation placement rate pen college is perfect for hands on learners visit P. C. T. dot edu to learn about Penn college degrees that work\nYou ever heard news that you really have to contain yourself because it's all part of being professional well I'm delighted to tell you without getting overly excited but I really am inside the northeastern Pennsylvania philharmonic is back\nAnd they are going to be opening their season with a master works concert or not Castro blockbuster featuring Mozart's delightful overture to the marriage of Figaro\nThere's going to be used as a musical rock mining often it's transcended concerto number two\nIn college is perfect for hands on learners visit P. C. T. dot edu to learn about ten college degrees that work\nHave you ever heard news that you really have to contain yourself because it's all part of being professional well I'm delighted to tell you without getting overly excited but I really am inside the northeastern Pennsylvania philharmonic he's back\nAnd they are going to be opening their season with the master works considering the Castro blockbuster featuring Mozart's delightful overture to the marriage of Figaro there's going to be used as a musical rock mining often it's transcended concerto number two\nAnd I'm also a fine soloist Spencer Meyer who is bin Laden not only nationally but internationally for he's fine and alert musicianship this concert going to be taking place Saturday this coming Saturday eight o'clock at the curb the center for creative arts on Wyoming so Wyoming seminaries campus in Kingston\nThat's the ... Center for creative arts or Wyoming Seminary in Kingston Saturday October's fix it begins at eight o'clock if you'd like some tickets for the season opener you can call the philharmonic directly at five seven zero to seven zero for for for for great music ahead to be sure\nJust ahead music Michael Hi did and we share with you one of his sympathies his symphony number thirty eight ... F major members of the German chamber academy noise performing on your arts and information station\n[noise]\nBild street or is from the Delaware Valley raptor center and he brings you up close and personal\nTo all of the raptors that you see in our area the hawks then of course the beautiful eagle the owls and so forth and other native birds to our region it's a very popular program and it fills up very quickly so the doors will open at twelve thirty but if you'd like to make an advance reservation you can call one eight hundred\nThree five for eight three eight three the wall and public environmental or learning center is on ... road in holy once again this is a demonstration is going to be November seventies from twelve thirty until three thirty\nWe have more find music coming up in our next hour of classical music on WB I ate but first the news from NPR coming your way and just moments thanks for being with us today\nThis was W. V. I. eighty nine point nine up at W. V. I. H. D. once credited Wilkes Barre he's holding in Williamsport W. B. Y. eighty nine points that I Am in Mansfield WTO eighty eight point three I found out at like while in pop back\nW. P. A. U. Ninety One point five FM stream live at W. B. I. I. dot org we're in Allentown an audit on point three and in Bethlehem at one of five point seven member supported public radio W. V. I. S.\n[noise]\nOn this week's broadcast of the San Francisco symphony music director Michael ... and Thomas leaves the orchestra spatial symphony that won the Pulitzer Prize one box musical resumes and Chuck ... triumph over face and maybe writer's block that next time with the San Francisco symphony\nSunday afternoon at two on W. V. I. F. out [noise]\n[noise]\nLike what you see on WB I Do enjoy fine programs like pull dark no vote were nature be your kids love\nOn this week's broadcast of the San Francisco symphony music director Michael ... and Thomas leaves the orchestra spatial symphony that won the Pulitzer Prize one of the box musical resumes and check off these triumph over face and maybe writer's block that next time with the San Francisco symphony\nSunday afternoon at two on W. V. I. A. ... [noise]\n[noise]\nLike what you see on W. V. I. A. you enjoy fine programs like pull dark nova or nature be your kids love watching the antics of Elmo on Sesame Street enjoy the science kid are curious George how 'bout shows like called the doctor Pennsylvania Florida or scholastic scrimmage\nWhatever the reason you watch we want you to know that you make it all possible become a member today and ensure the future of your favorite programs that W. V. I. A. dot org and thank you for your support for W. vi a\nLine from NPR News in Washington encore of a coalmine the FBI and spending a week reviewing sexual assault allegation against Supreme Court nominee Brett Kavanaugh Delaware democratic Senator Chris Coons told NPR's MORNING EDITION the FBI investigation needs to be broader and should include more witnesses and documents\nI'm working hard to encourage my colleagues in the Senate principally Jeff Flake from Arizona but others um to speak up and to say the whole point of this week\nIs not to have an ... an open ended or an endless investigation but a credible I'm short but purposeful investigation of the sexual assault ago allegations against a judge Kavanaugh that are in front of the Senate now\nSenator Flake a Republican had initially announced he would support Kavanaugh's nomination but friday called for the FBI investigation\nPresident Trump says he'll speaking about an hour at the White House about the new trade agreement reached last night with Canada\nIt will include Mexico and will replace the north American free trade agreement the U.S had already reached agreement with Mexico on a trade deal the negotiations with Canada had dragged on for weeks\nTo scientists will share this year's Nobel Prize in physiology or medicine for discoveries that have led to a revolution in cancer treatment NPR's Richard Harris has the story\nThe price will be split by James Allison who's currently at the empty Anderson Cancer center in Houston and ... at Kyoto University in Japan the to work independently they were both exploring how the immune system works to ward off diseases including cancer\nImmune system needs to rev up and it also needs to apply the brakes at times\nAlison and hundred discovered they could interfere with this process and release the breaks that makes the immune system more effective it attacking some cancers and the discoveries lead to a whole new class of drugs called checkpoint inhibitors which are widely used today Richard Harris NPR News\nThe jury in Chicago police officers murder trial could hear today from a psychologist he'll try to explain the officers frame of mind when he shot a teenager from member station WBFO easy ... Mitchell has more\nPolice dash cam video shows Jason Van Dyke opening fire is look one McDonald walked away from officers police reports say ... Seventeen year old who's trying to kill them with a knife in his hand\nNow the officers attorneys are planning to put Florida base police psychologist Laurence Miller on the witness stand Miller writes about changes in vision hearing and time perception when cops shoot in twenty six teeny gave Van Dyke a psych exam\nThe prosecutor wanted Miller barred from the trial he argued only Van Dyke knows what was going through his mind when he fired for NPR News I'm chip Mitchell in Chicago\nOn Wall street the Dow Jones industrial average is up two hundred and thirty two points at twenty six thousand six hundred Ninety to announce that gets up more than fifty two point eight\nNow the officers attorneys are planning to put Florida based police psychologist Laurence Miller on the witness stand Miller writes about changes in vision hearing and time perception when cops shoot in twenty six teeny gave Van Dyke a psych exam\nThe prosecutor wanted Miller barred from the trial he argued only Van Dyke knows what was going through his mind when he fired for NPR News I'm chip Mitchell in Chicago\nOn Wall street the Dow Jones industrial average is up two hundred and thirty two points at twenty six thousand six hundred Ninety to the NASDAQ is up more than fifty two point eight thousand Ninety nine yes in the five hundred is up twenty this is NPR\nLawmakers and the west Virginia state Senate are set to act as jurors in the trial of the first four impeached state Supreme Court justices as Dave Mistich of West Virginia Public broadcasting reports the impeachment trials are the first in that state since Eighteen Seventy five\nJustice Beth Walker is the first of four justices said to stand trial for their roles in a nearly year long scandal focused on lavish spending by the court Walker was named and only one article impeachment adopted in August by the house of delegates\nThat article names all the justices collectively for failing to one another accountable and failing to provide administrative oversight in a pre trial hearing in early September they'll gets acting as the prosecution had agreed to singer Walker and the chief justice\nIn lieu of making them stay in trial and risk removal from office the Senate president ruled that effort out of order\nSenators lead twenty three of thirty four votes to convict and remove a public official from office for NPR News I'm Dave message in Charleston West Virginia\nOfficials in France say that singer and actor ... has died he was Ninety four ... was often compared to Frank Sinatra men sank to pack concert halls until the end of his life periods performing libel out\nAs the war began his career as a songwriter French vocalists an actress ESPN and it's estimated that he wrote a thousand\nSongs over his career I'm more of a ... NPR News Washington\nSupport for NPR comments from NPR stations other contributors include Jones Day and integrated partnership collaboratively providing legal services for more than a century forty three officers five continents serving clients as one from worldwide learn more at Jones Day dot com\nProgramming on W. V. I. is made possible by our members we thank you for your support numbers and by the Home Depot the next generation of home improvement with everything you need to do projects smarter the Home Depot more saving more doing\nOur weather forecast today we'll see some sunshine with temperatures near Seventy three degrees clouds tonight with a slight chance of rain after midnight with ... around sixty\nLooking into Tuesday some clouds in the morning that giving way to showers and thunderstorms some of those storms may be heavy at times as well especially in the afternoon locally heavy rainfall is expected temperatures are going to be around Seventy three degrees with a chance of rain being an eighty percent\nRain continues to Tuesday night and again it may be heavy at times with gusty winds temperatures you're fifty eight by Wednesday we'll see some sun with ... and you're Seventy two Thursday some sun with a slight chance of rain with temperatures and you're Seventy eight\nFriday looks partly sunny with temperatures and you're Seventy two looking into the weekend a cloudy start on Saturday eyes near sixty eight partly sunny ended Sunday temperatures Seventy three\nRight now sixty two degrees under cloudy skies at the Wilkes Barre Scranton editor\nBe around Seventy three degrees with the chance of rain being at eighty percent rain continues to Tuesday night and again it may be heavy at times with gusty winds temperatures you're fifty eight by Wednesday we'll see some sun with temperatures and you're Seventy two Thursday some sun with a slight chance of rain with temperatures near Seventy eight\nFriday looks partly sunny with temperatures near Seventy two looking into the weekend a cloudy start on Saturday eyes near sixty eight\nPartly sunny ended Sunday temperatures these Seventy three right now sixty two degrees under cloudy skies at the Wilkes Barre Scranton international airport and it's ten oh seven at W. V. I. F. M.\nA year ago a gunman opened fire on a country music festival in Las Vegas he killed fifty eight people and wounded hundreds more\nPhysically and mentally I could try to healing private or I could just lead by example one survivor helps others confront the aftermath of their near death experiences\nThis afternoon on all things considered from NPR News new hope\nYou'll join us later today from four to six for all things considered good morning and welcome to classical music on W. V. I. A. I'm Lisa ... glad to be with you it is Monday and yes it is October first twenty Eighteen\nI Do hope you changed your calendar and I certainly hope the morning is moving along well for you getting started after the weekend is kind of difficult you know the really hard start but hopefully you're talking along and things are moving along productively for you\nThey are moving along very productively for ... he was really riding the high tide as far as virtue off the pieces merely making his name all over Europe\nBut today what we're going to be doing is hearing his last virtue off the piano concerto because just like anything else for any artist they have to reinvent themselves and they have to market themselves a little bit differently and as you get older you have different train of thought what used to be important to you when you were maybe thirty doesn't really\nQuite shaken if you're a little bit fifty or sixty years old you have different thoughts of different ways of\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise] [noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n[noise] [noise] [noise]\n\n\n\n[noise] [noise]\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise] [noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\nMusic of Antonio people the and the oboe concerto in a minor hides hold a grudge joining members of immune to cheat on W. V. I asked him [laughter]\nWhen your business becomes a WB I sponsor you helpless share the world would end up to NPR News classical jazz in contemporary music and other favorite radio programs we're proud to thank the many civic minded businesses arts and education organizations", "show_name": "Classical Music with Lisa Mazzarella", "year": "2018", "city": "Williamsport", "day": "01"}