{"month": "10", "state": "PA", "station": "WVYA", "content": "Now the structure of these I've on why he is inspired by some financial innovation developed to attract money to environmentally sustainable projects and be able to run ... with the marketplace morning reports from eight PM American public media\nSupport comes from a while for in October is national seafood ... a meal plan that includes fishes heart healthy one while for salmon specializes in Alaska sockeye salmon carries a wide variety of other fish and shellfish find salmon and more while for salmon dot com\nProgramming on WB I is made possible by our members we thank you for your support members and buying a Home Depot there's more home improvement information at the Home Depot dot com this is your arts that information station W. V. A. F. M.\n[noise]\nLittle drama as the usher in a new week on this Monday October eighth music of ... and the excel the overture that'll be one of the highlights of the nine o'clock hour also on the playlist music of coffee at a much more multiple things happening will keep you posted that right now the news from NPR coming right how [noise]\nThis is W. V. I. eighty nine point nine of them W. V. I. H. D. one scratching Wilkes Barre Hazelden WTY eighty nine point seven if Williamsport W T I O eighty eight points ... Mansfield W. P. A. United one point five and ...\nAnd ... how to universities W que su eighty eight point on FM ceilings grove\nWe have a translator in Allentown Ninety nine point three you're arts that information station listener supported public radio W. V. I. S. [noise]\nJoined us for a celebration of one hundredth anniversary of the birth of letter\nOn Sunday afternoon at three dairy and burn it all with Iran is Richard McDonald\nProgram that includes excerpts from states we're tending to west side story that's what is this really clever and it was on WB I ate out of the Detroit Caesar invite you to enjoy this concert in this or donate the make reservations or leave it on ... or so\nZero five five to eight\nLive from NPR News in Washington I'm neuron the UN's inter governmental panel on climate change war and society must take unprecedented steps to meet lower global warming targets it sets a rapid changes are required to energy systems land management and transportation\nOr as Larry Miller reports the world faces an increased risk of severe environmental changes including heat waves devastating storms droughts and the loss of species\nPCC says even keeping the earth's temperature rise to the two degrees centigrade targeted agree that the Paris climate change talks is too high when the war\nThe inter governmental panel on climate change war and society must take unprecedented steps to me lower global warming targets it sets a rapid changes are required to energy systems land management and transportation\nOr as Larry Miller reports the world faces an increased risk of severe environmental changes including heat waves devastating storms droughts and the loss of species\nVIPs cc says even keeping the earth's temperature rise to the two degrees centigrade targeted greed of the Paris climate change talks is too high when the world is heading toward of three degree rise\nThe IPC she says only by dropping to one point five degrees can the worst effects of climate change be avoided\nIts report says manmade C. O. two missions\nMe to drop to zero by twenty fifty also renewable energy would need to supply up to eighty five percent of electricity compared with twenty five percent now one IPC sea board member warns\nThere is only the slimmest chance of avoiding unthinkable damage to the climate system that supports life as we know it for NPR News I'm Larry Miller in London\nThe Nobel Committee is warning this year's prize for economics to to America and a researcher for their work in connection with climate change William Nord house of Yale and Paul Romer of New York university study the interplay between the economy and climate\nSecretary of state Mike Pompeo is in China Today a day after his latest meeting with North Korean leader Kim Jong on in the on young NPR's Anthony Kuhn reports from Beijing\nBoth for us and North Korea said there are talks were productive they said progress was made on arranging a second Trump Kim summit and on nuclear disarmament but they offered few details here in Beijing though Pompeo had a front the exchange of words with his Chinese hosts over powering ties between the U.S and China\nNPR's Anthony Kuhn in Beijing President Trump has a full schedule of campaign rallies this week NPR's Tamara Keith reports\nPresident Trump is well aware of the history the president's party typically takes a beating and the first midterm after he takes office Trump brings it up that just about every campaign rally saying he hopes to prove that every one wrong one more time\nBy electing a Republican House and a Republican Senate we all\nThis\nWeek Trump had four rally planned with stops in Iowa Ohio Pennsylvania and Kentucky each rally winds up being a combination of touting his own accomplishments bashing potential twenty twenty opponents\nBoosting his favorite candidates for Congress and governor camera Keith NPR News\nThis evening at the White House the president will host a public swearing in ceremony for Brett Kavanaugh who was sworn in as Supreme Court justice in a private ceremony on Saturday this is NPR News\nThe graffiti artists known only as Banksy has released a video showing how he secretly build a shredder into one of his paintings that self destruct at moments afterwards sold at auction for more than one point four million dollars ... Ross has more\nTo frame girl was balloon one of the arts is best known work was done by some of these in London on friday evening moments after the gavel went down on the sale the canvas of a girl reaching for the heart shaped balloon shredded itself [noise]\n\nIn a video posted online find by CPR just explain how we build off Neal dishes stumped\nThe video shows if you'd figure fixing a paper shredder into the paintings we didn't frame in case he says it was ever picked up for auction the video goes on to show the moment the painting shredded itself at the auction hugs ... shoot on a mobile phone one mystery however remain\nMoments after the gavel went down on the sale the canvas of a girl reaching for the heart shaped balloon shredded itself [noise]\n\nKnow in a video posted online find by CPR just explain how ...\nThe video shows if you'd figure fixing a paper shredder into the paintings were didn't frame in case he says it was ever picked up for auction\nThe video goes on to show the moment the painting shredded itself at the auction hugs ... shoot on a mobile phone one mystery however remains it's unclear ... years after it was installed the shredder was activated for NPR News I'm ... in London\nTen days after a seven point five magnitude earthquake and tsunami struck Indonesia officials say they're maybe thousands of people still missing they're not sure how many some of them may be buried in deep mud in places where the quake turn the loose wet soil into liquid which may have swallowed entire neighborhoods\nThe official death toll is more than Nineteen hundred people\nMeteorologists are keeping track of tropical storm Michael off Mexicans Yucatan Peninsula it's expected to strengthen into a category one hurricane as soon as tonight and race the Florida Panhandle later in the week I'm neuron NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life ups and downs coverage options and more information can be found and farmers dot com and the ... foundation\nGood morning here's the weather forecast for the w._b. I listening area clouds with isolated showers and thunderstorms this afternoon with temperatures Seventy three degrees that chance of rain is like twenty percent than cloudy skies tonight with isolated showers with loads near sixty three\nSome clouds on Tuesday Morning that'd be coming partly sunny with temperatures near Seventy six clubs Tuesday night with lows near sixty two Wednesday partly Sunday with highs near Seventy five\nShowers into Thursday with temperatures near Seventy two the chance of rain increasing to eighty percent\nBy friday Saudis guys with highs near fifty six\nSaturday sunny skies temperatures near fifty two and then into Sunday partly sunny a slight chance of rain with temperatures me fifty five\nRight now it is sixty one degrees under cloud cover the Wilkes Barre Scranton international airport and it's ten oh seven on WB I asked him your arts that information station\n[noise] Hi I'm Christie early from lives in here with Chris do and\nWe're proud to be the highest rated to our life musical comedy variety show on public radio in this time slot\nIn this weekend for our show policy leader in Saint Paul Minnesota with the school our brothers miss Madison Cunningham\nDirty projector fly from here we make great radio\nSaturday and Sunday night at eight on W. V. I. A. F. N. [noise]\nI'm very good morning to you this leads them as around I glad to be with you on this Monday the eighth of October twenty Eighteen\nAnd we have some find music to kind of ... welcomed the work week for you looks like a night it's going to be nice weather and then all of a sudden we will definitely dip into the fall temperature is a little later in the week but let's deal with Monday and nice Monday had made nicer with some classical music and you their tuning into W the IRA we appreciate that\nWe begin with a piece by Louis ... for and the overture from James owned up on WB I a members of the Berlin radio symphony orchestra performing under get Albrecht on your arts and information station\n\nSome fine music took I knew were welcomed the work week for you looks like a nice nice weather and then all of a sudden we will definitely get into the fold temperatures later in the week but what's the deal with Monday nights when they had me nicer with some classical music and you their tuning into WB I and we appreciate that\nWe begin with a piece I knew we sport and the ... what's your problem get something done on WSBIU eight members I'll be burning radio symphony orchestra performing under get Oprah effect on your arts and information station\n\n\n[noise]\n\n\n\n\n\n\nNow\n\n[noise]\nKnow\n\n\n\n\nProbably due to\n\n\n...\n\n\nI'm\n\n\n\nWay they are a few minutes\n\n[noise]\nThe\n\n\n\n\n\n\n[noise] uh [noise]\n\nHopefully music or Louis ... than we just heard a performance up his new clean tech number two in the major Alexander ... joined members of the ... cortex here on your artist and information station [noise]\nYou know we live in a beautiful area and we have lots of lovely home that people are very proud of their property and lots of lovely landscape toms and so forth [noise]\nThere is going to be a really interesting and landscaping approach a production coming your way courtesy of the Lackawanna College environmental education center on October seven teeth at five thirty it's going to be held that the environmental center on McCann zeroed in Covington township\n\n[noise] [noise] [noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n[laughter] [noise]\n[laughter]\n\n[noise]\n\n\n\n\n[laughter] [noise]\n[laughter]\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise] [noise]\n\n\n\n\n\n\n[noise] [noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n[laughter]\n\n\n\n\nMhm\nMusic abusive vessel on your art that information station nice enough to see John knock them off to at the keyboard\nProgramming on WB I just made possible by our members and by Pennsylvania College of technology thinking about college hoping to land a great job after earning your degree think Pennsylvania College of technology\nWith one hundred plus bachelor an associate degree it's an exciting career field industry standard labs in uh Ninety six percent graduation placement rate pen college is perfect for handsome learners visit P. C. T. dot edu to learn about ... degrees that work\nOn to the music of staying home or on WB I had a little bit of trouble with the DVD player a CD player and the Scottish national orchestra now under paid her son is this a decent phonic overture opens Thirteen called X filthy are\nVery dramatic music that we want to share with you today on WB I Hope you enjoy it\n\n[noise]\n\n\n\n\n\nAnd he wasn't quite sure how the audiences were going to take it and to be perfectly honest with you after the premier he hurts reviews and he kind of came to the decision that was probably a really a a pretty good piece of what isn't half bad\nBut it didn't see the light of day for about Seventy five years after its premier\nAnd then finally it was recorded and now we're enjoying it today so we certainly hope that you can be a little more exposed to the music of Gen Hummer and uh the ex healthier overture the royals Scottish national orchestra performs a dictator so Chris you're on your arts and information station the classical music continues and just a few moments after the news from NPR\nNews the cup of coffee at ... and some ... in the middle\n[noise]\nThis is W. V. I. eighty nine point nine ... W. V. I. H. D. one granted we'll sprinkled in Williamsport W. B. Y. eight eighty nine points that I Am in Mansfield WTO eighty eight point three I found out at like ...\nW. P. A. U. Ninety One point five FM streamed live at W. B. A. dot org ... point three any Bethlehem at what a five point seven member supported public radio W. V. I. S.\n\nUh San Francisco offered presents Andrea ... who who do it on his tail of a poet any young noble woman causing the turmoil of the French Revolution music director ... ... the lead the international cat [noise] teaching young ...\n... seat George gotten EJ engineered bridges join us for Andrea ... on this station [noise] Saturday afternoon it was a\n\nEvery disease is one of the common medical conditions in the world millions of people in the United states suffer\nDumped form of lung disease and\nYeah they do it on his tail of a poet and a young ... woman causing the turmoil of the French Revolution music director Nicholas Lewis on the lead the international teaching young who leaves\nUnder Pearl unseen George gotten each day in Geneva bridges join us for Andrea ... on this station Saturday afternoon it was a\n\nParliamentary disease is one of the most common medical conditions in the world millions of people in the United states suffer\nDump form of lung disease including asthma\nSmoking genetics and infections are factor\nFor why someone they develop water more disease\nPulmonary disease every\nOn the call a doctor\nWednesday night at seven thirty on W. V. I. A. T. V.\nLive from NPR News in Washington I'm neuron the national Hurricane Center expects tropical storm Michael to become a hurricane by tonight as it approaches the Gulf of Mexico it's on track to hit the Florida Panhandle later this week\nGovernor Rick Scott issued a state of emergency for more than twenty counties and he's urging residents to get ready\nRespect in two to four inches of rain in some areas might see five inches of rain tropical storm Michael will bring dangerous storm surge to many or even those outside ...\nScott has put more than five thousand National Guard soldiers on alert and advise people to be prepared to leave their homes the Nobel Committee today awarded it's twenty Eighteen prize for economic sciences to to economist NPR's Nick fountain reports their work focuses on innovation and climate change\nNormally today economists are waiting by their phones early in the morning hoping they'll win the prize but NYU's Paul Romer\nI got two phone calls this morning and I didn't answer either one because I thought it was some andme call so I I wasn't I wasn't expecting it deprives\nRumors work is about economic growth and how to keep economy is growing his insight governments need to create the right incentives for innovation strong Patton systems for example he shares the prize with William ... of Yale whose work is on how economies interact with the environment and climate and similarly he says\nGovernments have to get the incentives right for example with a carbon tax and people have been listening his work has been used by the EPA and the un Intergovernmental Panel on climate change\nMixed up an NPR News New York\nAn international panel of climate change scientist says preventing an expert single degree of heat and the next few decades could be the difference between life and death\nAnd those nations have set a goal of reducing global warming to nine tenths of a degree Fahrenheit the panel says if world leaders could make that one point eight degrees half as many people would suffer from lack of water the president of Interpol I'm young hung way is being detained in China being investigated on charges of bribery NPR's Rob Schmitz reports\nChina's public security ministry ... of the investigation and among on Monday you know it's been comes more than a week after mine was reported missing by his wife in the on France where Interpol is headquartered for its part in her ... he's fully announced among has resigned as president of the international police agency\nAnd they own grace among said she'd received threats and at the final tax from her husband said wait for my call followed by a ... knife\nObservers in China to the fact that Beijing is willing to jeopardize its diplomatic relations by detaining a high profile officials suggest the stakes are high\nMom was appointed vice minister of China's national police by Julian Kong China's former security czar who was in prison after Xi Jinping became leader of China Rob Schmitz NPR News Shanghai\nAt last check on Wall street the Dow was down Thirteen points the bond markets are closed today\nAmong has resigned as president of the international police agency and they own grace among so she'd received threats and at the final touch my husband said wait for my call followed by a ... knife observers in China to the fact that Beijing is willing to jeopardize or diplomatic relations bite attaining a high profile officials who just the stakes are high\nMom was appointed vice minister of China's national police by Julian Kong China's former security czar who was in prison doctor treating pain became leader of China Rob Schmitz NPR News Shanghai\nAt last check on Wall street the Dow is down Thirteen points the bond markets are closed today and this is NPR News\nA referendum against same sex marriage failed in Romania this weekend it would've changed the constitution to define marriage as being only between a man and a woman it needed at least thirty percent of eligible voters to cast ballots but only twenty four percent did\nSame sex marriage is still prohibited by statute conservative groups urged the constitution be amended to prevent same sex unions should be changed in the future\nFuneral procession for Spanish opera singer ... took place in Barcelona today ... reports\nThe day's rainy weather seems to reflect the mood as people from all over Spain that a farewell to one of the most famous opera singers in the world among those in attendance where the singers family and Spain's prime minister ... says\nIt will be buried alongside her parents and Barcelona cemetery the funeral center with open to the public all day Sunday for those who wanted to pay their last respects\nBecause he had passed away this Saturday at age ... eighty five after starring in around Ninety opera roles she was born to a working class family in Barcelona and began showing her musical talent as early as age seven for NPR News I'm Lucy ... is in Barcelona\nFederal and state authorities are investigating one of the worst traffic crashes and the U.S an years it happened Saturday in upstate New York\nA limousine on the way to a birthday party failed to stop at an intersection and crashed killing all Eighteen people in the vehicle into pedestrians the crash occurred about forty miles west of Albany I'm neuron NPR News in Washington\nSupport for NPR comes from Viking dedicated to bringing the traveler closer to the destination Vikings new custom built ocean fleet offers a small ship experience with over ... rooms and short excursion through their report Viking Cruises dot com and the Emmy EKG foundation\nGood morning here's the weather forecast for the w._b. IRA listening area some clouds and a twenty percent chance of some isolated showers and thunderstorms this afternoon temperatures near Seventy three\nSome showers and thunder storms tonight with lows near sixty three cloudy at a Tuesday Morning then some sun with ... Seventy five partly sunny into Wednesday with ... Seventy six some rain into Thursday with temperatures near Seventy two and that chance of rain is more certain eighty percent\nBy friday mostly sunny skies but chilly weather highs are only going to be around fifty five degrees and looking into the weekend a mostly sunny Saturday but Chile Christ\nTemperatures in the fifty two and then on Sunday we'll see some sun with a slight chance of rain with temperatures near fifty five\nIt is sixty two degrees at the Wilkes Barre Scranton international airport under cloud cover and it is ten o seven at W. V. I. F. M. your arts and information station\nChina has become the biggest lender to government in Africa Chinese loans have bumped up your debt to GDP ratio from fifty eighty five percent so we're talking about a lot of money or to try and I'm Ari Shapiro critics say many\nTwo and then on Sunday we'll see some sun with a slight chance of rain with temperatures near fifty five it is sixty two degrees at the Wilkes Barre Scranton international airport under cloud cover and it is ten o seven at W. V. I. F. M. your arts and information station\nIn China has become the biggest lender to government in Africa Chinese loans have bumped up Djibouti debt to GDP ratio from fifty to eighty five percent so we're talking about a lot of money or to try and\nI'm Ari Shapiro critics say many African countries are now at risk of a credit crisis that story this afternoon on all things considered from NPR News [noise] don't\nFeel joined us later today for from four to six for all things considered\n[noise]\nTo Williamsport simply to conduct by ... it'll Stein opens October sixteenth with works by Ross Jeannie ... and bronze Grammy nominated and chart topping violinist Caroline Golding please Chuck ... violin concerto [noise]\nWilliamsport symphony October sixteenth other community are shuttered five seven zero three to six twenty four twenty four or ... dot org sponsors would our capital group at my coming college\nIf you didn't get a chance to see Carolyn Golding in Milford this past weekend this is another wind opportunity to see what the Williamsport symphony orchestra coming up a little later\nA very good morning to you this is Lisa ... glad to be with you on this Monday October eighth welcome to classical music on your arts that information station we are celebrating Monday today this is the get up and go day trying to get motivated to get back into wealth for lots of you it's not a work day it's a holiday Columbus Day\nBut for many of you we do our we had been at the office so we're trying our very best to keep you motivated even though it is a longer weekend for you\nAnd we hope you're enjoying some of the classical music on WB I asked them we have some magic for you and the ten o'clock hour unlike the piece\n\n\n\n\n[noise]\n[noise] [noise]\n\n\n\n\nOh my\nGod\n\n\n\n\n[noise]\n\nWho\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\nNext time Chicago Symphony orchestra conductor a divine nature second in the two of ... tucked my attorney and invented scored\nMozart Beethoven next time Chicago Symphony orchestra ...\nOne day a ten beyond all be all about\nThe Y. Center for the performing arts between Libya loan to walk between counter tenor Anthony ... on Sunday October fourteenth the two PM at the Y. center tickets available at Bucknell dot edu watch box office were five seven zero five seven seven one thousand programming on\nWB August made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your arts and information station W. V.\nI have a family and you could take a full photography course coming up on October ... through the fourteenth the Pocono environmental education center Kathy people's is going to be teaching you how to get that perfect shot and you see deer grazing in the woods there may be catching that bird flight with all the wonderful plumage against cats\nProgramming on WB August made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your art should information station W. V. like I have a family\nAnd you could take a fall photography course coming up October twelve through the fourteenth the Pocono environmental education center Kathy people's is going to be teaching you how to get that perfect shot as you see deer grazing in the woods there may be catching that bird flight\nWith all the wonderful plumage against cast up against a blue sky all these wonderful tricks and techniques that you can have to have very memorable photos plus it's a great day out\nA couple of days out in full workshop and if you'd like details five seven zero eight to eight two three one nine that's October the twelve through the fourteen\nSo music Mozart right now in a run do when the cardinal three hundred Seventy three ... and the Academy of St Martin in the field so did the direction of I own a brown [noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise] [noise]\n\n[noise]\n\n\n\nLovely music of Mozart the Iran do when the crucial three hundred and Seventy three ... joining members of the Academy of St Martin in the field under the direction of I own a brown\nWB I we believe our society needs independent enterprising index journalists\nWe believe are regional community needs a well informed civically engaged public\nWe leave our area needs public media to highlight our local cultural scene and keep in touch with the world [noise]\nThere are many ways you can help us with this public service mission [noise]\nGet your business to sponsor WB I make a memorial gift donates stocks bombs or mutual funds for a tax advantage\nInclude WB I in your will and leave a legacy\nDonate of vehicles you don't see\nBombings here at the station catalog CDs answer phones organized press releases help with special events usher were concerts [noise]\nPublic media is a community of people who care\nWe care and we thank you for carrying\nThank you for your support [noise]\nMore ideas at W. V. I. A. dot org\nAnd we thank all of those have you lend your hands and hearts to you or WBRC gauge you keep the lights humming along we couldn't do it without you really couldn't\nComing up we have to make I link up before the news from NPR followed by art scene with Erica funky more fine classical music and then Larry Waco continuing until four then we'll join National Public radio for all things considered fresh air with Terry Gross George Graham tonight with all that jazz a mixed bag", "year": "2018", "show_name": "Classical Music with Lisa Mazzarella", "city": "Williamsport", "day": "08"}