{"month": "10", "state": "FL", "station": "WMFE", "content": "[noise] [noise]\nHi I noticed a change we all have beepers by hand news ... in the no\nPublic radio is that need to do the neighborly things support and here's how\nHome now and one eight hundred Seventy five twenty twenty per visit W. N. F. E. dot org\n... this week on growing Boulder the legacy of an elegy BP cue activist Robert Levinson\nYour philosophy and much of the er basically the same thing live live fully reinvent ourselves in braces chapter word\nAnd they'll go to the gym to work out do it on the playground\nDoes she makes your memory better it makes you it makes you feel just absolutely juiced in jazz revitalize\nStart growing ... Sunday Morning at seven or Ninety point seven ...\nJoin us for the growing Boulder radio show Sunday Morning it's sending right here on Ninety point seven as Sam W. M. F. E. Orlando Melbourne and Daytona Beach this [noise]\nEach week groundbreaking had time\nTo head now in the entertainment design because\nEverything was taken from them never known that delivered and hadn't had conferences around the\nGets to the human imagination we had to believe in impossible the true nature of reality back in\nFor Ninety point have the news comes from Orlando hell to cover the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals and emergency rooms ten urgent care location and forty six outpatient centers more information is that to Orlando Health dot com\nI had no idea I was funny and it turned out on his Derek all put comedy gave me with this tangible sense of hope\nHow many like the best tool for that it just opens people up\nWhen we love a loud maybe it encourages us to keep going and not ... I'm not going out to listen to\nThis episode painfully funny first this news\n\n[noise] live from NPR News in Washington I'm Luis gave owning a mass shooting this morning in Pittsburgh ethic tree of life synagogue there are both dead and wounded Pittsburgh public safety director Wendell historic says they have the sense that there appears\nTo be no active threat to the community of those individual that uh we believe the subject that those responsible for this has been taken into custody\nPresident Trump says that after the shooting he is considering cancelling a campaign rally tonight at the our camera Keith has more\nSpeaking before boarding air force one President Trump said a terrible terrible thing is going on with hate asked what to do about it Trump suggested more armed guards are needed at churches and synagogues\nThis would be a case for if there was an armed guard inside the devil they would have been able to stop it may be that would have been nobody\nSynagogues and other Jewish institutions in America regularly have armed guards because they are targets of anti Semitic hate Trump's daughter Yvonne guy who is Jewish tweeted America is stronger than the active in deprived they get an anti Semite adding we must unite against hatred and evil camera Keith NPR News\nJustice Department officials say fifty six year old Caesar say out of Florida is suspected of sending at least fourteen mail bombs to prime the Democrats will make his first court appearance next week NPR's David Schaper has more say out deliver pizza\nFor new river pizza is fresh kitchen in Fort Lauderdale for much of last year the last several reggae and says as a worker he was dependable reliable is political views\nI was a a lesbian Vernon how along with the African Americans and the Jews\nAnd the gate and transgendered than Hillary Clinton now ... you know while while\nStill Reagan says she was shocked to hear say X arrests for allegedly sending out ... saying he was never confrontational more threatening David Schaper NPR News Fort Lauderdale\nMexican police attempted to stop thousands of Central American migrants from continuing north during the standoff on a highway NPR's Carrie Kahn says the migrants earlier rejected Mexico's offer a refugee status sleepless\nPlastic shields blocked the caravan from advancing on the highway and the southern state of Chiapas where migrants have been walking north to the U.S border Mexico's National Human rights commission is negotiating with the police to ensure passage most of the migrants want those negotiations to take place in Mexico city\nYesterday Mexico's president announced a new plan he called you are at home\nAllowing the migrants to stay in the country working send their children to school in a boisterous rally led by supporter of the caravan the migrants voted to continue northward to Mexico City and the U.S border many were skeptical of the Mexican offer and point to the hundreds who have already been deported back to Honduras Carrie Kahn NPR News\nThis is NPR\nAcross the country covered local news and all those stories about your city's culture town hall and changes in your community there are all connected I'm Jeremy Hobson and local journalism means going into your neighborhoods schools and barber shops to talk to you\nWhen you link all those stories together you get a vivid picture of our country its people and the challenges we face take for an example education\nSchools across Oklahoma had been closed for nine days and in North Carolina thousands of teachers are expected to march on mistake captures in Arizona are headed back to their classrooms today after six days of protests at the state Capitol in Phoenix\nYou can hear the bigger picture when you listen to NPR and when you give each month you help support local stories that unite our country keep the stories that connect our country coming become a sustaining member now\nAnd you can do that by calling one eight hundred Seventy five twenty twenty or visit W. M. F. E. dot ORG\nYour general supportive a dollar a day during the wind would drive make sure the reliable need to know information on Ninety points who I've been WM every\nStings exactly where you expected to be please call one eight hundred Seventy five twenty twenty or visit W. M. F. E. dot orange you once again one eight hundred Seventy five twenty twenty and things\nSupport for Ninety point seven news comes from aggressive appliances a family owned company that has been selling installing in service thing appliances and central Florida since Nineteen eighty aggressive appliances specializes in luxury brands and features galleries of life working kitchens learn more at a crash and appliances dot com\nAggressive appliances a deeper commitment to appliances and the people who lives in\nPort for NPR comes from the NPR stations or their contributors include twenty three and me a personal genetic service working to help people understand their DNA learn more at twenty three and me dot com slash MPR radio and the listeners who support this NPR station\n\nSupport for Ninety point seven news comes from Tanya Lee sports Hebrew south now serving central Florida from their new sports the relocation on south orange blossom trail\nTwo miles south of the turnpike parts Hebrew south is devoted to improving the dealership experience and offers to Bruce full line of vehicles stung me at least for Subaru south Florida's new super super store on line at the port Subaru south dot com\nThis is not the point seven us um W. M. F. E. bill Johnson taking a look at a beautiful forecast for today partly sunny the Jaime or eighty four tonight partly cloudy with low around fifty nine and for tomorrow a sunny day with a high near Seventy eight\nFor Sunday night clear with the low around sixty and for Monday a sunny day with a high near a fee to support public radio during this fall silent drive at W. M. F. U. dot org or by calling one eight hundred Seventy five twenty twenty it's the\nTed radio hour from NPR hello Andy this guy rise of the frog and this and\nThis is Sandy taxing and she's a comedian\nIs San Franciscan people they love to talk about their feelings that they may I learned not to us the waitress at the ... of us have a totally ... when he was ... says hello you they don't want to know ... it's all good and intrusive right yeah oh I don't know I really do with it [laughter]\nAnd he's been a fixture on TV and radio in the u._k. for more than Twenty years starting with a British children's series in the eighties called numbers Seventy\nThree if you see because he was also a regular on all kinds of comedy shows like called my bluff mocked the weak and whose line is it any way on your shoulder\nAnd he's the host of the BBC show called Q I\nWhat I was appointed interesting and it's full of information that you really [laughter]\nThey're on the mayor name for it was going to have you tell me what any of them oh\nHow the sky was asking me alone\nFor Ninety point have the news comes from Orlando how to cover that whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals and emergency rooms ten urgent care location in forty six outpatient centers more information is that she's darling do health dot com\nOf South Dakota more on how to use about ... ...\nYeah [noise] okay so that's the Sandy does in front of the camera but off screen she had a slightly more serious role\nAs a political activist and it all started with something that happened back in Nineteen Ninety four when Sandy came out publicly\nAnd there wasn't a single out gay woman in British public life I was already on television and on the radio and so on and I just don't think there is no right to have nothing to be ashamed of\nBut it turned out a lot of other people do feel the same way because remember this was in the early Nineteen nineties Sandy picks up the story from the ...\nWe don't even know each other but with the ... got hit by that one of us\nSo we just got to keep going forward [noise]\nComedians Sandy talked big she hosts the show Q. I on the BBC and she's going to co host the next season of the great British bake off later this year\nYou can hear her full talking dot com show today painfully funny guy Raj and you're listening to the Ted radio hour from NPR\n\nIt's been a full two years since we first run or less intrusive soil if one reason why we drive and how we do it now WM every family\nShow your support for I'm interrupted programming donating a dollar a day does it W. M. F. E. dot ORG or call one eight hundred Seventy five twenty twenty\nSupport for the Ted radio hour comes from Amazon Web services used by millions of customers AWACS provides a range of cloud services and functionality from tools to security to compliance more information at eight of us is dot com\nFrom staples with prince and marketing solutions for business including color properties and presentations booklets Emanuel's signage and banners more at staples stores or staples dot com staples and from the ... e Casey foundation it's the\nKen radio hour from NPR I'm Guy Raj and on the show today painfully funny ideas about how humor can make uncomfortable things a little easier to deal with\nI don't like doing ... ever unless I'm totally in control really because I have a face for TV not write down that is true this is ... she's a stand up comedian among slurry and ever and things I'm drunk [laughter]\nNow the reason why may soon as a little self conscious about doing radio is become a disability she has which in her stand up routine [noise] she tackles head on here she is on the stage\nIs made to diet and I am not drunk but they haven't delivered me what he called my\nSix different time\nIn six different direction suffocating for me in the ... as a result I have cerebral\nPalsy which means I shake all the time look\nIt's exhausting I'm like secure or should I care meets Mohammed Ali [noise]\nSee if he is not\nGenetic it's not a birth defect you can't catch it no one put a curse on my mother's ... and I didn't get it because my parents were first cousins which they are [noise]\n\nAnd it only happens from accidents like what happened to me on my birthday now I'm a warrant it I'm not an inspirational [laughter] I don't want anyone in this room to feel bad for me because at some point in your life you have dreamt that being disabled\nCome on and joining with me it's Christmas Eve\nThere at the mall you're driving around in circles looking for parking\nThe pain and the handicapped face\nAnd [noise]\nAnd you're like God can I just feel little disabled [noise]\n\nAlso I got to tell you I got Ninety nine problems then call the ... just one [noise] if if there was on oppression Olympics I Would win the gold medal I'm Palestinian Muslim I'm female I'm disabled and I live in New Jersey\n[noise]\nI remember when I was in San Francisco I remember watching your talk in the audience and you saw it live young the call so when you came out and you started to talk of the audience was like\nOf uncomfortable right because you you were talking about\nThe bar for Ninety point have the news comes from Orlando how to cover the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals ten emergency rooms ten urgent care location in forty six outpatient centers more information is that she's darling do health dot com\nAnd people at ease which is that something you do consciously or or are you aware that initially they might\nDo naturally because I've made a stand up comedian for Fifteen Years and when I started doing stand up comedy I was ... New York city clubs like the middle of the night just like begging to get five minutes of stage time and\nI didn't have time for audiences to be shy or uncomfortable with me so it's just part of who I Am as a comedian is I I get out there I get the fact I have a disability out of the way and then I Move on and I think because I'm move on and a strong funny relate of away people are able to move on\nWith me [noise] yeah because I think for most people like the idea of making fun of a disability is uncomfortable like we're not used to that do you think so\nBecause I mean this really has been mocked mercilessly throughout stand up comedy on characters on television a disability made fun of all the time I think what they're not used to sing and someone with a disability\nWho's proud yeah I'm ashamed and talking about that in a way that they've never heard before but we have been lost because like\nEven someone like me who managed to like get all the way through high school without ever being mocked her bully when I became a performer became pretty common place for people to do that to me [noise]\nA lot of people with the pie don't walk but my parents didn't believe and can't my father's ... what you can do it yet you can get [noise]\n\nIf my three older sisters were laughing I was not been as my three older sisters went to public school my parents were sued the school system and guarantee that I went to and if we didn't get aids we all got my mother slipper\n\nMy father taught me and I walk when I was five years old by placing my heels on his feet and just walking another tactic that he used this he would dangle a dollar bill in\nFront of me [laughter] we have [noise] my inner river was very strong and\n[noise] yeah\nRight that first day of kindergarten I was walking like a champion had been punched one too many times [noise]\nSo when you were a kid I mean first of all you describe like but up until the age of five you you weren't able to walk right I was able to walk out five I had to be able to walk in order to be mainstream did to public school\nAnd um my father worked day and night to teach me how to walk and I think what's so amazing about this is the fact that he was told that I Would never walk and he decided that he was going to try\nWhat did you realize that you were funny [laughter] so my dream in life was to be on General Hospital I didn't know that was funny I went to college for drama and then I came back to New York city started auditioning realize no one was hiring me and\nI had a conversation with an amazing acting coach and she said to me\nWhy don't you do a one woman show that way you can stand out\nAnd I started looking at things like that and who did I see I saw Whoopi Goldberg\nAnd when I saw what would we go over dead and saw like how she used comedy I was like wait a minute\nWhen I look at my TV the people who look like me are all comedians Richard prior\nYou know Alan Rosie O'Donnell those were the people who were not typically beautiful possibly had disability you know how different races like Margaret Cho and I felt like comedy was how I could break through the fact that I was an other and still guy on TV\nAnd so I signed up for comedy class and it worked out because I had no idea I was funny and it turned out on his daring\n[laughter] you know it's interesting because like all these comedians that that you mentioned I mean they dealt with their demons or their challenges their humor right\nAnd do you I mean do you see yourself doing that in your comedy in the same way I mean do you do you see yourself as almost like kind of an advocate for for people with disabilities or or for Arabs and Muslims as well\nI've never tried to be an activist or an advocate I was telling my own story and just by telling my own story I was controversial I'm\nTelling people things they didn't know and this started post nine eleven in New York City my friend and I found that the New York are marking comedy festival to counter the negative images of Arabs and media and\nWe always\nMade sure that the comedy came first so we weren't a bunch of Arabs trying to be funny we were a bunch of comedians who just happened to be of Arab heritage and you know sometimes I just want to talk about beyond say I'm I named my cat beyond and people are like\nTalk about guys are talking about several calls have you know like I really just want to talk about beyond say that [laughter] so it gets exhausting having\nTo constantly battle but I feel like more than ever in my life it's important now that I Do battle because having grown up with you know one fight in Jersey on one foot in the middle East I'm really worried\nThis week on this American Life huge ... of the world stop worrying about money and well being that I'm reading the diary kept as a teenager you're Jewish\nA lot of big ideas if the situation continues when I'm a bit older than watch out world jewelry here comes Adam and what's your dream comes Adam was on Capitol revisiting your own childhood this week\n\nListening for this American Life with Ira Glass that begins this afternoon at four right\nHere on Ninety point seven hour Pham W. M. F. E. Orlando\n[noise] do you have a number of driving anymore I have them donate their gifted WINS the we can arrange for anywhere in the country just eight six six WFSU auto and our friend my staff will make all the arrangements are donate securely on\nLine and to have you got one last feeds thanks for your support [noise] [noise]\nWell if you should've bumping the night [noise] it's almost like which is um [noise]\nBe afraid of just looking to buy Halloween seems continues ... non creepy crawly real stories of the paranormal [noise]\n\nJoin us for snap judgment Sunday afternoon beginning at two right here on dodgy point seven W. M. F. E.\nNinety seven W him if he is here for the day in and day out you can be here for Ninety point seven W. M. F. U. N. missing weight support news that matters with your own going monthly get from your checking account or credit card\nWill send you a pair of Ninety seven W. M. F. E. customs socks ... hundred Seventy five twenty twenty or visit W. M. F. you don't work\nSupport for the Ted radio hour comes from ... family owns makers of small batch Kentucky straight bourbon whiskey you logic correct barge town Kentucky forty seven percent alcohol by volume you logic Craig promotes responsible drinking\nFrom constant contact who's segmentation feature allows small businesses to deliver personalized email campaigns to connect with their customers learn more in constant contact dot com [noise]\nAnd from the John ... Catherine the MacArthur Foundation a Mac found dot org\nIt's a tad radio hour from NPR\nI'm Guy Raj and on the show taped painfully funny ideas about humor and how it helps us deal with the chaos of life\nSo we're just hearing from comedian again first thought and she had a group of Muslim comedians traveled around the country doing what they call social justice comedy and they were trying to open up the conversation about Islamophobia which at times required a little patient [laughter]\nYeah I I think one of the hallmarks of social justice comedy um as I call it\nIn that you remain delightful and I you know I get I get angry you know behind the scenes\nBut when I'm In the middle of a situation I got to keep a delightful because you're just you're going to you know there isn't really are at our track more be without any I mean that's the cliche but it's true yeah and what we need to do is remember that being around people and laughing with them is that is a joint and shared experience\nLike a group mind that engaged in something kind of like fun and the negativity kind of get swept away\nSo that trip you took was the other comedians\nThey turned it into a movie called the Muslims are coming and not too long after he came out something happened back in New York a place where and again the usually felt welcomed and accepted\nAnd group spent three hundred thousand dollars on an anti Muslim poster campaign with the NCAA that's the New York city subway system now actually offensive not to mention poorly design I mean if you're going to be negative you might as well use a better Fox but [noise]\nAh why not not sure how strict campaign right that does not things about Muslims so myself comedians you know be doll I decided to launch the fighting bigotry with delightful posters campaigns\nWe raised money work for over five months that I really didn't you know we're supposed to go up\nA does he just said it could be the poster citing political content once they got a couple of those posters one I'm not going to Muslims [noise] what would you know they have great recipe\nIn front of us are considered political by the NCAA of Muslims in a positive light what's considered political but it is it is about justice so we have to change our fighting bigotry was delightful to campaign fighting bigotry with a delightful lawsuit campaign [noise]\nBasically what I'm a couple of comedians took on a major New York city agency and the comedians want [noise]\nWith a very weird feeling I was like it's no longer feel like oh let's\nWork is meant to be fine it's meant to generate a connection and laughter but yeah sometimes I get means we hate mail sometimes I get voice mail saying that if I can say telling my jokes don't kill me and they'll kill my family and those death threats are\nDefinitely not funny but just changing all danger I still think that social justice comedy is one of our best weapon [noise]\n\nWhat do you talk a lot about using comedy as a tool and there's a great moment in the film I think you're Birmingham, Alabama and it will like it was pretty successful\nYeah so I mean you know one of our stops in Birmingham, Alabama where we like set up a table caught me that religion we're going to read it\nAnd you're going to tell us when all\nDoes your guest right you got one of our like ridiculous pride is like an outdated calendar salivating already and the rules are song peppers will also like chocolate and stuff like that way totally stipulate for the girls who does not lead on her wedding night should be stoned to death a wrong\nFor Ninety point at a news comes from Orlando how to cover that whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals and emergency rooms and urgent care location and forty six outpatient centers more information is that she's darling do health dot com\nOh my lord how can I have a son when no man has touched me\nWe just we're trying to make the point that\nAll of these tax relief that doesn't then why would we hold Islam to a ...\nAnd where people surprised when they like when they found out what the truth was\nYeah yeah people were really surprised and you could even having that moment of like oh my\nThis is not a whole lot of difference between the three of them gave me now\n[noise] to incredible that means that you actually saw the wheels turning like people changing their mind even just slightly\nAbsolutely and I and that's one of the things that like I have performed um in in red states in blue states in one thing that I found all over the country is that\nAmerican people are not dealt to hate you know what I mean they actually want to be friendly and they want to offer you a coffee and they want to open the door for you and they want to\nBe good neighbors um and the one thing I've always found that I said this before and it's so dark ... but it's true is that if you approach people with love you're going to get lodged in return and that's what I stand as a Muslim doing very publicly Muslim thing was performing on stages throughout the country\nThat's what I found a way I like to look at it as you\nGet one person to laugh and a couple of people don't laugh and then over a lifetime you might get like a million people chuckling and does chuckles add up to some measure as as a popular and shifting perception\nAnd that is social change [noise] but it takes time and it takes eight million jobs teams [noise] chocolate [noise]\nComedian against our side she's the author of how to make white people last\nAnd she also hosts a podcast called the nation you can find her full talk at ... dot com [noise]\nOn the show today painfully funny ideas about how humor can cope with things that on their face\nAren't very funny as this is this is the reason that this is Kevin real as the guest said the writer and they stand up comedian Louis every other mothers that are taken [noise]\nHe's actually makes sense for them\nDo that she's ... she's ready for it though [noise]\nHouses and some argue there's [noise]\nSo obviously being funny is like Kevin does for a living\nBut being funny is also a way he deals with like humor I think is either kind of like an invitation or a shield but you can use humor to keep people on the outside of your life and that's what I did", "year": "2018", "show_name": "TED Radio Hour", "city": "Orlando", "day": "27"}