{"month": "10", "state": "NY", "station": "WAMC", "content": "To science form returns two o'clock this afternoon the science form on box pop\nBut with a forecaster cloudy wet afternoon rain possibly heavy at times and that could be a thunderstorm in the lower seventies\nCloudy tonight some showers possibly under storm in the low fifties\nTomorrow a mix of some and clouds breezy turning cooler early highs near sixty the temperatures falling later in the day Saturday cloudy a few showers especially in the morning highs and the low fifties sunny a mix of sun and clouds in the mid fifties support for WAMC\nComes from ... falafel restaurant in mind back from local farmers markets a lot of hummus Bach all of a more gluten free options homemade fresh prepared to order eat in or take out much only about ... dot com\nClink part all art center presenting the Sharon springs poetry festival\nOctober the Eighteenth through the twentieth featuring Billy Collins Tracy case Smith an an Waldman more clean cart dot org slash poetry\nNegative joining us today on WAMC is midday magazine argument going on Bryant's shoe [noise]\n[noise]\nThis is Northeast Public radio WAMC F. M. H. D. Ninety three Albany W. R. U. N. H. D. Ninety point three rent in Utica W. M. K. E. H. D. nine point nine Kingston W. O. S. R. H. D. in any one point seven Middletown to UCLA each dean any one point nine Plattsburgh WC A. N. H. D. Ninety three point three candidate Harry ... three nine tie counter of at\nWM cue HD won all five one great Barrington W. W. E. S. H. D. H. D. point nine mount Kisco W. N. D. H. D. in any point one Stanford W and our eighty eight point by Brewster WAMC am fourteen hundred Albany\nLive from NPR News in Washington I'm neuron President Trump is again criticizing the Federal Reserve board for raising interest rates calling it a ridiculous policy\nThey have interest rates going up but it's slipped that's much faster than certainly a lot of people including myself would have anticipated I think the fed is out of control I think what they're doing is wrong\nThe president said he knows more about interest rates and members of the Federal Reserve but he said he does not intend to fire fed chairman Jerome Powell in the past twenty four hours the president has also called the Federal Reserve board crazy and logo the director of the national economic council Larry Kudlow and\nSaid the president is not try to dictate policy to the fed the Federal Reserve is expected to raise interest rates again it's December meeting analysts say it's not likely that will change because of today's report that the consumer price index rose one tenth of a percent last month\nThe federal emergency management agency says it focusing on search and rescue in the Florida Panhandle today as now tropical storm Michael ... northeast over the Carolinas NPR's Brian Naylor reports\nAdministrator Brock Long says it appears that the town of Mexico beach was grounds\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nGuard and first responders to access the area\nToday is a big day for us when it comes to a truly helping people and try to ah prevent for the loss of life as a result of of you know what the Gulf Coast has been through\nAn estimated nine hundred thousand customers are without electricity in the region\nLong says FEMA is also studying a tree ... several hospitals are out of commission the storm is tracking through the Carolinas today and whether a specials are warning of possible tornadoes and more flooding in areas still recovering from Hurricane Florence last month Brian Naylor NPR News Washington\nOr New York court has agreed to drop part of the criminal sexual assault case against former movie producer Harvey Weinstein NPR's rose Freeman reports\nAccording to a letter from the Manhattan District attorney's office a detective took a statement from a witness in that case but failed to alert the da de ... contradicts the account Lucia Evans had given her alleged assault by Harvey Weinstein speaking to reporters went teens attorney Benjamin Brafman says it clean for ...\nThe main witness and the district attorney's office lied and defective led the investigation committed what we believe to be serious for conduct\nIt to get back to the prosecution but in a statement the da's office that's the case is quote moving full steam ahead the remaining charges against Harvey Weinstein include predatory sexual assault hit next court appearance scheduled for temper rich Friedman NPR News New York\nIt's another down day on Wall street the Dow is down a hundred and eighty four points the S. and P. as down Twenty one and the NASDAQ is down six points this is NPR News\nThe government announced today that Social Security recipients will re SUV received two point eight percent more starting in January\nThe increase in benefits reflects the higher cost of living with the adjustment known as cola the average monthly Social Security payments for retired worker will be fourteen hundred and sixty one dollars next year\nTony nominated lyricist and liberate us Ira gassman died on October sex at the age of Seventy six Jeff Lunden reports\nThe New York native had many careers she was a standup comic a newspaper columnist then in advertising executive gas been coined the phrase bounty the quicker picker upper\nBut writing lyrics and scripts was his passion in Nineteen Seventy feet co authored the off Broadway statistical review what's a nice country like you doing in a state like this\nAnd he teamed up with composer sigh Coleman on the life in Nineteen Ninety seven Broadway musical that looked at pimps and prostitutes in previous Times Square\n[noise]\nHave you on a day gassman also wrote radiate baby an off Broadway musical about art is Keith herring for NPR News I'm Jeff Lunden in New York\nA U.S astronaut and Russian cosmonauts are safe after an emergency landing in conflict on today they're spacecraft was launched there but a booster rocket failed shortly after that caused the rescue capsule pleaded disconnected from the booster and follow the earth\nOfficials say the two states travelers are in good condition that were being sent into space to joined the crew on the international space station I'm nor rom NPR News in Washington\nSupport for NPR comes from NPR's Beijing other contributors include Amazon Prime video with the Romanoff a new theories from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair premiering October ...\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu [noise]\nComing up next WAMC is Alan shark talk in an encore conversation with Dr Aimee bass professor of history director of the honors program at New Rochelle college the author of the book one goal coach a team and the game that brought a divided town together and inspiring conversation\nIt's up next WAMC challenged our talk Dr ...\nAnd the book one goal\nNext WAMC [noise]\nHi this is Alan charge are delighted to be in conversation today with Dr Aimee bass and author director of the honors program a professor of history at the College of new show in New York\nThe daughter of two noted journalists who I Know Dr best is born and raised in New England in Richmond right next to Greg Barrington ... during the ... the distinction from Stony Brook university messages from Stony Brook in a ... degree from Bates College in Maine\nTuck your best research interest include African American history in modern American culture with a particular focus on sports then be politics in historical theory and methodology vision do or academic work she's written about sport and politics this late salon\nThe all around her and CNN opinion she hosts a weekly radio show conversations with Amy best on W. V. O. X. we know that ... will\nIn televisions you served as senior research supervisor for NBC Olympic sports across eight Olympic Games winning an Emmy Award for or work at the London Olympics in two thousand as well but Dr Aimee bass joined us today to talk about her fourth book she's a\nGreat author one goal a coach a team and the game that brought a divided down together from a ship books will Khamenei Beth thank you Alan it's great to be here the book one go a coach a team and a game that bought a divided down together let's pretend I hadn't read the book what were the book about\nThe book is impossibly local story in Lewiston, Maine about a soccer teams quest for\nThe schools FIRST Championship title and soccer and the interesting thing about this team is that all but one of the starters on it the varsity roster are African immigrants um most of them are Somali refugees playing for a coach that his fourth decade of teaching and coaching Lewiston born and bred\nAnd it's a story about this team coming together in this town that has experienced this unusual migration influx immigration influx of Somali refugees and setting an example for the community to follow\nAnd he gives them a speech which is a speech that he gives them all the time about about soccer which is this game that is you know a team effort it's it's building it's a it's a game that builds long plays and you have to move the ball together across and an enormous amount of space and he talks to them about you know you have five each other in the hallway\nAnd if you're going to the movies you see who else wants to come along and if you're going to a football game I Want you and your team jackets and I want you visibly as a group um\nAnd it was something that they were really waiting for it was something that they talk about in retrospect as as being relieved because he gave them the opportunity he gave them a path that allowed them to understand how they had to work together\nWhen this book was being composed by you and written by you was he is founded that he was going to be pretty famous as a result of this\n[laughter] that's very optimistic in terms of the book and its success God writes excess yeah go to a lot of attention along\nWay the team has had it was an interesting thing because then there are two thousand Fifteen season which is this historic season this undefeated season they out score their opponents a hundred and fourteen to seven in the two thousand Fifteen season it's just you know people in America who say I don't like soccer 'cause it's a low scoring game\nThey've never seen Lewis didn't play because this is a team that wins by fourteen or Fifteen points it's a lot of goals\nAnd so my grandma had attention that season from a lot of different places they got some notice they got nationally ranked rights that suddenly they're in USA Today as a nationally ranked team I think the only one from Maine and and one of just two or three from New England so it was a team that had a lot of attention\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nMaine had just never seen before they had this top twenty national ranking and they had this roster that caught a lot of people's eyes\nSo he had some folks talking to him and he thought for a while I reached out to him you know we did the CNN piece which was quick and then I reached out to him and said I I kind of want to go deep and he thought about it and he should have thought about it because I was asking a lot I was asking for access you know flash forty year I'm sitting in the locker room thinking I Can't quite believe I'm here\nDid you establish relationships with each of the players or how does that work\nYeah most of the players you know it was interesting because I created as you should do and as you know you're taught to do it created a research agenda and I thought these are the people I Want to interview and these locations they want to see and I did do those interviews but I also through a lot of my game plan out the window because one of the things that I realized\nWas that I needed to just be in Lewiston I needed to be there I needed to be visible I needed people to feel comfortable to come up to me and talk to me and tell me their stories\nSo it wasn't just I'm going to go to a lot of soccer games and then I'm going to have you you and you sit down it was I'm going to go to the youth track practice today and sit in the bleachers and talked to some of the families and and watch some of the soccer players sisters Ron\nI'm going to go to the football games on Friday nights I shattered my grandma's bio class a lot which when I was in high school all day every day I started calling it the art of hanging out as a research and that's it because I just needed to be there\nAnd relationships crew and I felt really honored that I was trusted with these stories because these are stories you know that the kids would talk about their time and the dog which is you know the largest refugee settlement in the world it's in Kenya\nAnd those who grew up there and remembering their stories of being in the ... remembering their stories of of coming to the United states and what the vetting process was like as refugees thinking about stuff like that and sharing stories about that you know I was\nI was invited into their homes breaking fast with them at Ramadan and and learning about food and I was taught all the time you know how to pronounce this what would you say about this what do you call this and they were incredibly generous an incredibly trusting and those relationships grew and from those relationships the cast of characters sort of found their way\nI've lived here for roads I could go down here but I Want to go down the one where you just raised with it which is that these folks and these kids and their parents had a rough time tell us about\nThere is some stories it's interesting if if you first asked you know what was it like and I I guess this is kind of a stupid superficial\nQuestion and it's not a place you should start what was it like in the refugee camp almost to a person all of the guys would say it was nice and I learned that nice was sort of a cover word that there was a lot behind the word nice\nThat there's things that they don't remember there's things that they remember because people have told them about it and then there's stuff that they remember and they don't want to talk about you know there's some sixty million refugees in the world right now there is a nation full of refugees if you if you look at numbers\nAnd so you know it was the struggle for some of leaving Somalia fleeing Somalia as it was being wracked by\nCivil war and by famine and by drought and by takeovers infections and wars you know war is within wars it was getting family whoever was strong enough to do it over the Kenyan border and\nThen it was surviving in a refugee camp which is a tough thing I'm not doing a justice by saying that but the memories and and some of them are ... who is now a community leader and in Lewiston he's part of a group called main main immigrants\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nImmunity in Lewiston I could do an aggy spent almost two decades right he grew up in a refugee camp in Kenya before finally getting to an Atlanta suburbs and then getting on a bus blind almost and and going to Lewiston because that's where people said that they should go\nSo it puts a lot into perspective thinking about what's important and what's important is family and then what you want for your family which which is you know education and security and safety\nThey play soccer you know they\nDo you play soccer soccer volleyball or the two big sports in the camps because there are simple but they don't play soccer the way that they play soccer in Lewiston necessarily so malicious app do who is\nOne of the stars of the book and and is\nFamous because of his stunning ability to do what's called the front hands spring flip throw\nIn in which instead of just throwing a ball back into play over your head which is the way Ninety nine point nine percent of all soccer players do it mullet actually takes a running start puts the ball down flips over and then propels the ball coming out of a front hands sprang ... grew up\nPlaying soccer in two different refugee camps but they didn't have balls and they didn't have cleats and they didn't have shin guards they would ... material\nAnd plastic and sort of make a makeshift ball wrap it all tight and cloth\nAnd played barefoot in the sand and there's actually a picture of one camp in Kenya of boys playing soccer sort of in the horizon it's a beautiful picture that was taken actually by another Bush or local stash was lucky who had done some work there and the generously gave me some of his photos so in the lives in Lewiston you know his father is a rabbit soccer fan\nHe's playing with his brother there in one of the parks\nAnd the idea you know putting on cleats putting on shin guards putting on a ball having an organized game with time it was a different kind of soccer but there were these use leagues that were largely you know they were there were Lewiston youth leagues there were Somali run youth leagues and these coaches\nThese volunteers people like object here you know taught kids like molested about the regulation game that said\nThe best games to watch in Lewiston and and as much as I Love the list and blue devils and I'd I chair for them as hard as I cheer for the red Sox are the pick up games they play these rock is amazing thirty thirty five people on a side pick up games in the parks\nThat are just joy to watch because there aren't referees making calls and calling penalties and their celebration and\nYou know defenders are scoring goals and goalie exert are running so there's all different kinds of soccer that that these guys are playing and and some of it it's still very much rooted in the the games that they played when they would you know sort of hide from they talk about hiding from police and skipping school to play soccer and the alleys are in the fields\n[laughter] he's just a little a little bit of a media bass about the way in which soccer is structured you just gave us a hint you talking about defenders for example now you know in baseball your first baseman or second baseman that kind of thing do people have positions and soccer\nAbsolutely there's often in defense and then sort of in between those things there are midfielder then midfielder is can go and a couple of different directions there are midfielder who are very attack minded\nSo they are going to create killer plays\nAnd score and more than midfielder is who are more defense minded who are going to hang around near the box the goal you know there's the back line which loosens back line again in two thousand Fifteen only let seven goals through the net there is the goalie who is calling plays the eyes and ears of the team because he has the whole field in front of him\nUm there are the strikers who are that front line who are scoring\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nPlayed soccer as these kids began to fill the rosters I'm In the old days of Lewiston soccer it was very much what's called a direct game um which is kicking chase or or more politically called boot and scoot\nIn which you kick the ball as far as you can and everybody runs as hard as they can to get to it and then you kick it again and you're just moving the ball down the field\nThat changed because the skills that these kids who play all day every day changed it to what's called the possession game and possession soccer is really what we call the beautiful game\nIt isn't about one guy kicking it as far as he can getting it down the field you move the ball laterally horizontally backwards sometimes it's not about distance\nIt goes it's it's one or two touches right per person until the ball moves to the next person and it's fast and it's hard to defend\nAnd he's not a pirate which is something people assume about Somalia and he's not a terrorist and he's not a drug dealer he's a soccer player\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nThousand five hundred people at that state championship in November two thousand Fifteen it's the biggest crowd to assemble for soccer and Maine ever and and that means that it wasn't just the parents of the kids on the field or the friends of the kids on the field it was everybody everybody was there\nAnd show about talking about it as this we moment I think you know it's it's a quiet moment it's not a goal and it's not what have you but I I think it's I think it's the most special moment of that game\nSo I wanted to ask you about coach yeah obviously this group who show up and coaches now got to get to the plate mhm but they're playing their way and he had the old way you described ready who ends up coaching the team\nWell it's interesting because coaches coaches coaches are in charge and I think it speaks volumes as to what kind of person like McGraw is that he make some changes he makes changes and a lot of different ways\nOne of the things he realizes he has to do is listen to these kids that it isn't just him barking orders anymore he needs to hear their feedback he needs to take in what they think you know they play all the time they play in all of these different leagues so they have they have perspective on other players that he needs to listen to because they're constantly scouting\nThey are watching English Premier League all the time studying the game you know they they're constantly replicating moves that they see in the ... which is some of the funnier parts in the book when they bring them to the field\nSo he's got that he also has an assistant coaching squad that is very much part of this story his defensive coach Dan gash is someone who comes from a possession soccer background not a ... not kicking chase\nAnd they will say you know we had a lot of words about this where where ... talks about what kind of soccer he wanted to coach and McGraw is always learning he's a student and it's an amazing thing he's always teaching he's always listening he's always learning and I think it's a very special kind of coach that does that Sudan Gish has an enormous influence\nOn how to utilize the skills of this team to capitalize on what these players are bringing the other amazing component of that is a digital are her see an object of our her seat comes on as an assistant coach um he is the first\nSomali coach hired by Louis athletics\nAnd here's the son of Abdullahi ... D and ... D is really the father of soccer in the new age and Louis and he's the middle school coach so he's the guy who's priming these kids including his own sons to come to McGraw ready\nSo I'll get your bar played for ... and then comes back as an assistant coach and that's an amazing moment for this team because coach can now say something to object a bar who can yell to the kids on the field in Somali because they're talking in Somalia and Arabic on the field\nAnd that's a real weapon because then your opponents have no idea what's going on so I did Jabbar is it is an amazing addition to this team he's a he's an incredible soccer player himself he becomes the freshmen coach so he's taking you know his father of the law he coaches the eighth graders\nEighth graders come to object to a bar in the ninth grade squad and that and some of them make varsity right away um right now one of\nOne of them across great players is below her see who is I'll be Jabbar his little brother and you you have this really strong set up an McGraw understood that he he talks about you know I knew I had to go into the community I had to talk about who these guys are playing with and who these guys are playing for\nAnd I think it speaks volumes to both his head and his heart\nWho happens to how come the ... year colleges that do soccer\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu hear what you do there\nAnd I think you'd have to ask him that but Mike McGraw loves what he does make McGraw is a guy who is up before the sun without an alarm clock he loves teaching he loves coaching and he loves Lewiston and he loves main you know he's again he's someone who gets up without an alarm\nOkay so you know at the end of the movie they always show you what has happened to the various players you know later on when went on to be a Supreme Court justice when we're on to what can you tell us about what has happened to some of these players\nSo some of them like Chabot went off to college and came back that are now working in the community of the age who is\nThe top scoring soccer player in Lewiston history is currently in the middle of his freshman year at the University of Massachusetts low which is a division one soccer team so he had his first season a with low in the fall others are I think the two thousand Fifteen team graduated some fourteen seniors\nAnd I think all of them either went to community college\nCollege or they did a postgraduate Iran prep school I'm In one of the amazing things that you learn from being an athlete from being a really good athlete and being a student athlete in Lewiston really emphasizes the student athlete part you know eligibility academic eligibility citizenship eligibility are very much\nAn important part of what Jason fuller as athletic director and forces with these guys\nIt teaches discipline and it teaches you know they have goals and and these guys are out there getting it\nSoon we go to a different plays soccer is really in in New York but in the United states you think about it we got the baseball we got to put before we got the basketball and we got all these kids everybody my kids everybody else's kids goes out and played soccer how come that doesn't develop into the national sport these other sports are\nYou know [laughter] you know there's a there's a lot going on right now with the men's national team having failed to qualify for the world cup and the firing of you know your inclines been and and things like that I think that way or the United states\nGrows its players from\nYou know in terms of of programs that are in the United states is is something that needs to be re looked at bringing in players versus versus having these development programs in the United states has development programs it's just that you know I think that these kids leave either hopefully the future of of where the United states can go with this because\nYou really can't say that soccer's not popular in the United states anymore it's hundreds and hundreds of thousands of people playing every Saturday and again we're talking about tens of millions of people watching\nThe world cup if you were told me ten years ago that NBC Sports was going to have a contract with the English Premier League I Would have said you were crazy but they do and it does very well on NBC at that\nEvent also have to remember that in women's soccer the United states has been a global power since the very first women's World Cup so\nSo when people say things like well the only safe isn't very good at soccer it's like well the United states women are the best in the world and I've had a strong program for a long time and and that's often been true of Women's Sports because they don't have the\nSame professional outlets that men do so that the body of of who's on a team tends to be a little bit more elite you know the majority of of metal that we're just one in Yung Chang work on for the U.S Scott are women so I think there's a lot of things at play\nIt took a long time for American commercial television to figure out how to make a profit on a game that has no brakes soccer is is a game where you can't very easily modified to to go out for twelve minutes of commercials\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nViable after World War two so soccer is a game without brakes and\nIt's a game that if you don't really understand the intricacies\nOf it you think a lot of nothing happens for a long time because you do have games that ended in ties which drives Americans crazy they want to win or a loser and you have games that might be one to two or something like that because it's it's not necessarily about the scoring and one of the things that I always say is you know if you took American football\nAnd you took away the amount of points that you get for a touchdown and a field goal would be a very low scoring game for the most boring thing that the slow thing that it's nothing saying\nI think that people need to learn how to watch soccer because while their kids are playing it and you know it's a huge sport it just doesn't yet have the commercial cache\nOkay so now let's talk about the R word a little bit you know you got white mane and you got or were being race now you got the Somali kids coming in any reflections of tension over race\nWell yeah it just you know it's interesting because the kids will say like it's so funny and the United states I'm not black I'm Somali\nThat that like they'll talk about you know there are black friends meaning African American um so there's there's interesting sort of divisions that are that are made in terms of identity but but yes if of course there is racial divide as part of this conversation I think that's true for any community um\nAnd I think that that in Lewiston it might\nFeel more overt especially for I think Somali women who who don't necessarily have the same kind of flow into westernized dress as the men do but you know one of the I remember one of the one of the young women saying to me you know it's just\nOne of us walks down the street someone might think that there's a hundred of us\nThat it just gets magnified because of sticking out like that\nBut they don't feel like they stick out anymore and a lot of ways that said you know America had a had a pretty significant turning point in November of two thousand sixteen and in terms of what's considered polite conversation and what isn't\nAnd they feel that they absolutely feel that there is a tension there is an anxiety in this America where the president of the United states might defend a white supremacist group and they feel that", "year": "2018", "show_name": "WAMC Conversation with...", "city": "Albany", "day": "11"}