{"month": "10", "state": "GA", "station": "WNGH", "content": "You know they get up\nAnd listen I supported G. P. B. radio the Georgia Public broadcasting radio network on ... it's a minute to aid stay with us for news from NPR's minute past the hour and then classical music on performance today [noise]\nIf you recently supported gp during our fall fund drive thank you were already putting your dollars to work to bring you the programs that mattered one CPB if you didn't get a chance to donate during the drive your online contribution now will still make a difference [noise]\nPlease take a couple of minutes to go to G. P. B. dot org and click the green donate but not the top of the page thanks so much for your generous supportive G. P. B. and the service we provide every day [noise]\n[noise]\nWas Ninety seven point seven FM W G. P. B. and W. GBH the rural part of Georgia Public broadcasting radio network [noise]\n\n[noise] oh it could be happy birthday and the style of Beethoven or maybe the girl from ... in the style of Maurice rebel\nYou get the idea coming up it's our weekly musical game or a piano puzzlers\nComposer Bruce Adolf rewrite ... tune in the style of a well known classical composer will have a caller on the line today from Houston and of course you can play along at home and see if you can name the hidden to an end the composer who styled bruises mimicking\nFrom ATM American public media this his performance today I'm Fred Child\nStick around for this week's piano puzzlers and concert highlights from across the country [noise]\n\nLive from NPR News in Washington I'm ... after making landfall along the Florida Panhandle this afternoon with a hundred and fifty five mile per hour wind gusts but National Hurricane center says hurricane Michael's I has now cross into south western Georgia\nBut it's still got hurricane force winds last check the storm's winds were around a hundred miles an hour Vance viewers in Panama City Florida he says was a fight\nWestern Georgia but it's still got hurricane force winds last checked the storm's winds were around a hundred miles an hour bench bused in Panama City Florida he says was a frightening experience like a\nJet engine or I mean the when\nSuper super high pitch you could feel it in your years like the pressure just\nChanging it in and out [noise]\nThose are very more\nThan a hundred and eighty thousand customers in Florida alone are without power after Michael tore through knocking down trees and blowing out substations for the governor Rick Scott says us hurricanes go it was a doozy Michael is worse storm that the Florida Panhandle has ever seen\nOn the worst power storms to ever make landfall in the United states Florida officials say at least one man was killed by a falling pre hurricane Michael's also caused extensive flooding NPR's Rebecca Hersher reports warm water in the Gulf of Mexico helped fuel disarm\nAnd the hours before it hit the Florida Panhandle hurricane Michael gotten more and more intense it's wind speeds got higher its core got tighter and the barometric pressure inside the storm dropped lower and lower\nMy goal is the most powerful hurricane to hit the panhandle since recordkeeping began in the mid Eighteen hundreds\nHurricane Michael's increased intensity was driven by hot water in the Gulf of Mexico\nThe surface temperature and the Gulf water in the mid eighties is warmer than usual and that's part of a trend global climate change is causing our oceans to heat up and that helps fuel major hurricanes Rebecca Hersher NPR News\nPolice have arrested the operator the limo company involved in a deadly crash last weekend the kill twenty people in upstate New York he's been charged with negligent homicide incident was also bringing new attention to an old problem the limousine loophole in safety standards ... more\nNew cars and buses half meet federal safety standards but if you take a car cut in half and stretch it out to the size of the bus you don't have to prove that it meets either set of standards [laughter] those stretch limo can be dangerous in crashes because they may lack structural features such a side impact protections sometimes they're short on seatbelts\nSomeone has are safer than others but ... and the president of consumers for out of reliability and safety says it shouldn't be up to individuals to find safe limit us\nThat way no no it up to them when they think company provides safe transportation\nAnd it's up to state and local governments to enforce that in the absence of federal regulations ... and pianist\nSo off on Wall street today the doubts\nState and local governments to enforce that in the absence of federal regulations coming out I'm asking and pianist\nMajor sell off on Wall street today the Dow fell eight hundred and thirty one points to twenty five thousand five Ninety eight that's drop out three percent the NASDAQ was down three hundred and Fifteen points this is NPR\nCanada is preparing to become the second country and the largest with illegal national marijuana marketplace marijuana sales are set to begin there next week with residents able to buy the drug in retail shops were on line\nGoing to an Associated Press survey more than ... ... more marijuana stores are set to open with more outlets expected there in the future the big difference between Canada and nine us states that have legalized recreational marijuana is the involvement of the government\nMaybe of the provinces themselves will purchase pot from license growers and distributed to shops in mail order consumers Europe was the only other nation but the national marijuana market\nIn Ferguson, Missouri the police chief who's been overseeing efforts to bring that apartment in compliance with federal policing rules is stepping down actually listen to be of St Louis public radio reports sheep dollars ... joined a department in two thousand sixteen several years after the shooting death of Michael Brown to Ninety to unrest in Ferguson\nChief ... says he's leaving for personal reasons but his departure comes at a time when many in the community still believe police disproportionately target black residents a key component of a consent decree between the city and the Justice Department to reform police policies\nAnd mayor Ferguson says the city's next police chief will have to contend with federal oversight\nOf the biggest obstacle they just ask anybody can fix this child is is dealing with the federal government they're all of\nThe city will hold a national search for new chief for NPR News I'm actually listening in St Louis\nCritical features prices followed stocks lower oil was down to point four percent today to end the session at Seventy three Seventeen a barrel on the New York mercantile exchange I'm jak sphere NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and has about who pair premiering October twelve on prime video\n\nFrom eight PM\nFrom eight PM American public media this is performance today I'm Fred Child taking you to concerts around the world when you're hummus Moser takes a break from playing his cello you won't find him lounging around watching Netflix he likes to be outdoors and active\nThings to do is just going by mountain bikes go into the mountains going through major or go hiking or go to a place where I Am really unimportant\nCellist yo hunters ... from a conversation with pen to tell you the climber a hiker a runner and mountain bike or an adventurous spirit\nWell let's hear from a concert where you'll hunters Missouri and his cello took on the musical role of an adventurous spirit in the peace don't kill tech by recharge drowsy the cello represents donkey ... himself\nHere's a final section of the piece from a concert in Nashville Johan us Moser playing solo cello John Carlos Guerrero conducting the Nashville Symphony\n[noise]\nAlready okay here's Bruce Adolf with your help hustler [noise]\n[noise]\nOkay um [noise] I think the composer to me sounds like I'm the first things come to my mind was Chopin\n... good great other Hedrick Chopin yeah that does sound like the style of Chopin ... yes exactly ...\nLike me now the da\nDa da da da da da da da da da\nDi di di do recognize\nThe thing is it's not really in three for some for for the shelter\nThey recognize that but I like I Do recognize\nThe thing is it's not really in three for some for for the original to\n\nThis has the rhythm is off but the notes are I\nMean\nOne of the things that's fun for me is that this part\nIs making it feel like it belongs to shut them with the style of the original tune just got the same notes but not harmonize quite like that guy that is another spot here where it goes in in my version\nTo this emphasis on you know [noise]\n\nJust to to\nCram it and that was just sort of like a um [noise] it's just like I had found writer in a way well or a\nThat's a tricky question because a person who wrote this\nIs one of those people who jazz musicians and all this stuff it's just a composer many great standards but much more and more than that to\nDuke Ellington you know and it's a really good good choice tune the rights era but don't actually comes from something more substantial than just a song it's it\nComes from a like a like a musical maybe even bigger oh I'm I'm Matt ...\nIs is ...\n\nIt's not one of the most famous tunes from the show but as it happens to be a good one and\nUm I don't I don't know the name of the team but at least ...\nSome I'm not sure how popular this one is uh I I was obsessed with it at one point in my life it's there's a boat that's leaving soon for New York uh for me there is a plane that's leaving sing for New York but anyway ...\n\nMinutes calm me a better way I'm\nGlad I didn't I didn't I didn't I\nWell we may be a better way I\nThat I just didn't I didn't like it gave me all the right clues that I could get their ... I think I've read it\nEven though you didn't name the song\nYou name the guy who wrote the song you name the show it came from so full credit\nUh on on the moon and of course you've named the composer whose tile Bruce was mimicking right away Frederick show bad so now that we know is this tune from ah Porgy and Bess rewritten in the style of Chopin Bruce can we hear this one more time yes and I suggest people go listen to there's a book that's leaving soon for New York\nOkay\n[noise]\n\n[noise]\nThis week's piano player a George Gershwin too and there's a book that's leaving soon for New York from the show Porgy and Bess rewritten in the style of a waltz by Frederick Chopin and Richard ... I'm On the line from Houston, Texas well done you got both you've got the tune and you've got the composer Well Don\nThank you very much was fine\nRichard you mentioned at the very beginning of this ... that you're the concert master of a community orchestra there in Houston and play in a string quartet from time to time or can you name both of those groups for us\nSure Houston Symphony yet that is the community orchestra that we give about for concerts a year and that may Mike ... is the bully and string quartet B. O. L. E. A. N.\nThat's that's fantastic and so glad to hear that you've had a a lifelong love of music and now you're playing more\nB O L e a\nWell that's that's fantastic and so glad to hear that you've had a a lifelong love of music and now you're playing more than ever that's fantastic absolutely thanks a lot Richard bound from Houston, Texas when you're not calling in and playing on the air how do you hear ...\nK U H J Ninety One point seven affair great\nClassical station there in Houston Richard thank you so much for playing piano possibly this week thank you very much and Bruce I'll see you next week by ... oh\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise]\nThat that's an actual waltz by Frederick Chopin that's the sound Bruce Adolf had in mind with this week's puzzlers\nBruises on the air every week with his piano puzzlers and congratulations to this week's at home contestant eating Easterbrook from Boise idaho listen to on line to wear a sneak peak of the music\nShe named it to an end to compose there you can play at home to sign up for our email newsletter to get the piano ... sneak peak delivered every Friday or listen on the P. T. P. H. D. piano hustler preview that's on line at your classical dot org slash performance today or\n\nUp in just a moment a young challenged and the green rock that's next on eight PM performance today\n[noise]\n\n[noise] [noise]\n\n[noise]\n\nEdward Aaron ... is a fine cellist as we're about to hear from a concert in Seattle\nEdward Aaron says he remembers not only the exact moment when he was a kid and he decided he was going to play the cello but in that very same moment he decided that he was going to focus on playing his cello in small ensembles in chamber music\nErin told classical king FM that his father was a violist and we have friends over to play chamber music\nI remember the it was some very large a sort of see green road in the living room in our house in Cincinnati crawling around on that road I wanted to be in debt instruments in the corner of a chamber ensemble\nBeautiful sounds of chamber music ended the green rug deeply embedded in Edward errands memory\n\n\n\n... ... ...\n\n\n\n\n\n\n\nSo I\n... ...\n[noise]\n\n\n\nShe\n\n\n\nNo object [laughter] [noise]\n\n\n\n\n[laughter]\n\nI'm Fred Child this is performance today from eight PM American public media\nEight fifty nine and your tune to listener supported G. P. B. radio the Eighteenth station Georgia Public\nLook media\nEight eight fifty nine and your tune to listener supported G. P. B. radio the Eighteen station Georgia Public broadcasting radio network\nNPR News is coming up in two minutes and enemy as it continues\n\nThis fall we're counting on the participation of everyone who listens to cover the rising costs of programs we bring you an GB if we didn't hear from you during our fall fund drive there's still time to support the programs that make a difference in your life please take a moment now to make an online contribution good a G. P. B. dot org and click donate at the top of the page\nYour contribution at whatever level is right for you well helped cover the cost of the programs you love on cheap ...\nThank you so much for your support of Georgia Public broadcasting [noise]\nNinety seven point seven FM double your gp be and W. GBH the room portable Georgia Public broadcasting radio network [noise]\nFrom ATM American public media this is performance today I'm Fred Child [noise] one of my favorite things about hosting the show is that I learned things every day\nFor example until this concert recording arrived on our doorstep I never knew about this piece of music it's called would notes written in Nineteen forty eight by American composer William grants feel inspired by poems about the forest and rivers of the American south\nThis playful section is called whip or will shoot I didn't know that reference turns out whip or will shoes is an old American term for a particular flour and we've got some funding music and a little botany in history on the way during this hour of the tea [noise]\n\nLive from NPR News in Washington I'm ... beer Georgia's governor is declaring a state of emergency for more than two thirds of that state as agers Simone burns reports from W. A. B. E. N. Atlanta hurricane Michael had Georgia harder than officials originally anticipated\nGovernor Nathan Deal says the storm is unlike any this state has ever seen\nNot accustomed to the magnitude of the hurricane such as this getting and a direction that are just travelling and with the intensity was\nIn this state has ever seen we're not accustomed to the magnitude of\nThe hurricane such as this ... and the direction that it is traveling and with the intensity with which it will hit our state\nThat intensity punted detailed for class the federal government issue a declaration of emergency federal funds would help pay for some preparation and clean up for NPR News I'm Asian ... in Atlanta\nMeanwhile the Florida Panhandle war Michael roared ashore earlier today as a strong category for hurricane with a hundred and fifty five mile an hour wind gusts damages appear to be extensive\nIn Panama City trees are uprooted and power lines are down some homes either had their roofs torn off or split in two by falling trees around ... minutes with the American Red Cross and says they're expecting many more people to wind up in shelters and the difficult twenty four hours for search and rescue teams\nWe know that people did not evacuated so what that tells us as we have a pretty good sense of our first responders are going to be required to perform search and rescue overflowed\nOfficials say one man was killed by a fall and tree in the panhandle area nearly two hundred thousand customers in Florida alone are without power after the storm which is also caused extensive flooding\nChief justice John Roberts has referred to another circuit court Fifteen judicial misconduct complaints filed a recently against Brett cabin on the D.C court of appeals or Kavanaugh served until this past weekend and bears made it Totenberg reports that complaints all stemmed from Kavanaugh's testimony during his confirmation hearings\nThat complaints filed in the DC circuit in September in early October when Kavanaugh was still a judge on that circuit the to complaints that have been made public were brought by the Democratic coalition a political action committee and Washington the charges are that Kevin not lied and violated judicial ethics rules against partisanship\nJust who filed the remaining Thirteen complains has not been disclosed but the D.C court kicked the allegations up to chief justice Roberts for a referral to another ticket Roberts then sent them to the tenth circuit in Colorado which theoretically could now launched an investigation\nBut experts say that's highly unlikely Nina Totenberg NPR News Washington\nCosts of goods as they head down the pipeline that consumers rose slightly last month the Labor Department says it's producer price index a key wholesale inflation gauge was up to tens of percent the rise offset lower food and energy prices the agency says wholesale inflation compared to a year ago it was up to point six percent\nA major so off on Wall street today the biggest drop in eight months with all three of the major indices down within three percent the Dow fell eight hundred and thirty one points\nPoint six percent a major so off on Wall street today the biggest drop in eight months with all three of the major indices down within three percent the Dow fell eight hundred and thirty one points that as that goes down three hundred and Fifteen points this is NPR\nNew rules from the Treasury Department named controlling foreign investment in us firms have been approved the new guidelines will require foreign investors to alert a treasury inter agency committee of any deal is giving them access to key technology industries the agreement will cover twenty seven critical industries including semi conductors telecommunications and defense\nWho is the latest escalation of the ongoing trade battle between us and train them\nThe Commerce Department watchdog group says it's considering calls from Congress for an investigation into how the Trump Administration came up with plans to add a citizenship question to the twenty twenty cents as NPR's Hansi Lo Wang reports the requests for an investigation came from Democrats and both the U.S Senate and house of representatives\nDemocratic senators Brian Schatz and Cory Booker as well as representatives Elijah Cummings and Jerry Connelly are leading the calls for an investigation of commerce secretary Wilbur Ross who oversees the census\nRecessive fight in Congress that he approved the citizenship question quote silly in response to the Justice Department request from last December but internal memos and emails show he and his staff tried to get the question on to the census months before\nThe senators also highlights Census Bureau research suggesting that asking about citizenship status could discourage non citizens from taking part in the head count the citizenship question has already spiked multiple lawsuits that are making their way to the Supreme Court until along NPR News New York to propose\nSixty nine billion dollar merger between CBS at at that has been given the green light by Justice Department regulators though with some conditions department officials say they have approved to deal with the condition that the cells it's Medicare part D prescription drug business to resolve anti monopoly issues\nI'm jak spear NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include that Jayanti and Catherine the MacArthur Foundation recognizing exceptionally creative individuals' this year's MacArthur fellows and more information are Mac found dot org and that listeners who support this NPR station\n\nFrom a PM American public media this is performance today I'm Fred Child with a daily Guided Tour of today's classical scene [noise]\nThe American public media this is performance today I'm Fred Child with a daily Guided Tour of today's classical see\nLet's hear from a third generation guitarist his grandfather was named ... his father is named saline and the gentleman were about to hear is so Leno\nAll members of the Romero family of guitarists or the patriarch of the clan so don't you founded the family guitar quartet last Romero's back in Nineteen sixty\nThe family's from Spain now they all live close to each other in del mar the beach community in San Diego let's hear from a concert they gave on the road in Athens, Georgia the family quartet was there ... Romero gave his performance solo the sweet Espanol ... by ...\n[noise]\nSound Leno Romero his father his uncles and his grandfather all play the guitar and they were his teachers [noise] it's all you know it was a member of the family guitar for tat most Romero's and he plays and teachers on his own as well in fact you can take guitar lessons from Selena Romero if you like from wherever you happen\nTo be via Skype details\nOn his website guitarist and teacher Leno Romero\nComing up in just a moment the elusive I\nYou are listening to a PM performance today\n\nMind there that are doing me for music to refresh are still in the\n\nIf you recently supported GB during our fall fund drive thank you were already putting your dollars to work to bring you the programs that\nMattered once you ... if you didn't get a chance to donate during the drive your online contribution now will still make a difference [noise] please take a couple of minutes to go to G. P. B. dot org and click the green donate but not the top of the page thanks so much for your generous supportive G. P. B. and the service we provide every day [noise]\nDonate but at the top of the page thanks so much for your generous supportive G. P. B. and the service we provide every day [noise]\nWe're about to hear the oboe quartets by Mozart all the old bowl has evolved in an awful lot since ... wrote this back in Seventy and eighty one in those days the oboe was still relatively primitive in some ways more like a simple recorder than the elbow that we know today\nWell that didn't stop Mozart from pushing the limits of the ... and the old boys she wrote a piece calling for the old boys to play a very high note Hi s several times including the all important last note of the peace [noise]\nThat was kind of a high wire act in Seventeen anyone before Mozart no composer had dared to ask an old boys to go up that high\nWell now almost two hundred and forty years later the ... it was a lot more sophisticated unreliable that high F is considered standard for a good player so the circus element to the piece is no longer there now it's all about beauty let's hear James Austin Smith playing the elbow\nIncluding all those high asked the although quartet by Mozart\n\n\n\nTherefore movements in the piece beginning with a section called singing river this is what notes by William grant still\n[noise]\n\n\n[noise] [noise] ... and\n\n\n\n\n\n\n\n\n\n", "show_name": "Performance Today", "year": "2018", "city": "Chatsworth", "day": "11"}