{"month": "10", "state": "GA", "station": "WNGH", "content": "Yeah and capturing the MacArthur Foundation at max found dot org\n\nGood evening you're listening to listener supported G. P. B. radio the Eighteenth station Georgia Public broadcasting radio network I'm Sarah das huh we enter the classical music portion of the evening now starting with performance today [noise]\nIf you recently supported gp during our fall fund drive thank you were already putting your dollars to work to bring you the programs that mattered one CPB if you didn't get a chance to donate during the drive your online contribution now will still make a difference [noise]\nPlease take a couple of minutes to go to G. P. B. dot org and click the green donate but not the top of the page thanks so much for your generous supportive G. P. B. and the service we provide every day [noise]\n[noise]\nOf Ninety seven point seven FM WG P. B. S. W. A. G. P. H. D. Rome portable Georgia Public broadcasting radio network [noise]\n\nRobert Schumann wrote this set of four lovely short pieces and they called them fairy tales but clarinet is Greg ... says ... left no clues about which fairy tales he might have had in mind\nThese foreigners are sort of a moving so each one has its own little character but\nIf you wanted to kind of create your own fairy tale\nFrom eight PM American public media this is performance today I'm Fred Child coming up once upon a time\nEver after four fairy tales by Robert Schumann from a special PTA events at the grand ... music festival in Jackson Hole Wyoming\n\n\nLive from NPR News in Washington I'm ... one of the top us diplomats is stepping down NPR's Scott Horsley reports you an ambassador Nikki Haley's now she'll be leaving her post by year's end to these announcement called the international community by surprise although President Trump says it's been the works for months\nHey we offered no specific explanation for the move except to say she needs a break after six years as governor of South Carolina\nThere's been Trump's as it's been the works for months Haley offered no specific explanation for the move except to say she needs a break after six years as governor of South Carolina and nearly to represent us before the United nations\nAnd unbelievers handling I think you have to be enough to know when you found in someone else to be the task\nTrump praised Haley's work at the un and said he hopes she'll return to the administration in some other capacity he said there are many good candidates to fill the un physician and suggested he might name a successor for Haley and as little as two weeks Scott Horsley NPR News the White House\nPresident Trump says plans are being made for his second summit with North Korean leader Kim Jong own he was briefed today by secretary of state just back from ... young as NPR's Michele Kelemen reports\nSecretary of state Mike Pompeo daily sounding upbeat about what he calls the real progress he's making in talks with North Korea he's just back from his fourth trip there in less than a year\nWe can now see a path to wear wall achieve a hold of a goal which the full vital verify denuclearization from where\nI Want to thank him for the time that I got to spend with him where he got to talk about all the range of issues there in front of our two countries that will let us get their\n... says he expects to announce in short order when and where Kim Jong un and President Trump will meet again on their spokesperson wouldn't say what the us hopes to get out of a second summit Michele ... NPR News the state department\nWith hurricane Michael rapidly gaining strength of their parents to set its sights on the Florida Panhandle authorities are urging those in the storm's path to get out now Michael is a category three hurricane with a hundred and twenty miles an hour winds it's expected to get stronger before making landfall tomorrow\nOr Blake is a hurricane specialist at the national Hurricane Center in Miami he says it's a dangerous storm of the potential to cause death and injury\nMost people are in hurricane guy from the effects of the water and so we're extremely concerned about the storm surge or ... feet above ground level is very significant\nAt least twelve thousand people along the panhandle in order to clear out immediately as hurricane Michael begins to pick up steam\nPresident Trump is reiterating his threat to impose tariffs on it additional two hundred and sixty seven billion dollars worth of Chinese imports\nMoving in addition to recent levees imposed by the U.S is an ongoing trade battle with China and amounts to virtually all Chinese goods coming to us being slapped with tariffs speaking to reporters today Trump accused China of not being ready to reach a deal on trade and knowing that a couple of meetings with the country have actually been cancelled\nAnd makes clothes on Wall street today the Dow dropped\nThere's today Trump accused China of not being ready to reach a deal on trade and knowing that a couple of meetings with the country have actually been cancelled and makes clothes on Wall street today the Dow dropped fifty six points to twenty six thousand for thirty the NASDAQ closed up two points today you're listening to NPR\nWhile U.S Supreme court justice Brett Kavanaugh was hearing his first arguments today in Washington Republican Senator Susan Collins was dealing with blowback from her vote to confirm in Maine Public Radio's nor flirted reports college has yet to say whether she'll run again\nThe online fundraising campaign to support Collins potential opponent if she runs for re election in twenty twenty has now topped three million dollars but speaking to Maine Public radio calling stood behind her decision and said she did understand have it on his anger in his final appearance before the Senate Judiciary committee\nThis was a lady who stayed at kids have clay I Believe he reacted as an individual let's play to the breaking point\nShe said she did feel he'd gone too far with some of his comments and was glad he later apologized for some of them over the weekend protesters gathered at senator Collins home and her offices in Maine for NPR News I'm north ... in Portland Maine\nOne of the nation's oldest coal companies is filed for bankruptcy Englewood, Colorado based Westmoreland coal company filed chapter eleven bankruptcy today mid mounting debt and declining world demand for fossil fuels\nCompany officials say the filing in the U.S bankruptcy court is part of an agreement with unnamed lenders for the moment the company expects no disruption and operations or stop productions incorporated in Pennsylvania in the mid Eighteen hundreds of ... and a half a dozen us states a coal fired power plant in North Carolina [noise]\nCritical futures prizes regained a bit of lost ground today oil was up nine tenths of a percent to end the session at Seventy four Ninety four barrel in New York\nI'm jak spear NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the law firm Cooley L L P with offices and the U.S Europe and China Cooley advises entrepreneur as investors financial institutions and established companies around the world where innovation made the law\nOr [noise] ooh\nFrom a PM American public media this his performance today I'm Fred Child it taking you to concerts around the world and actually this\nFrom a PM American public media seems performance today I'm Fred Child taking you to concerts around the world\nAnd actually this at our we've got concerts on the way from around the American scene from Houston and from the Grand Teton festival and let's drop in right now on the small town of ... around topped Texas\nRound top has a population of less than a hundred but even so they have year round concerts and every summer the round top international festival Institute six weeks of intense of music making for talented young musicians from all across the globe\nKnow festival that's kind of in the middle of nowhere might seem a little counter intuitive or maybe even an appealing for some but conductor Perry So says the remote location is actually amazing\nOne of my favorite things here is the ... in which we have nothing to do what to think about music and to make music together\nConductor Perry So from a phone conversation with Houston Public radio\nNo distractions around top they just focused won a hundred percent on music here's Perry So conducting the on distracted students of the Texas festival orchestra they're playing lump Perry ballet music by French composer Paul do car\n[noise]\n\n[noise]\n\n\nMusic was written for a ballet about one man's search for the hour of immortality the ballet was called ... and that's the music that whole ... wrote in Paris in Nineteen twelve\nWe heard it from a concert at the round top festival Institute in ... Texas connector Perry So lead the ...\nIn Nineteen twelve [noise] we heard it from a concert at the round top festival Institute in ... Texas connector Perry So lead the students of the Texas festival orchestra [noise] there's an\nAnnual end of summer tradition around top conductor Perry So get to take part\nHe was lounging around the pool after the final concert when a group of those talented student players came by various ... thought maybe they were going to say thank you and they did in a way one of the young musicians asked if Perry So had his phone really pulled the phone from his pocket handed it over\nAnd he was immediately picked up and tossed into the pool [noise] one of the festival traditions that round up is throwing the conductor into the pool I Would imagine that gets different reactions from different conductors\nPerry So was it leads to a good sport about it\nComing up in just a moment the simple beauty of musical fairy tales\n\nNa\n... ... ...\n\n[noise] Mm Mm\nMm\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\nRobert ... gave those for short pieces the collective title\nFairy tale [noise] she never said if you had any particular fairy tales in mind there's just been inspired by the general idea of fantastic childlike story\nWe heard she reminds fairy tales from a concert at the grand ... music festival in Jackson Hole Wyoming\nSo that trio didn't call themselves the principal's office but they certainly could Greg reading his principal there and that's a Dallas symphony Fran ... is principal deal a lot of the Utah Symphony that whole ... is principal keyboard player for the Houston Symphony\nThree of the American musical all stars who spend the summer as members of the grand ... music festival in Wyoming\nPlayer for the Houston Symphony three of the American musical all stars who spend the summer as members of the grand ... music festival in Wyoming [noise]\nComing up in just a moment what happens when cupid accidentally shoots himself in the foot\nYou're listening to ATMs performance today\n[noise]\n\nWe know the figure of cupid as a cute baby with wings and a bow and arrow in of cupid fires and narrow that finds you well you fall madly in love\nThe character of Cuban goes back way before greeting cards two thousand years ago in Roman mythology Cuba was a strikingly handsome young God\nAnd yeah he had his bone marrow in the arrows made people falling off well on one occasion cupid was supposed to make a beautiful young woman head over heels for an ugly monster long story short cupid shot himself accidentally and this young God fell in love with the human woman\nIs G. P. B. the Eighteenth station Georgia Public broadcasting public radio network\n\nThis is G. P. B. the Eighteenth station Georgia Public broadcasting public radio network and Sarah asthma we'll check in with NPR News and just a couple of minutes and then the music can Kenyans on performance today\nThis fall we're counting on the participation of everyone who listens to cover the rising cost of the programs we bring you an GB if we didn't hear from you during our fall fund drive there still time to support the programs that make a difference in your life\nPlease take a moment now to make an online contribution good a G. P. B. dot org and click donate at the top of the page your contribution at whatever\nLevel is right for you will help cover the cost of the programs you love on CPB thank you so much for your support of Georgia Public broadcasting [noise]\nNinety seven point seven FM W. A. G. P. B. and W. GBH the rural part of Georgia Public broadcasting radio network [noise]\nThis is a piano concerto number three by Beethoven Kenneth ... has been playing this pace since he was a teenager which means he's been working on this for more than four decades now and ... says death as it should be an artist work is never done\nYou know I always think about performing you know it's the final product just always working perverse [noise]\nFrom a PM American public media this is performance today I'm Fred Child coming up a glorious work in progress yeah seem bronze for men at the piano John Carlos Guerrero conducting the Nashville Symphony in concert in Nashville the piano concerto number three by Beethoven [noise]\n\n\nFrom NPR News in Washington I'm jak spear word from us in bastards you the United nations Nikki Haley that she'll be stepping down and years and un secretary general Antonio ... terrorists is expressing deep appreciation for her work\nSitting beside President Trump in the oval office today Haley called her Eighteen months on the job the honor of a lifetime the forty six year old Haley gave no reason for stepping down from the resignation letter to the years in public service in a need for a train\nMuch on the job the honor of a lifetime the forty six year old Haley gave no reason for stepping down from the resignation letter to the years in public service and the need for a change\nI haven't given everything has got the last eight years and I did they\nHave other people who like that same energy and power and\nFormer South Carolina Governor and the daughter of Indian immigrants Haley has the highest profile woman in the Trump cabinet Eli has been seen as a possible presidential contender though she made it clear today she is not running in twenty twenty\nHurricane Michael is gaining strength in the Gulf of Mexico Michael is now a category three hurricane NPR's Debbie Elliott reports on his path to make landfall in the Florida Panhandle tomorrow\nFlorida governor Rick Scott says the biggest threat from hurricane Michael is a storm surge that's predicted to be eight to twelve feet high along the wide stretch of Florida's coast east of the storm's path\nThinking about this way this storm hits near Panama City the Tampa area was still see life threatening storm surge you cannot hide from storm surge so get prepared and get out if an evacuation has ordered\nCoastal evacuations are under way from the Alabama Florida State line to Florida's Big Bend area National Guard troops have been deployed to help with the response and the coast guard has closed all of the ports and the path of hurricane Michael Debbie Elliott NPR News\nThe Supreme Court welcome Brett Kavanaugh for his first day on the bench NPR's Carrie Johnson reports the high court heard arguments in two cases today\nChief justice John Roberts says he wishes Brett Kavanaugh along and happy career on the Supreme Court\nKevin has already made his presence known he asked more than ten questions during the oral arguments exchanged warm greetings with justice Elena Kagan who once hired him to teach at Harvard law school and after about two hours he shook Kagan's hand as he left the bench\nKevin O's wife actually in his two daughters attend in the morning arguments so did retire Justice Anthony Kennedy who Kavanaugh replaced on the high court\nDozens of people protested outside the Supreme Court citing sexual assault allegations Kavanaugh has denied like inside the chamber there were no disruptions Carrie Johnson NPR News Washington\nInternational Monetary fund is downgrading its outlook for global growth this year economist with the group now say they expect the global economy who expanded a three point seven percent annual rate that would be down from the groups earlier three point nine percent growth forecast [laughter] ...\nGlobal economy who expanded a three point seven percent annual rate that would be down from the groups earlier three point nine percent growth forecast mix clothes on Wall street the Dow was down fifty six points to the NASDAQ was up to this is NPR\nAuthorities in West Texas say they are still searching for for people who went missing after a flood there officials are using swift water boats Tacoma thirty five mile stretch of river looking for the individuals went missing after floodwaters overran an RV park\nThe search is taking place downstream from an RV park on the south on a river and the small city of junction about a hundred and forty miles west of Austin\nThe first African American football player drafted into the NFL has died George California was drafted by the Chicago Bears in Nineteen forty nine died last Monday the age of Ninety One more from NPR's Tom Goldman\nGeorge tell a pharaoh was a star running back for Indiana University in the Nineteen forties Chicago took tell a pharaoh in the Nineteen forty nine draft\nBut he'd already agreed to play in the rival all America football conference after that you played six years in the NFL and was named to the pro bowl three times tele Ferris said the thing is like most about football was hitting people because\nIt let them vent his frustration about discrimination he told the Indy star that in Nineteen forty seven he went to a segregated movie theater in Bloomington and took down the colored sign in the balcony\nThat I took a screwdriver with me and took his side and put it in my pocket and I've had a favorite\nBeyond football tell a pharaoh taught and worked in the administration at several universities Tom Goldman NPR News\nAfter a number of north eastern and western states have moved to legalize marijuana organizers backing legal pot now hope to get their first went in the mid West Michigan in North Dakota voters will be deciding this month with the drugs should be legal for those over the age of Twenty one this is NPR News support\nFor NPR comes from NPR stations other contributors include the Robert Wood Johnson Foundation working alongside others to build the culture of health that provides everyone in America a fair and just opportunity for health and wellbeing more at our W. J. F. dot O. R. G. [noise]\nFrom eight PM American public media this his performance today I'm Fred Child taking you to concerts around the world [noise] crazy\nFrom a PM American public media this is performance today I'm Fred Child taking you to concerts around the world [noise]\nGreat mix of music on the way this hour some Beethoven that's both poetic and powerful in the hands of piano ... and Michael Jackson medley for string quartet yes you heard that right M. J. on the way in about twenty minutes\nAnd right now some ancient errors and dances it's music from the early twentieth century by composer ... inspired by old Italian renaissance lewd music now the music is it easy on the years and really it's not the most challenging to play\nSometimes orchestras kind of sleep walk through this peace\nNot to Saint Paul chamber orchestra and especially when they teamed up recently with conductor package coups is do they really dug in they found the L A giant ... this music the ancient heirs and dances sweet number three by our Reno risky [noise]\n\nNo\nThose for tunes were actually written in Italy and the sixteen hundreds for so low loot and then turned into pieces for string workers trip by the twentieth century Italian composer that's called the ancient heirs and dances sweet number three by on a RINO rest speaking [noise]\nWe're speaking he wrote that music in Nineteen thirty two borrowing tunes from about three centuries earlier\nCruises to lead the saint\nChamber orchestra encountered in Saint Paul so that's one of the most common threads through the history of classical music composers borrowing something they love from years gone by and making it new making it fresh well coming up in just a moment we'll hear at twenty first century spin on that same idea\nOf from years gone by and making it new making it fresh well coming up in just a moment we'll hear at twenty first century spin on that same idea [noise]\nYou're listening to a PM performance today [noise]\nI can listen to music to relax without it being\nTo be slow quiet where we can help you settle down and the thought we'd have to go\nOn there as I saw settled down into a variety of music and they can connect it ... [noise]\nIf you recently supported gp during our fall fund drive thank you were already putting your dollars to work to bring you the programs that mattered once you ... if you didn't get a chance to donate during the drive your online contribution now will still make a difference [noise]\nPlease take a couple of minutes to go to G. P. B. dot org and click the green donate but not the top of the page thanks so much for your generous supportive G. P. B. and the service we provide every day [noise]\n... San Francisco plays concerts all around the world and every place they go they like to tailor music for the local audience so in court at San Francisco was planning a recent trip to China they wanted to play music their audience would be familiar with they asked they're presenting partner in China forcing gesture\nWithout missing a beat she said Michael Jackson everybody in China knows Michael Jackson's\nCorps can't San Francisco violinist Jeremy Cohen from a conversation with strings magazine Collins has left to his own devices Michael Jackson would not have been his first pick\nI mean I like to Michael Jackson and I grew up listening to the Jackson Five and everything but I wasn't like a rabbit Michael Jackson fan but I was in wanting to create an arrangement that would resonate with our audiences in China I started listening to a bunch of Michael Jackson and the more I listen to it\nThe more incredible he became to me even after\nKnowing him for all those years but listening to those recordings as I have to [noise] over and over in order to get a feeling about how to translate it for string quartet I started loving them more and more and more and\nI have two over and over in order to get a feeling about how to translate it for string quartet I started loving them more and more and more and I think you know that's also at the center court to San Francisco is that in order for us to play it we collectively have to love it\nWell let's hear medley Jeremy calling came up with six and a half minutes of music with four hit songs by the king of pop see if you can name all four\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\nOh\n\n\n\n\n\nOh\nWhat\n\n\n", "year": "2018", "show_name": "Performance Today", "city": "Chatsworth", "day": "10"}