{"month": "10", "state": "MS", "station": "WMPN", "content": "Sitting in my sleeper car and this Amtrak import company knocks on my door and he says excuse me already Gabriel I say yes and he says I'm so sorry to bother you\nOr six young men in the observation car they're about to sing and they want us to know if you joined them and so I went out and I sing with him for another hour and that is the thing that happened to me when I went out in the middle of the country after the twenty sixth presidential election [noise]\nWe've\nDone by some this pseudo nowhere\nDon by to misconstrued all the way the window and bought some let's do it all the way\nOh lord have mercy\nOn new hope and do then about\nThe most destroyed all the way I Know about those stupid on the way when no than about the most students all the way I cry or the ...\nGone by the ... the book go Jane ...\nThem and\n... really getting to the pool and the needy bad\n... dead ends and then when it came to\nGot a letter leads the\nMan who not Steve ... a man on ... lines from birth in ... making more than ... to ...\nDone by them to do it all away\nAbout ... all the way when ... you know the way the law have\nMercy on me from Boston to the door was nice ... nice and began to cry and hold them man the ...\nYou know Ryan law is\nBaby law gays law or read\nIn\nThe back but they haven't gone in ... baby ooh la de de\nDe la ... oh\nMy God he stopped that determine new around in ... bought them all the ground\nAnd in touch\nWith the palm of his hey\nLike imagine man Nick ...\nIs baby\nThose days\n\nYou know maybe they maybe who knows ... lead\nIn\nAll ... box ... just do it all the way down about ... to do away with it all done by commercial should all go away crying daughter have mercy all knees\n\n\nGas Donovan Nikki not Gabriel tainted water and\nAnd Rena wrestling with regional\nTo our house band but neither one of\nJoey Ryan and saying you believe in\n\nCenter in Lincoln, Nebraska with\nMadison Cunningham married Diana Gordon and ...\nAnd we're supported by western hotels and resorts dedicated to our powering your wellbeing while on the road which signature wellness programs designed to help me stay in control while traveling\nHow about carbon I offering data protection solution for businesses including automatic back up for servers\nHigh ability and disaster recovery and data migration\n[noise]\nAmerican public media\nOn October twenty third joined in BP and the Mississippi department of archives in history and we were\nGreeted by a miracle for people with a preview screening the dean of a new series to impede the TV\nHere from Dr Ronny Etheridge Choctaw Jay Wesley as they talk about America's first people this exclusive screening begins with the ... to ... twenty third at the museum of Mississippi history for more information visit him maybe on\nStations have been people be music radio R. W. M. A. H. Biloxi WMA ruble W. M. A. you view\nW. M. P. in Jackson W. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at MVP on line\nOrg gee\nThere's this spring\nIn mountain slows\nFrom India or music in West Virginia Public broadcasting would support provided by Bailey Glasser and by the west Virginia towards them often welcome to another mountain stage with your host Larry Gross\nIn my\nButter man that may be wrong on leave me\nAround the world is just\nIs the issue of um\n\nWell thank you very much for once again the mountain stage live performance radio for the mountain\nState of West Virginia we are at our home at the culture center theater in Charleston West Virginia and we got one heck of a show for you one of America's great guitar as one of America's greatest guitars and one of our great friends with Julio cocky is back to visit with us [noise]\nHaven't seen him in a while to see him again [noise] also\nSo a very special banned from over in Mali B. K. O. quintet from Mali will be out\nDuring our next are also [noise]\nAnd we have three very fine singer songwriters each with a very different flavor later on during the ... going to be hearing from Mr Johnny Iranian you'll also hear from Ari test\nBut just start us off a man who has been with us for a good while now we've had him on a couple of times back when he was just getting started\nAnd one of the reasons that he wasn't back since that so often 'cause he for a while I Lived in Spain and he played a lot in Europe constantly played in America too but\nHe kind of split his time now he's moved back to Nashville and made a new record on yup rock called love in the modern age\nAnd it was sponsored by the music you heard in high school back in the eighties uh bands like the blue Nile and the cure and I really like it I Love the sound of it I don't like the the words also he's brought some friends with him please welcome back\nTo the mountain states Mr Josh routes [noise]\n\n[noise] [noise] [noise]\nMm Mm Mm\nMm [noise] Mm [noise] Mm\n...\nThis was ...\nMe in the modern\nIn the modern\n\n\n\n\nSome of the great I've got a James had agree on the bass guitar here tonight [noise]\nTo stop you on the drums [noise]\n\nThese guys have been playing with me for almost Twenty years or\nIs that a lot of good times traveling around the world playing music and I'm a good company I'd like to leave you with this one is called the salt and see a I've never been to the song see I just drove by one time I got a good song title\n[noise] [noise]\nOh ...\nWell mine oh this should never be the [noise]\nOne line or a memo me\nTo nominate rule and slash like we got him at all to jump on a new\n[noise]\nThen they can\nThose da da da da da da da da da\n...\nWhy and she would not do it is really just didn't know they\nThat just to see\n[noise]\nThis is you're right there along with his friends the new one is on yep rocket is called love in the modern\nAge I Believe one of those songs from the new record he's back in the U.S now after a little stint where he was living in Spain but going back and forth a good bit he actually won\n[noise]\nMm Mm\n[noise]\n[noise] if you missed part of the mountain stage show or you just want to hear part of it again or you know somebody who lives where it's not on the radio you can hear the shows at least the last few years that the podcast section a mountain stage dot org\nEach of these broadcasts will include sounds we don't have time to sit on the radio as well as our complete finale song\nDo as a favor take a moment to subscribe raped and review the show on apple pie guests or wherever it is that you get your podcasts\nWell it's time to a welcome back a friend of ours has been making music for over Fifteen Years now come to New York city and it's been a busy Fifteen Years he's just released his ninth\nAlbum called natural he also has done some eat peas and back in two thousand eight he did a project called fifty two which he wrote a song every week and put it on the Internet\nOr every week of that year last time we saw him he was in concert are up in Morgantown with us with Judy Collins he did a record with her it was nominated for a Grammy Award they wrote some songs together and they record it together\nBut now he's a back on his own please welcome back to the mountain stage sure Ari yes [noise]\n\n\n... Mm\nMm Mm\nFrom my ...\nThe [noise]\n[noise]\n\nUh it's it's a it's a great honor to be here a plane for you guys again and playing with all these amazing artist I haven't seen Johnson a long time a huge fan of his music and and we are of course in a in thank you so much for\nThis is a song or root for my niece is by far\n[noise] you're the one and only\nDrew in your\nIs when you\nReduce it to\nMoon and entertain but my name\nIs becoming the world's bird\nSuit domain\nSees the\nThese are more we grew into bird video game\nThe motivators I'm sure\nYou're going to be a reason any of\nThere are they your phone\nA new way to bring the reader to you they don't forget about\nThe one rule that makes it all OK\nBelow the minister is going to come and go\nTo the to the man who can get it through always knew\nIt motivated ...\nYeah you're going to be around maybe you're a\n... [noise]\nI\nViews are going to be the\nThe ...\nYour going to be a really you know\nYou're going to breed\nWould be\nOn a bright alone would you need\n...\nFor\nMaria thank\nMuch [noise]\nAri [noise]\nUp in New Jersey now I'm if it already has a new one is called a natural [noise]\nIt's the one that's out now it's not really new it's been out for about a year but he has a new one coming out early in two thousand Nineteen that'll be is ten so all the fans watch for that one and if you don't know are you have a lot of GOOD Music to choose from\nIf you have questions for us we love to hear from you our email address is Larry at mountain stage dot ORG of course you can connect with us on Facebook and you can always check out\nOur social Tumblr Instagram and Twitter links to all of these things are at our website mountain stage dot org\nWe're going to in the hour with a very good friend of ours is the first time he's been on so low he's been here with his wife surely Guthrie before and along with our little Guthrie before but he's made a couple of albums since we've seen him last\nAnd the most recent one is called driving friend in on this one he got a members of dogs Taylor and Griffin\nGoldsmith with him members of will go and uh the ramblers and he's got he got some great new songs are in a nice new sound is going to do some things so low but he's also going to ask our been and some are booklets to sing with them because you get some super harmonies on this new recording please welcome\nBut the first time so low to the mountain states Mr Johnny Iranian\n[noise] thank you [noise]\nHere's one off the new record I'm\nI'm thinking about happy anniversary the early and it's going to get cold pretty soon up in the Berkshires and you guys get a little bit of cabin fever down here as well\n[noise] [noise]\nDo bring in a\nI'm saying they\nKnees the\nDo bring\nYou'll see no", "show_name": "Thacker Mountain Radio", "year": "2018", "city": "Jackson", "day": "21"}