{"month": "10", "state": "MS", "station": "WMPN", "content": "Me too\nMe\nWith me ...\nMe [noise]\nWith me\nUm\n...\n\nMe\nMe\n[noise]\n[noise]\n\n[noise]\n[noise] one more time for Jeff sweetie [noise]\n\n[noise] forever\n[noise] oh no [noise] and that's our show\n[noise]\nWhere [noise]\nThey need to our special guest Madison Cunningham Barry Diana garden and\n[noise] our lifetime\nMy yard and meets arena with Rachel ...\nWriter Tom blah blah [noise]\nJoey Ryan and thank you for the incredible live from here in Peru and that and they\nHere tonight\nLive from here die or\nWeek for our rebroadcast from chateau saint Michel winery and Washington with Gabby Marino date he'll lie okay and bend bowl [noise]\nDo you love me they should use the money to do\nMany a man\nThey ... about when Jesus\nA main damn sure that\nAmerican public media\nHey there yes I'm Talking to you know obviously you must really be on the radio and we appreciate your support but are you a member why did you become a member of our members are\nPart of the ... by the end in Wisconsin which will be held by the lowly programs you can hear all the time it doesn't look like the bill become asleep like number today by going one eight eight eight degrees and I've been to yeah that's one eight\nEight eight three Seventy four for me to me\nThe stations have been Bebe music radio R. W. M. A. H. Biloxi WMA resemble W. M. A. you view\nThere'll be impeded in Jackson W. M. A. W. ... W and may be struck W. M. A. V. Oxford W. M. A. O. ... check out what's happening on MTV music rates\nOh in listening on line at him be be online duck or gee\nThere's this bring it in the mountains you\nIt's you know NPR Music in West Virginia Public broadcasting would support provided ... billion blaster and by the west Virginia tourism office welcome to another mountain stage would your host Larry Gross\nNone of their ... leave me\nAlone leave me\nAround the world\nThis world is round\nHow\nMuch radio state\nOf West Virginia we are at our home at the culture center theater in Charleston West Virginia with the show but I'm sure you're going to enjoy during our next hour Amanda shy ours has returned to be with us with her who then yeah\nYou got a new album and she's fantastic also a brand new bad or there's never been with us before matter of fact they're kind of new on the scene but they are dynamic you're going to hear from them I'm sure in the future the war and treaty will be out there and\nWe're also going to feature a man who's been around you depend on the show up several different times but never as a solo artist because he's never made a solo album until now I'll tell you who's been with when it comes out Mr Byron Isaac's this year and he's going to be out in just a little while [noise]\nAlso\nFavorite singer songwriter from the the real violence that's right that's the Rawlins you're halfway between Denmark in Iceland\nTighter is with us we love tighter he's been as well there's several times but never in this venue so good to have tighter when we're cool but it started out the man who's not been with us before he just made a very dynamic album\nThat it's not as first damage made quite a few albums but he lives down in Texas now out in the country and he let that whole feeling of the Texas hill country seep into this album name of that album is lifted please welcome for the first time to the mountain stage Israel Nash [noise]\n\nMm\nMm\n\n\n\nAnd\nThe chain you know\nMan\nMan\nMan\nNo\n[noise] a new one is called looks good to have you heard tunes from the brand new album that he\nRecorded down there and the whole country and its own studio it's got a studio on his place down there and I told you before that to the ambiance of the place was really great part of the record if you hear the record\nYou'll notice it's hard to notice because when they're really really discreetly but they're sounds that he went out and gathered that are also part of the uh the recordings and they're not like you know sound effects where you hear crickets or something they're all moving in there together with the the biggest ... really quite beautiful\nIsrael Nash lifted hung dirty tigers is the new one\nYou're listening to mountain stage live performance radio from the mountain state of West Virginia\nMajor funding for mountain stages provided by Bailey and Glasser L L P A nationwide law firm born in West Virginia with offices in Charleston Morgantown wheeling St Louis D.C Boston Alabama Florida and Delaware details at Bailey Glasser dot com\nAnd by the west Virginia tourism office there are places you visit and places you behold you'll find natural wonders an endless experiences in the mountain state West Virginia a place that's almost heaven more information the w._b. tourism dot com\nAdditional support is provided by hip historic Charleston West Virginia you'll find live music several nights a week in West Virginia the capital city it's music from the hip your adventures starts on line at Charleston W. B.\nDot com [noise] this is melting stage on NPR\n\n\n\n\nMm\nMm Mm\nI just can't be you\nKnow\nThe things that just to see it just seems to\nMe I'm losing yeah\n... and\nThere's nothing then on the table I think there's nothing then then the bad does nothing then you're right is it so that in my\nI'm ...\nI'm ... I'm\nAbout in the\nNo one job you know where to go who\nIt really one\nThey don't know who\n[noise]\nYou got me on the run and then you got me on the road and they got me then I just can't go to the news\n\nTo be the last year and that's what I see all night but the evenings\nFar from over [noise]\nOh you guys are in store for real treat also I don't know if anybody mentioned this but ah Israel national I go way back actually got to play with him on his first I'm not too many years ago ... Turk [noise]\nAnyway I'm real proud of him real glad to hear and plays new music and I can't wait for the rest of the show thank you all for coming out tonight [noise]\nScott seeing is believing\n\n... ... ... ... ... ... ... ...\n... ... ...\n... oh do you do\nNot know this guy is\n... in the stores that yeah you're around ...\n... ...\nHow do you know\n... ...\n... ... to the ...\nYou do this to be the\n... ... [noise]\nMy number one is the ... I Know there's so many years ...\nBetween the ...\n\nYou just don't\nSee Mm\nI've only been a few of\n'em do retreat\nIn the\nThat's when the capital so red down on me\nAnd\nI Do when\nYou ...\nKind of rabbit sees where it's just one way\nUm\nI Know what\nI did see some real\nBetween\n...\nYou know\n\nThe ...\nThe Mm\n\n\nWhat I see\nKnow being\nAble to really bring bring up the big themes man he\nMan\n[noise]\n\nMm Mm\n\n[noise]\n\n[noise]\nThe latest is disappearing man actually it's his first\nSolo release and it really is a fine record fine songs in great production arrangements you heard some of them right there\nBy ... I mentioned that he was one of the founding members of old bill and now plays with the ... years he also played with leave on him he's played with many many people over the years\nIf you missed part of this show or any of our shows over the last couple of years or if you just want to hear it again you can always visit the podcast section of our website\nEvery pod cast will include songs that we didn't have time to sit on the radio and most of the time we put on the complete finale song too if you'd like to hear the rest of that if you do is to favor we'd appreciate it if you subscribe rates in review the show wherever you get your podcasts\nWe will end this hour with a man who's been with us three times before on the mountain stage starting back when he released his first record round two thousand and three\nHe comes from the pharaoh islands that's about halfway between Norway in Iceland is part of the kingdom of Denmark and\nHe didn't much the way so much as it used to because now he's got to a family just got a a child was a child there so we're happy that he included us on this trip because he has\nA new CD called I Want to be kind and everything you're going to hear today is that CD his sons have been recorded by a seal Corinne Bailey Rae\nAnd he also met Van Dyke parks when he was on mountain stage down in Athens, Georgia if you know Van Dyke what'd fantastic musician he is yeah and he wrote\nTo tighter and said he wanted to work with them so they did a project ... in many many many more please welcome back to the mountain stage tighter [noise]", "year": "2018", "show_name": "Thacker Mountain Radio", "city": "Jackson", "day": "28"}